[
    {
        "word": "Abandon",
        "type": [],
        "definition": [
            "to'liq miqdordagi sug'urta summasini olish uchun sug‘urtalanuvchi sug'urtalangan mol-mulkdan sug‘urtalovchining foydasiga voz kechishi (sug'urtalangan kema nobud bo'lganda, u xabarsiz yo'qolganda, kema yoki yuk qaroqchilar tomonidan bosib olinganda). Abandon to'g'risidagi ariza voqea-hodisa ro‘y bergandan keyin olti oy mobaynida berilishi kerak. Ayrim chet mamlakatlar qonunchiligida abandon sug'urtalanuvchining bir tomonlama akti hisoblanadi. Faqat Angliya qonunchiligida abandon uchun sug‘urtalovchining roziligi talab etiladi. "
        ]
    },
    {
        "word": "Absolyut (Mutlaq) Afzallik Prinsipi ",
        "type": [],
        "definition": [
            "Adam Smit tomonidan ilgari surilgan g'oya bo'lib, savdo munosabatlaridagi mutlaq afzallikni anglatadi (tovarlarni ishlab chiqarishda sarf-xarajatlarning ustunligi hal qiluvchi hisoblanadi). "
        ]
    },
    {
        "word": "Absolyut (Mutlaq) Ustunlik ",
        "type": [],
        "definition": [
            "bir mamlakatning boshqa mamlakatga nisbatan o‘z mahsulotlarini samaraliroq qilib ishlab chiqara oladigan holat. Masalan, jo'g'rofiy joylashishi va ob-havo sharoitiga kora Marokashda mandarinni AQShdagiga nisbatan arzon yetishtirish mumkin. AQShda esa kompyuterlami arzon ishlab chiqarish imkoni bor. Demak, mandarin yetishtirishda Marokash, kompyuter ishlab chiqarishda AQSh mutlaq ustunlikka ega. Shu sababli AQSh mandarinni Marokashdan, Marokash esa kompyuterlami AQShdan sotib olishi mumkin. Natijada ular bu mahsulotlarni o'zlarida ishlab chiqarishga qaraganda ko'proq foyda ko'radilar. "
        ]
    },
    {
        "word": "Absolyut Renta ",
        "type": [],
        "definition": [
            "yerning sifati qanday bo'lishidan qat’i nazar, undan foydalanganlik uchun to'lanadigan ijara haqi. "
        ]
    },
    {
        "word": "Abstraksiya",
        "type": [],
        "definition": [
            " iqtisodiyot nazariyasining asosiy tadqiqot uslubi. U ko'pincha soxta tasawur berib, yuzaga chiquvchi iqtisodiy hodisalarning tub mohiyati va yo'nalishini ochish uchun turli-tuman murakkab hodisalar orasidan eng asosiysini sof holda ajratib oladi hamda tadqiqotni qiyinlashtiruvchi, ikkinchi darajalilarini yo‘q deb faraz qilishni anglatadi. Dmiy abstraksiya uslubi yordamida iqtisodiy hodisalarning mohiyatini tushunib olish hamda uni yanada chuqurroq ifoda etuvchi tushuncha va qonunlami shakllantirish mumkin. Chunki dalillarni tartiblab, bir xulosaga kelishda abstraksiya usuli asosiy usul hisoblanadi. "
        ]
    },
    {
        "word": "Abstrakt Mehnat ",
        "type": [],
        "definition": [
            "shaklidan qat’i nazar, insonning aqliy, ruhiy, jismoniy energiyalarining birgalikdagi sarfi."
        ]
    },
    {
        "word": "Adaptatsiya",
        "type": [],
        "definition": [
            "1. Tashqi (ichki) muhitda obyektiv tarzda mavjud bo'lgan shart-sharoitlarga kishi (yoki tashkilot)ning moslashib borishi. 2. Tizimning real jarayonlarga moslashishi. "
        ]
    },
    {
        "word": "Adaptiv Kutish Nazariyasi",
        "type": [],
        "definition": [
            "ushbu nazariya tarafdorlari insonlar istiqboldagi iqtisodiy rivojlanishdagi o'zgarishlarni kutishda o'zlarining awalgi va hozirgi tajribalariga tayanadilar hamda ushbu o'zgarishlarro'yberaboshlagandaginao'zkutishlarinio'zgartiradilar deb hisoblaydilar. "
        ]
    },
    {
        "word": "Addendum ",
        "type": [],
        "definition": [
            "ilgari tuzilgan sug'urta va qayta sug'urtalash shartnomasiga tomonlarning o'zaro kelishuvi bilan qo'shimchalar kiritish. "
        ]
    },
    {
        "word": "Adjaster ",
        "type": [],
        "definition": [
            "sug'urta hodisasi ro‘y berishi munosabati bilan sug'urtalanuvchi tomonidan bildirilgan e’tirozni tartibga solishda sug'urta kompaniyasining manfaatlarini himoya etuvchi jismoniy yoki huquqiy shaxs. U sug'urtalanuvchi bilan unga to‘lanadigan sug'urta qoplamasi miqdorini kelishishga harakat qiladi. Adjaster sug'urta hodisasining ro'y berish sabablarini o'rganadi va tahlil etadi. Ushbu tahlil natijalari bo'yicha sug'urta kompaniyasiga ekspert xulosasini tuzadi hamda avariya komissari funksiyasini bajaradi. Adjaster vazifasini sug'urta kompaniyasining tarkibiy bo'limi yoki ixtisoslashgan tashkilot amalga oshirishi mumkin. "
        ]
    },
    {
        "word": "Advalor Souq",
        "type": [],
        "definition": [
            "mahsulot qiymatiga nisbatan qat’iy foiz stavkasida o'rnatilgan to'lov. Inflyatsiya sharoitida o'zining funksiyalarini avtomatik ravishda saqlab qoladi. Bu soliq tarkibiga savdo soliqlari, importga nisbatan ko'pgina bojlar va boshqalar kiritilishi mumkin. "
        ]
    },
    {
        "word": "Agent",
        "type": [],
        "definition": [
            "turli kelishuvlarni tayyorlash, ayrim ishlarni bajarishda boshqa shaxs (yuridik yoki jismoniy) hisobidan va uning nomidan faoliyat ko'rsatuvchi shaxs. Savdoda savdo agenti bilan ishlab chiqarish korxonasi, firmasi yoki xususiy shaxs kelishadi va kelishuv asosida ishonch qog'oziga tayanib, faoliyat yuritadi. "
        ]
    },
    {
        "word": "Agentlik Operatsiyalari ",
        "type": [],
        "definition": [
            "bir tomonning topshirig'i bilan kelishilgan hududda ikkinchi (agent) tomon amalga oshiradigan oldi-sotdi bilan bog'liq bo'lgan amaliy va huquqiy harakatlar. "
        ]
    },
    {
        "word": "Agrar Islohotlar ",
        "type": [],
        "definition": [
            "yerlardan foydalanish tizimida davlat tadbirlari. Mamlakatlar va ulaming tumanlari iqtisodiy geografik sharoiti hamda tarixiy xususiyatlari islohotlarga katta ta’sir ko'rsatadi. "
        ]
    },
    {
        "word": "Agrar Munosabatlar ",
        "type": [],
        "definition": [
            "yerga egalik qilish, tasarruf etish, undan foydalanish va ishlab chiqarish natijalarini o'zlashtirish jarayonida vujudga keladigan munosabadar."
        ]
    },
    {
        "word": "Agrar Siyosat ",
        "type": [],
        "definition": [
            " davlatning agrar munosabatlar (qishloq xo'jaligi) sohasidagi faoliyatibo'lib, u agrar masalalar, qishloq xo'jaligi, yer mulkchiligi va hokazolarni rivojlantirish yo'llari haqidagi masalalami hal qilishga qaratilgan iqtisodiy siyosatning bir turi. "
        ]
    },
    {
        "word": "Agrarsanoat Majmuasi ",
        "type": [],
        "definition": [
            "qishloq xo'jalik mahsulotlarini ishlab chiqarish (yetishtirish), taqsimlash, qayta ishlash va iste’mol qilish bo'yicha o'zaro iqtisodiy munosabatlar bilan bog'liq xalq xo'jaligi tarmoqlari yig'indisi. Qishloq xo'jaligi, sanoat va qayta ishlash sanoatini o'z ichiga oladi."
        ]
    },
    {
        "word": "Agregirlash",
        "type": [],
        "definition": [
            " alohida birliklar yoki ma’lumotlarni bitta ko'rsatkichga birlashtirish. Masalan, bozor iqtisodiyotida qog'oz va tanga pullar, chekli qo'yilmalar, kredit kartochkalari, muddatli yirik qo'yilmalar va shu kabilar mavjud. Agregirlash natijasida ular guruhlarga ajratilgan, ular pul agregatlari deyiladi (qarang, pul agregatlari). "
        ]
    },
    {
        "word": "Agrobiznes",
        "type": [],
        "definition": [
            "qishloq xo'jaligidagi biznes. Keng ma’noda, bunga qishloq xo'jaligi bilan shug'ullanuvchi biznes turlari kiradi. "
        ]
    },
    {
        "word": "Agrofirma",
        "type": [],
        "definition": [
            "muayyan turdagi qishloq xo'jaligi mahsulotini yetishtirish va uni sanoat asosida qayta ishlaydigan korxona. "
        ]
    },
    {
        "word": "Agrosanoat Banki ",
        "type": [],
        "definition": [
            " o' z mijozlarining topshiriqlariga ko‘ra, agrar sohaning bozortuzilmalarinimoliyalashhamdaulargaqarzberishnitaminlash maqsadida tashkil etilgan Respublika aksiyadorlik-tijorat banki. U tugatilib, uning negizida “Paxtabank” “G'allabank” va boshqa ixtisoslashgan banklar tuzildi. "
        ]
    },
    {
        "word": "Agrosanoat Integratsiyasi ",
        "type": [],
        "definition": [
            "qishloq xo'jaligi bilan unga xizmat qiluvchi va mahsulotni istemolchiga yetkazib beruvchi tutash tarmoqlar o'rtasida ishlab chiqarish aloqalarining rivojlanishi hamda ularning uzviy birikish jarayonidir. "
        ]
    },
    {
        "word": "Agrosanoat Majmuy1 (Asm) ",
        "type": [],
        "definition": [
            "qishloq xo'jalik mahsulotlarini yetishtirish, ularni saqlash, qayta ishlash va iste’molchilarga yetkazib berish bilan shug'ullanuvchi tarmoqlarning jami bo'lib, asosan, to'rt sohani o'z ichiga oladi. Birinchi soha - qishloq xo'jaligiga ishlab chiqarish vositalarini yetkazib beradigan sanoat tarmoqlari, shuningdek, qishloqxo'jaligidagiishlab chiqarishgatexnikaxizmatini ko'rsatadigan tarmoqlar. Ikkinchi soha - qishloq xo'jaligining o'zi. Uchinchi soha - qishloq xo'jaligi mahsulotlarini iste’molchilarga yetkazib berishni ta’minlaydigan (tayyorlash, qayta ishlash, saqlash, tashish, sotish) tarmoqlar. To'rtinchi soha - agrosanoat majmuyi tarkibida mahsulot ishlab chiqarish hamda kishilaming hayoti va faoliyatining umumiy sharoitlarini ta’minlaydigan infrastrukturalar."
        ]
    },
    {
        "word": "Agrosanoat Birlashmalari ",
        "type": [],
        "definition": [
            " qishloq xo'jaligi, sanoat tarmoqlari, qishloq xo'jaligiga xizmat ko'rsatuvchi va tijorat ishlari bilan shug'ullanuvchi korxonalar yig'indisi. "
        ]
    },
    {
        "word": "Agrobank Aksiyadorlik Tijorat Banki ",
        "type": [],
        "definition": [
            "iqtisodiyotning agrar sektorini yanada barqaror rivojlantirish, qishloq xo'jaligida iqtisodiy islohotlami izchillik bilan chuqurlashtirib borish, fermerlik harakatini qo'llab-quwatlash, uning moddiy va moliyaviy bazasini mustahkamlash, qishloq xo'jalik ishlab chiqaruvchilariga qishloq xo'jalik mahsulotlarini chuqur qayta ishlovchi zamonaviy korxonalarni jadal barpo etish, yuqori sifatli, raqobatbardosh mahsulotlarni ishlab chiqarish bo'yicha zamonaviy texnologiyalar va uskunalarni tatbiq qilish hamda ichki bozorni mahalliy oziq- ovqat tovarlari bilan to'ldirishga yo'naltirilgan keng turdagi bank xizmatlarini ko'rsatish maqsadida 2009-yil 30-martda O'zbekiston Respublikasi Prezidentining “Agrobank” aksiyadorliktijoratbankini tashkil etish to'g'risida’gi qarori asosida “Paxtabank” aksiyadorlik tijorat banki negizida tashkil etilgan."
        ]
    },
    {
        "word": "Ahamiyatli Baholash ",
        "type": [],
        "definition": [
            " aniq qiymatni belgilash imkoni bo'lmaganda yoki xo'jalik yurituvchi subyektga nisbatan mustaqil tashqi baholar mavjud bo'lmaganda, rahbariyat tomonidan hisoblab chiqilgan buxgalteriya hisoboti ko'rsatkichlari qiymati. Baholash qiymatiga rezervlar, fondlar va buxgalteriya hisobotining tartibga soluvchi moddalari kiradi. "
        ]
    },
    {
        "word": "Ahamiyatlilik",
        "type": [],
        "definition": [
            "potensial hamkorning qarorlariga ta’sir qiladigan va qilish mumkin bo'lgan xo'jalik yurituvchi subyekt xo'jalik faoliyatining mulkdor o'lchovi yoki sifat bahosi. "
        ]
    },
    {
        "word": "Aholi",
        "type": [],
        "definition": [
            "o'zining hayotiy faoliyatini ma’lum ijtimoiy va hududiy jamoalar doirasida amalga oshirayotgan insonlar guruhi. "
        ]
    },
    {
        "word": "Aholi Daromadlari ",
        "type": [],
        "definition": [
            "aholining ma’lum vaqt davomida pul va natura shaklida olgan daromadlari miqdoridan iborat. Aholi daromadlariga ish haqi, tadbirkor daromadi, pensiya, nafaqa, stipendiya, kapitaldan olinadigan foyda, puldan olingan foiz, dividend, renta, ko'chmas mulk,qishloqxo'jalikmahsulotlarivahunarmandchilikbuyumlarini sotish hamda har xil xizmatlar ko'rsatishdan olingan daromadlar. "
        ]
    },
    {
        "word": "Aholi Migratsiyasi ",
        "type": [],
        "definition": [
            " lotinchada (migratio) ko'chish, ko'chirish ma’nosini anglatadi. Turar joyi o'zgarishi bilan yakunlanadigan aholining hududiy harakati. "
        ]
    },
    {
        "word": "Aholi Takror Paydo Boʻli Shining Brutto Koeffitsenti ",
        "type": [],
        "definition": [
            "bir ayolning butun umri davomida tuqqan o'rtacha qiz bolalar soni. Uni aniqlash uchun umumiy tug'ilish koeffitsenti 0,49 (barcha tug'ilganlar tarkibida qiz bolalar salmog'i)ga ko'paytiriladi."
        ]
    },
    {
        "word": "Aholi Zichligi ",
        "type": [],
        "definition": [
            "muayyan hududda aholining joylashuv darajasi. Mamlakat aholi sonini shu joy maydoniga (odatda, 1 km.ga) taqsimlash bilan hisoblanadi. "
        ]
    },
    {
        "word": "Aholiga Transfertlar ",
        "type": [],
        "definition": [
            "aholiga to'lanadigan majburiy to'lanmalar (mamlakat qonunchiligiga muvofiq ravishda o'rnatilgan pensiyalar, stipendiyalar, nafaqalar,komp ensatsionvaboshqa ijtimoiy to'lovlar) ni moliyalashtirish uchun mo'ljallangan budjet mablag'lari. "
        ]
    },
    {
        "word": "Aholini Ijtimoiy Himoyalash",
        "type": [],
        "definition": [
            "aholini bozori iqtisodiyotining salbiy ijtimoiy-iqtisodiy oqibatlaridan asrash, shu oqibatlarning aholi ahvoliga tasirini yumshatishdir. Aholining eng kam daromadga ega bo'lgan tabaqalari, ya’ni eng qiyin ahvolga tushib qolgan odamlarga amaliy yordam ко‘rsatish ijtimoiy himoyalash tizimining asosiy yo'nalishi hisoblanadi. Shu maqsadda pensiyalar, nafaqalar, stipendiyalar va ish haqining miqdori ancha oshiriladi. Vaqtincha ish bilan ta’minlanmagan shaxslarga ijtimoiy madad berishga katta e’tibor qaratilib, ularga maxsus nafaqa to'lanadi, ulami qayta о‘qitish va yangi kasblarga o'rgatish tashkil etiladi. Bozor munosabatlarini shakllantirishning yangi bosqichida ham aholining ijtimoiy jihatdan eng muhtoj tabaqalari va guruhlarini qo'llab-quwatlash awalgidek ijtimoiy siyosatning ustuvor yo'nalishi bo'lib qolaveradi. "
        ]
    },
    {
        "word": "Aholini Ish Bilan Taʼminlash ",
        "type": [],
        "definition": [
            "fuqarolarning ehtiyojini qondirish bilan bog'liq bo lgan, qonunlarga zid bo'lmagan ish haqi (mehnat daromadi) keltiradigan faoliyatdir. "
        ]
    },
    {
        "word": "Aholi Takror Paydo Bo Lishining Netto Koeffitsenti ",
        "type": [],
        "definition": [
            "butun umri mobaynida bir ayol tuqqan bolalarining o'rtacha soni. Ular onasi tuqqan vaqtidagi yoshigacha yashaganlar. "
        ]
    },
    {
        "word": "Aholining Mexanik Oʻsishi (Kamayishi) ",
        "type": [],
        "definition": [
            "yil davomida ko chib kelganlar va ko'chib ketganlar o'rtasidagi farq."
        ]
    },
    {
        "word": "Aholining Milliy Tarkibi ",
        "type": [],
        "definition": [
            "muayyan hudud yoki mamlakatda yashovchi aholining millatlar bo'yicha tarkibi"
        ]
    },
    {
        "word": "Aholining Minimal Isteʼmol Budjeti ",
        "type": [],
        "definition": [
            "har bir oila a’zosining ish kuchini qayta tiklashi uchun zarur mablag' miqdori. Bunda zarur iste’mol mollarining, xizmatning miqdori va sifati e’tiborga olinadi va oilaning har bir a’zosiga pul birligida hisoblanadi. "
        ]
    },
    {
        "word": "Aholining Pul Daromadlari ",
        "type": [],
        "definition": [
            "ishchi va xizmatchilarning ish haqi jamoa xo'jaligi a’zolarining mehnat haqi, ijtimoiy va shaxsiy yordamchi xo'jaliklardan tushadigan pul va moddiy buyum shaklidagi daromadlar, ijtimoiy iste’mol fondidan to' lovlar (pensiya, nafaqa, stipendiya), zayom va lotoreyalarga yutuqlar, aksiyasi uchun olgan dividendi, jamg'arma bankiga qo'ygan omonatlaridan keladigan foizlar, sug'urta tushumlari va boshqa manbalardan hosil bo'ladigan hamda pul shaklida mehnatkashlar qo'liga tegadigan daromad va tushumlardir. Aholi pul daromadlarining asosiy manbayi ish haqidir. "
        ]
    },
    {
        "word": "Aholining Real Daromadlari ",
        "type": [],
        "definition": [
            "narx darajasi o'zgarishini hisobga olib, aholi ixtiyoridabo'lgan daromadga sotib olish mumkin bo'lgan tovar va xizmatlar miqdori, ya’ni aholining ixtiyorida bo'lgan daromadning xarid quwati. "
        ]
    },
    {
        "word": "Aholining Tabiiy Oʻsishi (Kamayishi) ",
        "type": [],
        "definition": [
            "yil davomida tug'ilganlar va yil davomida o'lganlar o'rtasidagi farq. "
        ]
    },
    {
        "word": "Aholining Xarid Qobiliyati ",
        "type": [],
        "definition": [
            "aholining bozordagi vujudga kelgan narx asosida mollarni, xizmatni xarid qilish imkoniyati. Aholining xarid qobiliyati bozor sig'imini belgilashda yetakchi o'rin egallaydi. "
        ]
    },
    {
        "word": "Ajiotaj Talab ",
        "type": [],
        "definition": [
            "bozordagi shov-shuv va vahima ta’siri ostida sun’iy paydo bo'ladigan hamda shiddat bilan ortib boradigan talab. Ajiotaj talab odatdagi normal holatga nisbatan ortiq talab hisoblanadi. Bunday talab bir tomondan, aholi orasida mish-mishlar tarqatish va reklama vositasida muayyan tovarlarga o'ta ortiqcha baho berish orqali iste’molchi psixologiyasiga ta’sir etish yo'li bilan, ikkinchi tomondan, tovarlarga bo'lgan g'oyat katta qiziqish, qimmatchilik, qahatchilik, har xil shov-shuvlar ta’sirida puldan tezroq qutulish va tovar zaxirasini ko'paytirishga intilish oqibatida yuzaga keladi. "
        ]
    },
    {
        "word": "Akkreditatsiya Toʻgʻrisida Guvohnoma ",
        "type": [],
        "definition": [
            "Markaziy Bankning Vakolatxona akkreditatsiyalangani va ro'yxatdan o'tganini tasdiqlovchi yozma hujjat. "
        ]
    },
    {
        "word": "Akkreditiv",
        "type": [],
        "definition": [
            "(lot. accredo - ishonaman) - l) naqd pulsiz hisob-kitoblar olib boriladigan bank hisob varag'i; 2) tomonlar o'rtasida tuzilgan shartnomaga ko'ra amalga oshiriladigan o'zaro hisob-kitob turi. Unda qarz beruvchi (kreditor) o'ziga tegishli to'lovlarni akkreditiv topshirig'ida ko'zda tutilgan shartlar va muddatlarda tegishli bank orqali olib turadi; 3) nomiga yozib berilgan shaxsga kredit muassasasidan ko'rsatilgan summani olish huquqini tasdiqlovchi qimmatbaho qog oz. Bundan tashqari akkreditivlar turli shaharlarda joylashgan korxonalarning mulkiy munosabatlarida (jo'natilgan mahsulodar uchun tovar-transport hujjatlari asosida haq to'lash), xalqaro hisob-kitoblarda (ayniqsa, mamlakatlararo eksport-import munosabatlarida) keng qo'llaniladi."
        ]
    },
    {
        "word": "Akselerator",
        "type": [],
        "definition": [
            " 1. Sofinvestitsiyalar darajasi bilan yalpi ichki mahsulot (milliy daromad)ning o'sish sur’atlari o'rtasidagi bog'liqlikni ifodalovchi iqtisodiy ко‘rsatkich. 2. Multiplikatorga teskari bo'lgan koeffitsient bo'lib, milliy daromad o'sishining investitsiya o'suviga tasirini ko'rsatadi (neokeynschilar qo'llagan). "
        ]
    },
    {
        "word": "Akselerator Qoidasi ",
        "type": [],
        "definition": [
            "daromadning o'sishi (kamayishi) investitsiyalar o'sishi (kamayishi)ga olib keladi, bu o'zgarish daromadlarning o'zgarishiga proporsional bo'ladi. Masalan, aholi daromadlarining o'sishi uning bir qismini jamg'arishga imkon beradi. Bu esa vaqtincha bo'sh pullarni banklar kredit berish orqali investitsion faollikni oshirishga imkon beradi. Yoki korxonalarning foyda miqdori oshishi, ularga ishlab chiqarishni rivojlantirishga ko'proq mablag' ajratishga sharoit yaratadi. "
        ]
    },
    {
        "word": "Aksept ",
        "type": [],
        "definition": [
            "(lot. acceptus - rozilikberilgan) - l) pul, hisob-kit ob, tovar hujjatlarini yoki tovar haqini to'lashga rozilik berish yoki to'lashga kafillik; 2) taklif etilgan shartlarda shartnoma tuzishga rozilik. Aksept yetkazib berilgan tovarlar ichki va xalqaro tovar-pul muomalasida ko'rsatiladigan xizmat uchun haq to‘lash shakllaridan biri sifatida keng qo'llaniladi; 3) veksel, chek va boshqa qimmatbaho qog'ozlar, shuningdek, tovar hujjatlari bo'yicha hisob-kitob qilish shakli."
        ]
    },
    {
        "word": "Akseptlash",
        "type": [],
        "definition": [
            " (lot. acceptare - qabul qilish) - to'lov hisobini qabul qilish, mol yetkazib beruvchi hisob-raqamiga to'lovni o'tkazishga rozilik berish."
        ]
    },
    {
        "word": "Aksikreatsiya",
        "type": [],
        "definition": [
            " (lot. axio - qimmat, creatio - yaratish) - kishida (yoki tashkilot miqyosida) yangicha qadriyatlar tizimini shakllantirish yoxud shu vaqtga qadar mavjud bo'lgan qadriyatlarni mohiyatan o'zgartirish, mazmunan yangilash, qayta ko'rib chiqish tizimi. "
        ]
    },
    {
        "word": "Aksioner",
        "type": [],
        "definition": [
            " aksionerlik jamiyatining aksiyalariga egalik qiluvchi jismoniy yoki yuridik shaxs. Aksiyalar turli shakllarda bo'lishi mumkin. "
        ]
    },
    {
        "word": "Aksioner Qimmatbaho Qogozlari",
        "type": [],
        "definition": [
            "bozor muomalasidagi pul hujjati bo'lib, hujjat egasining ushbu hujjatni chiqargan shaxsga nisbatan mulkiy huquqqa egaligini tasdiqlaydi. "
        ]
    },
    {
        "word": "Aksionerlik (Paychilik) Jamiyati ",
        "type": [],
        "definition": [
            "turli korxona, tashkilot, bank, kompaniya va ayrim shaxslar pul mablag'larini sherikchilik asosida va sohibkorlik maqsadida birlashtiradigan jamiyat (korxona). Muomalaga nominal qiymati ko'rsatilgan aksiyalar chiqarish va uni sotish bunday jamiyat negizini tashkil etadi."
        ]
    },
    {
        "word": "Aksionerlik Jamiyati ",
        "type": [],
        "definition": [
            "xo'jalik yuritishning tashkiliy-huquqiy shakllaridan biri. Uning kapitali aksiyalarni joylashtirish orqali shakllanadi. Aksionerlik jamiyatlari pul jamg'ar malar ining ishlab chiqarish investitsiyalariga aylanishiga imkon beradi. Aksiyalarni chiqarish kapitalni mobilizatsiya (jalb) qilishning eng samarali shakllaridan biridir. Bozor iqtisodiyoti rivojlangan mamlakatlarda bu korxonalar faoliyat ko'rsatishining asosiy tashkiliy-huquqiy shakli hisoblanadi. "
        ]
    },
    {
        "word": "Aksionerlik Jamiyatlari ",
        "type": [],
        "definition": [
            "mas’uliyati cheklangan firmalarning eng keng tarqalgan shakli bo'lib, odatda, ко‘pro q foyda olish maqsadida moddiy, mehnat va pul resurslarini birlashtirgan uyushma hisoblanadi. Aksionerlik jamiyatlari ochiq va yopiq turda bo'ladi. Ochiq turdagi aksionerlik jamiyatida aksiyalarni erkin sotib olish va sotish mumkin. Yopiq turdagi aksionerlik jamiyatida esa aksiyalar bir necha kishilar (korxonalar)ga tegishli bo'lib, bozorda erkin sotib olinishi mumkin emas. "
        ]
    },
    {
        "word": "Aksiya",
        "type": [],
        "definition": [
            "frans. “action” so'zidan olingan bo'lib, aksiyador shirkat, jamiyat chiqargan qimmatbaho qog'oz bo'lib, unga ega bo'lgan a’zoga jamiyatni boshqarishda qatnashish, foydadan ulushini olish va jamiyat tarqalib ketgan holda uning mol-mulklarini taqsimlashda qatnashish huquqini beradi. Aksiya qiymati aksiyadorlar tomonidan so‘m bilan yoki xorijiy valyutalarda to* lan is hi mumkin. Biror mulkni aksiyador jamiyat mulkiga o'tkazishi yoki uni foydalanishga berishi mumkin. Aksiyadorlar jamiyatining a’zolari aksiyalar qiymatini jamiyatga qaysi shakl va ko'rinishda to'lashlaridan qat’i nazar, u so'mda ifodalanadi. Aksiyaning eng kichik nominal qiymati 100 so‘m. Aksiyadorlarga aksiyalarining nominal qiymati summasiga teng miqdorda sertifikat berilishi mumkin. Aksiya bo'linmasdir. Agar 1 ta aksiya bir necha kishiga tegishli bo'lsa ham ularning barchasi aksiyadorlar jamiyati tomonidan 1 ta a’zo sifatida tan olinadi va o'z huquqlarini umumiy vakil orqali amalga oshirishlari mumkin. Aksiyada quyidagilar ko'rsatilgan bo'lishi lozim: aksiyadorlar jamiyatining nomi va manzili; qimmatli aksiyalarning nazorat paketi - aksiya egasiga aksiyadorlar jamiyatida amaldagi hukmronligini ta’minlaydigan aksiyalar miqdori; u aksiyadorlar jamiyatining yig'ilishlarida hal qiluvchi ovozga ega bo'lish huquqini beradi. Aksiyalarning nazorat paketiga egalik qilish amalda aksiyadorlar jamiyatida hukmronlikni ta’minlaydi. Bozor iqtisodiyotiga o'tish bilan davlat ham yirik tashkilotlar aksiyalarining nazorat paketiga ega bo'lishi mumkin. "
        ]
    },
    {
        "word": "Aksiya Indekslari ",
        "type": [],
        "definition": [
            "ba’zi aksiyalar kursining o'zgarib borishini ko'rsatadigan ruhiyat. Masalan, Dou-Djons indeksi; Nikkey indeksi (Tokiyo birjasi); DAX-30 indeksi (Frankfurt fond birjasi) va boshqalar."
        ]
    },
    {
        "word": "Aksiya Kursi ",
        "type": [],
        "definition": [
            "aksiyaning fond birjasida sotiladigan bahosi. Aksiya kursi muayyan aksiya keltiradigan dividendning - daromadning ssuda prosentiga nisbati asosida belgilanadi. "
        ]
    },
    {
        "word": "Aksiya Nazorat Paketi ",
        "type": [],
        "definition": [
            "aksiya egasiga aksionerlik jamiyatida hukmronlikni ta’minlaydigan aksiya miqdori; chiqarilgan aksiyalarning umumiy summasida bir shaxs, kompaniya yoki davlatning yirik hissasi. Aksionerlik jamiyatining yig'ilishida hal qiluvchi ovozga ega bo'lish huquqini beradi. "
        ]
    },
    {
        "word": "Aksiya Paketi ",
        "type": [],
        "definition": [
            " sotib olingan aksiyalar miqdori. "
        ]
    },
    {
        "word": "Aksiya, Obligatsiya Vaboshqa Qimmatli Qogʻozlar Kursi ",
        "type": [],
        "definition": [
            "aksiya, obligatsiya va boshqa qimmatli qog'ozlarning fond birjasidagi bahosi. Kurs dividend, foiz miqdori ga to‘g‘ri va ssuda foizining darajasiga teskari proporsional bog'liqlikda bo'ladi."
        ]
    },
    {
        "word": "Aksiyadorlik Jamiyati ",
        "type": [],
        "definition": [
            "aksiyadorlar va muassislar mablag‘i evaziga shakllangan kapitalga ega bo'lgan huquqiy shaxs maqomiga ega kompaniya. Ishlab chiqarishni tashkil qilishning mablag'larni aksiya sotish yo'li bilan jalb etishga asoslangan shakli. Aksiyadorlar jamiyati yuridik shaxs hisoblanadi. "
        ]
    },
    {
        "word": "Aksiyadorlik Kapitali ",
        "type": [],
        "definition": [
            " aksiyadorlik jamiyatining asosiy kapitali, uning hajmi Nizomda belgilab beriladi. Qarzga olingan mablag‘lar va aksiya chiqarish hisobiga shakllantiriladi. "
        ]
    },
    {
        "word": "Aksiyaning Nominal Narxi ",
        "type": [],
        "definition": [
            "aksiyaning aksionerlik jamiyati ta’sis etilganda sotilgan dastlabki narxi. "
        ]
    },
    {
        "word": "Aksiyaning Nominal Qiymati ",
        "type": [],
        "definition": [
            "hissadorlik jamiyati ta’sis etilganda yig'iladigan aksiyaning qiymati. "
        ]
    },
    {
        "word": "Aksiz",
        "type": [],
        "definition": [
            " keng iste’mol tovarlari va xizmatlaridan olinadigan egri (bilvosita) soliq turlaridan biri. Tegishli mahsulotning bahosi, xizmatning haqi yoki tarifhing tarkibiga kiritiladi. Odatda, yuqori rentabelli mahsulotlar ishlab chiqaruvchilarning yuqori foydasini budjetga olish uchun sotilayotgan mahsulotlarning sotish bahosiga davlat tomonidan o'rnatiladi. O'zbekiston Respublikasi hududida ishlab chiqarilgan va import qilingan aksiz to'lanadigan mahsulotlarga aksiz solig'i solinadi. Aksiz to'lanadigan tovarlar ishlab chiqarayotgan yoki bunday mahsulotlarni import qilayotgan yuridik va jismoniy shaxslar budjetga aksiz solig'ini to'laydi. Aksiz to'lanadigan tovarlar ro'yxati va aksiz solig'i stavkalari O'zbekiston Respublikasi Vazirlar Mahkamasi tomonidan tasdiqlanadi. Bunday tovarlar jumlasiga ichimlik spirti, aroq, likyor-aroq mahsulotlari, uzum vinosi, kon’yak, shampan vinosi, pivo, ikra, tamaki mahsulotlari, yengil va yuk avtomobillari, zeb-u ziynat buyumlari, neft va neft mahsulotlari hamda shu kabilar kiradi. O'zbekiston Respublikasida ishlab chiqarilgan aksiz to'lanadigan tovarlar uchun ularning qo'shilgan qiymat solig'i hisobga olinmagan holdagi (aksiz solig'i summasini o'z ichiga olgan) qiymati yoki mahsulotning tabiiy hajmi soliq solish obyekti hisoblanadi. Ushbu soliq davlatga shunday mahsulot ishlab chiqaruvchilar va sotuvchilar tomonidan to'lanadi hamda narxning oshirilishi bilan aholi gardaniga yuklatiladi. Sigaret, aroq, tuz, choy kabi mahsulotlar aksiz solig'i obyektidir. Masalan, sigaretning narxi 50 so'm bo'Isa, unga davlat 10 so'm aksiz solig'i soladi, natijada u 60 so'mdan sotiladi va 10 so'm davlat budjetiga daromad sifatida tushadi. "
        ]
    },
    {
        "word": "Aksiz Soligʻi ",
        "type": [],
        "definition": [
            " ishlab chiqarish korxonalarida yaratilgan yoki eksport va import qilingan ba’zi tovarlar qiymatining bir qismini majburiy budjetga to'lovdir. "
        ]
    },
    {
        "word": "Aksiz Soligʻi Obyekti ",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasi hududida ishlab chiqarilgan tovarlar, eksport va import qilingan ba’zi tovarlar oboroti. "
        ]
    },
    {
        "word": "Aksizosti Mahsulotlar",
        "type": [],
        "definition": [
            "ularga nisbatan aksizlar o'rnatilgan (belgilangan) mahsulotlar. (Qarang: Aksiz). "
        ]
    },
    {
        "word": "Akselerator",
        "type": [],
        "definition": [
            "iqtisodiyotda iste’molchilik sarf-xarajatlar hajmi o'zgarishi bilan yuzaga keladigan kapital qo'yilmalar hajmi o'zgarishini tavsif etuvchi ko'rsatkich. Akseleratsiya prinsipining mohiyati shundan iboratki, iqtisodiyotda iste’molchilik xarajatlari dinamikasi investitsiyalar hajmi dinamikasiga o'z tasirini ko'rsatadi: iste’molchilik xarajatlarining sezilarli o'sishi investitsion faollikni yuzaga keltiradi, rag'batlantiradi va aksincha. "
        ]
    },
    {
        "word": "Aktiv",
        "type": [],
        "definition": [
            "atamasi lotincha faoliyatli, amal qilish, mavjud bo'lish degan so'zlardan kelib chiqqan. Shuning uchun aktiv deganda mablag'lar qanday amal qilayotganligi va ishlayotganligini ko'rsatuvchi mablag'lar guruhlanishini tushunish kerak. Aktivlar oldingi amalga oshirilgan muammolar yoki oldin sodir bo'lgan voqealar natijasida korxonaga kelib tushgan va ular kelajakda foyda keltiradigan iqtisodiy resurslardir. Aktivlar uch xil xususiyatga ega bo'lishi kerak: a) kelajakdagi iqtisodiy nafhing o'zida mujassamlanishi, bevosita va bilvosita pul mablag'lari yoki ularning ekvivalentlarini ko'paytirish imkoniyati; b) bu iqtisodiy naflarni nazorat qilish qobiliyatini mujassamlash; v) oldingi bitimlar yoki boshqa voqealar natijasi bo'lishi. Aktiv buxgalteriya balansining bir qismi bo'lib, ma’lum bir muddatga subyekt mablag'larining tarkibi va joylanishini pul ko'rinishida aks ettiradi. Bundan tashqari, balansning passiv qismi ham mavjud bo'lib, aktiv va passiv tomonlar bo'lim va moddalardan iborat. Aktiv tomonining jami summasi passiv tomoni summasi bilan teng bo'lishi lozim. Buni shunday tushuntirish mumkinki, yani aktiv tomonidagi mablag'lar manbalari balansning passiv tomonida joylashgan. "
        ]
    },
    {
        "word": "Aktiv Kapital ",
        "type": [],
        "definition": [
            " xo'jalik yurituvchi subyektning ishlab chiqarish quwatini aks ettiradi. Ular ikkita bo'lim - asosiy va aylanma kapital ko'rinishida buxgalteriya balansi aktivlarida rasmiy taqdim etiladi. "
        ]
    },
    {
        "word": "Aktiv Pul Oboroti ",
        "type": [],
        "definition": [
            "to'lov jarayonlarida bevosita ishtirok etayotgan harakatdagi pul massasidir. "
        ]
    },
    {
        "word": "Aktiv Savdo Balansi ",
        "type": [],
        "definition": [
            "mamlakatdan chetga chiqarilayotgan tovarlar (eksport) ning mamlakatga kirib kelayotgan tovarlar (import) dan oshib ketishini xarakterlovchi savdo balansi. "
        ]
    },
    {
        "word": "Aktiv Schyotlar ",
        "type": [],
        "definition": [
            "korxona mablag'larini hisobga oladigan buxgalteriya hisobi schyotlari. Ular mavjud mablag'lar, ularning tarkibi va joylashishi to'g'risidagi ko'rsatkichlarni beradi. Aktiv schyotlarda mablag'laming ko'payishi debetda, kamayishi kreditda aks ettiriladi. Oxirgi qoldig'i faqat debetda va buxgalteriya balansining aktivida ko'rsatiladi. Quyidagi schyotlar aktiv schyotlar hisoblanadi: bino, inshootlar, mashinalar, asbob-uskunalar va boshqa asosiy vositalar (lOOO-schyotlar)ni hisobga oladigan schyotlar; pul mablag'larini hisobga oladigan schyotlar; tovar-moddiy qiymatliklarni hisobga oladigan schyotlar. "
        ]
    },
    {
        "word": "Aktiv Toʻlov Balansi ",
        "type": [],
        "definition": [
            "to'lov balansida tushumlar summasi to'lovlar summasidan ortiq bo'ladi. "
        ]
    },
    {
        "word": "Aksept",
        "type": [],
        "definition": [
            "o'tkazma vekselning to'lov kafolati majburiyatini o'z zimmasiga olish. Inglizcha “aksept” o'z mohiyatiga asosan, “qabul qilindi”, “to'layman” ma’nosini anglatadi. Aksept yozma ravishda vekselning usti tomonida amalga oshiriladi. "
        ]
    },
    {
        "word": "Akseptant ",
        "type": [],
        "definition": [
            "(qabul qiluvchi) - hisob bo'yicha to'lovni amalga oshirishga rozilik bergan korxonalar, tashkilotlar va muassasalar yoki shaxslar. "
        ]
    },
    {
        "word": "Akseptli Kredit ",
        "type": [],
        "definition": [
            "bunda bank unga mijoz tomonidan qo'yilgan o'tkaziluvchan vekselni ma’lum shart bilan akseptlashdir."
        ]
    },
    {
        "word": "Aktuar Hisob-Kitoblar ",
        "type": [],
        "definition": [
            "sug'urta tarifi stavkalarini hisoblashning iqtisodiy-matematik usullari yig'indisi. Ushbu hisob-kitoblar katta sonlar qonuniga asoslanadi. Aktuar hisob-kitoblaming metodologiyasi ehtimollar nazariyasi, demografiya qonuniyadariga asoslanadi, tarif stavkasi miqdori sug'urta hodisalari ro'y berishining ehtimoliyligiga bog'liq. Demografiya ma’lumotlaridan fuqarolarning hayotini sug'urtalashda sug'urtalanuvchilarning yoshiga mos ravishda sug'urta tarifi stavkasini tabaqalashtirishda foydalaniladi. Uzoq muddatli hayot sug'urtasi bo'yicha sug'urta summalari sug'urtalangan shaxs vafot etganda yoki u ma’lum bir yoshga etganda to'lanadi. Yetarli miqdordagi sug'urta fondini shakllantirish uchun sug'urtalovchi shartnoma amalda bo'lgan davrda qancha shaxs vafot etishi yoki ma’lum bir yoshga yetishi ehtimoliyligini bilishi zarur. Aholi o'limi darajasi haqidagi statistik ma’lumot asosida turli yoshga yetishi ehtimolligini hisoblash hamda fuqarolarning o'limi to'g'risidagi jadvalni tuzish mumkin. Bu jadval asosida nafaqa va hayotni sug'urtalash bo'yicha tarif stavkalarini hisoblash mumkin. "
        ]
    },
    {
        "word": "Aktuariy",
        "type": [],
        "definition": [
            "lotin tilidan tarjima qilganda, hisobchi degan ma’noni bildiradi. Aktuar hisob-kitoblar nazariyasini o'zlashtirib olgan sug'urta matematikasi sohasidagi mutaxassis. U sug'urta tariflarini hisoblash va metodologiyasini ishlab chiqish, uzoq muddatli sug'urta turlari bo'yicha sug'urta zaxiralarini shakllantirish bilan bog'liq hisob-kitoblarni amalga oshirish bilan shug'ullanadi. Hozirgi paytda Angliyada aktuariylar instituti faoliyat ko'rsatmoqda. Aktuariylarning xalqaro uyushmasi mavjud. "
        ]
    },
    {
        "word": "Algoritm",
        "type": [],
        "definition": [
            "qat’iy belgilangan qoidalar bo'yicha qo'llaniladigan va qo'yilgan masalaning yechimiga olib keluvchi izchil harakatlar tizimi. "
        ]
    },
    {
        "word": "Almashadigan (Konvertrlanadigan) Aksiyala",
        "type": [],
        "definition": [
            "almashadigan obligatsiyalar - uning egalariga ushbu korporatsiyaviy aksiyalariniolishhuquqinita’minlovchikorporativobligatsiyalarning alohida turi. "
        ]
    },
    {
        "word": "Almashtirish Samarasi ",
        "type": [],
        "definition": [
            "1. Arzonlashgan tovarga talab miqdorining o'zgarish ulushi. Bu hoi bir tovar o'rnini ikkinchi tovar bosganda ro'y beradi. 2. Ish haqining ortishi natijasida bo'sh vaqtning qisqarishi."
        ]
    },
    {
        "word": "Almashtirishning Chegaraviy Meʼyori ",
        "type": [],
        "definition": [
            "iste’molchi uchun foydalilik darajasini o'zgartirmasdan bir ne’matni ikkinchi iste’mol ne’mati bilan almashtirish mumkin bo'lgan nisbat. "
        ]
    },
    {
        "word": "Alohida Buyurtmalar Boʻyicha Koʻplab Ishlab Chiqarish, Kastomizatsiya ",
        "type": [],
        "definition": [
            "mahsulotlarni keng ko'lamdagi tavsif va xossalarga ega qilib, shu bilan birga, alohida buyurtmachilar talablariga javob beradigan ommalashgan ishlab chiqarishdir. "
        ]
    },
    {
        "word": "Aloqa",
        "type": [],
        "definition": [
            "boshqaruv tizimi elementlarining o'zaro hamkorligi uchun muhim elementlardan biri bo'lib, uning vositasida ushbu tuzilma uchun ma’lum munosabatlar shakllanadi. "
        ]
    },
    {
        "word": "Alternativ (Muqobil) Gipoteza ",
        "type": [],
        "definition": [
            "taqqoslanayotgan ikkita toplam ko‘rsatkichlari orasida muhim farq mavjud deb aytilgan taxmin. "
        ]
    },
    {
        "word": "Alternativ (Muqobil) Qiymat ",
        "type": [],
        "definition": [
            "boshqa tovar va xizmatlarga almashtirish uchun berilishi lozim bo'lgan tovar va xizmatlar miqdori. "
        ]
    },
    {
        "word": "Alternativ Xarajatlar ",
        "type": [],
        "definition": [
            " tanlashda voz kechilgan eng yaxshi alternativ variantdan olinadigan natija (qiymat, foyda, naflik). Alternativ qiymatga foydalanilmagan imkoniyat deb ham qarashadi: biror ne’mat qiymatining voz kechilgan boshqa bir nechta ne’mat qiymati bilan ifodalanishi. "
        ]
    },
    {
        "word": "Alternativ Xarajatlar ",
        "type": [],
        "definition": [
            "ishlab chiqarish resurslaridan foydalanish variantini tanlash bilan bog'liqxarajatlar (zararlar). Ushbu xarajatlar ishlab chiqarish resurslarini ishlatishning alternativ variantlaridan voz kechish natijasida yo'qotishlar bilan o'lchanadi. Masalan, faraz qilamizki, biror-bir shaxsning o‘z ishlab chiqaradigan dastgohi bor. Uni ishlatishning ikkita muqobil varianti mavjud. Agar uni o‘zi ishlatsa, yiliga 100 ming, ijaraga bersa, 50 ming foyda ko'radi. U ikkinchi variantni tanlaydi, natijada 50 ming (100-50=50) yoqotadi. Xuddi ana shu 50 ming alternativ xarajatlarni tashkil qiladi. "
        ]
    },
    {
        "word": "Alternativa",
        "type": [],
        "definition": [
            "bir-biriga qarama-qarshi, zid bo'lgan variantlardan birini tanlab olish zaruriyatining ifodalanishi. "
        ]
    },
    {
        "word": "Alternativ Variantlardan Tanlov ",
        "type": [],
        "definition": [
            "tanlab olingan variant alternativ variantdan voz kechish evaziga amalga oshirilishini taqozo etuvchi qaror qabul qilish zarurati. Makroiqtisodiy atamalar doirasida iqtisodiy atamalar siyosatning chora-tadbirlar ishlab chiqish jarayonida u yoki bu g'oyalarning tanlov-muammolarini belgilash uchun ishlatiladi. Masalan, ishsizlikning o'sishi va inflyatsiya jadalligi, foydaning o'sishi yoki ish haqining oshishi orasidagi tanlov muammosi. "
        ]
    },
    {
        "word": "Amortizatsiya Fondi ",
        "type": [],
        "definition": [
            "asosiy fondlarni oddiy va kengaytirilgan tarzda takror ishlab chiqarishga mo'ljallangan pul mablag'lari. "
        ]
    },
    {
        "word": "Amortizatsiya Vositalari ",
        "type": [],
        "definition": [
            "korxona asosiy fondlarini saqlash va yangilash uchun maxsus ajratiluvchi moliyaviy vositalar."
        ]
    },
    {
        "word": "Amortizatsiya",
        "type": [],
        "definition": [
            "l) eskirishning qiymatdagi ifodasi bo'lib, asosiy vosita aktivining butun xizmati davomida mahsulot ishlab chiqarish tannarxi va davr xarajatlariga qo shiladigan amortizatsiya qiymatini tizimli ko'rinishda taqsimlash; 2) asosiy fondlar qiymatini asta- sekinlik bilan ular yordamida ishlab chiqariluvchi mahsulot yoki xizmatlarga o'tkazilishi; mablag'laming maqsadli ravishda jamg'arilishi va keyinchalik eskirgan asosiy fondlarning о'mini qoplashga ishlatilishi. 1. Mashina, asbob-uskuna, bino va shu kabilarning eskirishiga qarab, ularning bahosini kamaytirib borish; ularning shu chegirilgan qiymatini ishlab chiqarilgan mahsulot tannarxiga qo'shib borish. 2. Alohida shaxs yoki tashkilotning o‘z qarzini asta-sekin, darajama-daraja to'lash majburiyatidan qutulishi; 3. Qarz majburiyatining yo‘qotilishi, o'chirilishi oqibatida uning bekor qilinganligini tan olish. "
        ]
    },
    {
        "word": "Amortizatsiya Ajratmalari ",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonida amal qiluvchi asosiy fondlar qiymatini mehnat mahsulotiga o'tkazishning pul shakli. Amortizatsiya ajratmalari mahsulotning tannarxiga kiradi. Mahsulot sotilganidan keyin tushgan mablag'ning amortizatsiya ajratmalariga teng bo'lgan qismi korxonalar hisob-kitobida pul zaxirasi sifatida jamg'ariladi va korxonalarning amortizatsiya fondini tashkil etadi. "
        ]
    },
    {
        "word": "Amortizatsiya Fondi ",
        "type": [],
        "definition": [
            " mahsulotning tannarxi tarkibiga kiritiladigan amortizatsiya ajratmalari hisobidan korxonada yaratiladigan (vujudga keltiriladigan, shakllantiriladigan) pul mablag'lari fondi. "
        ]
    },
    {
        "word": "Amortizatsiyalanadigan Qiymat ",
        "type": [],
        "definition": [
            "moliyaviy hisobotlarda faraz qilinayotgan (baholangan) tugatish qiymatini chegirgan holda ko'rsatilgan aktivning boshlang'ich (tiklash) qiymati summasi. "
        ]
    },
    {
        "word": "Amerika Opsioni ",
        "type": [],
        "definition": [
            "uning ijro etilishiga kelishilgan sanagacha va kelishilgan bo'lajak sanada istalgan vaqtda ruxsat etiladigan shartnoma."
        ]
    },
    {
        "word": "Amortizatsiya Vositalari",
        "type": [],
        "definition": [
            "korxona asosiy fondlarini saqlash va yangilash uchun maxsus ajratiluvchi moliyaviy vositalar. "
        ]
    },
    {
        "word": "Ananaviy Iqtisodiyot ",
        "type": [],
        "definition": [
            "iqtisodiy tizim. Unda ishlab chiqarish texnikasi, ayirboshlash, daromadlarni taqsimlash avloddan-avlodga o'tuvchi an analarga asoslanadi. Texnika taraqqiyoti va yangiliklarni tatbiq etish cheklangan, chunki ular ananalar bilan to'qnashib, ijtimoiy tuzilmaning barqarorligiga xavf soladi. Diniy va madaniy qadriyatlar iqtisodiy faoliyatga nisbatan birlamchi hisoblanadi. Jamiyat oldida turuvchi muammolar o'sha ananalar va urf- odatlar asosida hal etiladi. Bunday iqtisodiy tizim sust rivojlangan mamlakatlarga xosdir. "
        ]
    },
    {
        "word": "Anʼanaviy Marketing Tizimi ",
        "type": [],
        "definition": [
            "tovar tarqatish ishtirokchilarining to'la mustaqilligiga asoslangan tizim"
        ]
    },
    {
        "word": "Analitik Hisob ",
        "type": [],
        "definition": [
            " pul va zarur bo'lgan hollarda natura shaklida detallashgan ko'rsatkichlarni beruvchi hisob. Ko'rsatkichlarni detallashtirish reja bajarilishi, xo'jalik mulki butligini nazorat qilish, boshqaruv qarorlarini qabul qilish bo'yicha axborotlar olish uchun aniq sharoitlarga qarab belgilanadi. Korxonaning moliyaviy va boshqaruv faoliyatlarini tahlil qilish uchun obyektiv analitik ma’lumotlar kerak. Analitikhisobniyuritish uchun analitik schyotlar qo'llaniladi. Analitik hisob sintetik hisob bilan uzluksiz bog'langan bo'lib, uning ma’lumotlarini detallashtirish maqsadida yuritiladi. Analitik hisobda yozuvlar buxgalteriya hujjatlari va boshqa zaruriy ma’lumotlarga ishora qilinadi. Analitik hisob registrlari sifatida qo'llaniladigan buxgalteriya hisobi shakllariga ko'ra, mashinagrammalar, vedomostlar, jurnal-orderlar, kartochkalar, daftarlar bo'lishi mumkin. "
        ]
    },
    {
        "word": "Analitik Hisob Schyotlar! ",
        "type": [],
        "definition": [
            "analitik hisob yurituvchi buxgalteriya hisobi schyotlari. Ular ma’lum sintetik schyotning ko'rsatkichlarini detallashtirish uchun faqat murakkab sintetik schyotlarga ochiladi. Analitik hisob schyotlari sintetik hisob schyotlariga o'xshab debet va kreditga ega. Ular bo'yicha aylanmalari va saldosi chiqariladi. Bunda bir sintetik schyot bo'yicha ochilgan barcha analitik schyotlarning debet va kredit aylanmalarining jami hamda saldolarining jami so'm hisobida shu sintetik schyotning debet va kredit aylanmalari hamda saldosigatengbo'lishi kerak. Buxgalteriya hisobini takomillashtirish jarayonida analitik hisobni yuritishning samaraliroq prinsiplari ishlab chiqildi. Hisobning jurnal-order shaklida analitik hisob yordamchi (jamg'aruvchi) vedomostlarda yuritiladi, ayrim hollarda esa sintetik schyotlar bilan birga bir jurnal-orderda olib boriladi. "
        ]
    },
    {
        "word": "Analitik Hisob-Kitob ",
        "type": [],
        "definition": [
            "hisob-kitobni aniqlashtirish va rivojlantirish maqsadida olib boriladigan xo'jalik subyektlari faoliyatini nazorat qilish, shuningdek, hisobotlar tuzish uchun zarur bo'lgan xo'jalik jarayonlari va mablag'lari aylanishining buxgalteriya hisob-kitobi. "
        ]
    },
    {
        "word": "Analitik Schyotlar ",
        "type": [],
        "definition": [
            "sintetik schyotlardagi (sintetik schyotga qarang) ma’lumotlami tavsiflab, aniqlashtirib ko'rsatuvchi schyotlar. "
        ]
    },
    {
        "word": "Analiz",
        "type": [],
        "definition": [
            "o'rganilayotgan hodisa, jarayonlarni bo'laklab o'rganish. "
        ]
    },
    {
        "word": "Anatotsizm",
        "type": [],
        "definition": [
            "foizlardan foiz olish, faqat dastlabki miqdordan emas, o'tgan vaqtda oshgan foizlardan ham foiz hisoblash."
        ]
    },
    {
        "word": "Anderrayter",
        "type": [],
        "definition": [
            "l) turli risklarni sug'urtalash vakolatiga ega, sug'urta kompaniyasi tomonidan tayinlanadigan shaxs. Sug'urta kompaniyasining sug'urta portfeli shakllanishi uchun javob beradi. U sug'urta shartnomalarini tuzish, risklarni baholash va sug'urta tarifi stavkasini belgilash yuzasidan tegishli malakaga ega bo'lishi zarur; 2) Lloyd sug'urta polislarini beradigan Lloyd sug'urta korporatsiyasi a’zosi; 3) potensial mijozlarga sug'urta polisini sotish bilan shug'ullanadigan yoki manfaatdor tomonlarga sug'urta sohasi bo'yicha yuqori darajada maslahat xizmatlari ko'rsatadigan jismoniy yoki yuridik shaxs. "
        ]
    },
    {
        "word": "Anderrayter Siyosati ",
        "type": [],
        "definition": [
            "sug'urtalash bilan bog'liq yangi takliflarni ko'rib chiqish va mazkur taklifni qabul qilish yoki rad etish to‘g'risida xulosalar chiqarishga qaratilgan siyosat. "
        ]
    },
    {
        "word": "Anderrayting",
        "type": [],
        "definition": [
            "1. Qimmatbaho qo'g'ozlarning birinchi marta bozorda joylashtirilishi; sotilishi; 2. Qimmatbaho qo'g'ozlarni emitent va anderrayting garantlari (pul) o'rtasida joylashtirilishi uchun tuziladigan shartnoma. "
        ]
    },
    {
        "word": "Anderreyting Turlari ",
        "type": [],
        "definition": [
            "qat’iy majburiyatlar asosidagi anderrayting. Bunday sharoitda anderrayter aksiyalarning butun nashri yoki uning bir qismini qat’iy narxlarda joylashtirish bo'yicha qat’iy majburiyatlarga ega bo'ladi. "
        ]
    },
    {
        "word": "Aniq. Mehnat ",
        "type": [],
        "definition": [
            "iste’mol qiymatlarining aniq turini vujudga keltirishga qaratilgan mehnat"
        ]
    },
    {
        "word": "Anketa",
        "type": [],
        "definition": [
            "biror ma’lumot olish yoki omma fikrini to'plash uchun belgilangan so'roq varaqasi. "
        ]
    },
    {
        "word": "Annuitet",
        "type": [],
        "definition": [
            "l) renta va nafaqalarni sug'urtalashning hamma turlarini umumlashtiruvchi tushuncha. Bunda sug'urtalanuvchi sug'urta kompaniyasiga bir vaqtning o'zida yoki bir necha yillar davomida tegishli sug'urta mukofotlarini to'laydi. Keyin sug'urtalanuvchi butun hayoti davomida sug'urta kompaniyasidan daromad oladi. Annuitetning bir turi hisoblanadigan fuqarolarning yillik daromadi sug'urtasi bugungi kunda Buyuk britaniya, Fransiya va AQShda keng rivojlangan. "
        ]
    },
    {
        "word": "Antimonopol Qoʻmita",
        "type": [],
        "definition": [
            "tovar bozori va raqobatni rivojlantirish, monopollik faoliyatni cheklash, vijdonsizlarcha bo'ladigan raqobatlarning oldini olishda davlat siyosatini yurituvchi organ. "
        ]
    },
    {
        "word": "Antimonopol Qonunchilik ",
        "type": [],
        "definition": [
            "iqtisodiyotni monopollashtirishdan xalos etish, monopoliyalarni cheklab qo'yishga qaratilgan davlat qonunlari. U monopoliyalar faoliyatini tartibga solishning asosiy vositasi hisoblanadi. Hozirgi zamon antimonopol qonunchiligi ikki asosiy yo'nalishga ega: a) baholar ustidan nazorat; b) kompaniyalarning qo'shilishi ustidan nazorat Antimonopol qonunchilik asoslariga birinchi marta AQSH da asos solingan (1880-y. Sherman qonuni; 1914-y. Kleyton qonuni). G'arbiy Yevropada antimonopol qonunlar Ikkinchi jahon urushidan keyin qabul qilingan. O'zbekistonda 1992-yilda monopolizmga qarshi qonunchilikka asos solindi. Shu yili respublikamizda monopolistik faoliyatni cheklash to‘g‘risida qonun qabul qilindi. "
        ]
    },
    {
        "word": "Anto Gonistik Ixtiloflar",
        "type": [],
        "definition": [
            "ziddiyatlarni hal qilishning shunday usullaridirki, bunda barcha qarama-qarshi tomonlarning tuzilmasi buziladi yoki bir tomondan tashqari hamma tomonlarning ixtilofda qatnashishdan voz kechishi sodir bo'ladi."
        ]
    },
    {
        "word": "Antreprener",
        "type": [],
        "definition": [
            "1. Tadbirkor - yangi biznes (kompaniya)ga asos solishga tavakkalchilik qiladigan shaxs. 2. Ba’zi san’at turlaridagi menejer va tadbirkor, xususiy tomoshaxonalar (teatr, sirk va hokazolar)ni saqlab, ularning faoliyatini ta’minlovchi. "
        ]
    },
    {
        "word": "Antuan Monkreten",
        "type": [],
        "definition": [
            "(1565-1621) - fransiyalik iqtisodchi, fanga birinchibo‘lib“siyosiyiqtisod”tushunchasinikiritgan,merkantilizm, savdo rivojini qo'llagan, dvoryanlarning zeb-ziynatga berilishini qoralagan. "
        ]
    },
    {
        "word": "Apologetika",
        "type": [],
        "definition": [
            "biror g‘oya yoki ta’limotni xato bo'lsa ham ko‘r-ko‘rona himoya qilish. Ma’lum sinf, guruhlar manfaati himoya qilinadi."
        ]
    },
    {
        "word": "Appelyatsiya ",
        "type": [],
        "definition": [
            "ierarxiya bo'yicha quyi pog'onadagi tashkilotning xattiharakati (chiqargan qarorlari)dan norozi bo'lib yuqori pog'onadagi tashkilotga ariza bilan murojaat etish. "
        ]
    },
    {
        "word": "Aqllikishilarning Ketib Qolishi ",
        "type": [],
        "definition": [
            "mamlakatdan “intellektual elita” vakillarining chet elga ishga joylashish maqsadida chiqib ketishi. "
        ]
    },
    {
        "word": "Aralash Iqtisodiyot ",
        "type": [],
        "definition": [
            "iqtisodiy tizim, sof kapitalizm va buyruqbozlik iqtisodiy tizimlarning ijobiy taraflarini o'ziga qo'shgan, ya’ni ishlab chiqarish vositalariga ijtimoiy mulkchilik va xususiy mulkchilik unsurlarini birlashtirgan. Aralash iqtisodiyot turli mulkchilikka asoslangan. Iqtisodiy faoliyat esa ikkita vosita: bozor mexanizmi (narx, raqobat) va davlat tomonidan tartibga solinadi. "
        ]
    },
    {
        "word": "Aralash Jarayon ",
        "type": [],
        "definition": [
            "buyurtma bo'yicha va zaxiraga ishlab chiqarish jarayonlari xususiyatlarini o'z ichiga olgan jarayon. Aralash jarayonning eng keng tarqalgan shakliga ko'ra, firma oldin ma’lum bir, keyingtayyormahsulotlarningbarchasiga asos bo'ladigan, yarim fabrikat tayyorlab, uni zaxira qiladi. Bu yarim fabrikatlar keyinchalik buyurtmaga binoan kerakli tayyor mahsulotga aylantiriladi. "
        ]
    },
    {
        "word": "Aralash Korxonalar ",
        "type": [],
        "definition": [
            "turli mulk shakllariga taalluqli firmalar bo'lib, odatda, davlat, jamoa va xususiy mulkning aralash mablag'lari asosida tashkil etiladi. "
        ]
    },
    {
        "word": "Aralash Mulk ",
        "type": [],
        "definition": [
            "turli shakldagi mulklarning o'zaro qo'shilib, hamkorlikda o'zlashtirilishi asosida tashkil topadi. Uning yaqqol ko'rinishi aksionerlik jamiyatlaridir. "
        ]
    },
    {
        "word": "Arbitraj",
        "type": [],
        "definition": [
            "1. Bitta tovarning o'ziga qo'yilgan narxlar o'rtasidagi farqdan foyda olish maqsadida bitta yoki bir nechta bozorlardan bir vaqtning o'zida xarid qilish va sotish (kontraktlar) operatsiyasi. 2. Bitta bozorning o'zida har xil muddatlarda olib kelingan tovarlarga odatdan tashqari, istalgan narxlardan foyda olish maqsadida amalga oshiriladigan operatsiyalar. 3. Tijorat va mulkiy kelishmovchiliklar (mojarolar) ni hal qilib beruvchi organ. 4. Tomonlarning o'zlari saylagan yoki ularning roziligi bilan tayinlangan yoki qonunda belgilangan tartibda arbitrlarga murojaat qilish yo'li bilan mojarolarni hal qilish usuli. "
        ]
    },
    {
        "word": "Arzon Pullar Siyosati ",
        "type": [],
        "definition": [
            " mamlakatda pul miqdorini oshirish siyosati. U mamlakatda ishlab chiqarish quwatlari to'liq foydalanilmayotgan va ishsizlik miqdori oshishi sharoitida Markaziy bank tomonidan amalga oshiriladi. Ushbu siyosat kreditni arzon, uni olishni esa oson qilib, pul taklifining oshishiga sharoit yaratadi. Buning uchun esa bank va aholidan ochiq bozorda davlat qimmatli qog'ozlarini sotib olish, zaxira me’yori va hisob stavkasini pasaytirishdan foydalanadi. Pul taklifini oshirish foiz stavkasini pasaytiradi, investitsiyalarning ko'payishi va tadbirkorlik faoliyatining yanada jonlanishiga sharoit yaratadi. "
        ]
    },
    {
        "word": "Asimmetriya",
        "type": [],
        "definition": [
            "o'rtacha kub tafovutning kub darajali kvadratik o'rtacha tafovutga nisbati. "
        ]
    },
    {
        "word": "Asl Isteʼmolchi ",
        "type": [],
        "definition": [
            " aholi, shaxs, oila, budjet muassasalari. "
        ]
    },
    {
        "word": "Asosiy (Dastlabki) Xizmatlar ",
        "type": [],
        "definition": [
            "iste’molchilar mahsulot sotib olayotgandagi mahsulot bilan birgalikda ko'rsatilishini xohlaydigan xizmatlar; ular ishlab chiqarish texnologiyalariga amal qilish, iste’molchilarning talablarini hisobga olish, mahsulot bilan raqobatlashgan narxda ta’minlashdan iborat. "
        ]
    },
    {
        "word": "Asosiy Bolmagan Faoliyat Dan Olingan Daromadlar ",
        "type": [],
        "definition": [
            "bevosita asosiy faoliyatga taalluqli bo'lmagan faoliyat turlaridan olingan daromadlar. "
        ]
    },
    {
        "word": "Asosiy Faoliyat Turi",
        "type": [],
        "definition": [
            " yuridik shaxsning hisobot davri yakunlari bo'yicha umumiy realizatsiya qilish hajmidagi sof tushum ulushi ustunlik qiladigan faoliyati. "
        ]
    },
    {
        "word": "Asosiy Fao Liyatdan Коʼr1 Lg An Foyda ",
        "type": [],
        "definition": [
            "mahsulotni sotishdan olingan yalpi foyda bilan davr xarajatlari o'rtasidagi tafovut va plyus asosiy faoliyatdan ko'rilgan boshqa daromadlar yoki minus boshqa zararlar sifatida aniqlanadi."
        ]
    },
    {
        "word": "Asosiy Faoliyatdan Olingan Daromadlar ",
        "type": [],
        "definition": [
            "deganda korxona ustavida belgilangan asosiy faoliyatdan olingan daromadlar tushuniladi. "
        ]
    },
    {
        "word": "Asosiy Fondlar",
        "type": [],
        "definition": [
            "mamlakat milliy boyligining muhim qismi. Ular ishlab chiqarish jarayonida ko‘p marta foydalaniladigan va o'z qiymatini tayyor mahsulotga asta-sekin o'tkazib boradigan aktivlar hisoblanadi. Bunday fondlarga imorat va inshoot, mashina va uskunalar, transport vositalari, bog'lar, uzumzorlar, geologiya- qidiruv ishlariga sarflar, EHM ma’lumotlar bazasi va ularni dasturlar bilan ta’minlash xarajatlari, san’at va adabiyotning nodir asrlari va shu kabilar kiradi. "
        ]
    },
    {
        "word": "Asosiy Fondlarni Realizatsiya Qilishdan Olingan Foyda ",
        "type": [],
        "definition": [
            " hukumat tomonidan belgilangan tartibda hisoblangan, inflyatsiya indeksiga oshirilgan (ko'paytirilgan) asosiy fondlaming sotish bahosi va ularning dastlabki yoki qoldiq qiymati o'rtasidagi farq. "
        ]
    },
    {
        "word": "Asosiy Fondlarning Eskirishi ",
        "type": [],
        "definition": [
            " asosiy fondlar (binolar, qurilmalar va boshqa mehnat vositalari)ning asta-sekinlik bilan foydali xususiyatlarini yo'qotishi. Asosiy ishlab chiqarish fondlari eskirishining jismoniy va ma’naviy turlari mavjud. "
        ]
    },
    {
        "word": "Asosiy Ish Haqi ",
        "type": [],
        "definition": [
            "ishchi va xizmatchilarning ishlagan vaqti uchun to'lanadigan haq. "
        ]
    },
    {
        "word": "Asosiy Ish Joyi ",
        "type": [],
        "definition": [
            " ish beruvchi mehnat to'g'risidagi qonun hujjatlariga muvofiq xodimning mehnat daftarchasini yuritishi shart bo'lgan ish joyi. "
        ]
    },
    {
        "word": "Asosiy Ishlab Chiqarish Fondlari ",
        "type": [],
        "definition": [
            " mahsulot ishlab chiqarishda foydalaniluvchi mehnat vositalari (binolar, inshootlar, qurilma va asbob-uskunalar, transport vositalari va hokazo). Ular uzoq muddat xizmat ko'rsatib, ishlab chiqarish jarayonida o'zining natural shaklini saqlab qoladi hamda o'z qiymatini eskirish mobaynida asta-sekinlik bilan tayyor mahsulotga o'tkazadi. Kapital qo'yilmalar hisobiga to'ldiriladi. "
        ]
    },
    {
        "word": "Asosiy Ishlab Chiqarish Xarajatlari ",
        "type": [],
        "definition": [
            " mahsulot ishlab chiqarish texnologik jarayoni bilan to'g'ridan-to'g'ri bog'liq xarajatlar. "
        ]
    },
    {
        "word": "Asosiy Kapital ",
        "type": [],
        "definition": [
            " ishlab chiqarish jarayonida bir qator doiraviy aylanishlar davomida qatnashib, o'z qiymatini tayyorlanayotgan mahsulotga sekin-asta o'tkazadigan kapital. "
        ]
    },
    {
        "word": "Asosiy Kapital Isteʼmoli ",
        "type": [],
        "definition": [
            " ishlab chiqaruvchida mavjud bo'lgan asosiy kapital joriy qiymatining hisobot davrida jismoniy va odatdagi me’yorda ma’naviy eskirishi, baxtsiz hodisa tufayli shikastlanishi natijasida uning kamayishi asosiy kapital iste’moli deb ataladi."
        ]
    },
    {
        "word": "Asosiy Moliya Strategiyasi",
        "type": [],
        "definition": [
            "korxona faoliyatini aniqlovchibudjetning hamma darajasida bo'ladigan o'zaro munosabatlari. Korxona daromadlarini tashkil etib, uni sarflashga, ehtiyojlik miqdori va bir yilda moliyalashtirish manbalariga aytiladi. "
        ]
    },
    {
        "word": "Asosiy Narx ",
        "type": [],
        "definition": [
            " mahsulot yoki xizmat birligi uchun ishlab chiqaruvchi oladigan narx. Ishlab chiqaruvchi tovar yetkazib berish va xizmat ко‘rsatish uchun alohida qo'shadigan sarflar asosiy narx tarkibiga kiritilmaydi. "
        ]
    },
    {
        "word": "Asosiy Narxlar Boʻyicha Yalpi Qoʻshilgan Qiymat ",
        "type": [],
        "definition": [
            "asosiy narxlarda baholangan yalpi mahsulot qiymatidan xaridor narxidagi oraliq iste’mol qiymati chegirib tashlandi. "
        ]
    },
    {
        "word": "Asosiy Qo Id Alar ",
        "type": [],
        "definition": [
            " fundamental va texnik tahlilda ishlatiladigan qoidalar. "
        ]
    },
    {
        "word": "Asosiy Tarmoq",
        "type": [],
        "definition": [
            "korxonaning jami tovar mahsulotida yoki yalpi mahsulotida eng katta salmoqqa ega bo'lgan, uning maqsad va vazifalarini ifodalovchi hamda ixtisoslashishini belgilovchi tarmoq. "
        ]
    },
    {
        "word": "Asosiy Tendensiya ",
        "type": [],
        "definition": [
            " uch fazaga ega bo'lgan tendensiya"
        ]
    },
    {
        "word": "Asosiy Vositalar ",
        "type": [],
        "definition": [
            "korxona tomonidan uzoq muddat davomida xo'jalik faoliyatini yuritishda mahsulot ishlab chiqarish, ishlarni bajarish yoki xizmatlar ko'rsatish jarayonida yoxud ma’muriy va ijtimoiy-madaniy vazifalarni amalga oshirish maqsadida foydalanish uchun tutib turiladigan moddiy aktivlar."
        ]
    },
    {
        "word": "Asosiy Vositalar Obyekti Boʻyicha",
        "type": [],
        "definition": [
            "amortizatsiya ajratmalarini hisoblash mazkur obyekt asosiy vositalar tarkibiga qabul qilingan oydan keyingi oyning dastlabki sanasidan boshlanadi hamda mazkur obyektning amortizatsiyalanadigan qiymati to'liq so'ndirilgunga qadar yoxud bu obyektning balansdan hisobdan chiqarilguncha amalga oshiriladi. "
        ]
    },
    {
        "word": "Asosiy Vositalarni Qayta Baholash ",
        "type": [],
        "definition": [
            "asosiy vositalar obyektlarining tiklash qiymatini hozirgi bozor narxlari darajasiga moslash maqsadida ulami vaqti-vaqti bilan aniqlashtirishdir. Asosiy vositalar qayta baholash natijasida hisob va hisobotda joriy qiymat bo'yicha aks ettiriladi. "
        ]
    },
    {
        "word": "Asosiy Vositalarning Haqiqatda Mavjudligini ",
        "type": [],
        "definition": [
            "aniqlash va ularning butligini nazorat qilish maqsadida korxonalar tomonidan vaqti-vaqti bilan, biroq ikki yilda kamida bir marta asosiy vositalar inventarizatsiyadan o'tkaziladi, kutubxona fondlari esa besh yilda bir marta inventarlanadi. "
        ]
    },
    {
        "word": "Asosiy Vositalarning Inventar Obyekti ",
        "type": [],
        "definition": [
            " barcha qurilmalari va anjomlariga ega bo'lgan obyekt yoki muayyan mustaqil vazifalarni bajarish uchun mo'ljallangan alohida konstruktiv asosdagi buyum yoxud butun bir yaxlitlikni ifodalovchi va muayyan vazifalarni bajarish uchun mo'ljallangan konstruktiv jamlangan buyumlarning alohida majmuyi tan olinadi"
        ]
    },
    {
        "word": "Asriytrend",
        "type": [],
        "definition": [
            " 25,50,100yilni qamrab oluvchi iqtisodiyotning rivojlanishidagi uzoq vaqtlik tendensiyalar. Masalan, XX asming ikkinchi yarmida iqtisodiy rivojlanishga xos bo'lgan tendensiya davlatning iqtisodiyotni tartibga solishga faol aralashishi. "
        ]
    },
    {
        "word": "Assignatsiyalar",
        "type": [],
        "definition": [
            "qo'g'oz pullar. Tovar ishlab chiqarishning rivojlanishi, oltin hamda boshqa metallarni pul sifatida muomaladan chiqarishning iqtisodiy maqsadga muvoqlashuvi. "
        ]
    },
    {
        "word": "Assortiment",
        "type": [],
        "definition": [
            "sotish xonasidagi turli-tuman mollarning to'planishij ba’zida bir molning turlari va navlarining to'plami. "
        ]
    },
    {
        "word": "Assotsiatsiya",
        "type": [],
        "definition": [
            "to'planma, uyushma; biron maqsadga erishish uchun (xo'jahk, siyosiy, ilmiy, madaniy yoki boshqa maqsadlar) birlashish. Assotsiatsiya yuridik shaxs bo'lib hisoblanadi. "
        ]
    },
    {
        "word": "Asosiy Fondlar Va Ularning Bahosi ",
        "type": [],
        "definition": [
            "turli xo'jalik subyektlari va fuqarolarning pul mablag'larini aniq bir maqsadyo'lidabirlashtirish va ishlatish. "
        ]
    },
    {
        "word": "Asosiy Narx ",
        "type": [],
        "definition": [
            "xalq xo'jaligini rivojlantirish va statistik hisob olib borishda indekslarni hisoblash hamda to'lashgacha hisoblangan narx. "
        ]
    },
    {
        "word": "Atrof-Muhitning Assimilyatsiya Potensiali (Amap) ",
        "type": [],
        "definition": [
            " o'ziga xos tabiiy resurs bo'lib, u cheklangan yoki tanqis (kamchil) resurs hisoblanadi. "
        ]
    },
    {
        "word": "Attestatsiya",
        "type": [],
        "definition": [
            " mutaxassislarning lavozimiga layoqati, malakasi, bilim darajasi va xulq-atvorini aniqlash hamda shu asosda ishga tayinlash yoki unvon berish, shuningdek, ishdan chetlatishga xizmat qiladi."
        ]
    },
    {
        "word": "Audit",
        "type": [],
        "definition": [
            "muayyan vakolatlar berilgan shaxslar auditorlar (auditorlik firmalari) tomonidanxo'jalikyuritayotgansubyektlamingmoliyaviyhisobotlari to'g'riligi, ular amalga oshirgan moliyaviy va xo'jalik operatsiyalari O'zbekiston Respublikasining qonunlari hamda boshqa me’yoriy hujjatlariga qay darajada muvofiqligi, shuningdek, mukammaligi va asosliligi, buxgalteriya hisob-kitobi va boshqa moliyaviy hisobot yuritishga doir talablarga qay darajada monandligini tekshirish maqsadida o'tkaziladigan moliya hujjatlarining ekspertizasi va tahlilidir. "
        ]
    },
    {
        "word": "Audit Programmasi ",
        "type": [],
        "definition": [
            "belgilangan shaklda rasmiylashtirilgan auditning usul va uslublari majmuyi. Audit programmasi mazkur auditorlik tekshiruvida qo'llaniladigan qaror auditorlik tadbirlar hamda ularning harakatlari muddati, hajmi va aniq bajaruvchilarini o'z ichiga oladi. Buxgalteriya hisobida noto'g'ri aks ettirilgan yoki odatdagidek bo'Imagan xo'jalik faoliyati faktlarini topish maqsadida hamda xatoliklar va buzilishlarning sababini aniqlash uchun auditor tomonidan olingan axborotni baholash va tahlil qilish, tekshirilayotgan iqtisodiy subyektning muhim moliyaviy va iqtisodiy ko'rsatkichlarini tekshirishni o'zida mujassamlashtirgan auditorlik tadbirlaming bir turidir. "
        ]
    },
    {
        "word": "Audit Qilingan Buxgalteriya Hisobotini Aks Ettiruvchi Hujjat ",
        "type": [],
        "definition": [
            "qonunda yoki normativ hujjatlarda nazarda tutilgan yoxud foydalanuvchilarga taqdim etish maqsadida xo'jalik yurituvchi subyekt tashabbusi bilan tayyorlangan har qanday hujjat (elektron shakldagi hujjatlardan tashqari) bo'lib, uning tarkibiga xo'jalik yurituvchi subyektning audit tekshiruvidan o'tkazilgan buxgalteriya hisoboti ham kiradi. "
        ]
    },
    {
        "word": "Audit Tanlovi ",
        "type": [],
        "definition": [
            "l) keng ma’noda: iqtisodiy subyektning buxgalteriya hisoboti hujjatlarining barchasini emas, balki tanlov asosida auditorlik nazorati o'tkazilishi; 2) tor ma’noda: nazorat qilinayotgan hujjatlaming barchasi haqida xulosa chiqarish maqsadida ma’lum tarzda tanlab olingan elementlar yig'indisi. "
        ]
    },
    {
        "word": "Auditdagi Amaliy Ish Mahorati ",
        "type": [],
        "definition": [
            "nomzodga auditor attestatini olish uchun da’vogarlik qilish huquqini beradigan va talab qilingan vaqt mobaynida ma’lum lavozimlarda ishlash natijasida olingan amaliy malakalar majmuyi. "
        ]
    },
    {
        "word": "Auditdagi Axborotlar (Konfedetsialligl) Maxfiyligi ",
        "type": [],
        "definition": [
            "auditorlar (auditorlik tashkiloti) tomonidan auditorlik faoliyati davomida olingan yoki ular tomonidan tuzilgan hujjatlaming nusxalarini (to'la va qisqa) boshqa bir uchinchi shaxslarga berish yoki ushbu hujjatdagi ma’lumotlarni og'zaki bayon qilish huquqiga ega emasliklarini, agar O'zbekiston qonun hujjatlarida boshqa holatlar ko'zda tutilgan bo'lsa, o'zida mujassamlashtirgan auditning bir tamoyilidir. Tergov organi, prokuror, sud va arbitraj sudi ko'rsatmasi bo'yicha o'tkaziladigan auditorlik tekshirish jarayonida olinadigan ma’lumotlar faqatginayuqoridako'rsatilgan organlarning ruxsati bilan hamda shu organlar ular oshkor qilish zarur deb topgan hollarida olingan ma’lumotlar oshkor qilinishi mumkin. Auditor (auditorlik tashkiloti) iqtisodiy subyekt bo'yicha olingan ma’lumotlarning oshkor qilinishi va tarqatilishi unga moddiy va boshqa xil zarar yetkazmaydi deb topganda ham maxfiylik prinsipiga so'zsiz amal qilishi lozim. "
        ]
    },
    {
        "word": "Auditdagi Baholash",
        "type": [],
        "definition": [
            "ko'rib chiqilayotgan predmetning miqdoriy va sifat xarakteristikalari haqidagi auditor tasawuri. "
        ]
    },
    {
        "word": "Auditdagi Iqtisodiy Subyekt Faoliyatini Tushunish ",
        "type": [],
        "definition": [
            "xo'jalik subyekti faoliyati haqidagi bilimlarning turli jihatlarini o'zaro bog'lovchi va iqtisodiy subyekt faoliyatiga aloqador bo'lgan xo'jalik hayoti faktlarini auditor tomonidan talabga javob beradigan ravishda baholashda yordam beradigan jarayon. "
        ]
    },
    {
        "word": "Auditdagi Kutilayotgan Tanlov Xatosi ",
        "type": [],
        "definition": [
            "auditoming tanlovi jarayoni boshlanmasidan oldin ushbu tanlov jarayonida auditor tomonidan iqtisodiy subyekt buxgalteriya hisobi va hisobotida aniqlash mo'ljallangan xatolar mazmunini taxminiy, subyektiv ravishda baholash. "
        ]
    },
    {
        "word": "Auditdagi Litsenziyalash (Ruxsatnoma Berish)",
        "type": [],
        "definition": [
            "maxsus hamda tekshiruvdan o'tgan (attestatsiyalangan) auditorlarga qonunchilik talablariga javob beradigan, tadbirkorlik faoliyati subyektlari sifatida belgilangan qonun tartibida ro'yxatga olingan tashkilotlarga auditorlik faoliyatini yuritish huquqini beradigan maxsus ruxsatnoma (litsenziya) berish tartibi. "
        ]
    },
    {
        "word": "Auditdagi Tanlov Hajmi ",
        "type": [],
        "definition": [
            "tekshiriladigan majmuadan auditor tomonidan tanlab olingan birliklar soni. "
        ]
    },
    {
        "word": "Auditdagi Tanlovning Ishonchliligi ",
        "type": [],
        "definition": [
            "uning asosida tekshirilayotgan umumiylik xususiyatlari haqida auditorga to'g'ri xulosalar chiqarishga imkon beradigan ayrim auditorlik tanlovining xususiyati. Bu talabga javob bermaydigan auditorlik tanlovi ishonchsiz hisoblanadi. "
        ]
    },
    {
        "word": "Auditdagi Xoʻjalik Subyektlari Boʻlimlari ",
        "type": [],
        "definition": [
            "asosiy auditorlik tashkiloti audit o'tkazayotgan xo'jalik subyekti buxgalteriya hisoboti bilan bog'liq bo'lgan, ko'rsatkichlari mazkur subyektning buxgalteriya hisobotiga qo'shiladigan xo'j alik subyektining qismidir. Filiallar vakilliklar korxonalari, yuridik shaxs maqomiga ega bo'lgan boshqa bo'limlar sho'ba va nomustaqil jamiyatlar, xo'jalik subyektning bo'limlari bo'lishi mumkin. "
        ]
    },
    {
        "word": "Auditdagi Yoʻl Qoʻyilishi Mumkin Boʻlgan Tanlov Xatosi",
        "type": [],
        "definition": [
            "auditor tomonidan auditorlik tanlov jarayonida xo'jalik subyektining buxgalteriya hisobi va hisobotida aniqlangan, lekin ushbu tanlov jarayonida tekshirilishi lozim bo'lgan ma’lumotlarning to'g'riligi haqida audit xulosa berishi mumkin bo'lgan darajadagi xatoliklarning maksimal holati. "
        ]
    },
    {
        "word": "Auditni Rejalashtirish ",
        "type": [],
        "definition": [
            "auditorlik tekshiruvi hajmi, auditning umumiy rejasini tuzish, auditorlik ish rejalari va aniq auditorlik tadbirlarini ishlab chiqishni o'z ichiga oladigan auditning muhim bosqichlaridan biri. "
        ]
    },
    {
        "word": "Auditning Asosiy Prinsiplari ",
        "type": [],
        "definition": [
            "auditorlik tekshirishni amalga oshirish jarayonida auditor amal qilishi lozim bo'lgan talab va tartiblar. Ular quyidagilarni o'z ichiga oladi: mustaqillik; halollik; xolislik; professional bilimga ega bo'lish; vijdonlilik; maxfiylik; professional axloq; auditorlik faoliyati qoidalari (standartlari)ni bajarish. "
        ]
    },
    {
        "word": "Auditning Ishchi Hujjatlari ",
        "type": [],
        "definition": [
            "auditor tomonidan tekshirilayotgan xo'jalikyurituvchisubyektxodimlarivauchinchishaxslartomonidan auditor talabiga binoan audit tekshiruvchilaridan oldin, tekshiruvlar jarayonida va tugatilganida tuziladigan moddiy ko'rinishdagi ma’lumotlar yig'indisi hisoblanadi va u auditorning haqqoniy hisoboti va xulosasi tuzilishiga imkon beruvchi, shuningdek, mazkur va keyingi auditning samarali o'tishiga ko'maklashuvchi ma’lumotlarni o'zida aks ettirishi lozim. Bunday hujjatlaming shakli va mazmuniga qo'yilgan talablar auditorlik faoliyatiga tegishli qoidalar talablari (standartlari)ga javob berishi lozim. "
        ]
    },
    {
        "word": "Auditning Tashqi Sifat Nazorati",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasida auditorlik faoliyatini muvofiqlashtiruvchi auditorlik tashkilotining auditorlik faoliyati qoidalari (standartlari) va boshqa me’yoriy hujjatlarga amal qilinayotganligini tekshirish uchun davlat organlari va auditorlik birlashmalari tomonidan qabul qilingan tashkiliy usullar, uslubiyatlar va tadbirlardan iborat. "
        ]
    },
    {
        "word": "Auditning Umumiy Rentasi ",
        "type": [],
        "definition": [
            "auditorlik tekshiruvida ko'zda tutilgan xo'jalik subyektlarining o'ziga xos jihatlari va xususiyatlari, bu jarayonda qo'Ilaniladigan auditning texnik usul va metodlarini, shuningdek, audit o'tkazish xususiyati va hajmini ko'zda tutadigan mantiqiy tavsifdir. "
        ]
    },
    {
        "word": "Auditor",
        "type": [],
        "definition": [
            "auditor malaka sertifikatiga ega bo'lgan jismoniy shaxsdir. Agar auditor auditorlik tashkilotining shtatida turgan bo'Isa yoki auditorlik tashkiloti u bilan fuqarolik-huquqiy tusdagi shartnoma tuzgan bo'lsa, u auditorlik tekshiruvi o'tkazishga jalb etilishi mumkin."
        ]
    },
    {
        "word": "Auditor Fikri ",
        "type": [],
        "definition": [
            "auditor o'zining xulosasida keltirishi lozim bo'lgan, to'liq yoki qisman tekshirilayotgan iqtisodiy subyekt buxgalteriya hisobotining ishonchliligi (ishonchli emasligi; ishonchliligi sharhlar bilan) haqidagi belgilangan shaklda ifodalangan auditor (auditorlik tashkiloti) hamda auditorlik xulosasini tayyorlash uchun yig'ilgan dalillarning yetarliligi haqidagi natijaviy xulosasidir. Auditor (auditorlik tashkilotlari) o'z fikrlari to'g'riligi va asosliligi uchun belgilangan tartibda javobgarlikni his etadi. "
        ]
    },
    {
        "word": "Auditorfirmasi",
        "type": [],
        "definition": [
            " mustaqil tashkilot bo'lib, shartnoma asosida korxonalar yillik buxgalteriya hisobotini tekshiradi va tasdiqlaydi. Tekshiruv davomida auditor firmasi buxgalteriya hisob-kitobining holati va talabga mos kelishi, moliya-xo'jalik faoliyati masalalarining haqiqiy holatga muvofiqligini nazorat qiladi. "
        ]
    },
    {
        "word": "Auditor Insofliligi ",
        "type": [],
        "definition": [
            "audit tamoyillaridan biri bo'lib, auditor professional xizmatlarini lozim darajada e’tibor bilan, operativ (tezkor) va o'z qobiliyatlarini imkon qadar qo'llash majburiyatlarini o'z ichiga oladi. Insoflilik tamoyili deganda, auditorning o'z ishiga vijdonan va masuliyatli munosabatda bo'lish tushuniladi, lekin bu auditorlik faoliyatini bexatolik deb tushunmaslik lozim. "
        ]
    },
    {
        "word": "Auditor Tashkiloti (Auditor)Ning Javobgarligi",
        "type": [],
        "definition": [
            "auditorlik tekshiruvi buyurtmachilari, xo'jalik yurituvchi subyekt va moliyaviy hisobotdan boshqa foydalanuvchilar oldida moliyaviy hisobot hamda xo'jalik yurituvchi subyektning boshqa moliyaviy axboroti to'g'risida noto'g'ri yakundan iborat bo'lgan auditorlik xulosasini tuzish oqibatida ularga yetkazilgan zarar uchun qonun hujjatlarida belgilangan tartibda javobgarlik darajasi. "
        ]
    },
    {
        "word": "Auditor Xulosasidagi Maxsus Izoh Paragrafi ",
        "type": [],
        "definition": [
            "xo'jalik subyekti buxgalteriya hisobotining ishonchliligi to'g'risida va buxgalteriya hisoboti bilan bog'liq maxsus holatlar haqidagi ma’lumotlarni o'zida mujassamlashtirgan auditor tashkiloti tomonidan bevosita ifodalangan fikrni o'z ichiga oladigan auditor xulosasining bir bo'lagi. Uning maqsadi, auditor xulosasidagi maxsus holatlarni ochib beradigan ma'lumotlardan foydalanuvchilar diqqatini jalb qilish. "
        ]
    },
    {
        "word": "Auditorlik Faoliyati ",
        "type": [],
        "definition": [
            "deganda auditorlik tashkilotlarining auditorlik tekshiruvlari o'tkazish va boshqa shu bilan bog'liq professional xizmatlar ко'rsatish borasidagi tadbirkorlik faoliyati tushuniladi"
        ]
    },
    {
        "word": "Auditorlik Faoliyatining Qoidalari, Standartlari ",
        "type": [],
        "definition": [
            "auditor audit va undagi xizmatlar hamda audit sifatini baholash, auditorlar tayyorlash tartibi va ular malakasini baholashni amalga oshirish va rasmiylashtirishga qo'yiladigan yagona talablarni o'zida mujassamlashtirgan me’yoriy hujjatlar. "
        ]
    },
    {
        "word": "Auditorlik Hisoboti ",
        "type": [],
        "definition": [
            "auditorlik tekshiruvining borishi, buxgalteriya hisobini yuritishning belgilangan tartibidan aniqlangan chetga chiqishlar, moliyaviy hisobotdagi qoidabuzarliklar to'g'risidagi mufassal ma’lumotlardan, shuningdek, auditorlik tekshiruvi o'tkazish natijasida olingan boshqa axborotdan iborat bo'lgan va xo'jalik yurituvchi subyekt rahbariga, mulkdoriga, qatnashchilari (aksiyadorlari)ning umumiy yig'ilishiga yo'llangan hujjat. Hisobotda aniqlangan chetga chiqishlar va qoidabuzarliklarni bartaraf etish bo'yicha tavsiyalar, shuningdek, xo'jalik yurituvchi subyektning moliya xo'jalik faoliyati samaradorligini oshirish bo'yicha tavsiyalar va takliflar mavjud bo'ladi. "
        ]
    },
    {
        "word": "Auditorlik Isbotlash ",
        "type": [],
        "definition": [
            "tekshirish paytida xo'jalik yurituvchi subyektdan yoki uchinchi shaxslardan olingan ma’lumot yoki uning tahlili natijasi bo'lib, buxgalteriya hisobotning haqiqiyligi haqida auditorning xulosa qilish va o'z fikrini aytishga ko'maklashadi. Auditorlikisbotlashhujjatlardan olingan ma’lumotlarni buxgalteriya hisoboti hujjatlari, ekspert xulosalari va boshqa manbalardan olingan ma’lumotlarni o'z ichiga oladi. "
        ]
    },
    {
        "word": "Auditorlik Jarayoni (Tadbirl) ",
        "type": [],
        "definition": [
            "auditning aniq qismida kerakli auditorlik dalillarni olish uchun auditor harakatining ma’lum tartibi va ketma-ketligi. Auditorlik jarayoni mohiyati bo'yicha quyidagi ikkita narsadan birini o'z ichiga oluvchi auditorlik jarayonlarining bir ko'rinishi: a) schyotlardagi oborotlar va qoldiqlarning buxgalteriya hisobida to'g'ri aks ettirilganligini to'la (mufassal) tekshirish; v) taxminiy jarayonni. "
        ]
    },
    {
        "word": "Auditorlik Nazorati ",
        "type": [],
        "definition": [
            " auditorlik faoliyatini amalga oshirish borasida litsenziyaga ega bo'lgan auditorlik firmasi tomonida o'tkaziladigan mustaqil noidoraviy moliyaviy nazorat. Asosiy vazifasi buxgalteriya hisoboti va moliyaviy hisobotning haqqoniyligi, to'liqligi va ishonchliligi hamda moliyaviy qonunchilikka qay darajada rioya qilinganligini aniqlash (o'rnatish)dir. Banklar, sug'urta tashkilotlari, birjalar, nobudjet va xayriya fondlari, ochiq tipdagi aksionerlik jamiyatlari, xorijiy kapital ishtirokidagi korxonalar, shuningdek, prokuratura va davlat nazorat organlarining topshirig'iga binoan har qanday korxona va tashkilotlar majburiy ravishda auditorlik nazoratidan o'tkazilishi kerak. Auditorlik firmalari buxgalteriya hisoboti va soliq hisob-kitoblari, hisob ishlarini yuritish, loyihalarni moliyaviy ekspertiza qilish va h.k.lar bo'yicha maslahat xizmatlarini ko rsatishi mumkin. Ularning bu xizmatlari tegishli to'lov (haq) asosida amalga oshiriladi."
        ]
    },
    {
        "word": "Auditorlik Tashkiloti",
        "type": [],
        "definition": [
            "1. Faqatgina auditorlik faoliyati bilan shug'ullanadigan va buning uchun belgilangan tartibda litsenziya olgan tijorat tashkilotidir. 2. Auditorlik faoliyatini yuritadigan va jismoniy shaxs bo'lib, bir qator auditorlik faoliyatining maqsadlari uchun (agar boshqa hollar oldindan kelishilgan bo'Isa) auditorlik firmalari va mustaqil ishlaydigan auditorlarni birlashtiruvchi tushuncha. 3. Auditorlik faoliyatini amalga oshirish litsenziyasiga ega bo'lgan yuridik shaxsdir. Ular o'z faoliyatini amalga oshirishda mustaqildir. "
        ]
    },
    {
        "word": "Auditorlik Tashkiloti (Auditor)Ning Majburiyatlari ",
        "type": [],
        "definition": [
            "auditorlik faoliyatini amalga oshirishda xo'jalik subyekti oldida qonun hujjatlariga muvofiq shartnoma talablariga asosan bajarilishi lozim bo'lgan burchlari. "
        ]
    },
    {
        "word": "Auditorlik Tashkilotlari (Auditorlarl)Ning Huquqlari ",
        "type": [],
        "definition": [
            "auditorlik faoliyatini amalga oshirishda qonun hujjatlarida belgilangan tartibda berilgan vakolatlar. "
        ]
    },
    {
        "word": "Auditorlik Tekshiruvi ",
        "type": [],
        "definition": [
            "audit qilinishi lozim bo'lgan iqtisodiy subyektning moliyaviy holatiga daxldor bo'lgan auditor dalillarini yig'ish,baholash va tahlil qilishdaniboratbo'lganhamdaauditorning mazkur iqtisodiy subyekt buxgalteriya hisobotining ishonchliligi va buxgalteriya hisobini yuritish to'g'riligi haqidagi fikrning bayon qilinishi natijasi bo'lgan tadbir. "
        ]
    },
    {
        "word": "Auditorlik Tekshiruvi ",
        "type": [],
        "definition": [
            " moliyaviy hisobot va boshqa moliyaviy axborot to'g'riligi hamda qonun hujjatlariga mosligini aniqlash maqsadida xo'jalik yurituvchi subyektning moliyaviy hisoboti hamda u bilan bog'liq moliyaviy axborotni auditorlik tashkilotlari tomonidan tekshirishdir. "
        ]
    },
    {
        "word": "Auditorlik Tekshiruvinin G Hajmi ",
        "type": [],
        "definition": [
            "to'laqonli auditorlik tekshiruvini o'tkazish va auditorning asosli xulosasini tayyorlash uchun zarur bo'lgan auditorlik tekshiruvlari miqdori va ularni o'tkazish ko'lami auditorlik tekshiruvini o'tkazish uchun sarflanadigan vaqt, unda ishtirok etadigan mutaxassislar tarkibi va sonining auditor (auditorlik firmasi) tomonidan baholanishidir. Auditorlik tekshiruvi hajmi, xo'jalik subyekti faoliyati to'g'risida ma lumotlarning olinishini hisobga olgan holda hamda kutilayotgan ishlar va xo'jalik subyekti bilan tuzilgan shartnomada belgilangan auditda ko'rsatiladigan xizmatlar hajmini prognoz qilish orqali auditor (auditorlik firmasi) tomonidan mustaqil aniqlanadi. "
        ]
    },
    {
        "word": "Auditorlik Xizmati ",
        "type": [],
        "definition": [
            " bajargan xizmati uchun haq olish sharti bilan shartnoma asosida tashkiliy tizimlarga bo'ysunmagan holda korxonaning moliyaviy-xo'jalik ishlari, buxgalteriya hisobi va hisoboti amaldagi tartib-qoidalarga qay darajada rioya qilingan holda olib borilayotganligini tekshirib berishdir. Bu tashkilot to'la mustaqillikka ega bo'lib, o'z ishini hisob-kitob va taftish qoidalariga rioya qilgan holda ohb boradi hamda korxona xo'jalik faoliyati moliyaviy jihatlarining tahlili bo'yicha ekspertiza va boshqa xizmatlarni amalga oshiradi. "
        ]
    },
    {
        "word": "Auditorlik Xulosasi ",
        "type": [],
        "definition": [
            "moliyaviy hisobotning to'g'riligi va buxgalteriya hisobi yuritish tartibining йопип hujjatlarida belgilangan talablarga muvofiqligi to'g'risida auditorlik tashkilotining fikri yozma ravishda ifodalangan, xo'jalik yurituvchi subyekt moliyaviy hisobotdan foydalanuvchilar uchun ochiq bo'lgan hujjat."
        ]
    },
    {
        "word": "Auditorlik Xulosasini Berishdan Bosh Tortish ",
        "type": [],
        "definition": [
            " auditorlik faoliyatining qoidalari (standartlari) bilan aniqlangan, yozma shaklda ifodalangan fikr. Bunda audit o'tkazish hajmiga ta’sir shunchalik darajada bo'ladiki, ijobiy, shartli ijobiy yoki salbiy auditorlik xulosalarini tayyorlash uchun auditor yetarli ma’lumotlar ola olmaydi hamda auditorning mustaqillik tamoyili buzilganda ham xulosa berishdan bosh tortish hollari yuz berishi mumkin. "
        ]
    },
    {
        "word": "Auditorlik Xulosasining Oʻzgarishi (Modifikatsiyasi) ",
        "type": [],
        "definition": [
            "- tushuntirish paragrafining qo'shilishi yoki ijobiy auditorlik xulosasida keltiriladigan farqli ravishda fikrni ifodalash ko'rinishida ifodalangan aniq namunaviy auditorlik xulosasi shaklining o'zgarishidir. "
        ]
    },
    {
        "word": "Auditorning (Bazaviy) Asosli Maʼlumoti ",
        "type": [],
        "definition": [
            "Oliy va o'rta maxsus o'quv yurtlarida nomzodlarga auditorlik attestatini olishga da’vogarlik qilish imkoniyatini beradigan mutaxassisliklar bo'yicha o'qish jarayonida olingan nazariybilim va amaliy malakalar majmuyi. "
        ]
    },
    {
        "word": "Auditorning Mahorati (Professional) ",
        "type": [],
        "definition": [
            "ko'rsatiladigan professional xizmatlar sifatli bo'lishiga imkon beruvchi auditorning ma’lum bir darajadagi bilim va malakaga ega bo'lishi mohiyatidan iborat auditning bir tamoyili. "
        ]
    },
    {
        "word": "Auditorning Mustaqilligi ",
        "type": [],
        "definition": [
            "tekshirilayotgan iqtisodiy subyekt bo'yicha auditorda fikrning shakllanishida unda moliyaviy, mulkiy, qarindoshlik yoki boshqa manfaatning yo'qligi hamda auditorlik tashkiloti rahbarlari, mulkdorlari bo'lgan yoki uchinchi shaxslari bilanbog' liqlikningmavjudbo' lmasligini o'zidamujassamlashtirgan auditning bir tamoyili."
        ]
    },
    {
        "word": "Auditorning Oliy Oʻquv Yurtidan Keyingi Professional Maʼlumoti ",
        "type": [],
        "definition": [
            "bunday ma’lumotni berish huquqiga ega bo'lgan tashkilotlarda o'qish natijasida olingan nazariy bilim va amaliy malakalar majmuyi. Bunga attestatsiya va litsenziya beruvchi auditorlik komissiyalari tomonidan ro'yxati tasdiqlangan auditorlarni o'qitish va qayta tayyorlash bo'yicha o'quv markazlari misol bo'la oladi. "
        ]
    },
    {
        "word": "Auditorning Proffesional Axloqi",
        "type": [],
        "definition": [
            "auditor umumiy manfaatlarining so'zsiz ustunligiga amal qilishi, shuningdek, auditor auditorlik kasbining ishonchligiga, uning hurmatiga putur yetkazadigan, auditorlik xizmatiga nomuvofiq bo'lgan xatti-harakatlaridan o'zini tiyishi va auditorlik kasbining obro'sini ko'tarish yo'lidagi auditning prinsiplaridan biri."
        ]
    },
    {
        "word": "Auditorning Xat Majburiyati ",
        "type": [],
        "definition": [
            "auditor (auditor tashkiloti) va uning mijozi o'rtasida audit tekshiruvi bo'yicha shartnoma rasmiylashtirilayotgan bosqichda qo'llaniladigan va bu ikki xo'jalik subyektlari javobgarliklari va majburiyatlarini o'z ichiga olgan hujjatlar. "
        ]
    },
    {
        "word": "Auditorning Xolisligi ",
        "type": [],
        "definition": [
            "auditorning xohlagan professional savollar va mulohazalar, yakunlar va xulosalarning shakllanishiga xolisona, odil va mustaqil, biror-bir shaxsning tazyig'iga asoslanmagan holda yondashish shartligini o'zida mujassamlashtirgan auditning bir tamoyili. "
        ]
    },
    {
        "word": "Auditor Yordamchisi ",
        "type": [],
        "definition": [
            "auditor malaka sertifikatiga ega bo'lmagan va auditorlik hisobotida, auditorlik va auditorning ekspert xulosasida hamda auditorlik tekshiruvini o'tkazish bilan bog'liq boshqa rasmiy hujjatda imzo chekish huquqiga ega bo'lmagan tarzda auditorning topshirig'iga binoan auditorlik tekshiruvida ishtirok etayotgan jismoniy shaxs. "
        ]
    },
    {
        "word": "Auksion",
        "type": [],
        "definition": [
            " (lot. auction) - kim oshdi savdosi, ochiq savdo qilish. Bu savdo davomida mahsulotni eng yuqori narx bo'yicha ko'targan xaridor sotib oladi. "
        ]
    },
    {
        "word": "Auksion",
        "type": [],
        "definition": [
            " tovar yoki mol-mulkning eng yuqori narx taklif qilgan shaxs tomonidan katta omma oldida oshkora sotib olinishi (kimoshdi savdosi). Auksion sotuvchining o'zi tashkil qilgan, majburiy yoki bu munosabatlarda komissioner sifatida chiqadigan maxsus tashkilot orqali amalga oshirilishi mumkin. Bu alohida xususiyatga ega bo'lgan va alohida joylarda tashkil etiladigan ochiq savdoga asoslangan maxsus bozor. Auksion o'zaro musobaqaga tayangan holda amalga oshadi. "
        ]
    },
    {
        "word": "Auksion",
        "type": [],
        "definition": [
            " tovarlarni ommaviy tarzda sotuvga qo'yish yo‘li bilan sotish uchun muayyan joylarda tashkil etilgan maxsus kim-oshdi savdo bozorlari. Xaridorlar orasida eng yuqori narxni taklif qilgan tovarni sotib oladi. Bu narx auksion narxi bo'ladi. "
        ]
    },
    {
        "word": "Autrayt",
        "type": [],
        "definition": [
            "oddiy muddatli valyuta bitimi bo'lib, bitim tuzuvchi tomonlar qat’iy belgilangan muddatlarda “Forvard” kursi bo'yicha to'lovlarni ko'zda tutadi. "
        ]
    },
    {
        "word": "Autsayderlar",
        "type": [],
        "definition": [
            "1. Bozorda kam ahamiyatli o'rinni egallovchi firma va kompaniyalar. 2. Xalqaro kemasozlikda bozorda muntazam konferensiyalar doirasida faoliyat ko'rsatadigan kemasozlik korxonalari va ular bilan raqobat qiluvchilar. "
        ]
    },
    {
        "word": "Autsion",
        "type": [],
        "definition": [
            "tovar oldi-sotdisini tashkil qilish usullaridan biri bo'lib, unda transaksiya xarajatlari real vaqt rejimida o'tadi. "
        ]
    },
    {
        "word": "Aval",
        "type": [],
        "definition": [
            "alohidakafolatyozuvigaegako‘rinishdagiveksellitalabnoma.Talabnomani bergan shaxs (avalchi) ushbu talabnoma (veksel) bo'yicha har qanday majburiyatning bajarilishiga mas’ul shaxslar (akseptant, veksel beruvchi, indossantlar) veksel egasi oldidagi mas’uliyatni o'z bo'yniga oladi. Aval vekselning hamma summasiga yoki uning bir qismiga qabul qilinishi mumkin. Veksel bo'yicha asosiy qarzdor mas’uliyati qaratilganda avalchi ham mas’uliyatdan ozod bo'ladi. Aval vekselning old tomonigayoki qo'shimcha varaqda, ya’ni alohida oddiy imzo chekish yo'li bilan amalga oshiriladi. Aval vekselning ishonchliliginioshiradivabubilanvekselningmuomaladabo'lishiga yordam beradi. "
        ]
    },
    {
        "word": "Avans",
        "type": [],
        "definition": [
            "korxonaning bajariladigan ish, o'tkaziladigan mol-mulk, ko'rsatilgan xizmatlar va boshqalar uchun to'lanadigan to'lovlar hisobiga beradigan yoki pul o'tkazish yo'li bilan amalga oshiriladigan dastlabki pul summasi yoki boshqa mulkiy qiymat. Avans - kredit shartlarida ko'rsatib berilganda, majburiy bo'lib, u shartnoma (kontrakt)da kelishilgan summaning 10-40 foizini tashkil etadi. 100 foiz avans to'lash kamdan-kam qo'llaniladi. Majburiyatlar bajarilmay qolgan taqdirda Avans qaytarib berilishi kerak. Yirik shartnomalar tuzilganda, Avans bank kafolati bilan ta’minlanadi. Avans (bay puli, zadatok)dan farqli o'laroq, majburiyatni bajarishni ta’minlash usuli hisoblanadi. "
        ]
    },
    {
        "word": "Avantyurs",
        "type": [],
        "definition": [
            "xatarning turli-tumanligi, ya’ni tasodifiy muvafFaqiyatga mo'ljallangan va haqiqiy kuch, sharoitlar va imkoniyatlarni hisobga olmasdan amalga oshiriladigan tadbir (harakat). Odatda, muvaffaqiyatsizlikka mahkum."
        ]
    },
    {
        "word": "Avariya Komissari ",
        "type": [],
        "definition": [
            " sug'urta kompaniyasining vakolatiga ega bo'lgan jismoniy yoki yuridik shaxs. Sug'urtalangan kema yoki yuk bo'yicha ko'rilgan zararning xarakteri va miqdorini aniqlaydi, hodisa ro'y berishi sabablarini o'rganadi. Sug'urta kompaniyasi avariya komissarini chet elda ham, mamlakat ichkarisida ham tayinlashi mumkin. Avariya komissarining yuridik manzili, telefon va teleks raqamlari sug'urta kompaniyasi tomonidan beriladigan sug'urta polisida ko'rsatiladi. Sug'urtalanuvchi sug'urta hodisasi ro'y berishi zahoti avariya komissariga murojaat qilishi zarur. Avariya komissari mol-mulkning zararlanganlik darajasini aniqlaydi va sug'urta kompaniyasining topshirig'iga asosan, ko'rilgan zararni qisman qoplashi mumkin. Avariya komissari bajarilgan ishlar to'g'risida sug'urta kompaniyasi uchun avariya sertifikati tuzadi yoki unga yozma axborot tayyorlaydi. "
        ]
    },
    {
        "word": "Avariya Sertifikati ",
        "type": [],
        "definition": [
            " mol-mulk sug'urta hodisasi tufayli zararlanganda, ko'rilgan zararning miqdori va xarakterini tasdiqlovchi hujjat. Avariya sertifikati avariya komissari (adjaster) tomonidan tuziladiva tegishli komissiya haqi hisobiga sug'urtalanuvchiga taqdim etiladi. Avariya sertifikati sug'urtalanuvchining sug'urta qoplamasini olish to'g'risidagi arizasiga ilova qilinadi va qoplamani to'lashda sug'urta kompaniyasiga asos bo'lib xizmat qiladi. "
        ]
    },
    {
        "word": "Averaj",
        "type": [],
        "definition": [
            " tovarning o'rtacha miqdori. "
        ]
    },
    {
        "word": "Avista",
        "type": [],
        "definition": [
            "vekselda yoki pulli hisob-kitoblar qilinadigan boshqa hujjatda ushbu hujjat ko'rsatilganda yoki u ko'rsatilgan kundan e’tiboran o'tgan ma’lum muddatda mazkur hujjat bo'yicha haq to'lanishi kerakligini tasdiqlovchi yozuv. "
        ]
    },
    {
        "word": "Avizo",
        "type": [],
        "definition": [
            "(ital. aviso) - bank, tijorat amaliyotida hisob-kitob harakatlarining bajarilganligi to'g'risida rasmiy xabarnoma. Bir kontragent tomonidan ikkinchisiga jo'natiladi. Avizo yordamida banklar o'z mijozlarini hisob varaqalari bo'yicha kirim va kredit qaydlari, hisob varaqasidagi qoldiq mablag'lar, pul o'tkazmalarini to'lash, chek talabnomasi akkreditiv ochish va boshqa harakatlar to'g'risida xabardor qiladi. Tovar jo'natuvchi tomonidan tovarni qabul "
        ]
    },
    {
        "word": "Avtarkiya",
        "type": [],
        "definition": [
            "(grek. autarkeia - o'z-o'ziga yetarli) o'zini-o'zi mahsulotlar bilan ta’minlab, boshqalar bilan kamdan-kam aloqaga kirishishdir. Asosan, natural xo'jalikka xosdir."
        ]
    },
    {
        "word": "Avtokorrelyatsiya",
        "type": [],
        "definition": [
            "keyingi darajalar bilan oldingilari o'rtasidagi yoki haqiqiy darajalari bilan tegishli tekislangan qiymatlari o'rtasidagi farqlar orasidagi korrelyatsiyadir. "
        ]
    },
    {
        "word": "Avtоkratliк",
        "type": [],
        "definition": [
            "hokimlik, kishining buyruqbozlik, ko'rsatmalar berish, jazolash kabi shakllarda boshqalarga (masalan, o'qituvchining talabaga) nodemokratik usullardan foydalangan holda ta sir etishga moyilligi."
        ]
    },
    {
        "word": "Avtomatik (Oʻrnatilgan) Barqarorlashtirgichlar",
        "type": [],
        "definition": [
            "budjet-soliq siyosatining iqtisodiy tebranishlar tasirini avtomatik zaiflashtiruvchi elementlari. "
        ]
    },
    {
        "word": "Avtomatlashtirilgan Axborot Tizimi ",
        "type": [],
        "definition": [
            "axborotlar yig'indisi, axborotlarni ishlash va boshqaruv qarorlarini qabul qilish uchun yo'naltirilgan matematik-iqtisodiy usullar, modellar, dasturlar, mexanizmlar, texnologik vositalar va mutaxassislar yig'indisi. "
        ]
    },
    {
        "word": "Avtomatlashtirilgan Axborot Texnologiyasi ",
        "type": [],
        "definition": [
            "ma’lumotlarni uzatish, to'plash, saqlash va qayta ishlash uchun hisoblash texnikasi va aloqa tizimlari usullari hamda vositalari qo'llaniladigan axborot texnologiyasi."
        ]
    },
    {
        "word": "Avtomatlashtirilgan Bank Maʼlum О Tlari ",
        "type": [],
        "definition": [
            "avtomatlashtirilgan axborot tizimi, ya’ni markazlashtirilgan holda saqlanadigan va birgalikda ishlatiladigan ma’lumotlardir. "
        ]
    },
    {
        "word": "Avtomatlashtirilgan Ish Joylari ",
        "type": [],
        "definition": [
            "mutaxassislarning bajaradigan funksiyalarini avtomatlashtirish uchun kerakli axborotlar, dasturlar va axborot resurslari yig'indisi. "
        ]
    },
    {
        "word": "Avtomatlashtirish",
        "type": [],
        "definition": [
            "mashinalar, mexanizmlar, uskunalar yordamida inson ishtirokisiz faqat uning nazorati ostida ishlab chiqarish, boshqarish va jamiyat funksiyalarini amalga oshirish, absolyut kam ishchilar ishtirokida mexanik operatsiyalarni bajarish. "
        ]
    },
    {
        "word": "Avtonom Investitsiyalar",
        "type": [],
        "definition": [
            " asosiykapitalga qilingan investitsiyalarning yalpi ichki mahsulot hajmi o'zgarishiga bog'liq bo'lmagan qismi. "
        ]
    },
    {
        "word": "Avtonom Isteʼmol ",
        "type": [],
        "definition": [
            " shaxsiy iste’mol xarajatlarining yalpi milliy daromad (shaxsiy tasarrufdagi daromad - SHTD) o'zgarishiga bog'liq bo'lmagan qismi. SHTD nolga teng bo'lganda ham avtonom iste’mol to'plangan mulk va jamg'armalarning kamayishi yoki qarz hisobiga amalga oshiriladi."
        ]
    },
    {
        "word": "Avtonom Isteʼmol Sarflari ",
        "type": [],
        "definition": [
            "iste’mol sarflarining bir qismi, uning miqdori va dinamikasi iste’molchi ixtiyoridagi daromadga bog'liq bo'lmaydi. "
        ]
    },
    {
        "word": "Avtonom Jami Sarflar ",
        "type": [],
        "definition": [
            "jami daromadning bir qismi, uning har bir vaqt doirasidagi miqdori va dinamikasi iste’molchi ixtiyoridagi joriy daromadga bog'liq bo'lmaydi. "
        ]
    },
    {
        "word": "Avtoritet",
        "type": [],
        "definition": [
            "xodimlarning rahbarni hurmat qilishi, hurmat yuzasidan uning fikr-mulohazalari va maslahatlariga quloq tutishi, uning gapini ikki qilmaslikka, buyruqlarini o'z vaqtida o'rinli bajarishga urinishi. "
        ]
    },
    {
        "word": "Avuarlar",
        "type": [],
        "definition": [
            "1. Majburiyatlar sotilishi va o'rni to'ldirilishida amalga oshiriladigan aktivlar (pul mablag'lari, cheklar, veksellar, pul o'tkazish, akkreditivlar). Avuarlarning turlari: cheklanmagan erkin holda foydalaniladigan davlat yoki banklar ixtiyorida bo'ladigan; foydalanishning ma’lum tartibi bilan belgilangan; 2. Bankning xorijiy banklar-korrespondentlaridagi schyotida xorijiy valyuta ko'rinishidagi mablag'lari. "
        ]
    },
    {
        "word": "Avans",
        "type": [],
        "definition": [
            " bunak. Biror ish evaziga keyinchalik hisob-kitob qilish sharti bilan oldindan beriladigan pul, mahsulot, oziq-ovqat va h.k. "
        ]
    },
    {
        "word": "Axborot",
        "type": [],
        "definition": [
            " ma’ lumot va xabarlar to'plami b о ‘ lib, mazmunan yangilik unsurlariga ega bo'ladi va boshqaruv vazifalarini hal etish uchun o'ta zarurdir. "
        ]
    },
    {
        "word": "Axborot Egasi ",
        "type": [],
        "definition": [
            "qonun yoki axborot egasi tomonidan belgilangan huquqlar doirasida axborotga ega bo'lgan va undan foydalanayotgan hamda foydalanish vakolatlarini amalga oshirayotgan subyekt."
        ]
    },
    {
        "word": "Axborot Izlash ",
        "type": [],
        "definition": [
            " axborot massivida oldindan belgilangan izlash sharti talabini qondiruvchi yozuvlar borligini aniqlash jarayoni. "
        ]
    },
    {
        "word": "Axborot Izlash Tizimi ",
        "type": [],
        "definition": [
            " ma’lumotlar bazasi va jami axborot resurslarida axborot izlash uchun mo'ljallangan tizim. "
        ]
    },
    {
        "word": "Axborot Mahsuloti ",
        "type": [],
        "definition": [
            " saqlash, qayta ishlash va uzatish obyekti bo'lgan ma’lumotlarning materiallashtirilgan shakli."
        ]
    },
    {
        "word": "Axborot Makoni",
        "type": [],
        "definition": [
            "elektron tarmoqlardan foydalangan holda paydo bo'luvchi birlashgan elektron axborot makoni."
        ]
    },
    {
        "word": "Axborot Manbayi ",
        "type": [],
        "definition": [
            " axborot yuzaga kelishini identifikatsiyalovchi obyekt. "
        ]
    },
    {
        "word": "Axborot Resursi ",
        "type": [],
        "definition": [
            " axborot tizimi tarkibidagi elektron shakldagi axborot, ma’lumotlar banki, malumotlar bazasi."
        ]
    },
    {
        "word": "Axborot Resurslari (Zaxiralari) ",
        "type": [],
        "definition": [
            "tashkilot uchun qadr-qimmatga ega bo'lgan moddiy zaxira sifatida qatnashadigan ma’Iumotlar yig'indisi tushuniladi. Ular jumlasiga ma’Iumotlar fayli, hujjatlar, matnlar, grafikalar, bilimlar, audio-video axborotlar kiradi. "
        ]
    },
    {
        "word": "Axborot Resurslari Sektori ",
        "type": [],
        "definition": [
            " axborot resurslarini yig'ish, tizimga keltirish va turkumlash; rahbar-xodimlar uchun turli mavzulardagi axborotlarni tayyorlash. "
        ]
    },
    {
        "word": "Axborot Taʼminoti ",
        "type": [],
        "definition": [
            " hujjat aylanmasi va hujjatlar shaklini ratsional holga keltirishni o'z ichiga olgan axborotni joylashtirish va tashkil qilish bo'yicha uslublar va vositalar yig'indisidir. "
        ]
    },
    {
        "word": "Axborot Texnologiyasi ",
        "type": [],
        "definition": [
            "axborotni to'plash, saqlash, izlash, unga ishlov berish va uni tarqatish uchun foydalaniladigan jami uslublar, qurilmalar, usullar va jarayonlar. "
        ]
    },
    {
        "word": "Axborot Tizimi ",
        "type": [],
        "definition": [
            "axborotni to'plash, saqlash, izlash, unga ishlov berish hamda ulardan foydalanish imkonini beradigan, tashkiliy jihatdan tartibga solingan jami axborot resurslari. "
        ]
    },
    {
        "word": "Axborot Xavfsizligiga Tahdid ",
        "type": [],
        "definition": [
            "manbalariga raqiblar, jinoyatchilar, korrupsiyachilar hamda boshqa buzg'unchilar kiradi. "
        ]
    },
    {
        "word": "Axborotga Sanksiyasiz Kirish ",
        "type": [],
        "definition": [
            "kirishga huquqi bo'lmagan shaxsning qonunbuzarlik yo'li bilan konfidensial axborotga ega bo'lishidir. "
        ]
    },
    {
        "word": "Axborotga Tahdid ",
        "type": [],
        "definition": [
            " axborotning konfidensialligi, butunligi, to'laligi va u bilan tanishish qoidasining buziUshi tushuniladi. "
        ]
    },
    {
        "word": "Axborotlashtirish ",
        "type": [],
        "definition": [
            "yuridik va jismoniy shaxslarning axborotga bo'lgan ehtiyojlarini qondirish uchun axborot resurslari, axborot texnologiyalari hamda axborot tizimlaridan foydalangan holda sharoit yaratishning tashkiliy ijtimoiy-iqtisodiy va ilmiy-texnikaviy jarayoni. "
        ]
    },
    {
        "word": "Axborotlashtirish Sohasidagi Davlat Siyosati",
        "type": [],
        "definition": [
            "axborotlashtirish sohasidagi davlat siyosati axborot resurslari, axborot texnologiyalari va axborot tizimlarini rivojlantirish hamda takomillashtirishning zamonaviy jahon tamoyillarini hisobga olgan holda milliy axborot tizimini yaratishga qaratilgan dir."
        ]
    },
    {
        "word": "Axborotli Malaka ",
        "type": [],
        "definition": [
            "ta’lim-tarbiya masalalariga axborotlarni moslashtirish va talqin qilish malakasi."
        ]
    },
    {
        "word": "Axborotni Oshkor Qilish ",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar bozorida manfaatdor shaxslarning axborotni qaysi maqsadda olishidan qat’i nazar, mazkur axborotdan uning topilishi va olinishini kafolatlaydigan shakllarda foydalanishini ta’minlash. "
        ]
    },
    {
        "word": "Axborotni Tayyorlashning Tahliliy-Sintetik Sektori ",
        "type": [],
        "definition": [
            "axborot tahlili va hujjatli axborodar sintezi: hujjatlarni o'rganish, ulardan eng muhimlarini ajratish, tashqi muhitga tarqatish, u yoki bu shaklda umumlashtirilgan natijalarni tayyorlash. "
        ]
    },
    {
        "word": "Axborotning Beixtiyor Chiqib Ketishi ",
        "type": [],
        "definition": [
            "konfidensial axborotning tashkilot hududidan yoki ishonch bildirilgan shaxslar orasidan nazoratsiz chiqib ketishidir. "
        ]
    },
    {
        "word": "Axborot Infratuzilmasi ",
        "type": [],
        "definition": [
            " mamlakat axborot fazosining rivojlanishi va o zaro faoliyatini ta’minlovchi tizimchalar, tashkiliy tarkiblar majmuyi. "
        ]
    },
    {
        "word": "Axloq",
        "type": [],
        "definition": [
            " shaxsning jamiyat va boshqa kishilarga nisbatan burchini belgilab beruvchi me’yorlar tizimi, ma’naviy xulq qoidalari, ijtimoiy ong shakllaridan biri. "
        ]
    },
    {
        "word": "Ayiq",
        "type": [],
        "definition": [
            "birjalarda narx pasayishini kutib (“ho‘kiz”ning aksi) harakat qiladigan kommersant (tojir). Bu ibora narx pasayadi deb hisoblaydigan odamlar uchun ham ishlatiladi. "
        ]
    },
    {
        "word": "Ayirboshlash ",
        "type": [],
        "definition": [
            "almashish, ayirboshlash; biror tovarni boshqa tovar yoki mahsulotga almashtirish. "
        ]
    },
    {
        "word": "Ayirboshlash Tenglamasi ",
        "type": [],
        "definition": [
            "pul taklifi (M), pul aylanish tezligi (V), tovar va xizmatlarning o'rtacha narxi (R), sotilgan tovar va xizmatlarning umumiy miqdori (Q)larni bog'lovchi tenglama: M*V=P*Q_ "
        ]
    },
    {
        "word": "Aylanma Fondlar ",
        "type": [],
        "definition": [
            "ishlab chiqarish fondlarining xomashyo, yoqilg'i, yordamchi materiallarda ifodalangan qismi bo'lib, ular bir doiraviy aylanish davomida o'zining moddiy, buyum shaklini butunlay yo'qotadi va ishlab chiqarilgan mahsulotga o'z qiymatini to'liq o'tkazadi. Ular jumlasiga mehnatga haq to'lash uchun avanslangan mablag'lar ham kiradi. "
        ]
    },
    {
        "word": "Aylanma Ishlab Chiqarish Fondlari",
        "type": [],
        "definition": [
            "ishlab chiqarishda foydalaniluvchi mehnat predmetlari (xomashyo, materiallar, o'rov materiallari, ta’mirlash uchun ehtiyot qismlar va hokazo). Har bir ishlab chiqarish siklida to'liq sarflanadi hamda korxonaning aylanma mablag'lari hisobiga sotib olinadi."
        ]
    },
    {
        "word": "Aylanma Kapital ",
        "type": [],
        "definition": [
            "xomashyo materiallar, energetika resurslarida moddiylashgan va bir ishlab chiqarish siklida sarflanuvchi, o'z qiymatini tayyorlangan mahsulotga to'liq ko'chiruvchi kapital. "
        ]
    },
    {
        "word": "Aylanma Kassa Mablagʻi Meʼyori ",
        "type": [],
        "definition": [
            "moliya yilida Qoraqalpog'iston Respublikasi budjeti va mahalliy budjetlar hisob-varaqlarida turishi mumkin bo'lgan pul mablag'larining qonun hujjatlari bilan belgilanadigan eng kam miqdori. "
        ]
    },
    {
        "word": "Aylanma Mablagʻlar",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyektlarning aylanma fondlari va muomala fondlarini tashkil etuvchi mablag'lar. Aylanma fondlar tarkibiga ishlab chiqarish zaxiralari, tugallanmagan ishlab chiqarish, kelgusi davr xarajatlari kiradi. Aylanma mablag'lar normalashtiriladigan (bunda xomashyo, materiallar, yoqilg'i, tugallanmagan ishlab chiqarish va boshqalarga normalar belgilanadi) va normalashtirilmaydigan (pul mablag'lari, hisob- kitobdagi mablag'lar) turlarga bo'linadi. Shakllanish manbalariga qarab aylanma mablag'lar o'z va qarzga olingan mablag'larga bo'linadi. O'z mablag'lari korxonada normal ishlash uchun zarur bo'lgan, minimal miqdorda bo'lishi kerak. Korxona faoliyatining ayrim davrlarida (mavsumiy normativdan ortiq ishlab chiqarish zaxiralari vujudga kelganda, mavsumiy ishlab chiqarish xarajatlari mavjud bo'ladi va h.k) talab bank krediti hisobiga qondiriladi. Aylanma mablag'lardan samarali foydalanish ko'rsatkichi ularning aylanib turishi hisoblanadi. "
        ]
    },
    {
        "word": "Aylanma Mablagʻlarning Aylanishi ",
        "type": [],
        "definition": [
            "aylanma mablag'larining bir aylanishini kunlarda yoki ma’lum davrda ularning aylanish soni davomiyligini bildiradigan iqtisodiy ko'rsatkich. Bu ko'rsatkich aylanma mablag'lardan foydalanish samaradorhgini ko'rsatadi. Aylanma mablag'lar aylanishining tezlashishi mablag' larni bo'shatishga olib keladi. Bu bo'shagan mablag'lar qo'shimcha mahsulot ishlab chiqarish va boshqa maqsadlar uchun ishlatiladi. Bu korxonaga bir hajmdagi aylanma mablag'lar bilan ko'proq mahsulot ishlab chiqarib, uni tezroq sotish va shu bilan o'zining moliyaviy holatini yaxshilash imkoniyatini beradi. "
        ]
    },
    {
        "word": "Aylanma Vedomostlar ",
        "type": [],
        "definition": [
            "buxgalteriya hisobi schyotlarining hisob registrlari ma’lumotlarini umumlashtirish usuli. Aylanma vedomostlar schyotlarning oy boshiga va oxiriga qolgan qoldig'i hamda oy bo'yicha aylanma ma’lumotlarga asosan, oy oxirida tuziladi, aylanma vedomostlar sintetik va analitik schyotlar bo'yicha tuzilishi mumkin. Aylanma vedomostda uch juft xonalar mavjud bo'lib, ularda har bir schyot bo'yicha oy boshiga qoldiq, oy aylanmalari va oy oxiriga qolgan qoldiq ko'rsatiladi. Aylanma vedomostdagi o'zaro tenglik debet va kredit aylanmalari registratsiya jumalining jamiga ham teng bo'lishi kerak. Buning sababi har bir xo'jalik muomalasining summasi registratsiya jurnalida hamda schyotlaming debet va kreditida aks ettiriladi. Bunday o'zaro tenglik katta nazorat ahamiyatiga ega. Aylanma vedomostning schyotlar bo'yicha qoldiqlariga asosan buxgalteriya balansi tuziladi. Aylanma vedomostlarni tuzish ko'p mehnat talab qiladigan jarayon. Buxgalteriya hisobi shakllari va hisob registratsiya usullari takomillashishi natijasida aylanma vedomostlar asta-sekin yo'qola bormoqda. Hisobni zamonaviy tashkil etishda ular istisno tarzida ayrim hollarda qo'llaniladi. "
        ]
    },
    {
        "word": "Aylanma Kapital ",
        "type": [],
        "definition": [
            "xomashyo materiallar, energetika resurslarida moddiylashgan va bir ishlab chiqarish siklida sarflanuvchi, o'z qiymatini tayyorlangan mahsulotga to'liq ko'chiruvchi kapital. "
        ]
    },
    {
        "word": "Ayrim Mehnat Taqsimoti ",
        "type": [],
        "definition": [
            "ishlar va mehnat funksiyalarining ayrim korxona yoki alohida tashkilot xodimlari o'rtasida: sexlar, uchastkalar, brigadalar, zvenolar, ayrim ijro etuvchi xodimlar bo'yicha, shuningdek, ularning kasb-malaka guruhlari o'rtasidagi taqsimot. "
        ]
    },
    {
        "word": "Axborotni Oshkor Qilish ",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar bozorida manfaatdor shaxslarning axborotni olish maqsadidan qat’i nazar, axborotdan foydalanishini ta’minlash."
        ]
    }
]