[
    {
        "word": "Baholar Indeksi ",
        "type": [],
        "definition": [
            "tovar va xizmatlar yoki aktivlar o'rtacha bahosining o'zgarishi ko'rsatkichi. Baholar indeksi bozor savati deb yuritiladigan ma’lum to plamdagi tovar va xizmatlarning joriy yildagi baholari yig‘indisini bazis yildagi baholari yig‘indisiga bo'lib topiladi. "
        ]
    },
    {
        "word": "Baholar Masshtabi ",
        "type": [],
        "definition": [
            "mamlakatda pul birligi sifatida qabul qilingan oltin yoki kumush miqdori. Barcha tovarlar bahosi va o'lchanishini belgilash uchun xizmat qiladi. "
        ]
    },
    {
        "word": "Baholovchi Va Nazorat Maʼlumotlarni Shakllantirish ",
        "type": [],
        "definition": [
            "- boshlang'ich ma’lumotlarni yig'ish, tahlil qilish uchun ishlov berish, bo'linmalar faoliyatini nazorat qilish va ularni baholash uchun ushbu axborotlardan foydalanish tadbirlari majmuasi."
        ]
    },
    {
        "word": "Bah О (Narx) ",
        "type": [],
        "definition": [
            "tovar qiymatining puldagi ifodasi. Mahsulot ishlab chiqarish uchun sarflangan xarajatlar va foydani ko'rsatadi. "
        ]
    },
    {
        "word": "Bakalavr, Magistr",
        "type": [],
        "definition": [
            " oliyta’limning tegishli bosqichiga muvofiq dasturlami muvaffaqiyatli o'zlashtirgan shaxslarga beriladigan akademik darajalar. "
        ]
    },
    {
        "word": "Balans ",
        "type": [],
        "definition": [
            "“Balans” atamasi lotincha “bis” - ikki marta, “banx” - tarozi pallasi so'zlaridan tarkib topgan bo'Ub, tom ma’noda “ikki palla” degan ma’noni anglatadi va tenglik, muvozanat tushunchasi sifatida ishlatiladi. Balans doimo o'zgarib turadigan, o'zaro aloqada bo'lgan holatni ta’riflovchi ko'rsatkichlar tizimining tengligi. Balans ikki qismdan iborat bo'lgan jadval shaklida ma’lum bir sanaga tuziladi. Balans qandaydir voqeani ta’riflab, uning qismlarga munosabatini ko'rsatadi. Balans alohida korxona, ishlab chiqarish birlashmasi (buxgalteriya balansi, korxonaning daromad va xarajatlar balansi) yoki xalq xo'jaligi (aholining daromad va xarajat balansi, to'lov balansi, savdo balansi, qishloq xo'jalik mahsulotlari balansi va b.) masshtabida tuziladi. "
        ]
    },
    {
        "word": "Balans Foyda ",
        "type": [],
        "definition": [
            " mahsulot tannarxiga kiritiladigan barcha xarajat va chiqimlar hamda majburiy to'lovlar chegirilganidan so'nggi korxona yalpi daromadining qismi. Balans foyda soliqqa tortilgunga qadar bo'lgan yalpi foydadir. "
        ]
    },
    {
        "word": "Balans Qiymati ",
        "type": [],
        "definition": [
            "buxgalteriya balansida asosiy fondlar va aylanma mablag'larning pulda ifodalangan bahosi. "
        ]
    },
    {
        "word": "Balans Reja ",
        "type": [],
        "definition": [
            "korxonadagi moliyaviy mablag'lardan foydalanish tuzilishi va aktivlari tarkibining rej a davri oxiridagi natij alarini prognozlashtirish jarayonini aks ettiradi. "
        ]
    },
    {
        "word": "Balans Usuli ",
        "type": [],
        "definition": [
            "hisobga olinishi zarur bo'lgan hamma narsa. Ikki taraflama, ya’ni hisobga olinayotgan narsaning o'zi nima va qanday manbalar hisobiga sotib olinganligi nuqtayi nazaridan qaraladi. Xuddi mana shu balans usulining asosida yotadi. Balans har doim ikki qismdan iborat bo'lgan jadval sifatida tuziladi. Balansning aktiv (chap tarafi) qismida xo'jalik vositalari hisobga olinadi, passiv (o'ng tarafi) qismida esa ularni sotib olish yoki shakllanishi manbayi ko'rsatiladi. "
        ]
    },
    {
        "word": "Balansdan Tashqari Schyotlar ",
        "type": [],
        "definition": [
            "qoldig'i buxgalteriya balansiga kirmaydigan buxgalteriya hisobi schyotlari. Bu schyotlar korxonada vaqtincha turgan va boshqa korxonalar (ijaraga olingan asosiy vositalar, mas’ul saqlashga qabul qilingan moddiy qiymatliklar va h.k.)ga tegishli bo'lgan tovar-moddiy qiymatliklarni hisobga olish uchun tayinlangan. Balansdan tashqari schyotlarda, shuningdek, qat’iy hisobot blankalari, zararga hisobdan chiqarilgan debitorlik qarzlari ham hisobga olinadi. Balansdan tashqari schyotlarda hisob oddiy tizimda, ya ni ikki yoqlama yozuv qo'llanmasida yuritiladi. Bu schyotlaro'zaroyokibalanslischyotlarbilankorrespondentlanmaydi. "
        ]
    },
    {
        "word": "Balansli Qiymat ",
        "type": [],
        "definition": [
            "1. Uzoq muddatli aktivning yig'ilib qolgan eskirish qiymati chegirib tashlangandan keyingi qoladigan dastlabki qiymati (o'z kapitalning kamyob majburiyat va moddalari); yanada kengroq ma’noda - tegishli schyotning qoldiq kamayishini hisobga olgan holdagi mazkur aktiv qiymati. 2. Kompaniyaning balans qiymati; majburiyatlar yig'indisi chegirib tashlangandan keyin qoladigan sof aktivlar va yig'ma aktivlari; xususiy kapital. 3. Aksiyaning balans qiymati; kompaniyaning hisob-kitob hujjatlari asosida aniqlanadi; kompaniyaning yig'ma aktivlari va yig'ma majburiyatlari o'rtasidagi farqqa imtiyozlashtirilgan qimmatli qo'g'ozlarning tugatilish qiymati, muomalaga kiritish uchun chiqarilgan oddiy aksiyalar soniga taqsimlab olingan summa, u oddiy aksiyalarning balans qiymatidan iborat bo'ladi."
        ]
    },
    {
        "word": "Balansli Schyotlar ",
        "type": [],
        "definition": [
            "ko'rsatkichlari buxgalteriya balansida aks ettiriladigan buxgalteriya hisobi schyotlari. Lekin bu balans moddalarining nomlari balansli schyotlar nomlariga to'g'ri keladi, degan ma’noni bildirmaydi. Bir balansli schyotning ma’lumotlari bir necha balans moddalarida va aksincha, bir balans moddasida bir necha schyotlar ma’lumotlari aks ettirilishi mumkin. Buxgalteriya hisobi nazariyasi manbalarida balansli schyotlarning ma’nosi yetarlicha yoritilmagan. Shunday schyotlar borki, ular buxgalteriya balansi tuzilishidan oldinyopilib ketadi. Balansda aks ettirish uchun bu schyotlarning keyingi hisobot davri boshiga saldosi bo'lmaydi. Schyotlar rejasidagi 9-tranzit schyotlarning aksariyati shunday schyotlar tarkibiga kiradi. Schyotlar rejasidagi barcha schyotlar ham balansdagi schyotlar hisoblanmaydi. Balansdagi schyotlardan tashqari schyotlar mavjud."
        ]
    },
    {
        "word": "Balansning В Oʻlimi ",
        "type": [],
        "definition": [
            " buxgalteriya balansining aktiv va passividagi bir xillik, moddalar guruhi. Balansning aktivida ham, passivida ham ikkitadan bo'lim mavjud: aktivida: birinchi bo'lim - uzoq muddatli aktivlar; ikkinchi bo'lim - joriy aktivlar; passivida: birinchi bo'lim - o'z mablag'lari manbalari; ikkinchi bo'lim - majburiyatlar. Baholash - xo'jalik mablag'lari, majburiyatlar va xo'jalik jarayonlarini pul o'lchov birligida aks ettirish usulidir. "
        ]
    },
    {
        "word": "Band Aholi ",
        "type": [],
        "definition": [
            " ijtimoiy ishlab chiqarishning fuqarolik sektorida band bo'lgan va mamlakat qonunchiligi tomonidan belgilangan normalarga mos ravishda hisobga olinadigan mehnatga layoqatli yoshdagi aholi. "
        ]
    },
    {
        "word": "Banderol",
        "type": [],
        "definition": [
            "aksiz yoki boj to'lovlari to'langanligi haqidagi tovardagi belgi. "
        ]
    },
    {
        "word": "Bandlik",
        "type": [],
        "definition": [
            " itimoiy mehnatga qobiliyatli bo'lgan aholi darajasi. To'la ish bilan bandlik - ishga talabgorlarni ish joyi bilan ta’minlab, ularning samarali mehnat qilishga erishishini, shu bilan birgalikda, kelajakda iqtisodiyotning o'sishi uchun minimal mehnat rezervi qilinishini bildiradi. Iqtisodiy rivojlangan mamlakatlarda to'la bandlik ishga talabgorlaming 94-96% ishlagani holda 4-6% mehnat rezervida turishini bildiradi."
        ]
    },
    {
        "word": "Bandlik Darajasi ",
        "type": [],
        "definition": [
            "bandlar umumiy sonining mehnatga layoqatli yoshdagi aholiga nisbati. "
        ]
    },
    {
        "word": "Bandlikning Klassik Nazariyasi ",
        "type": [],
        "definition": [
            "iqtisodiyot fanida klassik maktab namoyandalari tomonidan ilgari surilgan makroiqtisodiy nazariya. Uning asosiy qoidalaridan biri iqtisodiyot o'zini-o'zi tartibga solish bozor mexanizmiga ega va u aholining to'la bandligi uchun sharoit yaratadi, davlat iqtisodiyotni tartibga solishga aralashmasligi zarur. "
        ]
    },
    {
        "word": "Bank",
        "type": [],
        "definition": [
            " vaqtincha bo'sh turgan pul mablag'larini bir joyga to'plash va kimda bu pullarga vaqtinchalik muhtojlik bo'Isa, ularga kredit sifatida berish bilan shug'ullanuvchi kredit-moliya muassasasidir. Bank faqatgina xo'jalik tashkilotlarining vaqtincha bo'sh turgan pul mablag'larini bir joyga to'plash bilan cheklanib qolmay, balki aholining qo'lida ham vaqtincha bo'sh turgan pul mablag'larini jamg'arma banklarida omonat sifatida to'plab, ulardan kredit resurslari sifatida foydalanadi. Bank vaqtincha bo'sh turgan pul mablag'larini omonat sifatida qo'yuvchilarga ma’lum miqdorda foiz to'lab, undan kredit olganlardan yuqoriroq foiz stavkasi oladi. Ular o'rtasidagi farqdan bank foydasi hosil bo'ladi. Bankning amalga oshiradigan ishlarini ikki turga ajratish mumkin: birinchisi - bank resurslarini tashkil qilish, ya’ni sust ishlar; ikkinchisi - bu resurslami joylashtirish va ulardan foydalanish, ya’ni faol ishlar hisoblanadi. "
        ]
    },
    {
        "word": "Bank Aksepti ",
        "type": [],
        "definition": [
            "bankning to'lov hujjatlarini to'lashga rozilik bildirishini ularning to'lanishini kafolatlash shakli tegishli bank akseptant yozuvi ko'rinishida rasmiylashtiriladi. "
        ]
    },
    {
        "word": "Bank Aktivlari ",
        "type": [],
        "definition": [
            "banklarning asosiy faoliyatini amalga oshirishda foydalanuvchi turli moddiy va moliyaviy resurslar majmuyi. Ular, asosan, bank kreditlari, asosiy vositalari, sotib olgan qimmatli qog'ozlari, investitsiyalari, valyuta boyliklari ko'rinishida bo'ladi. "
        ]
    },
    {
        "word": "Bank Biletlari ",
        "type": [],
        "definition": [
            "Markaziy bank tomonidan muomalaga chiqariladigan pul belgilarining bir turi. "
        ]
    },
    {
        "word": "Bank Depozitlari ",
        "type": [],
        "definition": [
            "jismoniy va yuridik shaxslarning bank muassasalariga ma’lum muddatga va muddatsiz omonat shaklida qo'yilgan bo'sh pul mablag'lari. "
        ]
    },
    {
        "word": "Bank Emitenti ",
        "type": [],
        "definition": [
            "muomaladagi pul birliklari, qog'oz pullar hisob-to'lov hujjatlari chiqaradigan bank."
        ]
    },
    {
        "word": "Bank Foiz Stavkasi",
        "type": [],
        "definition": [
            "bank ssudasidan foydalanganlik uchun belgilangan haq miqdori, qarz summasiga nisbatan foiz hisobida undiriladi. Bank foiz stavkasi o'zgaruvchan ko'rsatkich bo'lib, bank ssudasi qarzga bo'lgan muhtojlikka qarab o'zgartiriladi. Bank foiz stavkasi miqdori bank va mijoz o'rtasidagi kelishuvga muvofiq belgilanib, qarzning qaysi tarzda va qanday shartlarda berilishiga bog'liq. "
        ]
    },
    {
        "word": "Bank Foizi",
        "type": [],
        "definition": [
            "bank kreditidan foydalanganlik uchun belgilangan haq miqdori; qarz miqdoriga nisbatan foiz hisobida undiriladi. "
        ]
    },
    {
        "word": "Bank Kafilligi ",
        "type": [],
        "definition": [
            "bankning o'z mijoziga kafolati. Bank o'z mablag'i hisobidan mijozning ko'rsatilgan muddatda to'lanmagan majburiyatlaribo'yichahisob-kitob qilish kafilligini oladi. Kafil bank mijozining bo'nak, avansini qaytarish, savdo-sotiq shartnomasini tuzish va shunga o'xshash shartlarni bajarishi mumkin."
        ]
    },
    {
        "word": "Bank Kapitali ",
        "type": [],
        "definition": [
            "1. Banklarga jalb qilingan va ular tomonidan kredit hisobkitob va boshqa operatsiyalar uchun foydalanadigan pulli kapitallar yig'indisi, ya’ni bank resurslari. 2. Bank kapitalining oz qismini tashkil etuvchi banklarning o'z kapitali. "
        ]
    },
    {
        "word": "Bank Kapitalining Yetarlilik Darajasi ",
        "type": [],
        "definition": [
            "jami kapitalning riskka tortilgan aktivlarga nisbati bo'lib, u xalqaro Bazel kelishuviga ko'ra kamida 8 %ni tashkil etishi kerak "
        ]
    },
    {
        "word": "Bank Koʻchirmasi ",
        "type": [],
        "definition": [
            "korxona va tashkilotlaming banklardagi hisobkitob schyotlaridan ko'chirmasi pul mablag'larining harakati haqidagi bildirgi. Bank ko'chirmasi bankda korxona hisob-kitob schyotibo'yicha amalga oshirilganyozuvlarningnusxasihisoblanadi. "
        ]
    },
    {
        "word": "Bank Korrespondent ",
        "type": [],
        "definition": [
            " boshqa banklar bilan o'zaro munosabatlarda bo'ladigan va ularning topshiriqlari bilan ma’lum bir moliyaviy jarayonlarni bajaruvchi bank."
        ]
    },
    {
        "word": "Bank Krediti ",
        "type": [],
        "definition": [
            "banklar tomonidan ish yurituvchilarga pul ssudasi shaklida beriladigan kredit. U qisqa muddatli (odatda, bir yil muddatga), o'rtacha muddatli (besh yilgacha muddatga) va uzoq muddatli (besh yildan ko'proq muddatga) bo'ladi. Bank krediti moliya muassasalari (banklar, fondlar, tashkilot va uyushmalar) tomonidan har qanday xo'jalik subyektlari (tadbirkorlar, korxonalar, tashkilotlar va boshqalar)ga pul shaklida ssuda tarzida beriladi. Bank krediti eksport va importni kreditlashda ssuda formasida namoyon bo'ladi va u tovarlar, tovar hujjatlari, veksellar hamda trattani garovga olgan holda beriladi. Ba’zan banklar o'zlariga chambarchas aloqada bo'lgan yirik eksportyor-firmalarga blankli kredit, ya’ni rasmiy ta’minlanmagan kreditlar berishadi. "
        ]
    },
    {
        "word": "Bank Likvidliligi ",
        "type": [],
        "definition": [
            "banklarning o'z majburiyatlarini vaqtida qaytara olish qobiliyati yoki passivlardagi majburiyatlarni qaytarish uchun aktivlarning pulga aylanish qobiliyatidir. "
        ]
    },
    {
        "word": "Bankmarjasi",
        "type": [],
        "definition": [
            " kredit berish ta’minoti summasi bilan kredit berilgan summasi o'rtasidagi farq. "
        ]
    },
    {
        "word": "Bank Nazorati",
        "type": [],
        "definition": [
            "1. Rezerv tizimi (Markaziy bank) tomonidan banklar faoliyatining nazorat qilinishi. 2. Bankkreditiningdebitortomonidan sarflanishini nazorat qilish. "
        ]
    },
    {
        "word": "Bank Operatsiyalari ",
        "type": [],
        "definition": [
            "banklarning o'z maqsadlariga erishish va harakat qilishi vositalari. Ular aktiv va passiv operatsiyalarga bo'linadi, shuningdek, banklar har xil turdagi xizmadarni ham ko'rsatadi (faktoring, lizing, konsalting, trast va h. k)."
        ]
    },
    {
        "word": "Bank Passivlari ",
        "type": [],
        "definition": [
            "yuridik va jismoniy shaxslarning bosh pul mablag'lari, o'z mablag'lari hamda Markaziy bankning kreditlaridan tashkil topadigan, bank xarajatlari bilan bog'liq operatsiyalar majmuyi. "
        ]
    },
    {
        "word": "Bank Resurslari ",
        "type": [],
        "definition": [
            "banklar ixtiyorida bo'lgan va ular tomonidan kredit, investitsiya va boshqa aktiv operatsiyalari uchun foydalaniladigan mablag'lar yig'indisi. Bank resurslari o'z mablag'lari va jalb etilgan mablag'larga bo'linadi. O'z mablag'Iariga bankning ustav, zaxira va boshqa fondlari kiradi. Jalb etilgan resurslar - bu bank mijozlari (yuridik va jismoniy shaxslar)ning hisob-kitob, joriy, depozit va boshqa hisob-varaqlaridagi mablag'lar, jamoat tashkilotlari, xilma-xil ijtimoiy fondlarning mablag'laridir. Emissiya, oborotdagi pullar, hisob-varaqlaridagi mablag'lar, budjet mablag'lari, aholi jamg'armalarining bir qismi, valyuta va oltin zaxiralariga qo'yilgan mablag'lar markaziy bank resurslari hisoblanadi. "
        ]
    },
    {
        "word": "Bank Rezervlari ",
        "type": [],
        "definition": [
            "bankda saqlanayotgan naqd pullar, markaziy bankda saqlanayotgan foizsiz depozitlar. "
        ]
    },
    {
        "word": "Bank Sindikati ",
        "type": [],
        "definition": [
            " sinditsiyalashtirilgan kredit berish borasida ikki yoki undan ortiq banklar o'rtasida o'zaro kelishuv. "
        ]
    },
    {
        "word": "Bank Tizimi ",
        "type": [],
        "definition": [
            "biror-bir davlatda mavjud bo'lgan va amal qilib turgan banklarning barchasi tushuniladi. Masalan, O'zbekiston Respublikasi bank tizimi o'z ichiga: 1. Markaziy bank. 2. Tashqi iqtisodiy faoliyat milliy banki. 3. Ixtisoslashtirilgan aksiyadorlik tijorat va davlat banklari majmuyidan iborat bo'lgan 31 ta bankni o'z ichiga oladi. 4. Ulush, qo'shish, hissadorlik hamda xorijiy kapitallar ishtiroki asosida tashkil topgan qo'shma banklar, kooperativ va xususiy banklardan iborat. "
        ]
    },
    {
        "word": "Bank Tizimining Likvidligi ",
        "type": [],
        "definition": [
            "bankning o'z majburiyatlarini vaqtida va so'zsiz bajara olish imkoniyati. "
        ]
    },
    {
        "word": "Bank Uyushmalari ",
        "type": [],
        "definition": [
            "xususiy banklarning professional manfaatlarini himoya qilish maqsadida tuzgan birlashmalari. Bank uyushmalari banklar uchun eng qulay qonun normalarini ta’minlash choralarini ko'radi, bank operatsiyalarini o'tkazish qoidalarini bir xillashtiradi va ularning bajarilishi ustidan nazoratni amalga oshiradi, axborot markazlari hisoblanadi. Hududiy belgi bo'yicha ham, banklarning ixtisoslashishi bo'yicha ham tashkil etiladi. "
        ]
    },
    {
        "word": "Bank Zaxiralari ",
        "type": [],
        "definition": [
            "bankda saqlanayotgan naqd pullar, Markaziy bankda tijorat banklari tomonidan saqlanayotgan foizsiz depozitlar. Banklar o'zxavfsizligini taminlash maqsadida o'zlarida saqlaydigan omonatlar miqdorining bir qismi, banklar omonatlarining hamma miqdorini qarzga bera olmaydilar, chunki omonat egalari ulami har qanday vaqtda qaytarib olishlari mumkin. Shuning uchun banklar o'zlarining to‘lash qobiliyatlarini ta’minlash, bankrot bo'lib qolmasliklari uchun bank zaxirasini shakllantiradi. "
        ]
    },
    {
        "word": "Banklar Likvidligi ",
        "type": [],
        "definition": [
            " banklar aktivlarining qisqa muddat ichida pulga aylanish qobiliyati. Likvidlik bank majburiyatlarini bajarish va aktivlar o'sishini moliyalash bilan birgalikda depozitlar va qarz mablag'lari darajasining pasayishini samarali boshqarishni ham bildiradi. "
        ]
    },
    {
        "word": "Banklar Va Moliya ",
        "type": [],
        "definition": [
            " mamlakatda jahon savdosi va investitsiya sohasida foydalaniladigan barcha moliyaviy instrumentlar mavjudligi ushbu sohadagi xizmatlar sifatini anglatadi. "
        ]
    },
    {
        "word": "Banklararo Kreditlar ",
        "type": [],
        "definition": [
            "bank kreditining keng tarqalgan shakllaridan biri. Banklararo kreditning joriy stavkasi ma lum bir tijorat bankining boshqa turdagi ssudalar berish siyosatini aniqlab beruvchi muhim omili. Bu normaning aniq miqdori Markaziy bank tomonidan belgilanadi. "
        ]
    },
    {
        "word": "Banklardan Tashqari Kredit ",
        "type": [],
        "definition": [
            "moliyaviy institutlar - investitsion, moliyaviy va sug'urta kompaniyalari, nafaqa fondlari, jamg'arma kassalar, lombardlar, kredit kooperatsiyalari, ko'pgina bank operatsiyalarini amalga oshiradi, lekin rasman bank hisoblanmaydi. "
        ]
    },
    {
        "word": "Banklarning Aktiv Operatsiyalari ",
        "type": [],
        "definition": [
            "bankning kredit berishi yoki ixtiyoridagi resurslarni joylashtirishi bilan bog'liq operatsiyalari. Ular kredit, ssuda berish vositasida va veksel, tovar hisobiga, fondli va blankali shakllarda amalga oshiriladi. "
        ]
    },
    {
        "word": "Banklarning Nizom Jamg Armalari ",
        "type": [],
        "definition": [
            "banklarning doimiy tasarrufida bo'lgan moddiy va pul mablag'lari yig'indisi bo'lib, ularning miqdori banklar tashkil topgan chog'da nizomda qat’iy belgilab qo'yiladi. "
        ]
    },
    {
        "word": "Banklarning Passiv Operatsiyalari ",
        "type": [],
        "definition": [
            "banklarning o'z resurslarini shakllantirish bilan bog'liq operatsiyalari. Bular mijozlarning omonatlarini bankka jalb qilish, boshqa banklardan kredit olish, qimmatli qog'ozlarni chiqarish va h.k."
        ]
    },
    {
        "word": "Banklarning Umumiy Kapitali ",
        "type": [],
        "definition": [
            " banklarning o'z faoliyatlari (bank operatsiyalari)ni amalga oshirish uchun mo'ljallangan moliyaviy resurslari bo'lib, u banklar tomonidan turli manbalar orqali jalb etilgan pul kapitalidan iborat. Banklarning umumiy kapitali xususiy kapital bilan bir qatorda undan bir necha barobar ko'proq bo'lgan jalb etilgan kapitalni ham o'z ichiga oladi. "
        ]
    },
    {
        "word": "Bank-Moliya Tizimining Barqarorligi ",
        "type": [],
        "definition": [
            " banklar va boshqa moliya muassasalarining o'z majburiyatlari yuzasidan talablarga to'la javob bera olishi. Bu likvidlilik, kapitalning yetarliligi, aktivlar sifati, rentabellik ko'rsatkichlari orqali aniqlanadi. "
        ]
    },
    {
        "word": "Bankning Komission Foizi ",
        "type": [],
        "definition": [
            "o'z mijozining manfaati yo'lida bank operatsiyalarini amalga oshirganlik uchun bankka ajratiladigan komission ajratmalar."
        ]
    },
    {
        "word": "Bankning Likvidliligi ",
        "type": [],
        "definition": [
            "bankning o'z aktivlari va passivlari nisbati hamda strukturasi bilan belgilanadigan majburiyatlarni muddatida qoplash qobiliyati. "
        ]
    },
    {
        "word": "Bankning Oʻz Kapitali ",
        "type": [],
        "definition": [
            "bank aktivlarining passivlaridan (majburiyatlaridan) ortiqcha miqdori. Masalan, bank aktivlari 15 mln. doll., passivlari esa 12 mln. doll. Unda bankning o'z kapitali 3 mln. doll.ni (15-12) tashkil etadi. Bankning o'z kapitali birlamchi aksionerlik kapitali, zaxirasi va jamg'arilgan foydadan tashkil topadi. Uning bank resurslaridagi ulushi 10 %. "
        ]
    },
    {
        "word": "Banknota",
        "type": [],
        "definition": [
            " mamlakat Markaziy banki tomonidan chiqariladigan naqd qog'oz pullar bo'lib, iqtisodiyotdagi pul taklifming bir qismini tashkil etadi. "
        ]
    },
    {
        "word": "Banknotlar",
        "type": [],
        "definition": [
            "bank biletlari - markaziy emissiya banklari tomonidan chiqariladigan pul belgilari. Hozirgi kunda ular qo'g'oz pullarning asosiy turi hisoblanadi. "
        ]
    },
    {
        "word": "Banknotlar Muomalasi Harakati ",
        "type": [],
        "definition": [
            "markaziy banklar tomonidan chiqarilgan muomala va to'lov vositasi sifatidagi bank biletlarining faoliyat ko'rsatishi. "
        ]
    },
    {
        "word": "Banko",
        "type": [],
        "definition": [
            "bankning qimmatbaho qog'ozlarni xarid qilishda va sotishdagi bahosi, kursi. "
        ]
    },
    {
        "word": "Bankomat",
        "type": [],
        "definition": [
            "mijozning bankdagi hisob raqami bilan kompyuter tizimi orqali bog'langan naqd pul beruvchi elektron moslama. "
        ]
    },
    {
        "word": "Bankrot",
        "type": [],
        "definition": [
            "1. Mulkiy sinish, xonavayron bo'lish. 2. G'oyaviy, ma’naviy-siyosiy jihatdan obro'sizlanish. 3 Xo'jalik sudi tomonidan e’tirof etilgan, qarzdorning pul majburiyatlari bo'yicha kreditorlar talablarini to'la hajmda qondirishga yoki majburiy to'lovlar bo'yicha o'z majburiyatini bajarishga qodir emasligi."
        ]
    },
    {
        "word": "Bankrotlik (Sinish) ",
        "type": [],
        "definition": [
            "qarzli nochorlik, tadbirkorning o'z qarz majburiyatlari bo'yicha mablag‘i bo'lmaganligi uchun to'lashdan bosh tortishi. Kompaniya sudning qarz majburiyatlari bo'yicha hisoblashish qobiliyati yo'qligi haqidagi qaroridan so'ng formal darajada bankrot bo'lib qoladi. Sud kompaniyaning o'z iltimosi (o'z xohishi bo'yicha tugatilishi) yoki uning kreditlari talabi bilan (majburiy tugatilish) qaror chiqaradi. "
        ]
    },
    {
        "word": "Barcha Strategik Maqsadlar Oʻrtasida Bogʻliqlik Va Korxona Moliyaviy Strategiyasining “Maqsadlar Daraxtiʼ Ni Shakllantirish",
        "type": [],
        "definition": [
            "bosh, asosiy va yordamchi maqsadlar yagona kompleks tizim sifatida qaraladi va shuning uchun ularning muhimligi hamda darajasini hisobga olgan holda aniq o'zaro bog'liqlik talab qilinadi. Bunday korxona moliyaviy faoliyati alohida strategik maqsadlari bog'liqligi “maqsadlar daraxti” asosida ta’minlanadi. Bu metodik usul asosida faoliyatning turli maqsadlari o'zaro bog'liqligi vabo'ysunuvchanligi grafik tasviri yotadi. Korxona moliyaviy strategiyasi “maqsadlar daraxti” qurilishiningprinsipial sxemasi quyidagi rasmda keltirilgan. "
        ]
    },
    {
        "word": "Barcha Turdagi Iqtisodiy Faoliyatlarni Xalqaro Andozalar Asosida Tasniflash ",
        "type": [],
        "definition": [
            "makroiqtisodiy statistikaning muhim tasniflaridan biri hisoblanadi. Bunday tasniflash birligi qilib alohida korxona yoki muassasa olinadi va ular ishlab chiqarayotgan mahsulot yoki xarajatlar tarkibi, yoxud qo'yilayotgan texnologiyalari bir xil bo'lgan taqdirda ayrim tarmoqlarga birlashtiriladi. "
        ]
    },
    {
        "word": "Barqarorlik",
        "type": [],
        "definition": [
            "narsa va hodisalarning amal qilishi hamda rivojlanishdagi o'ziga xos muayyanlik holati. "
        ]
    },
    {
        "word": "Barter",
        "type": [],
        "definition": [
            "savdo-sotiq faoliyatining bir turi bo'lib, mahsulot ayirboshlash pul to'lovisiz sodir bo'ladi. Almashuv mahsulotlar narxi, xalqaro va ichki bozor narxlari, sifati, yetkazib berish shartlari hisobga olinib, ular o'rtasidagi nisbat o'rnatiladi. "
        ]
    },
    {
        "word": "Barter Bitimi ",
        "type": [],
        "definition": [
            " pul to'lovisiz tovar ayirboshlash bitimi. "
        ]
    },
    {
        "word": "Bartet Usuli ",
        "type": [],
        "definition": [
            " pulsiz bevosita tovar ayirboshlash. "
        ]
    },
    {
        "word": "Bashorat",
        "type": [],
        "definition": [
            " ma’lum axborotlar, raqamlar, hisoblar va sharoitga tayanib bashorat qilish."
        ]
    },
    {
        "word": "Bashorat Qilinadigan Sarflar ",
        "type": [],
        "definition": [
            " zaxiralarga investitsiya qilish. "
        ]
    },
    {
        "word": "Bashoratlash ",
        "type": [],
        "definition": [
            "kelajakda ro'y berishi mumkin bo'lgan turli hodisa va j arayonlarni statistik, ijtimoiy, iqtisodiy vaboshqa turdagi tadqiqotlar yordamida ilmiy asoslangan holda awaldan aytib berish. "
        ]
    },
    {
        "word": "Bastia F. ",
        "type": [],
        "definition": [
            " (1801 -1850) - fransuz iqtisodchisi, “Iqtisodiy garmoniyalar” kitobi va g'oyasi, “manfaatlar uyg'unligi” va “xizmatlar” nazariyalari muallifi. "
        ]
    },
    {
        "word": "Baza",
        "type": [],
        "definition": [
            "asos, tayanch, quyi qism, ombor va boshqalar. Tijorat ishlarida band bazalar; mol qabul qiluvchi, qayta ishlovchi, nav va turlarga ajratuvchi va saqlovchi bazalardan iborat. "
        ]
    },
    {
        "word": "Bazayili",
        "type": [],
        "definition": [
            " narx indeksi hisoblaganda, boshqa yillarda mavjud bo'lgan narxlarga solishtirish uchun asos qilib olinadigan yil. U har doim 100% qilib olinadi (qarang: narx indeksi)."
        ]
    },
    {
        "word": "Bazis Narxlar ",
        "type": [],
        "definition": [
            "molning sifati yoki navini aniqlash uchun belgilanadigan narx, u oldi-sotdi bitimida kelishilgan bo'ladi va yetkazib beriladigan molning haqiqiy narxini belgilash uchun asos bo'lib xizmat qiladi. Molning sifat koVsatkichlari bazis narxlar uchun asos qilib olingandan farqlansa, uning bazis sortdan yaxshi va yomonligiga kora oldindan kelishilgan miqdorda qoshimcha haq belgilanadi yoki pasaytiriladi. "
        ]
    },
    {
        "word": "Bazel Qo Mitasi Talablari ",
        "type": [],
        "definition": [
            "bank tizimining barqaror amal qilishi hamda o‘z majburiyatlarini bajara olishini ta’minlash uchun ornatilgan xalqaro me’yorlar majmuyi bo'lib, u kapitalning yetarlilik darajasini, banklami nazorat qilish jarayoniga hamda bozor intizomiga qo'yilgan talablami ifodalaydi. "
        ]
    },
    {
        "word": "Befarqlik Chizigʻ1 ",
        "type": [],
        "definition": [
            " shaxs uchun bir xil naf beradigan bo'sh vaqt, ish vaqti va ish haqi (daromad) kombinatsiyalarini ifodalovchi egri chiziq (bu yerda bo'sh vaqt va ish vaqti 0 dan 24 soatgacha qiymat qabul qiladi va har bir ish vaqti ma’lum daromad va ish haqini ifodalaydi). "
        ]
    },
    {
        "word": "Belgi",
        "type": [],
        "definition": [
            " bu to'plam birligining alomatlari, xislati va h.k. "
        ]
    },
    {
        "word": "Belgilangan Stansiyagacha Franko ",
        "type": [],
        "definition": [
            "bunda jo'natish bo'yicha barcha xarajatlar temiryo'l tarifi qo'shilgan holda mol yetkazib beruvchi tomonidan to'lanadi. "
        ]
    },
    {
        "word": "Belgilangan Stansiyagacha Franko-Vagon ",
        "type": [],
        "definition": [
            "bu shunday narxki, bunda mol yetkazib beruvchi to'lov-talabnomasiga faqat temiryo'l tarifi summasini qo'shadi. "
        ]
    },
    {
        "word": "Belgilangan Almashuvkursi ",
        "type": [],
        "definition": [
            "milliy valyutaning chet el valyutalariga nisbatan an’anaviy tarzda belgilanadigan qiymati va o'zgarmas tizim. "
        ]
    },
    {
        "word": "Benefitsiar Bank ",
        "type": [],
        "definition": [
            " to'lov operatsiyasini yakunlovchi bank. "
        ]
    },
    {
        "word": "Beri Indeksi ",
        "type": [],
        "definition": [
            "mamlakat iqtisodiy risklari hajmini belgilovchi ko'rsatkich. "
        ]
    },
    {
        "word": "Bertran Muvozanati ",
        "type": [],
        "definition": [
            " bozor duopolik bo'lganda, firmalar tovar narxini tushirish va mahsulot ishlab chiqarish hajmini oshirish orqali bir-biri bilan raqobatlashadi. Tovar narxi chekli xarajatga teng bo'lganda, muvozanat holat barqarorlashadi."
        ]
    },
    {
        "word": "Bevosita Xarajatlar ",
        "type": [],
        "definition": [
            "bitta mahsulot ishlab chiqarish bilan bevosita bog'liq, miqdori ishlab chiqarish hajmining o'zgarishiga nisbatan o'zgaruvchan xarajatlar. "
        ]
    },
    {
        "word": "Bevosita Investitsiyalar ",
        "type": [],
        "definition": [
            "kapitalning to'g'ridan-to'g'ri eksporti bo'lib, investitsiya kirituvchiga shu korxona ustidan nazorat qilish huquqini beradi. "
        ]
    },
    {
        "word": "Bevosita Ishlab Chiqarish Uchun Soliqlar ",
        "type": [],
        "definition": [
            "institutsion birliklarning iqtisodiy faoliyatlari natijalariga bog'liq bo'lmagan holda to'lanadigan soliqlardan iborat, amaliyotda u to'g'ri soliq deb ham yuritiladi. Bu soliq tarkibiga mahsulot uchun soliqlardan tashqari, (rezident va norezident) institutsion birliklarning ishlab chiqarishda qatnashganligi uchun to'laydigan hamma soliqlari kiradi. "
        ]
    },
    {
        "word": "Bevosita Ishlab Chiqarish Uchun Subsidiyalar ",
        "type": [],
        "definition": [
            "rezident va norezident institutsion birliklarning ma’lum bir iqtisodiy faoliyat bilan shug'ullanishini qo'llab-quwatlash maqsadida davlat tomonidan (qonun bilan belgilangan tartibda) beriladigan subsidiyalardan iborat. "
        ]
    },
    {
        "word": "Bevosita Lizing",
        "type": [],
        "definition": [
            "bunda lizing kompaniyasi mijoz uchun uning buyurtmasi asosida mashina va uskunalarni ulami ishlab chiqarayotgan korxonalardan sotib oladi. "
        ]
    },
    {
        "word": "Bevosita Taʼsir Koʻrsatuvchi Tashqi Moliyaviy Muhit ",
        "type": [],
        "definition": [
            "korxonaning kontragentlar bilan moliyaviy operatsiyalar va bitimlar bo'yicha moliyaviy munosabatlari jarayonida shakllanadigan, tashkilotga, uning moliyaviy faoliyat shakllari va natijalariga ta’sir etuvchi shart-sharoitlar va omillar tizimini tavsiflaydi. Bunda bevosita ta’sir ko'rsatuvchi tashqi moliyaviy muhit bevosita kommunikativ (o'zaro bog'liq) aloqalar jarayoniga ta’sir ko'rsatishi mumkin. Bunday kontragentlar bilan moliyaviy faoliyat bo'yicha samarali moliyaviy munosabatlarni amalga oshirish korxona uchun ijobiy bo'lgan tegishli shart-sharoitlar va omillar tizimini boshqarish imkonini beradi. "
        ]
    },
    {
        "word": "Bevosita Usullar ",
        "type": [],
        "definition": [
            "iqtisodiyotni tartibga solishning taqiqlash, ruxsat berish va majbur qilish kabi ma’muriy vositalari."
        ]
    },
    {
        "word": "Bevosita Xarajatlar ",
        "type": [],
        "definition": [
            "mahsulotning ayrim turlari tannarxiga to'g'ridanto'g'ri, ya’ni bevosita o'tkaziladigan xarajatlar. Masalan, texnologik maqsadlar uchun sarflangan xomashyo va asosiy materiallar, ishlab chiqarishda band bo'lganlarning asosiy mehnat haqi va boshqalar."
        ]
    },
    {
        "word": "Bevosita Xorijiy Investitsiyadan Reinvestitsiya Qilinadigan Daromadlar ",
        "type": [],
        "definition": [
            " bevosita xorijiy investitsiya korxonasida hosil qilingan omonat yoki taqsimlanmagan foyda. Bunday daromadlar yo bo'lingan, yoki naqd pulsiz korxona kapitalidagi mulkda o'z ulushiga qarab bevosita chet el sarmoyadorlariga ulush tarzida bo'lib beriladi. So'ng bu mablag' reinvestitsiya qilinadi. "
        ]
    },
    {
        "word": "Blockchain",
        "type": [],
        "definition": [
            "(bloklar zanjiri) - bu ma'lum qoidalarga binoan qurilgan, ma'lumotlarni o'z ichiga olgan uzluksiz ketma-ketlikdagi bloklar zanjiri (bog'langan ro'yxat). Bloklar orasidagi bog'lanish nafaqat raqamlash bilan, balki har bir blokda o'z hash-sumi va oldingi blokning xash-yig'indisi bo'lishi bilan ham ta'minlanadi. Blokdagi ma'lumotlarni o'zgartirish uchun barcha keyingi bloklarni tahrirlashingiz kerak. Ko'pincha, blokcheynlarning nusxalari bir-biridan mustaqil ravishda turli xil kompyuterlarda saqlanadi. Bu ma'lumotlarga, shu jumladan bloklarga kiritilgan ma'lumotlarga o'zgartirish kiritishni nihoyatda qiyinlashtiradi"
        ]
    },
    {
        "word": "Bitcoin",
        "type": [],
        "definition": [
            "bu hech qanday moddiy ekvivalenti yo‘q va shunchaki ma’lumotlar bazasidagi qaydlar jamlanmasidan iborat virtual pullar."
        ]
    },
    {
        "word": "Bijuteriya",
        "type": [],
        "definition": [
            "zargarlik mollari savdosi. "
        ]
    },
    {
        "word": "Bilimlar Bazasi ",
        "type": [],
        "definition": [
            "aniq bir predmet sohasi bo'yicha dalillar va qoidalar shaklida rasmiylashtiriladigan bilimlar to'plami."
        ]
    },
    {
        "word": "Bilvosita (Egri) Xarajatlarni Taqsimlash Darajasi ",
        "type": [],
        "definition": [
            "kalkulyatsiya obyektlari o'rtasida bilvosita xarajatlami oldindan taqsimlash imkoniyatini yaratadigan va subyektning hisob siyosatida ko'rsatilgan oldindan hisoblangan me’yoriy daraja. "
        ]
    },
    {
        "word": "Bilvosita Soliqlar ",
        "type": [],
        "definition": [
            " qarang: egri soliqlar. "
        ]
    },
    {
        "word": "Bilvosita Usullar ",
        "type": [],
        "definition": [
            "iqtisodiyotni tartibga solishning iqtisodiy vosita va dastaklari. "
        ]
    },
    {
        "word": "Bilvosita Xarajatlar",
        "type": [],
        "definition": [
            " yordamchi ishchilarga vaqtbay ish haqi to‘lash, ishlab chiqarish asosiy vositalarining amortizatsiyasi, ishlab chiqarish asosiy vositalarini saqlash, joriy va kapital remont qilish hamda mahsulot hajmining o'zgarishidan qat’i nazar, nisbatan doimiy bo'lib qoladigan boshqa xarajatlar singari ishlab chiqarish jarayoniga xizmat ko'rsatish bilan bog'liq ishlab chiqarish ahamiyatidagi xarajatlar."
        ]
    },
    {
        "word": "Bilvosita Xarajatlarni Taqsimlash Asosi ",
        "type": [],
        "definition": [
            " bilvosita xarajatlarni yig‘uvchi obyektlarga taqsimlash uchun asos qilib olingan ko'rsatkich. Misol: bevosita mehnat haqi, asosiy vositalarning eskirishi va hokazo. "
        ]
    },
    {
        "word": "Bimetallizm",
        "type": [],
        "definition": [
            "pul tizimi bo'lib, unda umum ekvivalentlik roli ikkita asl metallar (odatda, oltin va kumush) bilan mustahkamlanadi va ularda har ikki metalldan yasalgan tangalar cheksiz muomalada bo'lishi ko'zda tutiladi. Bimetallizmning ikki turi ma’lum: 1. Parallel valyuta tizimi bo'lib, unda oltin bilan kumush o'rtasida ma’lum nisbat qonun bilan belgilanmaydi. 2. Ikkiyoqlama valyuta tizimi bo'lib, unda davlat har ikki metall o'rtasidagi ma’lum nisbatni qayd etadi."
        ]
    },
    {
        "word": "Bino Va Inshootlarni Kapital Taʼmirlash",
        "type": [],
        "definition": [
            "bazaviy va korpus detallari va uzellarini ta’mirlash, barcha eskirgan konstruksiyalarning detallari va uzellarini almashtirish yoki tiklash ishlari amalga oshiriladigan ta’mirlashdir."
        ]
    },
    {
        "word": "Birdavrda Yaratilgan Daromad ",
        "type": [],
        "definition": [
            "birlikning davr boshi holatiga ega bo'lgan aktivini kamaytirmagan holda ishlatilishi mumkin bo'lgan maksimal miqdordan iborat. "
        ]
    },
    {
        "word": "Birgalikda Ishlab Chiqarilgan Mahsulot ",
        "type": [],
        "definition": [
            " birgalikdagi faoliyat natijasi bo'lgan tovarlar (ishlar, xizmatlar). "
        ]
    },
    {
        "word": "Birgalikda Sugʻurta Qilish ",
        "type": [],
        "definition": [
            "bitta sug'urta shartnomasi doirasida riskning ikki yoki undan ortiq sug'urta kompaniyalari o'rtasida taqsimlanishi. Ushbu shartnomada har bir sug'urtalovchining huquq va majburiyatlari ko'rsatiladi. Birgalikda sug'urta qilishda sug'urtalanuvchiga qo'shma polis yoki har bir sug'urta kompaniyasi o'z zimmasiga olgan risk hissasiga muvofiq alohida polis beriladi. "
        ]
    },
    {
        "word": "Biriktirilgan Daromadlar ",
        "type": [],
        "definition": [
            "o'zlarining tegishli budjetga biriktirilganligiga qarab, to'liq yoki qat’iy belgilangan hissada (foizda) doimiy ravishda yoki ma’lum bir muddat davomida u yoki bu budjetga tushuvchi daromadlar (soliqlar). "
        ]
    },
    {
        "word": "Biriktirilgan Soliqlar ",
        "type": [],
        "definition": [
            "har bir darajadagi budjetlarga biriktirilgan soliqli daromadlarning barcha turlari."
        ]
    },
    {
        "word": "Birja",
        "type": [],
        "definition": [
            " (goll. beurs, nem. Borse - hamyon) - 1. Mahsulot, valyuta va qimmatbaho qog'ozlarni ayirboshlashda, hisob va ma’lumot xizmatlarini amalga oshirishda faol qatnashuvchi tashkilot. Xizmat ko'rsatgani uchun birja vositachilik yig'imini oladi. Birja XVII asrda paydo bo'lgan va belgiyalik savdogar Delya Birjaning nomi bilan atalgan. Uning uyida va uyi oldidagi maydonda italiyalik bank egalari savdogarlarning yig'ilishlari bo'lib o'tar edi. "
        ]
    },
    {
        "word": "Birja Bahosi ",
        "type": [],
        "definition": [
            "birja savdosi orqali sotilayotgan tovarlar bahosi bo'lib, tegishli tovar bahosining darajasi va dinamikasi yuzasidan ma’lumotlarning muhim va ishonchli manbayi hisoblanadi. "
        ]
    },
    {
        "word": "Birja Chayqovchiligi ",
        "type": [],
        "definition": [
            " bitimni tuzish va uni bajarish paytidagi kurslar orasidagi farqdan chayqovchilik foydasi olish maqsadida birjada qimmatli qo'g'ozlar bilan bitimlarni amalga oshirish. Birja chayqovchiligining asosiy usuli qimmatli qo'g'ozlarni muddatli sotib olish va sotishdan iborat, bunda bitim qimmatli qo'g'ozlarni kontragentga amalda berish bilan emas, balki faqat narxlardagi farqni to'lash bilan tugallanadi. "
        ]
    },
    {
        "word": "Birja Kursi ",
        "type": [],
        "definition": [
            " birjada muomalada bo'ladigan qimmatbaho qo'g'ozlar (aksiya, obligatsiyalar)ning sotuv bahosi. Aksiyalarning birja kursi dividend miqdorigato‘g‘ridan-to‘g'ri,pulbozoridagissudafondidarajasigaesa teskari bog'liq bo'ladi. Aksiyalarning nominal bahosi uning kursiga ta’sir qilmaydi, chunki aksiyalar uni chiqargan korxona tomonidan sotib olinadi. Aksiyalardan farqli o'laroq, obligatsiyalarning nominal bahosi uning kursiga ta’sir qiladi. Binobarin, obligatsiyalarni sotib olish muddati qanchalik yaqin bo‘Isa, uning ta’siri shuncha ko'p bo'ladi. Aksiyalarning birja kursi obligatsiyalar kursiga qaraganda konyunktura jihatdan ko'proq o'zgarib turadi. "
        ]
    },
    {
        "word": "Birja Savdosi ",
        "type": [],
        "definition": [
            "birjalar vositachiligida amalga oshiriladigan savdo. "
        ]
    },
    {
        "word": "Birja Soligʻi ",
        "type": [],
        "definition": [
            "birja oboroti (aylanmasi)dan olinadigan soliq. Proporsional stavkalar bo'yicha olinib, uning darajasi bitimlar summasiga nisbatan 1% dan 2,5% gacha tebranadi. Uning soliqqa tortish obyekti fond birjasidagi qimmatbaho qog'ozlar oboroti (aylanmasi) hisoblanadi. Soliqqa tortishda asos sifatida qimmatbaho qog'ozlar bo'yicha bitimlarning imzolanishi maydonga chiqadi. Soliqning ikki xil ko'rinishi bo'lishi mumkin: a) birja oboroti (aylanmasi)dan olinadigan respublika solig'i. Uning soliqqa tortish obyekti - fond birjasidagi qimmatbaho qog'ozlar oboroti (aylanmasi)ning hajmi. Soliq respublika budjetiga borib tushadi; b) birja mahalliy solig'i. Bu birjada sodir bo'ladigan qimmatbaho qog'ozlar bitimi bo'yicha yig'imdan iboratdir. "
        ]
    },
    {
        "word": "Birja Kotirovkasi ",
        "type": [],
        "definition": [
            "birjalar orqali sotiladigan mahsulotlar bahosi. Har bir birja ularni ma’lum tizimga soladi va chop etadi. Odatda, birja kotirovkasi ertalabki va kechki savdo (birja sessiyasi) boshlanishiga va tugashiga mo'ljallab chop etiladi. "
        ]
    },
    {
        "word": "Birlamchi Bozor ",
        "type": [],
        "definition": [
            "birlamchi bozor qimmatli qog'ozlarni emmitenti, ya’ni investorlarga erkin sotish uchun qimmatli qog'ozlarni chiqaruvchi xususiy yoki davlat muassasasi (tashkiloti) tomonidan birlamchi joylashtirish bo'yicha operatsiyalarni o'z ichiga oladi. "
        ]
    },
    {
        "word": "Birlamchi Daromad ",
        "type": [],
        "definition": [
            " institutsion birliklar tomonidan milliy daromadni birlamchi taqsimlash natijasida olingan daromadlar: ish haqi, mulkdan olingan daromadlar, foyda, aralash daromad, ishlab chiqarish va import solig'idan iborat. "
        ]
    },
    {
        "word": "Birlamchi Daromad Sifatida Mehnat Haqi ",
        "type": [],
        "definition": [
            "rezident birliklarning mamlakat iqtisodiy hududi va tashqi dunyodan ish haqi sifatida olgan daromadlaridan iborat. "
        ]
    },
    {
        "word": "Birlamchi Daromad Sifatida Soliqlar",
        "type": [],
        "definition": [
            "bevosita ishlab chiqarish va mahsulot uchun soliqlardan iborat. Mulk va daromad soliqlari birlamchi daromad hisoblanmaydi. "
        ]
    },
    {
        "word": "Birlamchi Daromadlar ",
        "type": [],
        "definition": [
            "institutsion birliklar ishlab chiqarish jarayonida ishtirok etish yoki ishlab chiqarish uchun zarur bo'lgan aktivlarga egalik qilish natijasida oladigan daromadlar."
        ]
    },
    {
        "word": "Birlamchi Daromadlar Qoldigʻ1 (Saldo) ",
        "type": [],
        "definition": [
            "institutsion birliklar yoki sektorlar barcha daromaddan to'lashi zarur bo'lgan to'lov summasi chegirib tashlangandan so'ng qolgan daromad yig'indisidan iborat. "
        ]
    },
    {
        "word": "Birlamchi Hujjatlar",
        "type": [],
        "definition": [
            " buxgalteriya hujjatlari bo'lib, xo'jalik jarayoni sodir bo'lgan vaqtda tuziladi va ular sodir etilganligi haqida birlamchi guvohnoma hisoblanadi. "
        ]
    },
    {
        "word": "Birlamchi Jamoalar",
        "type": [],
        "definition": [
            " bular bo'limlar, xizmatlar, uchastkalar, brigadalar, jamoalar bo'lib, ular xodimlarni ayrim texnologiya jarayoni asosida birlashtirib, bu jarayonni amalga oshirish bilan xodimlar bevosita munosabatlarga kirishadilar. "
        ]
    },
    {
        "word": "Birlamchi Talab ",
        "type": [],
        "definition": [
            "yangi tovarga paydo bo'ladigan va shakllanadigan dastlabki talab. "
        ]
    },
    {
        "word": "Birlashgan Millatlar Tashkiloti (Bmt) ",
        "type": [],
        "definition": [
            "davlatlarning jahonning muhim muammolarini hal etish uchun tuzgan tashkilotidir. BMT xalqlarning tinch-totuv yashashiga bo'lgan ezgu irodasining ramzi, insoniyat ma’naviy taraqqiyotining yorqin nishonasidir. Jahon hamjamiyatiga dadil qadamlar bilan kirib borayotganmustaqilO'zbekistonbunufuzlitashkilotgal993-yilning mart oyida a’zo bo'ldi. Birinchi Prezidentimiz I.A. Karimovning 1993-yil 26-28- sentabr kunlari Nyu-Yorkka qilgan safari tarixiy voqea bo'ldi. Davlatimiz rahbari BMT Bosh Assambleyasining 48-sessiyasida birinchi marta mustaqil O'zbekiston vakili sifatida nutq so'zladi."
        ]
    },
    {
        "word": "Birlashmalar",
        "type": [],
        "definition": [
            " bir necha korxonalarning ma’lum masalalarni birgalikda hal qilish maqsadida birlashish jarayoni. "
        ]
    },
    {
        "word": "Birlikning Aktivlari ",
        "type": [],
        "definition": [
            "birlikning o'z mablag‘lari dan, boshqalarga nisbatan bo'lgan talab (haq)lardan iborat. "
        ]
    },
    {
        "word": "Birlikning Debitorlik Qarzi ",
        "type": [],
        "definition": [
            "uning qarzi emas. Bu - birlikning aktivi bo'ladi. Debitorlikning kamayishi birlikning debitor birlikka nisbatan talabi kamayishini bildiradi. "
        ]
    },
    {
        "word": "Birlikning Kreditorlik Qarzi ",
        "type": [],
        "definition": [
            "uning kredit olgan birlik oldidagi majburiyati. Qarzni uzish majburiyatni kamaytirish demakdir. "
        ]
    },
    {
        "word": "Birlikning Majburiyatlari ",
        "type": [],
        "definition": [
            " uning boshqalar oldidagi qarzlaridan, majburiyatlaridan iborat. "
        ]
    },
    {
        "word": "Bitim",
        "type": [],
        "definition": [
            " ikki yoki undan ortiq tomonlar o'rtasidagi kelishuv. Davlat bilan korxona, tashkilot bilan xodim, korxona bilan korxona va hokazo. Bunda mahsulot yoki xizmatlar pulga yoki o'zaro ayirboshlanadi."
        ]
    },
    {
        "word": "Biznes",
        "type": [],
        "definition": [
            "(ingl. business - ish, faoliyat, mashg'ulot) - boylik, foyda orttirishga yonaltirilgan ish, faoliyat. Biznes xo'jalik yuritish ko'lamiga qarab yirik, o rta va mayda turlarga bo'linadi. Xodimlaming o'rtacha soni va mahsulot hajmiga qarab ajratiladi. Shu bilan birga, “biznes” bir qancha ma’nolarga ega: a) mutaxassislik; b) tijorat faoliyati; v) savdo korxonasi, firma; g) foydali bitim. "
        ]
    },
    {
        "word": "Biznes Reja",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti sharoitida tadbirkorlikning barcha sohalarida qo'llanadigan muhim qurol hisoblanadi. Ish jarayoni haqida ma’lumot beradi. Uning yordamida firma o'sib borishi, istiqbolni belgilashi, daromadini ko'paytirishi mumkin. Biznes reja o'ta muhim moliyaviy hujjat sifatida firma faoliyatining barcha qirralarini tahlil qilishga yordam beradi. U nafaqat ichki hujjat, balki kredit olish uchun zarur bo'ladiganhujjatlardanbiridir. Biznes rejakorxonaning ish jarayonini tasvirlab, korxona rahbarlarining o'z maqsadlariga qanday erishishlarini, birinchi navbatda, ishning daromad keltirishni qay tariqa oshirish mumkinligini ko'rsatib beradi. "
        ]
    },
    {
        "word": "Biznesmen",
        "type": [],
        "definition": [
            "(inglizcha business - ish, man - odam) - biznes bilan shug'ullanuvchi shaxs, korchalon."
        ]
    },
    {
        "word": "Biznesni Mablagʻ Bilan Taʼminlash ",
        "type": [],
        "definition": [
            " pul vositalarini ishbilarmonlik faoliyati yoki biznesga jalb qilish. "
        ]
    },
    {
        "word": "Blokada ",
        "type": [],
        "definition": [
            "qamal, qurshov bo'lib, biron davlatni harbiy, siyosiy yoki iqtisodiy jihatdan yakkalab, ajratib qo'yish, qamal qilish, unga tashqi davlatlar bilan aloqa bog'lashga imkon bermaslikdan iborat. "
        ]
    },
    {
        "word": "Bo Linmas Xarajatlar ",
        "type": [],
        "definition": [
            "bo'linish nuqtasigacha bo'lgan xarajatlar. Bo'linish nuqtasi mahsulot ishlab chiqarishga nisbatan aytilgan bo'lib, tayyor mahsulotning sotilmay qolgan (yaroqsiz mahsulot, yarim tayyor) qismida bo'linish nuqtasi sodir bo'ladi. "
        ]
    },
    {
        "word": "Boʻlinmas Fond ",
        "type": [],
        "definition": [
            "qishloq xo'jaligi kooperativi (shirkat xo'jaligi) ustav fondi qiymatining bir qismi bo'lib, u shirkat xo'jaligi tasarrufida qoladi va paychi a’zolar o'rtasida taqsimlanmaydi. "
        ]
    },
    {
        "word": "Bogʻliq. Tomonlar Bilan Operatsiyalar ",
        "type": [],
        "definition": [
            "biror-bir baho belgilanganligi yoki belgilanmaganligidan qat’i nazar, bir bog'liq tomondan ikkinchisiga resurslar yoki majburiyatlarning berilishi. "
        ]
    },
    {
        "word": "Boj",
        "type": [],
        "definition": [
            " (arab. - o'Ipon, soliq) - bojxona nazorati ostida davlat tomonidan mamlakat chegarasidan olib o'tiladigan tovarlar, mol-mulk va qimmatbaho qog'ozlardan undiriladigan pul yig'imlari. U bilvosita soliq turidir. "
        ]
    },
    {
        "word": "Boj Deklaratsiyasi ",
        "type": [],
        "definition": [
            "milliy qonunchilikning talablariga muvofiq rasmiylashtirilgan, o'zida chegaradan o'tayotgan yuklar (eksport yoki import qilinayotgan mahsulotlar, passajir yuki, uning qo'lidagi yuki, boyliklar va valyutalar) to'g'risidagi ma’lumotlarni aks ettirgan hujjat. Bu hujjat yukni davlat chegarasi orqali o'tkazishda asos hisoblanadi. Deklaratsiya bojxonaga qonunda belgilangan muddatlarda (bir kundan ikki haftagacha mahsulot bojxonaga yetib kelgan kunni ham hisobga olgan holda) taqdim etilishi lozim. Deklaratsiyada bojxonaga qabul qilingan mahsulotning yuk hujjati nomeri, mahsulotning tarif nomi yoki boj tarifining tegishli moddasiga asoslanish (suyanish), mahsulot partiyasining qiymati va bahosi hamda ularga ilova qilinadigan hujjatlar ro'yxati kabilar o'z aksini topishi shart. Boj deklaratsiyasining shakli mahsulotning bojga tortilish yoki tortilmasligiga bog'liqdir. "
        ]
    },
    {
        "word": "Boj Ittifoqi ",
        "type": [],
        "definition": [
            "ikki yoki bir qancha mamlakatlarning bojlar bo'yicha o'zaro chegaralarni bekor qilish va yagona boj tarifini joriy etish bo'yicha o'zaro kelishuvi. "
        ]
    },
    {
        "word": "Boj Poshlinalari ",
        "type": [],
        "definition": [
            "iste’mol soliqlarining tarkibiga kiradi. Ularning maqsadi daromad olish bo'lmasdan, balki ichki bozor, milliy sanoat va qishloq xo'jaligini himoya qilishdir. Davlat iqtisodiy siyosatining instrumenti sifatida maydonga chiqadi. Import qilinadigan tovarlar bahosi bilan ichki bozordagi xuddi shunga o'xshash tovarlar bahosini tenglashtirish lozim. "
        ]
    },
    {
        "word": "Boj Poshlinalarining Stavkalari ",
        "type": [],
        "definition": [
            "hukumat tomonidan o'rnatilib, yagona hisoblanadi va chegaradan tovarlarni olib o'tuvchi shaxslarga bog'liq bo'lmagan holda o'zgarmasdir. Tashqi iqtisodiy faoliyatni operativ ravishda tartibga solishning instrumenti bo'lib xizmat qiladi. Ularning quyidagi turlari bo'lishi mumkin: a) advalor stavkalar (boj undiriladigan tovamingboj qiymatiga nisbatan foizda o'rnatiladi); b) maxsus stavkalar (boj undiriladigan tovarning birligiga nisbatan aniqlanadi); v) kombinatsiyalashtirilgan stavkalar (boj undirishning dastlabki ikki varianti qo'llaniladi). "
        ]
    },
    {
        "word": "Boj Taʼrifi ",
        "type": [],
        "definition": [
            " tovarlar guruhlari bo'yicha sistemalashtirilgan boj poshlinalar ro'yxati."
        ]
    },
    {
        "word": "Boj Toʻlovi ",
        "type": [],
        "definition": [
            "chegaradan chiqayotgan yoki kelayotgan mollarga qo'yilishi mumkin bo'lgan to'lov. Uning miqdori davlat siyosatiga bog'liq. Boj miqdori maxsus boj tariflarida ifodalanadi. "
        ]
    },
    {
        "word": "Bojsiz Yuk Keltirish ",
        "type": [],
        "definition": [
            "bojxona bojlaridan ozod etilgan tovarlar importi bo'lib, u alohida tovarlar yoki bir guruh mamlakatlardan keladigan import tovarlarga nisbatan qo'llaniladi va u vaqtincha yoxud uzoq muddatli bo'lishi mumkin."
        ]
    },
    {
        "word": "Bojxona",
        "type": [],
        "definition": [
            "chegara orqali o'tadigan jami yuklar, shu jumladan, bagaj va pochta jo'natmalarini nazorat qiladigan davlat muassasasi. U o'tkazilayotgan yuklarni tekshirish va ulardan yig'imlarni undirish bilan shug'ullanadi. Bojxonalar, odatda, dengiz va daryo portlarida, xalqaro aeroportlarda, temir yo ‘ 1 stansiyalarida, chegara hududlarida va mamlakatning yirik markazlarida joylashadi. "
        ]
    },
    {
        "word": "Bojxona Bojlari ",
        "type": [],
        "definition": [
            "ma’lum bir mamlakat hududiga mahsulotlarni kiritishj undan chiqarish va olib o'tishda undiriladigan iste’mol soliqlaridanbiri.Ularningasosiymaqsadi daromad olishbo'lmasdan, balki ichki bozor, milliy sanoat va qishloq xo'jaligini himoya qilishdir. Davlat iqtisodiy (moliya-soliq) siyosatining instrumenti sifatida maydonga chiqadi. Import qilinadigan mahsulotlarning bahosi bilan ichki bozordagi xuddi shunga o'xshash mahsulotlarning bahosini tenglashtirishi lozim. Odatda, mahsulotlar bahosidan olinadi. Buning uchun, ayrim hollarda, maxsus mezonlar (masalan, og'irlik, maydon) ham qo'llanilishi mumkin. "
        ]
    },
    {
        "word": "Bojxona Вojlarining Stavkalar! ",
        "type": [],
        "definition": [
            "hukumat tomonidan o'rnatilib, yagona hisoblanadi va chegaradan mahsulotlarni olib o'tuvchi shaxslarga bog'liq bo'lmagan holda o'zgarmasdir. Tashqi iqtisodiy faoliyatni operativ ravishda tartibga solishning instrumenti bo'lib xizmat qiladi. Ularning quyidagi turlari bo'lishi mumkin: a) advalor stavkalar (boj undiriladigan mahsulotlarning boj qiymatiga nisbatan foizda o'rnatiladi); b) maxsus stavkalar (boj undiriladigan mahsulotning birligiga nisbatan aniqlanadi); v) kombinatsiyalashtirilgan stavkalar (boj undirishning dastlabki ikki varianti birgalikda qo'llaniladi). "
        ]
    },
    {
        "word": "Bojxona Ittifoqi ",
        "type": [],
        "definition": [
            "yagona bojxona tariflarini tashkil etish va bojxona chegaralariga chek qo'yish maqsadida ikki yoki undan ortiq davlatlarning kelishuvi. Bojxona ittifoqi a’zosi bo'lgan davlat tovarini boshqa bojxona ittifoqi a’zosi bo'lgan davlat hududiga boj to'lovlarsiz kiritadi. "
        ]
    },
    {
        "word": "Bojxona Siyosati",
        "type": [],
        "definition": [
            "(proteksionizm) - davlatning milliy iqtisodiyotni chet el raqobatidan, ichki bozorni chet el tovarlarining kirib kelishidan himoya qilishga qaratilgan iqtisodiy siyosati. U eksportni rag'batlantirish, importni cheklash hamda import tovarlardan olinadigan boj to'lovlarini oshirish va shunga o'xshash boshqa tadbirlarda o'z ifodasinl topadi. "
        ]
    },
    {
        "word": "Bojxona Taʼrifi ",
        "type": [],
        "definition": [
            "o'z mamlakati firmalari manfaatlarini himoya qilish yoki keng pul xarajatiga ega bo'lish maqsadida import va eksport tovarlariga qo'yilgan soliq."
        ]
    },
    {
        "word": "Bond ",
        "type": [],
        "definition": [
            "bojxona boji to'lanmagan tovar. "
        ]
    },
    {
        "word": "Bonifikatsiya",
        "type": [],
        "definition": [
            " (fran. bonifico - yaxshilayman) - agar tovar sifati shartnomada belgilanganidan yuqori bo‘Isa, shu shartnomaga asosan, ushbu tovarning bahosiga ustama. Teskaribonifikatsiya (refaksiya) - tovar sifati shartnomada kelishilganidan past bo'Isa, shu tovar bahosidan chegirma. "
        ]
    },
    {
        "word": "Bonlar",
        "type": [],
        "definition": [
            "1. Davlat xazinasi tomonidan chiqariladigan, shuningdek, ba’zi muassasa va korxonalar tomonidan ham chiqariladigan qarzli majburiyatlar. 2. Mayda pul sifatida vaqtincha oborotga chiqariladigan kam qiymatli qo'g'oz pullar. "
        ]
    },
    {
        "word": "Bonus ",
        "type": [],
        "definition": [
            "xizmat uchun mukofotlash, rag' batlantirish. Tovar bozorida bonusning miqdori sotilgan yoki xarid qilingan tovar qiymatiga, undan olinadigan foizga, tovarning bozorda tez sotilishiga, sotilish yo'liga, iqtidorli komissionerlar o'rtasidagi raqobat darajasiga bog'liq."
        ]
    },
    {
        "word": "Boqimanda ",
        "type": [],
        "definition": [
            " belgilangan muddatda budjetga o'tkazilmagan va so'zsiz undirilishi lozim bo'lgan soliq yoki boshqa majburiy to'lovning summasi. "
        ]
    },
    {
        "word": "Bord",
        "type": [],
        "definition": [
            " molning sotuvchi hisobidan kemaga yetkazib berilish sharti. "
        ]
    },
    {
        "word": "Bosh (General) Budjet ",
        "type": [],
        "definition": [
            "subyektning hamma faoliyatini qamrab olgan moliyaviy hujjat. "
        ]
    },
    {
        "word": "Bosh (Katta) Auditor ",
        "type": [],
        "definition": [
            "auditorlik tashkilotining professional xodimi bo'lib, muayyan auditorlik nazorati jarayonida ushbu nazoratning oddiy ishtirokchilarini boshqarish vazifasi topshirilishi mumkin bo'lgan darajada yetarli yuqori malakaga ega bo'lgan xodim. "
        ]
    },
    {
        "word": "Bosh Daftar ",
        "type": [],
        "definition": [
            "sintetik hisob yuritish uchun tayinlangan hisob registri. Hisobning jurnal-order shaklida qo'llaniladi. Bosh daftar yil davomida hisob yuritish uchun mo'ljallangan. Unda mazkur korxonada qo'llaniladigan barcha sintetik schyotlar ochiladi. Schyotlarbo'yicha 1-yanvarga qoldiq (saldo) yozilib,haroydajurnal- orderlarning jami ma’lumotlari yoziladi va oy bo'yicha aylanmalari (oborotlari) jamlanib, oy oxiriga saldosi chiqariladi. Hisobning jurnal-order shaklida ma’Iumotlar bosh daftar ma’lumotlaridan olib yoziladi. Jurnal-orderlarda yozuvlar hujjatlaming kelib tushishiga qarab yoki jamg'armavedomostlardanoybo'yicha jami aks ettiriladi. Oy oxirida jurnal-orderlarning jami bosh daftarga o'tkaziladi. Bosh daftarda har bir schyot bo'yicha kredit aylanmasining summasi bir joyda aks ettiriladi, debet aylanmasi esa kreditlanuvchi schyotlar bilan korrespondentlangan holda aks ettiriladi. Barcha schyotlar bo'yicha debet va kredit aylanmalari teng bo'lishi kerak. Shunday qilib, bosh daftarda joriy hisob malumotlari umumlashtiriladi va alohida schyotlar bo'yicha yozuvlar o'zaro tekshiriladi. Bosh daftarga va zarur bo'lgan hollarda jurnal-order ma lumotlariga asosan buxgalteriya balansi tuziladi. "
        ]
    },
    {
        "word": "Bosh Jurnal ",
        "type": [],
        "definition": [
            "buxgalteriya hisobining eskirgan shakli. U hisobning memorial-order shaklidagi varianti hisoblanadi. “Bosh daftar” deb nomlangan yagona hisob registrida bosh daftar va registratsiya jurnali birlashtirilgan. "
        ]
    },
    {
        "word": "Bosh Polis ",
        "type": [],
        "definition": [
            "sug'urta kompaniyasi va sug'urtalanuvchi o'rtasidagi yozma bitim. Bubitimga muvofiq, tegishli davr mobaynida sug'urtalanuvchi barcha obyektlarni sug'urta kompaniyasiga sug'urtalash uchun beradi. Chet el tajribasida bu bitim ochiq polis” yoki “polis- abonement” deyiladi. Mazkur bosh polis asosida sug'urtalash tashqi savdo yuklari sug'urtasida keng tarqalgan. Sug'urtalanuvchi sug 'urta kompaniyasiga har bir j o'natilgan yuk haqidagi ma lumo tlar (yukning vazni, sug'urta summasi, yukni jo'natish va qabul qilib olish punktlari) bayon etilgan arizani taqdim etsa yetarli, yuk avtomatik ravishda sug'urtalangan hisoblanadi. "
        ]
    },
    {
        "word": "Bosh Shartnoma",
        "type": [],
        "definition": [
            "umumiy ish bajarish yoki tovar yetkazish davri tugagunga qadar muddatga tuzilgan shartnoma. "
        ]
    },
    {
        "word": "Bosh Toʻplam ",
        "type": [],
        "definition": [
            " o'rganiladigan ko'p hajmli birliklar majmuasidir. "
        ]
    },
    {
        "word": "Boshlangich (Kirish) Buxgalteriya Balansi ",
        "type": [],
        "definition": [
            "mazkur korxona faoliyatiningboshida tuzilgan birinchi buxgalteriya balansi. "
        ]
    },
    {
        "word": "Boshlangʻich Narx ",
        "type": [],
        "definition": [
            "tovarlar, xizmatlar ishlab chiqarilganda birinchi marta belgilanadigan dastlabki narx. "
        ]
    },
    {
        "word": "Boshlangich Qiymat ",
        "type": [],
        "definition": [
            "nomoddiy aktivlarni yaratish (ishlab chiqish) yoki sotib olish bo'yicha haqiqatda amalga oshirilgan xarajatlar qiymati (pul mablag'lari yoki ularning ekvivalentlarining summasi yoxud boshqa to'lovlaming joriy qiymati), shu jumladan, to'langan va qoplanmaydigan soliqlar (yig'imlar), shuningdek, aktivni undan maqsadga ko'ra foydalanish uchun ishga yaroqli holatga keltirish bilan bevosita bog'liq bo'lgan boshqa xarajatlar qiymati."
        ]
    },
    {
        "word": "Boshqa Auditorlik Tashkiloti ",
        "type": [],
        "definition": [
            "asosiy auditorlik tashkiloti hamkorlikda audit o'tkazayotgan hamda buxgalteriya hisoboti o'z ichiga olgan bo'limlar bo'yicha auditorlik xulosasini tayyorlash uchun javobgar bo'lgan auditorlik tashkilotidir. Asosiy auditorlik tashkiloti bilan munosabatlardan qat’i nazar, boshqa auditor tashkiloti tomonidan barcha farqlanishlar tan olinadi. "
        ]
    },
    {
        "word": "Boshqa Depozit Korxonalar ",
        "type": [],
        "definition": [
            "ushbu kichik sektor markaziy bankdan tashqari barcha rezidentlik moliyaviy korporatsiyalar va kvazikorporatsiyalarni o'z ichiga oladi. Bu korporatsiyalarning asosiy faoliyati moliyaviy vositachilik bo'lib, ularning passivlari omonat shaklidagi qisqa muddatli depozit sertifikatlaridan iboratdir. Bu sertifikatlar keng ma’noda pul massasi ko'rsatkichi tarkibiga qo'shiluvchi omonatlar o'rnini bosadi. "
        ]
    },
    {
        "word": "Boshqa Ishlab Chiqarish Soliqlari ",
        "type": [],
        "definition": [
            "ishlab chiqarish omillaridan foydalanganlik uchun to'lov, undan tashqari, litsenziyalar va ishlab chiqarish faoliyatini amalga oshirish uchun berilgan ruxsatnomalar va rezident faoliyati uchun kerak bo'lgan boshqa to'lovlar kiritiladi. Ularga ish haqi, imoratlar, inshootlar, transport vositalari, tadbirkorlik va h.k.lar uchun to'lovlar misol bo'la oladi. "
        ]
    },
    {
        "word": "Boshqa Joriy Soliqlar ",
        "type": [],
        "definition": [
            "vaqti-vaqti bilan, odatda, bir yilda bir marta to'lanadigan turli soliqlardan tarkib topadi. Bu soliqlarning eng ko'p tarqalgan turi quyidagilardan iborat: jon boshi solig'i, buromad (xarajat)lar solig'i, olingan ayrim ruxsatnomalar uchun uy xo'jaligi to'lovlari, moliya va kapital mablag' operatsiyasi (muomalasi) solig'i, to'g'ri gerb yig'imlari va xalqaro operatsiyalar solig'i. "
        ]
    },
    {
        "word": "Boshqa Joriy Transfertlar ",
        "type": [],
        "definition": [
            "rezident institutsion birliklar o'rtasidagi yoki rezident va norezidentlar o'rtasidagi transfertlarni o'z ichiga oladi. Daromad joriy soliqlari, boylik uchun soliqlar hamda ijtimoiy sug'urta, ijtimoiy nafaqa va ijtimoiy yordam nafaqasi ajratmalari istisnodir. "
        ]
    },
    {
        "word": "Boshqa Maʼlumotlar ",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyekt hisob obyektlari to'g'risidagi ma’lumot bo'lib, bu obyektlarning miqdori yoki sifatini ifodalaydi. Ushbu ma'lumotlar buxgalteriya hisoboti tuzish, tahlil o'tkazish va boshqarish uchun foydalaniladi. Buxgalteriya hisobi obyektlari deganda, xo'jalik yurituvchi subyekt mulki, uning majburiyatlari va o'z faoliyati davomida amalga oshiradigan xo'jalik operatsiyalari tushuniladi. "
        ]
    },
    {
        "word": "Boshqa Turdagi Depozit Korporatsiyalar ",
        "type": [],
        "definition": [
            "bunday korporatsiyalar boshqa turdagi barcha rezidentlik depozit korporatsiyalar va kvazikorporatsiyalarni o'z ichiga oladi. Ularning passivlari omonatlari, qisqa muddatli depozit sertifikatlaridan tarkib topadi: omonatlarning o'ziga xos xususiyati shundaki, ular hamma vaqt tezkorlik bilan pul o'tkazish predmeti bo'la olmaydi, qisqa muddatli depozit sertifikatlar esa keng ma’noda pul massasi ko'rsatkichiga kiritilib, omonatlar o'rnini bosuvchi vosita sanaladi. "
        ]
    },
    {
        "word": "Boshqarilish Meyori ",
        "type": [],
        "definition": [
            "rahbarni samarali boshqarishi mumkin bo'lgan tobelar soni."
        ]
    },
    {
        "word": "Boshqariluvchi (O Zgaruvchl) Valyuta Kurslari Tizimi ",
        "type": [],
        "definition": [
            "- u turli mamlakatlar markaziy banklari valyuta kurslarini tez va katta tebranishlariga yo‘l qo'ymaslik uchun xorijiy valyutalarni xarid qilish va sotishni nazarda tutadi. Bunda valyuta fondidan foydalaniladi. Valyuta kursi tushib ketsa, markaziy banklar valyutani sotib oladi yoki aksincha, ularning kursi ko'tarilsa, sotadi. "
        ]
    },
    {
        "word": "Boshqarish",
        "type": [],
        "definition": [
            "1 . Tasarrufda bo'lgan barcha resurslardan maksimal foydalanib, korxonani uning maqsadi sari yetaklash. 2. Tashkil etish, qaror qabul qilishga qaratilgan faoliyat, obyektni o'z xizmat vazifasi doirasida nazorat qilish, tartibga solish, ishonchli axborotlar asosida tahlil qilish va yakun yasash. "
        ]
    },
    {
        "word": "Boshqaruv",
        "type": [],
        "definition": [
            " 1. Ikkita obyektlar o'zaro hamkorligining ma’lum turi. Bunda ulardan biri boshqaruv subyekti, boshqasi esa boshqaruv obyekti holatida bo'ladi. 2. Insonning ongli va maqsadga yo'naltirilgan faoliyati. Uning yordamida u tashqi muhim elementlar (jamiyat, tabiat, texnika)ni tartibga soladi va o'z manfaatlariga bo'ysundiradi. Boshqaruvning har xil turlari mavjud, chunonchi, texnikboshqaruv, davlat boshqaruvi, mafkuraviy boshqaruv, ijtimoiy jarayonlarni boshqarish, xo'jalik boshqaruvi yoki menejment. "
        ]
    },
    {
        "word": "Boshqaruv Apparati ",
        "type": [],
        "definition": [
            "shtat jadvali va kasbiy-malaka asosida tashkil qilingan boshqaruvning malum vazifalarini bajarishi mumkin bo'lgan idoralar, bo'linma va xizmatlarga birlashtirilgan xodimlar majmuyi (rahbarlar, mutaxassislar, texnik ijrochilar). Boshqaruv apparati tizimining boshqaruvchilari hisoblanadi"
        ]
    },
    {
        "word": "Boshqaruv Boʻgtni",
        "type": [],
        "definition": [
            " o' zini-o'zi idora qiluvchi tashkiliy idora. "
        ]
    },
    {
        "word": "Boshqaruv Bosqichi ",
        "type": [],
        "definition": [
            "tegishli vaqt oralig'ida boshqaruv faoliyatini amalga oshirish uchun bajarilayotgan tadbirlar majmuasi. "
        ]
    },
    {
        "word": "Boshqaruv Funksiyalari ",
        "type": [],
        "definition": [
            "l) boshqaruv jarayonining xususiyatlari, ya’ni menejmentga tegishli belgilarning ajralishi; 2) ijtimoiy rivojlanish jarayoni. Boshqaruvning bu jarayoni aniq elementlarga, ya’ni jamiyatning hayot faoliyatiga yo'naltirilgan bo'ladi."
        ]
    },
    {
        "word": "Boshqaruv Hisobi ",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyekt axborot tizimining tarkibiy qismi hisoblanadi. Ishlab chiqarish faoliyatini boshqarishning samaradorligi tarkibiy bo'linmalar, subyekt xizmatlari bo'limlarining faoliyati haqidagi ma’lumot bilan ta’minlanadi. Bu ma’lumotni boshqaruv hisobi to'g'ri boshqaruv qarorlarni qabul qilish maqsadida subyektning ichida faoliyat ko'rsatayotgan turli darajadagi boshqaruvchilar uchun shakllantiradi."
        ]
    },
    {
        "word": "Boshqaruv Ierarxiyasi ",
        "type": [],
        "definition": [
            "murakkab turli-tuman va o'zaro bog'langan jarayonlarni boshqarishning asosiy tamoyillaridan biri. U boshqaruvning darajalari bilan ta’riflanadi, ularning soni qanchalik ko‘p bo'Isa, tizim shunchalik yirikdir. "
        ]
    },
    {
        "word": "Boshqaruv Jarayoni ",
        "type": [],
        "definition": [
            "tashkilot resurslarini u tomonidan o'zining maqsadlariga yetishish uchun shakllantirish va ulardan foydalanish bo'yicha uzluksiz o'zaro bog'liq harakatlar majmuasi. "
        ]
    },
    {
        "word": "Boshqaruv Maqsadi",
        "type": [],
        "definition": [
            "ishlab chiqarishning ijtimoiy-iqtisodiy tuzim sifatidagi erishilishi kerak bo'lgan istalgan, ehtimol bo'lgan va zarur holati. Boshqaruv maqsadini belgilash boshqaruv jarayonining boshlang'ich bosqichidir. "
        ]
    },
    {
        "word": "Boshqaruv Mehnati ",
        "type": [],
        "definition": [
            " boshqaruv vazifasini bajarish sohasidagi mehnat faoliyati bo'lib, uning asosiy vazifasi mehnat jamoasining o'z oldida turgan vazifalarni hal qilishga doir aniq maqsadga qaratilgan va muvofiqlashtirilgan faoliyatini ta’minlashdir. "
        ]
    },
    {
        "word": "Boshqaruv Mehnatini Ilmiy Tashkil Qilish ",
        "type": [],
        "definition": [
            " boshqaruv xodimlar mehnatini shunday tashkil qilishki, u fan yutuqlari va ilg'or tajriba, xo'jalik yuritishning ilg'or shakllaridan foydalanish, texnik vositalami qo'llashga asoslanadi hamda xizmatchilarni bir-birlari va ishchilar bilan o'zaro hamkorlikni yaxshiroq tarzda o'rnatishga imkon beradi, shuningdek, boshqaruv vazifalarini amalga oshirish va ishlab chiqarish (tijorat) ni muhandislik-texnik va iqtisodiy ta’minlash jarayonida texnik vositalaridan foydalanishga asoslanadi. "
        ]
    },
    {
        "word": "Boshqaruv Mehnatining Gorizontal Taqsimlanishi ",
        "type": [],
        "definition": [
            "mehnatning ishlarning turlari, vazifalar bo'yicha taqsimlanishi. U mutaxassislarning ajratilishi, tashkilotda vazifaviy xizmatlar va bo'linmalarni tashkil qilishda namoyon bo'ladi. "
        ]
    },
    {
        "word": "Boshqaruv Mehnatining Obyekti ",
        "type": [],
        "definition": [
            " mehnatni sarflash sohasi, ya’ni korxona, tashkilot, tarkibiy bo'linmadir. "
        ]
    },
    {
        "word": "Boshqaruv Mehnatining Vertikal Taqsimlanishi ",
        "type": [],
        "definition": [
            "tashkilotda boshqaruv darajalarini ajratishga asoslangan taqsimlash. Uning asosida xodimlar yoki bo'linmalar faoliyatini muvofiqlashtirish yotadi."
        ]
    },
    {
        "word": "Boshqaruv Obyekti",
        "type": [],
        "definition": [
            "boshqaruv subyekti tomonidan boshqaruvchi ta’sirlami qabul qiluvchi idora. Boshqaruv obyektiga: ijtimoiy jarayonlar, ijtimoiy soha, ijtimoiy resurslar kiradi. "
        ]
    },
    {
        "word": "Boshqaruv Qarori ",
        "type": [],
        "definition": [
            "harakatlarning ma’lum variantini topish, faoliyat jarayonining o'zi, uning yakuniy natijasi."
        ]
    },
    {
        "word": "Boshqaruv Sohasidagi Olimlarning Asosiy Vazifasi ",
        "type": [],
        "definition": [
            "- amaliyot materiallarini yig'ish va e’lon qilish, shu asosda boshqaruvchilarga maslahatlar berishni ishlab chiqish hisoblanadi."
        ]
    },
    {
        "word": "Boshqaruv Subyekti ",
        "type": [],
        "definition": [
            "boshqaruv tizimining boshqaruv obyektiga tasir ko'rsatish manbayi bo‘lgan bo'g'ini yoki qismi."
        ]
    },
    {
        "word": "Boshqaruv Tamoyillari ",
        "type": [],
        "definition": [
            "boshqaruv subyektlari aniq obyektlarni boshqarish jarayonida amal qilishlari kerak bo'lgan obyektiv qonunlardan kelib chiquvchi asosiy qoidalar. "
        ]
    },
    {
        "word": "Boshqaruv Tizimi",
        "type": [],
        "definition": [
            "boshqaruvni amalga oshiruvchi bo'g'inlar va ular o'rtasidagi aloqalaming yig'indisi."
        ]
    },
    {
        "word": "Boshqaruv Uslubi",
        "type": [],
        "definition": [
            "tashkilot qo'ygan maqsadlarga erishish uchun boshqarilayotgan obyektlarga tasir qilish usullari yig'indisi. “Uslub” so'zi grekcha “methodos” so'zidan kelib chiqqan. Tarjimasi: biror- bir maqsadga erishish usuli. Boshqaruv uslublari orqali boshqaruv faoliyatining asosiy mazmuni amalga oshiriladi. "
        ]
    },
    {
        "word": "Boshqaruv Vazifalari ",
        "type": [],
        "definition": [
            "boshqaruv faoliyatining nisbatan mustaqil, ixtisoslashtirilgan va ajratilgan turlari. U yoki bu obyekt bilan rahbarlik qilishni tashkil qilishdagi faoliyat turidir. "
        ]
    },
    {
        "word": "Boshqaruv Xarajatlari ",
        "type": [],
        "definition": [
            "boshqaruv (davlat hokimiyati organlari, sud va prokuratura organlari, fuqarolarning o'z-o'zini boshqaruv organlari) xarajatlari davlat organlari faoliyatining moliyaviy asosini tashkil etib, jamiyat hayotining barcha sohalariga rahbarlik qilishga imkon yaratadi. "
        ]
    },
    {
        "word": "Boshqaruvchanlik Коʼlam I ",
        "type": [],
        "definition": [
            "boshqaruv idorasining boshqarish qobiliyati va boshqaruv obyektining murakkabligi o'rtasidagi nisbat. "
        ]
    },
    {
        "word": "Boshqaruvchi Personal ",
        "type": [],
        "definition": [
            "batamom yoxud qisman boshqaruvchilik faoliyati bilan band bo'lgan xodimlar majmuyi. "
        ]
    },
    {
        "word": "Boshqaruvchilik Faoliyati Bilan Bogʻliq. Risk ",
        "type": [],
        "definition": [
            "muayyan darajadagi noaniqlik elementi mavjud bo'lgan shart-sharoitlarda amalga oshiriladigan boshqaruvchilik faoliyatining alohida xususiyati ifodalanishi. Masalan, real vaziyatning qandayligini baholash uchun axborotning yetishmasligi yoki uning ishonchli emasligi oqibatida menejer yuzaga kelgan muammoning yechimini izlab, alternativ variantlardan birini tanlab olishga majbur bo'ladi. U tanlab olgan yo'l muayyan darajadagi noaniqlik elementi mavjud bo'lgani bois tashkilotga ziyon yoxud aksincha, foyda keltirishi mumkin. Bu o'rinda menejer riskka borishi lozim. Risk har qanday boshqaruvchilik faoliyatining ajralmas elementi hisoblanadi."
        ]
    },
    {
        "word": "Boykot",
        "type": [],
        "definition": [
            "norozilik bildirish uchun biron-bir iqtisodiy aloqa yurituvchi tomonlarning o'zaro manfaatlari zid kelib qolganda, ulardan biri boykot e’lon qiladi^ kelishilgan shartnomani bajarish to'xtatiladi. Siyosiy yoki iqtisodiy kurash olib borish maqsadida biror shaxs, tashkilot yoki davlat bilan aloqani uzish. "
        ]
    },
    {
        "word": "Boylik ",
        "type": [],
        "definition": [
            "bozor qiymatiga ega va pulga yoki boshqa ne’matlarga almashinishi mumkin bo'lgan barcha narsa. Fizik aktivlar, moliyaviy aktivlar, ko'nikmalar, tadbirkorlik malakasi, savdo markalari, xullas, daromad keltiradigan barcha narsalar. "
        ]
    },
    {
        "word": "Boylik Samarasi Yoki Real Kassali Qoldiqlarning Samarasi ",
        "type": [],
        "definition": [
            "baholarning ko'tarilishi yoki pasayishi sababli belgilangan narxdagi moliya aktivlari real qiymatining o'zgarishi bilan shartlangan sarflar umumiy hajmining o'zgarishi. "
        ]
    },
    {
        "word": "Bozor",
        "type": [],
        "definition": [
            "l) talab va taklif uchrashadigan joy, bu yerda ishlab chiqarilgan mahsulotning jamoatchilik sezayotgan ehtiyojga mos kelish darajasi aniqlanadi, mazkur tovarning boshqa raqobatchi tovarlar bilan raqobatbardoshligi taqqoslanadi; 2) tovar, xizmat va boshqa mulk turlari bilan almashish sohasi; 3) iste’molchilar guruhi; 4) mazkur tovarning barcha xaridorlari; 5) tashkillashtirilgan savdo joyi; 6) tovar va xizmatlarni olish manbayi; 7) qandaydir mahsulot yoki xizmatlarning virtual yoki tabiiy aks ettirilgan mavjud yoki potensial xaridorlari va sotuvchilari majmuyi; 8) birja. Sotuvchi va xaridor o'rtasida yuzaga keladigan iqtisodiy munosabatlar majmuyi. Bozordagi talab va taklif iqtisodiy, demografik, ijtimoiy, siyosiy va ma’naviy omillar ta’sirida shakllanadi. Talab yo'q, o'tmay qolgan narsa, mol haqida “Bozor kasod”, talab yuqori bo'lgan, tez o'tadigan narsa, mol haqida esa “Bozor chaqqon” deyiladi. “Bozor ko'tarmaydi” - bu tovarni ushbu narxga bozorda hech kim olmaydi degan ma’noni anglatadi. "
        ]
    },
    {
        "word": "Bozor Baholari ",
        "type": [],
        "definition": [
            " talab va taklif asosida yuzaga kelgan narxlar."
        ]
    },
    {
        "word": "Bozor Boʻgʻini ",
        "type": [],
        "definition": [
            "talab istaklari, bozordagi xatti-harakatlari, marketing vositalari ta’siriga javoblari o'xshash bo'lgan iste’molchilar guruhi. "
        ]
    },
    {
        "word": "Bozor Boʻshligʻi ",
        "type": [],
        "definition": [
            "qandaydir talablari (ehtiyojlari) qondirilmay qolgan iste’molchilar guruhi. "
        ]
    },
    {
        "word": "Bozor Diyersifikatsiyas1 ",
        "type": [],
        "definition": [
            "mavjud bozorni kengaytirish, yangi bozorlarga chiqishga mo'ljallangan marketing strategiyasi. "
        ]
    },
    {
        "word": "Bozor Funksiyalari ",
        "type": [],
        "definition": [
            "bozor bajaradigan iqtisodiy vazifalar. Unga, asosan quyidagilar kiradi: l) Tovar ayirboshlash orqali ishlab chiqarish bilan iste’molni bir-biriga bog'lash; 2) Iste’mol buyumlari va xizmatlarni aholiga yetkazib berish orqali xalq farovonligini oshirish; 3) Narxlarning o'zgarishi orqali talab va taklifni bir-biriga moslashtirish, pulni tovarlar bilan ta’minlab, pul muomalasining barqaror bo'lishiga erishish ; 4) Davlatlar o'rtasidagi teng huquqli iqtisodiy aloqalarni kengaytirish, mustahkamlash va boshqalar."
        ]
    },
    {
        "word": "Bozor Infrastrukturasi ",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti uchun xizmat ko'rsatuvchi har xil sohalardan iborat. Unga banklar, tijorat banklari, birjalar, savdo uylari, tashqi savdo firmalari, davlatning tashqi savdo mahkamalari, soliq undiruvchi tashkilotlar, tijorat va sohibkorlik idoralari, vositachi firmalar, savdo-sotiq uyushmalari, konsorsium va boshqalar kiradi. Bozor infrastrukturasi tovar ishlab chiqaruvchilarning savdo-sotiq, moliya-kredit ishlariga sherik topishga, ishchi kuchi yollashiga yordamlashadi, davlatning iqtisodiyotni tartibga soluvchi tadbirlarini amalga oshiradi. Bozor infrastrukturasi faqat davlat idoralari emas, balki mustaqil uyushma, tashkilot va firmalardan ham iborat bo'lib, ular ko'rsatgan xizmatlari uchun haq oladi. "
        ]
    },
    {
        "word": "Bozor Infratuzilmasi ",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti uchun har xil xizmat ko'rsatuvchi sohalar: banklar, savdo-sanoat palatasi, birjalar, savdo uylari, tashqi savdo firmalari, davlatning tashqi savdo mahkamalari, bojxonalari, soliq inspeksiyasi, tijorat va sohibkorlik idoralari, vositachi firmalar, savdo-sotiq uyushmalari, konsernlar, konsorsiumlar, konsalting va injiniring kompaniyalari hamda boshqalar kiradi. "
        ]
    },
    {
        "word": "Bozor Intervensiyasi ",
        "type": [],
        "definition": [
            "milliy yoki mintaqa bozorlariga tashqaridan zo'rlik bilan suqilib kirish va uni o‘ziga tobe etish. U har xil yo'llar bilan amalga oshiriladi. Masalan, ichki bozordagi baholarga nisbatan past baholarda chetga tovar chiqarish (tovar dempingi), yuqori boj to‘lovlariga ham rozi bo'lish, bozori chaqqon yerlarda korxonalar qurib, tovar chiqarish va sotish kabilar"
        ]
    },
    {
        "word": "Bozor Iqtisodiyoti ",
        "type": [],
        "definition": [
            "iqtisodiy xatti-harakatlarning erkin, mustaqil ravishda yuz berishi va ularning bozor mexanizmi orqali bir- biriga muvofiqlashuvidir. Bozor iqtisodiyoti erkin tovar-pul munosabatlariga asoslangan, iqtisodiy monopolizmni inkor etuvchi, ijtimoiy mo'ljalga ega bo'lgan iqtisoddir. Bozor iqtisodiyoti g'oyat ko'p qirrali va murakkab iqtisodiyotdir. Bozor iqtisodiyotining quyidagi subyektlari mavjud: a) iqtisodiy mustaqillikka ega bo'lgan mulk egasi yoki iste’molchi kishilar yoxud guruhlar. Bularga, odatda, yollanib ishlovchilar, yer egalari, kapital sohiblari, ishlab chiqarish vositasi egalari kiradi. Ular tadbirkorlik qilmaydi. O'z mulkidan daromad topadi yoki yollanib ishlaydi; b) firma, korxona, xo'jaliklar. Ular foyda olish yo'lida mustaqil ish yuritadilar, ishlab chiqarish omillarini ishga soladilar; d) davlat, aniqrog'i, davlatning barcha mahkama-yu tashkilotlari. Ular ham ishlab chiqarish, ham iste’mol bilan shug'ullanadilar. Bozor va unda ishtirok etadiganlarni nazorat qiladilar. Bozor iqtisodiyotining muhim belgisi iqtisodiy plyuralizm, ya’ni mulk shakllari va xo‘jalikyuritish usullarining turli- tuman bo'lishidir. Bozor iqtisodiyotida ayrim mulkning hukmron bo'lishiga yo‘l qo'yihnaydi. Xo'jalik yuritish usullari ham turlicha bo'ladi: yakka tartibda, jamoaga uyushgan tartibda, sherikchilik- paychilikyokiaksiyadorlikasosida,o‘zmablag‘igayokiqarzgaolingan mablag'ga tayanib xo'jalik yuritish, yer va boshqa vositalarni ijaraga olish va ishlatish kabilar bilan birgalikda boradi. Bozor iqtisodiyoti erkin iqtisodiyotdir. Iqtisodiy faoliyat erkinligining asosi ishlab chiqarish omillari yoki yaratilgan tovarlarning mulk obyekti b o‘ lishi, mulkdorlarning esa mustaqillikka ega bo'lishidir. Har bir korxona, tashkilot, ayrim fuqaro o‘z ixtiyoriga ko ra, qonun doirasida o'ziga maqul bo'lgan ish bilan shug'ullanadi. Bozor iqtisodiyoti erkin bo'lganidan, u har qanday iqtisodiy monopolizmni inkor etadi. Biroq u o'zining tartibga soluvchisiga ega. Ulaming eng muhimi bozor narxidir. Narx oshib, tovarlar jadal sotilsa, foyda ko'payadi, ularni ishlab chiqarish kerak bo'ladi. Tovarlar narxi pasayib, yaxshi o'tmasa, demak, ishlab chiqarishni qisqartirish yoki undan tamomila voz kechish kerak bo‘ ladi. Bozor munosabatlarining har bir subyekti - korxonami, davlatmi, alohida kishimi, buning ahamiyati yo‘q, o‘z manfaatini ko'zlab faoliyat ko'rsatadi. Ammo ko‘rko‘rona, xohlagan ishini qilolmaydi, chunki u bozor bilan hisoblashishga majbur, aks holda, uning ishi yurishmaydi, xonavayron bo'ladi. Bozor iqtisodiyoti shunday iqtisodiy munosabatlar va ular ishlab chiqarish faoliyatini rag* batlantiruvchi kuchni yuzaga chiqaradi. Ular har qanday iqtisodiyot kabi iqtisodiy qonunlar ta’sirida rivojlanadi. "
        ]
    },
    {
        "word": "Bozor Iqtisodiyoti Qoidalari ",
        "type": [],
        "definition": [
            "bozor tizimining mavjudligi, zaminlari va sharoitlari. Unga quyidagilar kiradi: xususiy mulk, tanlash va tadbirkorlik erkinligi, shaxsiy manfaat, narxlarning erkin shakllanishi, raqobatchilik muhitining mavjudligi, iqtisodiyotning davlat tomonidan tartiblanishi. "
        ]
    },
    {
        "word": "Bozor Ishlab Chiqarish",
        "type": [],
        "definition": [
            "bozor uchun tovar va xizmat yaratishga qaratilgan amaliyot yoki faoliyat turi. "
        ]
    },
    {
        "word": "Bozor Islohotlari ",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti va bozor munosabatlarini shakllantirishga qaratilgan chora-tadbirlar majmuyi."
        ]
    },
    {
        "word": "Bozor Konsentratsiyasi ",
        "type": [],
        "definition": [
            "bozorda bitta yoki bir necha firmaning ustunlik darajasi. "
        ]
    },
    {
        "word": "Bozor Konyunkturasi ",
        "type": [],
        "definition": [
            "ayrim bozorlarda muayyan holatlarning mavjudligiga, ularning holati, oqibatiga ta’sir etuvchi umumiy ahvoldir. Bozor konyunkturasi ayrim tovarlarga nisbatan ham sodir bo'lishi mumkin. Bozor konyunkturasi ehtimollari milliy, mintaqaviy va jahon bozorlariga nisbatan aniqlanadi. Uni oldindan ko'ra bilish iqtisodiy tanglikka yo'liqmaslik, bozor muvozanatini ta’minlab borish sharti hisoblanadi. U quyidagi belgilar orqali aniqlanadi: ichki va tashqi savdodagi o'zgarishlar; ishlab chiqarish va qurilish dinamikasi; tovar zaxiralari harakati; narxlar dinamikasi va boshqalar. "
        ]
    },
    {
        "word": "Bozor Mexanizmi ",
        "type": [],
        "definition": [
            " bozor iqtisodiyotining faoliyatini tartibga solish va iqtisodiy jarayonlarni uyg'unlashtirishni ta’minlovchi dastak va vositalar. Masalan: baho, talab va taklif, raqobat, pul-kredit. "
        ]
    },
    {
        "word": "Bozor Mexanizmining Afzalliklari ",
        "type": [],
        "definition": [
            "har qanday holat singari bozorning o‘z afzalliklari va kamchiliklari bor: 1. Resurslarning samarali taqsimlanishi - bozor resurslarini jamiyatga zarur bo'lgan tovarlarni ishlab chiqishgayo'naltiradi. 2. G'oyat cheklangan axborot mavjud bo'lganida uning muvafFaqiyatli faoliyat koVsatishining mumkinligi narx va ishlab chiqarish xarajatlari haqidagi ma’lumotlarga ega bo'lish yetarli. 3. Qayishqoqligi, o'zgaruvchan sharoitlargayuqori darajada moslashuvi. Zotan, 70-yillarda energiya manbalariga narxlar keskin oshib ketgan paytda, bozor bunga muqobil energiya manbalarini ishlab chiqish, resurslarni tejovchi texnologiyalarni joriy etish, energiya resurslarini qattiq tejash rejimini kiritish bilan javob berdi. 4. Ilmiy texnika revolyutsiyasi natijalaridan oqilona foydalanish. Tovar ishlab chiqaruvchilar eng yuqori darajada foyda olishga intilib tavakkal qiladilar, yangi tovarlar ishlab chiqaradilar, yangi texnologiyalarni kiritadilar, bu esa ularga raqobatchilari oldida vaqtning afzalliklarga ega bo'lish imkonini beradi. 5. Istemolchilar va tadbirkorlarning erkin tanlashi va harakat qilishi. Ular o‘z qarorlarini qabul qilish, turli bitimlar tuzish, ishchi kuchini yollash va hokazolarda mustaqildirlar. 6. Xilma- xil ehtiyojlarni qondirish, tovarlar va xizmatlar sifatini oshirish, tengsizlikka tezroq tuzatish kiritish qobiliyati. "
        ]
    },
    {
        "word": "Bozor Muhofazasi ",
        "type": [],
        "definition": [
            "milliy bozorning yoki ayrim tovarlar bozorining davlat tomonidan eksport-importni tartibga soluvchi tadbirlari vositasida himoya qilishi. U chetdan tovar keltirishni cheklash, taqiqlash yoki boj to'lovini oshirish orqali amalga oshiriladi. Shu sababli boj to'lovlari o'zgarib turadi. Bir necha mamlakat uchun umumiy bozor hosil bo'lgach, bozor muhofazasi uchun o'rin qolmaydi. "
        ]
    },
    {
        "word": "Bozor Munosabatlari ",
        "type": [],
        "definition": [
            "sotuvchi va xaridor o'rtasidagi munosabatlar. Uning bir qator qoidalari mavjud: 1. Erkin, ixtiyoriy va tenghuquqli bo'lish. 2. Mavjud narxlar va takliflar asosida yuzaga chiqishi. 3. Xaridor va sotuvchi bir-birini o'z ixtiyori bilan tanlashi. 4. Bironta bozor ishtirokchisining monopol huquqqa ega bo'lmasligi. 5. Ishtirokchilar o'rtasidagi aloqalar sog'lom raqobatga asoslanishi kerak. "
        ]
    },
    {
        "word": "Bozor Munоsabatlarining Shakllanishi ",
        "type": [],
        "definition": [
            "ibtidoiy jamoa tuzumining yemirilishi davridayoq boshlangan, ammo tovar- pul munosabatlarining rivoji kapitalizm bosqichiga to'g'ri keladi (Makkonell K.R., Bryu S.P., “Ekonomiks”, М.,1992,12-bet). "
        ]
    },
    {
        "word": "Bozor Muvozanati ",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti sharoitida talab, taklif va narxlarning o'zgarib turishi sotuvchilarning sotishga tayyor turgan tovarlarining miqdori xaridorlar talabi miqdoriga tenglashguniga qadar davom etaveradi. Bunday holda talab narxi taklif narxiga teng bo' ladi, talab va taklifhajmi esa ko'paymaydi ham, kamaymaydi ham. Bozorda bunday taklif bozor muvozanati shu sharoitda sotiladigan va sotib olinadigan tovarlar hajmi esa miqdor muvozanati deyiladi. Agar shunday muvofiqlik bo'lmasa, bozor muvozanati izdan chiqqan hisoblanadi. Talab va taklif uzoq vaqt bir-biridan ajralib qolsa, bozor o'zining me’yordagi holati, faoliyatini yo'qotadi. "
        ]
    },
    {
        "word": "Bozor Narxi ",
        "type": [],
        "definition": [
            " bozorda aniq tovarlar bo'yicha talab va taklifning to'la mutanosib bo'lishi hamda raqobat ta’siri natijasida shakllanadigan narx. "
        ]
    },
    {
        "word": "Bozor Narxidagi Yalpi Ichki Mahsulot (Yalm) ",
        "type": [],
        "definition": [
            "Mamlakatdagi barcha ishlab chiqaruvchilar birligining ishlab chiqarish faoliyati bo'yicha pirovard natijasini o'ziga aks ettiradi. Bu ko'rsatkich butun iqtisodiyot bo'yicha umumiy ishlab chiqarilgan va undan oraliq iste’mol chegirib tashlangan qo'shilgan qiymat solig'idan tashqari mamlakatlar mahsulot importiga solingan sof soliq qo'shilgan ko'rsatkichdir. "
        ]
    },
    {
        "word": "Bozor Obyekti ",
        "type": [],
        "definition": [
            "bozorga, ayirboshlash munosabatlariga jalb qilingan iqtisodiy faoliyat natijalari va iqtisodiy resurslar, tovar, pul va unga tenglashtirilgan moliyaviy aktivlar. "
        ]
    },
    {
        "word": "Bozor Potensiali ",
        "type": [],
        "definition": [
            "iste’molchilar xarid qobiliyati bilan belgilaydigan tovar sotish imkoniyatlari."
        ]
    },
    {
        "word": "Bozor Qiymati ",
        "type": [],
        "definition": [
            "xarajatlari belgilangan tarzda ishlab chiqarilgan tovar qiymati. Bu qiymat tovarlarning bozordagi bahosini tartibga solib turadi. "
        ]
    },
    {
        "word": "Bozor Qonunlari ",
        "type": [],
        "definition": [
            "pul vositasida bozorda tovar ayirboshlashning mohiyatini ifoda etuvchi, uni boshqarib turuvchi obyektiv iqtisodiy qonunlar. Ular jumlasiga talab va taklif qonuni hamda pul muomalasi qonuni kiradi. "
        ]
    },
    {
        "word": "Bozor Segmenti ",
        "type": [],
        "definition": [
            "bozorning ma’lum qismini tashkil etadi va bozordagi iste’mol maqsadi bir bo'lgan xaridorlarning xatti-harakatini tavsiflaydi. Xaridorning daromadi, turar joyi, oilaviy, milliy urf-odatlari, jinsi, yoshi va boshqa xususiyatlariga qarab bozor segmentlashtiriladi. Bozorlar quyidagi asosiy turlarga - subbozor va bozor segmentlariga bo'linadi. Umuman, bozor boy va murakkab tuzilishi bilan xarakterlanadi. U turli mezonlar bo'yicha tafsivlanadi: 1. Bozor munosabatlari obyektlarining iqtisodiy ahamiyati bo'yicha iste’mol mollari va xizmatlari bozori, sanoati mollari bozori, oraliq mollar bozori, noy-xay bozori, xomashyo bozori, mehnat bozori, qimmatli qo'g'ozlar bozori, chayqov bozori, ikkilamchi xomashyo bozori va hokazo; 2. Geografik holati bo'yicha mahalliy, milliy, jahon. 3. Raqobatni cheklash darajasi bo'yicha - monopolistik, oligonolistik, monolsonik, erkin, aralash. 4. Tarmoqlar bo'yicha - avtomobil, kompyuter, neft va hokazo. 5. Sotish xususiyatiga ko'ra - ulgurji, chakana. "
        ]
    },
    {
        "word": "Bozorsigʻimi",
        "type": [],
        "definition": [
            "ma’lum bozorda ma’lum muddatda to'lovga qodir mol taklifi va chakana narx darajasi hisobga olingan holda sotilishi mumkin bo'lgan mol miqdori. Bozor sig'imini aniqlashda biror tovarga mo'ljallangan aholining xarid quwati, korxonalarning aynan shu molni sotib olish ehtiyoji hisobga olinadi. "
        ]
    },
    {
        "word": "Bozor Strukturasi ",
        "type": [],
        "definition": [
            "bozorning alohida bo'g'inlari, bo'laklari, qismlari, qatlamlari, kataklari to'plamidan iborat o'zaro bog' liq ichki tuzilishi."
        ]
    },
    {
        "word": "Bozor Subyekti ",
        "type": [],
        "definition": [
            "bozorning ayirboshlash munosabatlari qatnashchilari. "
        ]
    },
    {
        "word": "Bozor Tizimi ",
        "type": [],
        "definition": [
            " turli-tuman mezonlar asosida alohida unsurlarga ajratilgan barcha bozorlar majmuyidir."
        ]
    },
    {
        "word": "Bozor Uchun Ishlab Chiqarish",
        "type": [],
        "definition": [
            "quyidagilardan tarkib topadi: ayni bir davrda ishlab chiqariladigan va sotiladigan hamda o'z bahosi bilan ayni shu mahsulotga bo'lgan talabga katta ta’sir ko'rsatadigan tovarlar vaxizmatlar; ayni bir davrda barter usulida boshqa tovarlarga almashtirish uchun ishlab chiqarilgan tovarlar va xizmatlar; ayni bir paytda ishlab chiqarilib, o'z xodimlariga mehnat haqi va natura shaklida beriladigan tovarlar va xizmatlar; bir korxonada ishlab chiqarilib, ayni shu korxonaga qarovchi boshqa korxonaga yetkazib beriluvchi tovarlar va xizmatlar; bu korxonada ayni shu paytda yoki kelajakda ishlatilishi mumkin tovar va xizmatlar; muayyan bir davrda ishlab chiqarilgan, shu davrga oid tugallanmagan ishlab chiqarish hisoblangan tayyor mahsulotlar; bular sotilgunga qadar yoki barter usulida almashuvga qadar, xodimlarga ish haqi evaziga berilishdan yoki kelgusida korxonalararo mol yetkazib berish rejasiga muvofiq ishlab chiqaruvchida moddiy aylanma vositalar zaxirasida qoldiriluvchi tayyor mahsulot. "
        ]
    },
    {
        "word": "Bozor Ulushi ",
        "type": [],
        "definition": [
            "korxonaning bir xil yoki o'xshash tovarlar sotishdagi hissasi. "
        ]
    },
    {
        "word": "Bozor Va Bozorga Oid Bolmagan Ishlab Chiqaruvchilar ",
        "type": [],
        "definition": [
            "- bozorga mo'ljallangan mahsulotning ko'pgina qismi yoki hammasini ishlab chiqaruvchi ishxona yoki korxonalar bozor uchun mahsulot ishlab chiqaruvchilar deb ataladi. Bozorga mo'ljallanmagan mahsulotning ko'pgina qismi yoki hammasini ishlab chiqaruvchi ishxona yoki korxonalar bozorga oid bo'lmagan ishlab chiqaruvchilar deb ataladi. "
        ]
    },
    {
        "word": "Bozor Yangiligi ",
        "type": [],
        "definition": [
            " biror bozorda birinchi marta taklif etiladigan tovar, uning yangi turi, varianti, o'rami va hokazolar. "
        ]
    },
    {
        "word": "Bozor Yetakchisi Narxi ",
        "type": [],
        "definition": [
            "aniq tovar sotishda hissasi katta bo'lgan korxona tovariga belgilanadigan narx bo'lib, boshqalarning narxlaridan pastroq yoki yuqoriroq bo'Iishi mumkin. "
        ]
    },
    {
        "word": "Bozorga Chuqurrod Singish Strategiyasi ",
        "type": [],
        "definition": [
            "mavjud tovarni mavjud bozorda sotishga qaratilgan marketing strategiyasi. "
        ]
    },
    {
        "word": "Bozorga Kirish Narxi ",
        "type": [],
        "definition": [
            "yangi tovarning bozorga kirish yoki mavjud tovarning yangi bozorga kirish bosqichida belgilangan va amal qiladigan narx. "
        ]
    },
    {
        "word": "Bozorga Kirish Strategiyasi ",
        "type": [],
        "definition": [
            "yangi tovarni biror bozorga kiritish uchun marketing kompleksini qo'llash tartibi. "
        ]
    },
    {
        "word": "Bozorga Oid Boʻlmagan Ishlab Chiqarish",
        "type": [],
        "definition": [
            "bozorga oid bo'lmagan ishlab chiqarish quyidagilardan iborat bo'ladi: ayni shu davrda ishlab chiqilgan, ishxona yoki korxona sohiblarining pirovard iste’molga yoki asosiy kapitalning yalpi jamgarishga mo'ljallab qoldiriladigan tovarlar va xizmatlar; uy xo'jaligi doirasida haq to'lanadigan uy xizmatchisi korsatadigan xizmat; uy xo‘jaliklari va bozorga oid bolmagan ishlab chiqaruvchilar tomonidan o‘z binolarida foydalaniladigan xizmat; ayni paytda ishlab chiqiladigan va pulsiz yoki talabga uncha sezilarli ta sir ko'rsatmaydigan baholarda boshqa institutsion birliklarga yetkazib beriladigan tovar va xizmatlar hamda jamiyatga ko'rsatiladigan ijtimoiy xizmatlar; ayni shu davrda ishlab chiqarilgan tayyor mahsulot va tugallanmagan ishlab chiqarish; bular bozordan tashqari maqsadlarda ishlatiladigan va ishlab chiqaruvchining moddiy oborot vositalari zaxirasini to'ldiradi. "
        ]
    },
    {
        "word": "Bozorlar Va Usullar ",
        "type": [],
        "definition": [
            "hozirgi zamon bozor iqtisodiyotidagi moliyaviy bozorning ustuvor yo'Ii iqtisodiy agentlarning jamg‘arm alar ini yig'ishi va ushbu mablag'Iardan yangidan kapital yaratish uchun foydalanishdir. "
        ]
    },
    {
        "word": "Bozorniegallash Strategiyasi ",
        "type": [],
        "definition": [
            " aniq bozorda ko'zda tutilgan o‘rin va mavqega erishish uchun marketing kompleksini qo'llash tartibi. "
        ]
    },
    {
        "word": "Bozorni Majmuaviy Oʻrganish ",
        "type": [],
        "definition": [
            "korxonaning ishlab chiqarish, savdo, tovar, sotish, reklama, narx va boshqa sohalaridagi tadqiqot, tahlil va prognoz (bashorat). Raqobatdoshlar faoliyatini o'rganish. "
        ]
    },
    {
        "word": "Bozorni Segmentlash ",
        "type": [],
        "definition": [
            "bozorning har biri uchun alohida tovarlar yoki marketing kompleksi talab qilinishi mumkin bo'lgan xaridorlarning aniq guruhlariga bo'lish, taqsimlash. "
        ]
    },
    {
        "word": "Bozorni Tadqiq, Etish ",
        "type": [],
        "definition": [
            "l) muntazam ravishda ishlab chiqarish bozorlarini (ishlab chiqarishni takomillashtirish uchun), ularning mavjud va potensial iste’molchilar ehtiyojini qondirish uchun tovar va xizmatlar ishlab chiqarishni ta’minlash qobiliyatini tadqiq etish. Tadqiqotlar sotuv bozori, ishchi kuchi bozori, kapital bozori hamda xomashyo va materiallar bozorini qamrab oladi; 2) bozori sig'imi, salohiyati, raqobatchilik muhiti va narx tavsifnomalari to‘g‘risidagi ma’lumotlarni olish uchun bitta yoki bir nechta bozorlarning sifat va miqdoriy tahlili. "
        ]
    },
    {
        "word": "Bozorning “Qaymogʻini Terish” Strategiyasi ",
        "type": [],
        "definition": [
            "bozorda tamoman (prinsipial) yangitovarniyuqorinarxdasotib, o'rtachadan ko'proq foyda olishga mo'Ijallangan marketing strategiyasi. "
        ]
    },
    {
        "word": "Bozorning Raqobatchilik Xaritasi ",
        "type": [],
        "definition": [
            "l) raqobatchilarini bozorda egallab turgan o‘rniga ko'ra tasniflash; 2) bozorda raqobatchiningo'rnininazoratqilishimkoniniberuvchiraqobatchilar ulushini taqsimlash. Aniq tovar bozorlarida raqobatchilarning о‘mini tahlil qilish natijasida aniqlanadi. "
        ]
    },
    {
        "word": "Bozorning Tuzilishi",
        "type": [],
        "definition": [
            "bu bozor elementlarining ichki tuzilishi, joylashishi va tartibi, ularning bozor umumiy hajmidagi ulushi demakdir. "
        ]
    },
    {
        "word": "Brak",
        "type": [],
        "definition": [
            "ishlab chiqarishda buxgalteriyaning asosiy vazifalaridan biri braki (andozaga mos kelmaslik) hisobiga hamda yarim tayyor mahsulot va boshqa moddiy boyliklarning buzilishi, kamomadi natijasida keladigan nobudgarchiliklarni tog‘ri hamda o'z vaqtida aniqlashdan iborat. "
        ]
    },
    {
        "word": "Brakeraj",
        "type": [],
        "definition": [
            "tovarning sifati, bezatilishi va transportbop qilib o'ralishi belgilangan standart yoki shartnoma shartlariga mos kelishini tekshirish. Brakeraj maxsus davlat tashkilotlari yoki hakam brokerlar tomonidan bajariladi. "
        ]
    },
    {
        "word": "Brending",
        "type": [],
        "definition": [
            "marketing kommunikatsiyalari tizimining firma stili va uning elementlarini ishlab chiqish, firmaning raqobatchilardan ajratib turuvchi o'ziga xos imijini yaratish sohasi. "
        ]
    },
    {
        "word": "Broker",
        "type": [],
        "definition": [
            "(ingl. broker) - mahsulot, qimmatbaho qog'ozlar, valyuta sotuvchilar va xaridorlar o'rtasidagi rasmiy dallol. O'zi yoki mijozlar nomidan kelishuvlar, shartnomalar tuzish huquqiga ega shaxs. Broker komission (vositachilik) haqi oladi. Brokerlik vazifasini firma va tashkilotlaming shaxslari bajaradi. Broker aynan birjada o'z ishini amalga oshiradi. Broker sotuvchi va xaridorlami “birlashtiradi”, lekin o'z hisobidan ish yuritmaydi. Katta birja brokeri - birja xizmatchisi bo'lib, istalgan tovar seksiyasida savdo o'tkazish va birja brokerlari o'z vazifalarini to'g'ri bajarayotganligini nazorat qilish huquqiga ega. Buyuk Britaniyaning davlat obligatsiyalari bozorida fond birjasining hukumat brokeri lavozimi bo'lib, u hukumat agenti vazifalarini bajarish uchun tayinlandi. Bunday birjada ish yurituvchi broker stok broker deb ataladi. Brokerlar mijozlarga bozorni o'rganish bo'yicha, reklama, kreditlar olish va hokazolar xususida qo'shimcha xizmatlar ham ko'rsatadi. "
        ]
    },
    {
        "word": "Brokerlik Hisob Raqami",
        "type": [],
        "definition": [
            "buyurtmachi broker yoki boshqa shaxsga qimmatli qog'ozlar yoki tovarlarni xarid qilish yoki sotishda erkin harakat qilish imkoniyatini bergan hisob raqami. Bunda broker vaqt, miqdor va narxni tanlash erkinligiga ega. "
        ]
    },
    {
        "word": "Brokerlik Krediti",
        "type": [],
        "definition": [
            "banklar, birja dallollari va dilerlar qimmatli qog'ozlarni xarid qilish va sotish bo'yicha fond birjasida operatsiyalarni amalga oshirish uchun ajratadigan kredit."
        ]
    },
    {
        "word": "Brokerlik Faoliyati ",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar bilan bitimlarni topshiriq yoki vositachilik shartnomasi yoxud bunday bitimlarni bajarish uchun ishonch qog'ozi ostida amal qiluvchi ishonchli shaxs yoki komissioner sifatida mukofot evaziga bajarish. "
        ]
    },
    {
        "word": "Brutto",
        "type": [],
        "definition": [
            "(ital. brutto - qo'pol) - tovarlarning idishi yoki o'rovi bilan birgalikdagi og'irligi. Tovarlarning bunday og'irligi ba’zi hollarda zarur bo'lsa- da, lekin tovarning sof og'irligi haqida aniq ma’lumot berolmaydi. Buning uchun tovarning sof og'irligi (netto)ni aniqlash lozim."
        ]
    },
    {
        "word": "Brutto-Mukofot ",
        "type": [],
        "definition": [
            " sug'urta shartnomalarini tuzish, ishyuritishxarajatlarini hisobga olgan holdagi sug'urta mukofotlari summasi. "
        ]
    },
    {
        "word": "Brutto-Stavka ",
        "type": [],
        "definition": [
            "sug'urta qoplamasi (sug'urta summasi)ni to'lashga mo'ljallangan netto-stavka va ish yuritish xarajadarini qoplashga mo'ljallangan netto-stavkaga yuklama summalarini o'z ichiga olgan sug'urta mukofotlarining tarif stavkasini bildiradi. Ko'pgina adabiyotlarda ushbu ibora sug'urta tarifi ma’nosida ham ishlatiladi. "
        ]
    },
    {
        "word": "Budjet",
        "type": [],
        "definition": [
            "( ingl. budget-sumka) - davlat, korxona, muassasa va shu kabilarning ma'lum muddat uchun oldindan belgilab qo‘yiladigan kirim- chiqim, daromad-buromad smetasi. Budjet markaziy va mahalliy hokimiyat organlarining faoliyatini ta'minlash uchun pul mablag‘ lari yig‘indisini shakllantirish va ishlatishning shakli. Budjet muayyan davr mobaynida alohida tashkilot yoxud davlat tomonidan qilinishi mumkin bo'lgan sarf-xarajatlarni chamalash asosida hisoblab chiqilishi; daromad va xarajatlarni taqsimlash, tizimlashtirish; turli xil ishlarga mo'ljallangan sarf-xarajat va resurslarning (vaqt budjeti) taqsimlanishi. "
        ]
    },
    {
        "word": "Budjet Assignovaniyasi ",
        "type": [],
        "definition": [
            "biron-bir korxona yoki tarmoqni rivojlantirishga davlat budjetidan ajratilgan mablag'. "
        ]
    },
    {
        "word": "Budjet Balansi ",
        "type": [],
        "definition": [
            " xarajatlar va daromadlaming teng bo'lishidir."
        ]
    },
    {
        "word": "Budjet Chegarasi ",
        "type": [],
        "definition": [
            "“umumiy vaqt - daromad” koordinatalariga egabo'lgan to'g'ri chiziq bo'lib, uning yotiqlik burchagi ish haqini ifodalaydi. (daromad 0 bo'lganda, vaqt 24 soatga teng, ya’ni (24,0). "
        ]
    },
    {
        "word": "Budjet Chizigʻ1 ",
        "type": [],
        "definition": [
            "budjetni to'liq sarflash sharti bilan iste’molchi sotib oladigan tovarlar kombinatsiyalarini ifodalovchi chiziq. "
        ]
    },
    {
        "word": "Budjet Daromad Lari ",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasining qonun hujjatlariga muvofiq, beg'araz va qaytarmaslik sharti bilan budjetga tushadigan va O'zbekiston Respublikasining markaziy hamda mahalliy davlat hokimiyati organlari tasarruf qiladigan pul mablag'lari. "
        ]
    },
    {
        "word": "Budjet Daromadlarining Moddiy-Buyumlash Gan Maz Muni",
        "type": [],
        "definition": [
            "davlatning ixtiyoriga borib tushgan pul mablag'lari tashkil etadi. "
        ]
    },
    {
        "word": "Budjet Defitsiti (Taqchilligi) ",
        "type": [],
        "definition": [
            "davlat budjeti xarajat qismining daromadlar qismidan ortiqcha miqdori. Masalan, davlat budjeti daromadlari 15 trln, xarajatlari esa 18 trln so'mni tashkil etdi. Bunda budjet defitsiti 3 trln (18-15) so'mga teng bo'ladi. Uning vujudga kelish sabablari: ishlab chiqarishning tanazzuli, “yashirin” kapital oboroti, raqobatdosh bo'lmagan sifatsiz mahsulotni ishlab chiqarish, ortiqcha pul emissiyasi. Budjet defitsitini qoplashning uchta yo'li bor. Bular: davlat zayomlari, yangi pullar emissiyasi, soliq solishni kuchaytirish. "
        ]
    },
    {
        "word": "Budjet Dotatsiyasi ",
        "type": [],
        "definition": [
            "o'z daromadlari va budjet tomonidan tartibga solinadigan barcha mablag'lar yetishmagan holda quyi budjetning xarajatlari bilan daromadlari o'rtasidagi farqni qoplash uchun yuqori budjetdan quyi budjetga tekinga (haq olmay) ajratiladigan pul mablag'lari. "
        ]
    },
    {
        "word": "Budjet Huquqi ",
        "type": [],
        "definition": [
            "mamlakat budjet tuzilishi (qurilishi)ning asoslarini, mamlakatning budjet tizimiga kiruvchi budjetlarni tuzish, ко‘rib chiqish (muhokama qilish), tasdiqlash va ijro etish tartibini aniqlovchi yuridik me’yorlar majmuyi. "
        ]
    },
    {
        "word": "Budjet Intizomi ",
        "type": [],
        "definition": [
            "korxona, muassasa, tashkilotlar, shuningdek, rahbar va jismoniy shaxslar tomonidan budjetdan to'lanadigan barcha to'lovlarni aniq tartibda, o‘z vaqtida va to'liq ravishda amalga oshirish hamda budjet mablag'larini belgilangan yo'nalishlarga muvofiq maqsadli sarflashdir. "
        ]
    },
    {
        "word": "Budjet Jarayoni ",
        "type": [],
        "definition": [
            "davlat budjetini tuzish, ко‘rib chiqish, qabul qilish va ijro etish, uning ijrosini nazorat qilish, ijrosi haqidagi hisobotni tayyorlash va tasdiqlash, shuningdek, Davlat budjeti tuzilmasiga kiruvchi budjetlar o'rtasidagi o'zaro munosabatlarni tartibga solish bo'yicha qonunchilik bilan reglamantatsiya qilingan hokimiyat organlari faoliyati. Yagonalik, mustaqillik va balans metodi budjet jarayonining prinsiplaridir. "
        ]
    },
    {
        "word": "Budjet Kamomadi (Budjet Taqchilligl) ",
        "type": [],
        "definition": [
            "davlat budjetidagi xarajatlaming daromadlardan ustun bo'lishi. "
        ]
    },
    {
        "word": "Budjet Klassifikatsiyasi (Tasnifi) ",
        "type": [],
        "definition": [
            "Davlat budjeti tuzilmasiga kiruvchi budjetlar daromadlari va xarajatlari, shuningdek, uning defitsitini moliyalashtirish manbalarini guruhlash. Unda tasnif obyektlariga guruhlashtiruvchi kodlar beriladi. Barcha darajadagi budjet ko'rsatkichlarining qiyoslanishini ta’minlaydi. Budjet tasnifi budjet daromadlari tasnifini, budjet xarajatlarining vazifa jihatidan, tashkiliy va iqtisodiy tasnifini, Davlat budjeti taqchilligini moliyalashtirish manbalari tasnifini o‘z ichiga oladi. Budjet daromadlari tasnifi qonun hujjatlariga muvofiq daromadlarni turlar va manbalar bo'yicha guruhlarga bo'lishdan iboratdir. Budjet xarajatlarining vazifa jihatidan tasnifi davlat boshqaruv organlari, mahalliy davlat hokimiyati organlari, shuningdek, boshqa budjet tashkilotlari tomonidan ijro etiladigan asosiy vazifalar bo'yicha xarajatlarni guruhlarga bo'lishdan iborat bo'ladi. Budjet xarajatlarining tashkiliy tasnifi esa budjetdan ajratiladigan mablag'lar ularni bevosita oluvchilar o'rtasida taqsimlanishini aks ettiruvchi xo'jalik yurituvchi subyektlar va tadbirlar turlari bo'yicha xarajatlarni guruhlarga bo'lishdan iboratdir. Budjet xarajatlarining iqtisodiy tasnifi to'lovlarning iqtisodiy vazifasi va turlari bo'yicha xarajatlarni guruhlashni o'z ichiga oladi. Davlat budjeti defitsitini moliyalashtirish manbalari tasnifi defitsitni moliyalashtirishning ichki va tashqi manbalari bo'yicha guruhlarga bo'lishdan iborat bo'ladi. Budjet tasnifi qonun hujjatlarida belgilangan tartibda O'zbekiston Respublikasi Moliya vazirligi tomonidan ishlab chiqiladi va tasdiqlanadi."
        ]
    },
    {
        "word": "Budjet Mablag* Oluvchilar ",
        "type": [],
        "definition": [
            "budjet mablag'larining taqsimlovchisi yoki joriy moliya yilida budjet rospisiga muvofiq, budjet mablag'larini olishga huquq berilgan hamda tasdiqlangan smeta doirasida moliyalashtiriladigan budjet tashkiloti yoki boshqa muassasalar. "
        ]
    },
    {
        "word": "Budjet Mablagʻlaridan Foydalanishning Samaradorliligi Va Tejamliligi Prinsipi ",
        "type": [],
        "definition": [
            "ma’no-mazmuni shundan iboratki, unga muvofiq ravishda vakolatli organlar va budjet mablag'larini oluvchilar budjetlarni tuzish va ularning ijrosini ta’minlashda, eng awalo, ko'zda tutilgan (rejalashtirilgan) maqsadlarga erishishda mablag'larning eng kamroq hajmidan yoki ma’lum bir hajmdagi budjet mablag'laridan foydalangan holda, eng yuqori natijaga erishishning zarurligidan kelib chiqmog'i kerak. "
        ]
    },
    {
        "word": "Budjet Mablagʻ Larining Taqsimlovchilari ",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasining davlat hokimiyati va mahalliy boshqaruv organlaridir. Ularga Davlat budjetini xarajatlar tasnifiga muvofiq Davlat budjeti mablag'larini idoraviy taqsimlovchilar va budjet mablag'larini oluvchilarga mablag'larni taqsimlash huquqi berilgan. "
        ]
    },
    {
        "word": "Budjet Majburiyatlarining Limiti ",
        "type": [],
        "definition": [
            "budjet ijrosini amalga oshiruvchi, budjet mablag'larini taqsimlovchi va oluvchi organlar uchun aniqlangan va tasdiqlanganbudj et majburiyatlari yig'indisidir. "
        ]
    },
    {
        "word": "Budjet Profitsiti ",
        "type": [],
        "definition": [
            "muayyan davrda budjet daromadlarining budjet xarajatlaridan ortiq bo'lgan summasi."
        ]
    },
    {
        "word": "Budjet Resurslari ",
        "type": [],
        "definition": [
            "davlat budjetiga uning daromadlari tarzida kelib tushadigan budjet resurslari. Ular mamlakat markazlashtirilgan moliya resurslarining katta qismini tashkil etadi. Budjet resurslari quyidagilarni pul bilan ta’minlash uchun ishlatiladi: xalq xo'jaligini rivojlantirish va uni struktura jihatdan qayta ko'rish, maxsus ehtiyojlar, mudofaa va boshqaruv organlarini saqlash xarajatlariga; korxonalar va tashkilotlar olgan foyda, aholining daromadlari, mahsulot tannarxiga qo'shiladigan maxsus ajratmalar, tashqaridan keladigan tushumlar. Budjet resurslarni shakllantirish turli usullar: soliqlarni olish, maqsadli ajratmalar, qarzlar va yordam olish yo'Ii bilan amalga oshirilishi mumkin. "
        ]
    },
    {
        "word": "Budjet Rospisi (Roʻyxat-Yozuvl) ",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasining budjet tasnifiga muvofiq tuziladigan budjetning daromadlari va xarajatlarini, budjetning taqchilligini moliyalashtirish manbalari tushumining choraklik taqsimoti to'g'risidagi hujjatdir, mazkur hujjatda tasdiqlangan budjet mablag'larining budjet mablag'larini oluvchilari o'rtasidagi taqsimoti belgilanadi. Unda yil davomida soliqlar va boshqa to‘ lovlarning budjetga kelib tushish va budjet mablag'larining sarflanish muddatlari o'z aksini topadi. "
        ]
    },
    {
        "word": "Budjet Soʻrovi ",
        "type": [],
        "definition": [
            "budjet tasnifi bo'yicha tushumlarni shakllantirish va budjetdan mablag' ajratish to'g'risidagi so'rov. O'zbekiston Respublikasi Moliya vazirligi har yili O'zbekiston Respublikasi Vazirlar Mahkamasi tomonidan belgilangan muddatlarda kelgusi moliya yiliga: l) tegishli hududlar va davlat maqsadli fondlari budjetlari loyihalarini tayyorlash uchun Qoraqalpog'iston Respublikasi Vazirlar Kengashiga, viloyatlar va Toshkent shahri hokimliklariga, davlat maqsadli fondlarini taqsimlovchi organlarga; 2) budjetdan ajratiladigan mablag'larni olishga buyurtmalar tuzish uchun respublika budjetidan moliyalashtiriladigan budjet mablag'larini oluvchilarga budjet so‘rovini yuboradi"
        ]
    },
    {
        "word": "Budjet Ssudasi",
        "type": [],
        "definition": [
            "yuqori budjetdan quyi budjetga yoxud respublika budjetidan rezident-yuridik shaxsga yoki chet el davlatiga qaytarish sharti bilan ajratiladigan mablag'. "
        ]
    },
    {
        "word": "Budjet Subvensiyasi ",
        "type": [],
        "definition": [
            "qonun hujjatlarida nazarda tutilgan tartibda muayyan tartibda muayyan maqsadlarga sarflash sharti bilan yuqori budjetdan quyi byujetga qaytarmaslik sharti bilan ajratiladigan pul mablag'lari. "
        ]
    },
    {
        "word": "Budjet Soliq. Siyosati ",
        "type": [],
        "definition": [
            "budjet siyosatida davlat o'z istagi bilan budjet xarajatlari va daromadlarini shakllantirgan holda 3 xil budjet siyosati yuritadi. Budjet xarajatlari, transfer xarajatlari shaklidagi xarajatlar. Daromadlar esa uch manbadan kelishi mumkin: soliqlardan, xazina tomonidan, chiqarilgan qimmatbaho qog'ozlar sotilishidan va budjet tomonidan ma’lum qismi markaz tomonidan bank emmissiyasi hisobiga yopilishidan. Shunga ko'ra, davlat xarajatlar va daromadlarni boshqarish orqali budjet siyosatini yuritadi."
        ]
    },
    {
        "word": "Budjet Taqchilligi ",
        "type": [],
        "definition": [
            " moliyaviy yil natijalariga ko'ra davlat budjetida xarajatlarning daromadlardan ustun bo'lishi. "
        ]
    },
    {
        "word": "Budjet Tashkiloti ",
        "type": [],
        "definition": [
            "zimmasiga yuklatilgan vazifalarni baj arish bilanb og ' liq bo'lgan o'z faoliyatini amalga oshirish uchun davlat budjetidan mablag' ajratish nazarda tutilgan va bu mablag' moliyalashtirishning asosiy manbayi hisoblanadigan vazirlik, davlat qo'mitasi, idora, davlat tashkiloti hisoblanadi."
        ]
    },
    {
        "word": "Budjet Tashkilotlarining Xarajatlar Smetasi ",
        "type": [],
        "definition": [
            "budjet tashkilotlari tomonidan bir moliya yili davomida davlat budjetidan mablag' olish maqsadida tuziladigan va bevosita o'zi tegishli bo' lgan moliya organlari tomonidan ro'yxatdan o'tkaziladigan hamda tasdiqlanadigan moliyaviy reja hisoblanadi. "
        ]
    },
    {
        "word": "Budjet Tasnifi ",
        "type": [],
        "definition": [
            "davlat budjeti tuzilmasiga kiruvchi budjetlar daromadlari va xarajatlari, shuningdek, uning taqchilligini moliyalashtirish manbalarini guruhlashtirishdan iboratdir. "
        ]
    },
    {
        "word": "Budjet Tizimi ",
        "type": [],
        "definition": [
            "turli darajadagi budjetlar va budjet mablag'lari oluvchilar yig'indisi, budjetlami tashkil etish va ularni tuzish prinsiplari, budjet jarayonida ular o'rtasida, shuningdek, budjetlar hamda budjet mablag'lari oluvchilar o'rtasida vujudga keladigan o'zaro munosabatlarni ifodalaydi. Mamlakatning butun hududida amal qiladigan, iqtisodiy munosabatlar va yuridik normalarga asoslangan barcha budjetlar majmuyi. Respublika budjeti, Qoraqalpog'iston Respublikasi va mahalliy budjetlami o'z ichiga oladi. "
        ]
    },
    {
        "word": "Budjet Tizimini Boshqarish Sohasidagi Ozbekiston Respublikasi Moliya Vazirligining Vakolatlari ",
        "type": [],
        "definition": [
            "- davlat budjeti loyihasini tayyorlash (shakllantirish), Davlat budjeti va uning tuzilmasiga kiruvchi budjet mablag'lari tushumi va sarfining tartibini belgilash hamda nazoratini amalga oshirish, respublika budjeti xarajatlarini amalga oshirish, budjet tashkilotlarining xarajatlar smetasi va shtat jadvallarini ro'yxatdan o'tkazish, budjet mablag'lari oluvchilarning Davlat budjeti mablag'laridan foydalanishini tartibga soluvchi normativ-huquqiy hujjatlar, shuningdek, o'z vakolatlari doirasida umummajburiy tusdagi boshqa normativ-huquqiy hujjatlarni qabul qilish va qonun hujjatlariga muvofiq boshqa vakolatlarni o'z ichiga oladi. "
        ]
    },
    {
        "word": "Budjet Tizimini Boshqarish Sohasidagi Qoraqalpogʻiston Respublikasi Davlat Hokimiyati Organlari Va Joylardagi Davlat Hokimiyati Оrganlarining Vakolatlari",
        "type": [],
        "definition": [
            "a) Qoraqalpog'iston Respublikasi Juqorg'i Kengesi va mahalliy hokimiyat vakillik organlari: belgilangan tartibda Qoraqalpog'iston Respublikasi budjeti va mahalliy budjetlarni qabul qilish, shuningdek, ularning ijrosi to'g'risidagi hisobotlarni tasdiqlash, qonun hujjatlariga muvofiq mahalliy budjetga tushadigan mahalliy soliqlar, yig'imlar va to'lovlar miqdori hamda ular bo'yicha imtiyozlarni belgilash, qonun hujjatlariga muvofiq ravishda boshqa vakolatlarni amalga oshirish; b) Qoraqalpog'iston Respublikasi Vazirlar Kengashi va tegishli hokimliklar: Qoraqalpog'iston Respublikasi budjeti va mahalliy budjetlar Ioyihalarini belgilangan tartibda Qoraqalpog'iston Respublikasi Juqorg'i Kengesi va mahalliy hokimiyat vakillik organlari qabul qilishi uchun taqdim etish va ularning ijrosi to'g'risidagi hisobotlarni tuzish, budjetga tushumlar to'liq va o'z vaqtida tushishi hamda budjet mablag'laridan belgilangan maqsadlarda foydalanilishi ustidan nazoratni tashkil etish, qonun hujjatlariga muvofiq boshqa boshqa vakolatlardan iborat. "
        ]
    },
    {
        "word": "Budjet Tizimining Asosiy Prinsiplari ",
        "type": [],
        "definition": [
            "budjet tasnifi tizimi, hisobga olish-budjet hujjatlari va budjet jarayoni tuzilishining yagonaligi; budjet tuzilishining ma’muriy-hududiy tuzilishga muvofiqligi; turli darajadagi budjetlarning o'zaro bog'liqligi; Davlat budjetining balansliligi; davlat daromadlarini aniq manbalar va xarajatlarini yo'nalishlar (moddalar) bo'yicha rejalashtirish; Davlat budjeti xarajatlarini tasdiqlanganbudjetdan ajratiladigan mablag'lar doirasida sarflash; barcha darajadagi budjetlarning mustaqilligidan iborat. "
        ]
    },
    {
        "word": "Budjet Tizimining Darajalari Oʻrtasida Daromadlar Va Xarajatlarning Chegaralanganligi Prinsipi ",
        "type": [],
        "definition": [
            "tegishli daromadlar turlari (to'liqyoki qisman) va xarajatlarni amalga oshirish bo'yicha vakolatlarni mamlakatning hokimiyat organlari, mamlakat subyektlarining hokimiyat organlari va mahalliy o'z- o'zini boshqarish organlariga biriktirilganligini ko'zda tutadi. "
        ]
    },
    {
        "word": "Budjet Tizimining Yagonaligi Prinsipi ",
        "type": [],
        "definition": [
            "huquqiy bazalar, pul tizimi, budjet hujjatlari shakllari, budjet jarayoni prinsiplari, budjet qonunchiligini buzganlik uchun sanksiyalarning yagonaligi, mamlakat budjet tizimi barcha darajalari budjetlari xarajatlarini moliyalashtirish va budjet mablag'lari buxgalteriya hisobini yurgizish tartibining yagonaligi bilan belgilanadi. "
        ]
    },
    {
        "word": "Budjet Transferti ",
        "type": [],
        "definition": [
            "budjetdan yuridik va jismoniy shaxsga bevosita yoxud vakolatli organ orqali ajratiladigan qaytarilmaydigan pul mablag' lari. "
        ]
    },
    {
        "word": "Budjet Tuzilmasi ",
        "type": [],
        "definition": [
            "budjet tizimi tuzilishini tashkil etish va prinsiplari, uning tarkibiy tuzilmasi, ular alohida bo'g'inlari o'rtasidagi o'zaro bog'liqlikni ifodalaydi. Davlat tuzilishi bilan aniqlanadi. 0 ‘zbekiston Respublikasining budjet tuzilmasi: a) Davlat budjeti; b) respublika budjeti; v) Qorqalpog'iston Respublikasi budjeti va mahalliy budjetlami o'z ichiga oladi. Davlat budjeti tarkibida davlat maqsadli fondlari jamlanadi. Qoraqalpog'iston Respublikasi budjeti Qoraqalpog'iston Respublikasining respublika budjeti hamda respublika (Qoraqalpog‘iston)ga bo'ysunuvchi tumanlar va shaharlar budjetlari, viloyatning budjeti va viloyatga bo'ysunuvchi tumanlarva shaharlar budj etlari, tumanlargabo' linadigan shaharning budj eti shahar budj eti va shahar tarkibiga kiruvchi tumanlar budj eti, tumanga bo'ysunuvchi shaharlari bo'lgan tumanning budjeti tuman budjeti va tumanga bo'ysunuvchi shaharlar budjetlarini o'z ichiga oladi."
        ]
    },
    {
        "word": "Budjet Xarajatlari",
        "type": [],
        "definition": [
            "YalMning qayta taqsimlanishi natijasida davlat budjetida jamlangan pul mablag'larining maqsadga muvofiq qayta taqsimlanishi va ishlatilishi bilan bog'liq budjet qonunchiligi bilan tartibga solinadigan pul munosabatlari yig'indisidir. "
        ]
    },
    {
        "word": "Budjet Xarajatlarini Amalga Oshirishni Toʻxtatish ",
        "type": [],
        "definition": [
            "- (blokirovka) budjet assignovaniyalariga nisbatan budjet majburiyatlari limitini qisqartirish yoki budjet mablag'lari bilan qabul qilingan pul majburiyatlarini tasdiqlashdan voz kechish. Bunda budj et tizimi to'g'risidagi qonunga muvofiqbudj et aj ratmalaribudj et mablag'larini bosh taqsimlovchisiga aniq shartlarni bajargandagina ajratiladi. Shuningdek, budjet mablag'larini noqonuniy ishlatish holatlari aniqlanganda, budjet xarajatlarini amalga oshirish to'xtatiladi. "
        ]
    },
    {
        "word": "Budjet Xarajatlarini Qoplashning Umumiyligi Prinsipi ",
        "type": [],
        "definition": [
            "- budjet barcha xarajatlarining shu budjet barcha daromadlari umumiy summasi va uning defitsitini moliyalashtirish manbalari hisobidan tushgan tushumlardan qoplanishi kerakligini anglatadi. "
        ]
    },
    {
        "word": "Budjetdan Mablagʻ Ajratish ",
        "type": [],
        "definition": [
            "qonun hujjatlarida nazarda tutilgan tartibda Davlat budjetidan budjet tashkilotlariga hamda boshqa budjet mablag'lari oluvchilariga ajratiladigan pul mablag'lari."
        ]
    },
    {
        "word": "Budjetdan Moliyalash ",
        "type": [],
        "definition": [
            "davlat korxonasi tomonidan o‘z faoliyatini kengaytirish uchun qo'shimcha ravishda oladigan mablag* lar manbayidir. Budjetdan moliyalash tartibidagi mablag‘lar davlat korxonalariga yangi mehnat vositalarini sotib olish yoki moddiy boyliklar zaxirasi, aylanma mablag'larning o'sishi va to'ldirilishini moliyalash hamda boshqa ehtiyojlarga, bolalar va madaniy-maorif muassasalarini saqlash^ ilmiy-tadqiqot ishlarini bajarish, kadrlar tayyorlash va boshqalar uchun beriladi."
        ]
    },
    {
        "word": "Budjetdan Moliyalashtirish ",
        "type": [],
        "definition": [
            "turli xil budjet pog'onalaridan mablag' lar olinishini anglatuvchi, moliyalashtirishning eng qulay usullaridan biri. "
        ]
    },
    {
        "word": "Budjetdan Tashqari (Nobudjet) Fond Lar ",
        "type": [],
        "definition": [
            " a) ijtimoiy: ijtimoiy sug'urta fondi; pensiya fondi; bandlik fondi; majburiy tibbiyot sug'urtasi fondi, b) noijtimoiy: yo‘l fondi; ekologiya va boshqa maqsadli fondlardan iborat bo'lib, ularning barchasi budjet tizimida konsolidatsiyalanadi. "
        ]
    },
    {
        "word": "Budjetdan Tashqari Fondlarning Afzalliklari ",
        "type": [],
        "definition": [
            "davlat budjetini yengillashtiradi, budjet xarajatlarining bir qismini o'z zimmasiga oladi va budjetni mablag' bilan ta’minlash muammosini ma’lum darajada hal qiladi va mablag'lardan maqsadli foydalanadi. "
        ]
    },
    {
        "word": "Budjetiy Rejalashtirish ",
        "type": [],
        "definition": [
            "turli darajalardagi budjetlar va nobudjet fondlarni tuzish va ijro etish jarayonida mamlakatning umummilliy ijtimoiy-iqtisodiyrivojlanish dasturi(ga) asosida (muvofiqravishda) moliya tizimining bo'g'inlari o'rtasida yalpi ijtimoiy mahsulot va milliy daromad qiymatining markazlashtirilgan tarzda taqsimlanishi va qayta taqsimlanishi. "
        ]
    },
    {
        "word": "Budjetiy Tartibga Solish ",
        "type": [],
        "definition": [
            "hududlarning ijtimoiy va iqtisodiy rivojlanishiga yo'naltiriladigan va hududiy budjetlarni minimal zaruriy darajadagi daromadlar bilan ta’minlash maqsadida mablag' larni qayta taqsimlash."
        ]
    },
    {
        "word": "Budjetlararo Munosabatlar ",
        "type": [],
        "definition": [
            "davlat hokimiyati organlari va mahalliy o'z-o'zini boshqarish organlari o'rtasida munosabatlar. "
        ]
    },
    {
        "word": "Budjetlararo Munosabatlar ",
        "type": [],
        "definition": [
            "nafaqat boshqaruvning turli darajalaridagi hokimiyat organlari o'rtasidagi munosabat, balki, eng awalo, mamlakatning ma’muriy-hududiy tuzilmalari subyektlari o'rtasida markaz orqali shakllangan va davlat hokimiyatiga uning aniq funksiyalarini hududiy darajada bajarish, jamiyat taraqqiyoti uchun normal sharoitlarni yaratish maqsadida berilgan barcha pul mablag'larining taqsimlanishi va qayta taqsimlanishi jarayonidagi munosabatlardir. "
        ]
    },
    {
        "word": "Budjetlarga Cheklovlar ",
        "type": [],
        "definition": [
            "(Qoraqalpog'iston Respublikasi va mahalliy budjetlarga) quyidagilardan iborat: l) Qoraqalpog'iston Respublikasi va mahalliy budjetlarning defitsitli bo'lishiga yo'l qo'yilmaydi; 2) Qoraqalpog'iston Respublikasi budjeti va mahalliy budjetlarni tasdiqlash va ijro etishda: a) qonun hujjatlarida nazarda tutilmagan manbalar hisobidan fondlar tashkil etishga; b) mablag' jalb qilishni amalga oshirishga (yuqori budjetlardan budjet ssudalari olish bundan mustasno); v) o'z budjetlari xarajatlariga tasdiqlangan budjetdan ajratiladigan ortiqcha mablag' sarflashga (qonunda nazarda tutilgan hollar bundan mustasno); g) budjet mablag'lari hisobidan boshqa shaxslar foydasiga moliyaviy kafolatlar va kafilliklar berishga; d) yuridik va jismoniy shaxslarga budjet ssudalari berishga yo'l qo'yilmaydi."
        ]
    },
    {
        "word": "Budjetlarning Balansliligi Prinsipi ",
        "type": [],
        "definition": [
            "budjetda ko'zda tutilgan xarajatlar hajmi budjet daromadlari va uning defitsitini moliyalashtirish manbalaridan tushadigan tushumlarning jami hajmiga teng bo'lishi kerakligini bildiradi. "
        ]
    },
    {
        "word": "Budjetlarning Mustaqilligi Prinsipi ",
        "type": [],
        "definition": [
            "qonunchilik va davlat hokimiyatining ijroiya organlari hamda mahalliy o'z-o'zini boshqarish organlarining mamlakat budjet tizimining tegishli darajalarida budjet jarayonini mustaqil amalga oshirish borasidagi huquqlarini bildiradi. "
        ]
    },
    {
        "word": "Budjetlashtirish",
        "type": [],
        "definition": [
            "subyekt va uning bo'linmalari faoliyatini boshqarish usuli. "
        ]
    },
    {
        "word": "Budjetli Ekspansiya Siyosati ",
        "type": [],
        "definition": [
            "jami talabning ortishiga qaratilgan siyosat. U daromadlar o'sishi yoki davlat daromadlarini pasaytirish orqali amalga oshiriladi. "
        ]
    },
    {
        "word": "Budjetni Tartiblash ",
        "type": [],
        "definition": [
            "budjetlar daromadlari va xarajatlarini balanslashtirish maqsadida daromadlarni taqsimlash jarayoni va turli darajadagi budjetlar o'rtasida mablag'larning qayta taqsimlanishi. "
        ]
    },
    {
        "word": "Budjetni Tartiblash Daromadlari ",
        "type": [],
        "definition": [
            "budjet darajasiga qarab ajratmalar miqdori belgilanadigan barcha turdagi soliqli daromadlar va boshqa to'lovlar. "
        ]
    },
    {
        "word": "Budjetning Haqqoniyligi Prinsipi ",
        "type": [],
        "definition": [
            "tegishli hudud ijtimoiyiqtisodiy rivojlanishi bashorat (prognoz) ko'rsatkichlarining ishonchli hamda budjet daromadlari va xarajatlari hisob- kitoblarining haqqoniy bo'lishi kerakligini taqozo etadi. "
        ]
    },
    {
        "word": "Budjetning Joriy Xarajatlari ",
        "type": [],
        "definition": [
            "budjet xarajatlarining bir qismi bo'lib, davlat hokimiyati organlari, mahalliy o'z-o'zini boshqarish organlari, budjet tashkilotlarining joriy faoliyatini ta’minlashga, davlat tomonidan quyi pog'onadagi budjetlar va iqtisodiyotning ayrim tarmoqlariga mablag' ajratish, dotatsiyalar, subvensiyalar va subsidiyalar shaklida yordam ko'rsatish uchun ajratiladi. "
        ]
    },
    {
        "word": "Budjetning Kapital Xarajatlari ",
        "type": [],
        "definition": [
            "budjet xarajatlarining innovatsiya va investitsiya faoliyatini taminlaydigan qismi. Unga tasdiqlangan investitsiya dasturiga muvofiq ishlab turgan yoki yangidan tashkil qilinadigan korxonalar, tashkilotlar va muassasalarga investitsiyalar uchun mo‘ljaIlangan xarajatlar kiradi. "
        ]
    },
    {
        "word": "Budjetning Kassali Xarajatlari ",
        "type": [],
        "definition": [
            "davlat budjeti mablag'lari hisobidan korxona, tashkilot va muassasalarga bank orqali berilgan | yoki budjetda ko'zda tutilgan xarajatlarga ularning to'lov qog'ozlari  asosida o'tkazilgan pul mablag‘Iarining summasi. "
        ]
    },
    {
        "word": "Budjetning Soliqli Daromadlari ",
        "type": [],
        "definition": [
            "tarkibi mamlakat soliq qonunchiligiga muvofiq umumdavlat soliqlari vayig'imlari, mahalliy soliqlar va yig'imlar, bojxona bojlari, boj yig'imlari va boshqa boj to'lovlari, davlat boji, penya va jarimalardan iborat. "
        ]
    },
    {
        "word": "Budjetnoma",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasi Moliya vazirligining boshqa vazirliklar, davlat qo'mitalari, idoralar va boshqa tashkilotlar bilan hamkorlikda ishlab chiqadigan hamda quyidagilarni o'z ichiga oluvchi loyihaviy hujjat: l) mamlakatni ijtimoiy-iqtisodiy rivojlantirishning o'tgan yilgi asosiy yakunlari va mamlakatni ijtimoiy-iqtisodiy rivojlantirish joriy yilgi yakunlarining prognoz (bashoratli) bahosi; 2) o'tgan yilgi Davlat budjeti ijrosi to'g'risidagi hisobot va joriy yilgi Davlat budjetining kutilayotgan ijrosi bahosi; 3) kelgusi yilga mo'ljallangan Davlat budjeti loyihasini tuzishda asos bo'lgan kelgusi yil uchun asosiy makroiqtisodiy ko'rsatkichlar; 4) mamlakat budjet va soliq siyosatining kelgusi yilgi asosiy yo'nalishlari loyihasi; 5) mamlakat budjet va soliq siyosatining kelgusi yilgi asosiy yo'nalishlariga sharhlar; 6) davlatning tashqi va ichki qarzlari hamda ular bo'yicha xarajatlar holati to'g'risidagi ma’lumotlar; 7) kelgusi moliya yiliga mo'ljallangan Davlat budjeti loyihasi. O'zbekiston Respublikasi Moliya vazirligi yuqoridagilarni o'z ichiga oluvchi budjetnoma loyihasini har yilning birinchi oktabriga qadar O'zbekiston Respublikasi Vazirlar Mahkamasiga taqdim etishi lozim. Shuningdek, budjetnoma O'zbekiston Respublikasi Moliya vazirligi tomonidan joriy yilning birinchi noyabridan kechiktirilmasdan O'zbekiston Respublikasi Oliy Majlisiga taqdim etilishi kerak. "
        ]
    },
    {
        "word": "Burch",
        "type": [],
        "definition": [
            "muayyan axloqiy majburiyatlarni his qilish, uning zarurligini anglash. "
        ]
    },
    {
        "word": "Buromadlar (Xarajatlar) ",
        "type": [],
        "definition": [
            " tovar sotib oluvchilar yoki pullikxizmatdan foydalanuvchilar sotuvchilarga yoki xaridorlarning xohishi bilan boshqa institutsion birliklarga tovar yoki ko'rsatilgan xizmat egasiga to'lanadigan haq yig'indisi. "
        ]
    },
    {
        "word": "Buxgalter",
        "type": [],
        "definition": [
            "buxgalteriya qonun qoidalariga rioya qilgan holda savdo va hisobga olish daftarlarini yurituvchi shaxs."
        ]
    },
    {
        "word": "Buxgalteriya Balansi ",
        "type": [],
        "definition": [
            "korxona faoliyatining pul hisobidagi ko rsatkichlar tizimi. Hisobot sanasida mablag'laming sarflanishi, manbayi va maqsadini ta’riflovchi, jamlovchi jadvalda aks ettiriladi. Ikki qismdan iborat: chap tomoni aktiv, o‘ng tomoni passiv. Aktiv va passiv natijalari bir xil bo'lishi shart. "
        ]
    },
    {
        "word": "Buxgalteriya Daftarlari ",
        "type": [],
        "definition": [
            "sintetik va analitik hisobni hujjatlarga asosan qayd qilish. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi ",
        "type": [],
        "definition": [
            "korxonaning xo'jalik yuritish hujjatlari asosida yoppasiga, uzluksiz va o'zaro bog'liq holda xo'jalik faoliyatini qiymat ifodasida aks ettirishdir. Buxgalterlik hisobining predmeti korxonaning pul shaklida ifodalangan xo'jalik mablag'lari, ularning tashkil topish manbalari va xo'jalik jarayonlari hisoblanadi. Buxgalteriya hisobi xo'jalik faoliyatini tahlil qilish, boshqarish va nazorat qilish vazifalarini amalga oshiradi. Quyidagilar buxgalteriya hisobi elementlari hisoblanadi: hujjatlar - xo'jalik operatsiyasi tugaganligi haqida yozma ma’lumot (guvoh)nomalar; inventarizatsiya mavjud moddiy qiymatlarni tekshirish (asosiy vositalar; pul mablag'lari; aylanma (oborot) vositalar). Bular ularning aslidagi mavjud holati va buxgalteriya hisobiga to'g'ri kelishini aniqlash maqsadida qilinadi; kalkulyatsiya (rejali va aslidagi); buxgalteriya hisobi schyotlari; ikkiyoqlama yozuv; balans. Bu elementlarning har biridan foydalanish amaldagi qonunlarga muvofiq amalga oshiriladi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi Hujjatlari ",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyekt tomonidan buxgalteriya hisobini o'tkazish jarayonida ma’lum talablariga rioya qilingan holda tuziladigan ma’lumotlarning moddiy ko'rinishidagi yig'indisi bo'lib, o'z tarkibiga quyidagilarni oladi: a) dastlabki hisob hujjatlari; b) erkin hisob hujjatlari; v) buxgalteriya hisobi registri (ro'yxati); g) ichki buxgalteriya oboroti ma’lumotlari. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi Registrlari ",
        "type": [],
        "definition": [
            "buxgalteriya hisobi registrlari ikkiyoqlama yozuv qoidalariga muvofiq yuritiladigan jurnallar, qaydnomalar, daftarlar, tasdiqlangan blankalar (shakllar)dir. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi Va Auditda Maʼlumotlarni Kompyuterda Qayta Ishlash",
        "type": [],
        "definition": [
            "iqtisodiy subyekt hisob ma’lumotlarini qayta ishlab, buxgalteriya hisobotini tuzishda EHMdan foydalanish. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi Va Hisobotidagi Xatolik ",
        "type": [],
        "definition": [
            "hisob yozuvlaridagi arifmetik yoki mantiqiy xatoliklar hisob ma’lumotlariga e’tiborsizlik yoki xo'jalik faoliyati faktlari, mulkning holati va mavjudligini majburiyatlar hamda hisoblash ishlarini noto'g'ri tasawur etish orqali hisob va hisobot ma’lumotlarining ko'zda tutilmagan holatdagi buzilishi."
        ]
    },
    {
        "word": "Buxgalteriya Hisobidagi Tovlamachilik ",
        "type": [],
        "definition": [
            "buxgalteriya hisobotining buzib ko'rsatilishiga qaratilgan ongli ravishdagi harakat yoki harakatsizlik. Agar iqtisodiy subyektning mansabdor shaxslari g'arazli maqsadlarda aldov uyushtirsalar yoki buxgalteriya hisobotidan foydalanuvchilar ishonchini suyiiste’mol qilsalar, lekin ularning ayblari sud tomonidan isbotlanmagan holatida auditor ularni topgan taqdirda u buxgalteriya hisobotining ongli ravishda buzilganligi mavjudligini ko'rsatishi lozim. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobining Asosiy Maqsadi ",
        "type": [],
        "definition": [
            "to'liq va ishonarli axborotlarni shakllantirish, ichki va tashqi foydalanuvchilarni u bilan ta’minlash, shuningdek, boshqaruv va moliyaviy qarorlar qabul qilish axborotlardan foydalanish"
        ]
    },
    {
        "word": "Buxgalteriya Hisobining Funksiyalari ",
        "type": [],
        "definition": [
            "buxgalteriya hisobida rejalashtirish, tashkil qilish, tartibga solish bilan birga boshqaruv tizimida axborot, nazorat, mulklarning butligini ta’minlash, tahliliy va hisob funksiyalarini ham amalga oshiradi. "
        ]
    },
    {
        "word": "Buxgalteriya His Obining Metodi ",
        "type": [],
        "definition": [
            " korxona mablag' larining holati va foydalanishini o'rganish uchun buxgalteriya hisobi qo'llaniladigan usullar yig'indisi buxgalteriya hisobining metodini tashkil qiladi. Buxgalteriya hisobining metodi (usullari) quyidagilardan iborat: hujjatlashtirish, inventarizatsiya, baholash, kalkulyatsiya, buxgalteriya hisobining schyotlari, ikkiyoqlama yozuv, buxgalteriya balansi va buxgalteriya hisoboti. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobining Obyektlari ",
        "type": [],
        "definition": [
            "muayyan korxona ega bo'lgan moddiy va pul mablag'lari, uning boshqa tashkilotlar va muassasalar bilan bo'lgan yuridik munosabatlari, shuningdek, mablag'lar hamda munosabatlarni o'zgartiradigan xo'jalik operatsiyalari tushuniladi. Korxonaning moddiy va pul qiymatliklari o'z faoliyatini amalga oshirish uchun foydalaniladigan mablag'larini ifodalaydi.Xo'jalikmuomalalari esa ishlab chiqarishningmazmunini ifodalovchi jarayonlarni tashkil qiladi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi Shakllari ",
        "type": [],
        "definition": [
            "yozuvlarning ma’lum texnikvositalaridan foydalanib, hisobni tashkil qilishdir. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi Usuli",
        "type": [],
        "definition": [
            "buxgalteriya hisobi obyektlarini xo'jalik faoliyatini boshqarish orqali amalga oshirish maqsadida yoppasiga, uzluksiz, o'zaro bog'langan va obyektiv aks ettirishni ta’minlaydigan usullar tizimidan iborat. "
        ]
    },
    {
        "word": "Buxgalteriya Hisoboti ",
        "type": [],
        "definition": [
            "hisobot davri natijalarining buxgalteriya hisobi ma’lumotlari asosida tuziladigan va hisobot sanasida belgilangan shaklda to'ldiriladigan, xo'jalik subyektining mulkiy va moliyaviy holati hamda uning xo'jalik faoliyati natijalarini o'ziga aks ettirgan ko'rsatkichlaming yagona tizimidir."
        ]
    },
    {
        "word": "Buxgalteriya Hisoboti Tuziladigan Sana ",
        "type": [],
        "definition": [
            "odatda, bu hisobot davrining oxirgi kalendar kuni hisoblanadi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotidagi Xato-Kamchiliklar Aniqlanganda Auditorning Harakati ",
        "type": [],
        "definition": [
            "buxgalteriya hisobotining buzilishi mavjud bo'lgan yoki yo'qligi haqida asosli fikrni shakllantirish uchun auditor tomonidan amalga oshiriladigan harakatlar. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotiga Taʼsir Qiladigan Dalillar Va Hodisalarning Aniqlanishi ",
        "type": [],
        "definition": [
            "iqtisodiy subyekt tomonidan auditorga boshida taqdim etilgan buxgalteriya hisobi va hisoboti hujjatlarida aks ettirilgan, lekin buxgalteriya hisoboti ko'rsatkichlariga sezilarli darajada tasir korsatadigan operatsiyalar, harakatlar, o'zgarishlar mavjudligi dalillari va hodisalari hujjatli qaydlarining mavjudligi aniqlanishi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotini Tayyorlash Davri ",
        "type": [],
        "definition": [
            "iqtisodiy subyektning hisobot davri uchun buxgalteriya hisobotini tuzish bo'yicha ishlarning tugatilish sanasi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Asos Koʻrsatkichi ",
        "type": [],
        "definition": [
            "xo'jalik subyekti buxgalteriya hisobotini baholash uchun muhim rol o'ynaydigan va auditor tomonidan ahamiyatlilik darajasini hisoblashda qo'llaniladigan ushbu hisobotning sonli ko'rsatkichlaridan biridir. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Boshlangich Koʻrsatkichlari",
        "type": [],
        "definition": [
            "auditor tomonidan tekshiriladigan hisobot davri boshiga mos keladigan buxgalteriya hisoboti ko'rsatkichlari. "
        ]
    },
    {
        "word": "Buxgalteriya Hisoboti Foydalanuvchisi",
        "type": [],
        "definition": [
            "xo'jalik subyekti haqida ma’lumotga ega bo'lishga manfaatdor bo'lgan yuridik yoki jismoniy shaxs. Buxgalteriya hisobotining ichki foydalanuvchilari iqtisodiy subyekt rahbarlari, tasischilari, mulk egalari va qatnashchilarini o‘z ichiga oladi. Buxgalteriya hisobotining tashqi foydalanuvchilari iqtisodiy subyektning investor!ari, kreditorlari hamda manfaatdor bo'lgan davlat organlarini o'z ichiga oladi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Ishonchliligi",
        "type": [],
        "definition": [
            "buxgalteriya hisoboti ma’lumotlarining aniqlik darajasi va uning yordamida foydalanuvchi xo'jalik yurituvchi subyekt faoliyatining natijalari to'g'risida to'g'ri xulosalar qabul qilinadi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Jiddiy Ravishda Buzib Koʻrsatilishi ",
        "type": [],
        "definition": [
            "buxgalteriya hisobotining ishonchligiga sezilarli darajada ta’sir ko'rsatuvchi jiddiy xarakterdagi buxgalteriya hisobotining buzilishi."
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Solishtirma Koʻrsat Kichlari ",
        "type": [],
        "definition": [
            "joriy hisobot davri mos ko'rsatkichlari bilan solishtirish uchun iqtisodiy subyektning audit qilinishi lozim bo'Igan buxgalteriya hisobotiga kiritilgan oldingi hisobot davri buxgalteriya hisoboti ko'rsatkichlari. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Taqdim Etish Sanasi ",
        "type": [],
        "definition": [
            "iqtisodiy subyektning buxgalteriya hisobotini uning mulkdoriga taqdim etish kuni va aloqa tashkilotining shtempelinida belgilangan jo'natish sanasi. Mulkdorlarga taqdim etish deganda, quyidagi 4 sanalardan ilgarirog'i tushuniladi; a) buxgalteriya hisobotini ta’sischilarga, ishtirokchilarga, ta’sis hujjatlariga binoan yuritish ishtirokchilariga taqdim etish sanasi; b) iqtisodiy subyektni ro'yxatdan o'tkazish joyidagi hududiy statistika organlariga buxgalteriya hisobotini taqdim etish sanasi; v) buxgalteriya hisobotining qonunchilikka binoan boshqa manzilga taqdim etish sanasi; g) buxgalteriya hisobotining e’lon qilinish sanasi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Taqdim Qilinishi ",
        "type": [],
        "definition": [
            "iqtisodiy subyekt buxgalteriya hisobotining uning foydalanuvchilariga topshirilishi yoki ushbu hisobotning qonunda ko'rsatilgan tarkibda e’lon qilinishi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Tarkibiga Kirmaydigan Maʼlumotlar ",
        "type": [],
        "definition": [
            "audit nazorati o'tkazilayotgan iqtisodiy subyekt holatini ifodalovchi ma’Iumotlar. Bu ma’lumotlar ba’zi analitik protseduralar o'tkazilganda qo'llaniladi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobotining Yakuniy Koʻrsatkichlari ",
        "type": [],
        "definition": [
            "auditor tomonidan tekshirilayotgan hisobot davri oxiriga yoki auditor tekshiriyotgan oldingi hisobot davri oxiriga mos keluvchi buxgalteriya hisoboti ko'rsatkichlari. "
        ]
    },
    {
        "word": "Buxgalteriya Oʻtkazuvi ",
        "type": [],
        "definition": [
            "schyotlar korrespondensiyasini yozish. Bunda xo'jalik jarayoniga tegishli summa bir schyotning debeti va ikkinchi schyotning kreditida aks ettiriladi. Buxgalteriya o'tkazmasi hujjatlarga asosan tuziladi "
        ]
    },
    {
        "word": "Buxgalteriya Yozuvi ",
        "type": [],
        "definition": [
            "xo'jalik jarayonida sodir bo'Igan operatsiya (voqea, hodisa)ni hujjatlarda qayd etish. "
        ]
    },
    {
        "word": "Buxgalter",
        "type": [],
        "definition": [
            "buxgalteriya hisobi bo'yicha mutaxassis. “Buxgalter” atamasi XIII asrda paydo bo'lgan. Bu Iavozimni birinchi bo'lib Insburk schyotlar palatasining ish yurituvchisi Xristofor Shtexer olgan. Bu borada imperator Maksimilianning 1498-yil 13-fevralda chiqargan buyrug'i Vena davlat muzeyida saqlanmoqda. Nafaqat Germaniya, balki Amir T emur davrida ham hisob daftarlarini yurituvchi shaxslar - yozuvchilar (kotiblar) bo'lgan. Saltanatning har bir idorasida, - deb yozadi Amir Temur XIII asrning oxirida, - bo'ladigan kirim chiqimlarni, kundalik xarajatlarni yozib borish uchun bir kotib tayinlansin”. 1498-yildan boshlab “buxgalter”, “buxgalteriya” atamalari eski nomlarini asta-sekin siqib chiqarib, hamma joyga tarqala boshladi. Bu terminlar Rossiyada 1732-yildan qo'llana boshladi. 1732-yil 11-sentabrdaKommerts-Kollegiyaningbuyrug‘i bilan Peterburg bojxonasida birinchi buxgalter etib gollandiyalik savdogar Timmerman tayinlangan. Hozirgi vaqtda buxgalter ma’lum huquq, burch va majburiyatlarga ega bo'lgan xizmatchi hisoblanadi. Bajarayotgan ishlari va egallagan lavozimiga qarab katta buxgalter va bosh buxgalter bo'lishi mumkin. Katta buxgalter - buxgalteriyaning bo'limi (guruh)ni boshqaradi. Bosh buxgalter buxgalteriyani boshqaradi. Hozirgi vaqtda buxgalterdan nafaqat buxgalteriya hisobi, balki ishlab chiqarishning biznes-rejalarini tuzish, moliyaviy va boshqaruv tahlillari, shuningdek, boshqa sohalarni chuqur bilish hamda rahbariyat togri boshqaruvqarorlarini qabul qilishidafaol qatnashish talab qilinadi. O'zbekistonda hozirgi zamon talablariga to'liq javob beradigan buxgalterlar tayyorlashga katta e’tibor berilmoqda, buxgalterlar oliy o'quv yurtlarida, ko'plab tashkil etilgan kollej va akademik litseylarda tayyorlanmoqda."
        ]
    },
    {
        "word": "Buxgalteriya ",
        "type": [],
        "definition": [
            " buxgalteriya hisobini tashkil etadigan va yuritadigan hisob apparati. Buxgalteriya korxonaning mustaqil tarkibiy bo'limi bo'lib, boshqa bo'limlar (xizmatlar) tarkibiga kirmaydi. Buxgalteriyani bosh buxgalter boshqaradi, agar shtatda bosh buxgalter lavozimi bo'lmasa, katta buxgalter boshqaradi. Bosh buxgalter qanday huquq va majburiyatlarga ega bo'lsa, katta buxgalter ham shunday huquq va majburiyatlarga ega. Buxgalteriya hisobini tashkil etish, yuritish va buxgalterning huquq va burchlari 1996-yil 30-avgustda qabul qilingan “Buxgalteriya hisobi to'g'risida’gi Qonun bilan belgilangan. "
        ]
    },
    {
        "word": "Buxgalteriya Arxtvi ",
        "type": [],
        "definition": [
            " o'tgan hisobot davrlari bo'yicha hujjatlar va hisob registrlari yig'indisi. Buxgalteriya arxivi yo'riqnoma va buxgalteriya hisobi shakllariga binoan tashkil etiladi. Buxgalteriya hujjatlari va registrlar, mikrofilmlar yoki kompyuter hisobi moliyaviy ma’lumotlari uch yil, moliyaviy hisobot esa qonun hujjatlarida belgilangan muddatda saqlanadi. "
        ]
    },
    {
        "word": "Buxgalteriya Balansi ",
        "type": [],
        "definition": [
            " xo'jalik mablag'lari, ularning tarkibi, joylashgan joylari va ularning vujudga kelish manbalarini ma'lum bir sanaga pulda ifodalab turadigan jadval. Balans ikki tomonlama jadval bo'lib, uning chap tomoni aktiv, o'ng tomoni passiv deb nomlanadi. Aktivda: 1-bo'lim. Uzoq muddatli aktivlar. 2-bo'lim. Joriy aktivlar. Passivda: 1-bo'lim. O'z mablag'larining manbalari. 2-bo'lim. Majburiyatlar. Balansning aktiv tomonining jami uning passiv tomonining jamiga teng bo'lishi kerak."
        ]
    },
    {
        "word": "Buxgalteriya Balansi Moddalarini Baholash ",
        "type": [],
        "definition": [
            "balansda aks ettiriladiganxo‘jalikmablag‘larivaularningvujudgakelishmanbalari alohida turlarining puldagi ifodasi. Balans moddalarini baholash prinsipi barcha korxonalr uchun bir xil. Baholash asosida ishlab chiqarish vositalarini sotib olish yoki mahsulot ishlab chiqarishning . haqiqiy tannarxi yotadi. Buxgalteriya balansi moddalarining * bahosi real bo'lishi, ya’ni mablag'lar va ularning vujudga kelish manbalari turlarining haqiqiy kattaligini aks ettirish kerak. Aktiv va passiv moddalarini baholashning haqiqiyligi buxgalteriya hisobi ma’lumotlari ishonchliligi bilan ta’minlanadi. "
        ]
    },
    {
        "word": "Buxgalteriya В Alans Inin G Moddalari ",
        "type": [],
        "definition": [
            " xo'jalik mablag'larining alohida turlari yoki ularning tashkil bo'lish manbalarini ta’riflovchi balansning aktiv va passiv ko'rsatkichlari. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi ",
        "type": [],
        "definition": [
            "ayrim subyektlarda sodir bo'layotgan xo'jalik mablag'lari va jarayonlarining harakatini ma’lum hujjatlar bilan asoslangan holda ro'yxatga olish va pulda baholab umumlashtirilgan tarzda yoppasiga va bevosita kuzatish tizimi. Buxgalteriya hisobi har qanday tizimda ham quyidagi uchta funksiyani bajaradi: l) axborot berish; 2) nazorat qilish; 3) boshqaruv yechimlarini ishlab chiqish. Bunda buxgalteriya hisobida har xil usullar, texnika va shakllardan foydalanish mumkin. Shu bilan birga, buxgalteriya hisobi har xil ijtimoiy tizimlarda muayyan maqsadlarga qarab turli vazifalarni bajarishi mumkin. Hozirgi vaqtda talabalar “Buxgalteriya hisobi” kursini ikkiga bo'lib o'rganmoqda: moliyaviy hisob va boshqaruv hisobi. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi Tizimi ",
        "type": [],
        "definition": [
            "buxgalteriya hisobi schyotlarida xo'jalik muomalalarini yozish tizimi. Bu yozuvlar tartibiga qarab ikki xil bo'lishi mumkin: oddiy va ikkiyoqlama. "
        ]
    },
    {
        "word": "Buxgalteriya Hisobi Va Hisobotini Tartibga Solish ",
        "type": [],
        "definition": [
            "buxgalteriya hisobini to'g'ri tashkil etish, uning aniqligi va yagonaligini ta’minlaydigan asosiy shartlardan biri. Buxgalteriya hisobi va hisobotini tartibga solish, buxgalteriya hisobi standartlarini ishlab chiqish va tasdiqlash O'zbekiston Respublikasi Moliya vazirligi zimmasiga yuklatilgan. Buxgalteriya hisobi va hisobotini tartibga solish hisobning yagona metodologiyasi, turli korxonalarda bir xil xo'jalik muomalalarini aks ettirishning yagona usullari, xo'jalik mablag'larini yagona baholash, dastlabki hujjatlar, hisob registrlari va hisobotning yagona shakllarini qo'llashni ta’minlaydi. Bu, o'z navbatida, buxgalteriya hisobini samarali tashkil etish, kam mehnat sarflab, korxona faoliyati to'g'risida real ko'rsatkichlar olishni ta’minlaydi. O'zbekiston Respublikasi Moliya vazirligi tomonidan ishlab chiqiladigan umumdavlat hisob siyosati asosida har bir tarmoq bo'yicha hisob siyosati ishlab chiqiladi."
        ]
    },
    {
        "word": "Buxgalteriya Hujjati ",
        "type": [],
        "definition": [
            "xo'jalik muomalalari sodir bo'lganligining yozma isboti yoki xo'jalik muomalalarini amalga oshirish huquqi. Buxgalteriya hujjatlari, odatda, belgilangan shakl bo'yicha tipografiya usulida bosilgan blankalarda tuziladi. Ayrim hollarda muayyan xo'jalik muomalalarini hujjatlar bilan rasmiylashtirish uchun tasdiqlangan shakl bo'lmasa, istalgan shaklda tuzishga yo'l qo'yiladi, lekin hujjatlar qo'yilgan talablar inobatga olinishi kerak. Hisob ishlari avtomatlashtirilgan hollarda xo'jalik muomalalarida avtomatik ravishda aks ettiriladi. Yig'ilgan axborotlar yozma (qog'oz) hujjatlar o'mini bosadi. Xo'jalik muomalalarini hujjatlar bilan rasmiylashtirishga hujjatlashtirish deyiladi. Buxgalteriya hisobi va hisoboti ma’lumotlarining haqiqiyligi va ro'y-rostligi hujjatlashtirishning sifatiga bog'liq, chunki hisobdagi yozuvlar hujjatlarga asoslanadi. Hujjatlarni tuzish dastlabki hisobning tarkibiy qismi hisoblanadi. Hujjatlarni soddalashtirish va tuzish, ishlov berish hamda ulardan foydalanishni asoslantirish uchun unifikatsiyalanadi va standartlashtiriladi. Hujjatlar tuzilgandan so'ng saqlash uchun arxivga topshirilgunga qadar ma’lum yo'lni bosib o'tadi, hisob jarayonining turli bosqichlarida foydalaniladi, ya’ni hujjat aylanishi sodir bo'ladi. "
        ]
    },
    {
        "word": "Buxgalteriya Provodkasi (Yozuvi) ",
        "type": [],
        "definition": [
            "schyotlar aloqasi (korrespondensiyasi)ni rasmiylashtirish. Bunda debetlanuvchi va kreditlanuvchi schyotlar hamda yozib qo'yiladigan xo'jalik muomalasining summasi ko'rsatiladi. Buxgalteriya prokodkalari (yozuvi) oddiy va murakkab bo'ladi. Oddiy prokodkada xo'jalik muomalalarining mazmuniga qarab bir schyot debetlanib, ikkinchi schyot kreditlanadi. Murakkab prokodkalarda xo'jalik muomalalarining mazmuniga qarab bir schyot debetlanib, bir necha schyot kreditlanadi yoki, aksincha, umumiy summaga bir necha schyotlar debetlanib, bir schyot kreditlanadi. Har qanday prokodkada ham bir schyotning debetiga yozilgan summa ikkinchi schyotningkreditigayozilgan summaga teng bo'lishi kerak. Bu qoida murakkab provodkaga ham tegishli. Buxgalteriya provodkasida ikkiyoqlama yozuv o'z aksini topadi. Qo'shimcha va manfiy (storno) buxgalteriya provodkalari bo'lishi mumkin"
        ]
    },
    {
        "word": "Buyruqbozliktizimi",
        "type": [],
        "definition": [
            " iqtisodiy tizimning bir turi, uning asosiy belgilari: iqtisodiyotning monopollashtirilganligi; jamiyat xo'jalik hayotining hamma tarafini markazlashtirilgan holda rejalashtirish va tartiblash. Uning xo'jalik mexanizmiga xos belgilari mavjud, bular: bitta markazdan turib, hamma korxonalami bevosita boshqarish; davlatning mahsulotni ishlab chiqarish va taqsimlashini to'liq nazorat qilishi; ishlab chiqarish strukturasi va hajmini hukmron mafkuraviy aqidalardan kelib chiqqan holda belgilash. Buyruqbozlik iqtisodiy tizimi sobiq Sovet Ittifoqi, XXR, Shimoliy Vetnam, Shimoliy Koreya, Kuba va ayrim Sharqiy Yevropa mamlakatlarida mavjud bo'Igan. "
        ]
    },
    {
        "word": "Buyukdepressiya",
        "type": [],
        "definition": [
            " 1929-1933-yy. vahatto 1940-yilgachaAQSHda bo'Igan va jahondagi yirik iqtisodiy inqiroz, ishlab chiqarish 50% kamaygan, ishsizlik25% oshgan (17 mln.)."
        ]
    },
    {
        "word": "Buyurtma ",
        "type": [],
        "definition": [
            " xaridor (buyurtmachi)ning sotuvchiga jo'natadigan hujjati bo'lib, unda molni xarid qilishga qat’iy qaror qilinganligi ifodalanadi. "
        ]
    },
    {
        "word": "Buyurtma Boʻyicha Ishlab Chiqarish ",
        "type": [],
        "definition": [
            " faqatgina taktik buyrtma kelib tushgandan so‘ng ishga tushadigan jarayon. "
        ]
    },
    {
        "word": "Buyurtma Gʻolibi ",
        "type": [],
        "definition": [
            "ma’lum bir mahsulot, uni boshqa korxona mahsulotlaridan ajratib turadigan xossa va xarakteristikali mahsulotdir. "
        ]
    },
    {
        "word": "Buyurtma Kvalifikatori ",
        "type": [],
        "definition": [
            " ma’lum bir mahsulotning shunday tavsiflari to‘plamiki, bular ushbu mahsulotning sotib olinishiga sabab bo'la oladi. "
        ]
    },
    {
        "word": "Buyurtma Nuqtasi ",
        "type": [],
        "definition": [
            "tovar moddiy zaxira keyingi guruhiga buyurtma berishni aniqlashga yordam beradigan ombordagi mavjud va buyurtma berilgan tovar moddiy zaxira summasining past nuqtasi. "
        ]
    },
    {
        "word": "Buyurtmachilar",
        "type": [],
        "definition": [
            " investorlar tomonidan investitsion loyihalarni amalga oshirish uchun vakil etilgan yuridik va jismoniy shaxslar. "
        ]
    },
    {
        "word": "Byurokrat",
        "type": [],
        "definition": [
            " 1. Hokimiyatchilikvakolatlariga ega bo'Igan amaldorlar toifasiga kiruvchi shaxs. 2. O'z vazifalarini ko'r-ko'rona, ishga zarar keltirib bajaradigan amaldor shaxs, rasmiyatchi sansalorchi. "
        ]
    },
    {
        "word": "Byurokratiya",
        "type": [],
        "definition": [
            "tashkilot turi bo'lib, unga mehnatni ixtisoslashtirilgan tarzda taqsimlash, aniq ierarxiya, standartlar, xodimning bevosita vazifasiga asoslangan ishning baholanish ko'rsatkichlari kiradi. "
        ]
    },
    {
        "word": "Bozormunosabati",
        "type": [],
        "definition": [
            "bozordagi talab va takliflarning miqdoran va tarkibiy jihatdan bir-biriga muvofiq kelishi. Agar shunday muvofiqlik bo'lmasa, bozor muvozanati izdan chiqadi. "
        ]
    },
    {
        "word": "Bozor Narxi ",
        "type": [],
        "definition": [
            "iqtisodiyotda jami talablarga ko'ra o'zgarmas holda qoluvchi narxlar."
        ]
    },
    {
        "word": "Bulutli Texnologiya",
        "type": [],
        "definition": [
            "(yoki bulutli hisoblash, cloud computing) – kompyuter resurslari yordamida raqamli ma’lumotlarni taqsimlangan qayta ishlash texnologiyasi, internet foydalanuvchisiga onlayn xizmat sifatida taqdim etiladi. "
        ]
    }
]