[
    {
        "word": "Chakana Baholar",
        "type": [],
        "definition": [
            "o'zining ko'p darajaliligi bilan ajralib turadigan baholar tizimi. Unga davlat savdosi, dehqon bozori, tijorat savdosi, vositachilik bozori baholari kiradi. Aholining real daromadlari chakana baholar darajasiga bog'liqdir. Chakana baholar bilan asosan aholiga iste’mol buyumlari va xizmatlari sotiladi. "
        ]
    },
    {
        "word": "Chakana Narx ",
        "type": [],
        "definition": [
            "tovarning xaridorga sotilayotgandagi narx. U ulgurji narxga chakana savdo firmasining barcha boshqaruv, marketing va ishlab chiqarish xarajatlarini hamda daromadini qo'shish orqali aniqlanadi. "
        ]
    },
    {
        "word": "Chakana Reklama",
        "type": [],
        "definition": [
            "iste’molchilarga ma’lum xizmat yoki tovarni qachon va qayerda sotib olish mumkinligi to'g'risidagi mazkur xabar."
        ]
    },
    {
        "word": "Chakana Savdo ",
        "type": [],
        "definition": [
            "- iste’molchilaming pul daromadlariga ayirboshlash yo'li bilan tovar sotish va xizmat ko'rsatishdagi oxirgi bo'g'in. "
        ]
    },
    {
        "word": "Charter - ",
        "type": [],
        "definition": [
            "1 . Kema yoki boshqa transport vositasi bo'yicha belgilangan muddat va reys bo'yicha tuzilgan fraxt shartnomasi. 2. Moliya kredit faoliyati bilan shug'ullanish huquqi berilgan hujjat."
        ]
    },
    {
        "word": "Chatishgan Usullar ",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarning bir qancha turlari mavjud bo'lib, ular zayom va egalik huquqlari usullarining xususiyatlarini birlashtiradi. Ular imtiyozli aksiyalar va konvertrlanadigan (almashadigan) obligatsiyalar."
        ]
    },
    {
        "word": "Chayanov Aleksandr Vasilevich ",
        "type": [],
        "definition": [
            "(1888-1937) - taniqli iqtisodchi, Rossiyadatashkiliyishlabchiqarishmaktabiningasoschisi, dehqonni mehnat xo'jaligining asosi deb, oilaviy mehnat yacheykasini tashkil etgan (kollektivizatsiyaga qarshi); kooperatsiya va agrar sohalarda 200 ga yaqin asar yozgan, bosh asari “Xo'jalikning nokapitalistik sistemalari nazariyasi”dir. Chayanov 1937 yilda repressiya qilinib, qatl etilgan. Ilmiy g'oyalari hozirda ham ilmiy-amaliy ahamiyat kasb etadi. "
        ]
    },
    {
        "word": "Chegaradagi Xarajatlar (Daromadlar) ",
        "type": [],
        "definition": [
            " qo'shimcha ishlab chiqarilgan mahsulotning birligiga to'g'ri keladigan qo'shimcha xarajatlar (daromadlar). "
        ]
    },
    {
        "word": "Chegaravty (Oʻlik) Nuqta ",
        "type": [],
        "definition": [
            "subyektning sarflagan xarajatlarini mahsulotni sotgandan olgan daromadi hisobidan qoplash uchun zarur bo'lgan sotish hajmi."
        ]
    },
    {
        "word": "Chegirib Tashlanadigan Qoʻshilgan Qiymat Soligʻi (Qqs) ",
        "type": [],
        "definition": [
            "Bu oraliq iste’moli, asosiy kapitalni yalpi jamg'arish yoki qayta sotish uchun mo'ljallangan hamda tovar va xizmatlar sotib olish uchun to‘ lanadigan qo'shilgan qiymat solig'idir. Bu soliqni ishlab chiqaruvchi davlatga to'lamaslik huquqiga ega, chunki u ishlab chiqaruvchining mijozi tomonidan hisobga olingan."
        ]
    },
    {
        "word": "Chegirilmaydigan Qoʻshilgan Qiymat Soligʻi ",
        "type": [],
        "definition": [
            "sotib oluvchi tomonidan to'lanadi va bunday hoi ro'y berganda uning QQS to'lash majburiyatidan chegirib tashlanmaydi. "
        ]
    },
    {
        "word": "Chek ",
        "type": [],
        "definition": [
            "belgilangan ko'rinishdagi pul hujjati, l) bankdagi o'z hisobidan muayyan pul miqdorini chekda ko'rsatilgan shaxsga berish yoki uning hisobiga pul o'tkazish bo'yicha yozma topshiriq. Chek ikki ko'rinishda bo'ladi: a) oluvchining nomi yozilgan chek; b) ko'rsatuvchiga berilgan chek. Chekning harakat muddati 10 kundan oshmasligi kerak. Rivojlangan bank tizimida chek muomalada kredit vositasi siyosatida ishlatiladi. Chek to'lovlari rivojlangan mamlakatlarda, ayniqsa, AQSHda, Angliyada ichki to'lov sifatida keng yoyilgandir."
        ]
    },
    {
        "word": "Chek Daftari ",
        "type": [],
        "definition": [
            "korxona chek daftarchalarini unga xizmat ko'rsatuvchi bankmuassasasidan oladi. Mehnatga haq to'lash, pensiyalar, kasallik varaqasi bo'yicha nafaqalar, mukofotlar, xizmat safarlari va xo'jalik xarajatlari uchun naqd pullarni bank cheki asosida korxonaning hisob-kitob schyotidan shu korxona kassasiga beradi."
        ]
    },
    {
        "word": "Cheklangan Masʼuliyat",
        "type": [],
        "definition": [
            "ma’lum chegara doirasida cheklangan mas’uliyat. Qarz majburiyati yoki o'ziga biror-bir hujjatga imzo chekilayotganda mas’uliyati muayyan doiralarda cheklovchi shartni, punktni kiritish. "
        ]
    },
    {
        "word": "Cheklash",
        "type": [],
        "definition": [
            "tovar ishlab chiqaruvchilar va iste’molchilar manfaatini himoya qilish, umumdavlat manfaatlari va xalqaro majburiyatlarni bajarish bo'yicha davlat yoki davlatlar guruhi tomonidan eksport va import sohasida o'rnatiladi."
        ]
    },
    {
        "word": "Chekli Daromad ",
        "type": [],
        "definition": [
            "bir birlik qo'shimcha tovar sotishdan tushgan qo'shimcha daromad."
        ]
    },
    {
        "word": "Chekli Naflik ",
        "type": [],
        "definition": [
            "oxirgi yoki navbatdagi birlik ne’matni iste’mol qilishdan I olinadigan nafiik."
        ]
    },
    {
        "word": "Chekli Qoʻyilmalar",
        "type": [],
        "definition": [
            "chek yozib berish mumkin bo'lgan tijorat banklari va jamg'arma muassasalaridagi omonatlar."
        ]
    },
    {
        "word": "Chekli Texnologik Almashtirish Normasi ",
        "type": [],
        "definition": [
            "ishlab chiqarish hajmi o'zgarmaganda bir birlik X omilini necha birlik Y omil bilan almashtirish mumkinligini ko'rsatadi. "
        ]
    },
    {
        "word": "Chekli Transformatsiya Normasi ",
        "type": [],
        "definition": [
            "birinchi tovardan qo'shimcha bir birlik ishlab chiqarish uchun ikkinchi tovardan qancha voz kechish kerakligini ko'rsatadi. Bu birinchi tovarning altemativ qiymatini ifodalaydi va ikkinchi tovarning chekli ishlab chiqarish xarajatlarini birinchi tovarning chekli ishlab chiqarish xaraj ati nisbatiga teng b o' ladi."
        ]
    },
    {
        "word": "Cheksiz Qoʻyilmalar",
        "type": [],
        "definition": [
            "chek yozib berish mumkin bo'lmagan jamg'arma hisob-raqami."
        ]
    },
    {
        "word": "Chet El Valyutalarini Diversifikatsiya Qilish ",
        "type": [],
        "definition": [
            "bir vaqtning o'zida bir nechta chet el valyutasida rezervlar tashkil qilish tushuniladi. "
        ]
    },
    {
        "word": "Chet El Yuridik Shaxslari ",
        "type": [],
        "definition": [
            "rezidentlar va norezidentlarga bo'linadi. Rezidentlar O'zbekistondagi yuridik shaxslar kabi soliqqa tortiladi. O'zbekiston Respublikasida faoliyat ko'rsatuvchi norezident yuridik shaxslar: doimiy muassasa orqali faoliyat ko'rsatuvchi; doimiy muassasa bo'lmasdan faoliyat ko'rsatuvchi yuridik shaxslarga bo'linadi. Birinchi guruhdagilarning O'zbekistonda olgan daromadlari ularning soliq idoralariga taqdim etadigan deklaratsiyalari orqali soliq idoralari tomonidan hisoblab chiqilib, soliqqa tortiladi. Ikkinchi guruh norezidentlarning O'zbekiston hududidagi korxona va tashkilotlardan olgan daromadlari manbayida jami daromaddan hech qanday chegirmasiz soliqqa tortiladi. "
        ]
    },
    {
        "word": "Chet Eldan Toʻgʻri Investitsiyalar -",
        "type": [],
        "definition": [
            "investorning korxonani boshqarish niyatida uning aksiyalarini sotib olishga sarflagan xarajatlari dan iborat. Investor aktivga ega bo'ladi, investitsiya kiritilgan birlik majburiyatga ega bo'ladi. "
        ]
    },
    {
        "word": "Chetlanish ",
        "type": [],
        "definition": [
            "kutiladigan natija bilan haqiqiy natija o'rtasidagi farq."
        ]
    },
    {
        "word": "Chiqish Joyidagi Sifat",
        "type": [],
        "definition": [
            "ishlab chiqarishning har bir ishtirokchisi o'zi ishlab chiqarayotgan mahsulotning belgilangan talablarga javob berishini ta’minlashga mas’uldir."
        ]
    },
    {
        "word": "Choʻqqi ",
        "type": [],
        "definition": [
            "trendning grafikdagi eng yuqori qismi."
        ]
    },
    {
        "word": "Chorvachilik Tizimi ",
        "type": [],
        "definition": [
            "chorva mollari sonini o'stirish va sifatini yaxshilash, maxsuldorligini muntazam oshirib borish hamda mahsulot birligiga qilinadigan xarajatlarni kamaytirish, umuman, chorva mollari va chorvachilik vositalaridan maqsadga muvofiq foydalanish orqali uni eng samarali tarmoqqa aylantirishni taminlaydigan tashkiliy-iqtisodiy, texnologik va texnikaviy tadbirlar yig'indisi."
        ]
    },
    {
        "word": "Chakana Baho ",
        "type": [],
        "definition": [
            "davlat va kooperativ savdosi, dehqon bozorida iste’mol mollarini sotilish narxlari. "
        ]
    },
    {
        "word": "Chakana Savdo ",
        "type": [],
        "definition": [
            " savdo-sotiq tarmoqlari orqali aholiga istemol mollarini sotish."
        ]
    },
    {
        "word": "Chet El Yuridik Shaxslari ",
        "type": [],
        "definition": [
            "rezidentlar va norezidentlarga bo'linadi. Rezidentlar O'zbekistondagi yuridik shaxslar kabi soliqqa tortiladi. O'zbekiston Respublikasida faoliyat ko'rsatuvchi norezident yuridik shaxslar: doimiy muassasa orqali faoliyat ko'rsatuvchi; doimiy muassasa bo'lmasdan faoliyat ko'rsatuvchi yuridik shaxslarga bo'linadi. Birinchi guruhdagilarning O'zbekistonda olgan daromadlari ularning soliq idoralariga taqdim etadigan deklaratsiyalari orqali soliq idoralari tomonidan hisoblab chiqilib soliqqa tortiladi. Ikkinchi guruh norezidentlarning O'zbekiston hududidagi korxona va tashkilotlardan olgan daromadlari manbayida jami daromaddan hech qanday chegirmasiz soliqqa tortiladi (ushlanib qolinadi)."
        ]
    }
]