[
    {
        "word": "Economics",
        "type": [],
        "definition": [
            "odamlar o'z ehtiyojlarini qondirish maqsadida, cheklangan resurslarga ega bo'laturib, har xil mahsulot va xizmatlar ishlab chiqarishni qanday tashkil qilishni o'rganuvchi fan. ECONOMY - odamlarning mahsulot va xizmatlar ishlab chiqarish, taqsimlash va iste’mol qilish borasida olib boradigan xo'jalik faoliyat turlarining majmuasi."
        ]
    },
    {
        "word": "Effektfvlik",
        "type": [],
        "definition": [
            "har xil ko'rinishdagi iqtisod resurslari yoki resurslar majmuyi bilan iqtisodiy faoliyat amaliy natijalari nisbatini aks ettiruvchi iqtisodiy kategoriya."
        ]
    },
    {
        "word": "Egalik Qilish Mumkin Boʻlgan Daromad (Mavjud Daromad)",
        "type": [],
        "definition": [
            "institutsion birlik muayyan hisobot davrida o'zining naqd pul aktivlarini kamaytirmasdan yoki passivlarini ko'paytirmasdan tovar va xizmatlarning pirovard iste’moli uchun sarflashi mumkin bo'lgan maksimal daromad yig'indisiga egalik qilish mumkin bo' lgan daromad."
        ]
    },
    {
        "word": "Egasining Nomi Yozilgan Qimmatli Qogʻozlar",
        "type": [],
        "definition": [
            "mulkiy huquqlarning realizatsiya qilinishi o'z egasining ro'yxatdan o'tkazilgan bo'lishini talab etadigan qimmatli qog'ozlar."
        ]
    },
    {
        "word": "Egri (Bilvosita) Soliqlar",
        "type": [],
        "definition": [
            "xo'jalik aktlari va aylanmalari hamda moliyaviy operatsiyalardan kelib chiqadi. Bu soliqlarning tarkibiga qo'shilgan qiymat solig'i, aksizlar, bojxona bojlari, qimmatbaho qog'ozlar bo'yicha operatsiyalardan olinadigan soliq va boshqalar kiradi. Ular baho yoki tarifga ustama (qo'shimcha) tarzida (ko'rinishida) o'rnatilib, soliq to'lovchilaming daromadlari bilan belgilanadigan (aniqlanadigan) to'g n (bevosita) soliqlardan farq qiladi."
        ]
    },
    {
        "word": "Egri Chiziq Abrisi",
        "type": [],
        "definition": [
            "trendning grafikdagi alohida qismi."
        ]
    },
    {
        "word": "Ehtimol",
        "type": [],
        "definition": [
            "(ingl. probability) - ma’lum natijaga erishish imkoniyati."
        ]
    },
    {
        "word": "Ehtimollar Nazariyasi",
        "type": [],
        "definition": [
            "tasodifiy hodisalarning ehtimolligi bo'yicha o'zaro aloqada bo'lgan boshqa hodisalarning ehtimolligini aniqlash bilan bog'liq matematika fani. Ehtimollar nazariyasi asosida tasodifiy hodisalarning ro‘y berish ehtimolligi katta yoki kichik ekanligi aniqlanadi."
        ]
    },
    {
        "word": "Ehtiyoj",
        "type": [],
        "definition": [
            "insonlarning, ijtimoiy guruhlarning yashash va mehnat qilish jarayonlarini ta’minlash uchun zarur bo'lgan hayotiy vositalardir. Ehtiyoj subyektlarning o'zaro bog'liqligi va ularning faoliyatida umumiy manfaatdorlikni ifodalaydi."
        ]
    },
    {
        "word": "Ekin Maydonlari Tark1Bi",
        "type": [],
        "definition": [
            "jami ekish maydonida ayrim turdagi ekinlar maydonining tutgan salmog'i."
        ]
    },
    {
        "word": "Ekologik Audit (Ekoaudit)",
        "type": [],
        "definition": [
            "korxonalar, kompaniyalarning ichki ekologik salohiyati, ularning xavf-xatarlari va imkoniyatlarini doimiy tekshirib turish instrumentidir."
        ]
    },
    {
        "word": "Ekologik Monitoring",
        "type": [],
        "definition": [
            "atrof, tabiiy muhit va uning resurslari holatini ma’lum dastur asosida muntazam kuzatish, baholash, prognozlash (bashoratlash)ning ma’lum tizimi bo'lib, iqtisodiy-ekologik boshqaruv qarorlarini tayyorlash va qabul qilish jarayonlarini axborot bilan ta’minlashga xizmat qiladi. U antropogen faoliyat ta’sirida atrof-muhit holatidagi o'zgarishlarni aniqlash va tegishli tavsiyalarni ishlab chiqishga imkon beradi"
        ]
    },
    {
        "word": "Ekologik Muammolar",
        "type": [],
        "definition": [
            "insoniyat xatti-harakatlari va xo'jalik faoliyati natijasida atrof-muhitga yetkazilgan zarar."
        ]
    },
    {
        "word": "Ekologik Resurslar",
        "type": [],
        "definition": [
            "biosferada ekologik muvozanatni ta’minlaydigan muhitni shakllantiruvchi komponentlarning majmuyi bo'lib, ular insonning ijtimoiy-biologik mavjudot sifatidagi hayotiy normal muhiti hisoblanadi. Ekologik resurslar hayotiy muhim funksiyani bajaradigan tabiiy tizimlarga kiradi. Bu resurslarning xarakterli xususiyati shundaki, ular, asosan, jamiyatni zaruriy ne’mat shaklidagi xizmat bilan ta’minlaydi. Ekologik resurslarga havo, suv, yer (tuproq) kiradi."
        ]
    },
    {
        "word": "Ekologiya",
        "type": [],
        "definition": [
            "tabiat va jamiyat o'zaro ta’sirining umumiy qonuniyatlari to'g'risidagi fan; atrof-muhitni muhofaza qilish va tabiat resurslarini ishlatishning maqsadga muvofiqligiga qaratilgan jamiyat faoliyatining maxsus sohasi."
        ]
    },
    {
        "word": "Ekonometrika",
        "type": [],
        "definition": [
            "iqtisodiy hodisa va jarayonlarning aniq miqdoriy qonuniyatlari va o'zaro aloqalarini matematik, statistik metodlar, modellar yordamida o'rganuvchi fan. Matematikaning iqtisodiyotda qo'llanilishi bo'yicha iqtisodiy nazariyadagi alohida oqim."
        ]
    },
    {
        "word": "Ekonometrika Konsepsiyalari",
        "type": [],
        "definition": [
            "iqtisodiyotda matematika metodlaridan keng foydalanishga asoslangan konsepsiyalar. Asosiy vakillari L. Valras, V. Pareto (Lozanna universiteti), fon Neyman, U. Mitchell, E. Barone, M. Panteleoni. 1910-yilda polshalik iqtisodchi P. Chompa “Ekonometriya” (“Ekonomterika”) matnini qo'llagan. Ilmiy muomalaga (1926) norvegiyalik R. Frish kiritgan. AQSh, Buyuk Britaniya, Niderlandiya va boshqa mamlakatlarda keng rivoj topmoqda. Turli iqtisodiy ta’limot yo'nalishlarida qo'llaniladi, ilmiy va amaliy ahamiyatga molik. V. Leontev ham bu konsepsiyalardan (1906) o'zining “chiqim-chiqarish” uslubida foydalangan (U 1973-yilda Nobel mukofoti sovrindori bo'ldi). 60-70-yillarda bu yo'nalish sobiq SSSR, xususan, O'zbckistonda rivoj topdi. Respublikamizning olim va mutaxassislari tomonidan iqtisodiy modeUashtirish va algoritmlash bo'yicha muhim tadqiqotlar amalga oshirilgan."
        ]
    },
    {
        "word": "Eksedent Riski",
        "type": [],
        "definition": [
            "mazkur toifadagi risk bo'yicha zararni qayta sug'urtalash to'g'risidagi kelishuv"
        ]
    },
    {
        "word": "Eksedent Zarar1",
        "type": [],
        "definition": [
            "noproporsionl qayta sug'urtalash shakli. Bunda sedentga o'z zimmasida ushlab qolingan zarardan oshgan qismi qayta sug'urtalovchi kompaniya tomonidan qoplanadi."
        ]
    },
    {
        "word": "Ekspert",
        "type": [],
        "definition": [
            "u yoki bu masalada asoslab berilgan fikr-mulohaza bildirishi mumkin bo'lgan faoliyatning muayyan sohasida yetuk bilim, tajribaga ega mutaxassis. U korxona, tashkilot yoki davlat organlari tomonidan ekspertiza (masalan, buxgalteriya, patent ekspertizasi) o'tkazishga taklif qilinadigan shaxs."
        ]
    },
    {
        "word": "Ekspert Baholash",
        "type": [],
        "definition": [
            "yuqori malakali mutaxassislar (ekspertlar) tomonidan marketing omillari yoki tadbirlarini bevosita baholash."
        ]
    },
    {
        "word": "Ekspert Xulosasi",
        "type": [],
        "definition": [
            "yozma shaklda ifodalangan ekspert ishining natijalari."
        ]
    },
    {
        "word": "Ekspluatatsiya",
        "type": [],
        "definition": [
            "ishlab chiqarish vositalari egalari tomonidan bevosita ishlab chiqaruvchilar mehnati bilan yaratgan qo'shimcha mahsulotni haq to'lamasdan o'zlashtirib olishi."
        ]
    },
    {
        "word": "Eksport",
        "type": [],
        "definition": [
            "tovarlar, xizmatlar va kapitalni sotish maqsadida chet el bozorlariga chiqarish; eksport import bilan bir qatorda xalqaro ijtimoiy mehnat taqsimoti bilan bog'Iangan va tashqi savdoning tarkibiy qismidir. Eksportning quyidagi ko'rinishlari mavjud: 1. Tovar eksporti - bunda moddiy ne’matlar chetga chiqariladi. 2. Xizmatlar eksporti - bunda xorij dagi sheriklarga to' lov evaziga turli xizmatlar ko'rsatiladi. 3. Kapital eksporti - bunda chet mamlakatlarga turli obyektlar qurish va ishga tushirish uchun mablag' (kapital) qo'yiladi."
        ]
    },
    {
        "word": "Eksport (Chetga Mol Chiqarish) Soligʻi",
        "type": [],
        "definition": [
            "tovar yoki xizmat uchun to'lanishi shart bo'lgan soliqlardan shakllanadi va tovarlar iqtisodiy hududdan olib chiqilganda yoki xizmat rezidentlardan tashqari iste’molchilarga ko'rsatilganda olinadi."
        ]
    },
    {
        "word": "Eksport Imkoniyati",
        "type": [],
        "definition": [
            "chet elga tovar chiqarish, sotish imkoniyati; korxonalar tarmoqlar va ayrim bir mamlakatning xorijga tovar chiqarib, chet el bozorida raqobat qila bilish qobiliyati, shuning hisobiga valyuta to'play olishi, daromad ola bilishni anglatadi."
        ]
    },
    {
        "word": "Eksport Kvota",
        "type": [],
        "definition": [
            "muayyan tovarlarni eksportga belgilangan hajmda ishlab chiqarish va yetkazib berish"
        ]
    },
    {
        "word": "Eksport Marketingi",
        "type": [],
        "definition": [
            "tashqi bozorga mo'ljallangan marketing"
        ]
    },
    {
        "word": "Eksport Uchun Subsidiya",
        "type": [],
        "definition": [
            "tovarlar iqtisodiy hududdan olib ketilganda yoki rezidentsiz birliklarga xizmat ko'rsatilganda, tovar va xizmatlar uchun to'lanishi zarur bo'Igan barcha moliyaviy yordam yig'indisi. EKSPORT-IMPORT SOLIG‘1 - soliqqa tortishning ко‘rinishlaridan biri; tashqi savdoni davlat tomonidan tartibga solish vositasi (chorasi). Soliqqa tortish obyekti bo'lib belgilangan kurs bo'yicha milliy valyutada hisoblangan tovarlarning boj qiymati yoki og'irlik va miqdor birliklarida ifodalangan tovarlar soni hisoblanadi"
        ]
    },
    {
        "word": "Eksportning Geografik Tarkibi",
        "type": [],
        "definition": [
            "alohida qit’a mamlakatlari, mamlakatlar guruhlari yoki alohida mamlakatning mamlakat eksportidagi ulushlari nisbati."
        ]
    },
    {
        "word": "Ekstensiv Iqtisodiy Oʻsish",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonini kengaytirib (ish o'rinlarini ko'paytirish, ekin maydonlarini kengaytirish va hokazo) borishga aytiladi."
        ]
    },
    {
        "word": "Ekstensiv Rivojlanish Yoʻli",
        "type": [],
        "definition": [
            "iqtisodiy o'sishning bir tipi. Ekstensiv rivojlanishda iqtisodiy o'sishga ishlab chiqarishning awalgi texnikaviy asosi saqlanib qolgan holda ishlab chiqarish omillari miqdorini ko'paytirish orqali erishiladi. Masalan, zavod qo'shimcha sex quradi, ya’ni ishlab chiqarishga qo'shimcha ishlab chiqarish vositalari va ish kuchini jalb etadi hamda mahsulot miqdorining o'sishiga erishiladi. Bunda ishlab chiqarish omillari miqdorining o'sishi hisobiga mahsulot hajmi o'smoqda. Bu yo'l bilan yuqori ishlab chiqarish samaradorligiga erishib bo'lmaydi."
        ]
    },
    {
        "word": "Ekstraversiya",
        "type": [],
        "definition": [
            "(extra - tashqari) - shaxsning shunday psixologik xususiyatlarini ko'rsatib beradiki, bunda shaxs o'z qiziqishlarini tashqi omilga, tashqi obyektlarga qaratadi, ba’zan buni o'zining qiziqishlari, shaxsiy ahamiyatini pasaytirish hisobiga amalga oshiradi."
        ]
    },
    {
        "word": "Ekstropolyatsiya Modelini Qurish",
        "type": [],
        "definition": [
            "biror-bir bashoratlanayotgan ko'rsatkichni o'zgarish tendensiyasi namoyon etishi bilan asoslanadi. Bunday modellar, asosan, biror-bir tovarga talab o'zgarganda qo'llaniladi."
        ]
    },
    {
        "word": "Ekvivalent",
        "type": [],
        "definition": [
            "biror narsaning o'rnini bosa oladigan yoki uning ifodasi bo'lib xizmat qiladigan teng baholi, teng qimmatli narsa yoki miqdor. Masalan: pul barcha tovarlarning qiymatini ifodalovchi ekvivalent rolini bajaradigan alohida tovardir."
        ]
    },
    {
        "word": "Elastiklik",
        "type": [],
        "definition": [
            "talab va taklifga tasir qiluvchi omillarning o'zgarishi natijasida ularni qanchaga o'zgarishi tushuniladi (narxi, daromadi, iste’molchilar soni va hokazo)."
        ]
    },
    {
        "word": "Elektron Raqamli Imzo",
        "type": [],
        "definition": [
            "davlat idoralari bilan o‘zaro munosabatni o‘rnatishda jismoniy yoki yuridik shaxsga elektron xatti-harakatlarini tasdiqlash uchun zarur bo‘ladigan, mas’ul davlat organi tomonidan taqdim etilgan, elektron raqamli imzo yopiq kalitining egasini identifikatsiya qilish imkoniyatini beradigan imzo."
        ]
    },
    {
        "word": "Elastiklik Koeffitsiyenti",
        "type": [],
        "definition": [
            "omil belgining 1% ga o'zgarganda natija qancha foizga o'zgarishini aniqlaydi."
        ]
    },
    {
        "word": "Electron Birja",
        "type": [],
        "definition": [
            "ko‘p sotuvchilar va ko‘p xaridorlar mavjud bo lganda, elektron biznes doirasida birjada xilma-xil tovarlar oldi-sotdisi."
        ]
    },
    {
        "word": "Elektron Biznes",
        "type": [],
        "definition": [
            "qo'shimcha qiymatning birlashtirilgan zanjirini yaratish va ishchan hamkorlarning optimal o'zaro ishlashini ta’minlash uchun axborot texnologiyalaridan foydalanishga asoslangan intemet-biznes."
        ]
    },
    {
        "word": "Elektron Hujjatlarning Aylanishi",
        "type": [],
        "definition": [
            "avtomatlashtirilgan axborot tizimida elektron hujjatlarning shakllantirilishi va uzatilishining tashkil qilish sxemasi."
        ]
    },
    {
        "word": "Elektron Jadval",
        "type": [],
        "definition": [
            "jadval shaklida ifodalangan ma’lumotlarga ishlov berishga mo'ljallangan amaliy dasturlar majmuasi. ELEKTRON OFIS - tashkilotlar va muassasalarda avtomatlashtirilgan ofis faoliyatining tizimi."
        ]
    },
    {
        "word": "Elektron Pochta",
        "type": [],
        "definition": [
            "kommunikatsiya tarmoji orqali kompyuterdan kompyuterga xabarlar uzatish. Elektron pochta o'z ichiga matnlar, nutq va tavsiyalardan iborat bo'lgan xabarlarni olgan ixtiyoriy xabarlarni foydalanuvchilar orasida uzatishni avtomatlashtirish uchun mo'ljallangan."
        ]
    },
    {
        "word": "Elektron Pul",
        "type": [],
        "definition": [
            "hisob-kitoblarni elektron hisoblash mashinalari yordamida bajarish uchun qo'Ilanadigan kredit pullarning eng so'nggi turi; kredit kartochkalariga o'xshagan pul. Elektron pul elektron kartochka bo'lib, uning xotirasiga pul egasining joriy hisobidagi pul summasi yozilgan bo'ladi. Pul to'lash uchun elektron kartochki EHMga kiritiladi va kartochka avtomatik ravishda to'lanishi zarur pul summasini o'chirib, uni pul oladiganlarning elektron hisobiga yozib qo'yadi."
        ]
    },
    {
        "word": "Elektron Tijorat",
        "type": [],
        "definition": [
            "do'konlarga xaridorlarni jalb qilish va qo'shimcha savdogarlarni yollash o'rniga internetda do'kon ochish."
        ]
    },
    {
        "word": "Eliminatsiya",
        "type": [],
        "definition": [
            "mavjud mahsulotlarni korxonaning ishlab chiqarish dasturidan chiqarib tashlash; tovar ishlab chiqarishni to‘xtatish; tovarni bozordan raqobatbardoshligi va talabni yoqotganligi sababli olib chiqish. Mahsulotni eliminatsiya qilish zarurligini tekshirish uchun savdo hajmi, bozordagi ulushi, hayotiylik davridagi o‘rni; firmaning jami aylanmasidagi ulushi, rentabelligi, kapital aylanishi va boshqa korsatkichlar qo'llanadi."
        ]
    },
    {
        "word": "Embargo",
        "type": [],
        "definition": [
            "a) davlat tomonidan biron-bir tovarni chetdan keltirish yoki chetga chiqarishni taqiqlash; b) boshqa mamlakatning huquqini buzish harakatlariga javoban hukumat tomonidan boshqa mamlakat yoki o'z kemalarining mamlakat portidan chiqishini taqiqlash."
        ]
    },
    {
        "word": "Emigratsiya",
        "type": [],
        "definition": [
            "iqtisodiy, siyosiy yoki shaxsiy sabablarga ko‘ra xorijiy mamlakatga vaqtinchalikyoki uzoq davr ishlash uchun insonlarning ко‘chib o'tishi."
        ]
    },
    {
        "word": "Emission Bank",
        "type": [],
        "definition": [
            "qarang: Markaziy bank. "
        ]
    },
    {
        "word": "Emissiya",
        "type": [],
        "definition": [
            "muomalaga pul va qimmatbaho qog'ozlarni chiqarish. Emissiya huquqi markaziy hukumat ixtiyorida bo'ladi. Budjet tushumlari xarajatlar qoplanmagan holda ishlatiladi. Xo'jalik oboroti ehtiyojlari bilan bog'liq bo'lmagan pullarni chiqarish pul massasining ko'payib ketishiga olib keladi."
        ]
    },
    {
        "word": "Emissiyavty Qimmatli Qogʻozlar",
        "type": [],
        "definition": [
            "bitta chiqarilish doirasida bir xil belgilar va rekvizitlarga ega bo'lgan, mazkur chiqarilish uchun yagona shartlar asosida joylashtiriladigan hamda muomalada bo'ladigan qimmatli qog'ozlar."
        ]
    },
    {
        "word": "Emissiyaviy Qimmatli Qogʻozlar Chiqarilishlarining Yagona Davlat Reestri",
        "type": [],
        "definition": [
            "ro'yxatdan o'tkazilgan emissiyaviy qimmatli qog'ozlar chiqarilishlarining ro'yxati."
        ]
    },
    {
        "word": "Emitent",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarni muomalaga bosib chiqaruvchi yuridik va to'lovga qobiliyatli jismoniy shaxslar"
        ]
    },
    {
        "word": "Energetik Inqiroz",
        "type": [],
        "definition": [
            "davriy bo'lmagan iqtisodiy inqirozlarning turi. Bunga misol qilib, 1973-1974 va 1979-1980-yillarda chetdan olib kelinadigan neft bahosining o'ta ko'tarilishi va natijada ishlab chiqarish xarajatlarining keskin oshishi natijasida rivojlangan mamlakatlarda iqtisodiy mutanosiblikning buzilishini ko'rsatish mumkin."
        ]
    },
    {
        "word": "Eng Kichik Kvadratlar Usuli",
        "type": [],
        "definition": [
            "dinamik qatorlarni tekislash hamda tasodifiy miqdorlar o'rtasida bog'lanishning korrelyatsion shaklini aniqlash usulidir."
        ]
    },
    {
        "word": "Engel Chiziqlari",
        "type": [],
        "definition": [
            "iste’mol qilingan tovarlar miqdorini iste’molchi daromadining o'zgarishidan bog'hqligini ko'rsatuvchi chiziq."
        ]
    },
    {
        "word": "Erkin Almashadigan Valyuta (Eav)",
        "type": [],
        "definition": [
            "mamlakatning to'lov balansini joriy operatsiyalar bo'limiga valyutaviy cheklashlar bo'lmasa, bu mamlakatning puli erkin almashadigan valyuta deb tan olinadi"
        ]
    },
    {
        "word": "Erkin Baho",
        "type": [],
        "definition": [
            "talab va taklif asosida shakllanadi."
        ]
    },
    {
        "word": "Erkin Bozor Narxlari",
        "type": [],
        "definition": [
            "talab va taklif asosida vujudga keladigan bozor narxlaridir. Madaniylashgan bozor sharoitlarini vujudga keltirishda erkin narxlar, jamiyat va bozor munosabatlariningbarcha subyektlari manfaatlarini eng maqbul tarzda uyg'unlashtirishga imkon beradi."
        ]
    },
    {
        "word": "Erkin Iqtisodiy Zona (Hudud)",
        "type": [],
        "definition": [
            "mamlakat hududining xorijiy mamlakatlar tomonidan turli shakllardagi hamkorlikdagi tadbirkorlik bilan shug'ullanishlari uchun ruxsat etilgan qismi. Mazkur zonalarda maxsus imtiyozli shart-sharoitlar, jumladan, imtiyozli soliqlar, bojxona tolovlari, ijara, viza olish, valyuta ayirboshlash, mehnatga yollashning qulay tartiblari belgilangan boladi. EIZ turkumigabankva sug'urta zonalari kiradi, bubilanbank muomalalari va sug'urta ishlari uchun imtiyoz va kapitalning kirib kelishiga qulay sharoit yaratiladi. ElZning maxsus turi texnologik zonalardir. Bunday zonalarda yangi texnika va texnologiyani yaratish uchun imtiyozlardan xorijiy, shuningdek, milliy korxonalar va har xil tashkilotlar ham foydalanadi. Kompleks xarakterdagi alohida iqtisodiy zonalarda savdo-sanoat texnologiyasi ishlari uchun qulayliklar barpo etiladi. Bunday zonalar alohida, hamma uchun ochiq hududlar deb ataladi."
        ]
    },
    {
        "word": "Erkin Narxlar",
        "type": [],
        "definition": [
            "talab bilan taklif nisbatiga bog'liq bo'Igan narxlar"
        ]
    },
    {
        "word": "Erkin Savdo Hududi",
        "type": [],
        "definition": [
            "doirasida qatnashchi mamlakatlar o'zaro savdo to'siqlarini bekor qiladi, lekin ularning har ikkalasi uchinchi mamlakatga nisbatan savdo to'siqlarini buzmaydi."
        ]
    },
    {
        "word": "Erkin Savdo Hududlari",
        "type": [],
        "definition": [
            "preferensial hudud hisoblanib, uning doirasida bojxona va miqdoriy cheklashlardan xoli savdo tartibiga rioya qilinadi. Unga kiritilgan tovarlar boj to'lovidan ozod etiladi. Hozir jahonda 500 dan ortiq erkin savdo zonalari mavjud. ERKINLASHTIRISH - xo'jalik yurituvchi subyektlarning erkinligi va iqtisodiy mustaqilligi, iqtisodiy faoliyatning bozorga xos mexanizmlarining samarali amal qilishini taminlashga qaratilgan jarayon; davlat tomonidan belgilangan chora-tadbirlar tizimi; iqtisodiy siyosat yo'nalishlaridan biri."
        ]
    },
    {
        "word": "Erkinlik Darajalar Soni",
        "type": [],
        "definition": [
            "to'plam ko'rsatkichlarini topishda qatnashadigan hech qanday bog'lovchi shartlarga ega bo'lmagan erkin miqdorlar soni."
        ]
    },
    {
        "word": "Etika (Axloq)",
        "type": [],
        "definition": [
            "ijtimoiy hayot jarayonida ro'yobga chiqariladigan universal va o'ziga xos axloqiy talabalar va xulq-atvor normalari tizimidir."
        ]
    },
    {
        "word": "Evolyutsiya",
        "type": [],
        "definition": [
            "(lot. kengayib borish) - tabiat va jamiyat harakat shakllaridan biri. Evolutsiya tadrijiy harakat shakli bo'lib, bunda harakat uzluksiz ravishda davom etib, sifat o'zgarishlarga olib keladi."
        ]
    },
    {
        "word": "Evristik Metodlar",
        "type": [],
        "definition": [
            "insonning intuzitiv qobiliyatiga asoslanadigan aqliy faoliyat tashkillashtirish vositalarida namoyon bo'ladi. Intuitsiya insonlarga omadli ravishda muammoni yechish imkonini beradi. Bulardan biri innovatsiyalashgan o'yinlar metodidir."
        ]
    },
    {
        "word": "Evristika",
        "type": [],
        "definition": [
            "ilmiy tadqiqotning mantiqiy usullari va metodik ko'rsatmalari. "
        ]
    }
]