[
    {
        "word": "Fabrika",
        "type": [],
        "definition": [
            "mashina, texnika turlari va texnologiyani qo'llashga asoslangan holda ish yurituvchi sanoat korxonasi; yirik mashinalashgan ishlab chiqarish turi."
        ]
    },
    {
        "word": "Faktlar Boʻyicha Nazorat Usullari",
        "type": [],
        "definition": [
            "ro yxatga olish, ekspertiza, ko'z bilan kuzatish, nazorat o‘lchovi, nazorat tariqasida ishga tushirish, vaqtni aniq o'lchash, ish kuni taqsimlanishini o‘rganish, laboratoriya tahlili."
        ]
    },
    {
        "word": "Faktoring",
        "type": [],
        "definition": [
            "1. Hisob-kitoblarni tashkil etish sohasidagi yangi xizmat turi bo‘ lib, mijozning kapitalini kreditlash bilan shug'ullanadi. 2. Moliyatijorat xizmatining turi bo'lib, bunda bank yoki boshqa moliya tashkilotlari xarid qiluvchi korxona qarzlari va majburiyatlarni o'z ichiga oladi."
        ]
    },
    {
        "word": "Fakultativ Obligator Shartnomasi",
        "type": [],
        "definition": [
            "sedent qayta sug'urtalovchi bilan kelishgan toifadagi har qanday sug'urta riskini berishi, qayta sug'urtalovchi esa ularni qabul qilishi shart ekanligi haqidagi qayta sug'urtalash shartnomasi."
        ]
    },
    {
        "word": "Fakultativ Qayta Sugʻurtalash",
        "type": [],
        "definition": [
            "proporsional qayta sug'urtalash shartnomasining turi. Fakultativ qayta sug'urtalashda har bir berilayotgan riskbo'yicha alohida shartnoma tuziladi. Sedent har bir risk bo'yicha qayta sug'urtalash zarur yoki zarur emaslik masalasini mustaqil ко'rib chiqadi. O'z navbatida, qayta sug'urtalovchi ham sedentning taklifini qabul qilishi yoki qabul qilmasligi ham mumkin."
        ]
    },
    {
        "word": "Fan-Texnika Taraqqiyoti",
        "type": [],
        "definition": [
            "fan, texnika, texnologiyalar rivojlanishi, mehnat predmetlari, ishlab chiqarish va mehnatni tashkil etishning uzluksiz rivojlanish jarayoni."
        ]
    },
    {
        "word": "Faol Bank Operatsiyalari",
        "type": [],
        "definition": [
            "bank resurslarini joylashtirish va foydalanish bilan bog'liqdir. Bunga kundalik operatsiyalar, veksellar, tovarlar, fondlar bilan ishlash kiradi. Bozor iqtisodiyotiga o'tish jarayoni bilan yangi operatsiyalar konsalting, lizing, faktoring, trat, injiniring xizmatlarini o'z ichiga oladi. Hozirgi davrda eng faol bank operatsiyalariga veksellarni hisobga olish, ulami veksel egalaridan sotib olish va belgilangan vaqtda ularning to'liq qiymatini to'lash kiradi. O'zbekistonda faol operatsiyalar O'zbekiston Respublikasi Vazirlar Mahkamasining 1995-yil 2-iyundagi 204-sonli “Xalq xo'jaligida veksellarni qo'llash to'g'risida’ gi qaroriga asosan amalga oshiriladi. Bundan tashqari, banklar operatsiyasiga ssuda berish, asosan, qimmatbaho qog'ozlar orqali amalga oshiriladi va fond operatsiyalari deb yuritiladi. Banklar mol-mulklarni garovga olish yo'li bilan ham ssuda beradi. Bunga mahsulotga (tovarga) asoslangan operatsiyalar deb yuritiladi. Banklar o'zlarining doimiy mijozlariga olgan qarzlarini o'z vaqtida qaytarishiga shak-shubhasiz, hech qanday garovsiz ssudalar beradilar. Bular hujjatli operatsiyalar deyiladi."
        ]
    },
    {
        "word": "Faol Bozor",
        "type": [],
        "definition": [
            "oldi-sotdi obyektlari bir turda (bir xil) bo'lgan va har qanday vaqtda bitimni amalga oshirishni xohlovchi manfaatdor sotuvchi va xaridorlarni topish mumkin bo'lgan, shuningdek, narxlar haqidagi ma’Iumotlar oshkor (hammabop) bo'lgan bozor."
        ]
    },
    {
        "word": "Faoliyat Tizimli Xaritasi",
        "type": [],
        "definition": [
            "korxona strategiyasini hayotga tatbiq etishga yo'naltirilgan va bitta tizimga yig'ilgan har xil faoliyat sxemasidir."
        ]
    },
    {
        "word": "Faoliyatning Natijasi",
        "type": [],
        "definition": [
            "xaraj atlar-daromadlar nomli iqtisodiy ко rsatkichni o'lchash natijasida olinadigan samara ko'rsatkichi"
        ]
    },
    {
        "word": "Favqulodda Foyda Va Zararlar",
        "type": [],
        "definition": [
            "korxonaning xo'jalik faoliyatida nihoyatda kam sodir bo'ladigan, uning uchun odat bo'lmagan va korxonada boshqaruv qarorlarini qabul qilish natijasi bilan bog'liq bo'lmagan voqealardan olinadigan daromad va xarajatlardir. U yoki bu moddaning favqulodda daromad va xarajat tarzida aks ettirilishi uchun quyidagi uchta talablarga javob berishi kerak: o'z xarakteri bo'yicha odatdagidek bo'lmasli (korxonaning odatdagi xo'jalik faoliyatiga tegishli emas); bir necha yillar davomida takrorlanmaydigan; korxonaning boshqaruv xodimlari tomonidan qabul qilinadigan qarorlarga bog'liq bo'lmagan holatlardan tashkil topadi."
        ]
    },
    {
        "word": "Favquloddagi Daromadlar",
        "type": [],
        "definition": [
            "deganda yuz berish xarakteriga ega bo'lmagan, kutilmagan tasodifva hodisalardan olingan daromadlar tushuniladi. Bularga davlat qonunlarining o'zgarishi, tabiiy ofatlar, revolyutsion o'zgarishlar natijasida vujudga kelgan daromadlar kiradi."
        ]
    },
    {
        "word": "Fazilat",
        "type": [],
        "definition": [
            "ijobiy xislat, yaxshi sifat yoki xususiyatdir."
        ]
    },
    {
        "word": "Federal Zaxira Tizimi",
        "type": [],
        "definition": [
            "AQSH davlat bank-kredit tizimi. Davlat tomonidan Markaziy Bankning bank krediti uchun hisobli foiz stavkalarini o rnatish bilan pul-kredit munosabatlarini tartibga solish tijorat banklarida boshqa mablag‘larning majburiy rezerv miqdorini belgilash uchun mo'ljallangan. 1913-yilda tashkil etilgan bo'lib, u 12 federal zaxira banklari yig'indisidan iborat."
        ]
    },
    {
        "word": "Federativ Davlat",
        "type": [],
        "definition": [
            "yagona (federal) qonunlar va hokimiyat organlari bilan bir qatorda ikkinchi darajali bo'Isa-da, o'zlarining qonunlari va hokimiyat organlariga ega bo'Igan boshqa davlat tuzilmalari - respublikalar, shtatlar, provinsiyalar, viloyatlar, hududlar mavjud bo'Igan davlat."
        ]
    },
    {
        "word": "Ferma",
        "type": [],
        "definition": [
            "qishloq xo'jaligi tashkilotining bir bo'limi yoki alohida xo'jalik. Chorvachilik, parrandachilik va shu kabi sohalar bilan shug'ullanadi."
        ]
    },
    {
        "word": "Fermer",
        "type": [],
        "definition": [
            "jamoa yoki davlat xo'jaliklarining bir bo'limida ish olib boruvchi shaxs; xususiy xo'jalik faoliyati yurituvchi shaxs."
        ]
    },
    {
        "word": "Fermer Xoʻjaligi",
        "type": [],
        "definition": [
            "o'ziga uzoq muddatli ijaraga berilgan yer uchastkalaridan foydalangan holda qishlo q xo' j aligi mahsulo tlarini ishlab chiqarishni amalga oshiruvchi fermer xo'jaligi a’zolarining birgalikdagi faoliyatiga asoslangan, yuridik shaxs huquqiga ega mustaqil xo'jalik yurituvchi subyekt. Fermer xo'jaligi erkin tadbirkorlikning bir ko'rinishi bo'lib, daromad olish maqsadida tuziladi. Xususiy yoki ijaraga olingan yerda olib boriladigan sohibkorlik tipidagi xo'jalik. Kapitalistik fermerchilikda yollanma mehnatni jalb etish, oilaviy shakli esa aksariyat xo'jalik egasining (fermer va uning oilasi) kuchi bilan olib boriladi. Dastlab Angliyada XVII asrda vujudga keldi. Hozir deyarli barcha mamlakatlarda mavjud. Fiziokratlar qo'llabquwatlagan xo'jalik turi. Erkin savdo, xususiy mulk va mavjud tuzum tabiiy deb baholanadi."
        ]
    },
    {
        "word": "Fifo",
        "type": [],
        "definition": [
            "(ingl. first in first out - ya m birinchi kirim birinchi chiqim) - sarf qilingan materiallar qiymatini hisobdan chiqarishning usullaridan biri bo'lib, kamayib borayotgan inflyatsiya sharoitida vaqt va birinchi sotib olingan materiallar qiymati bo'yicha hisob olib borishni bildiradi."
        ]
    },
    {
        "word": "Fikran Tovar",
        "type": [],
        "definition": [
            "biror tovar qondiradigan ehtiyoj, uning yordamida hal qilinadigan muammo."
        ]
    },
    {
        "word": "Fiktiv Kapital",
        "type": [],
        "definition": [
            "barcha o'ziga xos fimksional shakllarga ega sanoat kapitali sifatidagi real kapitalning qog'ozdagi timsolidir. Fiktiv kapitalning bahosi ikki holatda aniqlanadi: a) kapitalgabo'lgantalabningtaklifga nisbati orqali; b) qimmatli qog'oz bo'yicha kapitallashgan daromad miqdoriga qarab. U kapitalga bo'Igan talabning taklifga nisbatan oshishi va qimmatli qog'ozdan keladigan daromad miqdoriga to‘g‘ri proporsional, kapital taklifining talabdan oshishi va mamlakatdagi bank foizi me’yor darajasiga teskari proporsionaldir. Shuning uchun soxta kapital narxi qiymatli bozor kategoriyasi hisoblanib, uning bahosi tez o'zgaruvchan (tebranma) bo'ladi."
        ]
    },
    {
        "word": "Filips Egri Chizigʻ1",
        "type": [],
        "definition": [
            "ishsizlik darajasi va narxlarning yillik o'sish sur’atlari o'rtasidagi bog'liqlikni aks ettiruvchi egri chiziq. Bu ikki ko'rsatkich o'rtasidagibog'liqlikingliz iqtisodchisi A.V. Filips tomonidan Buyuk Britaniyaning 1862-1957-yillardagi ma’lumotlari asosida tadqiq etilgan. Unda inflyatsiyaning sur ati past bo' Isa, ishsizlikning daraj asi yuqori bo'ladi va aksincha. Muhim makroiqtisodiy ko'rsatkichlar o'rtasida barqaror va oldindan ko'rish mumkin bo'lgan bog'liqlikni o'rnatish, milliy iqtisodni tartibga solish va istiqbolini belgilash imkonini beradi."
        ]
    },
    {
        "word": "Firma",
        "type": [],
        "definition": [
            "(inglizcha - firm, firms trade name) - so'zlaridan olingan bo'lib, tijorat maqsadlarini ko'zlovchi korxona, kompaniya va boshqa xo'jalik tashkiloti degan ma’noni anglatadi. Iqtisodiy va yuridik erkinlikka ega xo'jalik yurituvchi subyekt. Firma to'la xo'jalik hisobida ishlaydi va o'zining nomiga ega. Firma faoliyati barcha turdagi mulkka egalik shakllari, ya ni xususiy, shirkat, davlat jamoat tashkilotlari, milliy va xorijiy yuridik shaxslar mulki asosida amalga oshiriladi."
        ]
    },
    {
        "word": "Firma Krediti",
        "type": [],
        "definition": [
            "eksportyor mamlakatning bir firmasi boshqa mamlakatning importyoriga to'lovni kechiktirish shaklidagi ssuda berishiga tushuniladi."
        ]
    },
    {
        "word": "Firma Shoxobchasi",
        "type": [],
        "definition": [
            "yirik firmaning tarkibiy qismi bo'lib, turli joylarda ish yuritadi. Mazkur korxona mustaqil bo'lmaydi, bosh firmaning bir qismi hisoblanadi."
        ]
    },
    {
        "word": "Firma Ustavi",
        "type": [],
        "definition": [
            "firmani barpo etish maqsadida va uning jamoatchilik bilan o'zaro munosabatlarini aniqlovchi hujjat"
        ]
    },
    {
        "word": "Firmaning Bozordagi Strategik Harakati",
        "type": [],
        "definition": [
            "bunda firma o'zining harakatini raqobatlashuvchi firmaning harakatiga ko'ra ishlab chiqadi."
        ]
    },
    {
        "word": "Firmaning Marketing Imkoniyati",
        "type": [],
        "definition": [
            "marketing harakatlarining jozibador yo'nalishi bo'lib, bunda aniq bir firma raqobatda ustunlikka erisha oladi."
        ]
    },
    {
        "word": "Firmaning Marketing Muhiti",
        "type": [],
        "definition": [
            "faol subyekt va kuchlarning yig'indisi, firmaning tashqi faoliyati bilan shug'ullanuvchi va marketing xizmatini boshqarish imkoniyatiga ta sir etish va maqsadli mijozlar bilan muvaffaqiyatli aloqani tutib turish."
        ]
    },
    {
        "word": "Firmaning Strategiyasi",
        "type": [],
        "definition": [
            "korxonaning uzoq muddatli asosiy maqsad va vazifalarini shakllantirish, xarajatlar izchilligini ta’minlash va bu maqsadlarga erishishi uchun zarur bo'lgan resurslarni taqsimlash. FISHER INDEKSI - Layp eyres va Pashe indekslari asosida tortilgan o‘rtacha geometrik sifatida hisoblanadigan indeks. U YalM xalqaro miqyosda solishtirishda keng qo'llaniladi."
        ]
    },
    {
        "word": "Fisher Samarasi",
        "type": [],
        "definition": [
            "inflyatsiyaning qarzlar yoki obligatsiyalar bo'yicha foiz stavkasiga ta’sirini hisobga olishni bildiruvchi tushuncha."
        ]
    },
    {
        "word": "Fiskal Moliya-Budjet Siyosati",
        "type": [],
        "definition": [
            "hukumat tomonidan davlat xarajatlari va soliqqa solish tartibiga kiritadigan o'zgartirishlar. Bundan maqsad to'la bandlik, to'la ishlab chiqarish hajmiga erishish. Davlatning fiskal siyosati soliqlarni undirish va budjet mablag‘laridan makroiqtisodiy muvozanatni ta’minlash va ijtimoiy masalalarni hal etish maqsadida hukumat imkoniyatlaridan foydalanishni nazarda tutadi. Fiskal siyosatning asosiy dastagi soliq stavkasini ishlab chiqarish maqsadiga muvofiq o'zgartirishdir."
        ]
    },
    {
        "word": "Fiskal Siyosat",
        "type": [],
        "definition": [
            "davlat xarajatlari va soliqqa tortish bo'yicha chora-tadbirlar ko'rish orqali mamlakatdagi ijtimoiy-iqtisodiy muammolarni yechishga qaratilgan siyosatdir. Fiskal siyosatning eng asosiy vazifasi - iqtisodiy-ijtimoiy siyosatni amalga oshirish uchun davlat pul fondlarini markazlashgan tarzda tashkil etish va ishlatish orqali iqtisodiy barqarorlikni ta’minlashdir."
        ]
    },
    {
        "word": "Fiziokratlar",
        "type": [],
        "definition": [
            "yunoncha “tabiat” va “hokimiyat” so'zlaridan tashkil topgan bo'lib, XVIII asr Fransiya klassik burjua siyosiy iqtisodining namoyandalari. F. Kene ushbu maktab asoschisi hisoblanadi. (Fiziokratiya - tabiat hukmronligi). Fiziokratlar ishlab chiqarishni haqli ravishda ijtimoiy boylikning manbayi deb hisoblaganlar, ammo qishloq xo'jaligi tarmog'i bilan cheklanib qolganlar. Ular qishloq xo'jaligidagina sof mahsulot, foyda vujudga keladi, shuning uchun ushbu tarmoqda sarf etilgan mehnatni unumli, ishlab chiqarishning boshqa tarmoqlarida qishloq xo'jaligida hosil etilgan boylik qayta ishlanganligi uchun yerdagi mehnatni unumsiz mehnat deb hisoblaganlar. Vaqt o'tishi bilan fiziokratlarning qarashlari bir yoqlama ekanligi ayon bo'ldi. Ular boylikning o'sishini yerning tabiiy hosildorligi bilan bog'lab, buning asosida sanoatni tarmoq deb solmay turib jamiyatni boy qila ololmaydi. Biroq shunga qaramasdan fiziokratlar ishlab chiqarishni yaxlit holda tadqiq qilishga asos soldilar, ular cheklanmagan holda xususiy mulk hukmronligi, erkin raqobat va tashqi savdo erkinligi tarafdori bo'lganlar. Ular birinchi marta kapitalni yillik avanslar ko'rinishida tadqiq qilishga asos soldilar, takror ishlab chiqarish qonunlari va ijtimoiy mahsulotning taqsimlanishini tadqiq etishga harakat qildilar."
        ]
    },
    {
        "word": "Foiz",
        "type": [],
        "definition": [
            "ma’lum bir davrga pulning qarz (kredit)ga berilgani uchun olinadigan daromad turi. Pul maxsus tovar bo'lgani uchun foiz uning narxi sifatida maydonga chiqadi. Masalan, 1 mln som kredit bir yilga 10% ga berilmoqda. Unda foiz 100 ming so'mni, yoki 10% ni tashkil etadi. Foiz davlat iqtisodiyotini tartibga solishda muhim vosita hisoblanadi. Uning darajasini pasaytirish iqtisodiy faollikni oshiradi, ko'tarish esa pasaytiradi."
        ]
    },
    {
        "word": "Foiz Stavkasi",
        "type": [],
        "definition": [
            "kredit yoki qarz kapitali evaziga to'lovning foiz ko'rsatkichi. Odatda, qarzga olingan pul belgisining bir-birligiga to'g'ri keladigan yillik to'lovni aks ettiradi"
        ]
    },
    {
        "word": "Foiz Stavkasinin G Real Darajasi",
        "type": [],
        "definition": [
            "inflyatsiya darajasiga to'g'rilangan pulda ifodalangan foiz stavkasini inflyatsiya darajasiga muvofiqlashtirish. Masalan, qarz beruvchi (kreditor) bergan puli miqdoriga 5% stavkasini belgilashi mumkin, ammo kutilayotgan inflyatsiya darajasi yiliga 10% ga teng bo'lsa, unda foiz stavkasining real darajasi 15% ni tashkil etadi."
        ]
    },
    {
        "word": "Foiz Toʻlovlari",
        "type": [],
        "definition": [
            "bir institutsion birlik ikkinchi institutsion birlikka o'z mablag'larini vaqtinchalik qarzga berganda yuzaga keladi. Odatda, bu qarzlar tijorat kreditlari, qisqa, o'rta va uzoq muddatli kreditlar, moliyaviy lizing operatsiyalari ko'rinishida bo'ladi."
        ]
    },
    {
        "word": "Foiz Xavf-Xatari",
        "type": [],
        "definition": [
            "foiz stavkalarining darajasi va harakatining o'zgarishi natijasida zarar ko'rish xavfidir."
        ]
    },
    {
        "word": "Foizlar Koʻrinishidagi Daromadlar",
        "type": [],
        "definition": [
            "deganda boshqa yuridik shaxslarga berilgan qarzlar va kreditlar uchun hisoblangan foizlar tushuniladi."
        ]
    },
    {
        "word": "Fond",
        "type": [],
        "definition": [
            "korxonalar o'zaro harakatining yangi shakli, xo'jalik uyushmasining o'ziga xos turi. Moliya instituti sifatida vujudga kelib, fondlar u yoki buxo'jalikloyihalarini moliyalashtirish bilan chegaralanib qolmaydi va uning tashkilotchisi sifatida maydonga chiqadi. Fondlar tasis etuvchilarning mo'ljallangan dasturlarini tashkil etish va boshqarish maqsadini ko'zlaydi."
        ]
    },
    {
        "word": "Fond Bilan Qurollanish Darajasi",
        "type": [],
        "definition": [
            "ishlab chiqarish fondlarining umumiy qiymatini ishlab chiqarishda band bo'lgan o'rtacha ishchilarning umumiy soniga bo'lgan nisbatida ifodalanadi. Jonli mehnatning ishlab chiqarish fondlari bilan qurollanish darajasi mehnat unumdorligini oshirishning asosiy manbayi hisoblanadi."
        ]
    },
    {
        "word": "Fond Bilan Taʼminlanish",
        "type": [],
        "definition": [
            "ishlab chiqarish tarmoqlari va korxonalarni ishlab chiqarish birliklarini ishlab chiqarish fondlari bilan ta’minlanish darajasini bildiradi. U ishlab chiqarilgan umumiy mahsulot qiymatining bir so'miga qancha so'mlik ishlab chiqarish fondi to'g'ri kelishi bilan ifodalanadi."
        ]
    },
    {
        "word": "Fond Birjasi",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti va kapital bozorining muhim elementi. Fond birjasida bozor bahosi asosida qimmatbaho qog'ozlar, ya’ni hissadorlik kompaniyalari aksiyalari va obligatsiyalari, shuningdek, davlat zayomlarining obligatsiyalari erkin sotiladi va sotib olinadi: dividend va foizlar miqdori, talab va taklif o'rtasidagi nisbat ssuda foizi va darajasiga qarab qimmatli qog'ozlar kursi (bozor narxi) belgilanadi. FB ning asosiy vazifalari quyidagilardan iborat: vaqtincha bo sh mablag'Iarga qimmatbaho qog'ozlar sotib olib, ularni muomalaga kiritish, qimmatbaho qog'ozlarningbozor narxini aniqlash; turli tarmoqlar, korxonalar o'rtasidagi kapital aylanishini ta’minlash va boshqalar. Qimmatli qog'ozlar kursi harakatining umumiy ko'rsatkichi bu Dau-Djons indeksi hisoblanadi. U Nyu- York fond birjasidagi qimmatli qog'ozlar kursini o'zida aks ettiradi. O'zbekistonda 1994-yildan fond birjasi faoliyat ko'rsatmoqda."
        ]
    },
    {
        "word": "Fond Bozori",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar va boshqa moliyaviy vositalarning oldisotdi jarayonlari amalga oshiriluvchi maxsus tashkillashtirilgan bozor."
        ]
    },
    {
        "word": "Fond Operatsiyalari",
        "type": [],
        "definition": [
            "banklar tomonidan qimmatli qog'ozlarni xarid qilish va sotish, qimmatli qog'ozlarni garovga olib ssuda berish. FOND QAYTIMI - asosiy ishlab chiqarish fondlarining bir so'miga to'g'ri keluvchi mahsulot miqdori."
        ]
    },
    {
        "word": "Fond Samaradorligi",
        "type": [],
        "definition": [
            "ishlab chiqarish fondlaridan iqtisodiy foydalanish samaradorligini ifodalaydi. Fond samaradorligi, odatda, ishlab chiqarishda band bo'lgan ishlab chiqarish fondlarining bir so'miga natural ko'rinishda ishlab chiqarilgan mahsulot hajmida (masalan, kg) yoki ishlab chiqarilgan mahsulotning umumiy qiymatini so'mda asosiy ishlab chiqarish fondlarining umumiy qiymatiga bo'lgan nisbati bilan belgilanadi."
        ]
    },
    {
        "word": "Fond Sigʻimi",
        "type": [],
        "definition": [
            "fond qaytimiga teskari bo'lgan nisbat. Asosiy ishlab chiqarish fondlari o'rtacha qiymatining ishlab chiqarilgan mahsulot hajmiga nisbati sifatida hisoblanadi"
        ]
    },
    {
        "word": "Fondlar Bilan Taʼminlanganlik",
        "type": [],
        "definition": [
            "asosiy ishlab chiqarish fondlari bilan ta’minlanganlik ko'rsatkichi (asosiy ishlab chiqarish fondlarining korxonaning har bir xodimi yoki ishchisiga to'g'ri keluvchi hajmi)."
        ]
    },
    {
        "word": "Fondlar Aylanishi",
        "type": [],
        "definition": [
            "moddiy ashyoviy omillar qiymatining ishlab chiqarish va muomala sohalari orqali harakat jarayonidir."
        ]
    },
    {
        "word": "Forfeyting",
        "type": [],
        "definition": [
            "mol (tovarlar) yetkazib berish va xizmatlar ko'rsatish bo'yicha talablar qo'yish huquqini olish, ushbu talabga doir operatsiyalarni bajarish va uning inkasso qilish xatarini qabul qilishdir"
        ]
    },
    {
        "word": "Forobiy Abu Nasr Ibn Muhammad",
        "type": [],
        "definition": [
            "qomusiy olim. Arastuning izdoshi (Arastudan keyin ikkinchi muallim nomini olgan), xayoliy sotsializm asoschilaridan. 160 dan ortiq asaryozgan. Donishmand (ayni vaqtda diniy jamoa boshlig'i bo'lgan), hukmdor, tasarruf etuvchi, “saxovatli yurt” haqidagi ta’limotni rivojlantirdi (fozil davlat tarafdori)."
        ]
    },
    {
        "word": "Fors-Major",
        "type": [],
        "definition": [
            "yong'in, tabiiy ofat, urush, qamal kabi kutilmagan sharoitlarda tomonlardan qaysi bo'lsa ham o'z majburiyatlarini qisman yoki to'liq bajara olmay qolgan vaziyat. Ikki tomon ham bu haqda oldindan kelishib oladi."
        ]
    },
    {
        "word": "Forvard",
        "type": [],
        "definition": [
            "bitim imzolangandan ikki kun davr uchun keyingi valyuta yoki boshqa bitim bo'yicha hisob-kitoblar."
        ]
    },
    {
        "word": "Forvard Bitimi",
        "type": [],
        "definition": [
            "kelgusi bitimda belgilangan oldindan kelishilgan narx bo'yicha ma’lum miqdordagi ba’zi asosiy aktivlarni sotish, boshqa tomon esa sotib olish majburiyatiga muvofiq tuzilgan kelishuvlardir."
        ]
    },
    {
        "word": "Forvard Kurs",
        "type": [],
        "definition": [
            "asosiy qarz summasining ma’lum bir o'zgarmas qismiga nisbatan belgilangan vaqtda to'lanadigan foiz stavkasining hajmi tog'risidagi kelishuv bo'lib, u o'sha kundagi foiz stavkasidan past yoki yuqori bo'lishi mumkin."
        ]
    },
    {
        "word": "Forvard Operatsiyalari",
        "type": [],
        "definition": [
            "belgilangan muddatda, ammo ikki ish kunidan oshiq bo'lgan muddatda amalga oshiriladigan operatsiyalarga aytiladi. Amaliyotda forvard bitimlarini amalga oshirishning standart muddatlari uchraydi. Standart muddatlarga 1; 3; 6) 9; va 12 oylarni kiritish mumkin."
        ]
    },
    {
        "word": "Foyda",
        "type": [],
        "definition": [
            "l) biror kimsa yoki narsa uchun bo'ladigan naf, manfaat; 2) daromadning xarajatga nisbatan farqidan tashkil topgan summa, mablag', daromad; 3) qarzga berilgan puldan foydalanilganligi uchun qarzdordan qarz beruvchi (kreditor) oladigan qo'shimcha pul, haq. Balansdagi foyda korxonaning mahsulot (xizmat)larini, ortiqcha asosiy fondlar va boshqa mulklami sotishdan olinadi. Sotishdan tashqari operatsiyalardan olingan daromadlar (zarardan tashqari) ham shu ko'rsatkich tarkibiga qo'shiladi."
        ]
    },
    {
        "word": "Foyda Indeksi",
        "type": [],
        "definition": [
            "pul mablag'lari joriy kirimining investitsiya hajmiga nisbati bo'yicha investitsiya loyihasining jalb qilinishini tavsiflovchi nisbiy ko'rsatkich."
        ]
    },
    {
        "word": "Foyda Normasi",
        "type": [],
        "definition": [
            "ishlab chiqarilgan qiymat ko'rinishidagi foyda massasining ishlab chiqarish xarajatlariga bo'lgan nisbatining foizda ifodalanishiga aytiladi."
        ]
    },
    {
        "word": "Foyda Soligʻi",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyektlarning foydasidan olinib, budjetning muhim daromadlaridan biri hisoblanadi. Bu to'g'ri (bevosita) soliqdir. Uning summasi soliq to'lovchi korxonaning yakuniy moliyaviy natijalariga bog'liq bo'ladi. Moliya yilida soliq solinadigan foydaga ega bo'lgan yuridik shaxslar foyda solig'ini to'lovchilar hisoblanadi. Yalpi foyda bilan ma’lum chegirmalar o'rtasidagi farq sifatida hisoblangan foyda soliqqa tortish obyektidir. Foyda solig'i barcha soliqlar to'Iangandan so'ng korxona ixtiyoriga qolgan foyda hisobidan to'lanadi."
        ]
    },
    {
        "word": "Foyda Va Aralash Daromad",
        "type": [],
        "definition": [
            "yalpi qo'shilgan qiymatning bir qismi bo'lib, u ishlab chiqaruvchilar ixtiyorida ish haqi, ishlab chiqarish va import solig'ini to'Iagandan so'ng qoladi. Bu modda mulkdan olgan daromadni hisobga olmagan holda ishlab chiqarishdan olingan foyda yoki zarar summasini ifodalaydi. Bu uy xo' jaliklariga qarashli nokorporativkorxonalarda bu mulk egasi va tadbirkor daromadidan ajratib bo'lmaydigan mehnat uchun to'lovlar elementini ham o'z ichiga oladi. Shuning uchun u aralash daromad ham deyiladi."
        ]
    },
    {
        "word": "Foydadagi Ulushlar",
        "type": [],
        "definition": [
            "institutsion birlik ta’sischilarining korxona sof foydasidagi ulushi. Odatda, bu ulush miqdori shartnomaga asosan ajratiladi."
        ]
    },
    {
        "word": "Foydalanish (Ishlatish)",
        "type": [],
        "definition": [
            "mulk bo'lgan boylikni iqtisodiy faoliyatda qo'llab, xo'jalik jarayoniga kiritib, undan natija olish."
        ]
    },
    {
        "word": "Foydali Ish Koeffitsiyenti",
        "type": [],
        "definition": [
            "sistema (qurilma, mashina)ning energiyani o'zgartirish yoki uzatish effektivligi xarakteristikasi. Foydali ishga sarflangan energiyaning sistema olgan umumiy energiya miqdoriga nisbati bilan aniqlanadi."
        ]
    },
    {
        "word": "Foydali Model",
        "type": [],
        "definition": [
            "bu moslamaga taalluqli texnik yechim. Ishlab chiqarish vositalarining konstruktiv bajarilishi va iste’mol qilish predmetlari hamda ularning tarkibiy qismi foydali modellarga kiradi."
        ]
    },
    {
        "word": "Foydali Xizmat Muddati",
        "type": [],
        "definition": [
            "korxona aktivdan foydalanadigan vaqt davri yokikorxonaushbu aktivdan foydalanishdan olishni mo'ljallayotgan mahsulot (ishlar va xizmatlar) miqdori."
        ]
    },
    {
        "word": "Foydalilik-Risk",
        "type": [],
        "definition": [
            "bank xodimi o'zini ortiqcha risklardan saqlagan holda foyda me’yorini cheklashidir."
        ]
    },
    {
        "word": "Franchayz",
        "type": [],
        "definition": [
            "(frans. franchise - imtiyoz, erkinlik) - ma’lum shakllar, texnologiyalar yoki tashqi ko'rinishdan juda yaxshi foydalanishga bo'lgan huquq. Franchayzlar, odatda, davlat mulkidan foydalanish yoki kommunal xizmatlar ko'rsatish huquqini olish uchun hukumat organlari tomonidan va aniq vazifalar hamda aniq xizmatlardan foydalanish huquqini olish uchun xo'jalik subyektlari tomonidan beriladi. Franchayz haqidagi har bir shartnoma u amal qiladigan davrdagi muddatni, shuningdek, franchayz (foydalanish huquqidagi imtiyozlar beruvchi subyekt) va franchayzlar (mazkur imtiyozni oluvchi subyektlar)ning huquq va majburiyatlarini aniqlashtiradi."
        ]
    },
    {
        "word": "Franchayzer",
        "type": [],
        "definition": [
            "faoliyat ko‘rsatuvchi kichik firma yoki tadbirkorni o‘z tovarlari, reklama xizmati, texnologiyalari bilan ta’min etish vazifasini zimmasiga olgan yirik kompaniya."
        ]
    },
    {
        "word": "Franchayzi",
        "type": [],
        "definition": [
            "yirik kompaniyaga o'zining mahalliy shart-sharoitlar hisobga olingan menejerlik va marketing xizmatini taqdim etgan kichik firma."
        ]
    },
    {
        "word": "Franchayzing",
        "type": [],
        "definition": [
            "chet ellik sheriklar bilan birgalikda ish olib borish usuli; shartnoma asosida texnologiya egasi bo'lgan firmaning tijorat yoki sanoat bo'limlarini sotish bilan birga mahsulotni ishlab chiqarish va uni chet ellik hamkorlar bozorida sotishda bevosita ishtirok etishdan iborat. Bu quyidagicha namoyon bo'lishi mumkin: bosh kompaniya kichik korxonaga o'zining savdo belgisidan foydalanib, muayyan turdagi tovarlarni ishlab chiqarish va sotish huquqini beradi. Buning uchun unchalik katta haq olinmaydi, biroq asosiy firma imijiga putur yetkazmaslik sharti asos qilib olinadi."
        ]
    },
    {
        "word": "Franko",
        "type": [],
        "definition": [
            "savdo bitimlarida qo'llaniladi va mahsulotni yetib borish manziliga (franko-vagon, franko sklad) yetkazishni bildiradi. Franko qo'shimchasi ma’nosi sotuvchining sotilgan tovarni belgilangan manzilga o'z mablag'i hisobidan yetkazib berishini ifodalaydi."
        ]
    },
    {
        "word": "Franko-Joyning Turlari",
        "type": [],
        "definition": [
            "mol yetkazib beruvchi bilan xaridor o'rtasida tuzilayotgan shartnoma vaqtida franko-joy to'g'risida to'xtalib o'tiladi. Bunda mahsulotni ortib-jo'natish bilan bog'liq xarajatlarni mol yetkazib beruvchi o‘z zimmasiga oladi. Franko-joyning quyidagi turlari mavjud: franko-ombor mol yetkazib beruvchi, franko-stansiya jo'natish, belgilangan stansiyagacha franko-vagon, belgilangan stansiyagacha franko, franko-ombor xaridor."
        ]
    },
    {
        "word": "Franko-Ombor Mol Yetkazib Beruvchi",
        "type": [],
        "definition": [
            "bunda mahsulot ortibjo'natish bilan bog'liq barcha xarajatlarni mol yetkazib beruvchi korxona to'lov talabnomasiga qoshadi (ombordagi ortib-tushirish ishlari qiymati, temiryo‘1 tarifi va yetkazib berish hujjatlari)."
        ]
    },
    {
        "word": "Franko-Ombor Xaridor",
        "type": [],
        "definition": [
            "bunda mol yetkazib beruvchi ko'rsatilgan xarajatlardan tashqari xaridorning stansiyadagi ortib-tushirish ishlari, uning ombordagi va omboriga yetkazib berish ishlari bo'yicha xarajatlarni to'laydi (qoplaydi)."
        ]
    },
    {
        "word": "Franko-Shart",
        "type": [],
        "definition": [
            "asosan, ishlab chiqaruvchi yoki mahsulotlarni sotib oluvchi o'rtasidagi bitim bo'lib, bunga asosan ishlab chiqaruvchi yoki sotib oluvchi yukni ortish, tashish xarajatlari sotuvchi yoki sotib oluvchi zimmasiga yuklanishi ifodalanadi. Bu xarajatlar mahsulot bahosiga qo'shilishi yoki qo'shilmasligi ham belgilanadi"
        ]
    },
    {
        "word": "Franko - Stansiyajo ʼNatish",
        "type": [],
        "definition": [
            "bu shunday narxki, u mol yetkazib beruvchi to'lov-talabnomasining summasi, temiryo‘ 1 tarifi va mahsulotni vagonga ortish xarajatlari yig'indisidan iborat."
        ]
    },
    {
        "word": "Franko -Vag On",
        "type": [],
        "definition": [
            "ishlab chiqaruvchi yoki sotuvchiningmahsulotni vagonlarga, yuklashni o‘z zimmasiga olganligini ifodalaydi"
        ]
    },
    {
        "word": "Fraxt",
        "type": [],
        "definition": [
            "dengizyoki havo yo'llari orqali yukni tashishda to‘lanadigan haq. Ushbu haq tarif yoki yukni tashish to‘g‘risidagi shartnoma bo'yicha o'zaro kelishilgan narx asosida to'lanadi. Dengiz sug'urtasida yuklarni tashishda fraxt polisi yoziladi va fraxt qiluvchiga beriladi"
        ]
    },
    {
        "word": "Fraxt Bozori",
        "type": [],
        "definition": [
            "xalqaro miqyosda yuk tashish yoki foydalanish uchun kemalarni yollash; transport (kema) xizmatiningoldi-sotdiqilinishi, jahon tovar bozorining bir turi. Fraxt bozori moddiy shakldagi tovar emas, balki xizmatlashgan tovar bo'lmish transport xizmati bozoridir."
        ]
    },
    {
        "word": "Friksion Ishsizlik",
        "type": [],
        "definition": [
            "bir ishdan boshqa bir ishga o'tish bilan bog'liq bo'lgan vaqtinchalik ishsizlik"
        ]
    },
    {
        "word": "Fritreyderlik",
        "type": [],
        "definition": [
            "ingl. erkin savdo siyosati, proteksionizmga zid. Bu siyosatni bozor munosabatlariga o'tgan davlatlar tashqi savdoda qo'llaydilar"
        ]
    },
    {
        "word": "Fronting",
        "type": [],
        "definition": [
            "qabul qilib olingan riskni tegishli komissiya haqi evaziga to‘ laligicha boshqa sug'urta yoki qayta qayta sug'urtalovchi kompaniyalarga berish."
        ]
    },
    {
        "word": "Frontlashtiruvchi Kompaniya",
        "type": [],
        "definition": [
            "boshqa sug'urta kompaniyasining iltimosiga ko'ra, o'z nomidan sug'urta polisi beruvchi sug'urta kompaniyasi. Frontlashtiruvchi sug'urta kompaniyasi qabul qilib olingan riskni yuz foiz miqdorida iltimos qilgan sug'urta kompaniyasi hisobiga o'tkazadi va buning uchun undan komission haq oladi. HozirgipaytdaO'zbekistonda bir nechta frontlashtiruvchi kompaniyalar faoliyat ko'rsatmoqda. Masalan, “Anglo-Tashkent”, “UzAIG” sug'urta kompaniyalari."
        ]
    },
    {
        "word": "Fundamental Tahlil",
        "type": [],
        "definition": [
            "tovar ichki xususiyatlarini o'rganishga asoslangan moliyaviy tahlil usuli"
        ]
    },
    {
        "word": "Funksional Bogʻlanish",
        "type": [],
        "definition": [
            "bu shunday to'liq bog'lanishki, unda bir belgi yoki belgilar o'zgarish qiymatiga har doim natijaning ma’lum me’yorda o'zgarishi mos keladi."
        ]
    },
    {
        "word": "Funksional Jihatdan Inson Resurslarini Boshqarish",
        "type": [],
        "definition": [
            "kadrlar sohasidagi ishlar bilan bog'liq bo'lgan barcha vazifa va qarorlar (masalan, kadrlarni tanlash, malakasini oshirish, ulardan foydalanish va hokazolar)dan iborat."
        ]
    },
    {
        "word": "Funksional Loyiha",
        "type": [],
        "definition": [
            "firmaning har xil funksional bo'limlari ishchilari guruhiga asoslangan loyihani amalga oshirishga yo'naltirilgan tashkiliy tizim hisoblanadi. Bunday guruh vakillari o'z funksional bo'limlari ishchilari bo'lib qolaveradi va odatda, bevosita loyiha ustida ishlash uchun o'zining butun ish vaqtini bag'ishlamaydi"
        ]
    },
    {
        "word": "Funksional Moliyalashtirish",
        "type": [],
        "definition": [
            "budjet siyosatini ishlab chiqish konsepsiyasi. Uning asosida budjet emas, balki iqtisodiyot muvozanatlashtirilishi zarur, degan qoida yotadi. Bunda makroiqtisodiy barqarorlik davrida budjet ijobiy saldoga ega bo'lishi zarur degan fikr ilgari suriladi. Zero, iqtisodiy o'sish sharoitida budjetga soliqlar tushumi avtomatik ravishda ko'payadi, makroiqtisodiy barqarorlik esabuni rag'batlantiradi. Demak, budjet kamomadi avtomatik ravishda o'z-o'zidan yo'q bo'ladi. Undan tashqari, davlatning soliqlarni belgilash huquqi va pullarni vujudga keltira olish sharoitida uning budjet kamomadini moliyalashtirish imkoniyatlari amaliy jihatdan cheksizdir."
        ]
    },
    {
        "word": "Fuqarolar Iqtisodiy Erkinligi",
        "type": [],
        "definition": [
            "fuqarolarning o'z ixtiyoriga ko'ra iqtisodiy faoliyat bilan shug'ullanish erkinligi. Fuqarolar iqtisodiy erkinligining asosi ularning mulk egasi bo'lishidir. Mulksiz fuqaro erkin emas, u qaram, mustaqil faoliyat yurita olmaydi. Iqtisodiy erkinlik fuqarolar ish kuchi va ishlab chiqarish vositalarining egasi bo'lishi hamda o'z mehnati mahsulini o'zi o'zlashtirishini taqozo etadi. Bunday sharoitda esa fuqarolar o'z qobiliyatiga yarasha mehnat faoliyatini tanlashda, daromadlarini ishlatishda, xohlagan tovami iste’mol qilishda mustaqil bo'ladilar. Fuqaro o ‘z iqtisodiy erkinligini ta’minlashi uchun nafaqat mulkiy munosabatda, balki bozor munosabatida o‘z o'rnini topishi kerak."
        ]
    },
    {
        "word": "Fuqarolarning Yillik Jami Daromadi",
        "type": [],
        "definition": [
            "ularning korxonada olgan pul va natural ko'rinishdagi barcha to'lanmalaridan iborat. Xorijiy valyutada olingan fuqarolarning daromadi soliqqa tortish maqsadlari uchun daromad olingan kundagi Markaziy bankning kursi bo'yicha milliy valyutada aniqlanadi. Fuqarolarning yillik jami daromadi tarkibiga (soliqqa tortish maqsadlari uchun) quyidagilar kiritilmaydi: pensiyalar; davlat ijtimoiy nafaqalari (vaqtinchalik mehnat qobiliyatini yo'qotganligi uchun nafaqalardan tashqari); kompensatsion to'lanmalar; moddiy yordam ko'rsatish summalari (tabiiy ofat munosabati bilan); davlat zayomi obligatsiyalari va lotereyalari bo'yicha yutuqlar; banklar va boshqa kredit tashkilotlaridagi omonatlar bo'yicha foizlar va boshqalar."
        ]
    },
    {
        "word": "Fure Fransua Mari Sharl",
        "type": [],
        "definition": [
            "Fransiya xayoliy sotsializm vakilij kelajakni sinfsiz ko'rgan, uningcha, jamiyat ishlab chiqarish birlashmalari - falangalardan iborat."
        ]
    },
    {
        "word": "Fyuchers",
        "type": [],
        "definition": [
            "qimmatbaho qog'ozlarni, valyuta yoki tovarlarni belgilangan narx va kelajakdagi belgilangan muddatda sotish yoki sotib olish borasidagi bajarilishi majbur bo'lgan qisqa muddatli standart shartnomalardir."
        ]
    },
    {
        "word": "Fyuchers Bitimi",
        "type": [],
        "definition": [
            "hali ishlab chiqarilmagan tovarlar namunasi bo‘yicha tuziladigan fyuchers bitimi shartnomasi maklerlar tomonidan ko‘p marta olib sotiladi."
        ]
    },
    {
        "word": "Fyuchers Operatsiyalari",
        "type": [],
        "definition": [
            "birjalarda amalga oshiriladigan savdosotiq operatsiyalari. Bu operatsiyalar shartnoma tuzilganidan so'ng ishlab chiqariladigan yoki yetishtirib beriladigan mahsulotlar bo'yicha amalga oshiriladi. Odatda, ushbu shartnoma tuzilgandan so'ng buyurtmachi bajaruvchiga avans tariqasida ma’lum summani o'tkazib beradi."
        ]
    },
    {
        "word": "Fermer Xojaligi",
        "type": [],
        "definition": [
            "ijaraga berilgan yer uchastkalaridan foydalangan holda qishloq xo'jaligi tovar ishlab chiqarishi bilan shug'ullanuvchi mustaqil xo'jalik yurituvchi subyekt"
        ]
    }
]