[
    {
        "word": "Gaaga Qoidasi",
        "type": [],
        "definition": [
            "paroxod egalarining mintaqalararo yuk tashishda rioya qilishi kerak bo'Igan qoidalar"
        ]
    },
    {
        "word": "Gaap",
        "type": [],
        "definition": [
            "(Generally accepted accounting principles), GAAP - buxgalteriya hisobining AQShda umum qabul qilingan qoida va tamoyillari."
        ]
    },
    {
        "word": "Gantt Grafiki",
        "type": [],
        "definition": [
            "bu loyihaning har bir ishining boshlanish va tugatilish vaqti, ushbu loyihaning barcha ishlari bajarilishining ketma-ketligi ko'rsatilgan grafikdir"
        ]
    },
    {
        "word": "Gap",
        "type": [],
        "definition": [
            "tovar bahosining keskin tushishi (bunda minimal baho joriy maksimal bahodan yuqori bo'ladi) yoki keskin ko'tarilib ketishi (bunda maksimum baho minimal joriy bahodan past bo'ladi)."
        ]
    },
    {
        "word": "Garant",
        "type": [],
        "definition": [
            "kafolat beruvchi, kafil shaxs; garant. Kafolat beruvchi sifatida davlat va uning tashkilotlari, banklar, korxonalar va firmalar bo'lishi mumkin"
        ]
    },
    {
        "word": "Garantiya (Kafolat)",
        "type": [],
        "definition": [
            "boshlangan ishning mauvaffaqiyatli yakun topishini ta’minlay oladigan omillar va shart-sharoitlar; omadsizlik ro'y beradigan ehtimol mavjud bo'lganda amalga oshiriladigan ishning muvaffaqiyatli yakun topishini kafolatlab, mas’uliyatning o'z zimmasiga olinishi. Kontrakt tuzuvchi tomonlar, masalan, kontraktning bajarilishiga, agar bajarilmasa, zararlarni qoplashga kafillik beradi."
        ]
    },
    {
        "word": "Garantiyalik Majburiyati",
        "type": [],
        "definition": [
            "ishonchli, kafolatli majburiyat; qarzdordan olinishi lozim bo'Igan summaning vaqtida to'lanishini ta’minlash uchun kreditorga berilgan kafolat."
        ]
    },
    {
        "word": "Garov",
        "type": [],
        "definition": [
            "1. Olingan qarz evaziga yoki majburiyatning, va’daning bajarilishiga ishontirish uchun qoldirilgan omonat. 2. Savdo va tijorat ishlarini amalga oshirish hamda banklardan naqd pul bilan kredit olish vaqtida ko'char yoki ko'chmas mulkni vaqtincha qarz beruvchi ixtiyorigaberish. Bu garoy shahodatnomasi orqali rasmiylashtiriladi. Garov shahodatnomasi mol-mulk qarzdor tomonidan garovga qo'yilganligi haqidagi hujjatdir."
        ]
    },
    {
        "word": "Garov Shahodatnomasi",
        "type": [],
        "definition": [
            "savdo va tijorat operatsiyalarini amalga oshirish uchun foydalanishi mumkin Ьо' lgan mol-mulkning qarzdor tomonidan garovga qo'yilishi haqidagi kredit hujjatidir."
        ]
    },
    {
        "word": "Garovxona",
        "type": [],
        "definition": [
            "qimmatbaho buyumlar yoki ko'chmas mulklarni ma’lum foiz hisobiga muayyan muddatga garovga olib, naqd pul bilan qarz beruvchi muassasa."
        ]
    },
    {
        "word": "Gastarbayter",
        "type": [],
        "definition": [
            "chet ellik ishchi."
        ]
    },
    {
        "word": "Gatt",
        "type": [],
        "definition": [
            "1. Savdo va tariflar bo'yicha bosh kelishuv - tashqi savdo operatsiyalarini o'tkazishda belgilangan tamoyillarga amal qilishga rozi bo'lgan mamlakatlarni birlashtiruvchi savdo va tarif masalalari bo'yicha xalqaro akt. 2. Savdo va tariflar qo'yish bo'yicha xalqaro bosh uyushma. U 1947-yili 23 ta davlat o'rtasida tuzilgan bo'lib, hozirda unga 100 ga yaqin davlat a’zo. Uning kengashi va kotibiyati Jenevada joylashgan"
        ]
    },
    {
        "word": "Geoekonomika",
        "type": [],
        "definition": [
            "yangi amaliy fan bo'lib, u davlatning konkret holdagi xalqaro miqyosdagi iqtisodiy strategiyasi va taktikasini o'rganadi. Geoekonomika siyosiy-iqtisodiy, geografikmuammolarni o'rganadi. Bu atama 1980-yillarda dastlab AQSHda ishlatilgan."
        ]
    },
    {
        "word": "Gerb Soligʻi",
        "type": [],
        "definition": [
            "turli xildagi tadbirkorlik bitimlari, kompaniyalarni qayd etish yoki uning aksionerlik kapitalini oshirish, ijara to'g'risidagi shartnoma va boshqalarni rasmiylashtiruvchi hujjatlar uchun soliq."
        ]
    },
    {
        "word": "Gildebrand Bruno",
        "type": [],
        "definition": [
            "nemis iqtisodchisi, iqtisodiy hodisalarni tadqiq qilishning o'z tarixiy usulini ilgari surdi (natura, pul, kredit). Uningcha, qiymat - foydalilik bo'lib, xususiy mulk abadiydir."
        ]
    },
    {
        "word": "Giperinflyatsiya",
        "type": [],
        "definition": [
            "haddan tashqari inflyatsiya, narxning shiddat bilan o'sishi, pul qadrining g'oyat tez pasayishi. Inflyatsiyaning oylik darajasi 50% dan ortishi vabuholat 6 oydan ortiq davom etishi uning giperinflyatsiya darajasiga o'tganligini anglatadi. Giperinflyatsiya sharoitida narx-navoni mutlaqo tartibga solib bo'lmaydi. Giperinflyatsiya narxlar oyiga 1,5 barobar oshganda vujudga keladi. Bu hoi, o'z navbatida, moliyaviy tizimdagi beqarorlikka, pul muomalasining izdan chiqishiga, qaror topgan iqtisodiy munosabatlarning buzilishiga, jamiyatda tanglik o'sib borishiga olib keladi."
        ]
    },
    {
        "word": "Gipoteza",
        "type": [],
        "definition": [
            "ilmiy bilimlar rivoji, hodisalarning kelib chiqish sababi, xossalari va ularning amal qilishini tushuntirish maqsadida ilgari suriladigan, asoslangan tasawurlardan iborat bo'lgan shakldir. Gipoteza orqali bilimlarning rivojlanishi 2 bosqichda amalga oshadi: 1. Gipotezani qurish. 2. Gipotezani tekshirish. Gipotezani qurish mavjud ma’lumotlarni tahlil qilish, ularni taqqoslash va ular o'rtasidagi bog'lanishlarni aniqlash hamda ularni tahlil qilish asosida amalga oshadi. Gipotezani tekshirish gipotezadan kelib chiqadigan natijalarni umumiylikka tatbiq etib (deduksiya), ularni hodisalarning haqiqiy holati bilan taqqoslash orqali amalga oshadi."
        ]
    },
    {
        "word": "Global Moliyaviy-Iqtisodiy Bozor",
        "type": [],
        "definition": [
            "jahon mamlakatlari o'rtasidagi moliyaviy-iqtisodiy aloqalarni yagona xo'jalik tarzida amal qilishiga asoslangan munosabatlar"
        ]
    },
    {
        "word": "Global Muammolar",
        "type": [],
        "definition": [
            "olamshumul ahamiyatga ega bo'lgan va o'z yechimini topishida jahondagi barcha mamlakatlarningbirgalikdagi harakatlarini talab etuvchi sivilizatsiyamizning eng dolzarb masalalari"
        ]
    },
    {
        "word": "Globallashish",
        "type": [],
        "definition": [
            "butun yer sharini qamrab oluvchi va innovatsiyalar tomonidan pul sarmoyasi aloqalarini mustahkamlash maqsadida jahon bozorida faol harakat qiluvchi yangi aqliy-axborot texnologiyalardan tashkil topgan universal jarayondir."
        ]
    },
    {
        "word": "Global Moliyaviy-Iqtisodiy Bozor",
        "type": [],
        "definition": [
            "jahon mamlakatlari o'rtasidagi moliyaviy-iqtisodiy aloqalarni yagona xo'jalik tarzida amal qilishiga asoslangan munosabatlar"
        ]
    },
    {
        "word": "Gollandcha Auksion",
        "type": [],
        "definition": [
            "auksionda stavka yuqoridan pastga tovar sotilgunga qadar pasayib boradi."
        ]
    },
    {
        "word": "Gomer",
        "type": [],
        "definition": [
            "“Iliada” va “Odisseya” asarlarida natural xo'jalik konsepsiyalarini ilgari surgan."
        ]
    },
    {
        "word": "Gonorar-",
        "type": [],
        "definition": [
            "muallifyoki uning merosxo'rlariga ilm, fan va madaniyat sohasidagi chop etgan ilmiy ishlari uchun mukofot tarzida beriladigan haq; muallifga beriladigan qalam haqi."
        ]
    },
    {
        "word": "Gorizontal Birlashuv",
        "type": [],
        "definition": [
            "bir xil mahsulotlar yoki bir xil xizmatlar ko'rsatuvchilarning birlashuvi."
        ]
    },
    {
        "word": "Gorizontal Diversifikatsiya",
        "type": [],
        "definition": [
            "firma assortimentini ayni paytda ishlab chiqarilayotgan mahsulotlar bilan bog'liq bo'lmagan, biroq mijozlar qiziqishini uyg'otishi mumkin bo'lgan mahsulotlar bilan to'ldirish."
        ]
    },
    {
        "word": "Gorizontal Diversifikatsiya",
        "type": [],
        "definition": [
            "ilgari ishlab chiqarilgan mahsulot xiliga texnologik aloqasi bo'lmagan yangi mahsulotlarni ishlab chiqarish."
        ]
    },
    {
        "word": "Gorizontalmarketing Tizimi",
        "type": [],
        "definition": [
            "kanalningbir pog'onasida (bo'g'inda) faoliyat ko'rsatadigan korxonalarning birlashishi natijasida hosil bo'lgan tovar tarqatish tizimi."
        ]
    },
    {
        "word": "Gorizontal Tahlil",
        "type": [],
        "definition": [
            "o'tgan davrdagi yoki hisobot davrida tasdiqlangan smeta xarajatlari o'rtasidagi farqlarni aniqlash usuli."
        ]
    },
    {
        "word": "Grafik (Chizma) Usuli",
        "type": [],
        "definition": [
            "zararsizlikningiqtisodiy vabuxgalteriya modulini tuzish uchun asos bo'ladigan daromad, xarajatlar va foyda haj mining ishlab chiqarish hajmiga bog'liq bo'lishi."
        ]
    },
    {
        "word": "Grant",
        "type": [],
        "definition": [
            ". Davlatlar, davlatlar hukumatlari,xalqaro va chet elhukumatiga qarashli tashkilotlar tomonidan, shuningdek, O'zbekiston Respublikasi Hukumati belgilaydigan ro'yxatga kiritilgan xalqaro va chet el nohukumat tashkilotlari tomonidan O'zbekiston Respublikasiga, O'zbekiston Respublikasi Hukumatiga, fuqarolarning o'zini o'zi boshqarishorganlariga,yuridikvajismoniyshaxslargabeg'arazasosda beriladigan mol-mulk, shuningdek, chet el fuqarolari va fuqaroligi bo'lmagan shaxslar tomonidan O'zbekiston Respublikasiga hamda 0 ‘zbekiston Respublikasi Hukumatiga begaraz asosda beriladigan mol-mulk. 2. Ilmiy izlanishlar, o'qish, davolanish kabi maqsadlarda korxona, tashkilot va jismoniy shaxslarga pul shaklida yoki boshqa ko'rinishda beg'araz beriladigan subsidiya. Grantlar innovatsion xarakterdagi ishlarni maqsadli-imtiyozli moliyalashtirishdir. Soliqqa tortish maqsadlari uchun “grant” atamasi ishlatilganda, xorijiy xayriya tashkilot (fond)lari tomonidan korxona va tashkilotlarga pul yoki natural shaklda ilmiy-tadqiqot, tajriba-konstruktorlik ishlarini, o'qitish, davolash va boshqa shunga o'xshash maqsadlarni amalga oshirish uchun ulardan foydalanilganligi to'g'risida hisobot berish sharti bilan beriladigan mablag'lar tushuniladi. Grant mablag'lari qat’iy maqsadli tayinlanishi bo'yicha foydalaniladi."
        ]
    },
    {
        "word": "Grossbux",
        "type": [],
        "definition": [
            "buxgalteriya hisobida bosh kitob."
        ]
    },
    {
        "word": "Guan-Szi",
        "type": [],
        "definition": [
            "(m.a. IV asr) - Xitoydagi ijtimoiy-iqtisodiy asar. Unda xo'jalikni davlat tomonidan tartibga solish tizimlari mukammal yoritilgan. GUDVTL - (ing. goodwill) nomoddiy aktivbo'lib, korxonanixarid qilish chog'ida yuzaga keladi va sotib olinadigan korxona uchun haq hamda uning sof (majburiyatlarini chegirgan holdagi) aktivlarining baholovchi (bozor) qiymati o'rtasidagi farqni bildiradi."
        ]
    },
    {
        "word": "Gumanizm (Insonparvarlik)",
        "type": [],
        "definition": [
            "1. Insonning qadr-qimmatini yuqori qo'yishga asoslangan qarashlar majmuyi. 2. Shaxsning har tomonlama kamol topishi, uning qadr-qimmati va huquqi hamda erkini himoya qilishga asoslangan ta’limot."
        ]
    },
    {
        "word": "Guruh Samaradorligi",
        "type": [],
        "definition": [
            "guruhning umumiy maqsadlarini amalga oshirish darajasidir."
        ]
    },
    {
        "word": "Guruh Samaradorligining Asosiy Omillari",
        "type": [],
        "definition": [
            "bularga guruh hajmi tarkibi, ma’lumotlar topshirig'i, tashqi muhit, rahbarlik uslubi, jarayonlar va tadbirlar, o'zaro ta’sir usullari, sabab, maqsadni amalga oshirish, guruhning qiziqishi kiradi."
        ]
    },
    {
        "word": "Guruh Texnologiyasi Prinsipi Boʻyicha Uskuna Joylashishi -",
        "type": [],
        "definition": [
            "bunda har hil uskunalar ishlanish uslublari o xshash bo'lgan mahsulotlar to‘liq tayyorlanadigan ish markazlari yoki texnologik kataklarga guruhlanadi. Bunday joylashish uyali joylashish deb ham ataladi."
        ]
    },
    {
        "word": "Guruhning Maqsadi",
        "type": [],
        "definition": [
            "shaxsiy maqsadlarning bir-biriga mos kelishi va o'zaro harakatlar induktoridir"
        ]
    },
    {
        "word": "Garov",
        "type": [],
        "definition": [
            "olingan qarz evaziga yoki majburiyatning, va’daning bajarilishiga ishontirish uchun qoldirilgan omonat."
        ]
    },
    {
        "word": "Garov Shahodatnomasi",
        "type": [],
        "definition": [
            "savdo va tijorat operatsiyalarini amalga oshirish uchun foydalanishi mumkin bo'lgan mol-mulkning qarzdor"
        ]
    }
]