[
    {
        "word": "Had Dan Ortiqtalab",
        "type": [],
        "definition": [
            "mavjud sharoitda bunday talabni to'la qondirish imkoniyatlari bo'lmaydi"
        ]
    },
    {
        "word": "Hadya",
        "type": [],
        "definition": [
            "fuqarolik huquqida bir shaxsning ikkinchi shaxsga mulkini tekin berishi"
        ]
    },
    {
        "word": "Hamkorlik Munosabatlari Marketingi",
        "type": [],
        "definition": [
            "transaksiyalarga nisbatanmijozlarbilanuzoqmuddatli,o‘zarofoydalimunosabatlarga ko'proq e’tibor qaratish. Kompaniyalar eng foydali iste’molchilar, mahsulotlar va kanallar bilan faoliyat yuritadi"
        ]
    },
    {
        "word": "Hamkorlikdagi Tadbirkorlik Zonal Ari",
        "type": [],
        "definition": [
            "hamkorlikda tadbirkorlik faoliyati olib borish uchun tashkil etilgan zonalar. Bunday zonalarda alohida imtiyozlar bojxona, ijara, soliq, valyuta va mehnat rejalari bo'yicha belgilangan bo'lib, xorij kapitalini investitsiyalashtirish uchun shart-sharoitlar yaratib beradi. Tashqi iqtisodiy faoliyatni xorij investitsiyalari, yangi texnika va texnologiyalarni jalb etish, import texnika sotib olish xarajatlarini qisqartish, milliy buyumlaming raqobatbardoshliligini oshirish maqsadida tashkil etiladi."
        ]
    },
    {
        "word": "Haqiqiy (Real) Tovar",
        "type": [],
        "definition": [
            "sifat darajasi, xossalar to'plami, o'ziga xos shakli, bezatilishi, nomi, o'ramiga ega bo'lgan aniq tovar"
        ]
    },
    {
        "word": "Haqiqiy Ehtiyoj",
        "type": [],
        "definition": [
            "ma’lum paytda yaxshi anglangan, aniq va qondirish mumkin bo'lgan ehtiyoj."
        ]
    },
    {
        "word": "Haqiqiy Taklif",
        "type": [],
        "definition": [
            "ma’lum paytda bozorda haqiqatan bor tovarlar, ularning turlari va hajmi."
        ]
    },
    {
        "word": "Hlar Yilgi Asosda Muvozanatlantiruvchi Budjet",
        "type": [],
        "definition": [
            "budjet siyosatining konsepsiyalaridan biri. Davlat budjeti har yili muvozanatlashtirish lozim degan qoidalarga asoslanadi. Bu qoida asosida davlat budjetining muvozanatlantirilishi fiskal siyosatning samaradorligiga salbiy tasir etishi mumkin. Masalan, inflyatsiya sharoitida aholining daromadi oshib boradi. Bu esa avtomatik ravishda soliq tushumlarini ko'paytiradi. Hukumat daromadlarning xarajatlardan ortib ketishining oldini olishga harakat qiladi. Unda u soliq stavkasini pasaytirish yoki davlat xarajatlarini ko'paytirish yoki ularning ikkalasidan foydalanishi kerak bo'ladi. Buning natijasida inflyatsiyaning kuchayishi ro'y beradi."
        ]
    },
    {
        "word": "Harakatsiz Buyumga Xizmat Ko Rsatish Prinsipiboyicha Uskuna Joylashishi",
        "type": [],
        "definition": [
            "mahsulot butun ish jarayonida bir joyda qoladi, uskunalar esa zarurlik paydo bo'lganda shu joyga beriladi."
        ]
    },
    {
        "word": "Harbiy Kommunizm Siyosati",
        "type": [],
        "definition": [
            "(1918-1920) - Sovet davlatida qo'llanilgan, tovar-pul munosabatlari inkor etilgan, qat’iy taqsimot va to'la milliylashtirish hamda oziq-ovqat razvertkasi amalga oshirilgan, bir qancha ijtimoiy sohalar tekin bo'lgan (transport, elektr energiyasi, kommunal xizmatlar). Harbiy kommunizm davrida mamlakat og'ir inqirozga uchradi."
        ]
    },
    {
        "word": "Hayʼat",
        "type": [],
        "definition": [
            "komissiya, vositachilik, saylangan guruh"
        ]
    },
    {
        "word": "Hayot Sugurtasiga Bogʻliq. Boʻlmagan Sugʻurta Toʻlovlari",
        "type": [],
        "definition": [
            "joriy hisobot davrida to'lanishi lozim bo'lgan hayot sugurtasidan tashqari sug'urta poUsini tartibga solish tufayli to'lanadigan to'lovlar."
        ]
    },
    {
        "word": "Hayotni Sug Urta Qilish",
        "type": [],
        "definition": [
            "jismoniy shaxslarning hayoti, sog‘lig‘i, mehnat qobiliyati va pul ta’minoti bilan bog'liq manfaatlarini sug'urta qilish. Bunda shartnoma bo'yicha sug'urtaning eng kam muddati bir yilni tashkil etadi hamda sug'urta pullarining sug'urta shartnomasida korsatib otilgan oshirilgan foizni o‘z ichiga oluvchi bir martalikyoki davriy to'lovlari (annuitetlar)ni qamrab oladi."
        ]
    },
    {
        "word": "Hisob",
        "type": [],
        "definition": [
            "biror narsa mavjudligini belgilash, uni o'lchash va son hamda sifat tomonidan qayd etish. Hisob xo‘jalik faoliyati va ijtimoiy hayotning barcha jabhalari to g'risidagi doimiy axborot bilan ta’minlaydi. Jamiyatning ishlab chiqarish kuchlari rivojlanishi bilan hisob axborotlarining hajmi ortadi va jamiyat hamda xo‘ jalik jarayonlarini nazorat qilish va boshqarishda katta ahamiyatga ega bo'ladi. Shuning uchun hisobni yanada takomillashtirish zarur. O'zbekiston Respublikasida buxgalteriya hisobi, statistika hisobi va tezkor hisoblarni o‘z ichiga oluvchi yagona xalq xo'jaligi hisobi tashkil etilgan"
        ]
    },
    {
        "word": "Hisob-Kitob Operatsiyalari Boʻyicha Asoslovchi Testlar",
        "type": [],
        "definition": [
            "hisob-kitob operatsiyalarining moliyaviy hisobotlarda keltirilgan summalari to‘g‘ri (asosli) ekanligini tekshirishga yonaltirilgan testlar majmuyi."
        ]
    },
    {
        "word": "Hisob Palatasi",
        "type": [],
        "definition": [
            "mustaqil organ bo'lib, O'zbekiston Respublikasi Davlat budjeti va budjetdan tashqari maqsadli jamg'armalarning ijrosi, davlat aktivlari va passivlari holati hamda harakati, oltin-valyuta zaxiralari va tashqi qarzlarni boshqarish hamda tasarruf etish monitoringi va davlat nazoratini amalga oshiradi."
        ]
    },
    {
        "word": "Hisob Stavkasi (Qayta Moliyalash Stavkasl)",
        "type": [],
        "definition": [
            "Markaziy bank tijorat banklari veksellarini hisobga olishda va ularga kredit berishda qo'llaydigan foiz stavkasi"
        ]
    },
    {
        "word": "Hisobga Olish Registrlari",
        "type": [],
        "definition": [
            "investitsiya vositachisida va qimmatli qog'ozlar markaziy depozitariysida qimmatli qog'ozlami saqlash hamda qimmatli qog'ozlarga bo'lgan huquqlarni hisobga olish bo'yicha depozitar operatsiyalar standartlari bilan belgilangan yozuvlar tizimi."
        ]
    },
    {
        "word": "Hisob-Kitob Balansi",
        "type": [],
        "definition": [
            "shunday iqtisodiy kategoriyaki,bunda mamlakatning xorijiy davlatlarga nisbatan talab va majburiyatlarining umumiy summasi ko'rsatiladi"
        ]
    },
    {
        "word": "Hisob-Kitob Operatsiyalari",
        "type": [],
        "definition": [
            "korxona tomonidan yoki korxona ishtirokida hisob (moliya) yili davomida sodir etilgan operatsiyalar natijasida yuzaga kelgan debitorlik va kreditorlik qarzlarining so'ndirilishi."
        ]
    },
    {
        "word": "Hisob-Kitob Operatsiyalarida Nazorat Riski",
        "type": [],
        "definition": [
            "hisob-kitob operatsiyalariga nisbatan ichki nazorat riskining mavjud bo'lishi, ammo bu tizimning sifatsizligi sabab buxgalteriya tizimida hisobkitob operatsiyalarining noto'g'ri aks ettirilgan bo'lish xavfi."
        ]
    },
    {
        "word": "Hisob-Kitob Stavkasi Siyosati",
        "type": [],
        "definition": [
            "pul-kredit siyosatini amalga oshirish vositasi. Hisob-kitob stavkasini Markaziy bank belgilaydi. Agar u past bo'lsa, tijorat banklari ko'proqkredit oladi, natijadabanklarning ortiqcha bank rezervlari kamayadi, muomaladagi pul massasi ortadi. Hisob-kitob stavkasi darajasi yuqori bo'lsa, banklar kredit kamroq oladi, olganlarini esa qaytarib berishga harakat qiladi, natijada ortiqcha bank rezervlari ko'payadi, muomaladagi pul miqdori kamayadi."
        ]
    },
    {
        "word": "Hisoblangan Bosqich",
        "type": [],
        "definition": [
            "TMZ olish uchun kutilayotgan vaqtning oralig'i."
        ]
    },
    {
        "word": "Hisoblangan Koeffitsiyent",
        "type": [],
        "definition": [
            "TMZ qo'yilgan kapital summasining o'zgarishi natijasida har yillik zaxiralarga sarflanadigan xarajatlar summasini baholash maqsadida guruhning tejamli hajmini hisoblash va muhofaza zaxirasining muqobil o'sishini ta’minlash uchun foydalaniladigan formula natijasida aniqlangan ko'rsatkich"
        ]
    },
    {
        "word": "Hisobli Kredit",
        "type": [],
        "definition": [
            "vekselni tijorat bankiga sotish yo'li bilan olinadigan kreditdir."
        ]
    },
    {
        "word": "Hisobot Davri -",
        "type": [],
        "definition": [
            "iqtisodiy subyektning buxgalteriya hisoboti tuzish uchun lozim bo'lgan sana."
        ]
    },
    {
        "word": "Hissa (Pay)",
        "type": [],
        "definition": [
            "ma’lum faoliyatni olib borish uchun tashkil etilgan uyushma a’zolarining qo'shgan ulushi, hissasi"
        ]
    },
    {
        "word": "Hissadorlik Jamiyati",
        "type": [],
        "definition": [
            "kapitallarning shaxssiz (anonim) yig'ilishi asosidan iborat shaxslar, muassasalar, korxonalarning birlashuvi. U teng qismlarga bo'lingan asosiy kapital (aksiya yoki pay) bilan ta’sis etiladi. Hissadorlik jamiyati nizomida jamiyatning maqsadi, kapitalining miqdori, boshqaruv tartibi, rahbar organlar tarkibi va boshqa ma’Iumotlar qayd qilinadi. Hissadorlik jamiyatining oliy organi - hissadorlaming umumiy yig'ilishidir. Bu yig'ilish, odatda, bir yilda bir marta chaqiriladi. Hissadorlik jamiyatining kundalik joriy ishlarini boshqarma kuzatuvchilar va direktorlar kengashi boshqaradi."
        ]
    },
    {
        "word": "Hissadorlik Kapitali",
        "type": [],
        "definition": [
            "hissadorlik jamiyatining asosiy kapitali. U aksiyalar emissiyasi hisobiga tashkil topadi. U ustav kapitali, obuna kapitali, to'Iangan kapital turlariga bo'linadi"
        ]
    },
    {
        "word": "Homiy (Sponsor)",
        "type": [],
        "definition": [
            "ma’lum bir tadbir yoki faoliyatni amalga oshirish uchun moliyaviy yordam ko'rsatuvchi shaxs, firma yoki tashkilot."
        ]
    },
    {
        "word": "Hosildorlik",
        "type": [],
        "definition": [
            "bir birlik ekin maydoni (gektar, sotix va boshqa) hisobiga yetishtirilgan hosilning fizik miqdori."
        ]
    },
    {
        "word": "Hozirgi Zamon Iqtisodiy Taʼlimotlari",
        "type": [],
        "definition": [
            "uch asosiy yo'nalishi mavjud: 1. Neoklassik (yangi klassik); 2. Keynschilik; 3. Institutsional."
        ]
    },
    {
        "word": "Hududiy Bozor",
        "type": [],
        "definition": [
            "ma’lum hudud doirasida tovarlami oldi-sotdi qilish munosabatlari. Hududiy bozor mamlakat doirasidagi hududlar o'rtasida yoki bir necha chegaradosh davlatlar o'rtasida mehnat taqsimotining, binobarin, ishlab chiqarish, ixtisoslashuvining natijasi dir."
        ]
    },
    {
        "word": "Hududiy Mehnat Taqsimoti",
        "type": [],
        "definition": [
            "muayyan mamlakat doirasida ayrim hududlar yoki mintaqalardagi mehnatning ixtisoslashuvi. Har bir hudud doirasida ham ichki ixtisoslashuv yuz beradi."
        ]
    },
    {
        "word": "Hujjat Aylanishi",
        "type": [],
        "definition": [
            "hisob jarayonida hujjatlarni tuzish vaqtida ularni arxivga topshirishgacha bo'lgan hujjatlar harakati. Korxonalarning xo'jalik bo'limlari (boshqaruv bo'limi, ishlab chiqarish sexi, uchastka brigada va h.k.)da tuzilgan hujjatlar buxgalteriyaga topshiriladi. U yerda shaklan va mazmunan tekshiriladi, bir xillik belgilariga qarab guruhlanadi va hisob registrlariga yozilgandan song papkalarga tikilib, turli ma’lumotlar berish va turli tekshirishlar uchun foydalaniladi. Ilmiy-tarixiy ahamiyatga ega bo'lgan hujjatlar davlat arxiviga topshiriladi, qolganlari yo'q qilinadi. Har bir korxonada hujjatlarni tuzish kimga yuklatilganligi, kim kimga qaysi muddatda hujjatlarni taqdim etishi, hujjatlarning hisobda foydalanilishi ko'rsatiladi."
        ]
    },
    {
        "word": "Hujjat Bilan Tasdiqlangan Xarajatlar",
        "type": [],
        "definition": [
            "operatsiya sanasi, summasi va xususiyatini aniqlash hamda ishtirokchilarini identifikatsiya qilish imkonini beradigan hujjatlar bilan tasdiqlangan xarajatlar"
        ]
    },
    {
        "word": "Hujjatlar Asosidagi Nazorat Usullari",
        "type": [],
        "definition": [
            "rasmiy va arifmetik tekshirish, yuridik baholash, mantiqiy nazorat, muqobil tekshirish, teskari hisob usuli, balans uyg'unligini tekshirish, qiyoslash, hisobotlarning sanoq bahosi kabi usullar kiradi."
        ]
    },
    {
        "word": "Hujjatlashtirish",
        "type": [],
        "definition": [
            "korxona xo'jalik faoliyatini kuzatib borish, hisobga olinadigan xo'jalik operatsiyalarini nazorat qilish va aks ettirishning asosiy usulidir. Har bir xo'jalik operatsiyasi tegishli hujjatda rasmiylashtiriladi. Bu holat, odatda, operatsiyalar sodir bo'layotgan paytda amalga oshiriladi va hisobning boshlang'ich davri hisoblanadi. Hujjatlardan keyinchalik xo'jalik operatsiyalari haqidagi ma’lumotlarni guruhlashtirish va qayta ishlov berishda foydalaniladi. Hujjatlarda mansabdor mas’ul shaxslarning imzosi bo'lmasa, bunday hujjatlar haqiqiy hisoblanmaydi."
        ]
    },
    {
        "word": "Hukumat Korporatsiyasi",
        "type": [],
        "definition": [
            "davlat ixtiyoridagi korporatsiya bo'lib, u davlat ahamiyatiga ega bo'lgan tarmoqlarda tashkil etiladi va ularga xizmat ko'rsatadi."
        ]
    },
    {
        "word": "Huquqiy Shaxs",
        "type": [],
        "definition": [
            "fuqarolik subyekti sifatida faoliyat yurituvchi, mustaqil balans, gerbli muhr va bankda hisob-raqamiga ega, nizom asosida faoliyat yurituvchi hamda bankrotga uchraganda, o'z mulki bilan javob beruvchi korxona"
        ]
    }
]