[
    {
        "word": "I. Faktorlimodellar",
        "type": [],
        "definition": [
            "turli xil faktorlar ta’siri natijasida ko'rinadi. Bunday modellar ehtiyojlarni bashoratlash uchun ishlatilishi mumkin. FAKTURA - mahsulotlarni ishlab chiqarish korxonalari va iste’molchilar uchun sotishga tayyorlangan hujjat. Bu hujjatda mahsulotlarning nomlari, hajmi va narxlari ko'rsatilgan bo'ladi."
        ]
    },
    {
        "word": "Ibn Xaldun Abu Rahmon Abu Zayd",
        "type": [],
        "definition": [
            "arab olimi, “Ibratli misollar kitobi” (l370)da iqtisodiy g'oyalari jamlangan. Uning fikricha, “jamiyat moddiy qiymatlar ishlab chiqaruvchilar” jamoasidan iborat. Asarlarida moddiy zarurat tarixni harakatlantiruvchi asosiy kuch, mehnat unumdorligi, zaruriy va qo'shimcha mehnat, qiymat tushunchalari keltirilgan. 1401-yilda Amir Temur bilan uchrashgan. “Ijtimoiy fikr” jumalining (1998- yil) l-sonidalavhaberilgan."
        ]
    },
    {
        "word": "Ichki Audit",
        "type": [],
        "definition": [
            "iqtisodiy subyektda tashkil etilgan mulkdori manfaatlarini ko'zlab, uning tashkil etilgan va ichki hujjatlari bilan tasdiqlangan buxgalteriya hisobotini olib borishni nazorat qilish sistemasi."
        ]
    },
    {
        "word": "Ichki Auditor",
        "type": [],
        "definition": [
            "iqtisodiy subyekt tomonidan tashkil etilgan ichki bo'lim xodimi."
        ]
    },
    {
        "word": "Ichki Investitsiyalar",
        "type": [],
        "definition": [
            "bu mamlakat hududida ichki investorlar tomonidan amalga oshiriladigan investitsiyalar hisoblanadi."
        ]
    },
    {
        "word": "Ichki Mablag Larnijalb Qilish",
        "type": [],
        "definition": [
            "davlat tomonidan aktivlarni ichki manbalardan (rezident-yuridik va jismoniy shaxslardan) jalb etish hamda buning natijasida О ‘zbekiston Respublikasining qarz oluvchi sifatidagi yoki qarz oluvchi rezidentlarning o‘z kreditlarini to'lashiga kafil sifatidagi majburiyatlari yig'indisining vujudga kelishidir."
        ]
    },
    {
        "word": "Ichki Milliy Mahsulot",
        "type": [],
        "definition": [
            "bir yil davomida mamlakatda yuridik va jismoniy shaxslar tomonidan ishlab chiqarilgan pirovard mahsulot va xizmatlaming bozor bahosidagi qiymati."
        ]
    },
    {
        "word": "Ichki Nazorat Tizimi Boʻyicha Savolnoma",
        "type": [],
        "definition": [
            "mijoz korxona ichki nazorat tizimi sifatini tekshirish va baholash maqsadida tuzilgan maxsus ishchi qog'oz."
        ]
    },
    {
        "word": "Identifikatsiya Raqami",
        "type": [],
        "definition": [
            "tizim ichidagi obyektni aniqlaydigan kod yoki nom berilishidir. Ajratma, soliqlar va pensiya to lovlari boyicha axborotlarni markazlashtirish uchun individual ijtimoiy kodlarga ehtiyoj tug'iladi. Moliyaviy hujjatlashtirish bo'yicha moliyaviy axborotlar ishonchliligi va doimiyligini ta’minlash, shunungdek, xalqaro andozalarga mos keluvchi buxgalteriya hisobining yangi andozalari qo'llanilishi uchun individual ijtimoiy kodlarni qabul qilish taqozo etiladi."
        ]
    },
    {
        "word": "Ijara",
        "type": [],
        "definition": [
            "mustaqil xo'jalik yuritish yoki boshqa biror faoliyatni amalga oshirish maqsadida yer, suv, korxona va boshqa mulkka egalik qilish hamda vaqtincha foydalanish uchun to'lanadigan muayyan haq. Ijara mulkka egalik huquqini o'zgartirmaydi. Ijara obyektlari iste’mol qilinmaydigan har qanday buyumlar (ashyolar), shu jumladan, korxonalar, mulkiy komplekslar, alohida binolar, inshootlar, uskunalar, transport vositalari hamda boshqa ko'char va ko'chmas mulklar kiradi (muomaladan chiqarilgan yoki muomalada bo'lishi cheklangan boshqa mol-mulklar bundan mustasno)."
        ]
    },
    {
        "word": "Ijara (Lizing) Toʻlovi",
        "type": [],
        "definition": [
            "ijarachi (lizing oluvchi) tuzilgan ijara (lizing) shartnomasi asosida ijaraga beruvchiga (lizing beruvchiga) to'Iaydigan summa."
        ]
    },
    {
        "word": "Ijara Haqi",
        "type": [],
        "definition": [
            "ijara sharoitida (sharti bilan) taqdim etilgan mulk uchun to'lov turi. Asosiy fondlaming alohida obyektlari ijaraga olinganda, ular ijara shartnomasining butun amal qilish davomida teng hissalarda (qismlarda) mahsulot tannarxiga kiritiladi."
        ]
    },
    {
        "word": "Ijara Haqi (Toʻlovi)",
        "type": [],
        "definition": [
            "yerdan foydalanuvchi tomonidan bir yilda yer egasiga to'lanadigan pul miqdori."
        ]
    },
    {
        "word": "Ijaramulki",
        "type": [],
        "definition": [
            "shartnoma asosida ma’lum muddatga foydalanish uchun olingan mulk. Yer, uy-joylar, bino va inshootlar, mashina va uskunalar ijara mulki bo'lishi mumkin."
        ]
    },
    {
        "word": "Ijara Munosabatlari",
        "type": [],
        "definition": [
            "bunda ijarachi ijara beruvchidan shartnoma asosida ishlab chiqarish vositalari, yer va boshqa mol-mulklarni ma’lum bir muddatga ijara to'lovi asosida foydalanish uchun oladi. Ijara munosabatlarida ijara haqi muhim rol o'ynaydi va ijarachi bilan ijaraga beruvchi munosabatlarini keltirib chiqaradi. Ijaraning quyidagi turlari mavjud. Muddatiga ko'ra: - uzoq muddatli ijara - uch yil va undan ortiq muddatga; - o'rta muddatli ijara - bir yildan uch yilgacha bo'Igan muddatga. Qisqa muddatli ijara - bir yildan ortiq bo'lmagan muddatga. Mulkni topshirish shartiga ko'ra: moliyalashtirilgan, joriy."
        ]
    },
    {
        "word": "Ijara Shartnomasi",
        "type": [],
        "definition": [
            "ijarachi bilan ijaraga oluvchi o'rtasida tomonlarning teng huquqliligi asosida tuzilgan kelishuv, shartnoma. Ish quyidagilarni ko'zda tutadi: l) ijaraga olinayotgan mulk tizimi va qiymati; 2) ijara to'lovi miqdori; 3) ijaramuddati; 4) ijaraga berilgan mulkni ta’mirlash va to'la tiklash bo'yicha tomonlar majburiyati; 5) mulkni shartnomada kelishilgan holda ijarachiga yetkazish."
        ]
    },
    {
        "word": "Ijarachi",
        "type": [],
        "definition": [
            "biror narsani ijaraga olgan korxona, tashkilot va muassasa yoki jismoniy shaxs. Ijarachi shartnomada kelishilgan daqiqadan vaqtincha foydalanish huquqi (belgilangan muddatga)ni oladigan shaxs bo'lib, u buning uchun ijara beruvchiga ijara haqi to'laydi. Ijaraga oluvchi ijaraga beruvchi bilan kelishilgan holda olgan mulkini undan sotib olishi mumkin. Sotib olish tartibi va shartlari ijara shartnomasida belgilab qo'yiladi. Ijarachi yuridik shaxslar va mustaqil davlatlar hamkorligi (MDH), qo'shma korxonalar, xalqaro birlashma va tashkilotlar, shuningdek, xorijiy davlatlar, xalqaro tashkilodar, xorijiy yuridik shaxslar va fuqarolar ham bo'lishi mumkin."
        ]
    },
    {
        "word": "Ijaraga Beruvchi (Lizing Beruvchl)Ning Foizli Daromadi",
        "type": [],
        "definition": [
            "buxgalteriya hisobi to'g'risidagi qonun hujjatlariga muvofiq aniqlanadigan ijara (lizing) to'lovi summasi bilan ijara (lizing) obyektining qiymatini qoplash summasi o'rtasidagi farq ko'rinishidagi ijara (lizing) to'loviningbir qismi."
        ]
    },
    {
        "word": "Ijobiy Auditorlik Xulosasi",
        "type": [],
        "definition": [
            "auditorlik tashkilotining xo'jalik yurituvchi subyektning moliyaviy hisoboti uning haqiqiy moliyaviy ahvolini aks ettirishi va xo'jalik yurituvchi subyekt tomonidan amalga oshirilgan moliyaviy va xo'jalik operatsiyalari O'zbekiston Respublikasi qonun hujjatlariga muvofiqligi to'g'risidagi fikrini o'z ichiga olgan hujjat."
        ]
    },
    {
        "word": "Ijobiy Solishtirma Dalolatnomasi",
        "type": [],
        "definition": [
            "mijoz korxona va mijoz xaridorlari mol yetkazib beruvchilari o'rtasida amalga oshirilgan va ikki taraf buxgalteriya tizimida aks ettirilgan hisob-kitob operatsiyalari natijalarining auditor tomonidan inventarizatsiyasi bir xil ma’ lumotni aks ettirishi yoki muhim bo'lmagan farqning yuzaga kelishi"
        ]
    },
    {
        "word": "Ijtimoiy Dasturlar",
        "type": [],
        "definition": [
            "aholining bevosita turmush sharoiti va farovonligini ta’minlashga xizmat qiluvchi soha va tarmoqlarni rivojlantirishga oid chora-tadbirlarni o'z ichiga olgan rejaviy hujjatlar."
        ]
    },
    {
        "word": "Ijtimoiy Hamkorlik",
        "type": [],
        "definition": [
            "real mehnat munosabatlarini kollektiv shartnomani tuzish asosida tartibga solishning o'ziga xos turi. Bunda tuzilgan shartnoma asosida ish beruvchi shaxs va yollanma ishchining manfaatlari o'zaro muvofiqlashtiriladi."
        ]
    },
    {
        "word": "Ijtimoiy Himoya",
        "type": [],
        "definition": [
            "ayrim ijtimoiy guruhlarga har tomonlama yordam berish uchun yo'naltiriladigan davlat tadbirlari yig'indisi. Masalan, kompensatsiya, turli yengilliklar."
        ]
    },
    {
        "word": "Ijtimoiy Himoyalash Fondi",
        "type": [],
        "definition": [
            "jamiyat a’zolari o'rtasida mehnatga to'lanadigan haqdan tashqari va mehnat haqiga qo'shimcha ravishda bepul yoki imtiyozli ravishda taqsimlanadigan mablag bo'lib, milliy daromadning bir qismidir. Ijtimoiy himoyalash fondining bir qismi aholining kam daromadli, ishsiz qolgan qismini moddiy jihatdan qo'llab-quwatlab turishga, bir qismi qariyalar, ko'p bolali onalar, nogironlar, vaqtincha mehnatga layoqatsiz bo'lib qolganlar uchun nafaqa, talabalarga stipendiya, davolanish va dam olish maskanlariga bepul yoki imtiyozli yo'llanmalar tarzida aholiga to'lanadi. Boshqa bir qismi esa aholiga bepul maorif, tibbiy yordam ko'rsatish, bolalar bog'chalari, yaslilari, kutubxonalar, davolanish va dam olish maskanlarini qurish orqali aholi ehtiyojlari uchun sarflanadi. Ijtimoiy himoyalash nafaqalar to'lash bilan birga, ayrim tovar turlarini arzon baholarda sotishni yo'lga qo'yish, ayrim xizmat turlarini tekin yoki arzon baholarda ko'rsatish orqali amalga oshiriladi. Ijtimoiy himoyalash fondini shakllantirish davlat tomonidan zaruriy mahsulotning bir qismini aholi daromadlariga turli bilvosita va bevosita soliqlarni o'rnatish orqali umumlashtirish yo'li bilan amalga oshiriladi."
        ]
    },
    {
        "word": "Ijtimoiy Infratuzilma",
        "type": [],
        "definition": [
            "aholining turmush faoliyati, uning farovonligini ta’minlashga xizmat qiluvchi turli muassasa va obyektlar majmuyi. Masalan, ta’lim muassasalari, dam olish va davolanish maskanlari, uy-joy, kommunal va maishiy xizmat ko'rsatish shoxobchalari, tabiiy gaz, ichimlik suvi, elektr energiyasi ta’minoti, yo'lovchi transporti va boshqalar."
        ]
    },
    {
        "word": "Ijtimoiy Institut",
        "type": [],
        "definition": [
            "odamlarning birgalikdagi faoliyatini tashkiliy tuzilma tarzida tashkil etishning barqaror shakli yoki normativ jihatdan tartibga solinadigan qoidalar tizimidan iborat"
        ]
    },
    {
        "word": "Ijtimoiy Investitsiyalar",
        "type": [],
        "definition": [
            "inson salohiyati, malakasi va ishlab chiqarish tajribasini oshirishga, shuningdek, nomoddiy ne’matlarning boshqa shakllarini rivojlantirishga qo'shiladigan investitsiyalar."
        ]
    },
    {
        "word": "Ijtimoiy-Iqtisodiy Ehtiyojlar",
        "type": [],
        "definition": [
            "kishilarning yashashi, mehnat qilishi va ma’lum iqtisodiy mavqega ega bo'lishi uchun iste’mol etilishi zarur bo'lgan mahsulotlar va xizmatlar majmuyi. Bu faqat tirikchilik ehtiyoji emas, balki insonning shaxs sifatida kamol topish zarurati hamdir."
        ]
    },
    {
        "word": "Ijtimoiy Isteʼmol Fondlari",
        "type": [],
        "definition": [
            "maorif, sog'liqni saqlash, boshqaruv, mudofaa, ijtimoiy ta’minot, ijtimoiy sug'urta va boshqalar bo'lib, ularning asosiy qismi Davlat budjeti orqali amalga oshiriladi. IJTIMOIY IXTILOFLAR - kishilar, ijtimoiy guruhlar, idoralarning o'zaro munosabatlari tizimida ziddiyatlar rivojlanishining yuqori bosqichidan iborat."
        ]
    },
    {
        "word": "Ijtimoiy Jihatdan Yoʻnaltirilgan Bozor Munosabatlari",
        "type": [],
        "definition": [
            "ijtimoiy hayotning barcha sohalarida, ayniqsa, iqtisodiy munosabatlarni tartibga solishda davlat regulyativ funksiyalarining kuchli ifoda etilishi. Davlat siyosatida mamlakat aholisining ijtimoiy jihatdan himoyalanishiga alohida e’tibor beriladi."
        ]
    },
    {
        "word": "Ijtimoiy Marketing",
        "type": [],
        "definition": [
            "iste’molchilar zaruriyatlari, jamiyat omillari (atrof-muhitni asrash, salomatlik muhiti va b.) va mahsulot sifatini saqlab qolish asosida shakllanadi."
        ]
    },
    {
        "word": "Ijtimoiy Muhofaza Tizimi",
        "type": [],
        "definition": [
            "aholining hayotiy muhim manfaatlari sohasi bo'lib, uning sifat va miqdor ko'rsatkichlari davlat va jamiyatning iqtisodiy, huquqiy va madaniy rivojlanish darajasidan darak beradi."
        ]
    },
    {
        "word": "Ijtimoiy Muhofazalanish Huquqi",
        "type": [],
        "definition": [
            "odamning munosib turmush kechirishi uchun zarur bo'lgan hajmdagi fiziologik, ijtimoiy va ma’naviy ehtiyojlarini qondirish imkoniyatidir."
        ]
    },
    {
        "word": "Ijtimoiy Mulk",
        "type": [],
        "definition": [
            "umummilliy boylik, yer, suv, o'rmonlar, jamiyat tomonidan egalik qilish va o'zlashtirish mumkin bo'lgan mulk. Unga yer osti va yer usti boyliklari, temir yo‘l, havo, dengiz, avtomobil, kosmik tizim, irrigatsiya inshootlari, energiya tizimlari, sanoat korxonalari, harbiy obyekt va aslahalar hamda shunga o'xshash narsalar kiradi"
        ]
    },
    {
        "word": "Ijtimoiy Nafaqa",
        "type": [],
        "definition": [
            "muayyan sabablarga ko'ra, mehnat qilish imkoniyatiga ega bo'lmagan va domiy ravishda yordamga muhtoj fuqarolarga davlat tomonidan beriladigan nafaqa"
        ]
    },
    {
        "word": "Ijtimoiy Nafaqalar",
        "type": [],
        "definition": [
            "ijtimoiy nafaqalar ijtimoiy sug'urta nafaqasi va ijtimoiy yordam nafaqasi."
        ]
    },
    {
        "word": "Ijtimoiy Neʼmatlar",
        "type": [],
        "definition": [
            "aholining ma’lum bir guruhlari yoki butun jamiyatga taqdim etiladigan tovarlar va xizmatlar, chunki ularni bo'laklarga bo'lib alohida shaxslarga sotish mumkin emas. Ular faqat jamoa tomonidan iste’mol qilinishi mumkin, xolos. Huquqiy tartib, davlat mudofaasi, atrof-muhitni asrash, ijtimoiy dasturlar va shu kabilar ular tarkibiga kiradi."
        ]
    },
    {
        "word": "Ijtimoiy Rejalashtirish",
        "type": [],
        "definition": [
            "boshqaruv ta’sirining alohida bir shaklidir. U ilmiy asoslangan proekt realizatsiyasi bilan bog'liq va obyektning yangi parametrlariga erishishning aniq vositalaridan foydalanishni talab etadi."
        ]
    },
    {
        "word": "Ijtimoiy Ruhiy Vaziyat",
        "type": [],
        "definition": [
            "korxona va tashkilot xodimlariga ta’sir qiluvchi ko'pgina omillar ta’sirida keladigan jamlama samaradir. U mehnat qilish jarayonida, xodimlarning muomalasida, ularning shaxslararo va guruhiy aloqalarida o'z ifodasini topadi."
        ]
    },
    {
        "word": "Ijtimoiy Siyosat",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti sharoitida davlatning ijtimoiy siyosati kuchayadi. Davlatning ijtimoiy siyosati ijtimoiy jarayonlarni yaxshilab borish uchun davlat tomonidan ko'rilgan umumlashgan chora-1adbirlardir. Ijtimoiy siyosat jamiyat hayotining iqtisodiy va ijtimoiy tomonlarini qamrab oladi. Uning asosiy yo‘nalishlari daromad siyosatidan, baho va ish bilan bandlikni taminlashdan, ijtimoiy infratuzilmalardan (ilm-fan, madaniyat, ta’lim, sog'liqni saqlash) va ijtimoiy himoyalashdan iborat. Ijtimoiy siyosat bozor iqtisodiyoti sharoitida ijtimoiy tabaqalanishni yumshatishga qaratilgan. Ijtimoiy siyosat moddiy manfaatdorlikni muvofiqlashtiradi. U aholining turli guruh va qatlamlarini iqtisodiy faollikka chaqiradi hamda iqtisodiy samaradorlik bilan ijtimoiy samaradorlik o'rtasida huquqiy tenglikni taminlaydi."
        ]
    },
    {
        "word": "Ijtimoiy Siyosatning Maqsadi",
        "type": [],
        "definition": [
            "barcha fiuqarolar hayot sifatini oshirish va aholining hayotiy ehtiyojlarini qondirishni ta'minlaydigan mexanizmlar yordamida, turli ijtimoiy manfaatlar muvozanati asosida ijtimoiy muhit va ijtimoiy kelishuvni yaratish"
        ]
    },
    {
        "word": "Ijtimoiy Soha",
        "type": [],
        "definition": [
            "kishilarning mehnat qilishi va dam olishi, maishiy hayoti va b о sh vaqtini mazmunli о ‘ tkazish uchun yar atilgan shar t- sharoitlarni, moddiy farovonligi, maorif va sog'liqni saqlash tizimlarining rivojlanganlik darajasini ifoda etuvchi, alohida insonning, oilaviy hamda mehnat munosabatlarining takror yaratilishi kuzatiladigan hayotiy jarayonlarning namoyon bo'lishi uchun xizmat qiladigan zamin."
        ]
    },
    {
        "word": "Ijtimoiy Soha Obyektlari",
        "type": [],
        "definition": [
            "aholining munosib turmush sharoiti va farovonligini taminlashga xizmat qiluvchi soha va tarmoqlar majmuyi. Bular qatoriga uy-joy fondlari, sog'liqni saqlash, maorif, sport, madaniyat muassasalari va boshqalarni kiritish mumkin"
        ]
    },
    {
        "word": "Ijtimoiy Soha Va Aholini Ijtimoiy Qo*Llab- Quwatlash Xarajatlari",
        "type": [],
        "definition": [
            "o'z tarkibiga maorif, sog'liqni saqlash, madaniyat va sport, fan, ijtimoiy taminot, aholi uchun ijtimoiy ahamiyat kasb etgan xizmatlar baholaridagi farqlarni budj etdan qoplash va oilalarga ijtimoiy nafaqalarni oladi."
        ]
    },
    {
        "word": "Ijtimoiy Sohadagifaollik",
        "type": [],
        "definition": [
            "alohida shaxs yoki bir guruh odamlarning o'z manfaatlari, qadriyatlari, ideallarini himoyalashga qaratilgan faoliyati."
        ]
    },
    {
        "word": "Ijtimoiy Soliqlar",
        "type": [],
        "definition": [
            "ish haqi va ishchi kuchiga nisbatan qo'llaniladigan soliqlar hamda xo‘jalik yurituvchi subyektlarningijtimoiyta’minotga badallari (ajratmalari)dan tarkib topadi"
        ]
    },
    {
        "word": "Ijtimoiy Sugʻurta Ajratmasi",
        "type": [],
        "definition": [
            "yollovchilar, yollanma xodimlar, o'zo'zini ish bilan band qiluvchi shaxslar, ish bilan band bo'lmagan shaxslar ijtimoiy sug'urta dasturi uchun to'laydigan to'lovlardan tarkib topadi."
        ]
    },
    {
        "word": "Ijtimoiy Sugʻurta Dasturi",
        "type": [],
        "definition": [
            "ijtimoiy sug'urtalar uchun yollanma xodimlar,boshqashaxslaryokiyollanmaxodimlaruchunyollovchilar to'laydigan ajratmalarvato'lovlar.Buajratmalarvato'lovlarxodimlar va boshqa omonatchilar hamda ularga boqimonda shaxslaming, o'z boquvchisini yo'qotgan kishilarning ijtimoiy sug'urtaga bo'Igan huquqini mablag' bilan ta’minlaydi."
        ]
    },
    {
        "word": "Ijtimoiy Sugʻurta Nafaqasi",
        "type": [],
        "definition": [
            "ijtimoiy ta’minot fondlari, sug'urta korxonalari, yollovchilar yoki boshqa institutsion birliklar tomonidan ijtimoiy sug'urta dasturiga binoan huquqli hisoblangan uy xo'jaliklariga pul yoki natura shaklida to'lanadigan joriy transfertlar."
        ]
    },
    {
        "word": "Ijtimoiy Sugʻurta Uchun Ishga Yollovchilar Ajratmasi",
        "type": [],
        "definition": [
            "ijtimoiy sug'urtaga ajratma ishga yollovchilar tomonidan aslida ro'y bergan yoki shartli tarzda yollovchi to'laydigan (ajratadigan) ijtimoiy sug'urta mablag'idan iborat bo'ladi."
        ]
    },
    {
        "word": "Ijtimoiy Sugʻurtaga Haqiqiy Ajratmalar",
        "type": [],
        "definition": [
            "ajratmalar yollovchilar, yollanma xodimlar, o'z-o'zini ish bilan band qiluvchi va ish bilan band bo'lmagan shaxslar ijtimoiy sug'urta uchun to'laydigan ajratmalardan tarkib topadi."
        ]
    },
    {
        "word": "Ijtimoiy Sugʻurtalash",
        "type": [],
        "definition": [
            "nafaqa fondi orqali amalga oshiriladi. Nafaqa fondi ishchi va aholi mablag'laridan to'plangan jamg'arma bo'lib, kelajakda unga muhtoj bo'lganlarga pul tariqasida yoki pul to'lov shaklida yordam beriladi."
        ]
    },
    {
        "word": "Ijtimorytaʼminot",
        "type": [],
        "definition": [
            "keksaygan,mehnatgalayoqatsizbo‘lganvaboquvchisini yo'qotgan fuqarolarga moddiy, tibbiy va ijtimoiy yordam ko'rsatish bo'yicha dalat tomonidan belgilangan ijtimoiy-iqtisodiy tadbirlar tizimidir."
        ]
    },
    {
        "word": "Ijtimoiy Taʼminot Nafaqasi Va Toʻlovlari",
        "type": [],
        "definition": [
            "uy xo'jaliklari tomonidan muayyan tovar yoki xizmat uchun qilingan va ruxsat etilgan xarajatlarning ijtimoiy ta’minot jamg'armalari tomonidan natura shaklidagi to'lovlar."
        ]
    },
    {
        "word": "Ijtimoiy Taʼminotning Koʻrinishlari",
        "type": [],
        "definition": [
            "qariyalar va nogironlarga ijtimoiy xizmat ko'rsatish - nogironlarni “Muruwat” uylariga, yolg'iz qariyalarni “Saxovat” uylariga joylashtirish, muhtojlarni protezortopediya va harakatlanish vositalari bilan ta’minlash, nogiron bolalarni kasbga o'qitish va ishga joylashishda yordam ko'rsatish pensionerlarni sanatoriy va dam olish uylarida sog‘ lomlashtirish, ularga shahar transportidan, turar joy, maishiy xizmat va soliqlarga aloqador imtiyozlar berish."
        ]
    },
    {
        "word": "Ijtimoiy Taʼminotning Muhim Elementlari",
        "type": [],
        "definition": [
            "pensiyalar (keksalik bo'yicha, nogironlik bo'yicha, boquvchisini yo'qotganlik bo'yicha) va ijtimoiy nafaqalar (nogiron bolalarga, bolalikdan nogironlarga, ishlamagan yolg'iz nogiron va keksalarga) to'lovlari hisoblanadi."
        ]
    },
    {
        "word": "Ijtimoiy Toʻlovlar",
        "type": [],
        "definition": [
            "moddiy jihatdan kam ta’minlangan mamlakat fuqarolariga pul yoki natura shaklida yordam ко'rsatish shaklidagi tizim hisoblanadi."
        ]
    },
    {
        "word": "Ijtimoiy Yoʻnaltirilgan Bozor Xoʻjaligi Konsepsiyasi",
        "type": [],
        "definition": [
            "ijtimoiy-iqtisodiy taraqqiyotning ustuvor yo'nalishlarini belgilab olish asosida davlat tomonidan jamiyat manfaatlarini ko'zlab, iqtisodiyotning muayyan tarmoqlarini rivojlantirish g'oyasi"
        ]
    },
    {
        "word": "Ijtimoiy Yordam Nafaqasi",
        "type": [],
        "definition": [
            "pul yoki natura shaklida davlat birliklari yoki notijorat tashkilotlar tomonidan uy xo'jaliklariga ijtimoiy sug'urta tarzidagi ehtiyojlami qondirish uchun, lekin ijtimoiy sug'urta dasturidan tashqari to'lanadigan joriy transfertlar"
        ]
    },
    {
        "word": "Ijtimoiy Zaruriy Mehnat",
        "type": [],
        "definition": [
            "jamiyatda ishlab chiqarish sharoitlari, xodimlarning malakasi va mehnat intensivligi o'rtacha bo'lgan sharoitda tovar ishlab chiqarish uchun sarflanadigan mehnat"
        ]
    },
    {
        "word": "Ijtimoiy-Axloqiy Marketing Konsepsiyasi",
        "type": [],
        "definition": [
            "firmaning vazifasiga yakka shaxslarning talabini o'rganish, tahlil qilish, bu talablami samarali qondirish, umuman olganda, jamiyat butunligini saqlash va mustahkamlash jarayonlari kiradi."
        ]
    },
    {
        "word": "Ijtimoiylashuv",
        "type": [],
        "definition": [
            "shaxsning muomala yordamida mazkur jamoaga, guruhga, j amiy atga xo s b о' lgan n ormalar, qadriyatlar, yo' 1-yo 'riqlami o'zlashtirish asosida uning shakllanish jarayoni"
        ]
    },
    {
        "word": "Ijtimoiy-Psixologik Boshqaruv Usullari",
        "type": [],
        "definition": [
            "xodimlarning salomatligi va jamoadagi yaxshi ma’naviy-ruhiy holatni saqlash, qonunlar va me’yoriy hujjatlar talablariga rioya qilish sharoitida qo'yilgan maqsadga erishish bo'yicha jamoa (xodim)dagi ijtimoiypsixologik jarayonlarni boshqarishga qaratilgan usuldir."
        ]
    },
    {
        "word": "Ijtimoiy Hamkorlik",
        "type": [],
        "definition": [
            "xilma-xil fikr va qarashlarga ega bo'lgan, turli millat, irq va dinga mansub shaxs va guruhlarning umumiy maqsad yo'lidagi hamjihatligi."
        ]
    },
    {
        "word": "Ijtimoiy-Amaliy Markaz",
        "type": [],
        "definition": [
            "ish bilan band bo'lmagan aholi va ishsizlar o'rtasida kichik tadbirkorlikni rivojlantirish orqali yangi ish o'rinlariniyaratishbilan shug'ullanuvchi, odatda, bandlikmarkazlari qoshida tashkil etiluvchi tuzilma."
        ]
    },
    {
        "word": "Ikki Marotaba Hisoblash",
        "type": [],
        "definition": [
            "milliy ishlab chiqarishning hajmini o'lchayotganda, bir tovar (xizmat) qiymatining ikki martadan hisobga olinishi. Bunday hoi oraliq tovarlar qiymati qo'shib hisoblaganda ro'y beradi. Chunki iqtisodiyotning alohida bo'g'inlari (tarmoq, korxona) da ayrim mahsulotlar yoki ularning qismlari xom ashyo materiallar sifatida bir necha tarmoq korxonalarida ishlab chiqarishga xizmat qiladi. Shu sababli unda takroriy hisoblash mavjud bo'ladi. Uning oldini olish uchun yalpi milliy mahsulot (YaMM) hisobotida oraliq mahsulotlar qiymati chegirib tashlanadi"
        ]
    },
    {
        "word": "Ikki Marta Soliqqa Tortish",
        "type": [],
        "definition": [
            "l) soliqlarning daromad (kapital) ning yagona manbayidan olinishi; 2) qo'shma korxona xorijiy ishtirokchisining foydasini xorijga o'tkazilayotgan paytda soliqqa tortish va xuddi shu foydaning xorijiy ishtirokchi mamlakatida soliqqa tortilishi; 3) sof foyda (daromad) (korporatsiyalar foydasi) va undan to'lanadigan dividendlarni ular shaxsiy daromadga aylanayotgan paytda soliqqa tortish. Boshqa mamlakatda to'langan soliqlarni bu mamlakatda hisobga olish yoki bir mamlakatdagi soliqqa tortish manbayini ikkinchi mamlakatda soliqqa tortishdan ozod qilish yo'li bilan ikki marta soliqqa tortishdan qutulish mumkin. 1979-yilda BMT tomonidan manfaatdor davlatlar o'rtasidagi munosabatlarda ikki marta soliqqa tortishga barham berish uchun maxsus konvensiya ishlab chiqilgan bo'lib, uning asosida ikki tomonlama bitimlar imzolanadi. Ular tomonidan o'matilgan soliqqa tortish tartibiga ko'ra, qo'shma korxona xorijiy ishtirokchisi o'z foydasini xorijga o'tkazayotgan paytda qo'shimcha soliqdan ozod qilinadi."
        ]
    },
    {
        "word": "Ikkilamchi Axborot",
        "type": [],
        "definition": [
            "firmaning qo'l ostidagi o'rganilishi lozim bo'Igan ma’lumotlar (ichki hisobotlar, statistik ma’lumotnomalar, bosma nashrlar, telegraf agentliklari axborotnomalari va hokazo)."
        ]
    },
    {
        "word": "Ikkilamchi Deflyator Usuli",
        "type": [],
        "definition": [
            "qo'shilgan qiymati o'zgarmas baholarda qayta baholash usuli bo'lib, uning uchun awal ishlab chiqarish va oraliq iste’mol deflyatorlanadi, so'ngra birinchisidan ikkinchisi ayriladi."
        ]
    },
    {
        "word": "Ikkilamchi Ijara",
        "type": [],
        "definition": [
            "(ikkilamchi lizing) ijarachi (lizingga oluvchi) ijaraga beruvchi (lizingga beruvchi)ning roziligi bilan, ijaraga beruvchi (lizingga beruvchi)ning oldida ijara (lizing) shartnomasi yuzasidan javobgarlikni saqlagan holda ijaraga olingan mulkni (lizing obyektini) boshqa shaxsga ikkilamchi ijara (ikkilamchi lizing)ga topshiradigan shartnoma munosabati."
        ]
    },
    {
        "word": "Ikkiyoqlama (Qoʻshaloq) Yozuv",
        "type": [],
        "definition": [
            "buxgalteriya hisobida schyotlar tuzishning asosiy qoidasi bo'lib, bunda korxonaning har bir xo'jalik operatsiyasi muayyan vaqtda va o'zaro aloqador holda bir xil pul miqdorida birdaniga ikkita schyotda: birinchisining debet va ikkinchisining kredit qismida aks ettiriladi."
        ]
    },
    {
        "word": "Ikkiyoqlamasoliqqatortish",
        "type": [],
        "definition": [
            "1. Turli soliqlarning daromad (kapital) ning yagona manbayidan olinishi. 2. Qo'shma korxona xorijiy ishtirokchisining foydasini xorijga o'tkazilayotgan paytda soliqqa tortish va xuddi shu foydaning xorijiy ishtirokchi mamlakatida soliqqa tortilishi. 3. Sof foyda (daromad), (korporatsiyalar foydasi) va undan to'lanadigan dividendlami ular shaxsiy daromadga aylanayotgan paytda soliqqa tortish. Boshqa mamlakatda to'langan soliqlarni bu mamlakatda hisobga olish yoki bir mamlakatdagi soliqqa tortish manbayini ikkinchi mamlakatda soliqqa tortishdan ozod qilish yo'li bilan ikki marta soliqqa tortishdan qutulish mumkin. 1979-yilda BMT tomonidan manfaatdor davlatlar o'rtasidagi munosabatlarda ikki marta soliqqa tortishga barham berish uchun maxsus konvensiya ishlab chiqilgan bo'lib, uning asosida ikki tomonlama bitimlar imzolanadi. Ular tomonidan o'matilgan soliqqa tortish tartibiga ko'ra qo'shma korxona xorijiy ishtirokchisi o'z foydasini xorijga o'tkazayotgan paytda qo'shimcha soliqdan ozod qilinadi."
        ]
    },
    {
        "word": "Ilgʻor Oʻzgarishlar Davri",
        "type": [],
        "definition": [
            "menejerlik inqilobi davri. Menejerlik inqilobiningsabablari.Boshqaruvmadaniyatiningyangiko'rinishlari va ularning mazmuni va mohiyati. Tashkilotchilik madaniyati."
        ]
    },
    {
        "word": "Ilmiy Muammo",
        "type": [],
        "definition": [
            "fan orqali hal qilinadigan asosiy ziddiyatlar."
        ]
    },
    {
        "word": "Ilmiy-Texnik Salohiyat",
        "type": [],
        "definition": [
            "mamlakatdagi fan, texnika va muhandislik ishlarining rivojlanish darajasi, jamiyatning fan-texnika muammolarini hal qilish uchun mavjud resurs va imkoniyatlarining umumiy tavsifnomasi."
        ]
    },
    {
        "word": "Imij",
        "type": [],
        "definition": [
            "1. Tovar obrazi, uning biron narsani eslatishi, o'xshashi va aks ettirishi, tovar bozori iqtisodiyotiga chambarchas bog'liq bo'lgan ijtimoiypsixologik holat. Tovar imiji tovarning reputatsiyasi, tovar markasi, tovar ishlab chiqarilgan korxona va mamlakat bilan assotsiatsiyalashadi. 2. Firmaning mavqeyi, ishlab chiqarayotgan molning, xizmatning sifati, rahbarlarning obro'si haqidagi buyurtmachi va xaridorning fikri."
        ]
    },
    {
        "word": "Immigratsion Kvota ",
        "type": [],
        "definition": [
            "xorijiy fuqarolarning kirib kelishini davlat tomonidan miqdoriy cheklash. "
        ]
    },
    {
        "word": "Import",
        "type": [],
        "definition": [
            " (lot. importo - kiritaman) - l) mamlakat ichiga foydalanish yoki sotish uchun chetdan olib kelingan xorijiy mahsulotlar; 2) kapital import xorijdan mamlakatga kelayotgan kapital (kredit, zayom va boshqa); 3) chetdan olib kelingan mahsulotlarning umumiy soni va qiymati. U vaqtni tejashga, iqtisodiyot, aholi ehtiyojini qondirish vazifalarini muvaffaqiyat bilan hal qilishga ko'maklashadi. "
        ]
    },
    {
        "word": "Import Boji ",
        "type": [],
        "definition": [
            " muayyan turdagi mahsulotlar iqtisodiy hududga kirganda, ular uchun haq to'lash maqsadida olinadigan bojxona boji yoki boshqa turdagi import to lovlari. "
        ]
    },
    {
        "word": "Import Kvotasi ",
        "type": [],
        "definition": [
            "boshqa mamlakatlardan tovarlarni olib kirishga miqdoriy limit. Davlatningproteksionistiksiyosatini amalga oshirish vositalaridan biri. Masalan, hozirda AQSH yapon avtomobillarini mamlakatga olib kirishni miqdoriy cheklab qo'ygan. O'sha belgilangan miqdordan (kvota) ortiq yapon avtomobillari AQSHda sotilmaydi. "
        ]
    },
    {
        "word": "Import Oʻrnini Bosish Samarasi ",
        "type": [],
        "definition": [
            "mahalliylashtirish jarayonini amalga oshirish orqali ishlab chiqarilgan mahsulotlar va ko'rsatilgan xizmatlar natijasida tejalgan import mahsulotlari qiymati. "
        ]
    },
    {
        "word": "Import Operatsiyalari ",
        "type": [],
        "definition": [
            " mahsulotni xorijiy sheriklardan sotib olish va mamlakatga olib kirish."
        ]
    },
    {
        "word": "Importposhlinasi",
        "type": [],
        "definition": [
            " import qilinayotgan tovarga soliq. Davlatproteksionist siyosatini olib borish vositalaridan biri. "
        ]
    },
    {
        "word": "Import Soligʻi ",
        "type": [],
        "definition": [
            "bir necha mamlakatlardagi soliqlar guruhi, daromad sarf qilinayotgan paytda olinadi. Qo'shilgan qiymat solig'i va aksizlar ana shunday soliq tarkibiga kiradi. Boj poshlinalarini ham iste’mol soliqlari qatoriga kiritish mumkin. Bu soliqlarning ayrimlari davlat foydasiga olinsa, boshqa bir qismi mahalliy budjetlarga borib tushadi. "
        ]
    },
    {
        "word": "Import Soliqlari ",
        "type": [],
        "definition": [
            "quyidagilardan tarkib topadi: tovar, aslida, hududiy yoki bojxona chegarasidan o'tib, iqtisodiy makonga yetib kelganda, mahsulotga (qo'shilgan qiymat solig'i bundan mustasno) solinadigan soliq; xizmatdan foydalanuvchi rezident birligi bo'lib, xizmat ko'rsatuvchi rezident birligi bo'lmaganda olinadigan soliq. "
        ]
    },
    {
        "word": "Import Uchun Subsidiya ",
        "type": [],
        "definition": [
            "mahsulot iqtisodiy chegaradan o'tganda yoki rezidentli institutsion birlikka xizmat ko'rsatilganda, tovar va xizmat ko'rsatish uchun to'lanishi shart bo'lgan moliyaviy yordam."
        ]
    },
    {
        "word": "Import Xaridlar Samarasi ",
        "type": [],
        "definition": [
            " mamlakatning sof eksport hajmi va undagi narxlar darajasi, shuningdek, boshqa mamlakatlardan narxlar darajasi o'rtasidagi teskari aloqa. "
        ]
    },
    {
        "word": "Import-Eksport Soligʻ1 ",
        "type": [],
        "definition": [
            " soliqqa tortishning ko‘rinishlaridan biri; tashqi savdoni davlat tomonidan tartibga solish vositasi (chorasi). Soliqqa tortish obyekti bo'lib belgilangan kurs bo'yicha milliy valyutada hisoblangan tovarlarning boj qiymati yoki og'irlik va miqdor birliklarida ifodalangan tovarlar soni. "
        ]
    },
    {
        "word": "Importga Chegaralangan Moyillik ",
        "type": [],
        "definition": [
            "importga qilingan xarajatlardagi o'zgarishning YalM yoki YaMD o'zgarishiga nisbatan ulushi. Importga qaratilgan xarajatlar hissasi."
        ]
    },
    {
        "word": "Import Oʻrnini Bosish Samarasi ",
        "type": [],
        "definition": [
            "mahalliylashtirish jarayonini amalga oshirish orqali ishlab chiqarilgan mahsulotlar va ко rsatilgan xizmatlar natijasida tejalgan import mahsulotlari qiymati. "
        ]
    },
    {
        "word": "Imtiyoz ",
        "type": [],
        "definition": [
            "ma’lum bir afzalliklarga ega bo'lish yoki ma’lum bir majburiyatlarni bajarishdan qisman yoki to'liq ozod bo'lish. Zarar ко‘rib ishlaydigan korxonalardan imtiyozli soliqlar olinadi. IMTIYOZLI AKSIYA - aksiyadorlar umumiy yig'ilishida "
        ]
    },
    {
        "word": "Imtiyozli Aksiya ",
        "type": [],
        "definition": [
            "aksiyadorlar umumiy yig'ilishida ovoz berish huquqini beradi va bu bilan boshqarishda ishtirok etish huquqini bermaydi. Ularning imtiyozliligi, bir tomondan aksiyadorlik jamiyati xo'jalik faoliyati natijalaridan qat’i nazar, kafolatlanmagan dividendni olish imkoniyatidan, ikkinchi tomondan esa aksiyadorlik jamiyati tugatilgan vaqtda aksiyalar qiymatini birinchi navbatda olish huquqidan iborat. "
        ]
    },
    {
        "word": "Imtiyozli Narx ",
        "type": [],
        "definition": [
            " ayrim iste’molchilar yoki ayrim paytda qo'llaniladigan odatdagidan pastroq narx. "
        ]
    },
    {
        "word": "Imtiyozli Soliqqa Tortish",
        "type": [],
        "definition": [
            " soliq obyektini soliqqa tortish jarayonida jismoniy yoki yuridik shaxslarning soliqdan qisman yoki to'liq ozod etilishi. "
        ]
    },
    {
        "word": "Imtiyozli Toʻlanmalar (Kompensatsiyalar)",
        "type": [],
        "definition": [
            "- uy-joykommunal xizmatlariga, transport xizmatlari, sanatoriy-kurort davolashlari va davolash vositalari bilan ta’minlash xizmatlarini to'lash va boshqalar. "
        ]
    },
    {
        "word": "Indeks",
        "type": [],
        "definition": [
            "1. Biror iqtisodiy hodisaning izchil o'zgarib borishini ko'rsatadigan raqamlar ko'rsatkichi. 2. Narx, nom va shunday ko'rsatkichlar ro'yxati 3. Harf yoki raqamlarning o'ng tomoniga qo'yiladigan harf yoki son ko'rsatkichi. "
        ]
    },
    {
        "word": "Indeks Usuli",
        "type": [],
        "definition": [
            "ishbilarmonlik aktivligining fond indekslari yordamida tendensiyalami kuzatish."
        ]
    },
    {
        "word": "Indeksatsiya",
        "type": [],
        "definition": [
            "iqtisodiyotdagi narxlarning o'rtacha darajasi o'zgarishiga bog'liq ravishda ish haqi va boshqa daromadlarni tuzatish, kelishtirish. "
        ]
    },
    {
        "word": "Indeksatsiya Qilish ",
        "type": [],
        "definition": [
            "majburiyatlar bo'yicha to'lovlarning narx-navo kosatkichi bilan o'zaro nisbatini belgilash, pul talabnomalari va turli daromadlarning haqiqiy miqdorini inflyatsiya sharoitida saqlab qolish"
        ]
    },
    {
        "word": "Indekslar",
        "type": [],
        "definition": [
            "jahon fond bozori konyunkturasini tavsiflovchi fond indekslari. "
        ]
    },
    {
        "word": "Indekslar Dinamikasi ",
        "type": [],
        "definition": [
            "indeksning miqdor jihatidan o'sishi yoki pasayishi. "
        ]
    },
    {
        "word": "Individual Tovar Yoki Xizmat ",
        "type": [],
        "definition": [
            "shunday tovar yoki xizmatki, ular uy xo'jaliklari tomonidan muayyan uy xo'jaligi a’zolarining ehtiyoj va xohishlarini qondirish uchun xarid qilinadi. "
        ]
    },
    {
        "word": "Individual Tovarlar Va Xizmatlar ",
        "type": [],
        "definition": [
            "Davlat boshqaruv idoralari sektori tomonidan alohida olingan fuqaroning yakuniy iste’moli uchun bepul beriladigan xizmatlar va tovarlardan iborat. "
        ]
    },
    {
        "word": "Indossament",
        "type": [],
        "definition": [
            "qimmatli qog'oz ustidagi ushbu hujjat bo'yicha huquqlarning boshqa shaxsga o'tkazilganligini tasdiqlovchi o'tkazma (hujjat) yozuv. "
        ]
    },
    {
        "word": "Indossatsiya Qilish ",
        "type": [],
        "definition": [
            "qimmatli qog'oz, veksel, chek va shu kabilar bo'yicha huquqni boshqaga o'tkazib qo'yish. "
        ]
    },
    {
        "word": "Industriya",
        "type": [],
        "definition": [
            "industriya, sanoat, og‘ir sanoat sohasi. Masalan, mashinasozlik, metallurgiya sanoati. "
        ]
    },
    {
        "word": "Industriyalashtirish",
        "type": [],
        "definition": [
            "mamlakat iqtisodiyotini sanoatlashgan asosga o'tkazish, iqtisodiyotda sanoat ishlab chiqarishi ulushini ahamiyatli darajada ko'paytirish, butun iqtisodiyot yoki uning alohida tarmoqlarida yirik mashinalashgan ishlab chiqarishni barpo etish jarayoni. "
        ]
    },
    {
        "word": "Inflyatsion Soliq",
        "type": [],
        "definition": [
            " hukumatning tovarlar va xizmatlami sotib olishi uchun zarur mablag'larni to‘plash, budjet taqchilligini moliyalashtirish uchun, pul taklifini oshirish yo'li bilan aholining pul mablag'larini bilvosita olishi tushuniladi. "
        ]
    },
    {
        "word": "Inflyatsiya",
        "type": [],
        "definition": [
            "(lot. shishish, ko'pchish, ko'tarilish) - mamlakatda muomalada yurgan qog'oz pul miqdorining xo'jalik muomalasi ehtiyojlaridan ortiq darajada oshib ketishi. Pulning qadrsizlanishi. Inflyatsiya quyidagi turlarga bo'linadi: 1. Biror omil tufayli kelib chiqqan inflyatsiya. 2. Kredit inflyatsiyasi - kredit ajratishning haddan ortiq kengayishi tufayli kelib chiqadi. 3. Sudraluvchan inflyatsiya - sekinlik bilan rivojlanib boradi. 4. Sakrovchan inflyatsiya - tez sur’atda rivojlanib boradi. 5. Ma’muriy inflyatsiya - narx-navoni ma’muriy tarzda boshqarish oqibatida yuzaga keladi. 6. Ijtimoiy inflyatsiya - mahsulot sifatiga, atrof-muhit muhofazasiga bo'lgan yangi ijtimoiy talablarning paydo bo'lishi oqibatidagi chiqimlarning o'sishi ta’sirida narx-navoning o'sishini yuzaga keltiradi. Bunday holat xo'jalik yuritish borasidagi qiyinchiliklarni bartaraf qilish davrida, mahsulot ishlab chiqarish kamaygan hollarda qo'shimcha pul chop etish natijasida yuzaga keladi. "
        ]
    },
    {
        "word": "Inflyatsiya Darajasi ",
        "type": [],
        "definition": [
            " ma’lum vaqt ichida (oy, yil) narxlar darajasining foizdagi o'zgarishi. "
        ]
    },
    {
        "word": "Inflyatsiya Surʼati ",
        "type": [],
        "definition": [
            " narxlar o'rtacha ko'rsatkichining o'sish sur’ati quyidagi i=(R1-R0)\/R0 formula bilan hisoblanadi. Bu yerda i - 0 momentdan 1 momentgacha bo'lgan davr ichidagi inflyatsiya sur’ati; R - 0 momentdagi o'rtacha narx, R -1 momentdagi o'rtacha narx. "
        ]
    },
    {
        "word": "Informatsiya",
        "type": [],
        "definition": [
            "(axborotlar, ma’Iumotlar) - l) ishlarning ahvoli haqida xabardor qilish; 2) tadbirkorlik, marketing va boshqa faoliyat turlari oldida turgan vazifalarni bajarishda yordam berishi mumkin bo'lgan turli xil bilim va ma’Iumotlar; 3) marketing tizimi subyektlarining o'zaro munosabatlar jarayonidagi bevosita va teskari aloqa natijalari tavsifnomasi; 4) turli xil energiyalaming o'zaro aloqalari natijasi. "
        ]
    },
    {
        "word": "Inglizcha Auksion",
        "type": [],
        "definition": [
            "bunda stavka pastdan yuqoriga tovar sotilgunga qadar oshib boradi, tovar taklif qilingan maksimal narxda sotiladi. "
        ]
    },
    {
        "word": "Injiniring",
        "type": [],
        "definition": [
            "tijorat ko'rinishida har tomonlama maslahatlarini beruvchi mustaqil faoliyat doirasi. Bu faoliyat ishlab chiqarishning o'sishi, mahsulotlarni sotish, obyektlar qurish va ulardan foydalanish jarayonini ta’minlaydi. Injiniring xizmati ikki guruhga bo'linadi: l) ishlab chiqarish jarayonini tayyorlash; 2) ishlab chiqarish va mahsulot sotish jarayonini to'la ta’minlash. "
        ]
    },
    {
        "word": "Injiniring Firmalari ",
        "type": [],
        "definition": [
            " ichki va xalqaro bozorlarda injiniring xizmatini ко'rsatish bo'yicha ixtisoslashgan korxona, firmalar. Bu firmalar bir korxona, kompaniya faoliyati bilan cheklanmaydi. Ular turli tarmoqlarda xizmat ko'rsatishlari, ko'p ta’minotchilar va pudrat firmalari bilan aloqa qilishlari mumkin. "
        ]
    },
    {
        "word": "Injiniring Korxona ",
        "type": [],
        "definition": [
            "muhandislik maslahat xizmatlarini tijoratchilik qoidalariga asoslangan holda amalga oshiradigan korxona."
        ]
    },
    {
        "word": "Injiniring Xizmatlar Bozori ",
        "type": [],
        "definition": [
            "xalqaro bozorning bir turi, injiniring xizmatlarining davlatlar tomonidan oldi-sotdi qilinishi. Loyihalash, korxonalarni qurish, ularni jihozlash. Ekspluatatsiya qilish yuzasidan bo'lgan xizmatlami maxsus injiring firmalari bajaradi."
        ]
    },
    {
        "word": "Inkassa",
        "type": [],
        "definition": [
            "bank operatsiyasining bir turi, bankning turli hujjatlar orqali (veksel, chek va boshqalar) mijozlar nomidan va ular hisobidan oladigan puli. "
        ]
    },
    {
        "word": "Inkassalash",
        "type": [],
        "definition": [
            "(lot. - yashikka solish) tolov hujjatlarini ko'rsatib, u asosida pulni olish. "
        ]
    },
    {
        "word": "Inkassator",
        "type": [],
        "definition": [
            "asosan, muassasalardan tashqarida yurib pul yig'ish va pul to'lashga vakil qilingan mansabdor shaxs. "
        ]
    },
    {
        "word": "Inkassatsiya",
        "type": [],
        "definition": [
            " turli to lov xizmatlari asosida bankdan naqd pul olish. "
        ]
    },
    {
        "word": "Inkasso",
        "type": [],
        "definition": [
            "xalqaro savdodagi hisob-kitob shakllaridan biri. Unga muvofiq bank o'z mijozining topshirig'iga ko'ra jo'natilgan tovarlar va xizmatlar uchun hisob-kitob hujjatlari asosida to'lanishi lozim bo'Igan pul mablag'larini haq to'lovchidan oladi hamda bu mablag'larni o'z mijozining bankdagi hisob-raqamiga o'tkazadi. "
        ]
    },
    {
        "word": "Inkroment Xarajatlar Va Daromadlar ",
        "type": [],
        "definition": [
            "qo'shimcha mahsulot guruhini ishlab chiqarish holadarida ro'yobga chiqadigan qo'shimcha xarajatlar va daromadlar. "
        ]
    },
    {
        "word": "Innovatsion Faoliyat ",
        "type": [],
        "definition": [
            "tashkil etish, boshqarish va moliyalashtirishda yangi shakllar qo'llanilishiga asoslangan faoliyat. "
        ]
    },
    {
        "word": "Innovatsion Kadrlar Menejmenti ",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti va raqobatning kuchayishi sharoitida kadrlarga oid yangiliklar mehnat jarayonining ajralmas qismiga aylanishi va ularning tashkil etishni hamda boshqarishni talab qilishi. "
        ]
    },
    {
        "word": "Innovatsion Salohiyat ",
        "type": [],
        "definition": [
            "innovatsion jihatdan istiqbolni o'ylab belgilangan maqsadlarga erishish imkoniyatlari. "
        ]
    },
    {
        "word": "Innovatsion Texnologiyalar ",
        "type": [],
        "definition": [
            "iqtisodiyotga yangiliklarni tatbiq etish bosqichlarida qo'llaniluvchi usul va vositalar majmuyi bo'lib, o'z ichiga joriy etish, trening, konsalting, transfert, audit, injiniring kabilarni oladi. "
        ]
    },
    {
        "word": "Innovatsiya",
        "type": [],
        "definition": [
            "angiliklarniishlabchiqarishgajoriyetishjyangitexnologiyaning birinchi marta tijorat asosida qo'llanishi. Intensiv iqtisodiy o'sish - resurslardan yanada samarali foydalanishga asoslangan iqtisodiy o'sish. Uning asosiy omili fan-texnika taraqqiyoti. Masalan, biror- bir korxona mahsulot hajmini oshirishga yangi sex qurish bilan emas, balki ishlab chiqarishni fan-texnika taraqqiyotining oxirgi talablariga javob beradigan dastgoh, yangi texnologiyalar bilan qayta jihozlash bilan erishadi. "
        ]
    },
    {
        "word": "Innovatsiya Banki ",
        "type": [],
        "definition": [
            "tijorat bankining ko'rinishi bo'lib, uning asosiy vazifasi - ishlab chiqarishning texnik darajasini oshirish, shuningdek, yangi, yuksak samarali mahsulotlar ishlab chiqarishga qaratilgan kashfiyot va ixtirolarni tatbiq qilishni mablag' bilan ta’minlash va kreditlashdan iboratdir. "
        ]
    },
    {
        "word": "Inn Оvatsiya Jarayoni ",
        "type": [],
        "definition": [
            "yangilik g'oyasini rivojlantirishdan uning pirovard iste’molchi tomonidan iste’mol qilinishigacha bo'lgan mantiqiy izchillikda harakatlanuvchi jarayon. Bu yangilikning ilmiy- texnik, ishlab chiqarish-iqtisodiy va ijtimoiy-tashkiliy salohiyatini yaratish, rivojlantirish va undan foydalanish jarayonidir. Innovatsiya jarayonining quyidagi bosqichlari mavjud: yangilik yaratish, uni o'zlashtirish, tarqatish va takomillashtirish. "
        ]
    },
    {
        "word": "Innoyatsiya Investitsiyalari ",
        "type": [],
        "definition": [
            "texnika va texnologiyalarning yangi avlodini ishlab chiqish va o'zlashtirishga qo'shiladigan investitsiyalar. "
        ]
    },
    {
        "word": "Inqiroz",
        "type": [],
        "definition": [
            "l) taraqqiyotning orqaga qaytishi, pasayishi, tanazzuli, regress, tushkunlik; 2) tugash, bitish. Rivojlanish negizidagi ichki ziddiyatlarning nihoyat darajada keskinlashuvi; bankrotlikka, tanazzulga uchrash xavfining o'sib borishi; iqtisodiy, moliyaviy va boshqa xildagi tizimlar faoliyatida uchraydigan nomuvofiqlik; ozgarishlar jarayonidagi tub burilish. "
        ]
    },
    {
        "word": "Inqiroz Xavfining Oldini Olishga Moʻljallangan Marketing Faoliyati Dasturi ",
        "type": [],
        "definition": [
            "bozorlardagi real vaziyatni o'nglash va to'lovga layoqatsizlik (boshqaruv samaradorligini, raqobatbardoshlikni oshirish) holatidan qutulish uchun kompaniya tomonidan amalga oshirilishi lozim bo'lgan chora-tadbirlar majmuasi. "
        ]
    },
    {
        "word": "Inqiroz Xavfining Oldini Olishga Yoʻnaltirilgan Harakat Dasturi ",
        "type": [],
        "definition": [
            "korxonani tang holatdan olib chiqishga (inqiroz oqibatlarini biroz yumshatish, kechiktirish, bartaraf etish va hokazo) qaratilgan chora-tadbirlar majmuyi; tashkilotni inqirozli vaziyatdan olib chiqishga yo'naltirilgan boshqaruv qarorlarini qabul qilsh"
        ]
    },
    {
        "word": "Inqirozga Qarshi Moʻljallangan Choralar Dasturi ",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasi hukumati tomonidan 2009-2012-yillarga mo'ljallangan inqirozga qarshi ishlab chiqilgan choralar dasturi bo'lib, mazkur dasturda talabni rag'batlantirishga yo'naltirilgan bir qator moliyaviy imtiyozlar va barqaror iqtisodiy o'sish sur’atlarini ta’minlovchi chora-tabdirlar majmuyi o'z aksini topgan. "
        ]
    },
    {
        "word": "Insof",
        "type": [],
        "definition": [
            "adolat va vijdon amri bilan ish tutish tuyg'usi, ishda, kishilarga munosabatda halollik, to'g'rilik, barobarlik, sofdillik va haqiqatgo'ylikdir."
        ]
    },
    {
        "word": "Inson Kapitali ",
        "type": [],
        "definition": [
            " investitsiyalar natijasida shakllangan bilimlar, ko'nikmalar, malakalar va sabablar zaxirasidan iborat bo‘ lib, u shaxsning jismoniy, aqliy va psixologik sifatlari hamda qobiliyatlarini aks ettiradi. "
        ]
    },
    {
        "word": "Inson Kapitali Nazariyasi ",
        "type": [],
        "definition": [
            "inson kapitaliga investitsiya qo'yish natijasida ish haqining har xil darajada bo'lishi sabablarini tushuntirib beruvchi nazariya."
        ]
    },
    {
        "word": "Inson Kapitaliga Investitsiya Qilish ",
        "type": [],
        "definition": [
            "odatda, malakaviy qobiliyatni, demakki, mehnat unumdorligini oshirishga yo'naltirilgan har qanday xarajat tushunilib, u ta’lim olishga oid xarajatlarni, ish qobiliyati va mehnat unumdorligini ta’minlaydigan sog'liqni saqlashga ketadigan xarajatlarni va ishchi kuchini unumsiz yerlardan yuqori unumliyerlarga ко chirishga, ya’ni harakatchanlikka qilinadigan xarajatlarni o'z ichiga oladi. Ushbu investitsiyalar xodimlarning malakasini oshirish va layoqatlarini rivojlantirishga oid investitsiyalardir. Ular, asosan, xodimlarni o'stirish va malakasini oshirishga, qayta o'qitishga sarf qilinadi, pirovard natijada esa ishlab chiqarishning muhim omili - ish kuchining sifati oshadi va ishlab chiqarish iqtisodiy samaradorlikka erishadi. "
        ]
    },
    {
        "word": "Inson Munosabatlari ",
        "type": [],
        "definition": [
            "bu modelda asosiy e’tibor ishlovchilar uchun eng yaxshi mehnat sharoitlarini yaratishga qaratiladi. "
        ]
    },
    {
        "word": "Inson Omili ",
        "type": [],
        "definition": [
            " amalga oshirilayotgan barcha islohotlarning bosh yo'nalishi va samaradorligining pirovard natijasini belgilab beruvchi asosiy tamoyil. Inson omili tarkiban ikki muhim jihatni o'z ichiga oladi. Birinchi jihat - O'zbekistonda jami ijtimoiy tuzilma, ta’lim va sog'liqni saqlash, nafaqa bilan ta’minlash tizimi va aholini ekologik va boshqa xavf-xatardan himoya qilishdan iborat. Davlatning doimiy e’tiborini o'zida ifodalaydi. Ikkinchi jihat esa yalpi ijtimoiy taraqqiyot jarayonlarida shaxsning o'z ishtiroki, bunyodkorligi, yaratish zavqi, sa’y-harakatlari va shijoati ifodalanishini nazarda tutadi. "
        ]
    },
    {
        "word": "Inson Resurslari ",
        "type": [],
        "definition": [
            " modelida xodimlar ishlatilmagan zaxiralar manbayi va korxona umumiy tuzilmasida oqilona rejalashtirish va qarorlar qabul qilishning muhim imkoniyati sifatida ko'riladi. "
        ]
    },
    {
        "word": "Inson Resurslaridan Ekstensiv Foydalanish ",
        "type": [],
        "definition": [
            "ishchilar umumiy sonining, mehnatga layoqatli aholi bandligining o'sishi, mehnatga layoqatlilik davrining uzunligi, ish vaqtining uzunligi bilan ifodalanadi. "
        ]
    },
    {
        "word": "Inson Resurslaridan Intensiv Foydalanish ",
        "type": [],
        "definition": [
            "mehnat faoliyati samarasini oshirishni bildiradi va u mehnat unumdorligiga asoslanadi."
        ]
    },
    {
        "word": "Inson Resurslarini Boshqarish Fanining Predmeti ",
        "type": [],
        "definition": [
            "korxonalarning samarali faoliyat ko'rsatishini ta’minlash va islilovchilarning ehtiyojlarini qondirish maqsadida inson resurslariga maqsadga muvofiq ta sir ko'rsatish bilan bog'liq bilimlar tizimi. "
        ]
    },
    {
        "word": "Inson Resurslarini Boshqarish Subyekti ",
        "type": [],
        "definition": [
            "boshqaruvchi personal, obyekti esa ishlab chiqarish personalidir. "
        ]
    },
    {
        "word": "Inson Resurslarini Boshqarish Vazifalari ",
        "type": [],
        "definition": [
            "korxona va tashkilotlarning muayyan maqsadga erishish yo'lida inson resurslari bilan ishlaganda amalga oshiriladigan asosiy yo'nalishlaridir, ya ni personalni tanlash, personalni tayyorlash va rivojlantirish, unga baho berish, rag'batlantirishdir. "
        ]
    },
    {
        "word": "Inson Resurslarini Boshqarishning Zarur Obyekti ",
        "type": [],
        "definition": [
            "korxona va tashkilotning ijtimoiy muhitini rivojlantirishdir. "
        ]
    },
    {
        "word": "Inson Resurslarini Jalb Etish ",
        "type": [],
        "definition": [
            "ikki asosiy manba, ya’ni personalni jalb qilishning ichki va tashqi manbalari hisobiga ehtiyojni qondirishdir. "
        ]
    },
    {
        "word": "Inson Resurslarining Kasbiy Tuzilishi Tushunchasi ",
        "type": [],
        "definition": [
            "bir-biri bilan bog'liq bo'Igan quyidagi jihatlar, ya’ni ish kuchining kasbiy tuzilishi, uning malaka tuzilishi, malakaning mazmunidan iborat"
        ]
    },
    {
        "word": "Insoniy Kapital ",
        "type": [],
        "definition": [
            "o'qish va amaliy faoliyatdan olgan insonning intellektual qobiliyati va amaliy ko'nikmalari shaklidagi kapital."
        ]
    },
    {
        "word": "Insoniy Rtvojlanish Konsepsiyasi",
        "type": [],
        "definition": [
            "BMT tomonidan 90-yillarda ilgari surilgan. Unda taraqqiyot natijalarining inson bilan hamohan bo'lishi ko'zda tutiladi, moddiy boylik (yalpi milliy mahsulot bilan birgasog'lom hayot, savodxonlik, demokratik institutlar bilan birinchi o'ringa qo'yiladi (ayrim davlatlar kambag'al bo'lishiga qaramay, bu sohada yuqori natijaga erishmoqdalar va aksincha) hamda “ijtimoiy rivojlanish indeksi” (IRI) bilan o'lchanadi. "
        ]
    },
    {
        "word": "Insonparvarlik Yordami ",
        "type": [],
        "definition": [
            "aholining ijtimoiy jihatdan nochor guruhlariga tibbiy va ijtimoiy yordam ko'rsatish, ijtimoiy soha muassasalarini qo'llab-quwatlash, tabiiy ofatlar, falokatlar va halokatlar, epidemiyalar, epizootiyalar va boshqa favqulodda vaziyatlarning oldini olish hamda ularni bartaraf etish uchun aniq maqsadli beg'araz ko'maklashish. Insonparvarlik yordami dori vositalari va tibbiy ahamiyatga molik buyumlar, xalq iste’moli tovarlari, boshqa tovarlar, shu jumladan, asbob-uskunalar, transport va texnika, shuningdek, ixtiyoriy ravishdagi xayr-ehsonlar, bajarilgan ishlar va xizmadar, shu jumladan, insonparvarlik yordami yuklarini tashish, kuzatib borish va saqlash tariqasida beriladi hamda O'zbekiston Respublikasi Hukumati tomonidan vakolatli tashkilotlar orqali taqsimlanadi "
        ]
    },
    {
        "word": "Inspeksiya",
        "type": [],
        "definition": [
            "1. Taftish, tekshirish, nazorat. 2. Belgilangan qoida va qonunlarning turi bajarilishini tekshiruvchi idora. 3. Ayrim ma’muriy huquqqa ega bo'lgan, nazorat funksiyasini bajaruvchi davlat boshqaruv organi."
        ]
    },
    {
        "word": "Institutlar",
        "type": [],
        "definition": [
            "iqtisodiy subyektlar harakatini cheklovchi, ularning o'zaro munosabatlarini tartibga soluvchi me’yorlar, qoidalar hamda ushbu me’yor va qoidalar bajarilishini nazorat qilish mexanizmlari."
        ]
    },
    {
        "word": "Institutsion Birlik",
        "type": [],
        "definition": [
            "aktivlariga mustaqil mulkdorlik qilish qobiliyatiga ega bo'lgan, o'z zimmasiga majburiyatlar ola biladigan, boshqa shaxslar bilan iqtisodiy faoliyatda va operatsiyalarda ishtirok eta oluvchi iqtisodiy shaxslar. "
        ]
    },
    {
        "word": "Institutsion Reklama ",
        "type": [],
        "definition": [
            " firma obro'sini yaxshilashga qaratilgan tadbir. "
        ]
    },
    {
        "word": "Institutsional Birlik ",
        "type": [],
        "definition": [
            "mustaqil ravishda iqtisodiy faoliyat yurituvchi birlikdir. "
        ]
    },
    {
        "word": "Institutsional Investorlar ",
        "type": [],
        "definition": [
            "mutaxassislar bo'lib, ularga begonalaming pulini boshqargani uchun haq to'lanadi. "
        ]
    },
    {
        "word": "Institutsionalizm",
        "type": [],
        "definition": [
            "lotincha “urf-odat”, “muassasa”, “ko'rsatma”, ya’ni ayrim institutlar (oila, davlat, monopoliya, kasaba uyushmasi) ijtimoiy taraqqiyotning asosi deb qabul qilgan nazariya. XX asrning 20-30-yillarida AQSHda keng tarqalgan. T. Veblen (1857-1920), J.R. Kommons (1862-1945), U.K. Mitchell (1874-1948), J. Gobson (1858-1940) va boshqalar bu nazariyaning 20-30-yillardagi vakillaridir. Klark, Berli, G. Minz (50-yillar), Lou, Myurdal, Gelbreyt, Xeylbroner (60-yillar va hozirgi davr)lar esa obyektiv iqtisodiy qonunlar mavjudligini inkor etadilar. "
        ]
    },
    {
        "word": "Institutsional Siyosat ",
        "type": [],
        "definition": [
            "davlat tomonidan mulkchilik, mehnat, moliyaviy, ijtimoiy va boshqa sohalarda yangi iqtisodiy institutlarni shakllantirish, eskilariniyo'qotish, mavjudlarini transformatsiyalash bo'yicha amalga oshiriladigan chora-tadbirlar, xatti-harakatlar. "
        ]
    },
    {
        "word": "Instruksiya",
        "type": [],
        "definition": [
            "instruksiya, yo'l-yo'riq, qo'llanma, ko'rsatma; qonun yoki boshqa normativ aktni tushuntirish maqsadida chiqariladigan hujjat. "
        ]
    },
    {
        "word": "Integratsiya",
        "type": [],
        "definition": [
            "1. Turli bo'limlar, elementlar harakatining bir butunga birlashish jarayoni. 2. Iqtisodiy integratsiya - iqtisodiy subyekt (davlat, korxona, firma)larning iqtisodiy, texnologik munosabatlarning o'zaro bog'liqligi oshishi natijasida vujudga keladi. Vertikal va gorizontal integratsiya ko'rinishida bo'lishi mumkin. Ishlab chiqaruvchi kuchlar o'sishi natijasida mehnat"
        ]
    },
    {
        "word": "Intellekt",
        "type": [],
        "definition": [
            "shaxsning turli faoliyat turlarini muvaffaqiyat bilan o zlashtirishini belgilaydigan tug'ma va o'zlashma barcha aqliy qobiliyatlar to'plami. "
        ]
    },
    {
        "word": "Intellektual Investitsiyalar ",
        "type": [],
        "definition": [
            "mutaxassislarni tayyorlash, tajriba, ilmiy tekshirish, litsenziya va nou-xau berish, mualliflik huquqi va boshqalar. "
        ]
    },
    {
        "word": "Intellektual Mulk (Aqliy Mulk) ",
        "type": [],
        "definition": [
            " ijodiy aqliy mehnat mahsuli. Fan, adabiyot,san’atvaishlabchiqarishsohasidaijodiyfaoliyatningboshqa turlari, asarlari, jumladan, kashfiyotlar, ixtirolar, ratsionalizatorlik takliflari, sanoat namunalari, EHM uchun dasturlar, berilmalar bazasi, nou-xauning ekspert tizimlari, savdo sirlari, tovar belgilari, firma atamalari va boshqalar aqliy mulk obyektlariga kiradi. "
        ]
    },
    {
        "word": "Intensiv Iqtisodiy Oʻsish ",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonini ishlab chiqarish maydonlaridan, ish o'rinlaridan ishlab chiqarishni ikki, uch smenali tashkil etish yoki ekin maydonlaridan ikki marotaba hosil olish, hosildorlikni oshirishga aytiladi. "
        ]
    },
    {
        "word": "Intensiv Rtvojlanish Yoʻli ",
        "type": [],
        "definition": [
            " intensiv, jadallik, tezlik bilan rivojlanish yo ‘ li. Ishlab chiqarishga tobora samaraliroq ishlab chiqarish vositalari va texnologik jarayonlarni qo'llash, mehnatni tashkil etishning ilg'or usullari, fan-texnika jarayoni yutuqlaridan foydalanish asosida rivojlantirish. "
        ]
    },
    {
        "word": "Intensiv Taqsimot",
        "type": [],
        "definition": [
            " tovar zaxiralari naqdligini iloji boricha son jihatdan ko'proq savdo korxonalarida ta’minlash. "
        ]
    },
    {
        "word": "Intermodal Markaz ",
        "type": [],
        "definition": [
            " yuk tashishlar bo'yicha xalqaro kommunikatsiya va logistika markazi. "
        ]
    },
    {
        "word": "Internet",
        "type": [],
        "definition": [
            "hisoblash tarmoqlari tizimi bo'lib, o'zaro aloqa tarmoqlari kanallarini birlashtirib, axborotlarni uzatadi. Axborotlarni jo'natish tarmog'ida qayta ishlab ixchamlashtiradi va qabul qilish tarmog'ida protokol shakliga aylantiradi. Internet-matn, grafik, audio va video axborot ayirboshlash hamda hech qanday hududiy va milliy chegaralarsiz jonli aloqa xizmatlaridan foydalanishni ta’minlovchi global kommunikatsiya vositasidir. "
        ]
    },
    {
        "word": "Internet Xizmatlari ",
        "type": [],
        "definition": [
            "internet tarmog'i abonentlariga amaliy bayonnomalar tomonidan taqdim etiluvchi funksional imkoniyatlar majmuyi: elektron pochta, fayllami qabul qilish va uzatish, veb- hujjatlarni o'qish, muayyan masofadan turib bir vaqtning o'zidagi muloqot (chat), terminal orqali erkin foydalanish, tarmoqda hujjatlarni saqlash, ishlash va h.k."
        ]
    },
    {
        "word": "Intervyu",
        "type": [],
        "definition": [
            "intervyuerning respondent bilan bevosita, maqsadga muvofiq suhbati orqali ma’lumot olish usulidir. Foydalanish darajasi va olingan ma’lumotning ishonchliligi bo'yicha u eng asosiy usullardan sanaladi. "
        ]
    },
    {
        "word": "Intizomiy Javobgarlik ",
        "type": [],
        "definition": [
            "xizmat burchlarini buzish, suyiiste’mol qilish natijasida kelib chiqadi. "
        ]
    },
    {
        "word": "Intizomiy Taʼsir ",
        "type": [],
        "definition": [
            " ular tashkiliy aloqalar muvozanatini intizomiy talablar va mas’uliyatlar tizimi vositasida ushlab turishga mo'ljallangan. "
        ]
    },
    {
        "word": "Introversiya",
        "type": [],
        "definition": [
            "(intro - ichki) - shaxsning o'z shaxsiy manfaatlariga, ichki olamiga diqqat-e’tibori qayd qilinishi bilan ajralib turadi. "
        ]
    },
    {
        "word": "Inventar Kartochkalar ",
        "type": [],
        "definition": [
            " asosiy vositalar (fondlar) ning hisobi uchun mo'ljallangan hisob registrining shakli. Inventar kartochkalar har bir obyekt xo'jalikka keltirilganda tuziladi. "
        ]
    },
    {
        "word": "Inventar Obyekti ",
        "type": [],
        "definition": [
            "tugallangan qurilish, buyum yoki kompleks inventar obyekti asosiy vositalar tarkibida hisobga olinadi. Har bir korxonada inventar obyektlar ko'p bo'lib, ularning har biri bo'yicha hisobni to'g'ri tashkil etish uchun inventar raqam belgilanadi."
        ]
    },
    {
        "word": "Inventar Raqam I ",
        "type": [],
        "definition": [
            "inventar obyektga biriktirilgan raqam. Inventar raqami asosiy vositalar (fondlar) hisobini to'g'ri tashkil etish va obyektlarning saqlanishini ta'minlash uchun zarur hisoblanadi. Bir turdagi buyumlarning guruhi uchun shu obyektlarning haqiqiy holati, eng ko'p qiymatini hisobga olgan holda, raqamlar seriyasi ajratiladi. Buxgalteriya hujjatlarida asosiy vositalar hisobida ushbu inventar raqamlar ko'rsatiladi. "
        ]
    },
    {
        "word": "Inventarizatsiya",
        "type": [],
        "definition": [
            "natura shaklidagi mavjud mablag'lar haqiqiysining buxgalteriya hisobi ma’lumotlariga to'g'ri kelishini, majburiyatlar hisobda to'g'ri aks ettirilishini tekshirish usuli. Ubuxgalteriya hisobi ko'rsatkichlari ishonchliligi va korxona mulki butligini ta’minlaydi. Xo'jalik yurituvchi subyekt, shu jumladan, asosiy faoliyati budjet mablag'larihisobigamoliyalanadigantashkilottomonidanmol-mulk hamda moliyaviy majburiyatlarni inventarizatsiya qilish va uning natijalarini rasmiylashtirish tartibi O'zbekiston Respublikasining 19-Buxgalteriya hisobi milliy standarti ‘‘Inventarizatsiya qilishni tashkil etish va o'tkazish” bilan tartibga solinadi. Rejali va rejadan tashqariinventarizatsiyahambo' lishimumkin. Rejaliinventarizatsiya yo'riqnomalarda ko'rsatilgan muddatlarda o'tkaziladi, rejadan tashqarisi zaruriyat tug'ilishiga qarab, odatda, to'satdan o'tkaziladi. Inventarizatsiyani to‘g‘ri va o'z vaqtida o'tkazish mas’uliyati korxona rahbari va bosh (katta) buxgalteriga yuklatiladi. Korxona rahbarining buyrug'iga binoan, korxona xodimlari safidan ishchi inventarizatsiya komissiyasi tashkil etiladi va unda bosh (katta) buxgalter qatnashadi. Komissiyasini korxona rahbari yoki uning yordamchisi boshqaradi. Inventarizatsiya, albatta, moddiy javobgar shaxslar ishtirokida o'tkaziladi. "
        ]
    },
    {
        "word": "Investitsion Siyosat ",
        "type": [],
        "definition": [
            "kapital qo'yilmalarning eng ustivor yo'nalishlarini tanlash, iqtisodiyot samaradorligini oshirish, sarflangan har bir so'mga mahsulot o'sishi va milliy daromadning eng yuqori ko'rsatkichlariga erishish. "
        ]
    },
    {
        "word": "Investit Siya ",
        "type": [],
        "definition": [
            "(nem. investitlion, lot. Investere - kiyintirmoq) - investor tomonidan biror-bir faoliyatni amalga oshirish uchun kapital mablag'lar, sarmoyalarni joriy qilish va foyda olish maqsadida sarf qilish. Investitsiya mamlakat ichida (ichki investitsiya) va xorijiy mamlakatlarda (tashqi investitsiya) amalga oshirilishi mumkin. Moliya investitsiyasi - qimmatbaho qog'ozlami xarid qilish, pul mablag'larini jamg‘arish va boshqalarni, real investitsiya - moddiy ishlab chiqarishga sarflangan sarmoyalarni o‘z ichiga oladi. "
        ]
    },
    {
        "word": "Investitsion Hamkorlik ",
        "type": [],
        "definition": [
            "xalqaro iqtisodiy munosabatlarning bir ko'rinishi bo'lib, resurslarni ratsional taqsimlash, xalqaro mehnat taqsimotida ishtirok etish natijasidagi ustunliklaridan foydalanish orqali davlat tomonidan iqtisodiyotda nisbatan yuqori natijalarga erishish, texnologik ishlab chiqarish tuzilmasini yangilash kabilarni maqsad qilgan. "
        ]
    },
    {
        "word": "Investitsion Kreditlar ",
        "type": [],
        "definition": [
            "ishlab chiqarishni kengaytirish, texnik va texnologik jihatdan yangilash, modernizatsiyalash va rekonstruksiya qilish, yangi bino va inshootlar qurish uchun zarur bo'lgan vositalar hamda qimmatli qog'ozlar sotib olish maqsadida olingan uzoq muddatli kreditlar. "
        ]
    },
    {
        "word": "Investitsion Loyiha ",
        "type": [],
        "definition": [
            "ma’lum ijtimoiy-iqtisodiy maqsadlarga yo'naltirilgan, texnik-iqtisodiy, biznes-boshqaruv, marketing va ishlab chiqarish rejalari kabi aspektlar asoslangan, turli moliyaviy manbalar mablag'lari ishtiroki nazarda tutilgan kompleks hujjatlar yig'indisi hisoblanadi. "
        ]
    },
    {
        "word": "Investitsion Loyiha Dasturi ",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasida qabul qilingan qonunchilik andozalariga muvofiq ishlab chiqilgan zaruriy hujjatlarni hisobga olgan holda kapital qo'yilmalar hajmi va amalga oshirish muddatining maqsadga muvofiqligini asoslovchi va investitsiyalarni (biznes-reja) amalga oshirish bo'yicha amaliy faoliyat dasturi. "
        ]
    },
    {
        "word": "Investitsion Loyihani Oqlash Muddati ",
        "type": [],
        "definition": [
            "joriy foydalar yig'indisi investitsiya qiymatiga tengbo'lishini ta’minlovchi minimal vaqt oralig'i. "
        ]
    },
    {
        "word": "Investitsion Muhit ",
        "type": [],
        "definition": [
            "muayyan mamlakat (yoki hudud)ga investitsiyalar kiritishning maqsadga muvofiqligi va jozibadorligini belgilaydigan, iqtisodiy, ijtimoiy, tashkiliy, siyosiy va boshqa shart-sharoitlar mavjudligining ijobiy yoki salbiy tomonlarini anglatadi."
        ]
    },
    {
        "word": "Investitsion Siyosat ",
        "type": [],
        "definition": [
            "kapital qo'yilmalarning eng ustivor yo'nalishlarini tanlash, iqtisodiyot samaradorligini oshirish, sarflangan har bir so'mga mahsulot o'sishi va milliy daromadning eng yuqori ко‘rsatkich 1 ariga erishish. "
        ]
    },
    {
        "word": "Investitsion Soliq, Krediti ",
        "type": [],
        "definition": [
            "soliq majburiyati bo'yicha to'lash muddatini o'zgartirish imkoniyati beriladi. Agarda soliq to'lovchida belgilangan tartibdagi asos bo'lsa, u holda soliq to'lovlarini kamaytirilgan holda ma’lum bir vaqt ichida bosqichma-bosqich to'lash mumkin bo'ladi. "
        ]
    },
    {
        "word": "Investitsiya Aktivlari ",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar, pul mablag'lari va qonun hujjatlariga muvofiq investitsiya aktivlari deb e’tirof etiladigan boshqa mol-mulk. "
        ]
    },
    {
        "word": "Investitsiya Banklari ",
        "type": [],
        "definition": [
            "iqtisodiyotni rivojlantirish maqsadida xalq xo'jaligining turli sohalarini moliyalash uchun uzoq muddatli qarz berishga asoslangan banklar. "
        ]
    },
    {
        "word": "Investitsiya Dasturi ",
        "type": [],
        "definition": [
            "respublika iqtisodiyotini barqaror va tadrijiy rivojlantirishga erishishga, tabiiy, mineral xomashyo, moliyaviy, moddiy va mehnat resurslaridan oqilona foydalanish yo'li bilan respublikaning ayrim tarmoqlari va mintaqalarini tarkibiy o'zgartirishning asosiy ustuvorliklari hamda strategik vazifalarini amalga oshirishga yo'naltirilgan bir-biri bilan o'zaro bog'langan chora-tabdirlar kompleksi. "
        ]
    },
    {
        "word": "Investitsiya Faoliyati ",
        "type": [],
        "definition": [
            "investitsiya faoliyati subyektlarining investitsiyalarni amalga oshirish bilan bog'liq bo'lgan harakatlari majmuasi tushuniladi. "
        ]
    },
    {
        "word": "Investitsiya Faoliyati Ishtirokchilari ",
        "type": [],
        "definition": [
            "buyurtmachilar, pudratchilar, yetkazib beruvchilar, banklar, sug'urta kompaniyalari, loyihalovchilar, vositachilar, ilmiy-maslahat firmalari, o'z mamlakatidagi qonunchilikka ko'ra investitsiyaviy mulk egalari (tasarrufchilari) yoki buyurtmalardan foydalanuvchi sifatida qatnasha oluvchi xorijiy tashkilotlar. "
        ]
    },
    {
        "word": "Investitsiya Fondlari ",
        "type": [],
        "definition": [
            "faoliyatini o'z aksiyalarini chiqarib, aholi o'rtasida tarqatishyo'libilanmablag'laryig'ib,keyino'zmablag'larini maxsus davlat kreditlariga, davlat xazinamajburiyatlariga investitsiya qiluvchi va qimmatli qog'ozlar oldi-sotdi bitimlarini bajaruvchi ochiq turdagi aksioner jamiyatdir. "
        ]
    },
    {
        "word": "Investitsiya Institutlari ",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar bilan o'z faoliyatini asosiy faoliyat sifatida amalga oshiruvchi qimmatli qog'ozlar bozorining professional ishtirokchilari. "
        ]
    },
    {
        "word": "Investitsiya Jarayoni ",
        "type": [],
        "definition": [
            "pul taklif qiluvchilar (vaqtincha bo'sh mablag'larga ega bo'lganlar)ni pul talab qilayotganlar (ularga ehtiyoj sezayotganlar) bilan uchrashtirish mexanizmi. "
        ]
    },
    {
        "word": "Investitsiya Jarayoni Ishtirokchilari ",
        "type": [],
        "definition": [
            "investitsiya jarayonining bosh ishtirokchilari - davlat, kompaniyalar va xususiy shaxslar bo'lib, ularning har biri investitsiya jarayonida talab tomonida yoki taklif tomonida turib ishtirok etishi mumkin. "
        ]
    },
    {
        "word": "Investitsiya Kompaniyasi ",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarni chiqarish, qimmatli qog'ozlarga mablag'lar sarflash, qimmatli qog'ozlarni o'z nomidan va o'zi hisobidan olish-sotish ishlarini amalga oshiruvchi yuridik shaxs. "
        ]
    },
    {
        "word": "Investitsiya Kompleksi ",
        "type": [],
        "definition": [
            " investitsiya faoliyatini taminlovchi tashkilotlar, korxonalar va firmalar majmuasi. "
        ]
    },
    {
        "word": "Investitsiya Lagi ",
        "type": [],
        "definition": [
            "investitsiyalarni amalga oshirish va ularning o'z xarajatlarini o'zi qoplashi o'rtasidagi vaqt uzilishi. Barcha ishlab chiqarish kapital mablag'larning (shu jumladan uskunalarga sarflarning) oborotini, ishlab chiqarish obyekti ko'rilishining o'rtacha muddatini xarakterlaydigan ko'rilish lagi, ishga tushirilgan obyektning loyiha quwatiga erishishi uchun zarur bo'Igan o'rtacha muddatni xarakterlaydigan o'zlashtirish lagini o'z ichiga oladi. "
        ]
    },
    {
        "word": "Investitsiya Loyihasi ",
        "type": [],
        "definition": [
            "investitsiyaning yo'naltirilgan maqsadini amalga oshirish uchun texnologik jarayonlarni, texnik va tashkiliy hujjatlashtirish jarayonini, obyektlarni barpo etish va ishga tushirish jarayonini, moddiy, moliyaviy, mehnat resurslarining harakatini, shuningdek, tegishli boshqaruv qarorlari va chora-tadbirlarni o'zida mujassamlashtiruvchi tizim. "
        ]
    },
    {
        "word": "Investitsiya Maslahatchisi ",
        "type": [],
        "definition": [
            " maslahat faoliyati bilan shug'ullanuvchi investitsiya instituti. "
        ]
    },
    {
        "word": "Investitsiya Mukofoti ",
        "type": [],
        "definition": [
            " investitsiyalash jarayoni bir tekis ketishi uchun pul yetkazib beruvchilar mukofot olishi, pul xaridorlari esa ushbu mukofotni ta’minlashlari lozim. Mukofot miqyosi va shakli qimmatli qog'ozlar bilan bitishuvlaming xilma-xilligiga bog'liq. "
        ]
    },
    {
        "word": "Investitsiya Obyekti ",
        "type": [],
        "definition": [
            "mablag'lar, ya’ni boyliklarni safarbar etayotgan obyektlar tushuniladi. Ular yangi korxonalar yoki amaldagi korxonalar, qimmatli qog'ozlar, bank depozitlari bo'lishi mumkin. "
        ]
    },
    {
        "word": "Investitsiya Resurslari ",
        "type": [],
        "definition": [
            "investitsion faoliyatni amalga oshirishda ishtirok etadigan har xil ko'rinishdagi mablag'lar. "
        ]
    },
    {
        "word": "Investitsiya Sektori ",
        "type": [],
        "definition": [
            "vazifalariga istiqbolli sohalarga investitsiya kiritish, investitsion faoliyatning samaradorligini monitoring qilish va rivojlanish rejalarini ishlab chiqish kiradi. "
        ]
    },
    {
        "word": "Investitsiya Subsidiyalari ",
        "type": [],
        "definition": [
            "davlat budjeti hisobidan rezident va norezident birliklarga asosiy kapitalni moliyalashtirish uchun sarf qilingan xarajatlar dan, bepul berilgan natura holidagi kapital transfert (mashinalar, uskunalar, binolar, inshootlar va boshqalar) lardan iborat. "
        ]
    },
    {
        "word": "Investitsiya Subyektlari ",
        "type": [],
        "definition": [
            "investitsiya faoliyatida ishtirok etuvchi mulkiy va intellektual boyliklarga ega bo'lgan jismoniy, huquqiy shaxslar va davlat. "
        ]
    },
    {
        "word": "Investitsiya Talabi ",
        "type": [],
        "definition": [
            " korxonalar tomonidan investitsiyaga bo'lgan talab yagona emas, ammo zayom mablag1 lariga bo'lgan talab pirovard talabning asosiy omili hisoblanadi. "
        ]
    },
    {
        "word": "Investitsiyachi ",
        "type": [],
        "definition": [
            "investitsiyani amalga oshiruvchi mablag' egasi. "
        ]
    },
    {
        "word": "Investitsiyalarga Boʻlgan Moyillik ",
        "type": [],
        "definition": [
            "investitsiya xarajatlarining daromaddagi hissasi. "
        ]
    },
    {
        "word": "Investitsiyalarni Kafolatlash Boʻyicha Koʻp Tomonlama Agentlik ",
        "type": [],
        "definition": [
            "1998-yilda rivojlanayotgan mamlakatlarda xususiy investorlarga ko'maklashish uchun tuzilgan, bundan maqsad investorlarni notijoriy xatarlardan himoya qilishdir. "
        ]
    },
    {
        "word": "Investitsiyalash",
        "type": [],
        "definition": [
            " maxsus tanlangan moliyaviy qurollarga pul qiymatini ko'paytirish yoki ijobiy daromad olish maqsadida joylashtirish jarayoni. "
        ]
    },
    {
        "word": "Investitsiyalashda Xarajatlar Ketma-Ketligi ",
        "type": [],
        "definition": [
            "amalda investitsiyalashga xilma-xil yondashuvlardan foydalaniladi. Ulardan biri aniq maqsadlarga erishishga yo'naltirilgan xarajatlarni chuqur rejalashtirishdan iborat. "
        ]
    },
    {
        "word": "Investitsiyalashning Ijodiy Ahamiyati ",
        "type": [],
        "definition": [
            "xususiy shaxslar pullarni yetkazib beruvchilar bo'lib hisoblanar ekan, davlat va kompaniyalar ularning sof xaridorlaridir. Investitsiyalash jarayoni juda salmoqli natijalarga ega. "
        ]
    },
    {
        "word": "Investitsiyani Ichki Oqlash Normasi ",
        "type": [],
        "definition": [
            "investitsion loyiha samaradorligi ko'rsatkichi. Investitsiya (minus bilan olingan) qiymati bilan kelajakda olinadigan sof foydaning diskontirlangan qiymati yig'indisini nolga aylantiruvchi ichki qaytim normasi. "
        ]
    },
    {
        "word": "Investitsion Kreditlar ",
        "type": [],
        "definition": [
            " ishlab chiqarishni kengaytirish, texnik va texnologik jihatdan yangilash, modernizatsiyalash va rekonstruksiya qilish, yangi bino va inshootlar qurish uchun zarur bo'lgan vositalarni sotib olish maqsadida olingan kreditlar. "
        ]
    },
    {
        "word": "Investitsion Soliq, Krediti ",
        "type": [],
        "definition": [
            "soliq majburiyati bo'yicha to'lash muddatini o'zgartirish imkoniyati beriladi. Agarda soliq to'lovchida belgilangan tartibdagi asos bo'lsa, u holda soliq to'lovlarini kamaytirilgan holda ma’lum bir vaqt ichida bosqichma-bosqich to'lash mumkin bo'ladi. "
        ]
    },
    {
        "word": "Investor",
        "type": [],
        "definition": [
            "1. Qimmatbaho qog'ozlar, masalan, aksiyalarni sotib olish orqali ma’lum sohani moliyalashtirishga o'z ulushini qo'yuvchi yuridik yoki jismoniy shaxs. 2. Investitsion faoliyat subyekti bo'lib, u o'zining ma’lum mablag'larini investitsiyalar shaklida ulardan maqsadli foydalanishi uchun joylashtiradi. Investor qaror qabul qiluvchi va o'zining shaxsiy, qarzga olingan mablag'lari va boshqa jalb qilingan mulkiy va madaniy boyliklarini investitsion loyihaga kirituvchi jismoniy va yuridik shaxsdir. U omonatchi va qarz beruvchi rolida chiqishi mumkin bo'lib, amalga oshiruvchi investitsiyalarning yo'nalishi va samarasini erkin holda aniqlaydi. Investor qarori bilan investitsiyalarga egalik qilish, ishlatish, foydalanish huquqi jismoniy va yuridik shaxslarga qonunda ko'rsatilgan tartibda berilishi mumkin. Odatda, investorlar kapital qo'yilmalar sarflanadigan sohalarni aniqlaydi, kontrakt va shartnomalar shartlarini ishlab chiqadi va investitsiya aktining boshqa tomonlari bilan - kontraktor, hukumat organlari, pirovard mahsulot ishlab chiqaruvchilar va shu mahsulot iste’molchilari bilan hisob-kitoblami amalga oshiradi. "
        ]
    },
    {
        "word": "Investorlar Tipi ",
        "type": [],
        "definition": [
            " ikki tipdagi investorlar bor: ular institutsional va yakka investorlar. "
        ]
    },
    {
        "word": "Invois",
        "type": [],
        "definition": [
            " schyot-faktura (q). "
        ]
    },
    {
        "word": "Investitsiya",
        "type": [],
        "definition": [
            " milliy iqtisodiyotning sanoat, qishloq xo'jalik, transport va boshqa tarmoqlariga uzoq muddatli kapital qo'yilmalar. Investitsiya, asosan, aksionerlik jamiyatining aksiyalari va obligatsiyalarini sotib olish tarzida amalga oshiriladi. Investitsiya bu biron-bir tadbirga, ishga oddiy kapital qo'yish emas, balki uzoq muddatli mablag' qo'yishdir. Aktivlarni investitsiyalarga kiritish tartibi 12-son “Moliyaviy Investitsiyalar hisobi”, 8-son “Konsolidatsiyalashtirilgan moliyaviy hisobotlar va avlod xo'jalik jamiyatlariga Investitsiyalar hisobi”, 14-son “Moliyaviy hisobotda qo'shma faoliyatda qatnashish ulushini aks ettirish” nomli Buxgalteriya hisobining milliy standartlari (BHMS) asosida amalga oshiriladi."
        ]
    },
    {
        "word": "Investitsiya Dasturi ",
        "type": [],
        "definition": [
            "ishlab chiqarishni rivojlantirish maqsadida mamlakat yoki chet ellarda iqtisodiyotning turli tarmoqlariga uzoq muddatli kapital kiritish uchun ishlab chiqilgan dastur."
        ]
    },
    {
        "word": "Investitsiya Faoliyati ",
        "type": [],
        "definition": [
            " investitsiya maqsadlarini amalga oshirish bilan bog'liq faoliyat. Investitsiya kompleksi tashkilotlari orqali amalga oshiriladi. "
        ]
    },
    {
        "word": "Investitsiya Faoliyati Ishtirokchilari ",
        "type": [],
        "definition": [
            "buyurtmachilar, pudratchilar, yetkazib beruvchilar, banklar, sug'urta kompaniyalari, loyihalovchilar, vositachilar, ilmiy-maslahat firmalari, o'z mamlakatidagi qonunchilikka ko'ra investitsiyaviy mulk egalari (tasarrufchilari) yoki buyurtmalardan foydalanuvchi sifatida qatnasha oluvchi xorijiy tashkilotlar. "
        ]
    },
    {
        "word": "Investitsiya Kompleksi ",
        "type": [],
        "definition": [
            " investitsiya faoliyatini ta’minlovchi tashkilotlar, korxonalar va firmalar majmuasi. "
        ]
    },
    {
        "word": "Investitsiya Muhiti ",
        "type": [],
        "definition": [
            "investitsiyalar jozibadorligi hamda xavf-xatar darajasini belgilab beruvchi ijtimoiy-iqtisodiy, moliyaviy va siyosiy omillar majmuyi. "
        ]
    },
    {
        "word": "Investitsion Kreditlar ",
        "type": [],
        "definition": [
            "ishlab chiqarishni kengaytirish, texnik va texnologikjihatdan yangilash, modernizatsiyalash va rekonstruksiya qilish, yangi bino va inshootlar qurish uchun zarur bo'lgan vositalar hamda qimmatli qog'ozlarni sotib olish maqsadida olingan uzoq muddatli kreditlar. "
        ]
    },
    {
        "word": "Investitsion Siyosat ",
        "type": [],
        "definition": [
            "savdo menejmenti umumiy strategiyasining bir qismi bo'lib, korxonani rivojlantirish uchun aktivlarni kengaytirishning eng samarali yo'llarini tiklashni nazarda tutadi. "
        ]
    },
    {
        "word": "Investitsiya",
        "type": [],
        "definition": [
            "korxonaning o'zi amalga oshirgan quyidagi: - yangi qurilish shaklidagi kapital qurilish, ishlab turgan korxonalarni rekonstruksiyalash,kengaytirishvatexnikaviy qayta qurollantirishga sarflangan mablag'lar; - imoratlar, inshootlar, asbob-uskunalar, transport vositalari (ularning qismlar)ni ishlab chiqarish maqsadida sotib olishga sarflangan mablag'lar kiradi. "
        ]
    },
    {
        "word": "Investitsiya Aktivlari ",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar, pul mablag'lari va qonun hujjatlariga muvofiq investitsiya aktivlari deb e’tirof etiladigan boshqa mol-mulk."
        ]
    },
    {
        "word": "Investitsiya Faoliyati ",
        "type": [],
        "definition": [
            "investitsiya maqsadlarini amalga oshirish bilan bog'liq faoliyat. Investitsiya kompleksi tashkilotlari orqali amalga oshiriladi. "
        ]
    },
    {
        "word": "Investor",
        "type": [],
        "definition": [
            "xususiy va qarzga olingan mulkiy va intellektual qiymatlarni sarflash haqida qaror qabul qiluvchi investitsiya faoliyati subyektlari. Investorlar obyektlar va investitsiya natijalariga egalik qilish, foydalanish va tasarruf qilish huquqiga ega bo'ladi. Investorlar kreditorlar va xaridorlar rolini bajarishlari, shuningdek, investitsiya faoliyatining boshqa ishtirokchilari funksiyalarini bajarishlari mumkin. Odatda, investorlar kapital qo'yilmalar sarflanadigan sohalarni aniqlaydi, kontrakt va shartnomalar shartlarini ishlab chiqadi va investitsiya aktining boshqa tomonlari bilan - kontraktor, hukumat organlari, pirovard mahsulot ishlab chiqaruvchilar va shu mahsulot iste’molchilaribilanhisob-kitoblarni amalga oshiradi."
        ]
    },
    {
        "word": "Iogann Genrix Fon Tyunen ",
        "type": [],
        "definition": [
            "(1783-1850) - nemis olimi, ekonometrikada matematik modellashtirish bo'yicha yirik mutaxassis."
        ]
    },
    {
        "word": "Ipoteka",
        "type": [],
        "definition": [
            "(yunon. Hypotheke - garov) - qarz, kredit olish uchun biror-bir muayyan ko'chmas mulk (yer, imorat va hokazo) ni garovga qo'yish. Bunda garovga qo'yilgan mulk qarz oluvchining tasarrufida qoladi. "
        ]
    },
    {
        "word": "Ipoteka Krediti ",
        "type": [],
        "definition": [
            "joylarda tasdiqlangan namunaviy loyihalar bo'yicha yakka tartibdagi uy-joy qurilishiga barpo etiladigan uy-joy garovi ostida beriladigan uzoq muddatli kredit. Ipoteka kreditlari tijorat banklari tomonidan qaytarishlik, to'lovlilik, taminlanganlik va muddatlilik shartlarida beriladi. "
        ]
    },
    {
        "word": "Iqtisod",
        "type": [],
        "definition": [
            " (yunoncha - uy xo'jaligini yuritish sanati) - fan, tovarlarni ishlab chiqarish va ayirboshlash xususida insonlarning xo'jalik faoliyatini o'rganadi. Ushbu atama birinchi marta Arastu tomonidan qo'llanilgan (Qarang: Arastu). "
        ]
    },
    {
        "word": "Iqtisodiy Aktiv ",
        "type": [],
        "definition": [
            "shunday iqtisodiy obyektki, unga institutsion birliklar qonun bo'yicha yolg'iz yoki jamoa tartibida mulkka egalik qiladi va ana shu egalik yoki undan foydalanish tufayli mulkdor yoki mulkdorlar muayyan davr mobaynida iqtisodiy manfaat (samara) ko'radi. "
        ]
    },
    {
        "word": "Iqtisodiy Boshqaruv Usullari ",
        "type": [],
        "definition": [
            "boshqaruv subyekti va obyekti o'rtasidagi munosabatlarni mamlakat va hududning soliq tizimi, moliya-kredit mexanizmi, bojxona tizimi, sifatli mehnat uchun motivatsiya tizimi, menejment maqsadlarini muvofiqlashtirish usullarini qo'llash yordamida iqtisodiy tartibga solish usullaridir"
        ]
    },
    {
        "word": "Iqtisodiy Eksperiment",
        "type": [],
        "definition": [
            "ilmiy asosda amalga oshirilgan iqtisodiyotni rivojlantirish va boshqarishni takomillashtirish sohasidagi u yoki bu g'oyalar yoxud gipotezalarni amalda tekshirishni maqsad qilib qo'yadigan tajriba. Iqtisodiy eksperiment quyidagi tartibda o'tkaziladi: nazariy va tashkiliy tayyorgarlik, iqtisodiy-matematik modellash, eksperiment borishini kuzatish, yakun chiqarish, natijalaridan foydalanish xususida xulosalar va takliflar chiqarish. "
        ]
    },
    {
        "word": "Iqtisodiy Faol Aholi ",
        "type": [],
        "definition": [
            "aholining tovarlar ishlab chiqarish va xizmatlar ко‘rsatish uchun ishchi kuchini taklif etishni ta’minlaydigan qismi. Iqtisodiy faol aholi soni ish bilan bandlar va ishga joylashishga muhtoj shaxslami o'z ichiga oladi. "
        ]
    },
    {
        "word": "Iqtisodiy Faoliyat ",
        "type": [],
        "definition": [
            "inson tirikchiligini ta’minlash usullari va vositalari majmuyidir. "
        ]
    },
    {
        "word": "Iqtisodiy Foyda ",
        "type": [],
        "definition": [
            "firmaning umumiy daromadi (tushumi) va barcha xarajatlari o'rtasidagi ayirma. Agar korxona qiyinchilik bilan ishlab chiqarish xarajatlarini qoplayotgan bo'Isa, unda iqtisodiy foyda ololmaydi. Iqtisodiy foyda ishlab chiqarish xaraj atlariga kiritilmaydi. Agar buxgalteriya xarajatlaridan kapital foiz daromadi, yer va imoratlarga renta va boshqaruv uchun to'lov chegirib tashlansa, iqtisodiy foyda qoladi. U ishbilarmonlik qobiliyatini ishga solib, aql-idrok bilan ish yuritish, tavakkalchilik qilgani uchun tegadigan mukofotdir. "
        ]
    },
    {
        "word": "Iqtisodiy Hamkorlik ",
        "type": [],
        "definition": [
            "xalqaro savdoni boshqarish maqsadida birlashgan davlatlar guruhi. "
        ]
    },
    {
        "word": "Iqtisodiy Hudud ",
        "type": [],
        "definition": [
            "rezident birliklarning erkin faoliyat yuritish huquqiga ega bo'lgan hududlar majmuasidan iborat. "
        ]
    },
    {
        "word": "Iqtisodiy Inqiroz ",
        "type": [],
        "definition": [
            "ijtimoiy ishlab chiqarish harakatida uzilishlar, nomutanosibliklar yuzaga kelishi. Iqtisodiy inqiroz davrida ayrim tovarlarni ortiqcha ishlab chiqarish yoki ishlab chiqarishning qisqarishi, baholarning pasayishi yoki ko'tarilishi, ishsizlar sonining ortishi, ish haqining pasayishi, aholi turmush darajasining yomonlashuvi kabi holatlarda namoyon bo'ladi."
        ]
    },
    {
        "word": "Iqtisodiy Integratsiya ",
        "type": [],
        "definition": [
            "milliy xo'jaliklar o'rtasida chuqur, barqaror o'zaro aloqalar va mehnat taqsimoti, ularning turli bosqich va har xil shakldagi takroriy ishlab chiqarish tuzilmalarining o'zaro aloqalari asosida mamlakatlarning xo'jalik-siyosiy jihatdan birlashuvi jarayoni. "
        ]
    },
    {
        "word": "Iqtisodiy Ishlab Chiqarish ",
        "type": [],
        "definition": [
            "institutsion birlik nazorati ostida mehnat yoki mablag' sarfi, tovar yoki xizmat sarfi natijasida boshqa turdagi tovar va xizmat turini yetkazib beradigan faoliyat."
        ]
    },
    {
        "word": "Iqtisodiy Islohot ",
        "type": [],
        "definition": [
            "iqtisodiy kategoriya bo'lib, bozor iqtisodiyotiga o'tayotgan mamlakatlarda yangicha mazmunga ega bo'ladi. Jahon tajribasining ko'rsatishicha, bozor iqtisodiyotiga o'tayotgan har bir mamlakat bundan keng miqyosda, tubdan, yaxlit iqtisodiy islohot o'tkazishning o'z yo'lini va demak, yangi jamiyat barpo etishning o'ziga xos va mos andozasini ishlab chiqishi kerak. Mustaqillikka erishayotgan har bir davlat o'z mustaqilligini nafaqat siyosiy, balki iqtisodiy jihatdan ham ta’minlashi lozim. Bu holatda korxona va birlashmalar mustaqilligi keskin ortadi. Birlashma va korxonalar to'liq xo'jalik hisobi asosida o'z-o'zini qoplashga o'tadi. Mehnat jamoasining huquqi ortadi. Ishchilarning o'z qobiliyatlarini namoyon qilishga imkoniyat kengayadi. Yuqori sifatli mehnatni moddiy va ma’naviy rag'batlantirish uchun qulay imkoniyat yaratiladi. "
        ]
    },
    {
        "word": "Iqtisodiy Ittifoq_ ",
        "type": [],
        "definition": [
            "integratsiya jarayonida qatnashuvchi mamlakatlar o‘ziqtisodiyvaijtimoiysiyosatlarini,xususan,pul, kredit, soliq, savdo, ishchi kuchi va sarmoya ко‘chib yurishiga nisbatan siyosatlarini muvofiqlashtirish orqali kelishilgan holda faoliyat qilishining oliy shakli."
        ]
    },
    {
        "word": "Iqtisodiy Kategoriyalar ",
        "type": [],
        "definition": [
            "jamiyatning iqtisodiy hayot sharoitini umumlashtirib aks ettiruvchi mantiqiy tushunchalar bo'lib, ular real iqtisodiy voqelikning in’ikosi, ifodasidir. Kategoriyalar ilmiy fikrlash mahsuli bo'lib, hayotda uchraydigan tushunchalardan farq qiladi. Kategoriyalarni uch guruhga bo'lish mumkin. 1. Umumiqtisodiy kategoriyalar-jamiyatiqtisodiytaraqqiyotiningbarchabosqichlariga xos bo'lgan ishlab chiqarish, mulk, ish vaqti, mehnat taqsimoti, jamg'arish, ehtiyoj kabi tushunchalar. 2. Formatsion maxsus kategoriyalar - faqat ijtimoiy-iqtisodiy taraqqiyotning muayyan bosqichigaxosbo'lgano'tkinchimunosabatlarni ifodalovchi maxsus kategoriyalar ekspluatatsiya, renta, ortiqcha aholi, qashshoqlanish, monopoliya va boshqa shu kabi tushunchalardan iborat. 3. Davriy, oraliq kategoriyalar - umuminsoniy xarakterga ega, bir nechta iqtisodiy tizimlar doirasida amal qiluvchi, uzoq tarixiy davrda saqlanuvchi tovar, pul, talab, taklif, marketing, narx, inflyatsiya va boshqa shu kabi tushunchalardan iborat. "
        ]
    },
    {
        "word": "Iqtisodiy Kategoriya ",
        "type": [],
        "definition": [
            "asosiy iqtisodiy tushunchalar. Xo'jalik faoliyatida tannarx, baho, foyda, samaradorlik, xo'jalik hisobi va boshqa iqtisodiy kategoriyalar katta ahamiyatga ega. "
        ]
    },
    {
        "word": "Iqtisodiy Konyunktura ",
        "type": [],
        "definition": [
            "iqtisodiy o'sish, tuzilmaviy siljishlar, moliyaviy ahvol,eksportimkoniyatlarikabilarnixarakterlabberuvchi iqtisodiy holat."
        ]
    },
    {
        "word": "Iqtisodiy Manfaat Markazi ",
        "type": [],
        "definition": [
            "turar joy, ishlab chiqarish yoki boshqa binolar joylashgan hududda institutsion birlik o'zining iqtisodiy manfaat markaziga ega bo'ladi. Bu yerga joylashgan markaz muayyan aniq yoki noaniq muddat davomida, yoki uzoq davr ichida keng miqyosdagi iqtisodiy faoliyat va operatsiyalarda ishtirok etishi yoki ishtirok etish niyatida bo'lishi mumkin. "
        ]
    },
    {
        "word": "Iqtisodiy Manfaatlar ",
        "type": [],
        "definition": [
            "kishilarni harakatga keltiruvchi, ularning xattiharakatini, intilishini, xulq-atvorini belgilovchi kuch. Shaxs, jamoa, davlat va milliy manfaatlardan iborat. "
        ]
    },
    {
        "word": "Iqtisodiy Maqsadlar ",
        "type": [],
        "definition": [
            "maqsadlar, unga erishish jamiyatga barqarorlik va farovonlikni ta’minlab berishi mumkin. Ular quyidagilardan iborat: barqaror iqtisodiy o'sishga erishish; mo'tadil inflyatsiyaning mavjudligini nazarda tutuvchi baholarning barqaror darajasini ta’minlash; yuqori bandlik darajasiga erishish; iqtisodiy samaradorlikka erishish, daromadlarning adolatli taqsimlanishiga erishish. "
        ]
    },
    {
        "word": "Iqtisodiy Model ",
        "type": [],
        "definition": [
            " iqtisodiy obyektlarning soddalashtirilgan nusxasi. "
        ]
    },
    {
        "word": "Iqtisodiy Muammolar ",
        "type": [],
        "definition": [
            "nima, qanday va kim uchun ishlab chiqarish. Har bir iqtisodiyot oldida bir qancha muammolar turadi. Bular - nimani ishlab chiqarish, ya'ni qanday mahsulot turlarini ishlab chiqarish; mahsulotlarni qanday qilib ishlab chiqarish; mahsulotlar jamiyatda qanday taqsimlanishi kerak kabi. Hozirda ushbu muammolarni eng muvofiq qilib hal eta olgan iqtisodiy tizim - bozor iqtisodiyoti hisoblanadi. Chunki unda bu muammolar iste’molchilarning talabidan kelib chiqqan holda eng kam xarajatlar bilan hal etiladi. "
        ]
    },
    {
        "word": "Iqtisodiy Munosabatlar ",
        "type": [],
        "definition": [
            "qarang: ishlab chiqarish munosabatlari. "
        ]
    },
    {
        "word": "Iqtisodiy Neʼmat ",
        "type": [],
        "definition": [
            "ehtiyojni qondirish vositasi. "
        ]
    },
    {
        "word": "Iqtisodiy Nochor Korxonalar ",
        "type": [],
        "definition": [
            "muayyan miqdorda kapital yo'qotish, ishlab chiqarish maydonlarining qisqarishi, ishsizlar sonining ortishi, raqobatbardosh bo'lmagan mahsulot ishlab chiqaradigan va buning uchun katta miqdorda materiallar, xomashyo, yonilg'i, mehnat resurslari sarflaydigan qoloq, samarasiz korxona. "
        ]
    },
    {
        "word": "Iqtisodiy Nofaol Aholi ",
        "type": [],
        "definition": [
            " ishchi kuchi tarkibiga kirmaydigan mehnatga qobiliyatli aholi. Uning jumlasiga quyidagilar kiradi: ishlab chiqarishdan ajralgan holda ta’lim olayotgan o'quvchilar va talabalar, o'quv yurtlarining tinglovchilari va kursantlari; uy xo'jaligini yuritishda, bolalarni, bemor qarindoshlarini parvarish qilishda band bo'lganlar va agar daromad keltiradigan ish taklif qilinsa, shu ishga kirishish imkoniga ega bo'lmagan boshqa shaxslar; ishlashni istamayotgan, ish bilan ixtiyoriy ravishda band bo'lmagan shaxslar, shuningdek, ishlashni istaydigan, lekin ishga joylashish yoki o'zini mustaqil daromad bilan ta’minlash uchun hech qanday harakat qilmaydigan shaxslar. "
        ]
    },
    {
        "word": "Iqtisodiy Oʻsish ",
        "type": [],
        "definition": [
            "mamlakat iqtisodiy salohiyatining ortishi, ya’ni aholi ehtiyoji uchun zarur bo'lgan moddiy ne’matlar ishlab chiqarish va xizmatlar ko'rsatishning ko'payib, yaxshilanib borishi. Iqtisodiy o'sish mamlakatning rivojlanib, taraqqiy etib borishini ifodalaydi. Iqtisodiy o'sish - yalpi milliy mahsulot va milliy daromad hajmining ortib borishi, aholi jon boshiga yaratilgan mahsulotning ko'payishi bilan o'lchanadi. Iqtisodiy o'sishning intensiv va ekstensiv turlari mavjud. "
        ]
    },
    {
        "word": "Iqtisodiy Oʻsish Sifati ",
        "type": [],
        "definition": [
            "iqtisodiy o'sishning umumlashgan sifat xarakteristikasi bo'lib, uning qanday sarflar bilan ta’minlangani va qanday ijtimoiy-iqtisodiy natija berganligini ifodalaydi."
        ]
    },
    {
        "word": "Iqtisodiy Operatsiyalar ",
        "type": [],
        "definition": [
            "har qanday iqtisodiy ma’noga ega bo'lgan mun о s abatl ardir. "
        ]
    },
    {
        "word": "Iqtisodiy Qonunlar ",
        "type": [],
        "definition": [
            "iqtisodiy munosabatlar tizimida ishlab chiqarish, taqsimot, ayirboshlash, iste’mol sohalarida o'zaro ichki bog'liqlikda va aloqadorlikda yuzaga kelib turadigan uzviy iqtisodiy zaruratni taqozo etuvchi sabab-oqibat, aloqa o'zaro bog'lanishlaridir. Iqtisodiy qonunlar ma’lum iqtisodiy jarayon va ayrim hodisalarning muqarrarligini aks ettirib, obyektivxarakterga ega, ya’ni odamlarning ongi va irodasiga bog'liq bo'lmagan holda harakat qiladi. Kishilik jamiyati bilan birga vujudga kelgan bo'lib, uch guruhga bo'linadi: 1. Umumiqtisodiy qonunlar - jamiyat taraqqiyotining barcha bosqichlarida iqtisodiyotning aniq ijtimoiy shaklidan qat’i nazar amal qiluvchi qonunlar. Bularga mehnat taqsimoti, jamg'arish, mehnat unumdorligining o'sib borishi, ehtiyojlarning yuksalishi va boshqa qonunlar kiradi. 2. Formatsion maxsus qonunlar - iqtisodiy taraqqiyotning muayyan bosqichiga xos bo'lgan, shu tizimning o'ziga xos xususiyatlarini ifoda etuvchi qonunlar. 3. Davriy, oraliq qonunlar - iqtisodiy munosabatlarning, ishlab chiqaruvchi kuchlar taraqqiyotining muayyan darajasini vujudga keltirgan xususiyatlarni ifoda etadi. Bu xususiyatlar bir nechta ishlab chiqarish usuliga xos bo'lib, ularni birlashtirib, bog'lab turadi. Ular jumlasiga qiymat qonuni, iqtisodiy o'sish va boshqalar kiradi."
        ]
    },
    {
        "word": "Iqtisodiy Renta ",
        "type": [],
        "definition": [
            "odatda, cheklangan tabiiy resurslardan foydalanilgandagi (yoki ijara) haq-baho tushuniladi. Iqtisodiy rentani ko'pincha resurs egasining undan foydalangandan oladigan renta daromadi ma’nosida ham qo'llash mumkin. "
        ]
    },
    {
        "word": "Iqtisodiy Resurslar ",
        "type": [],
        "definition": [
            " tabiiy, insoniy, moddiy, moliyaviy va intellektual resurslardan iborat. "
        ]
    },
    {
        "word": "Iqtisodiy Risk ",
        "type": [],
        "definition": [
            "iqtisodiy faoliyat amalga oshayotgan vaziyatning noaniqligi. Bunday vaziyat voqealar dinamikasiga oid axborotning yetishmasligi, chin emasligi, xatoliklarga yo‘l qo'yilishi tufayli kasodgauchrash, moddiy zarar ko'rish, shuningdek,kattamiqdordagi daromad olish ehtimolining mavjudligi bilan xarakterlanadi. "
        ]
    },
    {
        "word": "Iqtisodiy Rivojlanish Samaradorligi",
        "type": [],
        "definition": [
            "iqtisodiyotni rivojlantirish natijalarining bu borada qilingan sarf-xarajatlarga nisbati. "
        ]
    },
    {
        "word": "Iqtisodiy Rivojlanish Surʼatlari ",
        "type": [],
        "definition": [
            "mamlakat ijtimoiy-iqtisodiy ko'rsatkich va natijalarining miqdor jihatidan ko'payishi va sifat jihatidan takomillashuvi darajasi. "
        ]
    },
    {
        "word": "Iqtisodiy Rivojlanishnin G “Ozbek Modeli” ",
        "type": [],
        "definition": [
            "1991-yil 1-sentabrdan mustaqil taraqqiyot yo'liga o'tgan respublikamizning ijtimoiy yo'naltirilgan bozor iqtisodiyoti. O'zbekiston Respublikasining Birinchi Prezidenti I. A. Karimov tomonidan ilgari surilgan. Uning besh tamoyili mavjud: 1. Iqtisodiyotning siyosatdan ustuvorligi va bunda iqtisodiyotning har qanday mafkuradan xoli bo'lishi. 2. Davlat - bosh islohotchi. 3. Qonunning hamma narsadan ustun turishi. 4. Kuchli ijtimoiy siyosat. 5. Bozorga bosqichma- bosqich, tadrijiy (evolyutsion) yo'l bilan borish. "
        ]
    },
    {
        "word": "Iqtisodiy Samara ",
        "type": [],
        "definition": [
            " ushbu natijalarga erishish uchun ishlab chiqarishdagi natijalar va xarajatlarning taqqoslanishi."
        ]
    },
    {
        "word": "Iqtisodiy Samaradorlik ",
        "type": [],
        "definition": [
            "cheklangan resurslardan unumli foydalanib, jamiyatning tovar va xizmatlarga bo'Igan cheksiz talabini maksimal qondirish. "
        ]
    },
    {
        "word": "Iqtisodiy Sikl ",
        "type": [],
        "definition": [
            "doimiy ravishda bir qancha yillar davomida iqtisodiy faollikning birin-ketin ko'tarilishi va pasayishi. Iqtisodiy sikl iqtisodiyotning rivojlanish shakli hisoblanadi va uning asosini iqtisodiy inqirozlar tashkil etadi. Iqtisodiy siklning asosiy sababi ishlab chiqarishning doimo kengayishiga harakat qilishi va undan talabning orqada qolishi, buning natijasida, iqtisodiyotdagi jami taklif va jami talab o'rtasidagi hamda asosiy kapitalga bo'Igan talab va taklif o'rtasidagi muvozanat buziladi. Iqtisodiy sikl 4 bosqichdan iborat: tushkunlik, turg'unlik, jonlanish, yuksalish (ushbu tushunchalarga qarang)."
        ]
    },
    {
        "word": "Iqtisodiy Siyosat ",
        "type": [],
        "definition": [
            "hayotiy ne’matlarni ishlab chiqarish, taqsimlash, ayirboshlash va iste’mol qilish sohasidagi davlatning aniq maqsadga yo'naltirilgan tadbirlari tizimidan iborat. "
        ]
    },
    {
        "word": "Iqtisodiy Taʼlimot, Nazariya, Qonun, Kategoriya",
        "type": [],
        "definition": [
            "merkantilizm, fiziokratizm, klassik iqtisodiy maktab, marjinalizm - bu iqtisodiy ta’limotlardir; “nufuz” “so'nggi soat”, “uchinchi shaxslar”, yuqori foydalilik, umumiy bandlik, qiymatning mehnat nazariyasi; qiymat, qo'shimcha qiymat, talab va taklif qonunlari; tovar, mehnat taqsimoti, pul, narx, ish haqi, renta va boshqalar iqtisodiy kategoriyalardir. "
        ]
    },
    {
        "word": "Iqtisodiy Va Ijtimoiy Kengash (Ekosos) ",
        "type": [],
        "definition": [
            "BMTning asosiy boshqaruv organlaridan biri bo'lib, uningXIM sohasidagi faoliyatini muvofiqlashtirib turadi. "
        ]
    },
    {
        "word": "Iqtisodiy-Ekologik Boshqaruvning Maʼmuriynazorat Instrumentlari ",
        "type": [],
        "definition": [
            "yuridik (korxonalar, tashkilotlar) va jismoniy shaxslaming iqtisodiy-ekologik faoliyati natijalariga ushbu shaxslar amal qilishi va erishishi kerak bo'lgan maqsadlar, standartlar, reglamentlarni qonunlar va boshqa tartibga solish vositalarini qo'llash orqali bevosita ta’sir ko'rsatishga mo'ljallangan. "
        ]
    },
    {
        "word": "Iqtisodiy-Ekologik Siyosat ",
        "type": [],
        "definition": [
            "iqtisodiy siyosatning o'ziga xos turi va yo'nalishidir. Iqtisodiy-ekologik siyosat - davlatning tabiiy muhit va tabiiy resurslardan foydalanish, ularni saqlash, asrash, muhofaza qilish hamda tabiatdan foydalanishga asoslangan ishlab chiqarish, taqsimlash, ayirboshlash va iste’mol sohalarida maqsadga muvofiq yo'naltirilgan tadbirlar tizimidir. U mamlakatning iqtisodiy-ekologik manfaatlarini aks ettirishi vaekologikxavfsizlikni mustahkamlashga yo'naltirilishi lozim. "
        ]
    },
    {
        "word": "Iqtisodiy-Ekologik Tizimlar ",
        "type": [],
        "definition": [
            " ijtimoiy ishlab chiqarish va tabiatdagi tabiiy jarayonlarning o'zaro bog'liq va o'zaro shartlangan harakatini ifodalaydigan iqtisodiyot va tabiat integratsiyasidir. Iqtisodiy-ekologik munosabatlar - insonlar o'rtasida tabiatdan foydalanish, ekologik tizimlarni tiklash va muhofaza qilish, foydali qazilmalarni qazib olish va ularni qayta ishlash, ishlab chiqarishni ekologiyalashtirish jarayonida yuzaga keladigan munosabatlardir."
        ]
    },
    {
        "word": "Iqtisodiy-Matematik Usullar ",
        "type": [],
        "definition": [
            "kompleks iqtisodiy va matematik ilmiy fanlarning umumiy nomi bo'lib, ular yordamida iqtisodiy jarayonlarni o'rganish vositalari ishlab chiqiladi. "
        ]
    },
    {
        "word": "Iqtisodiyot",
        "type": [],
        "definition": [
            "1. Iqtisodiyot, xalq xo'jaligi tarmoqlari, bo'limlari yig'indisi. 2. Sektorlar (sanoat, qishloq xo'jaligi, xizmat ko'rsatish) va davlat xo'jaligi bo'limlari, ishlab chiqarish sharoitlari va elementlarini o'rganuvchi fan. Cheklangan iqtisodiy resurslardan unumli foydalanib, insonlar uchun zarur bo'lgan hayotiy vositalarni ishlab chiqarish va yetkazib berishga qaratilgan hamda chambarchas bog'liqlikda amal qiladigan faoliyatlar birligidir. "
        ]
    },
    {
        "word": "Iqtisodiyot Aktivlari ",
        "type": [],
        "definition": [
            "obyektlar bo'lib, ularga institutsion birliklar yakka holda yoki jamoa bo'lib egalik qilish huquqiga ega bo'ladilar. Ularning egalari ma’lum vaqt davomida ularga egalik qilishdan yoki ulardan foydalanishdan iqtisodiy naf ko'radilar. Iqtisodiy aktivlarmoliyaviy va nomoliyaviy aktivlarga bo'linadi. Nomoliyaviy aktivlarga ishlab chiqarilgan (asosiy fondlar, material aylanma mablag'lar, boyliklar) va ishlab chiqarilmagan (yer, yer osti qazilma boyliklar, o'rmon resurslari, patentlar, litsenziyalar va h.k.) aktivlar kiradi. Moliyaviy aktivlarga ega monetar oltin, mavjud pul va depozitlar, qimmatli qog'ozlar, ssudalar, debitor va kreditor qarzlari kiradi. "
        ]
    },
    {
        "word": "Iqtisodiyot Nazariyasi ",
        "type": [],
        "definition": [
            " insonning cheksiz ehtiyojlarini yuqori darajada qondirish uchun, cheklangan iqtisodiy resurslardan samarali foydalanish yo'llarini tanlash sharoitida kishilik jamiyatining rivojlanish qonuni va qonuniyatlarini o'rganadi. Shuningdek, iqtisodiyot nazariyasi iqtisodiy tizimlar evolyutsiyasi, milliy boylik va jamiyat farovonligini oshirish manbalari hamda harakatga keltiruvchi kuchlarni tahlil etishni ham o'z ichiga oladi. Iqtisodiyot nazariyasi fani barcha iqtisodiy fanlarning poydevori va davlat iqtisodiy siyosatining ilmiy asosi hisoblanadi. "
        ]
    },
    {
        "word": "Iqtisodiyotda Xalqaro Teng Manfaatli Hamkorlikni Oʻrnatishga Intilish",
        "type": [],
        "definition": [
            "yangi ishlab chiqarish munosabatlarida iqtisodiy barqarorlik va tovar ayirboshlashda xalqaro hurmat tamoyillariga rioya etish tashqi iqtisodiy aloqalar rivojlanish garovidir. "
        ]
    },
    {
        "word": "Iqtisodiyotni Antitsik Boshqarish",
        "type": [],
        "definition": [
            "rivojlangan mamlakatlar hukumatining iqtisodiy sikllari tebranishini yumshatish maqsadida olib boradigan iqtisodiy siyosat. "
        ]
    },
    {
        "word": "Iqtisodiyotni Davlat Tomonidan Tartibga Solish",
        "type": [],
        "definition": [
            "1. Davlatning xo'jalik subyektlariga va bozor konyunkturasiga bozor mexanizmlariga amal qilishi uchun normal sharoit yaratish hamda ekologik va ijtimoiy muammolarni hal etish maqsadida ta’sir etishi. 2. Iqtisodiyotni barqarorlashtirish, tartibga solish bir maromda ishlashini yo'lga qo'yish; iqtisodiy holatlar va ularning aloqalari o'zgarishi yoki quwatlashni ta’minlovchi maqsadli yo'naltirilgan jarayonlar. Mexanizmlari: soliqlar, narxlar, davlat budjeti va tadbirkorligi, pul-kredit vositalari yordamida muayyan iqtisodiy siyosatni amalga oshirish. "
        ]
    },
    {
        "word": "Iqtisodiyotni Diversifikatsiyalashtirish ",
        "type": [],
        "definition": [
            "ishlab chiqarishning tarmoqlar tarkibini murakkablashtirish jarayoni. Bunda mahsulot turlarining xilma-xilligi va ixtisoslashgan korxonalar soni oshadi. "
        ]
    },
    {
        "word": "Iqtisodiyotni Erkinlashtirish ",
        "type": [],
        "definition": [
            "davlatlashtirishdan qaytish yoki bu davlatning iqtisodiy faoliyatidagi hukmronligini, monopol mavqeyini yo'qotib, iqtisodiyotni boshqarishda yagona davlat mexanizmio'rnigaaralashiqtisodiyotgaxosbozormexanizmigakeng yo'l berishni ifodalaydi. Iqtisodiyotni erkinlashtirish iqtisodiyotni tartibga solishni to'la bozor mexanizmiga topshirish emas, balki bozor mexanizmibilan davlat aralashuvi optimal darajada bo'lishini ta’minlashdan iborat. "
        ]
    },
    {
        "word": "Iqtisodiyotni Tartiblash ",
        "type": [],
        "definition": [
            " bu davlatning undagi turli bo'g'inlar, soha va tarmoqlar faoliyatining bir-biriga bog'lanishi hamda mos holda rivojlanib borishi masalasida amalga oshiradigan ma’muriy va iqtisodiy chora-tadbirlari majmuyidan iborat."
        ]
    },
    {
        "word": "Iqtisodiyotning Dinamik Modellari ",
        "type": [],
        "definition": [
            "iqtisodiyotning rivojlanishini ko'rsatuvchi modellar. "
        ]
    },
    {
        "word": "Iqtisodiyotning Internatsionalizatsiyalashuvi ",
        "type": [],
        "definition": [
            "- xalqaro mehnat taqsimoti natijasida ayrim mamlakatlar (internatsionalizatsiya) o'rtasida barqaror ishlab chiqarish iqtisodiy aloqalarning yuzaga kelishi va ularning xalq xo'jaligida chambarchas bog'lanib ketishi. "
        ]
    },
    {
        "word": "Iqtisodiyotning Norasmiy Sektorida Ish Bilan Band Lar",
        "type": [],
        "definition": [
            "- doimiy, vaqtinchalik, mavsumiy ishlarni yollanib bajaradigan, o'z biznesiga ega, ro'yxatga olinmagan faoliyatdan ish haqi, daromad topadigan shaxslar. "
        ]
    },
    {
        "word": "Iqtisodiyotning Raqobatbard Oshligi ",
        "type": [],
        "definition": [
            "mamlakat iqtisodiyotining xalqaro savdoda ishtirok etish, jahon bozoridagi o'z о‘mi va mavqeini saqlab qolish va kengaytira olish, jahon talablariga javob beradigan mahsulotlar ishlab chiqara olish layoqati bo'lib, quyidagilar orqali belgilanadi: mamlakatdagi ishlab chiqarishning texnik-iqtisodiy darajasi, ishlab chiqarish xarajatlari miqdori, ishlab chiqarilayotgan tovarlar sifati, infratuzilmaning rivojlanganlik darajasi, mutlaq va nisbiy ustunliklarning mavjudligi."
        ]
    },
    {
        "word": "Iqtisodiyotning Real Sektori ",
        "type": [],
        "definition": [
            "iqtisodiyotning bevosita moddiy ne’matlar ishlab chiqarish va xizmatlar ko'rsatish bilan bog'liq sohasi bo'lib, u sanoat, qishloq xo'jaligi, qurilish, transport, aloqa tarmoqlarini o'z ichiga oladi. "
        ]
    },
    {
        "word": "Iqtisodiyotning Tarkibiy Tuzilishi ",
        "type": [],
        "definition": [
            "iqtisodiyotning turli qism va bo'laklari o'rtasidagi proporsiyalar va o'zaro nisbatlar. "
        ]
    },
    {
        "word": "Iqtisodiy Islohotlar ",
        "type": [],
        "definition": [
            "iqtisodiyotning tarkibiy tuzilishini sifat jihatidan takomillashtirish, uning barqaror va mutanosib rivojlanishini ta’minlash imkonini beruvchi, maqsadga muvofiq holda va izchil ravishda amalga oshiriluvchi tub o'zgarishlar, chora-tadbirlar majmuyi. "
        ]
    },
    {
        "word": "Iqtisodiy Nochor Korxona ",
        "type": [],
        "definition": [
            "kreditorlarning tovar (ish, xizmat) lar haqini to' lash bo'yicha talablarini qondirish, shuningdek, budjet va nobudjet fondlariga majburiy to'lovlarni ta’minlashga layoqatsiz bo'Igan korxona. "
        ]
    },
    {
        "word": "Iqtisodiy Oʻsish ",
        "type": [],
        "definition": [
            "real yalpi ichki mahsulot umumiy hajmining yoki aholi jon boshiga to'g'ri keladigan real yalpi ichki mahsulotning oldingi yilga nisbatan o'sishi. "
        ]
    },
    {
        "word": "Ish",
        "type": [],
        "definition": [
            " tabiat va inson tomonidan birlashgan kuchlarning obyektiv natijasidir. "
        ]
    },
    {
        "word": "Ish Beruvchi ",
        "type": [],
        "definition": [
            " yuridik shaxs hisoblanmish biron-bir tashkilot, uning rahbari yuridik shaxsning vakili sifatida ish yuritadi yoxud yollanma ishchi bilan mehnat shartnomasini tuzgan jismoniy shaxs. "
        ]
    },
    {
        "word": "Ish Bilan Band Boʻlg An Jami Aholi",
        "type": [],
        "definition": [
            "ishchi kuchi (iqtisodiy faol aholi)ning ijtimoiy ishlab chiqarishda band bo'Igan qismi. "
        ]
    },
    {
        "word": "Ish Faolligi Soligʻi ",
        "type": [],
        "definition": [
            "bir necha xorijiy mamlakatlarning (masalan, AQSHda) soliqqa tortish amaliyotida qo'llanilib, o'z tarkibiga ikki elementm oladi: 1) korxonaning umumiy yillik oborotni soliqqa tortish (odatda, 1,0 %dan 2,5 % gacha); 2) ish haqi fondini soliqqa tortish. "
        ]
    },
    {
        "word": "Ish Haqi ",
        "type": [],
        "definition": [
            " joriy davrda ish beruvchi tomonidan yollangan xodimga bajargan ishlari uchun berilgan pul yoki natura usulidagi to'lovlar bo'lib, ular hisoblangan summalar yig'indisidan tashkil topadi va ikki qismga bo'linadi: ish haqi va ijtimoiy sug'urtaga ajratmalar. "
        ]
    },
    {
        "word": "Ish Haqi Minimumi ",
        "type": [],
        "definition": [
            "ish haqining eng kam stavkasi, uni tadbirkor qonuniy asosda xodimga ish vaqti birligiga to'laydi. Ish haqi minimumi davlat tomonidan belgilanadi, tadbirkorlar esa undan kam ish haqi to'lashga haqi yo'q. Chunonchi, O'zbekistonda 2017- yil oktabrdan boshlab eng kam ish haqi miqdori 149755 so'm miqdorida belgilangan."
        ]
    },
    {
        "word": "Ish Haqi Soligʻi ",
        "type": [],
        "definition": [
            "yuridik shaxslardan ish haqi xarajatlariga nisbatan va xodimlarning ish haqidan ma’lum foizda olinadigan soliq. "
        ]
    },
    {
        "word": "Ish Haqining Shakllari Va Tizimlari ",
        "type": [],
        "definition": [
            "mehnatning miqdor natijalari va sifatiga (uning murakkabligi, intensivligi, shart- sharoitlari) bog'liq ravishda ish haqini belgilash mexanizmi. "
        ]
    },
    {
        "word": "Ish Joyida Taʼlim Berish ",
        "type": [],
        "definition": [
            "ish joyining o'zida xodimning boy tajribaga ega bo'lgan murabbiy tomonidan ishni to'liq o'zlashtirib olgunga qadar o'qitilishi (o'rgatilishi) bilan bog'liq bo'lgan holat. "
        ]
    },
    {
        "word": "Ish Kuchi Bozori ",
        "type": [],
        "definition": [
            "yollanma ishchi aqliy va jismoniy mehnatining oldi-sotdi qilinishi. Ishchi kuchi bozori mazmuniga ko'ra mehnat bozorini ifodalaydi. Mehnat bozorida bir tomonda ishchi kuchi, ikkinchi tomonda esa unga muhtoj bo'lgan korxona turadi hamda ular o'rtasida yollash va yollanish shaklida tovar bo'lgan ishchi kuchini sotish va sotib olish yuz beradi. "
        ]
    },
    {
        "word": "Ish Kuchi Migratsiyasi ",
        "type": [],
        "definition": [
            "ishchilarning boshqa hududga yoki bir mamlakatdan ikkinchisiga ko'chib yashashi va joyini o'zgartirishi. Ishchi kuchi migratsiyasi aholini yangi joyga doimiy, uzoq yoki qisqa muddatga ko'chirishdan iborat. Bir hududda ishchi kuchiga talabning ortishi tufayli mavsumiy migratsiya ham vujudga keladi. "
        ]
    },
    {
        "word": "Ish Kuchiga Sarflangan Xarajatlar ",
        "type": [],
        "definition": [
            "ish beruvchilar tomonidan ishchi kuchini yollash va uni asrash bilan bog'liqbo'lgan xarajatlar yig'indisi. "
        ]
    },
    {
        "word": "Ish Kuchining Xalqaro Migratsiyasi ",
        "type": [],
        "definition": [
            "mehnat resurslarining ancha qulay sharoitda ish bilan ta’minlanishi maqsadida bir mamlakatdan boshqasiga ko'chib o'tishini bildiradi. "
        ]
    },
    {
        "word": "Ish Kuni ",
        "type": [],
        "definition": [
            " ishchi yoki xizmatchining korxona yoki muassasada bir sutka davomida ishlash vaqti. "
        ]
    },
    {
        "word": "Ish Normasi",
        "type": [],
        "definition": [
            "vaqt birligi (soat, smena, kun, oy)da ishchi ishlab chiqarishi kerak bo'lgan mahsulot yoki bajarishi lozim bo'lgan ish miqdori. Ish normasi mehnatning turi va texnologiyaga, mehnat va ishlab chiqarishni tashkil etish darajalari hamda ishchilarning malakasiga bog'liq holda belgilanadi. "
        ]
    },
    {
        "word": "Ish Oʻrni ",
        "type": [],
        "definition": [
            "ishlab chiqarish makonining bir qismi bo'lib, unda barcha asosiy va yordamchi texnologiya uskunalari, moslamalar, ish mebellari va maxsus qurilmalar joylashgan. Ular muayyan turdagi ishlarni bajarish uchun mo'ljallangan bo'ladi."
        ]
    },
    {
        "word": "Ish Sohasidagi Faollik (Ishchanlik) ",
        "type": [],
        "definition": [
            "kishida (yoki tashkilot miqyosida) namoyon bo'ladigan alohida xususiyatlar majmuyi. Ular jumlasiga quyidagi sifatlami kiritish mumkin: tashabbuskorlik, ijodkorlik, samaradorlik, intensivlik, foydalilik. "
        ]
    },
    {
        "word": "Ish Vaqti ",
        "type": [],
        "definition": [
            " korxona yoki muassasada muayyan ishni bajarish uchun qonuniy berilgan muddat ish kuni va ish haftasi bilan belgilanadi. Ish vaqti davomida ishlanmagan vaqt (nima sababdan sodir b o'lgani dan qat’i nazar) bekor turish vaqti deyiladi. "
        ]
    },
    {
        "word": "Ish Vaqti Zaxirasi ",
        "type": [],
        "definition": [
            "ishlar boshlanishining erta va kech muddati oralig'ida yotgan, ishlar bajarilishi kechiktirilishi mumkin bo'lgan vaqt. "
        ]
    },
    {
        "word": "Ishbay Ish Haqi ",
        "type": [],
        "definition": [
            " ishchining bajargan ish miqdoriga ko'ra haq to'lash usuli. "
        ]
    },
    {
        "word": "Ishbay-Mukofot Haq. Toʻlash ",
        "type": [],
        "definition": [
            " bajarilgan ishlar va yetishtirilgan mahsulot uchun to'lanadigan ish haqi tizimi. "
        ]
    },
    {
        "word": "Ishbilarmonlik Faoliyatinin G Segmenti ",
        "type": [],
        "definition": [
            "subyektning ayrim faoliyat turi, mahsulot turi bo'limi, bozor manzili va hokazo. "
        ]
    },
    {
        "word": "Ishchi Kuchi ",
        "type": [],
        "definition": [
            "insonning jismoniy va aqliy qobiliyatlari yig'indisi va mehnatga layoqati bo'lib, har qanday jamiyat ishlab chiqarishining asosiy sharti hisoblanadi. Mamlakat aholisining jismoniy va mehnatga layoqatli qismi uning ishchi kuchi hisoblanadi. "
        ]
    },
    {
        "word": "Ishchi Kuchi Bozori ",
        "type": [],
        "definition": [
            " ish kuchining egasi va ish beruvchilar orasidagi ijtimoiy munosabatlar tizimi. "
        ]
    },
    {
        "word": "Ishchi Kuchi Sifatining Koʻrsatkichi ",
        "type": [],
        "definition": [
            "ishchi kuchining ma'lumot darajasi va ishlab chiqarish tajribasi hisoblanadi. "
        ]
    },
    {
        "word": "Ishchi Kuchini Takror Ishlab Chiqarish",
        "type": [],
        "definition": [
            "insonning aqliy va jismoniy qobiliyatlarining uzluksiz ravishda tiklanib borishi, doimiy ravishda uning bilim va malaka saviyasi ko'tarilib, yangilanib borishidir. "
        ]
    },
    {
        "word": "Ishchi Qogʻozlarni Kodlashtirish",
        "type": [],
        "definition": [
            "audit tekshiruvi jarayonida tuzilgan barcha ishchi qog'ozlarni auditorlik firmasida qabul qilingan raqamlashtirish tizimi asosida joriy va doimiy fayllarda arxivlash. "
        ]
    },
    {
        "word": "Ishchining Nafliligini Maksimallashtirish Sharti ",
        "type": [],
        "definition": [
            "bo'sh vaqtni daromad bilan chekli almashtirish normasining ish haqiga tengligi. "
        ]
    },
    {
        "word": "Ishgayollovchilarijtimoiysugʻurtauchunajratadigan Haqiqiy Ajratmalar",
        "type": [],
        "definition": [
            "yollanma xodimlar foydasiga uchinchi shaxslar uchun yollovchilar o'tkazadigan mablag‘dan, masalan, ijtimoiy ta’minot jamg'armasi, sug'urta korporatsiyalari yoki boshqa turdagi mustaqil va ijtimoiy sug'urta dasturining boshqaruviga mas’ul bo'Igan institutsion birliklarga o'tkaziladigan mablag'lar. "
        ]
    },
    {
        "word": "Ishga Yollovchilar Ijtimoiy Sugʻurta Uchun Shartli Hisoblab Chi Qiladi Gan Ajratmalar ",
        "type": [],
        "definition": [
            "yollanma xodimlar uchun shartli hisoblab chiqiladigan rag'batlantirish mablag'i. Bu mablag*, aslida, (de fakto) ijtimoiy nafaqa olish huquqiga ega bo'Igan shaxslarga ajratiladigan ijtimoiy sug'urta puli yig'indisiga teng bo'lishi kerak. "
        ]
    },
    {
        "word": "Ishlab Chiqaish Xarajatlari ",
        "type": [],
        "definition": [
            "tovar va xizmatlarni ishlab chiqarish va iste’molchilarga yetkazib berishda qilinadigan barcha sarflardan iborat. "
        ]
    },
    {
        "word": "Ishlab Chiqarilgan Aktivlar ",
        "type": [],
        "definition": [
            "inson tomonidan yaratilgan aktivlardan iborat. Bularga: yer, konlar, suv havzalari, daryo va uning irmoqlari, o'rmonlar, tabiiy o'tloqlar, patentlangan iqtisodiy obyektlar, hali ishlab chiqarilmagan aktivlarga egalik huquqi va h.k. "
        ]
    },
    {
        "word": "Ishlab Chiqarish ",
        "type": [],
        "definition": [
            "barcha tarmoqlar moddiy ishlab chiqarishining umumlashgan shakli bo'lib, ishlab chiqarish uchun shart-sharoit - ishlab chiqarish vositalari va iste’mol buyumlarini ishlab chiqaradi. Ishlab chiqarish sohasiga sanoat, qishloq va o'rmon xo'jaligi, transport, aloqa, energetika, savdo, umumiy ovqatlanish, xo'jalik omborxonalari va xizmat ko'rsatish tarmoqlari, ilm- fan (innovatsion) yutuqlari kiradi. Chunki ular ishlab chiqarish jarayonida qo'llaniladi. Bu jarayonda ishchi kuchi va ishlab chiqarish vositalari birlashadi. Ishlab chiqarish iste’mol kabi uzluksiz davom etadi, ya’ni takror ishlab chiqarish amalga oshiriladi. Ijtimoiy-iqtisodiy ishlab chiqarishning besh usuli ma’lum: ibtidoiy, quldorlik, feodal, kapitalistik, ijtimoiy. Buxgalteriya hisobida ishlab chiqarish xarajatlari, olingan mahsulotlar va ularning iste’moli aks ettiriladi. Ishlab chiqarish vositalari - mehnat vositalari va mehnat buyumlari majmuasi. Ishlab chiqarish zaxiralari - korxonadagi barcha materiallar majmuasi. Ishlab chiqarish zaxiralari 1000 “Materiallarni hisobga oluvchi schyotlar” va boshqa schyotlarda hisobga olinadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarishning Asosiy Vositalari ",
        "type": [],
        "definition": [
            "moddiy ishlab chiqarish sohasida ishlatilib, ishlab chiqarish jarayonida qayta- qayta qatnashib, asta-sekin eskirib, o'z qiymatini yaratilgan mahsulot tannarxiga qisman o'tkazib boradi. Ularga moddiy ishlab chiqarish sohasida ishlatiladigan imoratlar, inshootlar, o'tkazuvchi moslamalar, mashina va asbob-uskunalar, transport vositalari, ishlab chiqarish va xo'jalik inventarlari, yirik ish va mahsuldor hayvonlar, ko'p yillik ко‘chat qilingan daraxtlar va boshqa mehnat vositalari kiradi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Bahosi",
        "type": [],
        "definition": [
            "firmaning aynan mahsulotni ishlab chiqarish va marketingga sarflangan xarajatlariga kutilayotgan daromad hajmini qo'shish orqali aniqlanadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Chegarasi ",
        "type": [],
        "definition": [
            "tizim tarkibiga qo‘shiladigan ishlab chiqarish faoliyati quyidagicha ta’riflanishi mumkin: individual (yakka) yoki jamoa tarzida mahsulot ishlab chiqarish va xizmat ko'rsatish. Bu mahsulot va xizmatlar ularni ishlab chiqarishda ishtirok etmagan boshqa birliklarga yetkazib beriladi. Yoki ana shu tovar va xizmatlar ana shunday tovar ishlab chiqarish va xizmat ko'rsatish jarayonida ishlatiladi; Ishlab chiqaruvchilar o'zining pirovard iste’moliga qoldirilgan yoki ishlab chiqarish moddiy oborot zaxirasini oshirishda foydalanish uchun ishlab chiqariladigan barcha tovarlar; o'z ehtiyoji yo'lida pirovard iste’mol talabini qondirish uchun ko'rsatiladigan xizmat. Buning tarkibiga uyda ko'rsatiladigan yoki shaxsiy xizmat kiritilmaydi, chunki uy xo'jaligi sharoitida bunday xizmatlar o'z iste’moli uchun yaratiladi. Ammo xizmat ishlab chiqarish tarkibiga muayyan haq evaziga uy xizmatchisi bajargan ishlar hamda o'z istiqomat joyiga, ya’ni o'z turar joyiga qilingan xizmat hajmi qo'shiladi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Chiqindilari ",
        "type": [],
        "definition": [
            "materiallar va yarim tayyor mahsulotlarni qayta ishlash jarayonida to'la yoki qisman iste’mol qilish sifatini yo'qotgan material yoki yarim tayyor mahsulotlar qoldig'i. Chiqindilar qaytariladigan va qaytarilmaydigan chiqindilarga bo'linadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Funksiyasi ",
        "type": [],
        "definition": [
            "ishlab chiqarilgan mahsulot miqdori bilan shu mahsulotni ishlab chiqarishdagi sarflangan ishlab chiqarish omillari miqdori o'rtasidagi bog'liqlikni ifodalovchi funksiya. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Hisobi ",
        "type": [],
        "definition": [
            "bevosita ishlab chiqarish jarayoniga aloqador operatsiya (harakat) larni ko'rsatadi. Bu hisob tarmoqlar va sektorlar miqyosida olib boriladi. Ishlab chiqarish hisobining resurs qismi mahsulot ishlab chiqarishni, foydalanish qismi esa oraliqdagi iste’mol holatini o'z ichiga oladi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Imkoniyatlari ",
        "type": [],
        "definition": [
            "mamlakat resurslaridan to'la foydalanib, ikki mahsulot chiqarishni qo'shib olib borish."
        ]
    },
    {
        "word": "Ishlab Chiqarish Imkoniyatlari Egri Chizigʻ1 ",
        "type": [],
        "definition": [
            "iqtisodiyotda to'la bandlik va ishlab chiqarishning boshqa omillaridan to'la foydalanilgan sharoitda ikkita mahsulot (mahsulotlar guruhlari) ni ishlab chiqarishning har xil kombinatsiyalarini ko'rsatuvchi egri chiziq. Bunda ishlab chiqarishning texnologik asosi va yer resurslari doimiydir. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Infratuzilmasi ",
        "type": [],
        "definition": [
            "ishlab chiqarishning rivojlanishi uchun tashqi shart-sharoitlarni ta’minlovchi tarmoqlar majmuyi bo'lib, o'z ichiga temir va avtomobil yo'llari, elektr, gaz va suv ta’minoti, aloqa kommunikatsiyalari, ombor xo'jaligi va boshqalarni oladi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Ixtisoslashuvi ",
        "type": [],
        "definition": [
            "ayrim korxonalarda bir turdagi mahsulotni ishlab chiqarishga qaratilgan jarayonlarning to'planishi. Mehnat unumdorligi va ishlab chiqarish samaradorligi o'sishining asosiy omillaridan biri. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Jarayoni ",
        "type": [],
        "definition": [
            "jamiyat ixtiyoridagi barcha resurslardan foydalanib, jamiyat a’zolari uchun zarur bo'Igan tovar va xizmatlami yaratish. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Jarayonlarini Jadallashtirish",
        "type": [],
        "definition": [
            "ishlab turgan apparat (unga xizmat ko'rsatayotgan kishilar sonini oshirmagan holda) vaqtbirligi ichida ishlab chiqarayotgan mahsulot miqdorini oshirish uchun qo'llaniladigan barcha tashkiliy tadbirlar yig'indisi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Koʻlami (Masshtabi)Ning Salbiy Samarasi",
        "type": [],
        "definition": [
            " firma ishlab chiqarish hajminingxarajatlarga nisbatan orqada qolishiga xos bo'Igan holat."
        ]
    },
    {
        "word": "Ishlab Chiqarish Konsentratsiyasi",
        "type": [],
        "definition": [
            "qishloq xo'jaligida ixtisoslashtirish tobora chuqurlashib, har bir korxonada ishlab chiqarish vositalari, ishchi kuchlari va buning natijasida mahsulot ishlab chiqarish jarayonining mujassamlanib borishi jarayoni. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Konsepsiyasi ",
        "type": [],
        "definition": [
            "ishlab chiqarish faoliyatini ifodalovchi va hisobga olish tartib-qoidalaridan iborat. Ishlab chiqarish va iqtisodiy ishlab chiqarish bir xil mazmunda qo'llaniladi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Kooperativi ",
        "type": [],
        "definition": [
            "fuqarolarning shaxsiy ishtirok etish hamda a’zolar (ishtirokchilar)ning mulk bilan qo'shiladigan pay badallarini birlashtirish asosida birgalikda ishlab chiqarish yoki boshqa xo'jalik faoliyatini olib borish uchun a’zolik negizidagi ixtiyoriy birlashmasi."
        ]
    },
    {
        "word": "Ishlab Chiqarish Kooperatsiyasi ",
        "type": [],
        "definition": [
            "ijtimoiy mehnat taqsimoti natijasida ixtisoslashgan korxonalar o'rtasida mahsulot ishlab chiqarish va xizmatlarni bajarish bo'yicha faoliyatini muvofiqlashtirish shakli. Ishlab chiqarish kooperatsiyasi bir xil korxonalarda ortiqcha quwatlar bo'lib, boshqasida yetishmagan hollarda ham tashkil etiladi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Koʻlami (Masshtabl)Ning Ijobiy Samarasi ",
        "type": [],
        "definition": [
            "firmada qo'llanilayotgan resurs va xarajatlarga nisbatan uning ishlab chiqarish hajmi tez o'sishigaxos bo'lgan holat. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Munosabatlari ",
        "type": [],
        "definition": [
            "hayotiy ne’matlaming ishlab chiqarish, taqsimlash, ayirboshlash va iste’mol qilish jarayonida kishilar o'rtasida paydo bo'ladigan iqtisodiy munosabatlardir. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Narxi ",
        "type": [],
        "definition": [
            " tovar (xizmat) ni ishlab chiqarish bilan bevosita va bilvosita bog'liq bo'lgan xarajatlar qiymati."
        ]
    },
    {
        "word": "Ishlab Chiqarish Natijasida Mahsulot Yaratish ",
        "type": [],
        "definition": [
            " jarayon ishlab chiqaruvchi birlik buxgalteriya hisobotida aniq bir ко ‘rsatkich orqali ifo dalanmaydi. MHTda bu j arayonni aniq bir ko'rsakich orqali ifoda etish mumkin. Bu ko'rsatkich - sof qo'shilgan qiymat deb ataladi va mamlakat miqyosida sof ichki mahsulot deb yuritiladi"
        ]
    },
    {
        "word": "Ishlab Chiqarish Normasi ",
        "type": [],
        "definition": [
            "tegishli malakaga ega bo'lgan bir xodim (brigada) tomonidan muayyan vaqt birligi (soat, ish smenasi) davomida ma’lum tashkiliy-texnikaviy sharoitda ishlab chiqarilishi lozim bo' lgan mahsulot miqdori. t, kg, m, dona hisobida ifodalanadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Obyektlarining Kompyuter Joylashishi Taqqoslash Metodi ",
        "type": [],
        "definition": [
            "(Computerized Relative Allocation of Facilities Technique - CRAFT). Uskunalarni texnologik prinsip bo'yicha joylashtirishning optimal yo'lini topish imkonini beradigan kompyuter metodi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Omillari ",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonini amalga oshirishda qatnashuvchi inson (ish kuchi), mehnat vositalari va mehnat sarflanadigan xomashyolar yig'indisi. Insonlar nimadir yordamida mehnat ashyosiga o'z ta sirlarini o'tkazsalar, shu narsalar mehnat vositalari (qurollari) hisoblanadi. Ular turli xil mashina va mexanizmlar, asbob-uskunalar, turli qurilmalar va hokazolardan tashkil topadi. Ishlab chiqarish jarayonining ro'y berishi uchun ishchi kuchi va ishlab chiqarish vositalari bilan mehnat jarayonida inson o'z ta’sirini o'tkazadigan tabiat narsalari (xomashyolar) mehnat omillarini ifodalaydi."
        ]
    },
    {
        "word": "Ishlab Chiqarish Quwati ",
        "type": [],
        "definition": [
            "asosiy ishlab chiqarish va aylanma fondlar, shuningdek, moliyaviy resurslardan iloji boricha to'liq va oqilona foydalangan holda ishlab chiqarish mumkin bo'lgan mahsulotning maksimal hajmi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Rentabelligi ",
        "type": [],
        "definition": [
            "umumiy (balans) foydaning asosiy ishlab chiqarish fondlari va normalashtiriluvchi aylanma mablag'laming o'rtacha у illik qiymatiga nisbati sifatida aniqlanuvchi ishlab chiqarish samaradorligi ko'rsatkichi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Resurslari ",
        "type": [],
        "definition": [
            " moddiy va insoniy resurslardan tashkil topadi. Moddiy resurslar tabiiy resurslardan, ya’ni yer va yer osti boyliklari; o'rmonlar, suv resurslaridan tashkil topadi. Insonlar yaratgan resurslar esa ishlab chiqarish vositalari: asbob- uskunalar, mashinalar, texnikalar, xomashyo va hokazolardan tashkil topadi. Insoniy resurslar insonlarning ishlab chiqarish jarayonida qo'llaniladigan jismoniy, aqliy qobiliyati yoki insonlarning mehnat qila olish qobiliyati va tadbirkorlik layoqatidan tashkil topadi. Tadbirkor layoqati - bozor iqtisodiyoti sharoitida boshqa resurslarni samarali ishlata olish qobiliyatiga ega bo'lgan insoniy resursdir. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Samaradorligi ",
        "type": [],
        "definition": [
            "ishlab chiqarishning natijasi, ishlab chiqarilgan mahsulot qiymati hajmini ishlab chiqarish xarajatlari qiymatiga bo'lgan nisbatida ifodalanadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Sarflari ",
        "type": [],
        "definition": [
            "ishlab chiqarish davomida bo'ladigan chiqim, xarajatlar; mahsulotni ishlab chiqarish uchun ketgan jonli va moddiy mehnat sarflari yig'indisi miqdori, ishlab chiqarilgan tovar uchun sarflangan ish vaqti. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Sikli ",
        "type": [],
        "definition": [
            "ma’lum sanoat korxonasida muayyan mahsulotni tayyorlash uchun zarur bo'lgan vaqt. Mahsulot ishlab chiqarish sikli - ish davri (tayyor mahsulot olish uchun ketgan vaqt) va ishlab chiqarish jarayonidagi tanaffuslar (operatsiyalar orasida davr va smenalar o'rtasidagi vaqt) dan iborat. Ishlab chiqarish siklining asosiy texnik iqtisodiy ko'rsatkichi uning muddati hisoblanadi. Bu muddat ishlab chiqarish xarakteriga qarab soat, kun, oy bilan o'lchanadi."
        ]
    },
    {
        "word": "Ishlab Chiqarish Sohasi ",
        "type": [],
        "definition": [
            "mahsulot, tovarlar ishlab chiqaruvchi tarmoqlar yig'indisi. Masalan, mahsulot, energiya, mahsulotlarni saqlash, sarflash va boshqa funksiyalar. Ular muomalada ishlab chiqarishning davomi hisoblanadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Soliqlari ",
        "type": [],
        "definition": [
            " ishlab chiqaruvchi o'zi ishlab chiqargan va o'zi sotadigan, boshqalarga beradigan yoki boshqacha tarzda o'zi foydalanadigan mahsulot, tovar va xizmatlarga solinadigan soliqlar. Bular, asosan, mulk yoki binolardan, boshqa turdagi aktivlardan yoki yerdan foydalanganlik solig'i, agar ishlab chiqarishda yoki ishchi kuchi yollashda yollanma ishchi kuchiga ish haqi to'lashda foydalanilgan bo‘ Isa, bunday sarf-xarajat ham ishlab chiqarish solig'i tarkibiga kiritiladi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Tizimi ",
        "type": [],
        "definition": [
            "bu korxonaning operatsion resurslaridan kiritilayotgan ishlab chiqarish omili (“kirish”)ni korxona tomonidan tanlangan mahsulot (“chiqish” )ga aylantirish maqsadida foydalanadigan tizimdir. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Tuzilmasi ",
        "type": [],
        "definition": [
            "korxonaning mahsulot ishlab chiqarish jarayonida bevosita yoki bilvosita ishtirok etadigan ishlab chiqarish bo linmalari - sexlar, uchastkalar, xizmat ko'rsatish xo'jaligi aloqalarining yig'indisi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Uchun Boshqa Subsidiyalar ",
        "type": [],
        "definition": [
            "subsidiyalar rezidentli korxonalar u yoki bu mahsulotni ishlab chiqarishda ishtirok etganligi uchun olgan subsidiyalardan tashqari barcha subsidiyalar. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Usuli ",
        "type": [],
        "definition": [
            "jamiyat taraqqiyotining turli tarixiy bosqichlarida ishlab chiqarish munosabatlari hamda bu munosabatlarga xos bo'lgan ishlab chiqaruvchi kuchlarning birligi va o'zaro ta’siri birgalikda ishlab chiqarish usulini tashkil etadi. Uning quyidagi turlari mavjud. 1. An’anaviy ishlab chiqarish usuli. Bu usul sust rivojlangan ko'pgina mamlakatlarda mavjud. Bu ishlab chiqarish usulida ishlab chiqariladigan mahsulotlar va xizmatlar ko‘p yillab o'zgarmaydi. U sekin o'zgaradigan urf-odatlar bilan belgilanadi. An anaviy ishlab chiqarish oddiy takror ishlab chiqarish holatida bo'ladi. 2. Ma’muriy buyruqbozlik tizimidagi ishlab chiqarish usuli. Bu usul ijtimoiy tizimda bo'lgan davlatlarga oid bo'lib, bu davlatlarning iqtisodiyoti aralash iqtisodni tashkil etadi. Mazkur ishlab chiqarish usuli xususiyati mulkning umumiy ekanligi va ishlab chiqarish natijasi bo'lgan moddiy ne’matlar markazdan taqsimlanishiga, xo'jalik bo'g'inlarida iqtisodiy mustaqillikning mavjud ekanligiga asoslanadi. 3. Aralash iqtisodiy tizimdagi ishlab chiqarish usuli. Davlatning iqtisodga aralashuvi inkor etilmaydi. Lekin ishlab chiqarish usuli rivojlanishi turli mulk shakllariga asoslangan holda uni bozor belgilaydi. Davlat bilan bozor ishlab chiqarish usuli rivojlanishini ta’minlaydi. 4. Bozor iqtisodiyoti tizimidagi ishlab chiqarish usuli turli mulkchilik shakllari va erkin raqobatga asoslangan holda tashkil topadi."
        ]
    },
    {
        "word": "Ishlab Chiqarish Va Import Soligʻ1 ",
        "type": [],
        "definition": [
            "davlat tomonidan ishlab chiqaruvchi birliklardan tovar va xizmatlar ishlab chiqargani yoki ishlab chiqarish omillaridan foydalangani uchun olinadigan soliqlar - majburiyat, qaytarilmas to'lovlardir. Ularga mahsulotlar ishlab chiqarishga bo'lgan soliqlar va import soliqlar kiradi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Va Sotuv Imkoniyatlari Tahlili ",
        "type": [],
        "definition": [
            "firma maqsadlariga tovar g'oyasi va marketing strategiyasi mos kelishini aniqiash uchun aniqiangan sotish ko'rsatkichlari, xarajatlar va daromadlarni tahlil qilish. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Vositalari ",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonida qatnashadigan va moddiy ne’matlar tayyorlashda odamlar foydalanadigan mehnat predmetlari va vositalari. Mehnat predmetlari - kishi mehnati sarflanadigan obyektdir. Yer, o'rmon, qazilma boylikJar, xomashyo, binolar, mashina va mexanizmlar, asbob-uskunalar birgalikda ishlab chiqarish vositalarini tashkil etadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Vositalari Bozori ",
        "type": [],
        "definition": [
            "mehnat qurollari, xomashyolar va yonilg'i moylash materiallari savdosi. Ishlab chiqarish vositalari bozor tovar birjalari, yarmarkalar ko'rinishida bo'lib, asosan, uigurji savdo qilinadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Xarajatlari ",
        "type": [],
        "definition": [
            "mahsulot tayyorlash uchun qilingan barcha moddiy va ma’naviy mehnat sarfi. Uning qiymat shakli mahsulot tannarxini o'zida aks ettiradi. Korxonalarning ishlab chiqarish xarajatlarini ikkita qismga: doimiy va o'zgaruvchan xarajatlarga bo'lish mumkin. Doimiy xarajatlarga: ijara to'Iovi, qorovullik va ma’muriyat xizmati kabilar kiradi. O'zgaruvchan xarajatlarga xomashyo, yoqilg'i, energiya, ish haqiga qilingan sarf- xarajatlar kiradi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Xarajatlari Hisobi ",
        "type": [],
        "definition": [
            "u yoki bu mahsulot birligining tannarxini aniqlashda qo'llaniladigan usullar tizimi. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Xarajatlari Inflyatsiyasi ",
        "type": [],
        "definition": [
            "ish vaqti va xomashyoga narxlarning ko'tarilishi natijasida jami taklifning qisqarishi asosida yuzaga keladigan inflyatsiya, bunda ishlab chiqarishning real hajmi va bandlik darajasi pasayadi."
        ]
    },
    {
        "word": "Ishlab Chiqarishdagi Boshqa Soliqlar ",
        "type": [],
        "definition": [
            "soliq korxona u yoki bu mahsulotni ishlab chiqarishda ishtirok etganligi uchun solingan soliqdan tashqari barcha soliqlar. "
        ]
    },
    {
        "word": "Ishlab Chiqarishdagi Yaroqsiz Mahsulot ",
        "type": [],
        "definition": [
            "o'z sifatiga ko ra belgilangan standart va texnik sharoitlarga to'g'ri kelmaydigan detal hamda yarim tayyor mahsulotlar."
        ]
    },
    {
        "word": "Ishlab Chiqarishni Ixtisoslashtirish",
        "type": [],
        "definition": [
            "yirik korxonalarda texnologiya va tuzilmasi bir xil bo'lgan mahsulotlarni ommaviy ravishda ishlab chiqarish, xizmat ko'rsatish xo'jaligi aloqalarining yig'indisi. "
        ]
    },
    {
        "word": "Ishlab Chiqarishni Kimyolashtirish ",
        "type": [],
        "definition": [
            "mahsulot ishlab chiqarishda kimyoviy mahsulot va suniy materiallar, shuningdek, kimyoviy usullardan keng foydalanish. "
        ]
    },
    {
        "word": "Ishlab Chiqarishni Mahalliylashtirish",
        "type": [],
        "definition": [
            "sanoat ishlab chiqarishining turlibosqichlarida import shaklida xarid qilish orqali qo'llaniluvchi detallar, butlovchi qismlar, yarim tayyor mahsulotlar va tayyor mahsulotlarni mahalliy xomashyo va materiallar asosida ishlab chiqarishga o'tkazish jarayoni. "
        ]
    },
    {
        "word": "Ishlab Chiqarishni Modernizatsiyalash ",
        "type": [],
        "definition": [
            "ishlab chiqarishni zamonaviy texnologiyalar bilan jihozlash, uni ma’naviy jihatdan yangilash, tarkibiy jihatdan texnik va texnologik qayta tuzish kabi chora-tadbirlarni o‘z ichiga oluvchi jarayon. Ishlab chiqarishni modernizatsiyalashning asosiy yo'nalish va vositalari quyidagilar hisoblanadi: korxonalardan eskirgan asbob-uskunalarni chiqarib, zamonaviy texnika va texnologiyalar bilan almashtirish; mahalliy resurslar asosida ishlab chiqarishga innovatsion texnologiyalarni joriy etish; ishlab chiqarilayotgan mahsulot assortimentini kengaytirish; ishlab chiqarish xarajatlarini pasaytirish va resurslarni tejash; sifatni boshqarish va sertifikatlash tizimini joriy etish; chiqitsiz va ekologik toza texnologiyalarni joriy etish va boshqalar. "
        ]
    },
    {
        "word": "Ishlab Chiqarishni Yiriklashtirish ",
        "type": [],
        "definition": [
            "mahsulotni yirik korxonalarda chiqarishni tashkil qilish. "
        ]
    },
    {
        "word": "Ishlab Chiqarishning Diversifikatsiyasi ",
        "type": [],
        "definition": [
            "bir tomonlama, ko'pincha bitta mahsulotga asoslanuvchi ishlab chiqarishni keng nomenklaturada tayyorlanuvchi mahsulodarga asoslangan ishlab chiqarishga o'tkazish. "
        ]
    },
    {
        "word": "Ishlab Chiqarishning Ixtisoslashuvi ",
        "type": [],
        "definition": [
            "korxona yoki hududning bir turdagi mahsulotni ishlab chiqarishga yo'naltirilganligi. Ishlab chiqarishning ixtisoslashuvi ishlab chiqarish jarayonining turli bosqichlarida hudud, tarmoq va korxonalar o'rtasida ichki mehnat taqsimoti shaklidir. Ixtisoslashtirilgan ishlab chiqarish mahsulot, texnologik jarayon, asbob-uskunalar va tegishli mutaxassisliklarning bir xilligi bilan tavsiflanadi. "
        ]
    },
    {
        "word": "Ishlab Chiqarishning Potensial Miqdori ",
        "type": [],
        "definition": [
            "resurslardan to'liq foydalanilganda iqtisodiyot ishlab chiqara oladigan mahsulot ishlab chiqarishning real hajmi."
        ]
    },
    {
        "word": "Ishlab Chiqaruvchanlik ",
        "type": [],
        "definition": [
            "resurslardan samarali foydalanish ko'rsatkichlari. "
        ]
    },
    {
        "word": "Ishlab Chiqaruvchanlik (Unumdorlik) ",
        "type": [],
        "definition": [
            "tizimdan chiqishda olinadigan natijani ushbu tizimning kirishiga bo'lgan nisbati. Umumiy unumdorlik, odatda, tizimning chiqishida olinadigan natijalarning pul qiymatini (masalan, sotilgan mahsulotlar yoki ko'rsatilgan xizmatlar) barcha kiritilgan ishlab chiqarish omillari qiymatiga bo'lish orqali hisoblanadi. "
        ]
    },
    {
        "word": "Ishlab Chiqaruvchi Kuchlar ",
        "type": [],
        "definition": [
            "ishchi kuchi va ishlab chiqarishlar vositalari yig'indisi. Ular ishlab chiqarishni harakatga keltiradi. Asosiy ishlab chiqarish kuchlariga moddiy ne’matlar yaratuvchi mehnatkashlar va mehnat vositalari kiradi. "
        ]
    },
    {
        "word": "Ishlab Chiqaruvchi Narxi ",
        "type": [],
        "definition": [
            "yetkazib berilishi mumkin bo'lgan mahsulot va xizmat sifatida ishlab chiqarilgan va ishlab chiqaruvchi tomonidan olinadigan tovar va xizmat birligining narxi. To'lanishi zarur bo'lgan turli mahsulot soliqlar (qo'shilgan qiymat uchun olinadigan soliqdan tashqari), sotilgan va foydalanilgan mahsulot uchun olingan subsidiyalar ham ishlab chiqaruvchi narxi tarkibiga kiritiladi. Ishlab chiqaruvchi mol yetkazib berishva xizmat ko'rsatish uchun alohida qo'shadigan chiqim-sarflar. U ishlab chiqaruvchi narxiga qo'shilmaydi. "
        ]
    },
    {
        "word": "Ishlab Chiqaruvchi Narxi Bo Yicha Yalpi Qoʻshilgan Qiymat ",
        "type": [],
        "definition": [
            "ishlab chiqaruvchi narxida baholangan va undan sotib oluvchi narxidagi oraliq iste’mol qiymati chegirib tashlangach hosil bo‘ladigan narx. "
        ]
    },
    {
        "word": "Ishlab Chiqaruvchi Ortiqchaligi (Yutugʻ1) ",
        "type": [],
        "definition": [
            "tovarlarning haqiqiy narxlaridan chekli (bir birlik qo'shimcha tovar ishlab chiqarishga ketgan) xarajatlarning ayirmalari yig'indisiga teng. "
        ]
    },
    {
        "word": "Ishlab Chiqaruvchilar Narxlarining Indeksi ",
        "type": [],
        "definition": [
            "bazis davriga nisbatan xomashyo materiallar va oraliq tovarlar narxlari o‘zgarishining o'rtacha darajasini aks ettiruvchi ko'rsatkich. YalMning maksimal darajada detallashtirilgan komponentlari narxini solishtirma narxlarga o‘tkazishda ishlatiladi. "
        ]
    },
    {
        "word": "Ishlab Chiqjsh Omillari Bozori ",
        "type": [],
        "definition": [
            "yer, mehnat, kapital kabi ishlab chiqarish omillarini sotib olish va sotishni nazarda tutadi. Yer deganda fermerlar va tadbirkorlar tomonidan ishlatiladigan faqat bevosita yerning o‘zi emas, shu bilan birga, yer ostidan qazib olinadigan yoki yer yuzasida yig'ishtirib olinadigan xomashyo, masalan, paxta tushuniladi. Mehnat barcha ishlovchilarning, shu jumladan, malakasiz ishchilar, tadbirkorlar, firmalarning boshqaruvchilari va rahbarlarining xizmatlari sifatida izohlanadi. Mehnat birjasi ushbu bozorning eng muhim vositasi hisoblanadi. Bu yerda turli xil ishchi kuchiga talab va uni taklif etish bevosita shakllanadi. Mehnat birjasi ishchi kuchining butun rezervini ham aks ettiradi. Ishsizlarni tayyorlash va qayta tayyorlash, ijtimoiy ishlarni tashkil etish bilan shug‘ullanadi. Kapital tarzidagi ishlab chiqarish omili ishlab chiqarish vositalari, binolar, inshootlar, dastgohlar, uskunalar, shuningdek, ishlab chiqarish vositalarini sotib olish uchun talab qilinadigan pul mablag'laridan iboratdir. G'arbdagi ayrim iqtisodchilar ishlab chiqarish omillariga tovarlar va xizmatlarni ishlab chiqarishni tashkil etuvchi, qanday tovarlar yoki xizmatlarni ishlab chiqarish xususida qarorlar qabul qiluvchi va xavfni o'z zimmasiga oluvchi, yangi texnika, texnologiyani ishlab chiqarish, yangi tovarlarning innovatsiya usullarini joriy etuvchi tadbirkorlik talantini ham kiritadilar. "
        ]
    },
    {
        "word": "Ishlar",
        "type": [],
        "definition": [
            "bajarilishi uchun ma’lum vaqt talab qilinadigan WBS loyihasi ishlari tuzilmasining dastlabki elementlari. Berilgan loyihada ko'rsatilgan barcha ishlarning tugatilishi - butun loyiha tugashi demakdir. "
        ]
    },
    {
        "word": "Ishlar (Xizmatlar)N1Eksport Qilish ",
        "type": [],
        "definition": [
            "ishlarni bajarish (xizmatlar ko'rsatish) joyidan qat’i nazar, O'zbekiston Respublikasining yuridik yoki jismoniy shaxsi tomonidan chet davlatning yuridik yoki jismoniy shaxsi uchun ishlarni bajarish, xizmatlar ko'rsatish. "
        ]
    },
    {
        "word": "Ishlatilish Koeffitsiyenti ",
        "type": [],
        "definition": [
            "ma lum bir resursning faktik ishlatilish vaqtining uning ishlatilishi mumkin bo'lgan vaqtga nisbati. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Jarayoni",
        "type": [],
        "definition": [
            "jamiyat ixtiyoridagi barcha resurslardan foydalanib, jamiyat a’zolari uchun zarur bo'lgan tovar va xizmatlarni yaratish. "
        ]
    },
    {
        "word": "Ishlab Chiqarish Munosabatlari ",
        "type": [],
        "definition": [
            "hayotiy ne’matlarning ishlab chiqarish, taqsimlash, ayirboshlash va iste’mol qilish jarayonida kishilar o'rtasida paydo bo'ladigan iqtisodiy munosabatlardir."
        ]
    },
    {
        "word": "Ishlab Chiqarish Xarajatlari",
        "type": [],
        "definition": [
            " tovar va xizmatlarni ishlab chiqarish va iste’molchilarga etkazib berishda qilinadigan barcha sarflardan iborat. "
        ]
    },
    {
        "word": "Ishlab Chiqaruvchi Kuchlar ",
        "type": [],
        "definition": [
            "ishchi kuchi yoki boshqacha aytganda, ma’lum malakaga, tajribaga ega bo'lgan kishilar hamda ishlab chiqarish vositalaridan tashkil topgan. "
        ]
    },
    {
        "word": "Ishonchsiz Kreditlar ",
        "type": [],
        "definition": [
            "ishonchsiz deb turkumlangan aktivlar qaytishi mumkin bo'lmagan aktivlar deb qaraladi. Bunday aktivlar juda past qiymatga ega va ularni bank aktivlari sifatida hisobga yuritish maqsadga muvofiq emas deb hisoblanadi. Bunday turkumlash bu aktivlarning hech qanday likvidatsion bahosi yo'q degani emas, lekin banklarga bunday aktivlarni o'z balansida yuritish tavsiya etilmaydi va bu aktivlar likvidatsiya qilinishi kerak"
        ]
    },
    {
        "word": "Ishsizlik",
        "type": [],
        "definition": [
            " sog'lig'i yoki yoshi jihatidan ishga Iayoqatli kishining ish o'rnini yo'qotib, bosh bo'lib qolishi. Ishsizlik uch xil ko'rinishda uchraydi: 1. Ixtiyoriy ishsizlik (boshqa hududga ko'chish, o'qishga kirish, bolani parvarish qilish kabi sabablarga ko'ra ishdan bo'shashi natijasida yuzaga keladi). 2. Tarkibiy ishsizhk (ayrim kasblar, ish turlariga bo'lgan talabning susayishi natijasida yuzaga keladi). 3. Davriy ishsizlik (ayrim hududlar va tarmoqlarda ishchi kuchiga bo'lgan talabning kamayishi natijasida yuzaga keladi). "
        ]
    },
    {
        "word": "Ishsizlik Darajasi ",
        "type": [],
        "definition": [
            "ishsizlik sonining iqtisodiy faol aholi soniga nisbati. 16 va undan yuqori yoshdagilar, lekin ishga ega bo'lmaganlar, faol ish qidirayotganlar, ishni boshlashga tayyor turganlar ishsizlar deb ataladi. "
        ]
    },
    {
        "word": "Ishsizlikning Tabiiy Darajasi ",
        "type": [],
        "definition": [
            "real va potensial yalpi milliy mahsulotning o'sishi bir-biriga mos keladigan iqtisodiy rivojlanish davri oraliqlariga xos bo'lgan ishsizlik darajasi. U iqtisodiy rivojlanishning haqiqiy va strukturaviy ishsizlik ko'rsatkichlari yig'indisi sifatida ham hisoblanishi mumkin. Shuningdek, NARU (natural rate of unemloyment) atamasi ishsizlikning o'smaydigan darajasi ko'rsatkichi tarzida ham qo'llaniladi. Bu ko'rsatkich ijtimoiy jihatdan nisbatan neytral bo'lib, inflyatsiyaning turg'un, barqaror darajalari hamda real va potensial yalpi milliy mahsulot (YaMM) mos tushgan holatidagi ishsizlik darajasini aks ettiradi. "
        ]
    },
    {
        "word": "Islohot",
        "type": [],
        "definition": [
            " turli ravishda o'tkazilgan o'zgarish: isloh qilish, reforma. Iqtisodiy islohot iqtisodni inqiroz holatidan chiqarish borasida o'tkazilgan chora-tadbirlar yig'indisidir. "
        ]
    },
    {
        "word": "Islom",
        "type": [],
        "definition": [
            "VII asrda (hijriy 622-yil) - dastlab Arabistonda tarqalgan so'nggi muqaddas din. Islomning muqaddas kitobi Quroni karimda (arabchada o'qish, qiroat degani) Alloh taolo tarafidan shaxsiy mulk muqaddas deb e’lon qilingan, unga ko'z olaytirish katta gunoh deyilgan va sudxo'rlik harom qilingan, ortiqcha sarf-xarajatlar qoralangan, ayniqsa, “yenglar, ichinglar, hadya qilinglar, lekin isrof qilmang” degan oyatlar bugungi kun uchun ham ahamiyatlidir. "
        ]
    },
    {
        "word": "Isteʼmol Xarajatlari ",
        "type": [],
        "definition": [
            "tovarlar va xizmatlarni yakuniy iste’mol qilish maqsadida xarid qilish uchun qilingan xarajatlar. Uy xo'jaliklari va davlatning iste’mol xarajatlariga bo'linadi. YalMning xarajatlariga ko'ra tarkibida eng katta va barqaror komponent. "
        ]
    },
    {
        "word": "Isteʼmol",
        "type": [],
        "definition": [
            "ijtimoiy ishlab chiqarish jarayonining oxirgi fazasi, ijtimoiy mahsulotdan aholining iqtisodiy talablarini qondirish jarayoni."
        ]
    },
    {
        "word": "Isteʼmol Baholari Indeksi",
        "type": [],
        "definition": [
            "iste’mol savatiga kiritilgan tovar va xizmatlar bahosining u yoki bu davrdagi o'rtacha o'zgarishini ifodalovchi indeks. U, odatda, Leypeyres formulasi bo'yicha aniqlanadi."
        ]
    },
    {
        "word": "Isteʼmol Bozori ",
        "type": [],
        "definition": [
            "aholi iste’moli uchun zarur bo'lgan tovarlar va xizmatlarning ayirboshlanishi. "
        ]
    },
    {
        "word": "Isteʼmol Bozoridagi Mutanosiblik ",
        "type": [],
        "definition": [
            "iste’mol bozoriga taklif etilayotgan tovarlar va xizmatlar hajmi bilan aholining to'lovga qodir talabining o'zaro mosligi. "
        ]
    },
    {
        "word": "Isteʼmol Budjeti ",
        "type": [],
        "definition": [
            "moddiy-ma’naviy ne’matlar va xizmatlar iste’moli salmog'i va tarkibining qiymati bahosi hamda soliqlardir. "
        ]
    },
    {
        "word": "Isteʼmol Darajasi ",
        "type": [],
        "definition": [
            "ma’lum paytda haqiqiy iste’molning istalgan, mo‘ ljallangan yoki ratsional iste’molga nisbatan erishgan darajasi. "
        ]
    },
    {
        "word": "Isteʼmol Funksiyasi ",
        "type": [],
        "definition": [
            "jami iste’mol sarflari bilan har ma’lum paytda iste’molchi ixtiyoridagi daromadning har xil miqdorlar o'rtasidagi bog'liqlik. Ma’lum bir paytda iste’molchi ixtiyoridagi daromadning mumkin bo'lgan har xil darajalaridagi iste’mol sarflari. "
        ]
    },
    {
        "word": "Isteʼmol Krediti ",
        "type": [],
        "definition": [
            "bu aholining iste’mol talablarini qondirishga yordam beruvchi kreditdir va uy-ro'zg'or buyumlari: radio-elektron va maishiy asbob-uskunalar, mebellar, interyer buyumlari, turar uy- joylarni ta’mirlash bilan bog'liq tovarlarni xarid qilish, avtomashina sotib olish va aholiga ko'rsatiladigan tibbiy xizmatlar va boshqa xizmatlarning haqini to'lash uchun 3 yilgacha bo'lgan muddatga beriladi. "
        ]
    },
    {
        "word": "Isteʼmol Meʼyori ",
        "type": [],
        "definition": [
            "mahsulotlar iste’moli ratsional darajasining ko'rsatkichlari. "
        ]
    },
    {
        "word": "Isteʼmol Mollari Va Xizmat ",
        "type": [],
        "definition": [
            "uy xo'jaliklari, notijorat tashkilotlar tomonidan ishlab chiqarish jarayonida, tizimda ko'rsatilganidek, qo'shimcha o'zgartirishsiz foydalaniladigan tovar va xizmatlar. Bunday foydalanish uy xo'jaligiga xizmat ko'rsatuvchi subyektlar, shaxslarning bevosita ehtiyoji va xohishini yoki jamiyat a’zolarining umumiy ehtiyojlarini qondiruvchi umumdavlat boshqaruvbirliklari tomonidan amalga oshirilishi mumkin. "
        ]
    },
    {
        "word": "Isteʼmol Muvozanati ",
        "type": [],
        "definition": [
            "iste’molchining holati, u barcha daromadiga tovar va xizmatlarni ma’lum baholarda va shunday miqdorda xarid qiladiki, ularning nafliligini oshiradi. "
        ]
    },
    {
        "word": "Isteʼmol Narxlarindeksi ",
        "type": [],
        "definition": [
            "o'rtacha oila tomonidan, odatda, iste’mol qilinadigan tovar va xizmatlar narxining bazis davriga nisbatan o'zgarishi o'rtacha darajasini aks ettiradigan ko'rsatkich, inflyatsiya ko'rsatkichi sifatida ishlatiladi. "
        ]
    },
    {
        "word": "Isteʼmol Savati ",
        "type": [],
        "definition": [
            "insonning salomatligini saqlash va uning hayot faoliyatini ta’minlash uchun zarur bo'lgan oziq-ovqat mahsulotlari, nooziq- ovqat tovarlari va xizmatlarning minimal to'plamidir. Bu yig'indi aholi iste’molining tarkibi va darajasini to'liqroq ifodalaydi."
        ]
    },
    {
        "word": "Isteʼmol Soligʻ1 ",
        "type": [],
        "definition": [
            "bir necha mamlakatlardagi soliqlar guruhi, daromad sarf qilinayotgan paytda olinadi. Qo'shilgan qiymat solig'i va aksizlar ana shunday soliq tarkibiga kiradi. Bojxona bojlarini ham iste’mol soliqlari qatoriga kiritish mumkin. Bu soliqlarning ayrimlari davlat foydasiga olinsa, boshqa birovlari mahalliy budjetlarga borib tushadi. "
        ]
    },
    {
        "word": "Isteʼmol Strukturasi ",
        "type": [],
        "definition": [
            "iste’mol yo nalishlari va iste’mol qilinadigan mahsulot turlari. "
        ]
    },
    {
        "word": "Isteʼmol Tovarlari ",
        "type": [],
        "definition": [
            "insonlarning bevosita ehtiyojlarini qondiruvchi tovar va xizmatlar, masalan, oziq-ovqat mahsulotlari, kiyim-bosh, maishiy xizmatlar va shu kabilar. "
        ]
    },
    {
        "word": "Isteʼmol Tovarining Xizmat Muddati ",
        "type": [],
        "definition": [
            "mahsulotning o'z iste’mol xossalarini yo'qotmay saqlab turish davri. "
        ]
    },
    {
        "word": "Isteʼmolchi",
        "type": [],
        "definition": [
            "o'z ehtiyojini qondirish uchun mahsulot, tovar, xizmatlardan foydalanadigan shaxs, oila, jamoa, korxona, tashkilot, muassasa. "
        ]
    },
    {
        "word": "Isteʼmolchi Jamoa ",
        "type": [],
        "definition": [
            "korxonalar, tashkilotlar, muassasalar va boshqa jamoalar. "
        ]
    },
    {
        "word": "Isteʼmolchi Ortiqchaligi (Yutugʻ1) ",
        "type": [],
        "definition": [
            "iste’molchi tovarlar uchun to'lashi mumkin bo'lgan narxlar bilan tovarlarga bozorda haqiqiy to'langan narxlar ayirmalarining yig'indisi. "
        ]
    },
    {
        "word": "Isteʼmolchi Ulushi ",
        "type": [],
        "definition": [
            "bozor ulushini kengaytirishdan iste’molchilar sonini ko'paytirishga o'tish. Buning uchun kompaniyalar dolzarb iste’molchilarga tovarlarning kengaytirilgan assortimentini taklif etadilar, xodimlarni o'zaro o'rnini bosuvchi tovarlarni sotishga va savdo hajmini oshirishga o'rgatadilar. "
        ]
    },
    {
        "word": "Isteʼmolchilar Paneli ",
        "type": [],
        "definition": [
            "ko'p marta marketing tadqiqotlari uchun maxsus tanlab olingan, sinaladigan kishilar majmuyi."
        ]
    },
    {
        "word": "Isteʼmolchilar Talabi ",
        "type": [],
        "definition": [
            "ma’lum paytda yoki davrda iste’molchilar ehtiyojining to'lov vositasi bilan ta’minlangan qismi; to'lov qobiliyatiga ega bo'lgan ehtiyoji; odamda biror narsaga talab paydo bo'lishi uchun o'sha narsaga ehtiyoji va shunga yarasha mablag'i bo'lishi kerak; bozor mexanizmining muhim elementi bo'lib, xaridor tomonidan bozorga chiqadi; ehtiyojningbozorda ko'rinishi, qondirish shakli. "
        ]
    },
    {
        "word": "Isteʼmolchilar Xarid Fondlari",
        "type": [],
        "definition": [
            "iste’molchilar (aholi) pul daromadlarining tovarlar sotib olish uchun mo'ljallangan va ajratilgan qismi. "
        ]
    },
    {
        "word": "Isteʼmolchilar Xarid Qobiliyati ",
        "type": [],
        "definition": [
            "iste’molchilarning o'zlariga zarur tovarlar (xizmatlar) ni sotib olish uchun moliyaviy imkoniyatlari bo'lib, xarid fondlarining tovarlar narxlarida ifodalangan shakli."
        ]
    },
    {
        "word": "Isteʼmolchining Mustaqilligi",
        "type": [],
        "definition": [
            "(suvereniteti) - iste’mol huquqining mustaqilligi, qaram emasligi, huquqning mustaqil yo'nalishi bo'lib, tovar va xizmatlar bozorida iste’molchining manfaatlarini himoya qilishga qaratilgan qoida va yo'riqnomalar majmuyidan iborat. "
        ]
    },
    {
        "word": "Isteʼmol (Jamgʻarish)Ga Chegaralangan Moyillik ",
        "type": [],
        "definition": [
            " iste’mol xarajatlaridagi (jamg'arish hajmi) o'zgarishning bu o'zgarishni keltirib chiqargan daromadlarning o'zgarish miqdoridagi ulushi. "
        ]
    },
    {
        "word": "Isteʼmolga Oʻrtacha Moyillik ",
        "type": [],
        "definition": [
            "iste’mol xarajatlarining daromaddagi (yoki shaxsiy tasarrufdagi daromad hajmidagi) hissasi. "
        ]
    },
    {
        "word": "Isteʼmol Bozoridagi Mutanosiblik ",
        "type": [],
        "definition": [
            "iste’mol bozoriga taklif etilayotgan tovarlar va xizmatlar hajmi bilan aholining to'lovga qodir talabining o'zaro mosligi. "
        ]
    },
    {
        "word": "Istiqbolli Moliyaviy Maʼlumotlar ",
        "type": [],
        "definition": [
            "ma’lum voqealar sodir bo'lishi vaxo'jalikyurituvchisubyektrahbariyatitomonidanmuayyan harakatlar amalga oshirilishi taxminlaridan kelib chiqadigan xo'jalik yurituvchi subyektning kelajakdagi moliyaviy holati, faoliyatining kelajakdagi moliyaviy natijalari, pul mablag'larining yoki moliyaviy xo'jalik faoliyatidagi alohida tarmoqlarining harakatlari to'g'risida ma’lumot. "
        ]
    },
    {
        "word": "Istiqbolli Rejalar ",
        "type": [],
        "definition": [
            "uzoq muddatli davrlar uchun korxonani iqtisodiyijtimoiy rivojlantirish nisbatlari va yo'nalishlarini belgilab beruvchi rejalar. "
        ]
    },
    {
        "word": "Istiqbolni Aniqlash ",
        "type": [],
        "definition": [
            "moliyaviy mexanizmining asosiy qismi bo'lib, u moliyaviy rejalar va balanslar hamda moliyaviy ko'rsatkichlar, norma va normativlar tizimini o'z ichiga oladi. "
        ]
    },
    {
        "word": "Istiqbolni Belgilash Malakasi ",
        "type": [],
        "definition": [
            "ijtimoiy va bilish jarayonlarini rejalashtirish va boshqarish. "
        ]
    },
    {
        "word": "Isteʼmol Tovarlar! ",
        "type": [],
        "definition": [
            "inson ehtiyojini qondirishga mo'ljallangan iste’mol buyumlarining tovar shakli; pulga sotib olib, iste’mol etiladigan moddiy mahsulotlar va har xil xizmatlar. "
        ]
    },
    {
        "word": "Ixtilof",
        "type": [],
        "definition": [
            "bir-biriga qarama-qarshi yo'naltirilgan maqsadlar, manfaatlar, nuqtayi nazarlar, fikrlar yoki ikki va undan ortiq kishining qarashlari to'qnashuvidan iborat. "
        ]
    },
    {
        "word": "Ixtiloflarni Boshqarish ",
        "type": [],
        "definition": [
            "ixtilofni vujudga keltirgan sabablarga barham berish (kamaytirish) sohasida aniq maqsadli tasir ko'rsatish yoki ixtilof qatnashchilari xulq-atvorini o'zgartirishga qaratilgan ta’sir ko'rsatish. "
        ]
    },
    {
        "word": "Ixtiloflarni Hal Qilish ",
        "type": [],
        "definition": [
            "ularning sabablari va oqibatlariga barham beradigan jarayon yoki aniq maqsadga qaratilgan faoliyatdir."
        ]
    },
    {
        "word": "Ixtilofli Vaziyat ",
        "type": [],
        "definition": [
            "tomonlarning biron-bir xususda qarama-qarshi, ziddiyatli nuqtayi nazari, ziddiyatli maqsadlarga intilishi, ularga erishish uchun turli-tuman vositalardan foydalanishi, manfaatlar, istaklarning bir-biriga mos kelmasligi va shu kabilar. "
        ]
    },
    {
        "word": "Ixtiro",
        "type": [],
        "definition": [
            " turli sohalardagi mahsulot (xususan; qurilma, modda, mikroorganizm shtamplari, o'simlik va hayvonlar hujayralari) yoki usul (moddiy vositalar yordamida moddiy obyektlar ustidan harakatni amalga oshirish jarayoni)ga tegishli texnik yechim. "
        ]
    },
    {
        "word": "Ixtisoslashgan Banklar",
        "type": [],
        "definition": [
            "muayyan mijozlar guruhiga xizmat ко rsatadigan yoki ayrim harakatlarga ixtisoslashgan banklar. Masalan, eksport banklari, ipoteka banklari, investitsion bank va shu kabilar. "
        ]
    },
    {
        "word": "Ixtisoslashtirish",
        "type": [],
        "definition": [
            "1. Faoliyatni biron-bir mashg'ulotga, kasb-hunarga yo'naltirish; ijtimoiy mehnat taqsimoti shaldlaridan biri. 2. Biron- bir cheklangan sohada ma’lumot olish. 3. Ishlab chiqarishni ixtisoslashtirish, sanoatda, qurilishda, qishloq xo'jaligida, xizmat ko'rsatish sohasida texnologiyani ixtisoslashtirish - faoliyatini muayyan mahsulot, buyum, detal ishlab chiqarishga yo'naltirish. Ishlab chiqarish ixtisoslashtirish - fan-texnika taraqqiyoti va ishlab chiqarish ko'lami oshganligining ifodasi, uning samaradorligini oshirish va mehnat unumdorligini ko'tarishning eng muhim yo'llaridan biri."
        ]
    },
    {
        "word": "Ixtisoslashuv",
        "type": [],
        "definition": [
            " ishlab chiqarishning muayyan mahsulot ishlab chiqarish yoki xizmat ko'rsatishga moslashuvidir. Ixtisoslashuv asosida mehnat taqsimoti turadi."
        ]
    },
    {
        "word": "Ixtiyoriyishsizlik",
        "type": [],
        "definition": [
            "qarang: friksion ishsizlik."
        ]
    },
    {
        "word": "Ixtiyorjy Sugʻurta ",
        "type": [],
        "definition": [
            "tomonlarning xohish-irodasiga ko'ra amalga oshiriladigan sug'urta. "
        ]
    },
    {
        "word": "Izohlash (Tushuntirish) ",
        "type": [],
        "definition": [
            "og'zaki izoh, yoritilishi lozim bo'lgan turli materiallarni izohlash, isbotlash, tahlil qilish. "
        ]
    },
    {
        "word": "Izokosta",
        "type": [],
        "definition": [
            "yig'indisi bir xil yalpi xarajatga teng bo'lgan resurslar sarflari kombinatsiyalarini ifodalovchi chiziq. "
        ]
    },
    {
        "word": "Izokvant Karta",
        "type": [],
        "definition": [
            "izokvantlar jami si, ularning har biri, qo'llanilayotgan resurslarning har xil birikmalarini qo'llashda erishish mumkin bo'lgan maksimal ishlab chiqarish hajmini ko'rsatadi."
        ]
    },
    {
        "word": "Izokvanta ",
        "type": [],
        "definition": [
            " mahsulotni ishlab chiqarishda qo' llanishi mumkin bo' lgan barcha o'zgaruvchan resurslarning o'zaro birikish kombinatsiyalarini aks ettiruvchi egri chiziq. Foydalanish bir xil xarajatlarni talab etuvchi resurslarning barcha birikish kombinatsiyalarini ko'rsatuvchi egri"
        ]
    },
    {
        "word": "Iot (Internet Of Things) ",
        "type": [],
        "definition": [
            "Internet narsalar - internetga ulangan real dunyo bilan о‘zaro munosabatni amalga oshiruvchi sensorlar va chiplardan tashkil topgan narsalar tarmog‘i.  "
        ]
    }
]