[
    {
        "word": "Jadallashtirilgan Amortizatsiya ",
        "type": [],
        "definition": [
            " kamayayotgan balans usuli da hisoblanadigan amortizatsiya. Bunda foydalanishning birinchi yilida ajratiladigan mablag'lar me’yori ikki baravarga oshiriladi, ikkinchi yilda esa qoldiq qiymatdan 20% ajratiladi va h. k. "
        ]
    },
    {
        "word": "Jahon Bahosi ",
        "type": [],
        "definition": [
            " talab va taklif egri chiziqlari tasirini hisobga olgan holda milliy narx ko'rsatkichlari ta sirida xalqaro savdo markazlarida hosil bo'ladi. "
        ]
    },
    {
        "word": "Jahon Banki ",
        "type": [],
        "definition": [
            "rasman nomi xalqaro ta’mirlash va taraqqiyot banki. 1944-y ilda Xalqaro valyuta jamg'armasi bilan bir vaqtda tuzilgan birinchi davlatlararo investitsiya institutidir. Bank o'zining faoliyatini 1946- yil 25-iyundan boshlagan. Jahon banki o'zaro bir-biri bilan bog'liq beshta institutdan tarkib topgan ko'p tomonlama kredit tashkiloti hisoblanadi. "
        ]
    },
    {
        "word": "Jahon Bankining Bosh Maqsadi ",
        "type": [],
        "definition": [
            "uzoq muddatli iqtisodiy o'sishga yordam ko'rsatish, buning natijasi o'laroq, rivojlanayotgan mamlakatlarda qashshoqlikni tugatish. Jahon banki qarzlari faqat rivojlanayotgan mamlakatlarga ularning uzoq muddatli rivojlanishni hal etish uchun beriladi. O'zbekiston Jahon bankiga 1992-yilda a’zo bo'Igan. Jahon ankida 3 ta sho'ba bor, bular XTTBdan ancha keyin tashkil etilgan. "
        ]
    },
    {
        "word": "Jahon Bozori ",
        "type": [],
        "definition": [
            "xalqaro mehnat taqsimoti orqali bir-biriga bog'langan mamlakatlar o'rtasidagi barqaror oldi-sotdi munosabatlari. Jahon bozorida ishtirok etish uchun mamlakatning eksport salohiyatini yuksaltirish kerak. Jahon bozori tovarlar, xizmatlar, valyuta, investitsiya, iimiy ishlanmalar bozorlaridan iborat. "
        ]
    },
    {
        "word": "Jahon Bozori Konyunkturasi ",
        "type": [],
        "definition": [
            "jahon tovar bozorlaridagi sotish sharti, ushbu bozorlardagi talab, taklif, narxlar darajasi, ularning o'zgarish tendensiyalari. "
        ]
    },
    {
        "word": "Jahon Infratuzilmasi ",
        "type": [],
        "definition": [
            "jahon mamlakatlari o'rtasidagi barcha munosabatlarni rivojlantirishga xizmat qiladigan kema, samolyot, poyezd, avtomobil transporti, xalqaro gaz va neft quvurlari, elektr energiyasini yetkazib berish tarmoqlari, reklama, axborot yetkazib berish kommunikatsiyalari (telefon, radio, oynayijahon, kompyuter tizimi), xalqaro birjalar, moliya markazlari, banklar tizimini o'z ichiga oladi."
        ]
    },
    {
        "word": "Jahon Iqtisodiyoti Nazariyalari ",
        "type": [],
        "definition": [
            "jahon bozorida mahsulot, valyuta, ishchi kuchi va boshqalarning harakat jarayonlariga xos qonun va qonuniyadarini o'rganuvchi nazariyalar. “Ishlab chiqarish omillarining xalqaro taqsimoti” nazariyasi tipikdir (E. Xeksher, B. Olin, P. Samuel son); “Mahsulot hayoti sikli” nazariyasi (G. Xufbauer, R. Vernon, M. Pozner); Monopolistik raqobat nazariyasi (E.X. CHemberlin) va boshqalar. "
        ]
    },
    {
        "word": "Jahon Ishchi Kuchi Bozori ",
        "type": [],
        "definition": [
            "(JIKB) - milliy xo'jalik tizimlari va jahon iqtisodiyoti doirasida ishlab chiqaruvchi kuchlarning darajasi, tabiati va joylashuviga sezilarli ta’sir etuvchi iqtisodiy faol aholining mamlakatlar va hududlar o'rtasida jami migratsion aylanmasi. "
        ]
    },
    {
        "word": "Jahon Moliyaviy Inqirozi ",
        "type": [],
        "definition": [
            "bu bank-moliya tizimida ro'y bergan chuqur tanglik holati, buning natijasida yirik banklar va moliyaviy tuzilmalarning likvidlik, ya’ni to'lov qobiliyati zaiflashib, moliyaviy inqirozga aylanib ketishi, dunyoning yetakchi fond bozorlarida eng yirik kompaniyalar indekslari va aksiyalarning bozor qiymati halokatli darajada tushib ketishi, oqibatda ko'plab mamlakatlarda ishlab chiqarish va iqtisodiy o'sish sur atlarining keskin pasayib ketishi bilan bog'liq ishsizlik va boshqa salbiy oqibatlarni keltirib chiqaruvchi holatdir. "
        ]
    },
    {
        "word": "Jahon Puli",
        "type": [],
        "definition": [
            " xalqaro miqyosda hamma uchun umumiy xarid va umumiy to' lov vositasi, boylikning umumiy moddiy timsoli, baynalmilal qiymat ifodasi bo'lgan pul. Ilgarilari jahon puli vositasini oltin yombilari bajargan, hozir esa bu vazifani dollar, yevro, funt sterling, nemis markasi, yapon iyeni, Fransiya va Shvetsariya franki bajaradi"
        ]
    },
    {
        "word": "Jahon Savdo Tashkiloti",
        "type": [],
        "definition": [
            "xalqaro savdoning institutsional va huquqiy asosini tashkil etuvchi mustaqil davlatlararo tashkilot. "
        ]
    },
    {
        "word": "Jahon Valyuta Tizimi ",
        "type": [],
        "definition": [
            "xalqaro pul-kredit munosabati bo'lib, jahon bozorining rivojlanishi natijasida tarkib topgan va davlatlar o'rtasida tuzilgan bitimlar bilan mustahkamlangan. Jahon valyuta tizimining asosiy unsurlari quyidagilardan iborat: zaxiradagi milliy va jahon valyuta birliklari, valyutalarning oltin nisbati hamda kurslari mexanizmi, o'zaro qaytarilish sharti, cheklanish hajmi, xalqaro hisob-kitoblar shakli, xalqaro valyuta va oltin bozorlari tarkibi, valyuta munosabatlarini boshqaradigan davlatlararo valyuta-kredit tashkilotlarining maqomi va boshqalar. 3 ta jahon valyuta tizimi mavjud: a) XIX asr oxirida oltin va kumush andozasi asosida yuzaga kelgan tizim; b) oltin andozasi asosida yuzaga kelgan tizim. Bu tizim 1944-yili AQSH va Brutton-Vuds konferensiyalarida yuridik jihatdan rasmiylashtirilgan; v) 1971-yilda AQSH o'z dollarini oltinning rasmiy bahosi bo'yicha almashtirib olishdan bosh tortdi va uzoq yillar davom etgan oltinning jahon bozoridagi bahosiga ko‘ra belgilanadigan valyuta fondi tizimi puturdan ketdi. 1976-yilda “Xalqaro valyuta fondi a’zolari” bo'lgan davlatlaming kelishuvlariga muvofiq “Tebranib turuvchi boshqariladigan valyuta kursi tizimi” belgilandi. Unga ko'ra, XVF ga a’zo bo'lgan davlatlar o'z valyuta kurslarini mustaqil tanlab olish huquqiga ega. "
        ]
    },
    {
        "word": "Jahon Xoʻjaligi ",
        "type": [],
        "definition": [
            "jahon xalqaro mehnat taqsimotida ishtirok etuvchi va jahon mamlakatlari bilan iqtisodiy munosabatlar tizimi orqali bog'liq bo'lgan mamlakatlar milliy xo'jaliklari yig'indisi. XVI asrdagi buyuk geografik kashfiyotlar tufayli rivoj topgan, ayniqsa, II Jahon urushidan keyin avj olgan xalqaro iqtisodiy munosabatlar majmuyi. Xalqaro mehnat taqsimoti bu xo'jalikning moddiy asosini tashkil etadi. Xalqaro integratsiyada baynalmilallik xos. "
        ]
    },
    {
        "word": "Jahon Xoʻjaligi Integratsiyasi ",
        "type": [],
        "definition": [
            "jahon xo'jaligi ishlab chiqarishining asosiy ko'rinishlaridan biri mamlakatlararo ishlab chiqarish,savdo, valyutamunosabatlarivaboshqasohalardaiqtisodiy hamkorlikni rivojlantirishga qaratilgan u yoki bu mintaqadagi davlatlar ittifoqining shakllanishi bo'ldi. Buning asosida yuzaga keladigan xo'jalik aloqalarini bog'lovchi va birlashtiruvchi iqtisodiy jarayonlar davlatlar o'rtasidagi integratsiya nomini oldi. "
        ]
    },
    {
        "word": "Jahonshumul Muammolar",
        "type": [],
        "definition": [
            "dunyodagi ijtimoiy hodisalar va jarayonlarning alohida qatorini tashkil etadi. Bular o'z miqyosi va ahamiyatlari jihatdan olamshumul xususiyatga egaligi bilan ajralib turadi. Bu muammolarni ijtimoiy tuzum, taraqqiyot darajasi, dini, jo'g'rofiy mavqeyidan qat’i nazar, barcha davlatlaming hamjihatligi bilan hal etish mumkin. Bu muammolarga urush va tinchlik, qurolsizlanish va rivojlanish; inson-jamiyat muammolari; jamiyat- tabiat muammolari kiradi. "
        ]
    },
    {
        "word": "Jamgarib Boriladigan Ixtiyoriy Pensiya Badallari ",
        "type": [],
        "definition": [
            "shaxsiy jamg'arib boriladigan pensiya hisob-raqamlariga ixtiyoriylik asosida kiritiladigan pul mablag'lari kiradi. "
        ]
    },
    {
        "word": "Jamgarib Boriladigan Pensiya Taʼminoti ",
        "type": [],
        "definition": [
            "fuqarolarni shaxsiy jamg'arib boriladigan pensiya hisob-raqamlaridagi mablag'lardan davlat pensiyasiga qo'shimcha ravishda pul mablag'lari bilan ta’minlash. "
        ]
    },
    {
        "word": "Jamgarish",
        "type": [],
        "definition": [
            "1. Ixtiyordagi daromadning bir qismi bo'lib, u oxirgi iste’mol maqsadlari uchun sarflanmaydi, balki jamg'arish uchun sarflanadi. Kengaytirilgan takror ishlab chiqarishni amalga oshirish maqsadida asosiy fondlar, aylanma mablag'lar va moliyaviy aktivlar hajmi orttiriladi. 2. Mavjud daromaddan foydalanish hisobida balanslantiruvchi modda. Bu modda mavjud daromadning pirovard iste’mol qilinadigan tovar va xizmatlar uchun hali sarflanmagan qismini ko'rsatadi. "
        ]
    },
    {
        "word": "Jamgʻarish Fondi ",
        "type": [],
        "definition": [
            "milliy daromadning bir qismi bo'lib, asosiy va aylanma fondlar, zaxirani ko'paytirish uchun foydalaniladi. Ishlab chiqarish jamg'arish fondi va noishlab chiqarish jamg'arish fondi mavjud. Jamg'arish fondi kengaytirilgan takror ishlab chiqarishning sur’atlarini belgilab beradigan hal qiluvchi omildir. "
        ]
    },
    {
        "word": "Jamgʻarish Funksiyasi ",
        "type": [],
        "definition": [
            "har qanday yillik potensial daromad darajasidan qat’i nazar, ishlab chiqaruvchi tomonidan sarf qilinmoqchi bo'Igan investitsion sarflar. "
        ]
    },
    {
        "word": "Jamgʻarish Normasi ",
        "type": [],
        "definition": [
            " jamg'arish fondining milliy daromadga nisbatan foizda ifodalanishi. "
        ]
    },
    {
        "word": "Jamgʻarish Va Kapital Transfertlar Tufayli Xususiy Kapital Sof Qiymatining Oʻzgarishi ",
        "type": [],
        "definition": [
            "kapital muomalasi hisobidagi manbayi xususiy kapital yoki birlikning sof qiymati o'zgarganligini ko'rsatadi. Bu o'zgarish jamg'arish va kapital transfertlari tufayli ro'y beradi. "
        ]
    },
    {
        "word": "Jamgʻarishga Chegaralangan Moyillik",
        "type": [],
        "definition": [
            "jamg'arish hajmi o'zgarishning bu o'zgarishni keltirib chiqargan daromadlarning o'zgarish miqdoridagi ulushi. "
        ]
    },
    {
        "word": "Jamgʻarma",
        "type": [],
        "definition": [
            "aholining kelajak ehtiyojlarini qondirish va kelajakda xarid qilish uchun saqlab qo yilgan pulli daromadlari. Uning hajmi ixtiyoridagi daromaddan iste’mol xarajatlarni ayirish yo'li bilan belgilanadi. "
        ]
    },
    {
        "word": "Jamgʻarma Banki ",
        "type": [],
        "definition": [
            " kredit muassasasi bo'lib, uning asosiy vazifasi aholining pul jamgarmalari va vaqtincha erkin pul mablag'larini jalb qilish va aholiga kredit berishdan iborat."
        ]
    },
    {
        "word": "Jamgʻarma Sertifikatlari ",
        "type": [],
        "definition": [
            "bank tomonidan chiqariladigan va uning egasiga oldindan shartlashilgan vaqtda belgilangan summani olish huquqini beruvchi qimmatli qog'ozdir. "
        ]
    },
    {
        "word": "Jamgʻarmachi",
        "type": [],
        "definition": [
            "tijorat banklariga pul mablag'i qo'ygan jismoniy va yuridik shaxslardir. "
        ]
    },
    {
        "word": "Jami Band Aholi ",
        "type": [],
        "definition": [
            "band bo'Igan aholi va harbiy xizmatchilar."
        ]
    },
    {
        "word": "Jami Ijtimoiy Mahsulot ",
        "type": [],
        "definition": [
            "ma’lum davr mobaynida, jamiyatda hosil qilingan barcha iste’mol mahsulotlari qiymatlari yig'indisidan iborat. Uijtimoiyishlabchiqarishningbarchabo'g'inlaridasarflangan mehnatni mujassamlashtiradi va ayrim ishlab chiqaruvchilarning shu vaqt oralig'idagi mahsulotlarining yig'indisi sifatida ta’riflanadi. JIM tarkibiga turli-tuman moddiy va moddiy bolmagan ne’matlar va xizmatlar kiradi. "
        ]
    },
    {
        "word": "Jami Taklif ",
        "type": [],
        "definition": [
            "iqtisodiyot ishlab chiqaradigan hamma tovar va xizmatlar; mumkin bo'lgan har bir baho darajasidagi ishlab chiqarishning real hajmi. Unga baho ta’sir etadi. Bu ta’sir proporsionaldir, ya’ni baho darajasi o'sgan sari jami taklif miqdori ham o'sadi. Undan tashqari, jami taklifga resurslarga baholarning o'zgarishi, ishlab chiqarish unumdorligining o'sishi va shu kabi omillar tasir ko'rsatadi. "
        ]
    },
    {
        "word": "Jami Taklif Egri Chizigʻining Klassik Kesmasi ",
        "type": [],
        "definition": [
            "jami taklif egri chizig'ining vertikal qismi iqtisodiyotda to'liq bandlik sharoitidagi yoki ishsizlikning tabiiy nuqtasidagi holatini ifodalaydi, bunda real YaMM hajmi o'zgarmasdan qoladi, faqat baholar oshadi. "
        ]
    },
    {
        "word": "Jami Taklif Egri Chizigʻining Oraliq.kesmasi",
        "type": [],
        "definition": [
            " ishlab chiqarish real hajmining o'sishi bilan baholar ham o'sayotgan vaziyatni aks ettiradi. Milliy ishlab chiqarish miqdorining ortishi baholarning o'zgarishi sharoitida yuz beradi. "
        ]
    },
    {
        "word": "Jami Talab ",
        "type": [],
        "definition": [
            " mumkin bo'lgan har qanday baholar darajasida iste’molchilar, tadbirkorlar va davlat tomonidan sotib olinishi mumkin bo'lgan mahsulot hajmi. Jami talabga baho darajasi teskari proporsional ta’sir ko'rsatadi, ya’ni baho o'sgan sari talab kamayadi va aksincha, shuningdek, jami talabga aholi daromadlari, investitsion sarflardagi o'zgarishlar kabi omillar tasir qiladi. "
        ]
    },
    {
        "word": "Jami Tashqi Samara ",
        "type": [],
        "definition": [
            "ma’lum ne’matning ishlab chiqarish hajmi. Unda me’yoriy umumiy naflilik me’yoriy umumiy xarajatlarga teng bo'ladi. "
        ]
    },
    {
        "word": "Jamiyatning Sof Yoʻqotishlari (Monopoliyalarning Ijtimoiy Baho Si)",
        "type": [],
        "definition": [
            "monopoliya mahsulot ishlab chiqarish hajmini samarali darajada past qilib qisqartirishi natijasida ortiqcha iste’molchi va xaridorlar kamayishi. "
        ]
    },
    {
        "word": "Jam Lan Gan Budjet ",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasi budjet tizimining geografik tuzilishiga muvofiq turli darajadagi barcha budjetlar yig'indisi."
        ]
    },
    {
        "word": "Jamlanma (Konsentrik) Diversifikatsiya ",
        "type": [],
        "definition": [
            "firma texnikaviy yoki bozor nuqtayi nazaridan korxonaning ilgarigi tovarlariga o'xshash yangi mahsulotni ishlab chiqarish. "
        ]
    },
    {
        "word": "Jamoa",
        "type": [],
        "definition": [
            "birgalikda mehnat qiladigan shaxslar guruhi bo'lib, unda kishilar birbirlari bilan shunday o'zaro harakat qiladilarki, har kim boshqa shaxsga murojaat qiladi, ayni vaqtda uning tasirini ham his etadi. "
        ]
    },
    {
        "word": "Jamoa Isteʼmol Xizmati ",
        "type": [],
        "definition": [
            " ayni bir vaqtda jamiyatning barcha a’zolariga yoki alohida ijtimoiy guruh a’zolariga, masalan, muayyan tumanda yashovchi uy xo'jaliklariga ko'rsatiladigan xizmat. "
        ]
    },
    {
        "word": "Jamoa Mulki ",
        "type": [],
        "definition": [
            "madaniylashgan jamiyatda mulkchilikning bir shakli bo'lib, uning asosiy belgisi ishlab chiqarish vositalari va uning natijalariga jamoa-guruh tarzida egalik qilishdir. O'zbekistonda qabul qilingan mulkchilik to'g'risidagi qonunda ishlab chiqarish vositalari sifatida jamoa egalik qilishining kooperativ (jamoa), shirkat ijara, aksionerlik, konsern mulk shakllari mavjud bo'lishi ko'rsatilgan. "
        ]
    },
    {
        "word": "Jamoaning Funksiyalari ",
        "type": [],
        "definition": [
            "insonning jamoaga mansubligini his qilishi; shaxs uchun uning yashashiga zarur ijtimoiy muhit yaratishdir. "
        ]
    },
    {
        "word": "Jamoatchilik Bilan Aloqa Oʻrnatish ",
        "type": [],
        "definition": [
            "tashkilot, ishlab chiqariladigan tovar (xizmat)lar, kompaniyaning bosh menejerlari, ish uslubi, korporativ madaniyatga nisbatan jamoatchilik fikrining shakllantirilishiga yo'naltirilgan faoliyat turi. "
        ]
    },
    {
        "word": "Jarayon",
        "type": [],
        "definition": [
            " tashkilot tomonidan amalga oshiriladigan faoliyatning ma’lum bir qismiki, bunda ishlab chiqarishning kiritiluvchi omillari (“kirish”) tugallangan mahsulotga (“chiqish”) aylantiriladi. Bu bilan korxona o'z qiymatini ishlab chiqarishning kiritiluvchi omillariga nisbatan balandroqbo'lishini ta’minlaydi. "
        ]
    },
    {
        "word": "Jarayonning Оʼ Tkazuvchanlik Qobiliyati ",
        "type": [],
        "definition": [
            "jarayonning ma’lum bir vaqt oralig'idagi kutilayotgan unumdorligi. Bu sikl vaqtiga teskari o'lchamdir."
        ]
    },
    {
        "word": "Jarayonning Tor Joyi ",
        "type": [],
        "definition": [
            "cheklangan qobiliyat resursi. Bu berilgan jarayonning ishlab chiqaruvchanligini cheklab qo'yadigan resurs. "
        ]
    },
    {
        "word": "Jarima",
        "type": [],
        "definition": [
            "qonun, shartnoma yoki belgilangan qoidani buzganligi uchun ko'riladigan tadbir, pul to'lovi; jarima. "
        ]
    },
    {
        "word": "Jeneva Konvensiyasi ",
        "type": [],
        "definition": [
            " (veksel va cheklarni ishlab chiqarish yuzasidan) xalqaro bitim. 1949-yilda urushda azob chekkan fuqarolarni himoya qilish maqsadida tashkil etilgan."
        ]
    },
    {
        "word": "Jihat",
        "type": [],
        "definition": [
            "biror-bir maxsus fan (falsafa, siyosiy iqtisod, sotsiologiya, psixologiya va h.k.) tomonidan maxsus tadqiqot qilinadigan munosabatlar ostida namoyon bo'ladigan boshqaruv munosabatlarining bir tomoni, bir xususiyatini o'rganishga imkon beradi. "
        ]
    },
    {
        "word": "Jirant",
        "type": [],
        "definition": [
            "vekseldagi shaxsning, egasining mablag‘ini o'chirish to'g'risidagi belgi. "
        ]
    },
    {
        "word": "Jirokonto",
        "type": [],
        "definition": [
            "shu bankda joriy hisob-raqami bo'Igan uchinchi shaxs bilan hisob-kitob qilish maqsadida hisob-raqamini ochish. "
        ]
    },
    {
        "word": "Jismoniy Eskirish ",
        "type": [],
        "definition": [
            "mehnat vositalarining foydalanish va tabiat kuchlari tasiri ostida moddiy jihatdan yemirilishi. Mehnat vositalarining ma’naviy eskirishi ularning to'liq jismoniy eskirishidan oldinroq, ishlab chiqarish ko'rsatkichlari yuqoriroq va tejamkor bo'Igan mashina va qurilmalar paydo bo'lishi tufayli yuz berishi mumkin."
        ]
    },
    {
        "word": "Jismoniy Shaxs ",
        "type": [],
        "definition": [
            "iqtisodiy faoliyatda qatnashuvchi va bu jarayonning to'la huquqli subyekti sifatida faoliyat ko'rsatuvchi shaxs. Jismoniy shaxs o'z nomidan ish yuritadi, firma yoki korxona kabi hokimiyatda ro'yxatdan o'tish majburiyatidan ozod. Jismoniy shaxslar yuridik shaxs maqomini olmasdan faoliyat yuritayotgan yoki har xil sabablarga ko'ra ishlamayotgan - pensionerlar, nafaqaxo'rlar va boshqalardir. Bunday shaxslarga O'zbekiston Respublikasi fuqarosi, fuqaroligi bo'lmaganlar va chet el mamlakatlari fuqarolari kiradi. "
        ]
    },
    {
        "word": "Jismoniy Shaxs Larda N Olinadigan Mahalliy Soliqlar ",
        "type": [],
        "definition": [
            "yer uchun to'lovlar (yer solig'i, yer uchun ijara haqi), reklama solig'i, mahalliy yig'imlar (birjada amalga oshirilgan bitimlar bo'yicha yig'im, mahalliy auksion va lotoreya o'yinlarini o'tkazish huquqi uchun litsenziya yig'imi, savdo qilish huquqi uchun yig'im va boshqa maqsadli yig'imlar) dan iborat. "
        ]
    },
    {
        "word": "Jismoniy Shaxslardan Olinadigan Soliqlar ",
        "type": [],
        "definition": [
            "daromad solig'i, fuqarolarning mulkidan olinadigan soliqlar (transport vositalari solig'i, mol-mulk solig'i, uy-joy solig'i, meros tariqasida o'tadigan mulkdan olinadigan soliq va boshqalar), tadbirkorlik faoliyatini amalga oshiruvchi jismoniy shaxslardan olinadigan qayd etish yig'imi, boshqa soliq, yig'im va to'lovlardan iborat. "
        ]
    },
    {
        "word": "Jismoniy Shaxslarning Daromadiga Solinadigan Soliq",
        "type": [],
        "definition": [
            " umumdavlat soliqlari tarkibiga kirib, budjet daromadlarining muhim manbalaridan biri hisoblanadi. Moliya yilida soliq solinadigan daromadga ega bo'Igan jismoniy shaxslar bu soliqning to'lovchilaridir. Soliq progressiv xarakterga ega. U quyidagi shakllarda to'lanishi mumkin: daromad manbayidan, ya’ni asosiy ish joyidan va boshqa ish beruvchilardan; agar daromad bir necha manba hisobidan olinsa va qonuniy tarzda belgilangan daromadning yilhk summasidan oshsa, daromadlar to'g'risidagi deklaratsiya ko'rinishida; tadbirkorlikfaoliyatidan olinadigan daromadni soliqqa tortish shaklida. Jami yillik daromad bilan qonunda belgilangan chegirmalar o'rtasidagi farq sifatida hisoblangan soliq solinadigan daromad soliqqa tortish obyektidir. Jismoniy shaxslarning jami yillik daromadiga soliq to'lovchi olishi lozim bo'lgan (olgan) yoki tekinga olgan pul yoki boshqa mablag'lar, shu jumladan, mehnatga haq to'lash shaklida olinadigan daromadlar, jismoniy shaxslarning mulkiy daromadi va jismoniy shaxslarning tadbirkorlik faoliyatidan keladigan yalpi daromad kiradi. "
        ]
    },
    {
        "word": "Jon Lou ",
        "type": [],
        "definition": [
            "(1671-1729) - asli shotlandiyalik, ammo ko'proq Fransiyada ijod etgan. Merkantilizmning bir oqimi, ya’ni korxonalar va savdo haqiqiy boylikdir, degan g'oyani ilgari surgan. Bank, aksiya, obligatsiya va qimmatli qog'ozlar sotish yo'lini tutgan. Hozirgi “piramida” usuli muallifi. Oxir-oqibatda inqirozga uchradi (Moskvadagi “МММ” va boshqa shu kabi aksioner jamiyatlarining ibtidosi). Banklarning ijobiy tomonini ko'ra bildi. "
        ]
    },
    {
        "word": "Jon Soligʻ1 ",
        "type": [],
        "definition": [
            " har bir soliq to'lovchidan teng summalarda olinadigan soliq. "
        ]
    },
    {
        "word": "Jonlanish",
        "type": [],
        "definition": [
            " iqtisodiy davr (sikl)ning turg'unlikdan keyin keladigan bosqichi. Unda ishlab chiqarish tushkunlik arafasidagi darajasiga yetadi, iste’molchilarning sotib olish qobiliyati o'sadi, narxlar oshadi, ishsizlik kamayadi, jonlanish bosqichining boshlanishi ozmi-ko'pmi darajada barqaror ishlab chiqarishning kengayishiga o'tishini bildiradi. Iqtisodiy siklning ishlab chiqarishning barqaror kengayib borishiga o'tishini tavsiflovchi fazasi. "
        ]
    },
    {
        "word": "Joriy (Aylanma) Aktivlar ",
        "type": [],
        "definition": [
            "asosan, qayta takroriy sotish maqsadida yoki qisqa muddatda saqlab turilgan bo'Isa va undan hisobot vaqtidan keyingi 12 oy mobaynida aktivlar foydalaniladigan obyektlar."
        ]
    },
    {
        "word": "Joriy Hisob Varaqasi ",
        "type": [],
        "definition": [
            "banklardagi pul mablag'larini saqlash va hisobkitoblarda amalga oshirishga xizmat qiluvchi hisob-varaq (schyot) turi. "
        ]
    },
    {
        "word": "Joriy Konyunktura ",
        "type": [],
        "definition": [
            "muayyan davrda tovarlarga bo'lgan talab va taklifning tarkibi, dinamikasini shakllantiruvchi iqtisodiy sharoit va omillar majmuyi. Joriy konyunktura ayni davrdagi milliy va jahon iqtisodiyotining u yoki bu omillaridan tarkib topgan vaqtinchalik vaziyatni ifodalaydi."
        ]
    },
    {
        "word": "Joriy Likvidlilik ",
        "type": [],
        "definition": [
            "Iikvid shakldagi balans aktivlari bankning talab qilib olinguncha saqlanadigan va muddati 30 kungacha bo'Igan hisob- varaqlar bo'yicha majburiyatlari summasi o'rtasidagi nisbatni tavsiflaydi."
        ]
    },
    {
        "word": "Joriy Narx ",
        "type": [],
        "definition": [
            "aniq tovarga shakllanib amal qilib kelayotgan narx. "
        ]
    },
    {
        "word": "Joriy Nazorat ",
        "type": [],
        "definition": [
            "ichki xo'jalik nazoratining uzviy qismi, butun korxona va uning ichki bo'linmalari ishlab chiqarish va moliyaviy faoliyatini tezkor boshqarish va tartibga solish jarayonining tarkibiy qismi. "
        ]
    },
    {
        "word": "Joriy Operatsiyalar Hisob-Raqami ",
        "type": [],
        "definition": [
            "mamlakat to'lov balansi bo'limi. Unda mamlakatning tovar va xizmatlar importi va eksporti hajmi, investitsiyalardan olingan sof daromadi va transfert to'lovlarining sof hajmi ko'rsatiladi. "
        ]
    },
    {
        "word": "Joriy Operatsiyalar Hisobi ",
        "type": [],
        "definition": [
            "tovarlar va xizmatlarni xarid qilish hamda sotish, transfert tarzidagi o'tkazishlar, investitsiya bilan bog' liq foizlar, dividendlar vaboshqa daromadlarni hamda nafaqalar, ish haqi, elementlarni o'tkazish singari boshqa operatsiyalardan keladigan daromadlaming mamlakatlararo harakatini aks ettiradi. "
        ]
    },
    {
        "word": "Joriy Qiymat ",
        "type": [],
        "definition": [
            "ma’lum sanadagi amal qilayotgan bozor narxlari bo'yicha asosiy vositalarning qiymati yoki xabardor qilingan, bitimni amalga oshirishni xohlovchi, mustaqil taraflar o'rtasida bitimni amalga oshirishda aktivni sotib olish yoki majburiyatlarni bajarish uchun yetarli bo'Igan summa. "
        ]
    },
    {
        "word": "Joriy Taʼmirlash ",
        "type": [],
        "definition": [
            "asosiy vositalar obyektini ishchi holatida saqlab turish maqsadida amalga oshiriladigan ta’mirlashdir. "
        ]
    },
    {
        "word": "Joriy Transfertlar",
        "type": [],
        "definition": [
            "kapital bo'lmagan barcha transfertlardan iborat. "
        ]
    },
    {
        "word": "Joriy Xalqaro Hamkorlik ",
        "type": [],
        "definition": [
            "turli mamlakatlardagi davlat birliklari va xalqaro tashkilotlar o'rtasidagi pul yoki natura shaklida ro'y beradigan joriy transfertlarni o'z ichiga olgan hamkorlik. "
        ]
    },
    {
        "word": "Joylashishni Tizimli Rejalashtirish Metodi ",
        "type": [],
        "definition": [
            "uskunalarni texnologik prinsip bo'yicha bo'limlar orasidagi material oqimining sonli o'lchash imkoni kam bo'Igan hollarda joylashtirish imkonini beradi."
        ]
    }
]