[
    {
        "word": "Kabinet Tadqiqotlari ",
        "type": [],
        "definition": [
            "rasmiy bosma axborot manbalari asosida umumxo'jalik konyunkturasi holati, ayrim bozorlar taraqqiyoti, ayrim mamlakatlar iqtisodiyotini o'rganish va ular to'g'risida tegishli tasawurlar berish. "
        ]
    },
    {
        "word": "Kadastr",
        "type": [],
        "definition": [
            "l) jon boshidan olinadigan soliq to'lovchilar ro'yxati; 2) vaqtivaqtida yoki uzluksiz kuzatish natijasida tegishli obyekt xususida struktura, tuzilma ma’Iumotlar to'plami; masalan, suv kadastri - daryolar, ularda o'tkazilgan tekshirishlar haqidagi ma’Iumotlar to'plami; 3) ko'chmas mulkni baholash, uning ro'yxatini yuritish bilan shug'ullanuvchi davlat tashkiloti. "
        ]
    },
    {
        "word": "Kadrlar Tayyorlash Milliy Dasturi ",
        "type": [],
        "definition": [
            "“Kadrlar tayyorlash milliy dasturi to‘g‘risida”gi O'zbekiston Respublikasi qonuni 1997- yil 29-avgustda qabul qilingan. Kadrlar tayyorlash milliy dasturi “Ta’lim to'g‘risida”gi O'zbekiston Respublikasi qonuni qoidalariga muvofiq holda tayyorlangan bo'lib, milliy tajribaning tahlili va ta’lim tizimining jahon miqyosidagi yutuqlari asosida tayyorlangan hamda yuksak umumiy va kasb-hunar madaniyatiga, ijodiy va ijtimoiy faollikka, ijtimoiy-siyosiy hayotda mustaqil ravishda mo'ljalni to‘g'ri ola bilish mahoratiga ega bo'lgan, istiqbol vazifalarini ilgari surish va hal etishga qodir kadrlarning yangi avlodini shakllantirishga yo'naltirilgan. "
        ]
    },
    {
        "word": "Kadrlar Zaxirasini Rejalashtirish",
        "type": [],
        "definition": [
            "xodimlarning lavozimlarga ko'tarilib borishini maqsad qilib qo yadi. U muayyan xodimlarning lavozimlarga ko'tarilishi, almashinishi, bo'shatilishining butun bir zanjirini ishlab chiqishni talab qiladi. "
        ]
    },
    {
        "word": "Kadrlarga Oid Yangiliklar ",
        "type": [],
        "definition": [
            "kadrlarga oid yangiliklarni joriy qilish sohasidagi aniq maqsadli faoliyatdir. "
        ]
    },
    {
        "word": "Kadrlarni Izlash Va Tanlash ",
        "type": [],
        "definition": [
            "yangi samarali kadrlar potensialini yaratishdir. "
        ]
    },
    {
        "word": "Kadrlarni Qayta Tayyorlash Va Malakasini Oshirish Bilan Bogʻliq, Yangiliklar ",
        "type": [],
        "definition": [
            "mazkur sohadagi yan- giliklar, ehtiyojlarni aniqlash usullarini takomillashtirish va shu kabilardir. "
        ]
    },
    {
        "word": "Kadrlarni Qisqartirish Va Foyda Bermaydigan Kadrlarni Tugatish ",
        "type": [],
        "definition": [
            "ortiqcha kadrlarni qisqartirish hamda eng kam ish beradigan hamda istiqboli yo'q kadrlar potensiali qismi va ish o'rinlarini korxona miqyosida tugatishdir."
        ]
    },
    {
        "word": "Kadrlarni Rejalashtirish ",
        "type": [],
        "definition": [
            "odamlarga zarur vaqtda kerakli miqdordagi ish o'rinlarini ularning qobiliyatlari, mayllari va ishlab chiqirish talablariga muvofiq ta’minlab berish. "
        ]
    },
    {
        "word": "Kaf",
        "type": [],
        "definition": [
            "tashqi savdo shartnomasi bo'yicha yuklami belgilangan portgacha (joygacha) yetkazib berish sharti. Bunda tashilayotgan tovarning qiymatiga dengiz transportida tashish bilan bog'liq xarajatlar kiritiladi. Ushbu shart bo'yicha tovarlami sug'urta qilish tovar yetkazib beruvchi (sotuvchi)ning majburiyatiga kirmaydi. "
        ]
    },
    {
        "word": "Kafolat ",
        "type": [],
        "definition": [
            "fransuz tilidan olingan bo'lib, ta’minot degan ma’noni bildiradi. Fuqarolik huquqida shartnomaga ko'ra qarzdor kreditor oldidagi majburiyatini to'la yoki qisman bajarmaganda, kafillik beradi; kafillik garov; garantiya. "
        ]
    },
    {
        "word": "Kafolat Beruvchi Bank ",
        "type": [],
        "definition": [
            "o'z mijoziga kafolatlik qiladigan bank. Talabnomalar va mijozlar hisobidan kafillik beradi. "
        ]
    },
    {
        "word": "Kafolat Fondi ",
        "type": [],
        "definition": [
            "davlat qarzi bo'yicha to'lovlami o'z vaqtida amalga oshirish hamda davlat tomonidan ichki va xorijdan mablag' jalb qilish bo'yicha O'zbekiston Respublikasi majburiyatlaridan kelib chiquvchi to'lovlami amalga oshirish uchun mablag'larnijamlashga shart-sharoit yaratish maqsadida respublika budjeti tarkibida tuziladigan fond."
        ]
    },
    {
        "word": "Kalendar Rejalashtirish ",
        "type": [],
        "definition": [
            " korxonada har bir ishni aniq bajarish vaqti ko'rsatilgan mahsulot ishlab chiqarish rejasi. "
        ]
    },
    {
        "word": "Kalkulatsiya",
        "type": [],
        "definition": [
            " (lot. calculatio - hisoblash) - korxona faoliyatini boshqarish jarayonida sarflangan xarajatlami aniqlash va ishlab chiqarilgan mahsulot, ish va xizmat birligining tannarxini aniqlash usulidir. Ushbu usulda mahsulot tannarxi aniqlanib, ma’lum bir faoliyat turidan olingan foyda va zararlar aniqlanadi. Kalkulatsiya ishlab chiqarilgan mahsulot va sotib olingan moddiy boyliklarning tannarxini aniqlash usuli bo'lib, buxgalteriya hisobi obyektlari haqida umumlashgan ma’lumotlar olish uchun zarur. "
        ]
    },
    {
        "word": "Kalkulatsiya Obyekti ",
        "type": [],
        "definition": [
            "bu korxonalarda tayyorlanadigan ayrim mahsulotlar, yarim tayyor mahsulotlar, biron-bir buyurtma turi yoki bajariladigan xizmat turlaridan iborat. Korxona uchun kalkulatsiya obyektining ro'yxati awaldan ishlab chiqiladi va mutasaddixodimlar tomonidan tasdiqlanadi. "
        ]
    },
    {
        "word": "Kalkulatsiyalashning Boʻlimli Usuli ",
        "type": [],
        "definition": [
            "xarajatlami hisobga olish va kalkulatsiya qilishning bo'limli (poperedel) usuli, asosan, metallurgiya, to'qimachilik, yengil, kimyo va boshqa sanoat korxonalarida qo'llaniladi. Bu korxonalarda ishlab chiqarish ayrim ishlab chiqarish bo'limlari, bosqichlaridan tashkil topgan bo'ladi. Bo'limli usulning muhim xususiyatlaridan biri shundaki, unda har bir sexdagi ishlab chiqarish xarajatlari ishlab chiqarishning har bir bo'limli bosqichi bo'yicha alohida hisobga olinib, bu xarajatlar hisobi mahsulotning ayrim turlari yoki guruhlari kalkulatsiya moddalari bo'yicha yuritiladi. "
        ]
    },
    {
        "word": "Kalkulatsiyalashning Buyurtmali Usuli ",
        "type": [],
        "definition": [
            "bu usulning mohiyati shundan iboratki, bunda hamma asosiy xarajatlar kalkulatsiya moddalari va har bir ishlab chiqarish buyurtmasi bo'yicha alohida hisob qilinadi. Ishlab chiqarish buyurtmalari chetdan mahsulotning ma’lum turlarini ishlab chiqarish uchun beriladi. "
        ]
    },
    {
        "word": "Kalkulatsiyalashning Normativ Usuli ",
        "type": [],
        "definition": [
            " bu usul, asosan, ishlab chiqarishning ommaviy va yirik tarmog'i bo'lmish mashinasozlik hamda metallni qayta ishlash korxonalarida qo'llaniladi. Bu usulning asosiy tamoyillari quyidagilardan iborat: 1. Mahsulotning me’yordagi tannarxi aniqlanadi. Buning uchun normativ kalkulatsiyasi tuziladi. Mahsulotning normativ tannarxi material, yoqilg'i, ish haqi va boshqa asosiy xarajatlarning tasdiqlangan chorakli smetalari asosida aniqlanadi. 2. Hisobot oyi davomida asosiy ishlab chiqarish xarajatlari (xomashyo va yordamchi materiallar, ish haqi)ning haqiqiy summasi emas, balki haqiqiy summasi bilan me’yorlashtirilgan summasi o'rtasidagi farq, ya’ni me’yordan chetga chiqish hisob qilinadi. "
        ]
    },
    {
        "word": "Kalkulyatsion Schyotlar ",
        "type": [],
        "definition": [
            "ishlab chiqarilgan mahsulot va bajarilgan ishlar tannarxini hisoblashda zarur bo'ladigan ma’lumotlarni olish uchun xizmat qiladigan buxgalteriya hisobi schyotlari. "
        ]
    },
    {
        "word": "Kalkulyatsiya Obyekti ",
        "type": [],
        "definition": [
            "tannarxi aniqlanadigan sotib olingan moddiy qiymatliklar, tayyorlangan buyum yoki bajarilgan ishlarning turi yoki bir xil guruhi. "
        ]
    },
    {
        "word": "Kamayib Boruvchi Naflilik Qonuni ",
        "type": [],
        "definition": [
            "o'zgaruvchan xarajatlarga qo'shiladigan turli chiqimlar (bino va inshootlarga qilinadigan sarflar) to'g'ri kelgan paytda ularning birligi hisobiga mahsulot ishlab chiqarish ko'payib boradi. Natijada ushbu jarayon kamayib boruvchi daromadlilik qonuni amal qila boshlaydigan paytga kiradi. Endi chiqim birligiga mahsulot ishlab chiqarish kamaya boshlaydi. "
        ]
    },
    {
        "word": "Kameralistika",
        "type": [],
        "definition": [
            "merkantilizmning Germaniyadagi shakli. Bu g'oya tarafdorlari yirik feodallar xo'jaliklarini boshqarish masalasini yuqori qo'yadilar va buni idora doirasida hal qiladilar."
        ]
    },
    {
        "word": "Kamomad",
        "type": [],
        "definition": [
            "mol; pul va shu kabilaming tegishli miqdoridan kam chiqqan qismi. "
        ]
    },
    {
        "word": "Kapital",
        "type": [],
        "definition": [
            " (nem. kapital - asosiy mulk; lot.capitalis - eng muhim, asosiy, bosh) - biror maqsadga yo'naltirishga mo'ljallangan pul mablag'i, boshlang'ich, doimiy, o'zgaruvchan, asosiy va aylanma kapital kabi turlari mavjud. Bozor iqtisodiyoti sharoitida tashkilot, korxona, firma va boshqalarda ustav kapitali, zaxira kapitali va aksionerlik jamiyati kapitali kabi turlari mavjud. Aksionerlik jamiyati kapitali o'z aksiya obligatsiyalarini sotishdan tushgan pullardan tashkil topadi. Kapital doimiy va o'zgaruvchan, asosiy va aylanma kapitalga bo'linadi; sanoat kapitali, savdo kapitali, ssuda kapitali shakllarida faoliyat yuritadi. Bozor iqtisodiyoti sharoitlarida korxona, firma, turli jamoalarga tegishli aksionerlik kapitali, zaxira kapitali, ustav kapitali singari ko'rinishlari mavjud. "
        ]
    },
    {
        "word": "Kapital Bozori ",
        "type": [],
        "definition": [
            "bozorda jismoniy va yuridik shaxslarning uzoq muddatli omonadarini moliyaviy vositachilar investitsion kredit sifatida ishlatadilar."
        ]
    },
    {
        "word": "Kapital Investitsiyalar ",
        "type": [],
        "definition": [
            "asosiy fondlarni vujudga keltirish va takror ishlab chiqarish, shuningdek, moddiy ishlab chiqarishning boshqa shakllarini rivojlantir ishga qo'shiladigan investitsiyalar. "
        ]
    },
    {
        "word": "Kapital Joriy Soligʻ1 ",
        "type": [],
        "definition": [
            " institutsion birliklarning mulki yoki boyligining sof qiymatiga vaqt-vaqti bilan, odatda, bir yilda bir marta to'lanadigan soliqdir. Korxonalarga qarashli yoki ular ishlab chiqarishda foydalanish uchun ijaraga olgan yerlar yoki boshqa turdagi aktivlarga solinadigan soliqlar bundan mustasnodir. Bunday soliqlar boshqa turdagi ishlab chiqarish solig'i jumlasiga kiradi. "
        ]
    },
    {
        "word": "Kapital Qoʻyilma ",
        "type": [],
        "definition": [
            "natijada asosiy vositalarni ko'paytiradigan xarajatlar. Korxonalarda kapital qo'yilmalar tasdiqlangan titul ro'yxati va loyiha-smetahujjatlaribo'lsaginaamalgaoshirilishimumkin. Kapital qo'yilmalar ularning yo'nalishi, rejalashtirish tartibi, kapital ishlar turlari, qurilish obyektlarining qiymati, qurilish ishlarini olib borish usullari bo'yicha guruhlanadi. Yo'nalishi bo'yicha ishlab chiqarish obyektlari turar joy, maktab, shifoxona va h.k.larga bo'linadi. Rejalashtirish tartibiga qarab kapital qo'yilmalar davlat rejasida nazarda tutilgan va davlat rejasida nazarda tutilmagan qo'yilmalarga bo'linadi. Davlat rejasida nazarda tutilmagan kapital qo'yilmalar korxonaning o'z mablag'lari hisobidan amalga oshiriladi. Kapital qo'yilmalar “Kapital qo'yilmalarni hisobga oluvchi schyotlar” bo'yicha hisobga olinadi. "
        ]
    },
    {
        "word": "Kapital Qoʻyilma О Вyektl Aridan Foydalanuvchilar ",
        "type": [],
        "definition": [
            "bular yuridik va jismoniy shaxslar hamda davlat organlari, mahalliy hokimiyat, xorijiy davlatlar, xalqaro tashkilotlar bo'lib, ushbu obyektlar ular uchun yaratiladi. "
        ]
    },
    {
        "word": "Kapital Qurilish ",
        "type": [],
        "definition": [
            "asosiy fondlami yangi korxona qurish, mavjud korxonalarni qayta tiklash, kengaytirish, texnik jihatdan qayta qurollantirish va zamonaviylashtirish yo'li bilan yaratish hamda mukammallashtirish jarayoni. "
        ]
    },
    {
        "word": "Kapital Sigʻimi ",
        "type": [],
        "definition": [
            "asosiy kapitalning mos keluvchi davri mobaynida ishlab chiqarilgan mahsulot yoki uning biron-bir qismini - milliy daromad, sof daromad, foydaga nisbatini tavsiflovchi ko'rsatkich. "
        ]
    },
    {
        "word": "Kapital Taʼmirlash ",
        "type": [],
        "definition": [
            "asosiy vositalarni yirik ko'lamda butkul detallari, qismlarini almashtirish bilan bog'liq qayta ta mirlash tushuniladi. "
        ]
    },
    {
        "word": "Kapital Transfertlar ",
        "type": [],
        "definition": [
            "bepul berilgan (olingan) ishlab chiqarish vositasi sifatida ishlatiladigan moddiy va nomoddiy aktivlardan iborat. "
        ]
    },
    {
        "word": "Kapital Va Kreditlar Harakati Balansi ",
        "type": [],
        "definition": [
            "mamlakatlarning to'lov hamda hisob-kitob balanslari bo'lib, unda mazkur mamlakatning chet ellardan olgan va uning boshqa davlatlarga bergan kreditlari, kapitallar eksporti va importining nisbati ko'rsatiladi. "
        ]
    },
    {
        "word": "Kapital Xarajatlar ",
        "type": [],
        "definition": [
            "asosiy kapitalga kiritiladigan mablag'lar va zaxiralarning o'sishi. "
        ]
    },
    {
        "word": "Kapital Xarajatlar Deganda",
        "type": [],
        "definition": [
            "bir hisobot davridan ko'proq vaqtda ishlab chiqarishda foydalanish mumkin bo'lgan moddiy va nomoddiy aktivlarni kapital tiklash, ularni yaratish uchun qilingan sarflarga aytiladi. "
        ]
    },
    {
        "word": "Kapital Uchun Joriy Soliqlar ",
        "type": [],
        "definition": [
            "institutsion birliklar tomonidan o'zlari egalik qilayotgan va ijaraga olgan mulklari (yer va inshootlar), sof boyliklari va boshqa qimmatbaho buyumlari uchun muntazam ravishda (odatda, yilda bir marta) to'laydigan soliqlar. "
        ]
    },
    {
        "word": "Kapitalizm",
        "type": [],
        "definition": [
            " ishlab chiqarish omillarining xususiy mulkligi, raqobat va foyda olish maqsadiga asoslangan iqtisodiy tizim"
        ]
    },
    {
        "word": "Kapitallar Va Kreditlarning Harakati Balansi ",
        "type": [],
        "definition": [
            "tadbirkorlik bilan ssuda kapitalining harakati aks ettiriladi."
        ]
    },
    {
        "word": "Kapitallashtirish Darajasi ",
        "type": [],
        "definition": [
            "aktivlardan foydalanish natijasida kutilayotgan hajmining aktivlar qiymatiga bog'liqlik darajasini o'rnatadigan koeffitsiyent. "
        ]
    },
    {
        "word": "Kapitalning Harakati Hisob-Varagʻi ",
        "type": [],
        "definition": [
            "mamlakat to'lov balansining bo'limi. Unda kapitalning mamlakatga kirishi va chiqib ketishi miqdori ko'rsatiladi. "
        ]
    },
    {
        "word": "Kapitalning Tarkibiy Qismi Bilan Bogʻliq, Risklar ",
        "type": [],
        "definition": [
            "risklar passivlarning tarkibiy qismi va ishbilarmonlik riski bilan bog'liq. "
        ]
    },
    {
        "word": "Kargo",
        "type": [],
        "definition": [
            "transport vositasida tashiladigan va sug'urtalanishi mumkin bo'lgan yukning nomlanishi. "
        ]
    },
    {
        "word": "Karlmarks",
        "type": [],
        "definition": [
            " (1818- 1883),FRIDRIXENGELS (1820-1895) -ilmiy sotsializm nazariyasi asoschilari. Kapitalizmning o'rniga sotsializm kelishini bashorat etishgan. Xususiy mulkni inkor qilishgan. Umumxalq mulkini asosiy deb qarashgan (tarix bulami inkor etmoqda)."
        ]
    },
    {
        "word": "Kartel",
        "type": [],
        "definition": [
            "(fran. cartel; ital. cartello carta - qog'oz, hujjat) - monopolistik birlashmaning bir ko'rinishi. Yirik korxona egalarining bozorda tanho hukmdorlik qilish, ko'p foyda olish maqsadida tuzgan uyushmasi. Uyushmaga kiruvchilar mahsulot hajmi, narxi, ishchilar yollash sharti, patentlar ayirboshlash, bozorlarni bo'lish, umumiy mahsulot ishlab chiqarishdagi har bir qatnashchining kvotasi va shu kabilar bo'yicha kelishib olishlari. Karter ishlab chiqarish quwatlarining ish bilan ta'minlanishini talabga moslashtirish, narxlami barqarorlashtirish, bozordagi ta’sir ko'rsatish sohalarini taqsimlash, mahsulotni o'tkazish sanoatning xorijiy raqobat va chet el firmalarining mahsulot narxlarini ataylab pasaytirishidan himoyalanmagan yangi sohalariga sarmoya sarflanishini bir maromda saqlab turish uchun narxlar va ishlab chiqarishda ishtirok etish ulushlarini belgilash maqsadida mustaqil firmalar o'rtasida tuzilgan bitimga asoslangan tadbirkorlik birlashma turi. Kartel narxlar ustidan nazorat o'rnatish maqsadida ishlab chiqarish hajmini cheklash xususida o'zaro imzolangan firmalar yoki korxonalarning monopol birlashmasi shakli. Uning boshqa uyushmalardan farqi shuki, unga kiruvchilar xo'jalik yuritish mustaqilligini saqlab qoladi. Kartel bitimlari ko'proq yirik trest va konsernlar o'rtasida tuziladi. "
        ]
    },
    {
        "word": "Kasaba Uyushmalari ",
        "type": [],
        "definition": [
            "o'z a’zolarining manfaatlarini himoya qilish uchun tuzilgan ishchilar uyushmasi. "
        ]
    },
    {
        "word": "Kasaba Uyushmasi ",
        "type": [],
        "definition": [
            "bu ishchilar uyushmasi bo'lib, u o'zining a’zolari nomidan va ko'rsatmasiga ko'ra tadbirkorlar bilan muzokara olib borish huquqiga ega tashkilot. "
        ]
    },
    {
        "word": "Kasanachi (Nadomnik) ",
        "type": [],
        "definition": [
            " muayyan korxona yoki shu korxonaga qarashli ishxonalarda o'z ish joyiga ega bo'lmagan, taxminiy kelishuv yoki shartnoma asosida ishlab, muayyan korxonaga muayyan miqdorda tovar yetkazib berish yoki xizmat ko'rsatishga rozi bo'lgan shaxs. "
        ]
    },
    {
        "word": "Kasanachilik",
        "type": [],
        "definition": [
            "yirik sanoat korxonalari bilan tuzilgan shartnoma asosida uy sharoitida mahsulot ishlab chiqarish yoki xizmat ko'rsatish."
        ]
    },
    {
        "word": "Kasb Soligʻi (Kasbiy Soliq) ",
        "type": [],
        "definition": [
            "mahalliy hokimiyat organlari tomonidan tadbirkorlik faoliyatining barcha turlaridan har yili olinadigan to'g'ri (bevosita) soliqlardan biri. Kasb solig'i (kasbiy soliq)ning summasi asos raqamlari va mahalliy hokimiyat organlari tomonidan belgilanadigan koeffitsiyent asosida hisoblanadi. Bunda uning summasi korxonada yangidan yaratilgan mahsulotning ma’lum bir foizidan (masalan, 5%) oshmasligi lozim."
        ]
    },
    {
        "word": "Kasbiy Javobgarlik ",
        "type": [],
        "definition": [
            "chet el tajribasida vrachlar, advokatlar, auditorlar, notariuslar, buxgalter, arxitektor va boshqa kasb egalarining uchinchi shaxsga zarar keltirish kasbiy javobgarligini sug'urtalash shartnomasini tasdiqlaydigan sug'urta polisining atalishi. Ushbu kasb egalari xususiy amaliyot bilan shug'ullanganlarida, ularda sug'urta polisining bo'lishi majburiydir. "
        ]
    },
    {
        "word": "Kasb-Taʼlim Sohasidagi Yangiliklar ",
        "type": [],
        "definition": [
            "oliy o'quv yurtlarida, kollejlarda va boshqa o'quv yurtlarida kadrlarni kasbiy jihatdan tayyorlash sohasidagi yangiliklar. "
        ]
    },
    {
        "word": "Kasko ",
        "type": [],
        "definition": [
            " transport vositasi borti. Kasko sug'urtasi transport vositasiningyaroqsiz holga kelishi yoki shikastlanishini o'z ichiga oladi. "
        ]
    },
    {
        "word": "Kassa",
        "type": [],
        "definition": [
            "1) pul, qimmatbaho qog'ozlar saqlanadigan po'lat sandiq, quti, shkaf; 2) muassasa, korxonalarning pul qabul qilish, pul berish, bilet sotish va shu kabilar bilan ish yurituvchi, muomala qiluvchi bo'linmasi; 3) muassasa, korxona va shu kabilardagi bor pul. "
        ]
    },
    {
        "word": "Kassa Kitobi ",
        "type": [],
        "definition": [
            "korxona kassiri kassa jarayonlari hisobini yurgizishiga mo'ljallangan hisob registrlari. "
        ]
    },
    {
        "word": "Kassa Limiti ",
        "type": [],
        "definition": [
            "korxona kassasida doim bo'lishi mumkin bo'Igan pul mablag' larining summasi. Bu summa kunlik mayda xarajatlar uchun ishlatiladi. "
        ]
    },
    {
        "word": "Kassa Naqdi ",
        "type": [],
        "definition": [
            "banklar o'z seyflari va kassalarida saqlaydigan pullar. "
        ]
    },
    {
        "word": "Kassaning Orderlari ",
        "type": [],
        "definition": [
            "korxona kassasiga pul kirimi va chiqimining qonuniyligi hamda belgilangan maqsad bo'yicha amalga oshirilganligini asoslovchi hujjatlar. "
        ]
    },
    {
        "word": "Kassaning Umumlashtirilgan Smetasi ",
        "type": [],
        "definition": [
            "budjetlashtirish tizimidagi ishlab chiqarish muomalalariga to'g'ri keladigan ma’lum vaqtda kassadagi naqd pullarni hisoblash. "
        ]
    },
    {
        "word": "Katon Starshiy ",
        "type": [],
        "definition": [
            "(m.a. 234-149) - Qadimgi Rimdagi qulchilikni himoya qilgan. Dehqonchilik to'g'risidagi asarida qishloq xo'jaligiga ko'proq e’tibor berishni taklif etadi, ko'proq sotish va kam olishni ma’qullaydi. Qullar mehnatidan ratsional foydalanishni taklif etadi (Villa xo'jaligi). Yaxshi ishlagan qulning sharoitini yaxshilash va gunohkor qattiq jazolanishi kerakligini ta’kidlaydi. "
        ]
    },
    {
        "word": "Katta Yigirmalik ",
        "type": [],
        "definition": [
            " 20 ta yirik mamlakatlar guruhi bo'lib, unga jahondagi eng boy mamlakatlar va yirik rivojlanayotgan davlatlar kiradi. Ular hissasiga jahon yalpi ichki mahsulotining 90 foiz ulushi to'g'ri keladi. "
        ]
    },
    {
        "word": "Kechiktirilgan Talab ",
        "type": [],
        "definition": [
            "biror sababga ko'ra hozir qondirish iloji yoki zarur bo'lmay, ma’lum vaqtdan so'ng qondiriladigan talab; u qondirilmagan talabning bir ko'rinishi hisoblanadi. "
        ]
    },
    {
        "word": "Kelgusi Davr Daromadlari ",
        "type": [],
        "definition": [
            " hisobot davrida olingan, ammo kelgusi davrga tegishli bo'lgan mablag'lar. "
        ]
    },
    {
        "word": "Kelishib Hal Qilinadigan Ixtiloflar ",
        "type": [],
        "definition": [
            "ixtilof qatnashchilari maqsadlarining, o'zaro harakat qilish muddatlari va shartlarining o'zaro o'zgarishi hisobiga ularni hal etishning bir necha variantiga yo'l qo'yadi. "
        ]
    },
    {
        "word": "Kelishuv",
        "type": [],
        "definition": [
            " nizoli holatda muvaffaqiyatli chiqishning eng muhim sharti."
        ]
    },
    {
        "word": "Keltirilgan (Diskontlangan) Sof Qiymat ",
        "type": [],
        "definition": [
            "boshlang'ich investitsiya xarajatlari summasiga kamaytirilgan, diskontlangan qiymat. "
        ]
    },
    {
        "word": "Keltirilgan Narxlar",
        "type": [],
        "definition": [
            " inflyatsiya sur’atiga moslab to'g'rilangan narxlar. "
        ]
    },
    {
        "word": "Kembrij Maktabi ",
        "type": [],
        "definition": [
            "(Angliya) - asosiy vakili Alfred Marshall (1842-1924). U “qiymatsiz baho” nazariyasi asoschisi. Bahoga “eng yuqori naf” va ishlab chiqarish chiqimlari ta’sir qiladi, degan fikrni ilgari surgan. Marksning “qiymatning mehnat nazariyasi’ga qarshi. “Siyosiy iqtisod’ni “Ekonomiks”bilan almashtirdi. Asosiy asari “Iqtisodiyot prinsiplari” (1890), 3 jilddan iborat, rus tiliga o'girilgan. "
        ]
    },
    {
        "word": "Kene Fransua ",
        "type": [],
        "definition": [
            " (1694-1774) - fransuz iqtisodchi-fiziokrati, klassik iqtisodiyot nazariyasi maktabi namoyandasi. “Iqtisodiy jadval” (1758) asarida u birinchi marta oddiy takror ishlab chiqarish shartlarini tahlil etib, qanday qilib ishlab chiqarilgan tayyor mahsulotning muomalada taqsimlanishi, natijada ishlab chiqarishning takrorlanishiga sharoit yaratilishini ko'rsatib berishga harakat qilgan. Shuningdek, kapital masalalariga alohida e’tibor berib, uni doimiy va o'zgaruvchan shakllargabo'lgan.Ammoumumiyfoydavaboylikqishloqxo'jaligida yaratiladi, shu bois undagi mehnat unumli mehnat hisoblanadi, sanoatda qishloq xo'jaligi mahsulotlari qayta ishlanganligi sabab undagi mehnatni unumsiz mehnat, deb hisoblagan (Qarang:"
        ]
    },
    {
        "word": "Kengash",
        "type": [],
        "definition": [
            "muayyan masalani muhokama etish va oqilona qaror qabul qilish maqsadida uyushtiriladigan majlis."
        ]
    },
    {
        "word": "Keptiv Sugʻurta Kompaniyasi ",
        "type": [],
        "definition": [
            "ta’sischilarning manfaatlarini sug'urta himoyasiga oladigan yoki yirik konsern, korporatsiyalar, yirik sanoat-moliya guruhlari tarkibiga kiruvchi sug'urta kompaniyasi. Raqobatdagi boshqa sug'urta kompaniyalarining keptiv sug'urta kompaniyasi mavjud bo'Igan tarmoqqa kirishi murakkabroq hisoblanadi. O'zbekistonda faoliyat ko'rsatayotgan keptiv sug'urta kompaniyalariga “ALSKOM”, ''Universal sug'urta” kompaniyalarini misol keltirish mumkin. "
        ]
    },
    {
        "word": "Keri Genri Charlz ",
        "type": [],
        "definition": [
            "(1793-1879) - amerikalik iqtisodchi, “Manfaatlar uyg'unligi” (1872) asari muallifi. Shu g'oyaning tarafdori bo'Igan, millatlar uyg'unligi g'oyasini ilgari surgan, Rikardo va Maltusga qarshi chiqqan. Erkin savdoni rad etdi, proteksionizm va qulchilikni qo'lladi. "
        ]
    },
    {
        "word": "Keyns Jon Meynard ",
        "type": [],
        "definition": [
            "(1882-1946) - ingliz iqtisodchisi, iqtisodiyotning davlat tomonidan tartiblanishi nazariyasi asoschisi. Uning asosiy g'oyalari “Bandlik, foiz va pullarning umumiy nazariyasi asarida o'z aksini topgan. Uning fikricha, bozor bir qator kamchiliklarga ega va davlat ulami bartaraf etishi zarur. U davlat o'zining iqtisodiy siyosati yordamida jami talab va jami taklifni o'zaro muvofiqlashtirishi, iqtisodiyotni tanazzul holatidan chiqarishi va keyinchalik barqarorlikni ta’minlashi zarur deb hisoblagan. Birinchi marta jami talab va jami taklif, milliy daromad, jamg'arish, investitsiyalash kabi kattaliklarning o'zaro harakatini tahlil qilgan. Nazariy jihatdan iqtisodiyot nazariyasining yangi makroiqtisodiyot bo'limi vujudga kelishiga sabab bo'Igan. Amaliy jihatdan esa Ikkinchi jahon urushidan so'ng uning g'oyalari AQSh va G'arbiy Yevropa mamlakatlaridagi hukumatlar olib borgan siyosatning asosini tashkil etgan. Milliy daromad, kapital mablag', ish bilan bandlik, iste’mol, jamg'arish va boshqa iqtisodiy miqdorlarning tahliliga alohida e’tibor berdi. “Boshqariladigan kapitalizrn’ning tarafdori bo'ldi, turli yo'nalishlari mavjud. A. Marshallning do'sti, marksizmning ashaddiy dushmani, “Aralash iqtisodiyot’ning otasi va “Iqtisodiy jurnaTning muharriri hisoblanadi. "
        ]
    },
    {
        "word": "Keynscha Iqtisodiy Nazartya ",
        "type": [],
        "definition": [
            "makroiqtisodiy konsepsiya, unga binoan bozor iqtisodiyoti mustaqil (davlat aralashuvisiz) mavjud resurslaridan samarali foydalana ololmaydi, binobarin davlat iqtisodiyotni tartibga solishga aralashishi zarur. Shuning uchun u mamlakatni to'la ish bilan bandlikka erishish va iqtisodiyotning rivojlanishiga ta’sir etish uchun faol fiskal va monetar (pul-kredit) siyosatni olib borishi zarur."
        ]
    },
    {
        "word": "Keynschilik",
        "type": [],
        "definition": [
            "J.M. Keynsning fikrlarini ilgari suruvchi yo'nalish bo'lib, uch oqimi mavjud: 1. Ong oqim - o'ta reaksion oqim, qurollanish tarafdori, tartibga solish takliflari bor. Germaniya va Italiyada keng tarqalgan. 2. Liberal oqim - monopoliya manfaatlarini himoya qiluvchi va qurollanishni inkor etuvchi oqim. Uning asosiy vakili Jenni Robinson xonim. Bu oqimda kasaba uyushmalariga keng о Yin berilgan. Fransiyada “dirij izm” (dirijor sozidan olingan) nazariyasi vujudga kelgan. 3. Yangi keynschilik, keyinroq ortodoksal keynschilik - J.M. Keyns qoidalari to'la qabul qilingan holda A. Xansen tomonidan stagnatsiya nazariyasi bilan to'ldiriladi. A. Xansen va K. Klark multiplikator prinsipini akselerator prinsipi bilan to'ldirdilar, industriallangan investitsiya tushunchasini kiritdilar. Imperativ (zaruriy) va Indikativ (taklif majburiy emas) rejalashtirishlardan foydalanish mumkinligi aytiladi (Fransiya va bir qancha mamlakatlardakengtarqalgan). Asosiy vakillari fransiyalik G. Ardan, G. Mendes-Frans, F. Perru, S. Harrislardir. Yangi keynschilik o'rniga postkeynschilik vujudga keldi. Uning vakillari J. Robinson, N. Kaldor, P. Sraffa (Angliya), L. Eyxner, Vayntraub (AQSh). Bu oqimda o'sish va taqsimot markaziy deb hisoblanadi. Iqtisodni tartibga solish mexanizmini yanada takomillashtirish taklif etiladi. "
        ]
    },
    {
        "word": "K1Chik Biznes ",
        "type": [],
        "definition": [
            "bozor iqtisodiyoti rivojlangan mamlakatlarda o'ziga mustaqil mayda korxonalarning daromad olish maqsadida amalga oshiradigan faoliyati. "
        ]
    },
    {
        "word": "Kichik Biznes Subyektlari ",
        "type": [],
        "definition": [
            "korxona ko'lami, ishlab chiqarish hajmi, ishlovchilar soni, moliyaviy mablag'lari miqdori va boshqalar jihatidan imkoniyatlari cheklangan ishlab chiqaruvchi subyektlar. Respublikamizda sanoat ishlab chiqarishning ayrim tarmoqlarida (masalan, yengil va oziq-ovqat sanoati, metallga ishlov berish va asbobsozlik sanoati va h.k.) 100 kishigacha, ayrimlarida (masalan, mashinasozlik, metallurgiya, yoqilg'i-energetika sanoati va boshqalarda) 50 kishigacha, xizmatko'rsatish sohasida 25 kishigacha ishlovchi korxonalar kichik biznes subyektlari hisoblanadi. "
        ]
    },
    {
        "word": "Kiritiladigan Xarajatlar ",
        "type": [],
        "definition": [
            "kelgusida daromad olib keladigan sotib olingan va mavjud bo'lgan resurslar. "
        ]
    },
    {
        "word": "Kleytonning Trestlarga Qarshi Qonuni ",
        "type": [],
        "definition": [
            "AQSH Kongressi tomonidan 1914-yilda qabul qilingan qonun. Unda qaysi qonun hujjatlarini “Savdo erkinligini cheklash” deb hisoblash lozimligi ko'rsatib berilgan. "
        ]
    },
    {
        "word": "Kliring",
        "type": [],
        "definition": [
            "(ingl. clearing, clear - tozalash, ravshanlashtirish) - o'zaro talab va majburiyatlarni hisobga olib amalga oshiriladigan naqd pulsiz hisob-kitob tizimi. Mamlakat ichidagi kliring banklar o'rtasidagi to'lovlar, naqd pulsiz hisob-kitoblami o'z ichiga oladi. Xalqaro hisob-kitoblarda kliring kelishuvlar (kliring kelishuvlari, valyuta kliring) ko'rinishida amalga oshiriladi. Davlatlararo o'zaro qarzlarini tilla va valyutaga o'tkazmasdan savdo-sotiq talablariga ko'ra amalga oshiradi. Masalan, paxta tolasi o'rniga uning qiymatiga teng miqdorda mashina, asbob-uskuna olish. "
        ]
    },
    {
        "word": "Kliring Banki",
        "type": [],
        "definition": [
            "1. Bank, hisob-kitob palatasi a’zosi. Bank o'zida ochilgan schyotlar bo'yicha xizmatlar ko'rsatadi (moddiy qiymatlar holati, qimmatli qo'g'ozlar olish va ularni yetkazib berish, to'lov va hisob- kitoblarni amalga oshirish qaydnomalarini yuritish). 2. O'zaro zachyot talabnomasi asosida chek va boshqa to'lovhujjatlarini naqd pulsiz amalga oshiruvchi maxsus banklararo tashkilot. 3. O'zaro hisob-kitoblarni amalga oshiruvchi banklararo organ; tovar va fond birjasi a’zolari o'rtasida o'zaro hisoblar o'tkazish mexanizmi. "
        ]
    },
    {
        "word": "Kliring Nuqta (Muvozanat Nuqtasi)",
        "type": [],
        "definition": [
            "bozorda talab va taklifning teng bo'lishi yoki talab bilan taklif chiziqlarining kesishish nuqtasi. "
        ]
    },
    {
        "word": "Knis Karl ",
        "type": [],
        "definition": [
            " (1821 -1892) - nemis iqtisodchisi, uningcha, iqtisodiy qonunlar yo'q va tabiiy qonunlar bor. Karl xususiy mulk va kapitalizmni abadiy deb hisoblagan. Iqtisodiy siyosatga katta o'rin bergan. "
        ]
    },
    {
        "word": "Koʻchmas Mulk ",
        "type": [],
        "definition": [
            "yer bilan mustahkam bog'liq bo'lgan yer maydonlari, alohidalashtirilgan suv obyektlari, o'rmonlar, ko'p yillik o'simliklar, binolar, inshootlardan iborat. Ularning ko'chirilishi shu narsalarning mo'ljallanganligiga zarar yetkazadi. Ko'chmas mulkning tarkibiga davlat qaydidan o'tgan havo va dengiz kemalari, kosmik obyektlar ham kiradi. Ko'chmas mulkning asosiy belgisi sifatida yer hisobga olinadi. Qonun bo'yicha ko'chmas mulkning tarkibiga boshqa mulklar, masalan, korxona yoki xonadonlar ham kiritilishi mumkin. "
        ]
    },
    {
        "word": "Koʻchmas Mulk ",
        "type": [],
        "definition": [
            "yer, tabiiy hududlar va yer bilan bog'langan mulk. Yerga egalik huquqlari ham ko'chmas mulkka kiradi. "
        ]
    },
    {
        "word": "Koʻp Kanalli Marketing Tizimi ",
        "type": [],
        "definition": [
            "bir korxona tovarlari yoki bir xil tovarlarni iste’molchilarga bir necha kanal orqali yetkazib berish tizimi. "
        ]
    },
    {
        "word": "Koʻp Pogʻonali (Boʻgʻinli) Kanal ",
        "type": [],
        "definition": [
            "tovarning ishlab chiqaruvchidan iste’molchigacha harakatida bir necha vositachilar ishtirok etadigan yo'li. "
        ]
    },
    {
        "word": "Koʻp Ukladli Iqtisod ",
        "type": [],
        "definition": [
            "turli mulk shakllari va har xil xo'jalik turlarining yaxlitligidan tashkil topgan iqtisodiyot."
        ]
    },
    {
        "word": "Koʻrgazma Ishlab Chiqarish",
        "type": [],
        "definition": [
            "ma’lum bir standart mahsulotlarni nisbatan kichik partiyalar bilan ishlab chiqarish imkonini beradigan tizimga ega ishlab chiqarish oqimi. Bu mahsulotlar uskunalarning qayta tayyorlanishiga ketadigan vaqt xarajatlarini qisqartirish imkonini beruvchi periodik takrorlanadigan partiyalar bilan ishlab chiqariladi. "
        ]
    },
    {
        "word": "Koʻrsatmali Taʼsir",
        "type": [],
        "definition": [
            " ular o'rnatilgan tashkiliy aloqalardan joriy foydalanish va ish sharoitlari o'zgarganda ularni qisman to'g'rilashni aks ettiradi. Ko'rsatmali ta’sir asosida vakolat va majburiyatlar yotadi. Mazkur uslublarga qarorlar, buyruqlar, ko'rsatmalar, rezolyutsiyalar kiradi. "
        ]
    },
    {
        "word": "Kobba-Duglas Ishlab Chiqarish Funksiyasi",
        "type": [],
        "definition": [
            "iqtisodiyot rivojlanishini tahlil qilishda foydalaniladigan darajali ko'rinishidagi funksiya. "
        ]
    },
    {
        "word": "Kodlash",
        "type": [],
        "definition": [
            "belgili usulda o'ylab topilgan aloqa jarayoni."
        ]
    },
    {
        "word": "Kollegiya",
        "type": [],
        "definition": [
            " kollegiya, guruh, bir guruh saylangan kishilar."
        ]
    },
    {
        "word": "Kollektiv Shartnoma ",
        "type": [],
        "definition": [
            "korxona xodimlari va ish beruvchilari o'rtasida ijtimoiy-mehnat munosabatlarini tartibga solishni mo'ljallab tuziladigan huquqiy-normativ akt. "
        ]
    },
    {
        "word": "Kollizion Norma ",
        "type": [],
        "definition": [
            "xalqaro xarakterdagi fuqarolik, mehnat va boshqa huquq munosabatlarida davlat tomonidan qo'llanadigan huquq normasi. "
        ]
    },
    {
        "word": "Kombinat",
        "type": [],
        "definition": [
            "har xil ishlab chiqarish tarmoqlarining sanoat korxonalari birlashmasi. "
        ]
    },
    {
        "word": "Kombinatlashuv",
        "type": [],
        "definition": [
            "kooperatsiyalashuvga o'xshab korxonalar birlashmasidan iborat. Kombinatlashuv ma’lum bir turdagi xom- ashyoni texnologik qayta ishlash, uning chiqindilaridan to'la foydalangan holda turli mahsulotlar ishlab chiqarishni anglatadi. Kombinatlashuv sanoat tarmoqlarining ko'pchiligiga xosdir."
        ]
    },
    {
        "word": "Kombinatsiyalash",
        "type": [],
        "definition": [
            "bitta korxona, kombinat doirasida sanoatning bitta yoki bir nechta tarmoqlaridagi turli xil ishlab chiqarishlarni texnologik jihatdan birlashtirishda ifodalanuvchi, ishlab chiqarishni umumlashtirish shakllaridan biri. "
        ]
    },
    {
        "word": "Kombinatsiyali Sugʻurta",
        "type": [],
        "definition": [
            "bir necha sug'urta turlari bo'yicha sug'urta qoplamasi sharti. "
        ]
    },
    {
        "word": "Komission",
        "type": [],
        "definition": [
            " uchinchi shaxs vositasida sotib olinadigan va sotiladigan narsalar; komission savdo korxonalari yoki komissionerlar vositachilik ishi uchun ma’lum haq, mukofot oladilar. "
        ]
    },
    {
        "word": "Komission Chegirish ",
        "type": [],
        "definition": [
            "kichik korxona ulgurji savdoda tovarni targ'ib qiluvchiga beradigan baho chegirmasi (arzon bahoda sotish)."
        ]
    },
    {
        "word": "Komission Operatsiya ",
        "type": [],
        "definition": [
            " komissioner va komitent o'rtasida bajariladigan operatsiyalar. Komissioner vositachilik faoliyati uchun komission."
        ]
    },
    {
        "word": "Komission Ragʻbatlantirish ",
        "type": [],
        "definition": [
            "boshqa shaxsning topshirig'iga ko'ra bir shaxsni xizmati uchun rag'batlantirish. "
        ]
    },
    {
        "word": "Komissioner",
        "type": [],
        "definition": [
            "pulli xizmat ko'rsatish, ish bajarilishi bo'yicha shartnomada ko'rsatilgan bir tomon. "
        ]
    },
    {
        "word": "Komissiya",
        "type": [],
        "definition": [
            "komissiya, vositachiUk, saylanadigan guruh. "
        ]
    },
    {
        "word": "Komissiya Haqi ",
        "type": [],
        "definition": [
            "mijozlarni sug'urtaga tortganligi uchun sug'urta kompaniyasi tomonidan vositachilarga (sug'urta brokeri, agent) to'lanadigan haq. Komissiya haqining miqdori sug'urtaning turiga va kelib tushgan badalning hajmiga bog'liq holda sug'urta badaliga nisbatan foizlarda to'lanadi. "
        ]
    },
    {
        "word": "Komitent",
        "type": [],
        "definition": [
            "komissiya shartnomasidagi bir tomon. Boshqa tomon (komissioner)ga bir nechta bitimni bajarishni topshiradi. "
        ]
    },
    {
        "word": "Kommersant",
        "type": [],
        "definition": [
            "xususiy savdo bilan shug'ullanuvchi shaxs. "
        ]
    },
    {
        "word": "Kommivoyajer",
        "type": [],
        "definition": [
            "savdo firmasining sayyor agenti, namunalar, kataloglar va boshqalar yordamida tovarlar sotilishini ta’min etuvchi mutaxassis."
        ]
    },
    {
        "word": "Kommunikativ Malaka ",
        "type": [],
        "definition": [
            "boshqa kishilarni to'g'ri tushunish va ular bilan samarali faoliyat olib borish uchun zarur bo'lgan mahorat."
        ]
    },
    {
        "word": "Kommunikativ Siyosat ",
        "type": [],
        "definition": [
            "l) korxonaning istiqboldagi harakatlar kursi hamda talabni shakllantirish, iste’molchilar ehtiyojini qondirish va foyda olish maqsadida tovar va xizmatlarni bozorga olib kirish bo'yicha samarali va barqaror faoliyatni ta’minlovchi marketing tizimining barcha subyektlari bilan o'zaro harakatlarni tashkil etish va kommunikativ vositalar (kommunikativ miks) majmuasidan foydalanish strategiyasining mavjudligi; 2) rag'batlantirish majmuasini ishlab chiqish, yani biznes - hamkorliklarning o'zaro aloqalari samarali bo' lishini ta’minlash bo'yicha, tadbirlar, reklamani tashkil etish, savdoni rag'batlantirish usullari, jamoatchilik bilan aloqa va shu kabilar. "
        ]
    },
    {
        "word": "Kommunikator",
        "type": [],
        "definition": [
            " ma’lumotni jo'natuvchi, muomaladagi aktiv subyekt. "
        ]
    },
    {
        "word": "Kommunikatsiya",
        "type": [],
        "definition": [
            " aloqa munosabat akti. Ikki va undan ortiq individ o'rtasidagi aloqa."
        ]
    },
    {
        "word": "Kompanion",
        "type": [],
        "definition": [
            "biror mulkka birov bilan birgalikda ega bo'lgan kishi yoki tashkilot. "
        ]
    },
    {
        "word": "Kompaniya",
        "type": [],
        "definition": [
            "tadbirkorlarning huquqiy shaxs maqomiga ega bo'lgan, pay kapitali asosida tashkil qilinuvchi birlashmasi"
        ]
    },
    {
        "word": "Kompaniyaning Moliyaviy Hisoboti",
        "type": [],
        "definition": [
            "kompaniyaning har xil daromadlari, to' lov va ajratmalari hamda xarajadari aks etgan hujjat. "
        ]
    },
    {
        "word": "Kompensatsiya",
        "type": [],
        "definition": [
            "qoplash, rag'batlantirish yoki bir majburiyat to'lovini ikkinchisi bilan to'lash; biror narsa uchun to'lanadigan pul, haq, tovon, badal. "
        ]
    },
    {
        "word": "Kompensatsiya Bitimi ",
        "type": [],
        "definition": [
            "kompensatsiya bitimi, kelishuvi. U yoki bu shaklda kontragentlar manfaatini o'zaro ta’minlash yoki o'zaro tovar yetkazib berish. Bunda belgilangan qiymatdagi tovarlarni boshqa tovar yoki xizmatlarga ayirboshlash amalga oshiriladi. "
        ]
    },
    {
        "word": "Kompromiss",
        "type": [],
        "definition": [
            "nizoli vaziyat qatnashuvchilarining bir-birlariga yon bosish asosida kelishuvga erishishi; muzokaralar olib borish asosida nizoli vaziyatda masalaning o'zaro kelishuv uchun asos bo'ladigan jihatlarini izlab topish usuli. "
        ]
    },
    {
        "word": "Kon Uchun Renta ",
        "type": [],
        "definition": [
            "kon egasining boshqa institutsion birliklarga kondan ma’lum muddatga foydalanishiga litsenziya (ruxsatnoma) berishi evaziga oladigan daromadiga aytiladi. Renta to'lovlari bir marotabalikyoki kondan qazib olingan mahsulot miqdoriga bog'liq ravishda to'lanadigan to'lovlardan iborat. "
        ]
    },
    {
        "word": "Konditsiya",
        "type": [],
        "definition": [
            "tovaming shartnomaga asosan belgilangan sifat, andoza, me’yorga mos bo'lishi. "
        ]
    },
    {
        "word": "Konfiskatsiya",
        "type": [],
        "definition": [
            "majburiy holda mulkning jami yoki bir qismini musodara qilish va davlat ixtiyoriga o'tkazish."
        ]
    },
    {
        "word": "Kompensatsiya Bitimi ",
        "type": [],
        "definition": [
            "kompensatsiya bitimi, kelishuvi. U yoki bu shaklda kontragentlar manfaatini o'zaro ta’minlash yoki o'zaro tovar yetkazib berish. Bunda belgilangan qiymatdagi tovarlarni boshqa tovar yoki xizmatlarga ayirboshlash amalga oshiriladi. "
        ]
    },
    {
        "word": "Kompromiss ",
        "type": [],
        "definition": [
            "nizoli vaziyat qatnashuvchilarining bir-birlariga yon bosish asosida kelishuvga erishishi; muzokaralar olib borish asosida nizoli vaziyatda masalaning o'zaro kelishuv uchun asos bo'ladigan jihatlarini izlab topish usuli. "
        ]
    },
    {
        "word": "Kon Uchun Renta ",
        "type": [],
        "definition": [
            "kon egasining boshqa institutsion birliklarga kondan ma’lum muddatga foydalanishiga litsenziya (ruxsatnoma) berishi evaziga oladigan daromadiga aytiladi. Renta to'lovlari bir marotabalikyoki kondan qazib olingan mahsulot miqdoriga bog'liq ravishda to'lanadigan to'lovlardan iborat. "
        ]
    },
    {
        "word": "Konditsiya",
        "type": [],
        "definition": [
            "tovaming shartnomaga asosan belgilangan sifat, andoza, me’yorga mos bo'lishi. "
        ]
    },
    {
        "word": "Konfiskatsiya",
        "type": [],
        "definition": [
            " majburiy holda mulkning jami yoki bir qismini musodara qilish va davlat ixtiyoriga o'tkazish. "
        ]
    },
    {
        "word": "Konglomerat",
        "type": [],
        "definition": [
            "monopolistik birlashma turlaridan biri. Konglomerat ishlab chiqarish va turli iqtisodiy faoliyat sohalarini o'z ichiga olgan kompaniyalarni bir shaxs qo'lida birlashtiradi. "
        ]
    },
    {
        "word": "Konglomerat Drversifikatsiya ",
        "type": [],
        "definition": [
            "firma assortimentini na firmada qo'llanayotgan texnologiyalarga, na ishlab chiqarilayotgan mahsulotlarga, na hozirgi bozorga hech qanday aloqasi bo'lmagan mahsulotlar bilan to'ldirish. "
        ]
    },
    {
        "word": "Konglomerat Tarkibi ",
        "type": [],
        "definition": [
            "unda firmaning bo'limlari turli belgilar bilan tuzilgan bo'lib, masalan, bittasida vazifaviy tarkib ishlatilsa, boshqasida hudud belgisi bo'yicha divizional tarkib, uchinchisida esa matritsali tarkib ishlatiladi. "
        ]
    },
    {
        "word": "Konkurensiya (Raqobat) ",
        "type": [],
        "definition": [
            " tovar va xizmatlar bozorida iqtisodiy faoliyat subyektlarining o'z mahsulotlarini xaridorlarga taqdim etish borasida olib boradigan o'zaro kurashi. "
        ]
    },
    {
        "word": "Konkurs Asosida Boshqaruvchi ",
        "type": [],
        "definition": [
            "joriy qonunchilik doirasida konkurs asosidagi ishlab chiqarish jarayonlarini tashkil etish uchun xo'jalik sudining qarori bilan tayinlanadigan shaxs. "
        ]
    },
    {
        "word": "Konkurs Asosidagi Ishlab Chiqarish",
        "type": [],
        "definition": [
            "bankrotlikni rasman e’tirof etish bilan bog'liq huquqiy taomillardan biri. Uning bosh maqsadi imkon qadar kreditorlarning qonuniy talablarini qondirishdan iborat. "
        ]
    },
    {
        "word": "Konosament ",
        "type": [],
        "definition": [
            "dengiz transportida yuklarni tashish shartlarini ifodalovchi hujjat. Konosament shartnoma mavjudligi fakti vayuktashuvchining yukni qabul qilib olganligini tasdiqlovchi hujjat. Konosamentga imzo chekishi bilan yukni saqlash, uni tegishli manzilga yetkazish mas’uliyati to'laligicha yuk tashuvchi kema zimmasiga o'tadi. Imzolangan konosamentning asl nusxasi sotib oluvchiga yuboriladi va ushbu hujjat unga tegishi bilan sotib oluvchi yukning huquqiy egasi hisoblanadi. "
        ]
    },
    {
        "word": "Konsalting",
        "type": [],
        "definition": [
            " maslahatxizmatini ko'rsatish va ekspertiza o'tkazish. Konsalting bilan shug'ullanadigan firmalar konsultativ deb ataladi. "
        ]
    },
    {
        "word": "Konsegnatsiya",
        "type": [],
        "definition": [
            "vositachi konsegnatsiya omborlari orqali tovarlarni sotish shakli. "
        ]
    },
    {
        "word": "Konsensus",
        "type": [],
        "definition": [
            "qarorlarni ishlab chiqish jarayonida barcha bahsli masalalar va turli-tuman fikrlar yuzasidan bir bitimga kelish yoki kelishishdir. "
        ]
    },
    {
        "word": "Konsentratsiyali Marketing ",
        "type": [],
        "definition": [
            "marketing harakatlarini yirik bozorning kichik qismini egallashga qaratish o'rniga bir yoki bir necha bozor segmentlarining katta qismiga qaratadi. "
        ]
    },
    {
        "word": "Konsentrik (Markazlashtirilgan) Diversifikatsiya ",
        "type": [],
        "definition": [
            " firma assortimentini mavjud tovarlarga texnik va marketing nuqtayi nazaridan o'xshash bo'lmagan mahsulotlar bilan to'ldirish. "
        ]
    },
    {
        "word": "Konsepsiya",
        "type": [],
        "definition": [
            " (lot. tizim ) - ma’lumpredmet, hodisa va jarayonlarni tushuntirish uslubi, predmet va boshqalarga qaratilgan asosiy ko'zqarash; ularni sistematikyoritib berish uchun bosh g'oya; bu matn ilmiy va boshqa faoliyatdagi asosiy fikrni, konstruktiv tamoyilni belgilash uchun ham qo'llaniladi. Masalan, tabiiy tartib konsepsiyasi va boshqalar. "
        ]
    },
    {
        "word": "Konsern",
        "type": [],
        "definition": [
            "(ingl. concern) - ishlab chiqarish diversifikatsiyasi asosida tarkib topadigan yirik, ko'p tarmoqli korporatsiya. Ular asta-sekin sanoat monopoliyasining yetakchi shakliga aylanadi. Konsernlar bir-biri bilan yaqin aloqada bo'lib, odatda, rasmiy mustaqilligini saqlab qoladigan, yagona idora etish markazidan boshqarilib turadigan bir guruh korxonalar birlashmasi. Bir konsern tarkibiga sanoat, transport, savdo korxonalari va bank uyushgan bo'lishi mumkin. Konsern tarkibidagi korxonalar ko'p sohalarda faoliyatlarini o'zaro muvofiqlashtirgan holda hamkorlikda tashkil etadilar."
        ]
    },
    {
        "word": "Konservatizm",
        "type": [],
        "definition": [
            " eskirib qolgan g'oyalarga, tartiblarga mutaassibona e’tiqod qo'yish, berilish, ergashish, taraqqiyotga ijtimoiy, iqtisodiy, siyosiy hayotdagi, fan, san’atdagi va boshqa sohalardagi yangiliklarga qarshi harakat qilish."
        ]
    },
    {
        "word": "Konsessiya",
        "type": [],
        "definition": [
            " (lot. ruxsat, yon berish) - biror davlatning chet el firmasi bilan kapitalni jalb etish uchun tuzgan shartnomasi. Konsessiya chet el xususiy yoki davlat firmasiga sanoat, transport va boshqa korxonalar qurish, ularni ekspluatatsiya qilish, yer osti boyliklarini qazib olish, ma’lum muddatga foydalanish huquqini beradi. "
        ]
    },
    {
        "word": "Konsessiya Shartnomalari ",
        "type": [],
        "definition": [
            "tabiiy boyliklar, ayrim foydali qazilmalarni qazib olish va o'zlashtirish uchun tuziladi. "
        ]
    },
    {
        "word": "Konsignator",
        "type": [],
        "definition": [
            "sotiladigan tovarlar qo'lida bo'lgan, lekin uning egasi bo'lmagan vositachi. U tovarlar uchun to'lovni ularni sotib bo'lganidan keyin yoki muayyan muddatda amalga oshiradi. "
        ]
    },
    {
        "word": "Konsignatsiya",
        "type": [],
        "definition": [
            " tovarlarni vositachilar ombori orqali sotish shakli. Bunda yetkazib beruvchi vositachi omboriga kelib tushgan tovarga egalik qilish huquqini tovar xaridorga sotilgan paytga qadar saqlab qoladi. "
        ]
    },
    {
        "word": "Konsignatsiya Operatsiya ",
        "type": [],
        "definition": [
            "vositachilik operatsiyalarining bir turi. Konsignatsiya operatsiyada konsignant deb nomlangan bir tomon konsignator deb nomlangan ikkinchi tomonga omborxonadan tovarni o'z nomidan va konsignant hisobiga sotishni topshiradi. Konsignatsiya operatsiya konsignatsiya shartnomasi asosida amalga oshiriladi. Unga nisbatan komissiya shartnomasi haqidagi qonun me’yorlari qo'llanadi. Konsignatsiya shartnomasi deganda shunday shartnoma tushuniladiki, unga muvofiq bir tomon (konsignator) boshqa tomon (konsignant) topshirig'iga ko'ra muayyan vaqt davomida (konsignatsiya shartnomasi muddatida) shartlashilgan mukofot uchun o'z nomidan va konsignant hisobiga konsignator mamlakati omborxonasiga yetkazilgan tovarlarni sotish majburiyatini zimmasiga oladi. Bu tovarlar ular uchinchi shaxslarga sotiladigan paytgacha konsignant mulki bo'lib qoladi. Sotishning konsignatsiya shaklidan bozor bo'sh o'zlashtirilganda yoki mahalliy xaridorlarga kam ma’lum bo'lgan yangi tovarlarni yetkazib berishda foydalaniladi. "
        ]
    },
    {
        "word": "Konsorsium",
        "type": [],
        "definition": [
            "(lot. consortium - shirkat, uyushma) - 1. Korxonalaming vaqtincha tashkil etilgan birlashmalari. Ular, odatda, moliyaviy ishlar yuzasidan tashkil etiladi. Unda davlat, banklar, moliyaviy muassasalar, yirik firmalar eshtirok etadi. 2. Muayyan iqtisodiy loyihalar yoki moliyaviy operatsiyalarni birgalikda amalga oshirish maqsadida banklar va sanoat kompaniyalari o'rtasida tuzilgan muvaqqat bitim. "
        ]
    },
    {
        "word": "Konsullik",
        "type": [],
        "definition": [
            " biron davlat, firma yoki kompaniyaning boshqa bir mamlakat ichidagi vakolatxonasi. "
        ]
    },
    {
        "word": "Konsyumerizm",
        "type": [],
        "definition": [
            "iste’molchilar huquqi va manfaatlarini himoya qilish maqsadida tashkil qilingan harakat. Iste’molchilar xavfsizligi, ularning iqtisodiy manfaatlarini muhofaza qilish, sifatsiz tovar ishlab chiqarish, g'irrom raqobatchilikka qarshi kurash bilan bog'liq."
        ]
    },
    {
        "word": "Kontingentlashtirilgan Soliqlar",
        "type": [],
        "definition": [
            "umumiy summasi oldindan o'rnatiladigan va so'ng mamuriy birliklardan tortib to alohida soliq to'lovchilar o'rtasida taqsimlanadigan soliqlar. "
        ]
    },
    {
        "word": "Kontingentlashtirish",
        "type": [],
        "definition": [
            "eksport va import kvotalarini belgilashyordamida davlat tomonidan tashqi savdoni tartibga solish shakllaridan biri. "
        ]
    },
    {
        "word": "Kontokorrent",
        "type": [],
        "definition": [
            "l) bank bilan mijoz o'rtasidagi barcha operatsiyalarni hisobga oladigan yagona schyot; 2) doimo savdo muloqotida bo'Igan ikki savdo korxonasining o'zaro kelishuvi bo'yicha ochilgan hisob-varag'i. "
        ]
    },
    {
        "word": "Kontokorrent Krediti ",
        "type": [],
        "definition": [
            "bankning mijozi bo'Igan korxona ko'p sonli korxonalar bilan ikki tomonlama aloqada bo'Igan hollarda qo'llashdir. "
        ]
    },
    {
        "word": "Kontrabanda",
        "type": [],
        "definition": [
            "(ital. contrabando) - davlat chegarasidan mollar, qimmatbaho buyumlarva boshqa narsalarni qonungaxilof (yashirincha) ravishda olib o'tish. "
        ]
    },
    {
        "word": "Kontragent",
        "type": [],
        "definition": [
            "shartnomabo'yichabelgilanganmajburiyatlarni o'z zimmasiga olgan shaxs yoki muassasa. "
        ]
    },
    {
        "word": "Kontrakt",
        "type": [],
        "definition": [
            "(lot. contractus - bitim, kelishuv) - mamlakatlar, firma, korxona va boshqalar o'rtasida o'zaro huquq va majburiyatlarni belgilash, o'zgartirish yoki to'xtatish to'g'risidagi ikki tomonlama yozma kelishuv, shartnoma. "
        ]
    },
    {
        "word": "Kontraktatsiya ",
        "type": [],
        "definition": [
            "l) biror narsani muayyan muddatga olish va ma lum sharoitda foydalanish uchun tuzilgan shartnoma; 2) tayyorlash tashkilotlari bilan ishlab chiqaruvchilar, dehqonchilikmahsulotlarini tayyorlash yuzasidan har yili tuziladigan shartnoma. "
        ]
    },
    {
        "word": "Kontraktiv Schyot",
        "type": [],
        "definition": [
            " moliyaviy hisobotda aktivning sof qiymatini aks ettirish uchun uning qoldig'iubilanbog'liqbo'lganaktivschyotining qoldig'idan chegirib tashlanadi. Kontraktiv schyotlarga 0200 ''Asosiy vositalarning eskirishini hisobga oluvchi schyotlar”, 0500 Nomoddiy aktivlar amortizatsiyasini hisobga oluvchi schyotlar”, 2980 “Savdo ustamasi” 4910 “Dargumon qarzlar bo'yicha rezerv” schyotlari kiradi."
        ]
    },
    {
        "word": "Kontrpassiv Schyot ",
        "type": [],
        "definition": [
            "moliyaviy hisobotda majburiyat yoki kapitalning sof qiymatini aks ettirish uchun uning qoldig'i u bilan bog'liq bo'lgan passiv schyotining qoldig idan chegirib tashlanadi. 8600 “Sotib olingan xususiy aksiyalarni hisobga oluvchi schyotlar” 9040 Sotilgan tovarlarning qaytishi”, 9050 “Xaridor va buyurtmachilarga berilgan chegirmalar” schyotlari kontrpassiv schyotlarga misol bo'ladi."
        ]
    },
    {
        "word": "Konvergensiya",
        "type": [],
        "definition": [
            "1. Marketingda talab xarakteriga ko'ra bozor turli bug‘inlariningbir-birigauyg'unlashibborishi.2.Birjadabaholarning haqiqiy baholarga va fyuchers shartnomalariga ko'ra uyg'unlashishi. "
        ]
    },
    {
        "word": "Konvergensiya Nazariyasi",
        "type": [],
        "definition": [
            "bu nazariyaning asosida kapitalistik ijtimoiy sistemalar o'rtasidagi iqtisodiy, siyosiy va mafkuraviy tafovutlar go'yo asta-sekin bartaraf etiladi, degan g'oya yotadi. Asosiy vakillari: U. Rostou, J. Gelbreyt (1908), Ya. Tinbergen (1903). "
        ]
    },
    {
        "word": "Konversiya",
        "type": [],
        "definition": [
            " (lot. conversio - o'zgarish) 1. Harbiy ishlab chiqarish va boshqa xil harbiy faoliyat sohalarining tinchlik maqsadlariga ko'chirilishi. 2. Korxonaning umuman boshqa turdagi mahsulot ishlab chiqarishga o'tishi. "
        ]
    },
    {
        "word": "Konvertatsion Jarayon ",
        "type": [],
        "definition": [
            "materiallarning tovar va xizmatlarga aylanishi bo'yicha harakatning davom etishi (harakatlar shakllanishi, natijalar). "
        ]
    },
    {
        "word": "Konvertatsion Marketing ",
        "type": [],
        "definition": [
            "Oldin chiqarilgan zayom shartlarini o'zgartirish. 2. Bir kompaniyadagi aksiya va obligatsiyalarni almashtirish. "
        ]
    },
    {
        "word": "Konvertatsiya",
        "type": [],
        "definition": [
            " bir tomondagi aksiya yoki obligatsiyani boshqa tipdagisiga shu kompaniyada almashtirish. "
        ]
    },
    {
        "word": "Konvertirlangan Valyuta",
        "type": [],
        "definition": [
            "erkin muomaladagi pul tizimi; bozor kursi bo'yicha to'lov amal qiladigan pul. Amal qilgan valyuta kursiga ko'ra bir mamlakat valyutasini boshqasiga almashtirish. "
        ]
    },
    {
        "word": "Konvertirlashtirish",
        "type": [],
        "definition": [
            "valyutani oltinga almashtirish; bir valyutani boshqasiga erkin almashtirish. "
        ]
    },
    {
        "word": "Konveyer",
        "type": [],
        "definition": [
            " ishlab chiqarish jarayonida har bir ishchi bajaradigan belgilangan operatsiyani aks ettiruvchi ish joylari. "
        ]
    },
    {
        "word": "Konyunktura",
        "type": [],
        "definition": [
            " bozorning alohida segmentida talab, taklif, narx va raqobat holatini xarakterlovchi omillar tizimi. "
        ]
    },
    {
        "word": "Kooperativ",
        "type": [],
        "definition": [
            "yuridik shaxs huquqiga ega bo'lgan, birgalikda ishlab chiqarish yoki boshqa xo'jalik faoliyatini olib borish maqsadida kishilarning shaxsan ishtiroki va a’zolarning mulklarini pay badallari asosida birlashtirish natijasida tashkil etilgan birlashma. "
        ]
    },
    {
        "word": "Kooperativ Mulk",
        "type": [],
        "definition": [
            "biron-bir faoliyat yuritish uchun a’zolikka asoslangan holda erkin uyushgan kishilaming umumiy mulki. "
        ]
    },
    {
        "word": "Kooperativ Oʻyin ",
        "type": [],
        "definition": [
            "o'yinda bir nechta o'yinchilar o'zaro kelishib, birgalikda o'ynaydi (iqtisodiyotda kooperativ o'yinga misol sifatida karterni keltirish mumkin)."
        ]
    },
    {
        "word": "Kooperatsiya",
        "type": [],
        "definition": [
            "ishlab chiqarish yoki ayirboshlash doirasidagi jamoaga birlashish. "
        ]
    },
    {
        "word": "Kooperatsiya Aloqalari ",
        "type": [],
        "definition": [
            "turli soha ishlab chiqarish tarmoqlarida ma’lum mahsulotni tayyorlash bo'yicha uzoq muddatli aloqalarni o'rnatish. "
        ]
    },
    {
        "word": "Kooperatsiya Qilish ",
        "type": [],
        "definition": [
            "yakuniy mahsulotni birgalikda tayyorlash bo'yicha uzoq muddatli to'g'ridan-to'g'ri xo'jalik aloqalarini o'rnatish. "
        ]
    },
    {
        "word": "Kooperatsiyalashuv",
        "type": [],
        "definition": [
            "muayyan bir mahsulot yaratish uchun turli korxonalar hamkorligi. Bu korxonalar faqat bir yoki ikki tarmoqqa tegishli bo'lmasligi mumkin. Kooperatsiyalashuvda qatnashuvchi korxonalar soni vujudga kelayotgan mahsulotning murakkabligiga bog'liq. "
        ]
    },
    {
        "word": "Kooperativ",
        "type": [],
        "definition": [
            "dastlabki bosqichda o'z-o'zini boshqarish va moliyalashtirish maqsadida tadbirkorlik faoliyatini olib borish uchun ixtiyoriy ravishda birlashgan fuqarolar guruhini jamlagan tashkilot. Hamkorlikda mahsulot ishlab chiqarish, sotish, sotib olish, tovarlar iste’moli va xizmat ko'rsatish maqsadida tashkil etiladi. Undagi jamg'armalar qatnashchilarining pay va badallari asosida vujudga keladi. "
        ]
    },
    {
        "word": "Korner",
        "type": [],
        "definition": [
            "sotib olish yo'li bilan ustama foyda olish maqsadida u yoki bu tovarni sotib olish bo'yicha tijoratchilar o'rtasidagi kelishuv. "
        ]
    },
    {
        "word": "Korporatsiya",
        "type": [],
        "definition": [
            "bir necha korxonalar, firmalarning birlashuvi. Yuridik tilda jismoniy shaxslamingbirgalikda faoliyat ko'rsatish uchun birlashuvi. Korporatsiya bu katta va ulkan firmalardir. Hozirgi vaqtda ular bozor iqtisodi taraqqiyot topgan davlatlar ishlab chiqarishining barcha sohalarida ustuvorlikka ega."
        ]
    },
    {
        "word": "Korporativ Boshqaruv ",
        "type": [],
        "definition": [
            " qonunchilik, me’yorlar va xususiy sektorning mos ravishdagi amaliyotining shunday birikmasiga tushuniladiki, ular kompaniyaga moliyaviy va inson resurslarini jalb qilish, samarali faoliyatni olib borishga imkoniyat beradi. Oqibatda aksiyadorlar, boshqa manfaatdor shaxslar va jamiyatning manfaatlariga rioya qilgan holda o'z aksiyadorlari uchun uzoq muddatli iqtisodiy qiymatni ko'paytirish orqali o'z mavjudligini saqlab qolishni ta’minlaydi. "
        ]
    },
    {
        "word": "Korporativ Boshqaruv Kodeksi ",
        "type": [],
        "definition": [
            "ixtiyoriy belgilanuvchi andozalar va ichki me’yorlar yig'indisi bo'lib, korporativ munosabatlarning tartibini o'rnatadi va tartibga soladi. Kodeks korxonadagi korporativ boshqaruvningbarcha muhim elementlariga taalluqli bo'Igan asosiy me’yorlar va tavsiyalardan tarkib topishi kerak. Emitentlarning Kodeks qoidalariga rioya qilishidan asosiy manfaatdorligi qimmatli qog'ozlar bozori orqali ularning investitsiyalarni jalb qilishga intilishidir. "
        ]
    },
    {
        "word": "Korporativ Boshqaruv Organlari ",
        "type": [],
        "definition": [
            "aksiyadorlar umumiy yig'ilishi; kuzatuv kengashi (direktorlar kengashi); ijroiya organi."
        ]
    },
    {
        "word": "Korporativ Boshqaruvda Davlat Ishtiroki Boʻyicha Amerika Modeli ",
        "type": [],
        "definition": [
            "model, odatda, ishlab chiqarish sektorida davlatning ulushi kichik bo'Igan mamlakatlarda qo'llaniladi. Ularda davlat aksiya paketlarini shartnoma asosida xususiy boshqaruvchi kompaniyalargaberishxususiyatlidir.Mazkurmodelda“Jamoatchilik uchun ochiq korporatsiyalar” mavjud bo'lib, ular mos ravishda tarmoq departamentlari va vazirliklarga bo'ysunadi."
        ]
    },
    {
        "word": "Korporativ Boshqaruvda Davlat Ishtiroki Boʻyicha I Italiya Modeli ",
        "type": [],
        "definition": [
            "korxonalarda davlat ulushi katta bo'Igan davlatlarga xosdir. Davlat korxonalari va davlat aksiya paketlarini boshqarish uchun davlat mulki vazirligiga qarashli ko'p tarmoqli xolding kompaniyalari tashkil qilinadi. "
        ]
    },
    {
        "word": "Korporativ Boshqaruvda Riskni Boshqarish Maqsadi ",
        "type": [],
        "definition": [
            "har qanday yomon vaziyatlarda ham gap aslo bankrotlikka tushish haqida emas, balki faqat foydaning birmuncha kamayishi haqida ketishiga erishishdir. "
        ]
    },
    {
        "word": "Korporativ Boshqaruvning Boshqaruv Qoidalarida Ad Olatlilik Tamoyili ",
        "type": [],
        "definition": [
            "halol raqobatchilik sharoitida kompaniyaga muvaffaqiyatli harakat qilishga imkoniyat berishi va shu bilan birga, barcha qatnashchilar, shu jumladan, minoritar aksiyadorlarning huquqlarini ham ta’minlashi lozim. Barcha aksiyadorlar o'z huquqlariga daxl qilinganda, ularni himoya qilishning samarali usullariga ega bo'lishi kerak. "
        ]
    },
    {
        "word": "Korporativ Boshqaruvning Maqsadi ",
        "type": [],
        "definition": [
            "korxona investitsiya jozibadorligini oshirish va barcha manfaatdor tomonlar manfaatlarining oqilona muvozanatiga rioya qilgan holda, amaldagi qonunchilik doirasida ochiq aksionerlik jamiyatining barcha faoliyat turlaridan imkon qadar yuqoriroq foyda olish. "
        ]
    },
    {
        "word": "Korporativ Boshqaruvning Modellari ",
        "type": [],
        "definition": [
            "unitar (investor) modeli - AQSH, Buyuk Britaniya, Avstraliya; ikki pog'onali (manfaatdor shaxslar) modeli - Germaniya; kontinental model; tarmoq modeli - Yaponiya (keyretsu), Koreya (chaebol). "
        ]
    },
    {
        "word": "Korporativ Boshqaruvning Ravshanlik Tamoyili ",
        "type": [],
        "definition": [
            "kompaniyaga aloqador barcha muhim axborotlar, shu jumladan, mulkchilik strukturasi, moliyaviy holat, faoliyat natijalari va boshqalarning o'z vaqtida va aniq oshkora qilinishini nazarda tutadi. "
        ]
    },
    {
        "word": "Korporativ Boshqaruvning Vazifalari ",
        "type": [],
        "definition": [
            "aksiyadorlar huquqlari va manfaatlarini himoya qilish; ochiq aksionerlik jamiyat investitsion jozibardorligini oshirish; aksiyalar narxining o'sishi orqali uzoqmuddatli iqtisodiy qiymatningjamg‘arilishi;jamiyatning rivojlanish strategiyasini aniqlash va uning amalga oshirilishini nazorat qilish; aksiyadorlik jamiyati biznes-rejalarini tasdiqlash va ularning bajarilishini nazorat qilish va faoliyatning boshqa muhim masalalarini hal qilish. "
        ]
    },
    {
        "word": "Korporativ Huquq",
        "type": [],
        "definition": [
            "korxonada ishlab chiqilgan qoidalar tizimi bo'lib, manfaatdor tomonlarning irodasini ifodalaydi va tashkilot faoliyatining turli tomonlarini tartibga soladi. "
        ]
    },
    {
        "word": "Korporativ Nazorat Organlari",
        "type": [],
        "definition": [
            "taftish komissiyasi; ichki audit xizmati; auditorlik tashkiloti. "
        ]
    },
    {
        "word": "Korporativ Obligatsiyalar ",
        "type": [],
        "definition": [
            "aksiyadorlik jamiyatlari va o'zining tashkiliy-huquqiy shaklidan qat’i nazar, tijorat banklari tomonidan chiqariladigan obligatsiyalar. "
        ]
    },
    {
        "word": "Korporativ Reklama ",
        "type": [],
        "definition": [
            " aniq bir tovar markasiga emas, balki to'liq tovarlar assortimentiga ehtiyoj yaratuvchi reklama."
        ]
    },
    {
        "word": "Korporativ Vms ",
        "type": [],
        "definition": [
            "ishlab chiqarish va taqsimotning ketma-ket bosqichlari yakka xo'jalik egaligi doirasida birlashgan tizim. "
        ]
    },
    {
        "word": "Korporatsiya (Birlashma) ",
        "type": [],
        "definition": [
            "rivojlangan yirik aksionerlik jamiyati va trestlar; biron-bir faoliyat uchun uyushgan yuridik va jismoniy shaxslar majmuyi. Korporatsiyalar negizi aksionerlik jamiyatlari hisoblanadi. Korporatsiyalar bir xil mahsulotlarning asosiy ishlab chiqaruvchilarini birlashtiradi, natijada ishlab chiqarish monopollashadi. Ayni paytda korporatsiyalar investitsiya kapitalining markazlashuviga yordam beradi, ilmiy-texnika taraqqiyoti, mahsulotning raqobatbardoshligi va uzoq hayotiy siklini ta’minlaydi. "
        ]
    },
    {
        "word": "Korporatsiya Madaniyati ",
        "type": [],
        "definition": [
            "kompaniyada qabul qilingan asosiy falsafiy qoida va g'oyalar hamda qadriyatlar tizimi. "
        ]
    },
    {
        "word": "Korporatsiyalarning Daromadidan Olinadigan Soliq",
        "type": [],
        "definition": [
            " daromad solig'i va foyda solig' ining (ayrim mamlakatlarda) o'rniga barcha kompaniyalarning foydasidan qat’iy foizda olinadigan soliq. Barcha korporativ organ va nokorporativ assotsiatsiyalarga nisbatan qo'llaniladi. Taqsimlanadigan dividendlar summalaridan ham soliq olishni taqozo etadi. "
        ]
    },
    {
        "word": "Korporatsiyalarning Taqsimlanuvchi Daromadi ",
        "type": [],
        "definition": [
            "korporatsiyalashgan korxonalar to'laydigan dividendlar (foydalar) va kvazikorporatsiya korxonalarining daromadlaridan olinadigan chegirmalar. "
        ]
    },
    {
        "word": "Korrektura",
        "type": [],
        "definition": [
            "buxgalteriya hisobi hujjatlaridagi xatolarni tuzatish. Korrektura usulining mohiyati shundan iboratki, bunda noto‘g‘ri yozuvning ustidan yupqa qilib chiziladi. Uning yon tomoniga yoki tepasiga togri yozuv yoziladi va bu to‘g‘rida muayyan hujjatning tagida hisobning shu sohasiga javobgar shaxs yoki bosh buxgalter tomonidan izoh beriladi va uning imzosi bilan tasdiqlanadi. Qilingan tuzatishga “tuzatilgani to‘g‘n” degan yozuv ilova qilinadi va tuzatish sanasi ko'rsatiladi. "
        ]
    },
    {
        "word": "Korrelyatsion Bogʻlanish ",
        "type": [],
        "definition": [
            "bu shunday to'liqsiz bog'lanishki, unda omillarning har bir qiymatiga turli zamon va makon sharoitlarida natijaning har xil qiymatlari mos keladi. "
        ]
    },
    {
        "word": "Korrelyatsion-Regression Model ",
        "type": [],
        "definition": [
            "bu o'rganilayotgan hodisalar orasidagi bog'lanishni natijaviy belgi bilan muhim omillar o'rtasidagi ishonchli miqdoriy nisbatlar orqali ifodalashdir. "
        ]
    },
    {
        "word": "Korrespondent ",
        "type": [],
        "definition": [
            "boshqa tashkilotlarga bozorda to'la faoliyat olib borish uchun xizmat ko'rsatadigan bank yoki boshqa moliya tashkiloti. "
        ]
    },
    {
        "word": "Korrespondentlik Banki ",
        "type": [],
        "definition": [
            "korrespondentlik shartnomalari asosida boshqa bankning to'lov va hisob-kitoblari bo'yicha talabnomalarini bajaradigan bank."
        ]
    },
    {
        "word": "Korrelyatsion Tahlil ",
        "type": [],
        "definition": [
            "hodisalar orasidagi bog'lanish zichlik darajasini baholash usulidir. "
        ]
    },
    {
        "word": "Korxona",
        "type": [],
        "definition": [
            "(firma) - amaldagi qonunlar asosida mustaqil ravishda foyda olish maqsadida faoliyat yurituvchi xo'jalik shakli. Korxona ishlab chiqarish, xizmat ko'rsatish, vositachilikvaboshqa sohalarda faoliyat ko'rsatishi mumkin bo'lib, xususiy, aksionerlik jamoa, kooperativ, davlat yoki aralash mulk shakllarida bo'lishi mumkin."
        ]
    },
    {
        "word": "Korxona (Firma) Daromadi ",
        "type": [],
        "definition": [
            "sotilgan mahsulot uchun korxona olgan pul miqdori. "
        ]
    },
    {
        "word": "Korxona (Tashkilot) ",
        "type": [],
        "definition": [
            " muayyan maqsadlarga erishish uchun birgalikda ishlaydigan kishilar birlashmasi."
        ]
    },
    {
        "word": "Korxona Aktivlari ",
        "type": [],
        "definition": [
            " korxonada ishlab chiqarish fondlari shaklida band bo'Igan kapitaldir. "
        ]
    },
    {
        "word": "Korxona Faoliyati Uzluksizligining Ehtimoli ",
        "type": [],
        "definition": [
            "mazkur xo'jalik subyekti kelajakda o'z faoliyatini davom ettirishi (hisobot davridan keyin kamida 12 oy davomida) va unda o'z faoliyatini tugatish yoki qisqartirishga zaruriyat ehtimoli yo'qligini o'zida mujassamlashtirgan buxgalteriya hisobining bir tamoyili. "
        ]
    },
    {
        "word": "Korxona Fondlari ",
        "type": [],
        "definition": [
            "xo'jalik faoliyatini amalga oshirish uchun korxona ixtiyoridagi qiymatga ega bo'Igan moddiy ashyolar, binolar, uskunalar, pul mablag'laridan iborat. Korxona fondlari ishlab chiqarish jarayonida qatnashish o'rniga ko'ra asosiy va aylanma fondlar bir-biridan farqlanadi. "
        ]
    },
    {
        "word": "Korxona Ishlab Chiqarish Xarajatlari ",
        "type": [],
        "definition": [
            "mahsulot yaratish uchun korxonada qilingan moddiy va pul sarflari yig'indisi. "
        ]
    },
    {
        "word": "Korxona Mulki ",
        "type": [],
        "definition": [
            "asosiy fondlar, nomoddiy aktivlar va ishlab chiqarish zaxiralari yig'indisidan iborat. Uning tarkibiga: materiallar, tayyor mahsulot, kelgusi davr xarajatlari, hisobot davrida (kunida) mahsulot tannarxi tarkibiga kiritilmagan, lekin amalga oshirilgan ishlab chiqarish xarajatlari, qoldiq mahsulotlarning muomala xarajatlari va ortib jo'natilgan mahsulotlar, bajarilgan ishlar, ko'rsatilgan xizmatlar va boshqalar kiradi. Soliqqa tortish bazasi (asosi) hisoblanayotgan paytda asosiy vositalar, nomoddiy aktivlar, kam baholi va tez eskiradigan predmetlarning qiymatidan eskirish summasi chiqarib tashlanadi. "
        ]
    },
    {
        "word": "Korxona Personali ",
        "type": [],
        "definition": [
            "umumiy tarzda mazkur korxona va tashkilotning barcha yollangan xodimlarini qamrab oladi va ular mutlaqo aniq vazifalarni bajaradilar."
        ]
    },
    {
        "word": "Korxona Resurslari ",
        "type": [],
        "definition": [
            "ishlab chiqarish yoki xizmat ko'rsatishda foydalaniladigan resurslar bo'lib, ularni uch guruhga ajratish mumkin: natural yoki tabiiy resurslar, moddiy resurslar va inson resurslari. "
        ]
    },
    {
        "word": "Korxonalarga Preferensiya Berish",
        "type": [],
        "definition": [
            "milliy iqtisodiyotda faoliyat ko'rsatuvchi korxonalarni moliyaviy qo'llab-quwatlash maqsadida ular tomonidan ishlab chiqarishga chet eldan olib kiriladigan xomashyo va materiallar, yarim tayyor mahsulotlar, shuningdek, asbob-uskunalami olib kirishda boj to'lovlari va boshqa jarayonlar bo'yicha yengilliklar (imtiyozlar) berilishi. "
        ]
    },
    {
        "word": "Korxonalarni Texnik Qayta Qurollantirish ",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonlarini mexanizatsiyalashtirish va avtomatlashtirish, eskirgan qurilma va uskunalarni yangilash va almashtirish, ishlab chiqarish tuzilmasi va tashkil etilishini yaxshilash yo'li bilan korxonaning texnik darajasini oshirish bo'yicha chora-tadbirlar majmuasi. U ishlab chiqarish intensivligini kuchaytirish, ishlab chiqarish quwatlarini oshirish va ishlab chiqarilayotgan mahsulotlar sifatini yaxshilashga yo'naltirilgan bo'ladi. "
        ]
    },
    {
        "word": "Korxonalarning Davlat Reestri ",
        "type": [],
        "definition": [
            "soliq to'lovchilarni soliq inspeksiyasida hisobga olish uchun qo'llaniladi va xo'jalik yurituvchi subyektlarni identifikatsiyalashtirishni ta’minlaydi. "
        ]
    },
    {
        "word": "Korxonaning Bankdagi Hisobidan Koʻchirma ",
        "type": [],
        "definition": [
            "korxonaning hisob-kitob, joriy va maxsus schyotlaridagi pul mablag'larining harakati haqida bank muassasasining yuborgan hujjati. "
        ]
    },
    {
        "word": "Korxonaning Bankrotligi ",
        "type": [],
        "definition": [
            "korxona moliyaviy-xo'jalik faoliyatining nochorlikka yuz tutishi natijasida o'z qarz majburiyatlarini bajara olmasligi. Korxona xo'jalik sudining qaroriga ko'ra, rasmiy holda bankrot deb e’lon qilinadi. "
        ]
    },
    {
        "word": "Korxonaning Hisob Siyosati ",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyekt rahbari tomonidan qo'llaniladigan buhgalteriya hisobi va moliyaviy hisobotni tuzish bo'yicha qoida va usullar yig'indisi. O'zbekiston Respublikasi hududida buxgalteriya hisobi va moliyaviy hisobotning tashkiliy-uslubiy asosini 1996-yil 30-avgustda qabul qilingan “Buxgalteriya hisobi to'g'risida’gi qonun, O'zbekiston Respublikasi Vazirlar Mahkamasi tomonidan tasdiqlangan “Mahsulot (ishlar, xizmatlar)ni ishlab chiqarish va sotish xarajatlarining tarkibi hamda moliyaviy natijalarni shakllantirish tartibi to'g'risida’gi nizom, o'z tarkibiga 21-sonli Buxgalteriya hisobi milliy standarti “Xo'jalik yurituvchi subyektlar moliyaviy-xo'jalik faoliyatining buxgalteriya hisobi schyotlar rejasi va uni qo'llash bo'yicha yo'riqnoma”ni ham qo'shgan holda, buxgalteriya hisobiningmilliy standartlari vaboshqa normativ hujjatlar tashkil etadi. Hisobot yili uchun ishlab chiqilgan hisob siyosati korxona rahbari tomonidan tasdiqlangandan so'ng yuridik hujjat maqomiga ega bo'ladi. "
        ]
    },
    {
        "word": "Korxonaning Innovatsion Salohiyati ",
        "type": [],
        "definition": [
            "korxonaning yangiliklarni joriy qilish yordamida bozor sharoitlarida faoliyatning samaradorligini oshirish maqsadida korxonaning o'ziga xos xususiyatlari bilan belgilanadigan rivojlanish qobiliyati. Korxonaning innovatsion salohiyati ichki innovatsiya jarayonidagi barcha bosqichlaming (ijtimoiy mehnat va resurslarning sarf me’yorlari asosida) bir maromda kechishiga imkon beradi. "
        ]
    },
    {
        "word": "Korxonaning Optimal Hajmi ",
        "type": [],
        "definition": [
            "mahsulot ishlab chiqarish (ish bajarish, xizmat ko'rsatish) bo'yicha imzolangan shartnoma va majburiyatlarni o'z muddatida, eng kam xarajatlar bilan eng yuqori samaradorlikka erishgan holda bajarish imkonini beruvchi korxona hajmi. "
        ]
    },
    {
        "word": "Korxonaning Sof Daromadi ",
        "type": [],
        "definition": [
            "korxona xodimlarining mehnati bilan yaratilgan qo'shimcha mahsulotning pulda ifodalanishi, mahsulotning sotish narxi qiymati bilan to'la tannarxi o'rtasidagi farq, korxona sof daromadi yalpi daromaddan mehnatga haq to'lash fondi tashkil etilgandan keyin qoladigan qismidir. "
        ]
    },
    {
        "word": "Korxonaning Tashkiliy Madaniyati ",
        "type": [],
        "definition": [
            "xodimlar tomonidan umume’tirof etilgan va qat’iy amal qilinadigan qadriyatlar, qoidalar, odat-udumlar, ananalar majmuyi. "
        ]
    },
    {
        "word": "Korxonaning Tijorat Sirlari ",
        "type": [],
        "definition": [
            "korxonaning ishlab chiqarish, texnologiyalar, boshqaruv va boshqa turdagi faoliyati bilan bog'liq, oshkor qilinishi korxona manfaatlariga zarar yetkazishi mumkin bo'lgan, davlat sirlariga aloqasi bo'lmagan ma’Iumotlar. "
        ]
    },
    {
        "word": "Korxonaning Yalpi Daromadi ",
        "type": [],
        "definition": [
            "yaratilgan mahsulotni sotishdan, turli pullik xizmatlar ko'rsatishdan, korxona ixtiyoriga tushadigan pul tushumlari yig'indisi (ya’ni yalpi mahsuloti)dan korxona moddiy xarajatlarini chegirib tashlaganda qolgan qismi. Korxona sof daromadi bilan ishchi, xizmatchilarga to'langan mehnat haqi birgalikda korxona yalpi daromadini tashkil etadi. "
        ]
    },
    {
        "word": "Kotirovka",
        "type": [],
        "definition": [
            "1. Chet el pullari, qimmatbaho qo'g'ozlar yoki tovarlarning birja narxi va kursini belgilash. 2. Qimmatli qo'g'oz yoki tovarlarning birjada aylanishi, yurishi, muomalada bo'lishi. 3. Birja narxlari to'g'risidagi rasmiy e’lon. "
        ]
    },
    {
        "word": "Kovernota",
        "type": [],
        "definition": [
            " sug'urta vositachisi tomonidan sug'urtalanuvchiga beriladigan va sug'urtalanuvchining sug'urta shartnomasi tuzishini tasdiqlovchi hujjat. Ushbu hujjatda ko'rsatilgan muddat mobaynida sug urta brokeri sug‘urtalanuvchiga sug'urta polisini berishi shart. Chunki kovernota sug'urta kompaniyasi uchun yuridik kuchga ega bo'Igan hujjat hisoblanmaydi. "
        ]
    },
    {
        "word": "Kredit",
        "type": [],
        "definition": [
            "(lot. qarz) - pul mablag'lari, tovar va xizmatlami kelishilgan ustama foiz to'lab qaytarish sharti bilan ma’lum muddatga qarzga berish. Kreditning tijorat va bank krediti shakllari mavjud bo'lib, ular ishtirokchilaming turi, kreditlash obyekti, foiz o'lchami va foydalanish sohasiga ko'ra farqlanadi. Tijorat krediti shuki, ishlab chiqarishda va savdoda faoliyat yuritayotgan tadbirkorlar o'zaro bir-birlariga sotilgan tovarlar yoki ko'rsatilgan xizmatlar to'lovini belgilangan muddatda amalga oshiradilar. Bunda, asosan, qarzdorlik kreditpullari, ya’ni veksel,banknot,chekvakreditkartochkalari bank vositachiligida rasmiylashtiriladi. Bank krediti pul mablag'larini ssudaga berishdan iborat bo'lib, 3 xil muddatli bo'ladi: qisqa, o'rta va uzoq muddatli. "
        ]
    },
    {
        "word": "Kredit Diskriminatsiyasi ",
        "type": [],
        "definition": [
            "kredit olishda, undan foydalanishda yoki xalqaro kreditni to'Iashda ma’lum bir qarz oluvchilarga iqtisodiy va siyosiy bosimni yuzaga keltiruvchi og'ir va qiyin shartlarni qo'yishdir. "
        ]
    },
    {
        "word": "Kredit Ekspansiyasi ",
        "type": [],
        "definition": [
            "mamlakatning ssuda kapitali bozorida foiz stavkalarining pasayishi natijasida kredit oluvchilarning ko'payishi, oqibatda kredit qo'yilmalari hajmining keskin ortishi. U, odatda, iqtisodiyotning investitsiyalarga bo'Igan yuqori darajadagi talabini qondirish maqsadida amalga oshiriladi. "
        ]
    },
    {
        "word": "Kredit Kartochkalari ",
        "type": [],
        "definition": [
            "kichik o'lchamdagi plastik yoki metall kartochka ko'rinishidagi hujjat bo'lib, bankdagi hisob sohibining f shaxsini tasdiqlaydi va unga naqd pullar yordamisiz tovar va xizmatlarga haq to'lash huquqini beradi. "
        ]
    },
    {
        "word": "Kredit Mexanizmi ",
        "type": [],
        "definition": [
            "kredit munosabatlarini tashkil qilishda qo'llaniladigan elementlar majmuasidir. "
        ]
    },
    {
        "word": "Kredit Obyekti ",
        "type": [],
        "definition": [
            "vaqtincha bo'sh turgan, berilishi mumkin bo'Igan pullar va tovarlardir. "
        ]
    },
    {
        "word": "Kredit Paketi ",
        "type": [],
        "definition": [
            " kreditlash jarayoni uchun zarur bo'Igan hujjatlar majmuasi tushuniladi. "
        ]
    },
    {
        "word": "Kredit Portfeli ",
        "type": [],
        "definition": [
            "tijorat banklari tomonidan berilgan jami kreditlarni jamlovchi hujjat. "
        ]
    },
    {
        "word": "Kredit Portfelining Diversifikatsiyasi ",
        "type": [],
        "definition": [
            "bankning ba’zi mijozlaridan ko'rgan zararlarni boshqa mijozlardan ko'rgan daromad hisobidan qoplash maqsadida bankning kredit resurslarini kam miqdorda ko'p sonli mijozlar o'rtasida taqsimlash demakdir."
        ]
    },
    {
        "word": "Kredit Potensiali ",
        "type": [],
        "definition": [
            "bankdagi yig'ilgan, tarkib topgan mablag* lardan likvidlilik rezervlar ayirmasiga teng. "
        ]
    },
    {
        "word": "Kredit Resurslarining Auksion! ",
        "type": [],
        "definition": [
            " kredit resurslarini erkin, ochiq tarzda auksion orqali sotishdir. "
        ]
    },
    {
        "word": "Kredit Siyosati ",
        "type": [],
        "definition": [
            "bankning kredit resurslarini joylashtirish sohasidagi qarorlarni qabul qilishga imkon beruvchi qoidalar va cheklanishlar majmuyidir. "
        ]
    },
    {
        "word": "Kredit Subyektlari",
        "type": [],
        "definition": [
            "korxona, firma, tashkilot, davlat va turli toifadagi aholidir. "
        ]
    },
    {
        "word": "Kredit Summasi ",
        "type": [],
        "definition": [
            " qarzga beriladigan pul birligining hajmi. "
        ]
    },
    {
        "word": "Kredit Tamoyillari ",
        "type": [],
        "definition": [
            "tovar va pul ko'rinishidagi mablag'larni maqsadlilik, qaytarib berish, muddatlilik, foiz to'lash, garov shartlari asosida berish natijasidir. "
        ]
    },
    {
        "word": "Kredit Tashkilotlari ",
        "type": [],
        "definition": [
            "tegishli litsenziyaga ega bo'lgan banklar, mikrokredit tashkilotlari, lombardlar va boshqa kredit tashkilotlari. "
        ]
    },
    {
        "word": "Kredit Tizimi ",
        "type": [],
        "definition": [
            "pul resurslarini tarkib toptiruvchi, o'zida jamlovchi va ma’lum muddatda qaytarib berish va haq to'lash shartlari asosida ularni qarzga beruvchi kredit muassasalari majmuasi. Unga: a) bank tizimi (markaziy bank, tijorat va ixtisoslashgan banklar); b) maxsus kredit muassasalari, ya’ni sug'urta kompaniyalari, nafaqa fondlari, investitsion kompaniyalar, moliya kompaniyalari va shu kabilar kiradi. "
        ]
    },
    {
        "word": "Kredit Turlari ",
        "type": [],
        "definition": [
            "qisqa muddatli kreditlar (muddati bir yilgacha bo'lgan kreditlar); uzoq muddatli kreditlar (muddati bir yildan ortiq bo'lgan kreditlar) dir."
        ]
    },
    {
        "word": "Kredit Vazifalari ",
        "type": [],
        "definition": [
            "pulga tenglashtirilgan to'lov vositalari (Veksel, chek, sertifikat)ni yuzaga chiqarib, ularni xo'jalik oborotiga jalb qilish, bo'sh turgan pul mablag'larini harakatdagi, ishdagi kapitalga aylantirishdir. Qarz berish orqali pul mablag'larini turli tarmoqlar o'rtasida qayta taqsimlash bilan ishlab chiqarish resurslarining ko'chib turishini ta’minlashdir. Qarz berish, qarzni undirish vositalari orqali iqtisodiy o'sishni rag'batlantirishdir. "
        ]
    },
    {
        "word": "Kreditga Layoqatlilik",
        "type": [],
        "definition": [
            "korxonaning bankdan so'ragan ssudani o'z vaqtida va to'liq qaytara olish imkoniyatidir. "
        ]
    },
    {
        "word": "Kreditlar Boʻyicha Ehtimoliy Yoʻqotishlarni Qoplash Uchun Zaxira",
        "type": [],
        "definition": [
            "bank kredit portfeli va balansdan tashqari majburiyatlarida yuzaga kelishi mumkin bo'lgan yoki mavjud zararlarni qoplash uchun qiymat summasini o'zida aks ettiradigan bankning barcha kreditlari bo'yicha zararlarni qoplash uchun tashkil etilgan zaxiralarning kontraktiv hisob-varag'i."
        ]
    },
    {
        "word": "Kreditlarning Foiz Stavkasi ",
        "type": [],
        "definition": [
            "berilgan kreditlarga to'lanadigan foiz miqdori. "
        ]
    },
    {
        "word": "Kreditlash Chegarasi ",
        "type": [],
        "definition": [
            "kredit munosabatlarining subyektlari yoki ssudalar turlariga nisbatan aniq ko'rsatkichlar shaklida belgilab qoyiladigan kreditdan foydalanishning qat’iy chegarasi. "
        ]
    },
    {
        "word": "Kreditlash Jarayoni ",
        "type": [],
        "definition": [
            " kreditni rasmiylashtirish jarayoni boshlangandan to berilishigacha bo'lgan davrni qamrab oladi. "
        ]
    },
    {
        "word": "Kreditlash Obyektlari ",
        "type": [],
        "definition": [
            "kredit hisobidan nima tashkil qilinsa yoki kredit nimaga yo'naltirilsa, o'sha tushuniladi. "
        ]
    },
    {
        "word": "Kreditlash Strategiyasi",
        "type": [],
        "definition": [
            "kredit siyosati borasida biron-bir bankning moliya bozoridagi mazmunli, maqsadli va aniq tamoyillarga asoslangan kredit munosabatlari. "
        ]
    },
    {
        "word": "Kreditlash Subyektlari ",
        "type": [],
        "definition": [
            "kredit munosabatlarida qatnashuvchi tomonlar anglanadi. "
        ]
    },
    {
        "word": "Kreditlash Taktikasi ",
        "type": [],
        "definition": [
            "kredit jarayonida ko'zlangan maqsadga erishish uchun qo'llaniladigan moliyaviy va boshqa dastaklar majmuyidir. "
        ]
    },
    {
        "word": "Kreditlashtirish",
        "type": [],
        "definition": [
            "kredit resurslari hisobidan tadbirlarni amalga oshirish darajasidir. "
        ]
    },
    {
        "word": "Kreditni Qayta Taqsimlash ",
        "type": [],
        "definition": [
            "vaqtinchalik bo'sh pul mablag'larini pulga ehtiyojmand subyektlar o'rtasida qayta taqsimlashdir."
        ]
    },
    {
        "word": "Kreditor",
        "type": [],
        "definition": [
            "vaqtincha bo'sh turgan pullarni pulga muhtoj bo'lgan huquqiy va jismoniy shaxslarga ma’lum muddatga foiz to'lovlari evaziga qaytarib berish sharti bilan qarzga beruvchi shaxs, kompaniya, bank va h.k. "
        ]
    },
    {
        "word": "Kreditor Qarzdorlik ",
        "type": [],
        "definition": [
            "korxona, tashkilot yoki muassasaning tegishli yuridik yoki jismoniy shaxslarga to'lanishi lozim bo'lgan pul mablag'lari bo'lib, ular me’yordagi (muddati o'tmagan) hamda muddati o'tgan qarzdorliklarga bo'linishi mumkin. "
        ]
    },
    {
        "word": "Kritik Risk Zonasi",
        "type": [],
        "definition": [
            "yo'qotishlar bo'lish xavfi borligini ifodalaydi, olinadigan foydadan bir qismining biror jarayon uchun yo'naltirilganligi va shu mablag'larning qaytib kelishida xavf borligini ifodalaydi. "
        ]
    },
    {
        "word": "Kritik Yoʻl ",
        "type": [],
        "definition": [
            "eng ko'p davomiylikka ega, loyihaning boshidan oxirigacha bo'lgan ishlarning ketma-ketligi. Kritik yo'lda yotgan loyiha ishlari vaqt zaxirasiga ega emas. "
        ]
    },
    {
        "word": "Krizis",
        "type": [],
        "definition": [
            " (yunon. krisis - hal etish, oqibat) - q. inqiroz. "
        ]
    },
    {
        "word": "Kross Kurs ",
        "type": [],
        "definition": [
            "bir mamlakat valyutasining ikkinchi bir mamlakat valyutasiga nisbatan USD orqali ifodalanadigan nisbati. Kross kurs xalqaro miqyosda keng qo'llaniladi. Uni, asosan, yirik kompaniyalar va korporatsiyalar qo'llaydi. Bu valyuta kursini aniqlashning real yo'li hisoblanadi. "
        ]
    },
    {
        "word": "Ksenofont",
        "type": [],
        "definition": [
            " (m.a.430-335\/354) -yunonyozuvchisivatarixchisi. Quldorlikni qo‘llab-quwatlagan. “Dehqonchilik barcha sanatlarning onasi va boquvchisi” degan iboraning muallifi. “Ekonomiya” (uy xo'jaligi) so'zini birinchi bo'lib ishlatgan. Mehnat taqsimotiga alohida urg'u bergan va uni bozor ko'Iami bilan bog'lagan. Pulning almashuv va jamg'arish (ikki) funksiyalarini tan olgan. "
        ]
    },
    {
        "word": "Kuchli Davlat ",
        "type": [],
        "definition": [
            "omma faoliyatiga asoslangan kuchli boshqaruv tizimiga, rivojlangan iqtisodiyot, yuksak ma’naviyatga ega bo'Igan davlat. Bunday davlat mustahkam iqtisodiy, huquqiy va ma’naviy asosga ega bo'ladi. Uning qudrati fuqarolar hamjihatligi, jamiyatdagi do'stlik va bag'rikenglik, har bir fuqaroning onglilik darajasi, davlat boshqaruvidagi faol ishtirokiga asoslanadi. "
        ]
    },
    {
        "word": "Kuchli Jamiyat ",
        "type": [],
        "definition": [
            " mustahkam negizningbarqarorligi ta’minlangan, davlatning boshqaruvchilik faoliyati qisqarib, jamoat tashkilotlarining roli kuchaygan, fuqarolarning qonun asosida ularning huquq va erkinliklari oliy qadriyatlarga aylangan jamiyat. "
        ]
    },
    {
        "word": "Kumulyatsiya",
        "type": [],
        "definition": [
            "bir qancha yirik sug'urta summali obyektlarning bitta sug'urta hodisasi tufayli zarar ko'rishi ehtimolligini nazarda tutuvchi sug'urta risklari yig'indisi. "
        ]
    },
    {
        "word": "Kundalik Isteʼmol Tovarlari ",
        "type": [],
        "definition": [
            "har kuni yoki tez-tez sotib olinadigan va istemol qilinadigan tovarlar. "
        ]
    },
    {
        "word": "Kundalik Talab ",
        "type": [],
        "definition": [
            "har kuni yoki tez-tez sotib olinadigan va iste’mol qilinadigan tovarlarga bo'Igan talab. "
        ]
    },
    {
        "word": "Kupon ",
        "type": [],
        "definition": [
            "1. Xazina majburiyatining, obligatsiyaning har yili daromad keltirib turadigan yirtma qismi. 2. Aksiyaga ilova qilib, dividendlar to'lash uchun mo'ljallangan varaq. "
        ]
    },
    {
        "word": "Kupyura",
        "type": [],
        "definition": [
            "ustida qiymati ko'rsatilgan pul bileti, aksiya, obligatsiya yoki boshqa qimmatli qog'oz. "
        ]
    },
    {
        "word": "Kurno Antuan Ogyusten",
        "type": [],
        "definition": [
            " (1801-1877) - fransiyalik matematik, birinchilardan bo'lib matematikani iqtisodiy jarayonlarga keng qo'llash uslubini ishlab chiqdi. Ekonometrika yo'nalishining asoschilaridan biri. Talablarning elastikligi” funksiyasi va grafigini yaratdi. "
        ]
    },
    {
        "word": "Kurno Muvozanati ",
        "type": [],
        "definition": [
            "duopolik bozorda har bir firma mustaqil ravishda shunday optimal ishlab chiqarish hajmini tanlaydiki, ushbu mahsulot hajmi ikkinchi firmani qanoatlantiradi. Kurno muvozanati firmalarning aks tasir qiluvchi funksiyalari grafiklarining kesishish nuqtasida vujudga keladi."
        ]
    },
    {
        "word": "Kurs ",
        "type": [],
        "definition": [
            "aksiya, obligatsiya, boshqa qimmatli qo'g'ozlarning oldi-sotdisiga qo'yiladigan baho; qo'g'oz pullar kursining oltin valyutada yoki boshqa mamlakat valyutasida aks etishi. "
        ]
    },
    {
        "word": "Kurs Boʻyicha Farq",
        "type": [],
        "definition": [
            "milliy valyutaga nisbatan chet el valyutasi kursining o'zgarishi munosabati bilan chet el valyutasida amalga oshirilgan operatsiyalarda vujudga keladigan (ijobiy, salbiy) farq "
        ]
    },
    {
        "word": "Kurtaj",
        "type": [],
        "definition": [
            "irjabitimni amalga oshirgandavositachilikuchunbrokergaberiladigan mukofot. Kurtaj stavkalari qimmatli qo'g'ozlar va tovarlar toifasiga, bitimlarning hajmi xususiyatlarigabog'liqbo'ladi. Kurtaj miqdorlari birjalarning ustavlari yoki birja bitimi qatnashchilari va broker o'rtasidagi kelishuv bilan belgilanadi"
        ]
    },
    {
        "word": "Kutiladigan Qiymat (Matematik Kutilish) ",
        "type": [],
        "definition": [
            "(Lorens chizig'i) - biror-bir ko'rsatkichning taqsimlanish darajasini ifodalovchi egri chiziq. Bu amerikalik olim Maks Otto Lorens (1876-1944) tomonidan aholi daromadlarining taqsimlanishini narxlash uchun ishlab chiqilgan. Aholidan daromad solig'i olinib, ularga transfert berilgandan keyin Lorens chizig'ining botiqligi kamayadi. "
        ]
    },
    {
        "word": "Kutilayotgan Inflyatsiya ",
        "type": [],
        "definition": [
            "daromad oluvchi tomonidan prognozlanadigan narxlarning oshishi. Shuning uchun daromad egasi inflyatsiyaning oqibatlarini yumshatish yoki bartaraf etish uchun oldindan choralar ko'rishi mumkin. "
        ]
    },
    {
        "word": "Kutilayotgan Inflyatsiya Darajasi ",
        "type": [],
        "definition": [
            "mavjud ijtimoiy-iqtisodiy axborotlar, ma’Iumotlar asosida alohida shaxs va korxonalar tomonidan kutiladigan bo'lg'usi davrdagi inflyatsiya darajasi. "
        ]
    },
    {
        "word": "Kutilmagan Inflyatsiya ",
        "type": [],
        "definition": [
            "baholaming o'sishi. Bunda daromad oluvchi yoki davlat tomonidan oldindan choralar ko'rilmaganligi sababli inflyatsiyaning real daromadlarga salbiy ta’sirining oldini olish mumkin bo'lmaydi. "
        ]
    },
    {
        "word": "Kvadratik Oʻrtacha Tafovut ",
        "type": [],
        "definition": [
            "kvadrat ildiz ostidan chiqarilgan dispersiyadir. "
        ]
    },
    {
        "word": "Kvadrillion",
        "type": [],
        "definition": [
            "birning yonidagi nollar soni 15 ta bo'lgan son. "
        ]
    },
    {
        "word": "Kvazikorporatsiya (Oʻtkinchi Korporatsiya) ",
        "type": [],
        "definition": [
            "kvazikorporatsiya: l) institutsion birlik rezidentiga qarashli bo'lib, korporatsiyalashmagan korxonaga o'xshaydi. U alohida korxona shaklida boshqariladi hamda o'z mulkdorlari bilan o'zaro munosabatda aslida korporatsiya bilan aksiyadorlar munosabatiga o'xshaydi; 2) institutsion birlik rezidentiga qarashli bo'lmagan va korporatsiyalashmagan korxona institutsion birlik tasarrufida bo'ladi. Zero, u muayyan iqtisodiy hududda uzoq yoki noaniq davr ichida ishlab chiqarish bilan band bo'ladi."
        ]
    },
    {
        "word": "Kvazikorporatsiyalar Daromadidan Chegirma",
        "type": [],
        "definition": [
            "mulkdan keladigan daromadningbir turi. Bunday chegirma kvazikorporatsiya egasiga u korxonaga ajratgan mablag‘ning hajmiga qarab ajratiladi. "
        ]
    },
    {
        "word": "Kvazioptimum-Pareto ",
        "type": [],
        "definition": [
            "samarali hajmda tovar ishlab chiqarish mumkin bo'lmaganda ishlab chiqarish mumkin bo'lgan variantlardan eng yaxshisini tanlash (optimalgayaqin). "
        ]
    },
    {
        "word": "Kvintillion",
        "type": [],
        "definition": [
            " birning yonidagi nollar soni 18 ta bo'lgan son. KVOTA - l) tegishli bitim doirasida milliy yoki xalqaro birlashma ishtirokchilarining ishlab chiqarish yoki sotishda ishtirok etish hissasi; 2) xalqaro iqtisodiy yoki moliya-valyutaviy tashkilotning ustav fondi yoki kapitalida mamlakatning badali; 3) soliqqa tortish birligidan olinadigan soliq stavkasi (absolyut ifodada yoki hissa ko'rinishida); 4) nimaningdir qismi, hissasi, normasi (me’yori), miqdoriy cheklanishlar. Kvota davlat va xalqaro tashkilotlar tomonidan tovarlarni ishlab chiqarish, ularni eksport va import qilish yuzasidan cheklashlaming joriy etilishi. Kvota o'rnatish xalqaro bitimlarga binoan amalga oshiriladi. Davlatlararo shartnomalarga ko'ra ayrim yoki bir guruh tovarlar yuzasidan kvota o'matiladiki, unga muvofiq mamlakatlar faqat belgilangan miqdordagi tovarlarni ishlab chiqarishi va chetga sotishi mumkin."
        ]
    },
    {
        "word": "Kvotali Qayta Sugʻurtalash",
        "type": [],
        "definition": [
            "sug'urta kompaniyasi qayta sug'urtalovchi kompaniya bilan kelishgan holda unga risklarning bir qismini beradi. Bu operatsiya kvota shartnomasi orqali rasmiylashtiriladi. Qayta sug'urtalovchi kompaniyaga sug'urta mukofotining tegishli qismi beriladi va qayta sug'urtalovchi kompaniya proporsional ravishda ko'rilgan zararni qoplashda ishtirok etadi. "
        ]
    },
    {
        "word": "Kvotativ Soliqlar ",
        "type": [],
        "definition": [
            "daromad yoki mulk qiymatining puldagi ifodasiga nisbatan stavkasi foizlarda o'rnatiladigan soliqlar. "
        ]
    },
    {
        "word": "Konstitutsion Burch ",
        "type": [],
        "definition": [
            "O'zbekiston fuqarolari Konstitutsiyada belgilab qo'yilgan, fuqarolar bajarishlari shart bo'lgan majburiyatlardir. "
        ]
    },
    {
        "word": "Konstitutsion Hukumat ",
        "type": [],
        "definition": [
            "demokratik hukumat qonunga va ayniqsa yozma hujjat-konstitutsiyasiga asoslanadi. Konstitutsiyalar hukumatning vakolati va majburiyatlarini ta’minlaydi. Shuningdek, ular qonunlar qanday tayyorlanishi va hayotga tatbiq etilishini ham o'zida aks ettiradi. Aksariyat konstitutsiyalar hukumatning vakolati va majburiyatlarini ta’minlaydi."
        ]
    },
    {
        "word": "Kengaytirilgan Reallik Voqelik ",
        "type": [],
        "definition": [
            "real dunyodagi muhit rasmlar yoki obyektlarning fizikaviy elementlariga raqamli ma’lumotlarni (tasvir, video, matn, grafika, 3D model va boshqalarini) qо‘shuvchi texnologiY. "
        ]
    }
]