[
    {
        "word": "Laj",
        "type": [],
        "definition": [
            " (ajio) - pul va qimmatbaho qog'ozlarning nominal qiymati, bozor narxidan past bo'lganda uchraydigan holat. Agar pul va qimmatbaho qog'ozlarning nominal qiymati bozor narxidan yuqori bo'lsa, bu hoi dizajio deb ataladi. "
        ]
    },
    {
        "word": "Lash",
        "type": [],
        "definition": [
            "oltin bozor narxining rasmiy narxdan ortiq qismi. "
        ]
    },
    {
        "word": "Latifundiya",
        "type": [],
        "definition": [
            "yirik yer egaligi. Dasdab Qadimgi Rimda m.a. II asrda paydo bo'Igan va milodiy I asrda keng tarqalgan. Feodalizm davrida avj oldi. Prussiya va AQShda rivoj topdi. Inqiloblar tufayli tugatildi"
        ]
    },
    {
        "word": "Lavozim",
        "type": [],
        "definition": [
            "korxona, muassasa, idora va tashkilotlarda biror rasmiy xizmatni bajarish bilan bog'liq bo'Igan vazifa. "
        ]
    },
    {
        "word": "Legal Monopoliya ",
        "type": [],
        "definition": [
            "o'zining mahsulotiga egalik qilish va sotish huquqini olgan monopoliya. Ko'pgina hollarda davlat fan va texnikadagi ishlarni rag'batlantirish uchun ongli ravishda kashfiyot egalariga monopol huquqlarni beradi. Legal monopoliyalar cheklangan vaqt davomida mavjud bo'ladi. Masalan, patent yoki litsenziyaga egalik qilish vaqti mobaynida. Bundan so'ng boshqa firmalar ham bu yo'nalishda faoliyat ko'rsata boshlaydi. "
        ]
    },
    {
        "word": "Legitimatsiya",
        "type": [],
        "definition": [
            " 1. Hujjatni e’tirof qilish, tasdiqlash, tan olish. 2. Huquqni yoki vakolatni tan olish yoki tasdiqlash. "
        ]
    },
    {
        "word": "Levej-Lizing ",
        "type": [],
        "definition": [
            " bunda ijaraga berilayotgan uskuna va jihozlar narxining katta miqdori uchinchi tomondan, ya’ni investordan qarzga olinadi. "
        ]
    },
    {
        "word": "Liber Foizning Oʻrtacha Stavkasi ",
        "type": [],
        "definition": [
            "London banklarining o'z depozitlarini boshqa birinchi darajali banklarga joylashtirish stavkasi bo'lib, u har kuni soat 11.00 da qayd etiladi va boshqa banklar uchun, ayniqsa, xalqaro bitimlar tuzishda kreditlar bo'yicha foizlar belgilashda asosiy mo'ljal hisoblanadi. "
        ]
    },
    {
        "word": "Libor",
        "type": [],
        "definition": [
            " Londondagi jahon ssuda kapitallari bozorida yetakchi erkin almashinadigan valyutalar - AQSh dollari, Germaniya markasi, Yaponiya ienasi, Buyuk Britaniya funt sterlingi kabi valyutalardagi depozitlarga to'lanadigan foiz stavkasidir. "
        ]
    },
    {
        "word": "Lifo",
        "type": [],
        "definition": [
            "inglizcha (last in first out - so'nggi kirim birinchi chiqim) - sarf qilingan materiallar qiymatini hisobdan chiqarishning usullaridan biri. LIFO usuli - o'sib borayotgan inflyatsiya sharoitida vaqt bo'yicha oxirgi sotib olingan materiallar qiymatidan kelib chiqqan holda hisobni yuritishdir."
        ]
    },
    {
        "word": "Likvidatsiya",
        "type": [],
        "definition": [
            "(tugatish, tarqatish, barham berish) - firma yoki korxona faoliyatining aksionerlar yig'inining, xo'jalik sudining qaroriga muvofiq, bankrotlikka uchrashi, qayta tashkil etilishi tufayli to'xtalishi. "
        ]
    },
    {
        "word": "Likvidli Mablagʻlar ",
        "type": [],
        "definition": [
            "firma ixtiyoridagi pul vositalari, bank depozitlari, qimmatli qog'ozlar, oson sotish mumkin bo'lgan moddiy aylanma mablag'lar bo'lib, ular tezda sotish mumkin bo'lgan aktivlardir. "
        ]
    },
    {
        "word": "Likvidli К R1Sk1 ",
        "type": [],
        "definition": [
            " tijorat banklari likvidligi pasayishi bilan bog'liq risklardir"
        ]
    },
    {
        "word": "Likvidlilik",
        "type": [],
        "definition": [
            "a) turli firmalar va banklarning o'z qarzini to'lay olish yoki boshqa majburiyatlarini bajara olish imkoniyati; b) bir aktivning ikkinchisiga qanchalik tez almashina olinishi o'lchovi. Naqd pul eng yuqori 100% likvidlilikka ega. "
        ]
    },
    {
        "word": "Likvidlilik Koeffitsiyenti ",
        "type": [],
        "definition": [
            " mavjud mablag'larning qanchalik qismi tez orada qoplash uchun yo'naltirilishi mumkinligini ifodalovchi ko'rsatkich. "
        ]
    },
    {
        "word": "Likvidlilik Tuzogʻi ",
        "type": [],
        "definition": [
            "foiz stavkasi juda past bo'lgan shunday vaziyatki, odamlar pulni naqd ko'rinishda saqlab turishni afzal ko'radilar. Tadbirkorlar esa foiz stavkasi bundan ko'ra pasayishi mumkin emasligi sababli investitsiyalarni ko'paytirmaydi. Minimal foiz stavkasi sharoitida pulga talab egri chizig'i cheksiz elastik bo'lib qoladi. "
        ]
    },
    {
        "word": "Limit",
        "type": [],
        "definition": [
            "xo'jalik faoliyati turli jihatlari miqdorining cheklanishi, faoliyat doirasi, chegarasining belgilanishi. Limit davlat yoki yirik birlashma tomonidan o‘z korxonasi uchun o'rnatiladi. "
        ]
    },
    {
        "word": "Limited",
        "type": [],
        "definition": [
            "kompaniyalarning o'z majburiyatlari bo'yicha cheklangan javobgarligini aks ettiruvchi termin (aksioner yoki pay kapital asosida). Mas’uliyati cheklangan jamoaningbelgisi. "
        ]
    },
    {
        "word": "Limitlashtirilgan Chek Daftarchalari ",
        "type": [],
        "definition": [
            "olti oygacha muddatga berilib, unda chek daftarchasidan o'tkazib berilishi mumkin bo'lgan summa ko'rsatiladi. Chek, yozib berilgan kunni hisobga olmaganda, 10 kungacha o'z kuchini yo'qotmaydi. Oldindan e Ion qilingan limit summasi to'lovchining hisob-kitob schyotidan maxsus schyotga o'tkazib qo'yiladi. Shuning uchun limitdan ortiqcha summaga yozib berilgan chek bekor qilinadi va bank tomonidan to'lanmaydi. Limitlashtirilgan chek daftarchasi bo'yicha summa 100 so'mdan kam bo'lmasligi kerak. "
        ]
    },
    {
        "word": "Limitlashtirilmagan Chek Daftarchalari",
        "type": [],
        "definition": [
            "bir yil muddatga berilib, ularni bergan bank ssudasi bilan ta’minlanadi. Ular mablag'larni maxsus schyotda oldindan deponentlashni talab qilmaydi. "
        ]
    },
    {
        "word": "Lingvistik Taʼminot ",
        "type": [],
        "definition": [
            "inson va tizim orasidagi muloqotni ishlab chiqish hamda ta’minlash uchun axborotlarga ishlov berish va foydalanishning turli bosqichlarida ishlatiladigan til vositalari yig'indisini o'zida namoyon etadi. "
        ]
    },
    {
        "word": "Litsenzion Savdo ",
        "type": [],
        "definition": [
            "xalqaro savdoda intellektual mulkni, texnologiyani, ixtiro va patentlarni oldi-sotdi qilishning asosiy ko'rinishi. "
        ]
    },
    {
        "word": "Litsenziya",
        "type": [],
        "definition": [
            "u yoki bu mahsulotni tayyorlash, xo'jalik ishlab chiqarish va ilmiy faoliyatning turini amalga oshirish, mahsulotning ma’lum bir turi va miqdorini eksport yoki import qilish, olib kirish, olib chiqish yoki o'tkazib ketishga davlat yoki mahalliy boshqaruv organlarining rasmiy ruxsati (roziligi). Savdo qilish huquqi yoki lotoreya va mahalliy auksionlarni o'tkazish uchun litsenziya uch nusxada rasmiylashtiriladi. Birinchi nusxa ijarachiga (o'tkazuvchiga, shug'ullanuvchiga) beriladi, ikkinchisi tuman soliq inspeksiyasiga yo' llanadi, uchinchi nusxa esa tegishli qaror, xat va ungailova qilingan hujjatlar bilan birgalikda tuman yoki shahar ma’muriyatining ish jildida saqlanadi. Litsenziya olish uchun murojaat etayotgan jismoniy shaxslar tadbirkorlik faoliyati bilan shug'ullanish huquqiga ega ekanliklari to'g'risida guvohnomaga ega bo'lishlari shart."
        ]
    },
    {
        "word": "Litsenziya Savdosi - ",
        "type": [],
        "definition": [
            "xalqaro miqyosda yangi texnika va texnologiya bilan savdo qilishning asosiy shakli. "
        ]
    },
    {
        "word": "Litsenztyalash",
        "type": [],
        "definition": [
            "chetdan mol keltirish yoki chet ellarga mol chiqarish uchun davlat organlari tomonidan litsenziyalash (ijozat berish). "
        ]
    },
    {
        "word": "Lizing",
        "type": [],
        "definition": [
            " moliya-kredit munosabatlarining shakllaridan biri bo'lib, korxonalar tomonidan mashina, asbob-uskuna va shunga o'xshash tovarlarni uzoq muddatli ijaraga olishni anglatadi. Lizingda uning obyektlari, odatda, (lekin majburiy tartibda emas) ijaraga beruvchi korxonaning balansidan ijaraga oluvchi korxonaning balansiga pirovardida o'tkaziladi. Bu tartibdagi bitimlar ijarachi korxona uchun foydali hisoblanib, ular moliyaviy zarar ko'rmaydilar va, odatda, soliq va amortizatsiya imtiyozlariga ega bo'ladilar. "
        ]
    },
    {
        "word": "Lizing Munosabatlari ",
        "type": [],
        "definition": [
            "qarz olish asosidagi ijara munosabatlarining alohida toifasida ifodalanuvchi o'zaro bog'liq iqtisodiy-huquqiy, moliya-kredit munosabatlari majmuasidan iborat. "
        ]
    },
    {
        "word": "Lizing Shartnomasi",
        "type": [],
        "definition": [
            "asbob-uskunalar, texnika-texnologiyalarni uzoq muddatga ijaraga olish."
        ]
    },
    {
        "word": "Lizing Toʻlovlari ",
        "type": [],
        "definition": [
            " lizingga beruvchining lizing obyektini sotib olish uchun qilgan xarajatlarining hammasi yoki ko'p qismi, shuningdek, lizing obyektini yetkazib berish va belgilangan maqsadda foydalanish uchun uni yaroqli holga keltirish bilan bog'liq bo'Igan boshqa xarajatlarining lizingga oluvchi tomonidan qoplanishi hamda lizingga beruvchining daromadidir. "
        ]
    },
    {
        "word": "Lizing Turlari ",
        "type": [],
        "definition": [
            "bu: operativ lizing, moliyaviy lizing "
        ]
    },
    {
        "word": "Lizing Xizmati ",
        "type": [],
        "definition": [
            "ishlab chiqarish inshootlari, mashina ishlab chiqarish, transport vositalarini shartnoma asosida ma’lum haq evaziga uzoq muddatli ijaraga berish. Lizingxizmatiningikkituribor: a) moliyaviy lizing xizmatida ijara to'lovi miqdori mulk egasining ijaraga bergan mulki qiymatini to'liq qoplab ham foyda keltiradi; b) oddiy lizing xizmatida ijara davrida ijaraga olingan mulkning faqat bir qismi amortizatsiyalash shaklida to'lanib, ijara shartnomasi shartlariga qarab ijarachi qoldiq qiymati ijaraga olingan mulkni sotib olishi yoki qaytadan shartnoma muddatini uzaytirishi yoki olingan lizing kompaniyaga qaytarilishi mumkin. "
        ]
    },
    {
        "word": "Lizingga Beruvchining Daromadi ",
        "type": [],
        "definition": [
            "lizing to'lovlari bilan lizing obyektini sotib olish, uni yetkazib berish va belgilangan maqsadda foydalanish uchun yaroqli holga keltirish xarajatlari o'rtasidagi farq sifatida aniqlanadigan, lizingga beruvchi tomonidan lizing operatsiyasini amalga oshirish natijasida oladigan daromadidir."
        ]
    },
    {
        "word": "Lloyd",
        "type": [],
        "definition": [
            "l) Angliyadagi xalqaro sug'urta bozori; Angliyadagi sug'urtalovchilar korporatsiyasi. Taxminan 1734-yilda tashkil etilgan. Hozirgi paytda Lloydga 22000 dan ortiq tashkilot a’zo. Uning faoliyati Angliya parlamenti qabul qilgan maxsus qonun bilan tartibga solinadi. Lloyd sug'urtaning barcha turlarini amalga oshiradi. Uning a’zolari 279 sindikatga birlashgan bo'lib, sindikat faoliyati uchun anderrayterlar javob beradi. Anderrayterlar bilan sug'urtalanuvchilami sug'urta vositachilari birlashtiradi. Sug'urta vositachilari Lloyd bozorida risklarni joylashtiradi. Anderrayterlar sug'urta shartnomasi bo'yicha javob berish uchun yirik miqdordagi pul mablag'larini korporatsiyaga depozit sifatida qo'yadi. "
        ]
    },
    {
        "word": "Loffer Egri Chizigʻi ",
        "type": [],
        "definition": [
            "soliq stavkalari va soliq tushumlari miqdori o'rtasidagi bog'liqlikni aks ettiradi. Soliq stavkasini ko'tarish yordamida faqat ma’lum vaqtgacha soliq tushumlarini ko'paytirish mumkin. Soliq stavkasini o'ta ko'tarib yuborish faoliyat ko'rsatish rag'batlarini buzib yuboradi, natijada budjetga soliq tushumlari miqdori kamayishi mumkin. Soliq tushumlari soliq stavkasiga bog'liqligini iqtisodchi Artur LofFer tadqiq etgan va uni “Loffer egri chizig'ida” aks ettirgan. "
        ]
    },
    {
        "word": "Lokal Hisoblash Tarmogi",
        "type": [],
        "definition": [
            "maxsus mutaxassislar o'rtasida almashish uchun ma’lum territoriya chegarasida tashkil etilgan va kanallar bilan birlashtirilgan dasturlash va axborot uzatish resurslari."
        ]
    },
    {
        "word": "Lokaut",
        "type": [],
        "definition": [
            "kasaba uyushmasining korxonalar ma’muriyatining shartlarini qabul etishga majbur qilish maqsadida ishlab chiqarishni to'xtatish va ish haqini to'lamay qo'yishi. "
        ]
    },
    {
        "word": "Loko",
        "type": [],
        "definition": [
            "chet el valyutasi yoki qimmatli qog'ozlaming naqd pullik hisob-kitob bo'yicha oldi-sotdi bitimi bo'lib, u bitim tuzilgan birjada amalga oshiriladi. "
        ]
    },
    {
        "word": "Lombard Krediti ",
        "type": [],
        "definition": [
            "tijorat banklari Markaziy bankdan o'zlarining portfelidan qimmatbaho qog'ozlarni garovga qo'yish orqali kredit oladi. "
        ]
    },
    {
        "word": "Lorens Egri Chizigi ",
        "type": [],
        "definition": [
            " aholi daromadlarining taqsimlanishini aks ettiruvchi egri chiziq. “Oilalar ulushi” abssissada, “daromadlar ulushi” ordinatada joylashgan. Egri chiziqda har bir nuqta aniq daromadga ega oilalar u yoki bu miqdorining umumiy daromaddagi ulushini ko'rsatadi. Grafikdagi bissektrisa daromadlarning absolyut teng taqsimlanishi holatini aks ettiradi. Bissektrisaga binoan egri chiziq o'rtasidagi bo'lak aslida mavjud bo'lgan daromadlarning notekis taqsimlanishini ifodalaydi. Shu bo'lak qanchalik katta bo'lsa, daromadlarning notekis taqsimlanish darajasi shunchalik yuqori bo'ladi. Agar bu notekis taqsimlash kamaysa, egri bissektrisaga yaqinlashadi, agar oshsa uzoqlashadi. "
        ]
    },
    {
        "word": "Loro Hisoblari ",
        "type": [],
        "definition": [
            " bank tomonidan shu bank vakillari hisoblangan boshqa banklar uchun ochadigan hisoblar. "
        ]
    },
    {
        "word": "Loyiha",
        "type": [],
        "definition": [
            "o'zaro bog'liq bo'lgan, ma’lum bir natijaga erishishga yo'naltirilgan va ularni amalga oshirish uchun uzoq muddat talab etiladigan ishlar ketma-ketligi. "
        ]
    },
    {
        "word": "Loyiha Boshqaruvi ",
        "type": [],
        "definition": [
            "berilgan loyiha cheklovlarini hisobga olgan holda resurslar (mehnat, moddiy va uskunalar)ni rejalashtirish, taqsimlash va nazorat qilishdir. "
        ]
    },
    {
        "word": "Loyiha Ishlari Tuzilmasi ",
        "type": [],
        "definition": [
            "loyiha amalga oshirilayotganda bajarilishi lozim bo'lgan ishlarning bog'liq tizimi."
        ]
    },
    {
        "word": "Loyiha Ishlarini Bajarish Bosqichlari ",
        "type": [],
        "definition": [
            "resurs ajratish va jarayonni nazorat qilish uchun bajariladigan ishlar davomiyligi bolinadigan vaqt oraliqlaridir. "
        ]
    },
    {
        "word": "Loyiha Sifati ",
        "type": [],
        "definition": [
            " mahsulotga xos uning bozordagi joyini aniqlaydigan qiymati. "
        ]
    },
    {
        "word": "Lozanna Maktabi ",
        "type": [],
        "definition": [
            "L. Valras va V. Pareto (1848-1923) tomonidan iqtisodiyotda ekonometrika usullarini keng qo'llash tufayli paydo bo'lgan. "
        ]
    },
    {
        "word": "Luka Pacholi ",
        "type": [],
        "definition": [
            "(1494-yil) - italiyalik matematik, faylasuf va olim Luka Pacholi ikkiyoqlama yozuv metodini asoslab bergan. U “Schyotlar va yozuvlar to'g'risidagi traktatida” (lot. tractatus - muhokama) asarida yozuvlarni bir vaqtning o'zida ''bermoq” va “ega bo'lmoq” schyotlarda aks ettirish hamda “bermoq” va “egabo'lmoq” schyotlar summalarining yig'indisi o'zaro teng kelishi kerak, deb aytgan. Agar ular teng kelmasa, bilingki, sizning hisob-kitoblaringizda xatolik mavjud. Buxgalteriya hisobi fanining asoschisi hisoblanadi. "
        ]
    },
    {
        "word": "Lukas R.i. ",
        "type": [],
        "definition": [
            "Neoliberalizm tarafdori. ''Ratsional kutilmalar” nazariyasi uchun 1995-yilda Nobel mukofotini qo'lga kiritgan. Ijtimoiy-institutsional yo'nalish evolyutsiyasi industrial jamiyatdan postindustrial, superindustrial (neoindustrial) jamiyatsariboradigankonvergensiya nazariyalarida (Gelbreyt, P. Sorokin - AQSH, Raymon, Aron - Fransiya, Tinbergen - Niderlandiya) kapitalizm va sotsializmning ilg'or tomonlarini olish va amalda qo'llash taklif etiladi. "
        ]
    },
    {
        "word": "Lukas Robert ",
        "type": [],
        "definition": [
            "(1937-yil) - amerikalik iqtisodchi, ratsional (muvofiq) kutish nazariyasi asoschisi. Uning fikricha, davlatning iqtisodiyotni tartiblash bo'yicha tadbirlari foydasiz, chunki iqtisodiy agentlar davlatning hamma harakatlarini oldindan ko'radilar va ularga mos holda javob berishga harakat qiladilar. "
        ]
    },
    {
        "word": "Logistika ",
        "type": [],
        "definition": [
            " inson-mashina tizimida moddiy, mehnat, energiya va axborot resurslari oqimlari harakati jarayonlarini rejalashtirish, boshqarish va nazorat qilish tizimi."
        ]
    }
]