[
    {
        "word": "Maʼlumotlar Bazasi",
        "type": [],
        "definition": [
            "tartiblashning umumiy tamoyillari ko'zda tutilgan holda, aniq qonun-qoidalar asosida tuzilgan hamda himoya qilinadigan va saqlanadigan ma’lumotlar yig'indisi."
        ]
    },
    {
        "word": "Maʼmuriy Boshqaruv Usullari",
        "type": [],
        "definition": [
            "aniq maqsadlarga erishish uchun tashkiliy munosabatlarga ta’sir ko'rsatish usulidir."
        ]
    },
    {
        "word": "Maʼmuriy Javobgarlik",
        "type": [],
        "definition": [
            "ma’muriy huquqbuzarlikni sodir etganligi uchun fuqarolar va mansabdor shaxslar yuridik javobgarligining shakllaridan biri"
        ]
    },
    {
        "word": "Maʼmuriyat",
        "type": [],
        "definition": [
            "1. Davlat organlarining boshqaruv faoliyati; boshqaruv sohasidagi tashkiliy faoliyat. 2. Davlat ijro hokimiyati organlari. 3. Muassasa, korxonalarning rahbar xodimlari"
        ]
    },
    {
        "word": "Maʼmuriy-Boshqaruv Xarajatlari",
        "type": [],
        "definition": [
            "boshqaruv apparatini saqlash (ta’minlash) xarajatlari; xizmatdagi yengil avtomobillami saqlashxarajatlari; qorovulchilikxodimlari, qo'riqchi tizimlarni saqlash xarajatlari; xizmat safari xarajatlari."
        ]
    },
    {
        "word": "Maʼmuriy-Buyruqbozlik",
        "type": [],
        "definition": [
            "(rejalashtirilgan bozor) sobiq SSSR davlatlarida amalda bo'Igan bozor turi. Unda davlat mulki ustun va xususiy mulk deyarli yo'q, imperativ qat’iy reja hukmron, erkin raqobat inkor etiladi; qat’iy baholar qo'llanadi. Hayot bozorning bu turini inkor etmoqda."
        ]
    },
    {
        "word": "Maʼmuriylashtirish",
        "type": [],
        "definition": [
            "kompaniya siyosati va umumiy maqsadlarini shakllantirish, menejment esa ularning amalga oshishini tashkil etish va nazorat qilish"
        ]
    },
    {
        "word": "Maʼnaviy Ehtiyoj",
        "type": [],
        "definition": [
            "ma’naviy boyliklar; o'qish, bilim olish, san’at, madaniy dam olish va hokazolarga bo'Igan ehtiyoj."
        ]
    },
    {
        "word": "Maʼnaviy Tavakkalchilik",
        "type": [],
        "definition": [
            "yo'qotishlar sug'urta kompaniyasi tomonidan to'liq qoplanishiga ishonch hosil qilgan holda vujudga kelishi mumkin bo'Igan yo'qotishlar ehtimolini ongli ravishda oshirib ko'rsatishga intiluvchi shaxs xatti-harakati."
        ]
    },
    {
        "word": "Maʼnavty-Ruhry Holat",
        "type": [],
        "definition": [
            "ijtimoiy guruhning qadriyatli mo'ljallanishi va shaxslararo munosabatlarning xarakterini aks ettiruvchi barqaror ruhiy holat."
        ]
    },
    {
        "word": "Mablagʻ (Kapital) Sarf-Xarajatlar Hisobi",
        "type": [],
        "definition": [
            "asosiy va aylanma fondlar, nomoddiy aktivlar sotib olish sarf-xarajatlari hamda ularning shakllanish manbayiga oid tashqi iqtisodiy operatsiyalarni o’zida aks ettiradi."
        ]
    },
    {
        "word": "Mablagʻ (Kapital) Xarajatlari Hisobi",
        "type": [],
        "definition": [
            "asosiy oborot (aylanma) fondlar, nomoddiy va moliya aktivlarining jamg'arilish jarayonini tavsiflash hamda ularga sarmoya ajratish manbalarini hisobga olishga mo'ljallangan."
        ]
    },
    {
        "word": "Magazin",
        "type": [],
        "definition": [
            "magazin, do'kon; chakana savdo tashkiloti"
        ]
    },
    {
        "word": "Magistratura",
        "type": [],
        "definition": [
            "bakalavriat negizida o'qish muddati kamida ikki yil bo'lgan aniq mutaxassislik bo'yicha oliy ta’lim."
        ]
    },
    {
        "word": "Mahalliy Budjet",
        "type": [],
        "definition": [
            "davlat budjetining tegishli viloyat, tuman, shahar pul mablag'lari jamg'armasini tashkil etuvchi bir qismi bo'lib, unda daromadlar manbalari va ulardan tushumlar miqdori, shuningdek, moliya yili mobaynida aniq maqsadlar uchun ajratiladigan mablag'lar sarfi yo'nalishlari va miqdori nazarda tutiladi"
        ]
    },
    {
        "word": "Mahalliy Davlat Muassasalari",
        "type": [],
        "definition": [
            "mahalliy davlat muassasalari kichik sektor alohida institutsion birlik hisoblangan mahalliy davlat muassasalari hamda mahalliy davlat muassasalari tamonidan nazorat qilinuvchi va moliya bilan ta minlanuvchi notijorat tashkilotlardan tarkib topadi."
        ]
    },
    {
        "word": "Mahalliy Oʻz-Oʻzini Boshqarishni Mustahkamlash",
        "type": [],
        "definition": [
            "hokimiyatni tashkillashtirish prinsipi, demokratiyalashtirishning samaradorligi, federal hokimiyatni “past”dan tuzish, davlatning fuqarolik jamiyati madaniylashgan institutga aylanishidir."
        ]
    },
    {
        "word": "Mahalliy Soliqlar Va Yigʻimlar",
        "type": [],
        "definition": [
            "mahalliy budjetga olinadigan jismoniy va yuridik shaxslarning majburiy to'lovlari. Ularning tarkibiga quyidagilar kiradi: mol-mulk solig'i, yer solig'i, reklama solig'i, avtotransport vositalarini olib sotganlik uchun soliq, savdosotiq qilish huquqi uchun yig'im, shu jumladan, ayrim turdagi tovarlarni sotish huquqini beruvchi litsenziya yig'imlari, yuridik shaxslar, shuningdek, tadbirkorlik faoliyati bilan shug'ullanuvchi jismoniy shaxslarni ro'yxatga olganlik uchun yig'im, avtotransport to'xtash joyidan foydalanganlik uchun yig'im, obodonchilik ishlari uchun yig‘im va boshqalar."
        ]
    },
    {
        "word": "Mahalliylashtirish",
        "type": [],
        "definition": [
            "import qilinadigan tayyor mahsulot, butlovchi buyumlar va materiallarni mamlakatda ishlab chiqarishni yo'lga qo'yish orqali unga bo'lgan ichki talabni qondirish va eksportini yo'lga qo'yish."
        ]
    },
    {
        "word": "Mahsulot",
        "type": [],
        "definition": [
            "biror faoliyatning moddiy natijasi (mehnat, xizmat ko'rsatish; ish bajarish). Ishlab chiqarish iste’moli uchun foydalaniladigan ishlab chiqarish vositalari va shaxsiy iste’mol uchun ishlatiladigan iste’mol predmetlari; mahsulot, masalan, yalpi mahsulot, sof mahsulot, sanoat mahsuloti."
        ]
    },
    {
        "word": "Mahsulot (Ish, Xizmat) Ishlab Chiqarish Tannarxi",
        "type": [],
        "definition": [
            "mahsulot (ish, xizmat) ni ishlab chiqarish yoki qayta ishlash jarayonida ishlatiladigan tabiat resurslari, xomashyo, material, yoqilg'i, energiya, asosiy fondlar, mehnat resurslari hamda ishlab chiqarish bilan bog'liq boshqa xarajatlaming puldagi ifodasidir."
        ]
    },
    {
        "word": "Mahsulot (Texnologiya)Ning Hayotiy Sikli",
        "type": [],
        "definition": [
            "alohida mahsulot (texnologiya)ning ichki (tashqi) bozorlarda konkret innovatsion maqsadlarning ro'yobga oshirilishini ta’minlay olish layoqati saqlanib turadigan muayyan davr."
        ]
    },
    {
        "word": "Mahsulot Attestatsiyasi",
        "type": [],
        "definition": [
            "mahsulot sifatining texnik-iqtisodiy ko'rsatkichlarini obyektiv baholashni tizimli ravishda amalga oshirishni ko'zda tutuvchi, tashkiliy-texnik va iqtisodiy choratadbirlar majmuasi"
        ]
    },
    {
        "word": "Mahsulot Birligidan Olingan Foyda",
        "type": [],
        "definition": [
            "muayyan mahsulotni sotishdan olingan foydaning shu mahsulotning ishlab chiqarish hajmiga nisbati."
        ]
    },
    {
        "word": "Mahsulot Differensiatsiyasi",
        "type": [],
        "definition": [
            "tovarning o'ziga xos xususiyadari. Iste’molchi shuning uchun ushbu tovarni shu kategoriyadagi boshqa tovarlarga nisbatan yoqtiradi"
        ]
    },
    {
        "word": "Mahsulot Ishlab Chiqarish Va Sotish Xarajatlari",
        "type": [],
        "definition": [
            "mahsulot ishlab chiqarishda foydalaniluvchi tabiiy resurslar, xomashyo va materiallar, yoqilg'i va energiya, asosiy fondlar va mehnat resurslari, shuningdek, mahsulot ishlab chiqarish va sotishning boshqa xarajatlarining qiymat baholari"
        ]
    },
    {
        "word": "Mahsulot Partiyasi Ishlab Chiqarish Vaqti",
        "type": [],
        "definition": [
            "bitta mahsulot ishlab chiqarish uchun talab qilinadigan vaqtning partiya miqdoriga ko'paytmasi."
        ]
    },
    {
        "word": "Mahsulot Rentabellig",
        "type": [],
        "definition": [
            "ayrim mahsulot turining daromadliligi, foydaliligini aks ettirib, mahsulot sotishdan olingan foydaning mahsulot to'la tannarxiga nisbati bilan hisoblanadi"
        ]
    },
    {
        "word": "Mahsulot Sertifikati",
        "type": [],
        "definition": [
            "mahsulot sifatini baholash va nazorat qilishning xalqaro normalarini qabul qilish va amalga oshirish jarayoni; mahsulot ishlab chiqaruvchilarga qaram bo'lmagan, mahsulotning xalqaro standart normalariga mos kelishini nazorat qilish uchun kerakli asbob-uskunalar bilan ta’minlangan maxsus markazlarni yaratish bilan amalga oshiriladi."
        ]
    },
    {
        "word": "Mahsulot Sifati",
        "type": [],
        "definition": [
            "mahsulotning inson va jamiyatning ma’lum bir ehtiyojlarini qondirish qobiliyatlarini belgilovchi foydali xislatlari majmuyi."
        ]
    },
    {
        "word": "Mahsulot Sifatini Boshqarish",
        "type": [],
        "definition": [
            "mahsulotni yaratish va undan foydalanish yoki uni iste’mol qilishda zarur sifat darajasini belgilash, ta’minlash va qo'llab-quwatlash maqsadida amalga oshiriluvchi xatti-harakatlar."
        ]
    },
    {
        "word": "Mahsulot Sifatini Boshqarish Tizimi",
        "type": [],
        "definition": [
            "sifatni boshqarish uchun zarur bo'lgan resurslar, jarayonlar va javobgarlikni aniq taqsimlovchi tashkiliy tuzilma."
        ]
    },
    {
        "word": "Mahsulot Soligʻi -",
        "type": [],
        "definition": [
            "qandaydir tovar yoki xizmat birligiga solinadigan soliq"
        ]
    },
    {
        "word": "Mahsulot Tannarxi",
        "type": [],
        "definition": [
            "korxonaning mahsulotni yaratish uchun qilingan sarf-xarajatlarining puldagi ifodasi. Mahsulot tannarxi korxona iqtisodiy faoliyatining asosiy ko'rsatkichlaridan bo'lib, o'zida mahsulot yaratish uchun qilingan xomashyo, yoqilg'i-moylash materiallari, mehnat, elektr energiyasi sarfi, shuningdek, bino, inshoot va uskunalarning ishlab chiqarish jarayonida sotilgan qismi qiymatini ifodalaydi. Sanoatda tannarxning sex, korxona va to'la yoki kommersiya miqdori alohida farqlanib, xarajatlar tarkibi har bir sanoat tarmog'ida o'ziga xos xususiyatga ega bo'ladi."
        ]
    },
    {
        "word": "Mahsulot Tannarxi Tarkibiga Kiritiladigan Mahsulotni Ishlab Chiqarish Va Sotish Xarajatlari",
        "type": [],
        "definition": [
            "maxsus nizom asosida belgilanib, uning tarkibiga mahsulot (ish, xizmat)ni ishlab chiqarish bilan bevosita bog'liq xarajatlar, tabiiy xomashyo, yer, o'rmon, suv resurslaridan foydalanish bilan bog'liq xarajatlar, ishlab chiqarishni tayyorlash va o'zlashtirish xarajatlari, texnologik jarayonlarni takomillashtirish va mahsulot sifatini oshirish bilan bog'liq nokapital xarakterdagi xarajatlar, tajriba-eksperimental va ixtiro xarajatlari, ishlab chiqarish jarayoniga xizmat ko'rsatish xarajatlari kabilar kiradi."
        ]
    },
    {
        "word": "Mahsulot Uchun Boshqa Subsidiyalar",
        "type": [],
        "definition": [
            "rezidentli korxonalar ishlab chiqargan tovarlar va xizmatlar uchun beriladigan moliyaviy yordam. Bunday subsidiya mahsulot ishlab chiqarilganda, sotilgarida, boshqalarga ijaraga berilganda yoxud o'z istemoli va jamg'arish uchun ishlatilganda to‘lanishi zarur."
        ]
    },
    {
        "word": "Mahsulot Uchun Subsidiya",
        "type": [],
        "definition": [
            "ishlab chiqarilgan tovar yoki ko'rsatilgan xizmat birligi uchun beriladigan moliyaviy yordamdir."
        ]
    },
    {
        "word": "Mahsulot-Jarayon Matritsasi",
        "type": [],
        "definition": [
            "jarayonlar tizimlari, ishlab chiqarish hajmlari va boshqa qator tavsiflar orasidagi o'zaro bog'liqlikni aks ettiradi."
        ]
    },
    {
        "word": "Mahsulotlarga Soliqlar",
        "type": [],
        "definition": [
            "rezidentlar tomonidan ishlab chiqarilgan va sotilgan yoki import qilingan mol va xizmatlarga mutanosib ravishda olinadigan soliqlar. Ularga, masalan, qo'shilgan qiymat solig'i, aksiz, bojxona to'lovlari va h.k.lar kiradi."
        ]
    },
    {
        "word": "Mahsulotni Ishlab Chiqarishdagi Vaqt",
        "type": [],
        "definition": [
            "mahsulotga butun ishlab chiqarish jarayonini o'tashga talab qilinadigan o'rtacha vaqt. Bu vaqt mahsulotga ishlov berish vaqti va navbatda turish vaqtidan iborat. Bu vaqt buyurtma vaqti (lead time) tarkibiga kiradi. Buyurtma vaqti deganda mijoz o'z buyurtmasini kutishi kerak bo'lgan umumiy vaqt tushuniladi."
        ]
    },
    {
        "word": "Mahsulotni Sotishdan Olingan Yalpi Foyda",
        "type": [],
        "definition": [
            "mahsulotlar (ishlar, xizmatlar) ni sotishdan olingan sof tushum bilan sotilgan mahsulotning ishlab chiqarish tannarxi o'rtasidagi tavofut."
        ]
    },
    {
        "word": "Mahsulotning Boj Qiymati",
        "type": [],
        "definition": [
            "mahsulot chegaradan o'tayotgan paytda uning egasi tomonidan e’lon qilinadigan qiymat. Uning to'g'riligini aniqlash ustidan nazorat mahsulotlarni rasmiylashtiruvchi bojxona organlari tomonidan amalga oshiriladi. Mahsulotlarning boj qiymatini aniqlashda turli metodlardan foydalaniladi: a) kiritilayotgan mahsulotlarning bitim bahosi bo'yicha (eng ko'p qo'llaniladigan metod); b) turdosh (bir turdagi, birxildagi) mahsulotlar bitim bahosiga ko'ra; v) qiymatni hisoblash metodi bo'yicha; g) qiymatlarni qo'shish yo'li bilan; d) rezerv metodi bo'yicha."
        ]
    },
    {
        "word": "Mahsulotning Hayotiy Davri",
        "type": [],
        "definition": [
            "tovarning bozorga kirib kelishidan boshlab to uning bozordan chiqib ketishiga qadar amalga oshiriladigan izchil chora-tadbirlar."
        ]
    },
    {
        "word": "Mahsulotning Marjinalligi",
        "type": [],
        "definition": [
            "olingan daromad (baho) nisbatan foiz ko'rinishidagi bir birlik mahsulotga to'g'ri keladigan marjinal daromadning darajasi."
        ]
    },
    {
        "word": "Mahsulotning Material Sigʻimi",
        "type": [],
        "definition": [
            "xomashyo, materiallar va boshqa moddiy resurslarning mahsulot birligiga sarflanuvchi xarajatlari. Material sig'imini kamaytirish tayyor mahsulot va materiallarni ko'paytirish, mahsulot tannarxini kamaytirish va xomashyo tarmoqlarini rivojlantirishga sarflanuvchi xarajatlami kamaytirishga imkon yaratadi."
        ]
    },
    {
        "word": "Mahsulotning Mehnat Sigʻimi",
        "type": [],
        "definition": [
            "mehnat unumdorligi ko'rsatkichlariga teskari bo'lgan kattalik. Moddiy ishlab chiqarish sohasida sarflangan mehnatning ishlab chiqarilgan mahsulot hajmiga nisbati orqali aniqlanadi"
        ]
    },
    {
        "word": "Mahsulotning Muvozanat Miqdori",
        "type": [],
        "definition": [
            "talab va taklif miqdorlari teng bo'lganda mahsulotni bozorda sotish hajmi."
        ]
    },
    {
        "word": "Mahsulotning Texnik Darajasi",
        "type": [],
        "definition": [
            "baholanayotgan mahsulotning texnik takomillashganliginibelgilovchi, uning bazis ko'rsatkichi ariga mos keluvchi ko'rsatkichlarni taqqoslashga asoslangan mahsulot sifatining nisbiy tavsifnomasi"
        ]
    },
    {
        "word": "Mahsulotning Umumiy Hajmi",
        "type": [],
        "definition": [
            "mehnat jarayonida qo'llaniladigan ishlab chiqarish omillarining hamma miqdoridan to'liq foydalanib ishlab chiqarilgan mahsulot."
        ]
    },
    {
        "word": "Mahsulotning Yashash Davri",
        "type": [],
        "definition": [
            "mahsulot hayoti beshta bosqichining almashinish davri: ishlab chiqish, ishlab chiqarish, bozorga chiqish, o'sish, bozorning to'yinishi va ma’naviy eskirish. MAHSULOT ATrESTATSIYASI - mahsulot sifatining texnik-iqtisodiy ko'rsatkichlarini obyektiv baholashni tizimli ravishda amalga oshirishni ko'zda tutuvchi, tashkiliy-texnik va iqtisodiy choratadbirlar majmuasi."
        ]
    },
    {
        "word": "Majburiy Sugʻurta",
        "type": [],
        "definition": [
            "sug'urta munosabatlarining qonun kuchiga ega bo'Igan shakli. Majburiy sug'urta qonunchilik hujjadari asosida amalga oshiriladi. Ushbu hujjatda sug'urtaga tortiladigan obyektlar soni, sug'urta javobgarligining hajmi, sug'urta munosabatlarida qatnashadigan tomonlarning huquq va majburiyatlari hamda boshqa rekvizitlar ko'rsatiladi. Amaldagi qonunchilikka asosan, O'zbekistonda majburiy sug'urtani tegishli litsenziyaga ega bo'Igan har qanday sug'urta kompaniyasi o'tkazishi mumkin."
        ]
    },
    {
        "word": "Majburiy Toʻlov",
        "type": [],
        "definition": [
            "egasining roziligisiz hisob-kitob schyotidan pul mablag'ining o'tkazilishi. Masalan, majburiy to'lovlariga; davlat budjetiga, davlat ijtimoiy sug'urtasiga to'lov, sug'urta to'lovlari va boshqa belgilangan qoidalarga asosan to'lovlar kiradi"
        ]
    },
    {
        "word": "Majburiy Zaxira (Rezerv)Lar",
        "type": [],
        "definition": [
            "qarang: bank rezervlari. Majburiy bank rezervlarining me’yorini o'zgartirish siyosati - pul-kredit siyosati vositalaridan biri. Majburiy bank rezervlarining me’yori Markaziy bank tomonidan belgilanadi va o'zgartiriladi. Agar u kamaytirilsa, ortiqcha bank rezervlari ortadi, bu esa pul taklifining multiplikatsion ortishiga olib keladi. Majburiy bank rezervlari me’yorini ko'tarish yordamida davlat pul taklifini kamaytiradi, zero, banklarning ortiqcha bank rezervlari qisqarishi pul miqdorining kamayishiga olib keladi."
        ]
    },
    {
        "word": "Majburiy Zaxiralar Siyosati",
        "type": [],
        "definition": [
            "tijorat banklari jalb qilgan mablag'lar ma’lum bir qismining Markaziy bankning zaxira fondiga o'tkazilishidir."
        ]
    },
    {
        "word": "Majburiyat",
        "type": [],
        "definition": [
            "majburiyat, va’da, vazifa, burch, tilxat; shartnoma bilan rasmiylashtirilgan fuqarolik huquqiy munosabatlar"
        ]
    },
    {
        "word": "Mak-Kullox Jon Ramsey",
        "type": [],
        "definition": [
            "ingliz olimi, Maltusni qo'llagan, mehnat bilan birga kapital ham boylik yaratishda ishtirok etadi, degan fikrni ilgari surgan."
        ]
    },
    {
        "word": "Makler",
        "type": [],
        "definition": [
            "vositachi, u fond va valyuta birjasi bitimlarini tuzishda qatnashadi, operatsiyalarni mij oz hisobiga amalga oshiradi va bitim summasidan ma’lum miqdorda mukofot (ulush) oladi."
        ]
    },
    {
        "word": "Makroiqtisodiy Koʻrsatkichlar",
        "type": [],
        "definition": [
            "mamlakat yaxlit iqtisodiyoti darajasidagi ijtimoiy-iqtisodiy jarayon va hodisalarni o‘ lchash hamda baholash imkoniyatini beruvchi ko‘rsatkichlar. Masalan, yalpi ichki mahsulot, milliy daromad, iqtisodiy o'sish, ishsizlik, inflyatsiya darajasi va boshqalar."
        ]
    },
    {
        "word": "Makroiqtisodiy Muvozanat",
        "type": [],
        "definition": [
            "iqtisodiyot turli tomonlarining o'zaro tengligi bo'lib, eng awalo, yalpi talab va yalpi taklifning tengligi orqali namoyon bo'ladi."
        ]
    },
    {
        "word": "Makroiqtisodiy Muvozanatning Keynscha Modeli",
        "type": [],
        "definition": [
            "narxlar darajasi o'zgarmas bo'lgan sharoitda jami sarflar va real yalpi milliy mahsulot o'rtasidagi o'zaro bog'liqlikni aks ettiruvchi model (Qarang: Keynsancha iqtisodiy nazariya, Keyns D.)."
        ]
    },
    {
        "word": "Makroiqtisodiy Tahlil",
        "type": [],
        "definition": [
            "makroiqtisodiy tahlilda jamiyat miqyosida yuz beradigan iqtisodiy jarayonlarning kechishi harakati tahlil etiladi. Makroiqtisodiy tahlilda iqtisodiyotda o'ziga xos bo'lgan faoliyat ko'rsatish va rivojlanish qonuniyatlariga ega bo'lgan xususiy, davlat va boshqa xo'jalik yurituvchi subyektlarni ishsizlik, inflyatsiya, moliya-kredit tizimi, iqtisodiy o'sish kabi muammolari bitta turkum sifatida olib o'rganiladi."
        ]
    },
    {
        "word": "Makroiqtisodiyot",
        "type": [],
        "definition": [
            "(grek. “macros” - katta va iqtisodiyot ma’nosini bildiradi) - u davlat iqtisodiyotiga bog'liq bolib, iqtisodiy voqelikva jarayonni o'rganadi. Asosiy maqsadi va muammolari quyidagi asosiy yo'nalishlarni qamrab oladi: yuqori darajada ijtimoiy mahsulot o'sishi, ish bilan bandlikni yuqori darajada ta’minlash, narxlarni muvofiq darajada bo'lish, eksport va importni muvofiqlashtirish. Makroiqtisodiyotning o'rganuvchi obyekti hamma xo'jaliklar bo'yicha umumlashgan ko'rsatkichlar, jumladan, milliy boylik, yalpi milliy mahsulot, yalpi ichki mahsulot, milliy daromad, umumlashgan davlat va xususiy investitsiyalar, umumiy pul miqdori va ularning aylanishi hisoblanadi. Shu bilan birga, makroiqtisodiyot mamlakat miqyosida o'rtacha daromad, o'rtacha ish haqi, inflyatsiya darajasi, ishsizlik, ish bilan ta’minlanganlik, mehnat unumdorligini ham o'rganadi. Makroiqtisodiyotning predmeti mamlakat iqtisodiyotini tavsiflovchi umumlashgan iqtisodiy o'sish, uning ko'payishi yoki kamayishi, iqtisodiy jarayonlar va ularning tarkibiy nisbatlari hisoblanadi"
        ]
    },
    {
        "word": "Makro-Marketing",
        "type": [],
        "definition": [
            "mamlakatning jami xo'jaligi miqyosida mahsulotlarni yaratish va uning pirovard iste’molchiga tomon harakati jarayonida qatnashadigan faoliyat va muassasalarni birlashtiradigan tizim."
        ]
    },
    {
        "word": "Makromoliya",
        "type": [],
        "definition": [
            "davlat, mamlakat miqyosidagi moliya aloqalaridan iborat."
        ]
    },
    {
        "word": "Makromuhit",
        "type": [],
        "definition": [
            "firmaning marketing muhiti tarkibiy qismi, ijtimoiy jihatdan mikromuhitga tasir ko'rsatuvchi kuchlarga qaraganda keng ifodalanuvchi omillar, masalan, demografik, iqtisodiy, tabiiy, texnik, siyosiy va madaniy omillar."
        ]
    },
    {
        "word": "Makro-Talab",
        "type": [],
        "definition": [
            "talabning nisbatan katta miqyosda, yirik hajm, keng ko'lam, ko'p tovarlar bo'yicha yaxlit ko'rinishi"
        ]
    },
    {
        "word": "Maksimal Narx",
        "type": [],
        "definition": [
            "aniq tovar narxining eng yuqori chegarasi"
        ]
    },
    {
        "word": "Malaka",
        "type": [],
        "definition": [
            "shaxsning o'zi egallagan bilimlari asosida ularning yangi sharoitdagi yangiliklar bilan birga, ma’lum bir faoliyatni samarali bajarish qobiliyatidir."
        ]
    },
    {
        "word": "Malaka Amaliyoti",
        "type": [],
        "definition": [
            "o'quv jarayonining nazariy bilimlarni mustahkamlash, amaliyko'nikma, o'quvrejalari vafan dasturlarining ma’lum (yakuniy) qismidagi mavzu bo'yicha materiallar to'plash uchun o'tkaziladigan bir qismi."
        ]
    },
    {
        "word": "Malaka Talablari",
        "type": [],
        "definition": [
            "uzluksiz ta’lim tegishli bosqichi bitiruvchisining umumiy bilim va kasb tayyorgarligi darajasiga qo'yiladigan talablar"
        ]
    },
    {
        "word": "Maltus Tomas Robert",
        "type": [],
        "definition": [
            "(1766-1834) - ingliz iqtisodchisi, “Nufus nazariyasi”, “Tuproq unumdorligining pasayib borishi qonuni” asarlari muallifi. Uningcha, aholi geometrik, nozne’matlar esa arifmetik progressiya asosida o'sib boradi. Oqibatda qashshoqlikning sababi aholi soniga bog'liq deb ko'rsatiladi. Maltus aholi sonining o'sishini cheklash tarafdori bo'lgan."
        ]
    },
    {
        "word": "Mamlakat Iqtisodiyotining Raqobatbardoshliligi",
        "type": [],
        "definition": [
            "mamlakatning o'rta va uzoq muddatga iqtisodiy o'sishning yuqori sur’atlarini ta’minlab turish qobiliyati"
        ]
    },
    {
        "word": "Mamlakat Tashqi Iqtisodiy Aloqalarining Rivojlanishi",
        "type": [],
        "definition": [
            "uning tabiiy, iqtisodiy hamda geografik jihatlari bilan uzviy bog'liq."
        ]
    },
    {
        "word": "Mamlakat Toʻlov Balansi",
        "type": [],
        "definition": [
            "mamlakat rezidentlari (uy xo'jaliklari, korxonalar va davlat) va chet elliklar o'rtasida ma’lum vaqt (odatda, biryil) oralig'ida amalga oshirilganbarchaiqtisodiybitimlarbo'yicha to'lovlar svmunasining nisbati bo'lib, u o'z ichiga savdo balansi, xizmatlar balansi, o'tkazmalar balansi va kapital operatsiyalarni oladi."
        ]
    },
    {
        "word": "Mamlakatning Eksport Salohiyati",
        "type": [],
        "definition": [
            "muayyan mamlakatning o'zida mavjud bo'Igan yoki ishlab chiqarilayotgan resurslari, mahsulotlarini eksportga chiqarish imkoniyati, qobiliyati. MAMLAKATNING IQTISODIY HUDUDI - shu mamlakat hukumati tomonidan boshqariladigan hudud bo'lib, uning chegarasida fuqarolar, tovarlar va kapitallar erkin harakat qila oladi."
        ]
    },
    {
        "word": "Mamlakatning Oltin Xazinasi",
        "type": [],
        "definition": [
            "asosan, xalqaro hisoblarni ta’minlash uchun mo'ljallangan markaziy bankda turadigan oltin fond jamg'armasi"
        ]
    },
    {
        "word": "Mansipatsiya",
        "type": [],
        "definition": [
            "sotib olingan buyumni mulk qilib berish."
        ]
    },
    {
        "word": "Manufaktura",
        "type": [],
        "definition": [
            "ital. “qo'l mahsuloti” degan ma’noni bildirib, mehnat taqsimoti, qo'l hunarmandchiligi va yollanma mehnatga asoslangan oddiy kapitalistik kooperatsiyadan keyingi ikkinchi bosqich. XVI asrning o'rtalarida paydo bo'ldi, sanoat to'ntarilishiga, ya’ni fabrikaga zamin tayyorladi. A. Smit tomonidan eng mukammal korxona turi deb hisoblangan."
        ]
    },
    {
        "word": "Maqsad",
        "type": [],
        "definition": [
            "bo'lg'usi natijalar haqida har doim aqlan o'ylab ko'rilgan, rivojlantirilgan xayoliy tasawurlar, kelgusidagi rejalar."
        ]
    },
    {
        "word": "Maqsadlar Dilemmasi",
        "type": [],
        "definition": [
            "davlatning, moliya muassasalarining bir vaqtning o'zida muomaladagi pullar massasi va foiz stavkalari darajasini barqarorlashtira ololmasligi natijasida yuzaga keladigan muammo"
        ]
    },
    {
        "word": "Maqsadli Ajratmalar",
        "type": [],
        "definition": [
            "nobudjet fondlarning daromadlar qismini shakllantiradi. Bu ajratmalarning manbayi ishlab chiqarilgan (yaratilgan) yalpi ichki mahsulot bo'lib, uning hisobidan birlamchi daromadlarni shakllantirish jarayonida ijtimoiy maqsadlar uchun nobudjet fondlarga, mehnat haqi fondiga bog'langan va mahsulot tannarxining tarkibiga kiritiladigan to'Iovlarning tegishli qismi tarkib topadi: pensiya fondiga, majburiy tibbiyot sug'urtasi fondiga va h.k."
        ]
    },
    {
        "word": "Maqsadli Bozor",
        "type": [],
        "definition": [
            "u yoki bu mahsulotni sotish bozorini tadqiq etish natijasida tanlangan, marketing xarajatlarining minimalligi bilan tavsiflanuvchi va firma faoliyati natijalarining asosiy ulushi (qismi) ni ta’minlovchi bozor."
        ]
    },
    {
        "word": "Maqsadli Budjetdan Tashqari (Nobudjet) Fondlar",
        "type": [],
        "definition": [
            "qarang: budjetdan tashqari (nobudjet) fondlar."
        ]
    },
    {
        "word": "Maqsadli Fondlar",
        "type": [],
        "definition": [
            "moliya tizimining muhim tizimlaridan biri bo'lib, markaziy va mahalliy o‘z-o‘zini boshqarish organlari ixtiyoridagi va ma’lum maqsadga yo'naltirilgan pul resurslari yig'indisidir"
        ]
    },
    {
        "word": "Maqsadli Soliq Imtiyozlari",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyekt tomonidan davlatning maqsadli ijtimoiy, iqtisodiy, investitsion va boshqa dasturlari bajarilganligi uchun soliqqa tortish hajmining pasaytirilishi. Investitsion soliq kreditidan farqli ravishda o'zaro manfaatdorlik (o'zaro foydalilik) asosida mintaqaviy budjetga borib tushuvchi soliq summalari doirasida ijroiya hokimiyati organlari tomonidan har qanday korxonaga berilishi mumkin."
        ]
    },
    {
        "word": "Maqsadli Xorijiy Kredit",
        "type": [],
        "definition": [
            "loyihalaming maqsadlariga muvofiq ravishda tovarlar, ishlar va xizmatlarning haqini to'lash yo'li bilan mablag'larni xorijiy valyutada qaytarish va tiklash asosida taqdim etilishini ko'zda tutgan holda hukumatning tashqi qarz olish davlat dasturiga kiritilgan loyihalarini moliyalashtirish shakli. Ular xorijiy davlatlaming hukumatlari, banklari va firmalarining kreditlariga bog'langan kreditlar hamda xalqaro moliyaviy tashkilotlarning nomoliyaviy kreditlarini qamrab oladi."
        ]
    },
    {
        "word": "Marja",
        "type": [],
        "definition": [
            "bitim qatnashchilari olishlari mumkin bo'lgan daromadlar hajmini belgilovchi miqdor. Mohiyatan marja xaridor va sotuvchi narxlari o'rtasidagi farqni bildiradi. Marja savdo, birja, sug'urta va bank amaliyotida tovarlar narxi, valyuta va qimmatbaho qog'ozlar kursi, foiz stavkalari va boshqa ko'rsatkichlar farqini ifodalash uchun ishlatiladigan atama."
        ]
    },
    {
        "word": "Marjinal Daromad",
        "type": [],
        "definition": [
            "direkt-kosting tizimida ishlab chiqarilgan mahsulot va buyumning tannarxini hisoblash usulini qo'llashda ushbu mahsulotni sotishdan olingan daromadning summasidan o'zgaruvchan xarajatlarni qo'shgan holda hisoblangan mahsulotning tannarxi chegirilgandan qolgan summa."
        ]
    },
    {
        "word": "Marjinal Daromad Usuli",
        "type": [],
        "definition": [
            "mahsulotlarni sotishdan olingan daromad va ushbu mahsulotlarni ishlab chiqarishda sarflangan o'zgaruvchan xarajatlar farqiga asoslangan tenglik usulining turi."
        ]
    },
    {
        "word": "Marjinal Xarajatlar Va Daromadlar",
        "type": [],
        "definition": [
            "ishlab chiqarilgan birlik mahsulotga tegishli qo'shimcha xarajatlar va daromadlar"
        ]
    },
    {
        "word": "Marjinalizm",
        "type": [],
        "definition": [
            "fran. “chegaraviy” ma’nosidagi so'zdan olingan, XIX asming 70-yillari Jevons, Menger, Valraslar tomonidan ochilgan iqtisodiyotning metodologik prinsiplaridan biri, iqtisodiy hodisalarni tahlil etishda eng chekka ko'rsatkichlarga suyanadi. Iste’molni ishlab chiqarishdan ustun qo'yadi. Qiymatning mehnat nazariyasi inkor etiladi. Avstriya maktabi vakillari tomonidan qo'llanilgan. XIX asrning o'rtalarida fransuz iqtisodchisi Kurno (1821-1877), nemis iqtisodchilari Tyunen (1783-1850), Gossen (1810-1858) birinchi bo'lib marjinal tahlilni iqtisodiy nazariyaga joriy etishga uringan. Uning kategoriyalari: qimmat, eng yuqori, chegaralangan naf, noyoblik, ishlab chiqarishning eng yuqori unumdorligi va boshqalar. Marjinalizmning dastlabki vakillari K. Menger, F. Vnzer va boshqalar bo'lib, „sof nazariya” tarafdorlari sifatida, yangi iqtisodiy voqealar, hodisalar va jarayonlarga yangicha qarashlar, ularni amaliyotga kiritish bilan, klassik iqtisodiy nazariya va markscha iqtisodiy ta’limotning sinfiy shakli, mafkura pardasini olib tashlab, ulardagi ijobiy tomonlarni saqlab qolgan holda yangi iqtisodiy tizim nazariyasini yaratdilar."
        ]
    },
    {
        "word": "Marka",
        "type": [],
        "definition": [
            "bitta sotuvchi yoki sotuvchilar guruhi tomonidan belgilangan, tovar va xizmatlarni ajratish uchun mo'ljallangan, nom, atama, belgi, rasm yoki ularning uyushmasi. Marka belgilari: marka nomlari, marka belgilari, tovar belgisi, mualliflik huquqi. Marka nomlari eslatib qolish, sotuvlar, imijni shakllantirish, joy egallash, reklama funksiyalarini bajarishi lozim."
        ]
    },
    {
        "word": "Markaziy (Emission) Bank",
        "type": [],
        "definition": [
            "davlat banki bo'lib, mohiyatan “bankirlar banki” hisoblanadi. U davlatning butun iqtisodiy siyosatini tartibga solishda pul muomalasini pul emissiyasi vositasida boshqaradi. Markaziy bank boshqa barcha banklar va pul muassasalari faoliyatini ham moliyalashtirish, ham tartibga solish orqali boshqarib turadi. Umuman, u mamlakatning barcha pul-kredit tizimini boshqaruvchi, pul birliklarini muomalaga chiqarish va ularni muomaladan qaytarib olish bo'yicha yagona, ya’ni monopol huquqqa ega bo'lgan bankdir"
        ]
    },
    {
        "word": "Markaziy Davlat Muassasalari",
        "type": [],
        "definition": [
            "kichik sektor markaziy hukumat institutsion birliklari hamda markaziy hukumat nazorat qiluvchi va asosan, moliya bilan ta’minlovchi notijorat tashkilotlardan (NTT) shakllanadi."
        ]
    },
    {
        "word": "Marketing Majmuasi",
        "type": [],
        "definition": [
            "marketing retsepti, undan foydalanish korxonaga maqsadli bozorlar ehtiyojlarini qondirish va atrof-muhitdagi o'zgarishlarga moslashishda eng yaxshi ko'rsatkichlarga erishishga imkon beradi. Eng sodda marketing retsepti tovar, narx, savdo va kommunikatsiya siyosati sohasida (4P: Product, Price, Plase, Promotion) muvofiqlashtirilgan chora-tadbirlar o'tkazishni talab qiladi."
        ]
    },
    {
        "word": "Marketing Modellari",
        "type": [],
        "definition": [
            "l) foyda olish yoki uni o'stirish maqsadida tovar va xizmatlarga talabni yaratish va takror ishlab chiqarish bo'yicha o'zaro aloqalar jarayonida marketing tizimi subyektlari xulq-atvorini ko'rsatish, sifat va sonlar jihatidan aks ettirish shakli; 2) marketing tizimini loyihalashtirish, rejalashtirish, tashkil etish, faoliyat ko'rsatish va rivojlanishda marketing muhiti hamda subyektlarining funksional, sabab-oqibat va resurs aloqalarini ifodalovchi va aks ettiruvchi (imitasiya, regressiya, korrelyasiya va h.k.) modellar majmuyi; 3) marketing-miks yoki uning tarkibiy qismlari modellari (tovar siyosati modeli, narx hosil bo'lish modeli, reklama modeli va h.k.)."
        ]
    },
    {
        "word": "Marketing Nazorati",
        "type": [],
        "definition": [
            "strategik va marketing rejalarining bajarilish natijalarini o'lchash, tahlil qilish va ularga zaruriy o'zgartirishlar kiritish jarayoni."
        ]
    },
    {
        "word": "Marketingning Oʻzaro Aloqalari",
        "type": [],
        "definition": [
            "l) xizmat ko'rsatish tadbirkorligining tovar hayotiylik davrining har bir bosqichida barcha bozor subyektlari bilan aloqalarni rejalashtirish, tashkil etish va boshqarish jarayonida barcha faoliyat turlari va resurslarni qamrab olishga yo'naltirilgan istiqbolli konsepsiya. Mijoz bilan uzoq muddatli o'zaro munosabatlarga va bitimda ishtirok etuvchi tomonlar maqsadlarini qondirishga yo'naltirilgan konsepsiya; 2) bajarish mas’uliyatini taqsimlash va kengaytirish tamoyillari bo'yicha marketingni tashkil etish usuli."
        ]
    },
    {
        "word": "Marketing Operatsiyalari Tadqiqoti",
        "type": [],
        "definition": [
            "l) marketing qarorlarini ishlab chiqish va qabul qilish tizimida foydalaniluvchi usullar (matematik dasturlashtirish, o'yinlar nazariyasi, qarorlar nazariyasi, tasvirlarni tanib olish nazariyasi va hokazo) yig'indisi; 2) boshqa usullar yordamida bundan ham yomon javob beriladigan amaliy savollarga yomon javob berish san’ati."
        ]
    },
    {
        "word": "Marketing Prinsiplari (Tamoyillari)",
        "type": [],
        "definition": [
            "bozorni bilish, bozorga moslashish va bozorga ta’sir o'tkazish."
        ]
    },
    {
        "word": "Marketing Qarori",
        "type": [],
        "definition": [
            "l) istemolchilarning tovar va xizmatlarga talabini barqaror shakllantirish, rivojlantirish va qondirish uchun zarur bo'Igan marketing tadbiri yoki tadbirlari majmuyi, variantlar ichidagi tanlash, javob; 2) firma, tovar va xizmatlarning raqobatchilik ustunligini saqlab qolish yoki yaxshilash uchun marketing tizimi subyekt va obyektlariga maqsadli yo'naltirilgan ta sir ko'rsatish."
        ]
    },
    {
        "word": "Marketing Qarori Qabul Qilishning Samaradorligi",
        "type": [],
        "definition": [
            "l) marketing vazifasinibajarishningko'rib chiqilayotgan (kutilayotgan) ko'plab variantlari orasidan tanlab olishda iqtisodiy tavakkalchilik narxining natijasi, foydalilik ko'rsatkichi; 2) marketing vazifasini bajarishning tanlab olingan variantining iqtisodiy samara keltirish qobiliyati."
        ]
    },
    {
        "word": "Marketing Rejasi",
        "type": [],
        "definition": [
            "belgilangan marketing maqsadlariga erishishda yordam berishi kutilayotgan chora-tadbirlarning ketma-ketlikda detalli ravishda ifodalanishi."
        ]
    },
    {
        "word": "Marketing Salohiyati",
        "type": [],
        "definition": [
            "l) korxona salohiyatining ajralmas qismi; 2) tovar, narx, kommunikatsiya va savdo siyosati, talabni o'rganish sohasida samarali marketing tadbirlarini rejalashtirish va o'tkazish hisobiga marketing tizimining doimiy raqobatbardoshligi, tovar va xizmatlarning bozordagi iqtisodiy va ijtimoiy konyunkturasini ta'minlash qobiliyatlari majmuyi."
        ]
    },
    {
        "word": "Marketing Strategiyasi",
        "type": [],
        "definition": [
            "iste’molchilami jalb etish, ularning ehtiyojini qondirish va o'z maqsadiga erishish uchun marketing kompleksini qo'llash tartibi"
        ]
    },
    {
        "word": "Marketing Strategiyasini Ishlab Chiqish",
        "type": [],
        "definition": [
            "maqbul topilgan tovar g'oyasi asosida dastlabki marketing strategiyasini yaratish."
        ]
    },
    {
        "word": "Marketing Tadqiqoti",
        "type": [],
        "definition": [
            "firma oldida turgan marketing vaziyati bilan bog'liq hamda to'plash, tahlil qilish va natijalar hisobotini tuzish uchun zarur bo'Igan ma’lumotlar doirasini tizimli ravishda aniqlash."
        ]
    },
    {
        "word": "Marketing Tadqiqoti Dizayni",
        "type": [],
        "definition": [
            "l) marketing tadqiqoti jarayoni va modelini loyihalashtirish va tuzish; tadqiqotni o'tkazish, marketing axborotlarini izlab topish uchun ratsional rejalami ishlab chiqish. Qo'lda yoki axborot texnologiyalari yordamida amalga oshirilishi mumkin; 2) marketing tadqiqoti subyektlari xulq-atvorining o'zgarish holatlarini o'rganish va bashorat qilish bo'yicha ijodiy jarayon."
        ]
    },
    {
        "word": "Marketing Tad Qiqotl Ari",
        "type": [],
        "definition": [
            "moddiy boyliklar va xizmatlar muomalasi sohasida qarorlar qabul qilish hamda ularni nazorat qilish jarayonlarini takomillashtirish maqsadida muntazam ravishda muammolarni tahlil etish, asosiy qoidalarni yaratish va ma’lumotlarni jamg'arish."
        ]
    },
    {
        "word": "Marketing Taftishi",
        "type": [],
        "definition": [
            "korxonaning marketing doirasini atroflicha, sistemali, xohs va muntazam tadqiq etish"
        ]
    },
    {
        "word": "Marketing Taktikasi",
        "type": [],
        "definition": [
            "strategik maqsadlarga erishish uchun marketingning aniq yo'naltirilgan amaliyoti."
        ]
    },
    {
        "word": "Marketing Tizimi",
        "type": [],
        "definition": [
            "bozor muhitining mustaqil, foyda olish maqsadida tovar va xizmatlarga talabni shakllantirish va rivojlantirish bo'yicha o'zaro uzluksiz aloqada bo'luvchi ijtimoiy-iqtisodiy elementlar majmuyi. Marketing tizimi o'z ichiga quyidagilarni oladi: ishlab chiqaruvchi firma, ta’minotchi firma, raqobatchi firma, vositachi firma, iste’molchi (bozor)"
        ]
    },
    {
        "word": "Marketing Tizimini Axborot Bilan Taʼminlash",
        "type": [],
        "definition": [
            "l) marketing hujjatlarini rasmiylashtirish usullari va vositalari majmuasi, marketing tizimining holati va xulq-atvori to'g'risidagi ma’lumotlarni izlab topish, kodlashtirish va saqlashni tashkil etish; 2) marketing tizimining normal faoliyat ko'rsatishini ta’minlovchi quyi tizimlardan biri (tashkiliy, huquqiy, iqtisodiy, texnik, dasturiy, matematikta’minotvaboshqalar); 3) marketingaxborotlarimanbayi, uning asosida korxona menejmenti turli xil boshqaruv qarorlarini qabul qiladi; 4) ma’lumotlarni olish, ishlov berish, tizimlashtirish va ularni “iste’mol uchun tayyor” axborotga aylantirish"
        ]
    },
    {
        "word": "Marketing Tizimining Samaradorligi",
        "type": [],
        "definition": [
            "l) marketing tizimining marketing xarajatlari belgilab qo'yilgan holda tovar va xizmatlarga talabni takror ishlab chiqarishni to'xtovsiz shakllantirish jarayonini ta’minlash qobiliyati ko'rsatkichi; 2) marketing tizimi faoliyatining sifat ko'rsatkichi; 3) marketing tizimi subyektlarining resurslar ayirboshlash jarayonida o'zaro aloqalari natijaviyligining kompleks ko'rsatkichi."
        ]
    },
    {
        "word": "Marketing Xarajatlari",
        "type": [],
        "definition": [
            "tovar va xizmatlarni shakllantirish hamda takror ishlab chiqarish bo'yicha marketing chora-tadbirlari va marketing faoliyatini amalga oshirish uchun zarur bo'lgan sarf va chiqimlar yig'indisi. Marketing xarajatlarining asosiy tarkibiy qismlari: boshqaruv xarajatlari, marketing bo'limi xodimlari maoshi, amortizatsion ajratmalar, marketing bo'limining normal faoliyat ko'rsatishi uchun zarur bo'lgan material va resurslar, tovar siyosati, narx siyosati, kommunikativ siyosat, savdo va distributiv siyosat uchun sarflanuvchi xarajatlar"
        ]
    },
    {
        "word": "Marketin Gda Tarmoq, Yondashuvi",
        "type": [],
        "definition": [
            "marketing tizimi subyektlarining faqat ikki tomonlama (xaridor va sotuvchi) emas, balki ko'p tomonlama o'zaro aloqalari jarayonini aks ettirish konsepsiyasi. Tarmoq yondashuvi na sotuvchilar va na xaridorlar o'zlariga hamkorni tanlash va ularni almashtirishda erkin emas, chunki resurslar o'zgarganda ularning bir-biriga qaramligi yuzaga keladi, ya’ni aloqalar almashuvi buziladi. Marketing tarmog'i a’zolari o'rtasida resurslar ayirboshlash “qaramlik” va “hokimlik” manbayi hisoblanadi. Marketing tarmog'i uchta o'zaro bog'liq tarkibiy qismdan iborat: ishtirokchilar (firmalar), resurslar va faoliyat turlari. Tarmoq yondashuvi resurslarning turli xilligi va ularni ierarxik nazorat qilishni talab qiladi."
        ]
    },
    {
        "word": "Marketingni Boshqarish",
        "type": [],
        "definition": [
            "korxona maqsadlariga erishishi uchun ahamiyatli xaridorlar bilan foydali ayriboshlovlarni o'rnatish, mustahkamlash va qo'llab-quwatlash yuzasidan qilingan tahlil, rejalashtirish, tatbiq qilish va tadbirlar bajarilishini nazorat qilish harakatlari. Marketingni boshqarish jarayoni quyidagilardan tarkib topgan: l) bozordagi imkoniyatlarni tahlil qilish; 2) maqsadli bozorni tanlab olish; 3) marketing usulini ishlab chiqish;"
        ]
    },
    {
        "word": "Marketingni Rejalashtirish",
        "type": [],
        "definition": [
            "marketing rejasini tuzish, tovarlarni sotish hajmining o'sishi va firma foydasini maksimallashtirishga qaratilgan marketing strategiyasini tanlash bilan bog'liq jarayon"
        ]
    },
    {
        "word": "Marketin Gnin G Tashkiliy Tuzilmalari",
        "type": [],
        "definition": [
            "menejmentning asosiy tamoyillari - markazlashtirish, desentralizatsiya va moslashuvchanlikni modifikatsiya qilishga asoslangan marketing xizmati asosiy bo'linmalarining o'zaro harakatlari sxemasi turlari. Funksional, mahsulot, bozor va matritsa strukturalari hamda ularning modifikatsiyalarini ajratib ko'rsatish mumkin."
        ]
    },
    {
        "word": "Market-Meyker",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarga doir narxlar, talab va taklif darajasini saqlab turish uchun birja bitimlarini tuzish majburiyatini o'z zimmasiga olgan investitsiya vositachisi"
        ]
    },
    {
        "word": "Marks Karl Genrix",
        "type": [],
        "definition": [
            "(1818-1883) - nemis olimi. Tarixni tushunishga iqtisodiy yondashuv qoidasini yoqlab, kapitalistik ishlab chiqarish usulining rivojlanishini chuqur va keng tahlil qilgan. Mehnat, qiymat nazariyasiga asoslanib, XIX asrning ikkinchi yarmidagi iqtisodiyotni, unga xos tendensiyalarni tahlil qilib, qo'shimcha qiymat nazariyasini yaratgan. Uning asosida mehnatni ekspluatatsiya qilish qoidasi yotadi. U iqtisodiyot fanining prinsipial muammolariga, xususan, fanning mavzusi, kapitalizmning ishlab chiqarish munosabatlari tizimi, bir formatsiyadan ikkinchi formatsiyaga o'tish kabi muammolariga original talqin bergan. 4 tomdan iborat “Kapital” asari muallifi."
        ]
    },
    {
        "word": "Marshal Alfred",
        "type": [],
        "definition": [
            "(1842-1924) - angliyalik iqtisodchi. Kembrij maktabi va narx (talab va taklif) nazariyasi asoschisi. Uning “Siyosiy iqtisod prinsiplari” (1890) darsligi yarim asr davomida XX asrning 40-yillarigacha iqtisodiy ta’lim asosi bo'lib kelgan. A. Marshal nazariyasiga binoan, iqtisodiy jarayonlar narx talab va taklif asosida, ya’ni me’yoriy naflilik hamda me’yoriy xarajatlar bilan aniqlanadi, shuningdek, qisqa muddatli va uzoq muddatli taklif va talab o'rtasidagi tafovut haqidagi qoida iqtisodiy nazariyaga Marshal tomonidan kiritilgan."
        ]
    },
    {
        "word": "Marshall Xochi",
        "type": [],
        "definition": [
            "talab va taklif egri chiziqlarining kesishganligini ko'rsatadi. Kesishgan nuqta ularning muvozanati hamda turg'un bahosini ifodalaydi."
        ]
    },
    {
        "word": "Martaba",
        "type": [],
        "definition": [
            "insonning ish bilan bog'liq yillari mobaynida mehnat tajribasi va faoliyatiga taalluqli, alohida anglab yetilgan nuqtayi nazari va xulq-atvoridir (egallagan lavozimlaridagi, ish o'rinlaridagi izchillik, mehnat tashkilotidagi mavqeyining ahvoli)."
        ]
    },
    {
        "word": "Masʼuliyat",
        "type": [],
        "definition": [
            "zimmasiga yuklatiladigan vakolatlarning amalda bajarilishi oqibatlari, bajarilgan ishlarning pirovard natijasini baholashning mezoni va shakliy ifodasi; boshqaruvni tashkil etish prinsipi."
        ]
    },
    {
        "word": "Masʼuliyat Markazi",
        "type": [],
        "definition": [
            "ish faoliyati natijasi uchun rahbari javob beradigan tegishli subyektning tarkibiy bo'linmalari."
        ]
    },
    {
        "word": "Masshtab Samarasi",
        "type": [],
        "definition": [
            "ishlab chiqarish masshtabining kengayishi surati bilan mahsulot ishlab chiqarishning o'sish sur’ati o'rtasidagi bog'liqlikni ifodalaydi. Ishlab chiqarishda foydalaniladigan omillar miqdoriga ishlab chiqarish masshtabi deyiladi"
        ]
    },
    {
        "word": "Masʼuliyati Cheklangan Jamiyat",
        "type": [],
        "definition": [
            "o'z mulki chegarasida majburiyatlarga javobgar bo'Igan, qismlarga bo'lingan ustav fondiga ega bo'Igan ta’sis hujjati bilan belgilangan aksioner jamiyat turi. Jamiyat a’zolari mablag‘i jamiyat roziligi bilan boshqa shaxsga berilishi mumkin."
        ]
    },
    {
        "word": "Materiallar",
        "type": [],
        "definition": [
            "ishlab chiqarish moddiy sharoitlaridan biri, ya’ni mehnat buyumlari. Ishlab chiqarilayotgan mahsulotning asosini materiallar tashkil qiladi. Asosiy vositalardan farq qilib, materiallar bir ishlab chiqarish jarayonida o'z qiymatini to'la ravishda mahsulot tannarxiga o'tkazadi."
        ]
    },
    {
        "word": "Materiallardan Foydalanish Koeffitsiyenti",
        "type": [],
        "definition": [
            "xomashyo va materiallarning oqilona tarzda sarflanishini tavsiflovchi ko'rsatkich. Tayyor mahsulot tarkibiga kiruvchi materiallarning ishlov berilgan materiallar umumiy hajmiga nisbati sifatida hisoblanadi."
        ]
    },
    {
        "word": "Materiallarni Baholash Usullari",
        "type": [],
        "definition": [
            "ishlab chiqarishga yoziladigan ishlab chiqarish zaxiralarining haqiqiy tannarxini aniqlash ularni baholashning quyidagi usullarini qo'llash bilan amalga oshiriladi: l) o'rtacha tannarx bo'yicha; 2) o'rtacha chamalangan baholar bo'yicha, birinchi tushum - birinchi xarajat, FIFO; 3) o'rtacha chamalangan baholar bo'yicha, oxirgi tushum - oxirgi xarajat, LIFO. Materiallarni baholashning birinchi usulida, hisobot oyi davomida sarflangan materiallar ishlab chiqarish xarajatlari schyotlariga odatdagidek, joriy baho bo'yicha yoziladi. Hisobot oyi oxirida haqiqiy tannarx bilan joriy baho o'rtasidagi farqning tegishli ulushi yoziladi. FIFO va LIFO usullari rivojlangan mamlakatlarda ishlab chiqarish zaxiralarini baholash usullari sifatida ishlab chiqilgan. FIFO usulida birinchi tushum - birinchi xarajat degani shuni bildiradiki, ishlab chiqarishga qaysi materiallar par tiyasi berilishidan qat’i nazar, ishlab chiqarishga birinchi sotib olingan materiallar bahosi bo'yicha baholanadi, so'ngra ikkinchi partiya bahosi bo'yicha va hokazo. LIFO usulida boshqa qoida qo'llaniladi. Bunda oxirgi tushum - oxirgi xarajat, ya’ni materiallar ishlab chiqarishga awal oxirgi partiya tannarxi bo'yicha yoziladi, so'ngra awalgi partiya va hokazo."
        ]
    },
    {
        "word": "Matritsali Loyiha",
        "type": [],
        "definition": [
            "funksional va maxsus loyihalarni o'z ichiga olgan tashkiliy tuzilma. Har bir loyihada har xil funksional bo'linmalar mutaxassislaridan foydalaniladi. Bunda bo'sh menejerlar qaysi masalalar qachon yechilishi kerakligi, funksional menejerlar esa loyihani bajarish uchun mutaxassislardan qay birini jalb etish zarurligi va qanday texnologik usullardan foydalanish maqsadga muvofiqligini hal qiladi"
        ]
    },
    {
        "word": "Matritsali Tarkib",
        "type": [],
        "definition": [
            "matritsa turidagi katakchaiardan tashkil topgan tarkibdir. U o'zini ikki turdagi departamentalizatsiya birlashmasi deb biladi: vazifa va mahsulot bo'yicha."
        ]
    },
    {
        "word": "Mavjud Daromad",
        "type": [],
        "definition": [
            "takror taqsimlanuvchi daromad hisobi (schyoti) dagi balanslantiruvchi modda. Bu modda institutsion birlik yoki birlamchi daromadi qoldig'iga barcha joriy transfertlar (mazkur birlik yoki sektorlarning natura shaklidagi ijtimoiy transferti bunda mustasno)ni qo'shish hamda bu birliklar va sektorlar tomonidan natura shaklida to'lanadigan ijtimoiy transfertlami chegirib tashlash natijasida hosil bo'ladi."
        ]
    },
    {
        "word": "Mavjud Mahsulot",
        "type": [],
        "definition": [
            "o'tgan yoki joriy yil (davr)da ishlab chiqarilgan yoxud import asosida keltirilib, tovardan foydalanuvchiga berilgan mahsulot"
        ]
    },
    {
        "word": "Mavsumiy Narx",
        "type": [],
        "definition": [
            "mavsumiy tovarlarga belgilanadigan narx; o'zgaruvchan narxning bir ko'rinishi"
        ]
    },
    {
        "word": "Mavsumiy Talab",
        "type": [],
        "definition": [
            "iste’mol qilish yaqqol mavsumiy xarakterga ega bo'lgan tovarlarga talab."
        ]
    },
    {
        "word": "Mavsumiy Tebranish",
        "type": [],
        "definition": [
            "ayrim fasl va oylarda ko'p yillik qatorlarda muntazam ravishda kuzatiladigan barqaror tebranishlar."
        ]
    },
    {
        "word": "Maxfiy Kelishuv",
        "type": [],
        "definition": [
            "ochiq kelishuvga kelmasdan, firmalarning mahsulot ishlab chiqarish hajmi va ularning narxi bo'yicha maxfiy kelishib olish bilan bog'liq vaziyat."
        ]
    },
    {
        "word": "Maxsus Auditorlik Topshirigʻi",
        "type": [],
        "definition": [
            "auditorlik tashkiloti bilan tuzilgan shartnomada nazarda tutilgan rasmiy buxgalteriya hisobotidan farqli bo'lgan maxsus hisobotning tekshirish yoki buyurtmachi bilan kelishilgan boshqa tekshirishlarni amalga oshirish. Bunday vazifa buxgalteriya hisobotining alohida maxsus moddalarini tekshirish, mulk holati, kapitaldan foydalanish va xo'jalik yurituvchi subyektning moliyaviy-xo'jalik faoliyati bilan bog'liq bo'lgan boshqa masalalar bo'yicha tekshiruvlar o'tkazishni o'z ichiga olishi mumkin. Maxsus auditorlik vazifasi haqida shartnoma auditorlik tashkiloti va xo'jalik yurituvchi subyekt yoki uning buxgalteriya hisobotidan foydalanuvchi manfaatdor shaxs yoxud davlat organi ishtirokida tuziladi."
        ]
    },
    {
        "word": "Maxsus Bojxona Bojlari",
        "type": [],
        "definition": [
            "bojxona bojlarining ko'rinishlaridan biri bo'lib, agarmamlakatgaolibkirilayotganmahsulotlarshungao'xshash mahsulotlarni ishlab chiqaruvchi mamlakatning o'zidagilarga zarar yetkazadigan bo'lsa, himoya vositasi bo'lib xizmat qiladi. Boshqa mamlakatlarning diskriminatsion harakatlariga nisbatan javob tariqasida ham qo'llanilishi mumkin."
        ]
    },
    {
        "word": "Maxsus Imtiyozli Kreditlash Jamgʻarmasi",
        "type": [],
        "definition": [
            "kichik va o'rta tadbirkorlik subyektlariga imtiyozli kreditlar, shuningdek, mikrokreditlar berish maqsadida tashkil qilingan jamg'armadir. Imtiyozli kredit berish jamg'armasi hisobidan beriladigan mikrokreditlar bo'yicha foiz stavkalari mikrokredit berilgan kundagi Markaziy bankning qayta moliyalash stavkasining 50 foizdan ortiq bo'lmagan miqdorda belgilanad"
        ]
    },
    {
        "word": "Maxsus Iqtisodiy Zona",
        "type": [],
        "definition": [
            "erkin iqtisodiy zonalarning maxsus turi bo'lib, texnologik zonalar deb ataladi. Bu zonalarda yangi texnika va texnologiyani yaratish uchun imtiyozlardan chet el korxonalari, milliy korxonalar, shu jumladan, har xil tashkilotlar ham foydalanadi. Savdo, sanoat, texnologiya ishlari uchun qulayliklar barpo etiladi"
        ]
    },
    {
        "word": "Maxsus Loyiha",
        "type": [],
        "definition": [
            "ma’lum bir doimiy ish bilan shug'ullanuvchi maxsus tashkillashtirilgan odamlar guruhiga asoslangan loyihani amalga oshirishga yo'naltirilgan tashkiliy tizim."
        ]
    },
    {
        "word": "Maxsus Talabli Tovarlar",
        "type": [],
        "definition": [
            "maxsus iste’molchilarga mo'ljallangan, ularning yuqori didi va boy tasawuriga mos xislatlar berib tayyorlangan tovarlar."
        ]
    },
    {
        "word": "Maxsus Zaxiralar",
        "type": [],
        "definition": [
            "zaxiralaming har bir kreditlar bo'yicha tashkil etilgan zaxira summalaridir."
        ]
    },
    {
        "word": "Meʼyoriy Mahsulot",
        "type": [],
        "definition": [
            "bir ishlab chiqarish omili, qo'shimcha birligining sarf qilinishi bilan yaratilgan qo'shimcha mahsulot. Bunda ishlab chiqarishning boshqa omillari o'zgarmasdir. Ishlab chiqarish omillari har qanday narxining asosida me’yoriy mahsulot yotadi"
        ]
    },
    {
        "word": "Meʼyoriy Naflilik",
        "type": [],
        "definition": [
            "har bir keyingi xarid qilinayotgan tovar va xizmatlarning iste’molchi uchun keltiradigan orttirma nafi. Masalan, iste’molchi kutubxonasiga jahon klassiklari kitobini yig'adi. Kutubxonadagi hamma kitoblarning yig'indisi umumiy naflilikni tashkil etadi. U har bir yangi kitobni xarid qilishi bilan ortib boradi. Me’yoriy nafni har bir xarid qilinadigan, aytaylik, Furqat asarlarining navbatdagi kitobini xarid qilishdan kelgan naf tashkil etadi."
        ]
    },
    {
        "word": "Meʼyoriy Naflilikning Pasayib Borish Qonuni",
        "type": [],
        "definition": [
            "xaridor qo'shimcha mahsulotning narxi pasayib borishi sharoitida sotib oladi. Chunki inson mahsulotni sotib olgan sari unga kamroq qoniqish beradi. Faraz qilamizki, iste’molchi kitob yig'moqda. Shaxsiy kutubxonani shakllantirish jarayonida 10 va 100 kitobning nafliligi bir xilda bo'lmaydi. Kutubxonada kitoblarning to'planib borishi ehtiyoji o'tkirligi pasayadi. Shunga muvofiq, yuzinchi kitobning me’yoriy nafliligi 10-kitobga nisbatan past bo'ladi."
        ]
    },
    {
        "word": "Meʼyoriy Tashqi Naflik",
        "type": [],
        "definition": [
            "tovar va xizmatlarni sotuvchi hamda xaridordan tashqari uchinchi taraf oladigan me’yoriy naf"
        ]
    },
    {
        "word": "Meʼyoriy Unumdоrlikning Kamayishi Qonuni",
        "type": [],
        "definition": [
            "mahsulot ishlabchiqarishgasarfqilinadigano‘zgaruvchanomilningqo‘shimcha birligi oldingisiga nisbatan mahsulot hajmining kamroq ortishiga olib keladi. Faraz qilamizki, korxonada dastgohlar va ishchilar bor, ishlab chiqarish bir smenada tashkil qilingan. Endi korxonaga yana qo'shimcha ishchilarni ishga yollab, ishlab chiqarishni ikki smenali, so'ng uch smenali qilib tashkil qiladi. Bunda ishlab chiqarish unumdorligi va korxona daromadliligi oshib boradi. Agarda yana ishchilar yollanadigan bo'lsa, unumdorlik oshmaydi. Doimiy omil hisoblangan dastgohlarning o'z imkoniyatlari tugagan bo'ladi. Unga qo'shimcha resurslarni jalb etish oldingi samarani bermaydi, balki shu vaqtdan boshlab ishlab chiqarishga qo'shimcha sarflar samaradorligi past, mahsulot birligiga sarflar oshib boradi. Agar ishlab chiqarish qurollari (dastgohlar) niyangilasa, yana unumdorlik oshib boradi. Lekin ma’lum vaqt o'tgandan so'ng yuqorida biz qayd qilgan hoi yana qaytariladi. Ushbu qonun qisqa vaqt mobaynida harakat qiladi."
        ]
    },
    {
        "word": "Meʼyoriy Xarajatlar",
        "type": [],
        "definition": [
            "bir qator chegaralanish sharoitlaridan kelib chiqqan holda va subyektning kelgusidagi faoliyatiga yo'naltiradigan xarajatlarning ilmiy asoslangan darajasi."
        ]
    },
    {
        "word": "Meʼyoriy-Texnik Sektor",
        "type": [],
        "definition": [
            "intellektual va sanoat mulkini patentlash hamda huquqiy himoya qilish, bozorda korxona mahsulotlarining raqobat kurashida ustunlikka erishishiga doir tavsiyalar berish."
        ]
    },
    {
        "word": "Meʼyorlashtirilgan To ʼG ʼRi Mehnat Xarajatlari",
        "type": [],
        "definition": [
            "me’yorlashtirilgan mehnat vaqtini birlik mahsulot miqdoriga ko'paytirish natijasida olingan miqdor. Ushbu miqdor me’yor darajasiga ko'paytirish yo'li bilan ham topiladi. Mazkur to'g'ri xarajatlar mahsulotlarning aniq bir turini ishlab chiqarish natijasida ro'yobga chiqadi va uning tannarxiga to'g'ridan-to'g'ri qo'shiladi."
        ]
    },
    {
        "word": "Meʼyorlashtirilgan Umumiy Mehnat Sarflari",
        "type": [],
        "definition": [
            "hisobot davri mobaynida ishlab chiqarilgan mahsulot birligining miqdoridan va birlik tayyor mahsulotga to'g'ri keladigan me’yorlashtirilgan mehnat sarflaridan kelib chiqqan holda aniqlanadigan ko'rsatkich."
        ]
    },
    {
        "word": "Meʼyorlashtirish",
        "type": [],
        "definition": [
            "ishlab chiqarish resurslaridan foydalanishning samaradorligini ta’minlashga yo'naltirilgan muqobil me’yorlar va me’yorlashtirishning ilmiy asoslangan hisoblar jarayoni."
        ]
    },
    {
        "word": "Mediana",
        "type": [],
        "definition": [
            "to'plamni teng ikki qismga bo‘ luvchi belgi qiymatidir"
        ]
    },
    {
        "word": "Mehnat",
        "type": [],
        "definition": [
            "insonning biror-bir maqsadga qaratilgan ongli faoliyati bo'lib, u orqali inson o'z ehtiyojlarini qondirish uchun tabiat in’omlarini o'zgartiradi. Inson mehnati ikki yoqlama xarakterga ega: a) konkret mehnat - tovarning iste’mol qiymatini yaratadigan, biron-bir aniq ko'rinishga ega bo'lgan mehnat turi tushuniladi; b) abstrakt mehnat - tovar qiymatini yaratadi. “Abstrakt” (o'zbektilida “mavhum” degan ma’noni bildiradi) mehnatning aniq shaklidan qat’i nazar, umuman sarflangan ish kuchidir, jami ijtimoiy mehnat sarfidan iborat bo'ladi"
        ]
    },
    {
        "word": "Mehnat Balansi",
        "type": [],
        "definition": [
            "mehnat resurslarining (ish kuchi, ish vaqti) haqiqatda yoki kutilgan va ulardan foydalanish miqdorini aks ettiradi. Mehnat balansida ishchi kuchini qayta ishlab chiqarish, joylashtirish va mehnat resurslarini iste’molga mos ravishda taqsimlashning asosiy jarayonlari haqida ma’Iumotlar ko'rsatiladi."
        ]
    },
    {
        "word": "Mehnat Birjasi",
        "type": [],
        "definition": [
            "doimiy ish joyini yo'qotgan ishsizlarni ro'yxatga olish. Ularga nafaqa to'lash, yangi ish o'mi topib joylashtirish va boshqa kasb-hunarga o'qitishni tashkil etib berish kabi vazifalarni bajaruvchi muassasa. Mehnat birjasining mamlakat bo'yicha bosh boshqarmasi, viloyat va tumanlarda esa bo'limlari mavjud bo'ladi"
        ]
    },
    {
        "word": "Mehnat Birligining Bozor Bahosi",
        "type": [],
        "definition": [
            "ish haqi miqdori (stavkasi) bo'lib, u shartnomada belgilab qo'yiladi va muayyan vaqt birligi ichida bajariladigan hamda muayyan kasb-malaka xususiyatlariga ega bo'lgan mehnatga to'lanadigan haq darajasini belgilab beradi. MEHNAT BOZORI - ish kuchiga talab va taklif asosida bo'lgan munosabat shakllanishi. Mehnat bozori mamlakatdagi ishchi kuchiga bo'lgan talab va uning taklif etilishi o'rtasidagi mutanosiblik nisbatini ifodalaydi. Mehnat bozori shakllanishi mumkin, agarda ishchi kuchi o'z mehnatining egasi bo'Isa. Mehnat bozori orqali ishchi kuchi ma’lum muddatga sotiladi. Ishchi kuchiga bo'lgan talab uning taklifidan ortiq bo'lsa, uning bahosi ko'tariladi yoki aksincha"
        ]
    },
    {
        "word": "Mehnat Bozor1Da Monopsoniya",
        "type": [],
        "definition": [
            "mukammallashgan raqobatdagi mehnat bozorining alohida bir chetki ko'rinishi bo'lib, bunda biror kichik shahardagi yagona firma mahalliy aholining ko'p qismini ish bilan ta’minlaydi."
        ]
    },
    {
        "word": "Mehnat Buyumi",
        "type": [],
        "definition": [
            "moddiy boyliklar ishlab chiqarish maqsadida kishining mehnati yo'naltirilgan buyumlar. Mehnat buyumlariga xomashyo, asosiy materiallar, yarim tayyor mahsulotlar, ta’mirlash uchun ehtiyot qismlar kiradi. Mehnat buyumlari aylanma mablag'larga kirib, mehnat qurollari bilan birga ishlab chiqarish vositalarini tashkil etadi."
        ]
    },
    {
        "word": "Mehnat Buyumlari (Predmetlari)",
        "type": [],
        "definition": [
            "tabiiy moddalar, narsa yoki narsalar jamlanmasi bo'lib, inson o'zining shaxsiy va ishlab chiqarish ehtiyojini qondirish uchun mehnat vositalari yordamida ularga tasir o'tkazadi"
        ]
    },
    {
        "word": "Mehnat Faoliyati",
        "type": [],
        "definition": [
            "insonning biror mehnat turi bilan band bo'lishi tushuniladi."
        ]
    },
    {
        "word": "Mehnat Haqi",
        "type": [],
        "definition": [
            "joriy davrda ish beruvchi tomonidan yollangan xodimga bajargan ishlari uchun berilgan pul yoki natura usulidagi to'lovlar bo'lib, ular hisoblangan summalar yig'indisidan tashkil topadi va ikki qismga bo'linadi: ish haqi va ijtimoiy sug'urtaga ajratmalar."
        ]
    },
    {
        "word": "Mehnat Haqi Xarajatlari",
        "type": [],
        "definition": [
            "asosiy ishlab chiqarish xodimlarining ish haqi mukofotlari, rag'batlantiruvchi va tiklovchi (qoplovchi) to'lanmalar, natural haq sifatida beriladigan mahsulotlarning qiymati, tuzilgan shartnomalar bo'yicha xodimlarga beriladigan mehnat haqi va boshqa to'lanmalarni o'z ichiga oladi."
        ]
    },
    {
        "word": "Mehnat Iqtisodiyoti Va Sotsiologiyasi",
        "type": [],
        "definition": [
            "ish beruvchi va yollanma xodimlarning mehnat jarayonida yuzaga keladigan iqtisodiy va ijtimoiy munosabatlarini ifoda etadigan fan."
        ]
    },
    {
        "word": "Mehnat Jamoasi",
        "type": [],
        "definition": [
            "xodimlarning birgalikda mehnat faoliyatini amalga oshiruvchi birlashmasi"
        ]
    },
    {
        "word": "Mehnat Jarayonida Kadrlarga Oid Yangiliklar",
        "type": [],
        "definition": [
            "yangi texnika va mehnat turlarini o'zlashtirish, kadrlar bilan ishlashning yangi usullari, xodimlarni yangi vazifalarga ko'tarish va ularning o'rnini o'zlashtirish usullari yangi lavozim tavsifnomalari va yo'riqnomalarini ishlab chiqish va shu kabilarni nazarda tutadi"
        ]
    },
    {
        "word": "Mehnat Koʻnikmasi",
        "type": [],
        "definition": [
            "personalning tashkilot bilan o'zaro hamkorligi jarayonida ularning o'zaro moslashuvi"
        ]
    },
    {
        "word": "Mehnat Kooperatsiyasi",
        "type": [],
        "definition": [
            "korxonada biror mahsulot yaratish uchun mehnat qilayotgan ishchilar o'rtasida o'sha mahsulotni ishlab chiqarish uchun bajarilishi zarur bo'lgan ish operatsiyalarining taqsimlangan holda bir-biriga muvofiq ishlashi. Mehnatning kooperatsiyalashuvi mehnat taqsimotini chuqurlashtiradi, ishchilar bir xil ishnigina bajarishga ixtisoslashadilar va natijada mehnat unumdorlgi ortishi ta’minlanadi"
        ]
    },
    {
        "word": "Mehnat Mazmuni",
        "type": [],
        "definition": [
            "ishlarning kasbiy mansubligi, ularning tarkibiy murakkabligi, bajarishdagi izchilligi bilan belgilanadigan mehnat elementlari bo'lib, xodimning mehnat predmetlari va vositalari bilan o'zaro munosabatga kirishuvidir."
        ]
    },
    {
        "word": "Mehnat Reduksiyasi",
        "type": [],
        "definition": [
            "murakkab mehnatni oddiy mehnatga aylantirish demakdir."
        ]
    },
    {
        "word": "Mehnat Resurslari",
        "type": [],
        "definition": [
            "aholining mehnatga layoqatli qismi. Erkaklarning 16 yoshdan 55 yoshgacha, ayollarning 16 yoshdan 50 yoshgacha bo'Igan qismi."
        ]
    },
    {
        "word": "Mehnat Resurslari Balansi",
        "type": [],
        "definition": [
            "mavjud mehnat resurslari va ularning faoliyat turlari hamda sohalari bo'yicha taqsimlanishini ifodalovchi ko'rsatkichlar tizimi"
        ]
    },
    {
        "word": "Mehnat Shartnomasi",
        "type": [],
        "definition": [
            "tadbirkor va ishga kiruvchi shaxs o'rtasidagi kelishuv. Unga ko'ra xodimning mehnat vazifasi, ish joyi, lavozimi, oylik ish haqi, ish boshlash vaqti va hokazolar belgilab beriladi."
        ]
    },
    {
        "word": "Mehnat Taqsimoti",
        "type": [],
        "definition": [
            "ijtimoiy mehnatning mustaqil vazifalarini bajaruvchi mehnat turlariga ajralish jarayonidan iborat. Mehnat taqsimoti yuz berganda, bir mehnat turidan ikkinchisi, ikkinchisidan uchinchisi va hokazolar ajralib chiqadi va bu jarayon uzluksiz davom etaveradi."
        ]
    },
    {
        "word": "Mehnat Unumdorligi",
        "type": [],
        "definition": [
            "insonlar ishlab chiqarish faoliyatining samaradorligi; xodim moddiy ishlab chiqarish sohasida ish vaqti birligida ishlab chiqargan mahsulotlar miqdori yoki mahsulot birligini ishlab chiqarish uchun sarflangan vaqt bilan o'lchanadi. Mehnatning ijtimoiy unumdorligi ishlab chiqarilgan milliy daromadning moddiy ishlab chiqarish tarmoqlarida band bo'Igan har bir xodimga nisbatan hisoblanadi"
        ]
    },
    {
        "word": "Mehnat Unumd Orligini Oshirish Zaxiralari (Rezervlari)",
        "type": [],
        "definition": [
            "texnika va texnologiyani takomillashtirish, ishlab chiqarish, mehnat va boshqaruvni tashkil etishni yaxshilash hisobiga mehnat unumdorligini oshirishning barcha omillaridan yanada to'laroq foydalanish imkoniyatidir."
        ]
    },
    {
        "word": "Mehnat Vositalari",
        "type": [],
        "definition": [
            "insonning yaratayotgan buyumlariga o'z ta’sirini o'tkazuvchi vositalar hisoblanadi. Mebnat vositalari tarkibida ishlab chiqarish qurollari yetakchi rol o'ynaydi. Ishlab chiqarish qurollari yordamida ishchilar mehnat buyumlarining tashqi ko'rinishini o'zgartiradilar, ularga yangi tus beradilar va mehnat mahsuliga aylantiradilar. Mehnat vositalariga, shuningdek, imoratlar, inshootlar, transport vositalari va xo'jalik jihozlari ham kiradi"
        ]
    },
    {
        "word": "Mehnat Oʻlchovi",
        "type": [],
        "definition": [
            "ma’lum mahsulotni ishlab chiqarish yoki boshqa biron ishni bajarish uchun sarflangan ish vaqtini aniqlashga xizmat qiladi. Bu o'lchovga kishi\/kun va kishi\/soatni misol keltirish mumkin."
        ]
    },
    {
        "word": "Mehnatdan Qoniqish Hosil Qilish",
        "type": [],
        "definition": [
            "xodimning mehnat mazmuniga, xarakteri va shart-sharoitlariga qo'yadigan talablarining muvozanatli holati. Bu talablarni amalga oshirish imkoniyatlariga subyektiv baho berishdir."
        ]
    },
    {
        "word": "Mehnatga Haq, Toʻlash Tizimi",
        "type": [],
        "definition": [
            "o‘ zaro bog'langan, bir maqsadga qaratilgan, bir-birini to'ldiruvchi turli haq to'lash shakllarining o'zaro yig'indisi."
        ]
    },
    {
        "word": "Mehnatga Haq Toʻlashning Ishbay Progressiv Tizimi",
        "type": [],
        "definition": [
            "me’yordan ortiq bajarilgan ish yoki yetishtirilgan mahsulot uchun progressiv ortib boruvchi stavka yoki rassenka bo'yicha haq to'lash"
        ]
    },
    {
        "word": "Mehnatga Haq, Toʻlashning Oddiy Chegaralanmagan Tizimi",
        "type": [],
        "definition": [
            "xodimlarga ish haqi mehnat me’yorining bajarilish darajasidan qat’i nazar, o'zgarmagan stavka va rassenkalarda to'lab boriladi."
        ]
    },
    {
        "word": "Mehnatga Ishbay Haq, Toʻlash",
        "type": [],
        "definition": [
            "xodimlarning haqiqatda bajargan ishi yoki yetishtirgan mahsulotiga to'lanadigan ish haqi tizimi."
        ]
    },
    {
        "word": "Mehnatga Moslashish (Koʻnikish)",
        "type": [],
        "definition": [
            "shaxs yangi mehnat vaziyatini o'zlashtirishining ijtimoiy jarayoni bo'lib, unda shaxs va mehnat muhiti bir-biriga faol tasir ko'rsatadi."
        ]
    },
    {
        "word": "Mehnatga Munosabat",
        "type": [],
        "definition": [
            "murakkab ijtimoiy hodisa bo'lib, uch element birligi: mehnat muomalasi sabablari va yo'nalishlari; real yoki haqiqiy mehnat muomalasi; xodimlarning mehnat faoliyatiga og'zaki baho berishidan iboratdir."
        ]
    },
    {
        "word": "Mehnatning Chekli Mahsuloti",
        "type": [],
        "definition": [
            "boshqa ishlab chiqarish omillari sarfi o'zgarmaganda, bir birlik qo'shimcha mehnat sarfi hisobidan ishlab chiqarilgan qo'shimcha mahsulot"
        ]
    },
    {
        "word": "Mehnatni Ilmiy Tashkil Etish",
        "type": [],
        "definition": [
            "ishlab chiqarishga tizimli joriy qilinadigan ilm-fan yutuqlari va ilg'or tajribalarga asoslangan mehnatni tashkil etish. U engyaxshi texnika va odamlarni bitta ishlab chiqarish jarayoniga yig'ishga imkon beradi, material va mehnat resurslaridan eng samarali foydalanish hamda ishlab chiqarish faoliyatining uzluksiz borishini ta’minlaydi, inson sog'lig'ini saqlashga yordam beradi."
        ]
    },
    {
        "word": "Mehnatni Normalash",
        "type": [],
        "definition": [
            "ilmiy asoslangan mehnat xarajatlari va uning natij alarini: vaqt normalari, soni, xizmat ko'rsatishningboshqarilishi, mahsulot ishlab chiqarishning normalangan topshiriqlari normalarini aniqlashdir."
        ]
    },
    {
        "word": "Mehnatni Vazifaviy Taqsimlash",
        "type": [],
        "definition": [
            "alohida ishchilar guruhini ularning jamoat faoliyatidagi vazifalariga qarab taqsimlash."
        ]
    },
    {
        "word": "Melioratstya",
        "type": [],
        "definition": [
            "yerning unumdorligini tubdan yaxshilashga qaratilgan tashkiliy-xo'jalik, muhandislik va agrotexnik tadbirlar turkumi."
        ]
    },
    {
        "word": "Memorial-Order",
        "type": [],
        "definition": [
            "buxgalteriya provodkasi aks ettiriladigan hujjat. Unda orderning nomeri, oy, yil, yozuvning mazmuni, summa, debetlanuvchi va kreditlanuvchi schyotlarning nomi (schyotlar korrespondensiyasi) ko'rsatiladi. Memorial-orderlar maxsus blankalarda tuziladi va bosh (katta) buxgalter yoki uning yordamchisi tomonidan imzolanadi. Memorial-orderlar o'rniga tegishli shakldagi shtamplar qo'llanishi mumkin. Ayrim hujjatlarning blankalarida memorial-order rekvizitlari mavjud, ya’ni schyotlar korrespondensiyasi nazarda tutilgan. Hisobning jurnalorder shaklida memorial-orderlar tuzilmaydi."
        ]
    },
    {
        "word": "Mena",
        "type": [],
        "definition": [
            "tovar ayirboshlash bitimlari qiymati. Teng tovarlarni bir-biriga ayirboshlash"
        ]
    },
    {
        "word": "Menejer",
        "type": [],
        "definition": [
            "yollanma professional boshqaruvchi; doimiy ravishda boshqaruv lavozimini egallab turuvchi va bozor sharoitlarida faoliyat yurituvchi tashkilot faoliyatining ayrim turlari bo'yicha qaror qabul qilish vakolati berilgan shaxs."
        ]
    },
    {
        "word": "Menejerlik",
        "type": [],
        "definition": [
            "ishlab chiqarish faoliyatidan ko'proq samara olish maqsadida intellektual, moliyaviy, xomashyo va moddiy quwatlami boshqarish san’ati."
        ]
    },
    {
        "word": "Menejerning Oʻzini O ʼZi Nazorat Qilishi",
        "type": [],
        "definition": [
            "menejerning o'z faoliyati natijalari ustidan nazorat qilishi tufayli mehnat jarayoni yaxshilanadi, qo'yilgan maqsadga erishildimi yoki yo'qligi tekshiriladi hamda kerakli tuzatishlar kiritiladi."
        ]
    },
    {
        "word": "Menejment",
        "type": [],
        "definition": [
            "(inlg. management) - u yoki bu faoliyat turini tashkil etish va rahbarlik qilish, iqtisodiy, moliya va boshqa inson hayotidagi ishbilarmonlik sohasini tashkil qilish va boshqarishni bildiradi. Bozor iqtisodi va ishlab chiqarish iqtisodining erkin bo'gini uchun zarur bo'Igan boshqaruv turidir."
        ]
    },
    {
        "word": "Menejmentning Samaradorligi",
        "type": [],
        "definition": [
            "ijtimoiy-iqtisodiy kategoriya, boshqaruv faoliyatining natijaviyligi, moddiy, moliyaviy, mehnat va odam resurslaridan foydalanishning muvofiqlik darajasi. Boshqaruv natijalari va ularga erishishga sarflangan resurslami solishtirish vositasida aniqlanadi. Menejment samaradorligining vazifaviy roli uning rivojlanishi darajasi va dinamikasi, ushbu jarayonning sifatiy va miqdoriy tomonlarini aks ettirishdir."
        ]
    },
    {
        "word": "Menejmentning Tashkiliy Tarkibi",
        "type": [],
        "definition": [
            "firmaning maqsadga erishishi uchun zaruriy vazifalarni ta’min etuvchi boshqaruv idoralari birlashmasi orasida hukm suruvchi tizim."
        ]
    },
    {
        "word": "Menger Karl",
        "type": [],
        "definition": [
            "(1840-1921) - avstriyalik iqtisodchi, iqtisodiyot fanidagi Avstriya maktabi asoschisi. Ushbu maktab o'z ne’matlarining me’yoriy foydaliligi nazariyasi bilan taniqlidir. Birinchilar qatori iqtisodiy hodisalarni tahlil etishda subyektiv-psixologik uslubni qo'llagan. Insonni iqtisodiy hayotning asosiy omili deb hisoblagan."
        ]
    },
    {
        "word": "Menger Karl (1840-1921), Byom-Baverk Yevgeniy (1851-1914), Vizer Fridrix (1851-1926)",
        "type": [],
        "definition": [
            ""
        ]
    },
    {
        "word": "Mentalitet",
        "type": [],
        "definition": [
            "ijtimoiy muhit, milliy ananalar, ma’rifatchilik darajasi va boshqa shu kabi obyektiv omillarning ta’siri ostida konkret olingan jamiyat a’zolarining individual va ijtimoiy ongi, hayotiy pozitsiyalari, madaniyati, o'zligini ifoda etishining namoyon bo'lish xususiyatlari"
        ]
    },
    {
        "word": "Merkantilizm",
        "type": [],
        "definition": [
            "(ital. sotuvchi, savdogar) - iqtisodiy ta’limotning fan sifatida shakllana boshlashida yuzaga kelgan dastlabki iqtisodiy ta’limot. Merkantilizm ta’limotiga farang olimi A. Monkreten, ingliz olimlari U. Stafford, T. Men, A. Serra va boshqalar asos solganlar. Ularning ilmiy izlanishlarini muomala sohasi, savdo kapitali tashkil etgan. Ular ijtimoiy boylikning o'sish manbayini ishlab chiqarish sohasida emas, balki muomala sohasida savdodan izlaganlar. Buning natijasida foyda muomala sohasidagina vujudga keladi, millatning boyligi pul bilan belgilanadi, degan xulosaga kelganlar"
        ]
    },
    {
        "word": "Meros",
        "type": [],
        "definition": [
            "qonun yoki vasiyatga muvofiq merosxo'rlik asosida qabul qilinadigan mulk."
        ]
    },
    {
        "word": "Merosxoʻrlar",
        "type": [],
        "definition": [
            "qonunga muvofiq ikki toifaga bo'linadi: l) birinchi darajali (navbatdagi) merosxo'rlar - vafot etgan shaxsning bolalari, xotini (eri), ota-onasi, vafot etgandan so'ng tug'ilgan farzand; 2) ikkinchi darajali (navbatdagi) merosxo'rlar - vafot etgan shaxsning akaukalari, opa-singillari, ota yoki ona tomonidan bobosi va momosi. Ikkinchi darajali (navbatdagi) merosxo'rlar qonun bo'yicha birinchi darajali (navbatdagi) merosxo'rlar bo'lmaganda, ular tomonidan meros qabul qilinmaganda yoki vasiyatchi tomonidan ular meros qabul qilish huquqidan mahrum etilganda, merosni qabul qilishga chaqiriladilar."
        ]
    },
    {
        "word": "Metod",
        "type": [],
        "definition": [
            "l) tabiiy va ijtimoiy hayot hodisalarini tadqiq qilish, bilish usuli; 2) harakat qilish usuli, tarzi."
        ]
    },
    {
        "word": "Metodika",
        "type": [],
        "definition": [
            "biror ishni tashkil qilishda maqsadga muvofiq qo'llanadigan metodlar."
        ]
    },
    {
        "word": "Metodologiya",
        "type": [],
        "definition": [
            "dunyoni ilmiy bilish metodi haqidagi ta’limot"
        ]
    },
    {
        "word": "Mezon",
        "type": [],
        "definition": [
            "taqqoslash yoki baholash uchun o'lchov, andoza. Masalan, mehnat - kishi qadr-qimmatining mezonidir."
        ]
    },
    {
        "word": "Mht Hisobot Tizimi",
        "type": [],
        "definition": [
            "bozor munosabatlariga asoslangan iqtisodiyot hisobot tizimidir."
        ]
    },
    {
        "word": "Mht Taʼrifiga Asosan Jamgarish",
        "type": [],
        "definition": [
            "barcha moliyaviy (mavjud pul mablag'lari, depozitlar, qimmatli qog'ozlar, zayomlar, kreditlar va h.k.) aktivlar va material aktivlar o'sishini anglatadi"
        ]
    },
    {
        "word": "Mhtda Joriy Transfertlar",
        "type": [],
        "definition": [
            "pul va natura holidagi daromadlarni qayta taqsimlash va tashqi dunyo joriy transfertlar schyotlarida qayd qilinsa, kapital transfertlar ichki iqtisodiyot va tashqi dunyo kapital xarajatlar schyotlarida qayd qilinadi. To'lov balansida esa joriy transfertlar joriy operatsiyalar schyotida, kapital transfertlar kapital operatsiyalar schyotida qayd etiladigan bo'ldi"
        ]
    },
    {
        "word": "Mhtda Mehnat Haqi",
        "type": [],
        "definition": [
            "ish beruvchi institutsion birlik (korxona va uy xo'jalik)larning yollanma ishchilarga qilgan barcha xarajatlari miqdori tushuniladi. Mehnat haqi ikki qismdan: ish haqi va ijtimoiy sug'urta ajratmalaridan iborat"
        ]
    },
    {
        "word": "Mijoz",
        "type": [],
        "definition": [
            "korxona, tadbirkor tovari va xizmatidan foydalanib kelayotgan barqaror istemolchi."
        ]
    },
    {
        "word": "Mijoz Muhitida Xizmat Koʻrsatish",
        "type": [],
        "definition": [
            "xizmat ko'rsatish mijozning doimiy bo'ladigan joyida amalga oshiriladi"
        ]
    },
    {
        "word": "Mijozlar Bilan Aloqaning В Aland Va Past Darajalari",
        "type": [],
        "definition": [
            "mijoz xizmat ko'rsatish tizimida bo'lishi ko'zda tutiladi va mijoz xizmat ko'rsatish tizimida bo'lishi shart bo'lgan vaqt ushbu xizmat ko'rsatilishi uchun talab qilinadigan yig'indi vaqtga nisbatan foizda aks ettiriladi."
        ]
    },
    {
        "word": "Mikrofirma",
        "type": [],
        "definition": [
            "kichik biznes korxonasining bir turi."
        ]
    },
    {
        "word": "Mikroiqtisodiyot",
        "type": [],
        "definition": [
            "inson, oila, korxona (firma) yoki tarmoq darajasidagi iqtisodiyot. Mikroiqtisodiyot makroiqtisodiyot bilan uzviy bog'liq. Mikroiqtisodiyot ishlab chiqarish jarayonida bozor subyektlari o'rtasida bo'ladigan taqsimot, almashuv va moddiy mablag'lar taqsimoti munosabatlarini o'rganadi. Mikroiqtisodiyot ishlab chiqaruvchilar bilan davlat o'rtasidagi munosabatlarni ham o'rganadi. Mikroiqtisodiyotning asosiy bo'limlari: firma va istemol nazariyalari, bozor tarkibi, infratuzilmalar, monopoliya va raqobat muammolari, daromad taqsimoti, davlat va xususiy biznesning o'zaro bog'liqligi, mehnat bozori tahlili, talab va taklif o'rtasidagi nisbat, ish haqi va mehnat unumdorligi hisoblanadi."
        ]
    },
    {
        "word": "Mikrokredit",
        "type": [],
        "definition": [
            "xususiy tadbirkorlikni rivojlantirish va boshlang'ich sarmoyani shakllantirishga beriladigan kreditlar. Mikrokreditlar: a) yuridik shaxs maqomiga ega bo'lmagan tadbirkorlik faoliyati uchun - eng kam ish haqining 50 barobarigacha; b) mikrofirma va dehqon xo'jaliklariga eng kam ish haqining 100 barobarigacha; v) fermer xo'jaligiga eng kam ish haqining 200 barobarigacha beriladi."
        ]
    },
    {
        "word": "Mikromarketing",
        "type": [],
        "definition": [
            "ayrim kompaniya (korxona) miqyosi bilan chegaralangan marketing faoliyati"
        ]
    },
    {
        "word": "Mikromuhit",
        "type": [],
        "definition": [
            "firma marketing muhitining tarkibiy qismi. Bevosita firmaning o'ziga va uning mijozlarga xizmat ko'rsatish imkoniyatlariga taalluqli kuchlar, ya’ni ta’minotchilar, marketing vositachilari, mijozlar, raqobatchilar bilan ifodalanadi"
        ]
    },
    {
        "word": "Mikrotalab",
        "type": [],
        "definition": [
            "talabning nisbatan kichik miqyos, tovarning aniq turi, markasi, varianti bo'yicha ko'rinishi"
        ]
    },
    {
        "word": "Mill Jeyms",
        "type": [],
        "definition": [
            "(1773-1836) - ingliz iqtisodchisi, ish haqini oshirish uchun kurashmaslik tarafdori; jonli mehnat bilan birga ishlab chiqarish vositalarining mehnatini ham tan olishni talab qilgan"
        ]
    },
    {
        "word": "Million",
        "type": [],
        "definition": [
            "birning yonidagi nollar soni 6 ta bo'Igan son. XIII asrda mashhur italiyalik sayyoh Marko Polo Xitoyga borib, bu mamlakat boyligini ifodalash maqsadida “million” so'zini o'ylab topgan."
        ]
    },
    {
        "word": "Milliard",
        "type": [],
        "definition": [
            "birning yonidagi nollar soni 9 ta bo'Igan son."
        ]
    },
    {
        "word": "Milliy Banklar",
        "type": [],
        "definition": [
            "1. To'liq yoki qisman milliy kapitalga tegishli va uning manfaatlari yo'lida harakat qiluvchi banklar. 2. AQSH da tijorat banklarining nomi bo'lib, ular faoliyati federal qonunlar bilan boshqariladi. 3. Ba’zi mamlakatlarda markaziy banklar shunday nomlanadi. 4. O'zbekistonda tashqi iqtisodiy faoliyat milliy banki."
        ]
    },
    {
        "word": "Milliy Boylik",
        "type": [],
        "definition": [
            "jamiyat ixtiyoridagi mehnat bilan yaratilgan va jamg'arilgan moddiy ne’matlar majmuyi. Milliy boylik aholi turmushi, moddiy va ma’naviy darajaning negizi, kengaytirilgan takror ishlab chiqarishning moddiy asosi va natijasidir. Moddiy boylik tarkibiga asosiy ishlab chiqarish fondlari, fan, maorif, sog'liqni saqlash, sport, madaniyat va san’at, dam olish va shu kabi muassasalarga tegishli bino, inshoot va uskunalar, ishlab chiqarish sohasidagi moddiy aylanma mablag'lar, zaxiradagi moddiy resurslar kiradi Shuningdek, aholi ixtiyoridagi xizmat muddati bir yildan ortadigan uy-joy va ro'zg'or buyum-anjomlari ham milliy boylik tarkibiga kiradi. Xo'jalik faoliyatiga tortilgan tabiiy resurslar ham milliy boylik hisobiga kiritiladi."
        ]
    },
    {
        "word": "Milliy Bozor",
        "type": [],
        "definition": [
            "muayyan mamlakat doirasida ishlab chiqarilgan tovarlar muomalasi sohasini ifodalovchi tushuncha. Milliy bozor subyektini shu mamlakat fuqarolaribo' lmish tovar egalari - korxonalar, firmalar, birlashmalar, davlat va jamoatchilik tashkilotlari hamda ayrim fuqarolar tashkil etadi. Milliy bozor hajmi muayyan mamlakatning katta yoki kichikligiga, uning iqtisodiy darajasiga, xalqaro savdodagi ishtirokiga bog'liq bo'ladi."
        ]
    },
    {
        "word": "Milliy Daromad",
        "type": [],
        "definition": [
            "jamiyatda ma’lum davrda (masalan, bir yilda) yangidan hosil bo'ladigan qiymat yoki yalpi milliy mahsulotdan iste’mol qilinadigan ishlab chiqarish vositalari qiymati chegirib tashlangandan so'ng qolgan qismi. Natural ashyoviy tarkibi jihatidan milliy daromad aholi shaxsiy iste’moli uchun mo'ljallangan iste’mol buyumlari va ishlab chiqarishni kengaytirish uchun foydalaniladigan ishlab chiqarish vositalaridan iborat. Shuningdek, milliy daromadni ushbu yil yangidan sarflangan jonli mehnat natijasi sifatida ham ta’riflash mumkin. Milliy daromad ko'rsatkichi sof milliy mahsulot deb ham yuritiladi."
        ]
    },
    {
        "word": "Milliy Hisobchilar",
        "type": [],
        "definition": [
            "mamlakat miqyosida uning tarmoqlari va sektorlari kesimida MHT metodologiyasi asosida hisoblarni amalga oshiruvchilar."
        ]
    },
    {
        "word": "Milliy Hisoblar Tizimi (Mht)",
        "type": [],
        "definition": [
            "makrodarajada o'zaro bog'langan, muayyan hisoblar yig'indisi va balansi tarzida tuzilgan jadval; iqtisodiy faoliyat, iqtisodiyot tarkibi va milliy xo'jaliklardagi muhim o'zaro aloqalar natijasini tavsiflaydigan hamda bozor iqtisodiyotiga mos keladigan ko'rsatkichlar yig'indisi."
        ]
    },
    {
        "word": "Milliy Iqtisodiyot",
        "type": [],
        "definition": [
            "barcha ishlab chiqarish va noishlab chiqarish tarmoqlari va sohalari, funksional iqtisodiyot, ko'plab infratuzilmalarni o'z ichiga qamrab olgan yaxlit iqtisodiyotdir"
        ]
    },
    {
        "word": "Milliy Valyuta",
        "type": [],
        "definition": [
            "muayyan mamlakat pul birligi. Mamlakatda yakka muomala quwati va konvertlanganlik holatiga ko'ra tashqi savdo va xalqaro hisob-kitob ishlarida qo'llaniladi"
        ]
    },
    {
        "word": "Milliy Valyuta Tizimi",
        "type": [],
        "definition": [
            "bir mamlakatda valyuta amal qilishi bilan bog'liq bo'lgan iqtisodiy va qonuniy munosabatlar yig'indisi"
        ]
    },
    {
        "word": "Milliy Valyutaning Pariteti",
        "type": [],
        "definition": [
            "milliy valyuta qiymatining xorijiy v alyuta qiymatiga nisbati bo'lib, u hisoblanadigan ko'rsatkich hisoblanadi va milliy valyuta kursini belgilash uchun asos bo'lib xizmat qiladi"
        ]
    },
    {
        "word": "Milliy Valyutaning Qadrsizlanishi",
        "type": [],
        "definition": [
            "xorijiy valyutalami sotib olishga oldingiga nisbatan ko'proq milliy valyuta birliklari zarurligini bildiradi."
        ]
    },
    {
        "word": "Milliy Valyutaning Qimmatlashishi",
        "type": [],
        "definition": [
            "xorijiy valyutalarni sotib olishga oldingiga nisbatan kamroq milliy valyuta birliklari zarur bo'lishini anglatadi."
        ]
    },
    {
        "word": "Milliy Xoʻjalikka (Iqtisodiyotga) Qilinadigan Xarajatlar",
        "type": [],
        "definition": [
            "katta masshtablarda yangi sanoat korxonalarini qurish, zamonaviy industrial asosda qishloq xo'jaligi ishlab chiqarishini rivojlantirish, transport, aloqa va iqtisodiyot boshqa tarmoqlarining texnikaviy qayta qurollanishini ta’minlashga imkon yaratadi."
        ]
    },
    {
        "word": "Milliy Xususiy Nomoliyaviy Korporatsiyalar",
        "type": [],
        "definition": [
            "bunday korporatsiyalar tarkibiga tegishli davlat idoralari tomonidan nazorat ostiga olinmaydigan rezidentlik barcha nomoliyaviy va kvazikorporatsiyalar kiradi."
        ]
    },
    {
        "word": "Milliylashtirish",
        "type": [],
        "definition": [
            "xususiy shaxslar mulklarining tegishli davlat organining maxsus aktiga ko'ra davlat ixtiyoriga o'tkazilishi"
        ]
    },
    {
        "word": "Minimal Narx",
        "type": [],
        "definition": [
            "aniq tovar narxining eng quyi chegarasi."
        ]
    },
    {
        "word": "Moʻljallangan Bozor",
        "type": [],
        "definition": [
            "biror korxona tanlab olgan aniq iste’molchilar guruhi, korxonaning mavjud va bo'lajak iste’molchilar majmuyi."
        ]
    },
    {
        "word": "Moʻtadil (Optimal) Talab",
        "type": [],
        "definition": [
            "qondirish imkoniyatlariga mos, ma’qul talab."
        ]
    },
    {
        "word": "Moda",
        "type": [],
        "definition": [
            "to'plamda eng ko'p uchraydigan belgi qiymatidir"
        ]
    },
    {
        "word": "Moddiy Aylanma Vositalar Zaxirasi",
        "type": [],
        "definition": [
            "kelgusida qayta ishlov beriladigan, sotiladigan, boshqa birliklar ixtiyoriga beriladigan yoki boshqa usulda foydalaniladigan, shunga qadar ishlab chiqaruvchi ixtiyorida turadigan vositalar hamda boshqa birliklardan sotib olinadigan va oraliq iste’molda yoki kelgusida qayta ishlov bermasdan qayta sotishga mo'ljallangan mahsulot."
        ]
    },
    {
        "word": "Moddiy Ehtiyoj",
        "type": [],
        "definition": [
            "moddiy ne’matlar, buyumlarga bo'lgan va ular yordamida qondiriladigan ehtiyoj"
        ]
    },
    {
        "word": "Moddiy Investitsiyalar",
        "type": [],
        "definition": [
            "asosiy kapital elementlarini sotib olish bilan bog‘liq bo'lib, ko‘pchilik hollarda investitsion loyihalar doirasida amalga oshiriladi."
        ]
    },
    {
        "word": "Moddiy Xarajatlar",
        "type": [],
        "definition": [
            "xomashyo va asosiy materiallar, yordamchi materiallar, yoqilg‘i,energiyavaboshqaxarajatlardaniborat. Moddiy resurslarning qiymati ularni sotib olish bahosi (qo'shilgan qiymat solig'isiz), ta’minot va tashqi iqtisodiy tashkilotlarga to'lanadigan ustamalar, komission mukofotlar, boj to'lovlari, tovarlar birjasining xizmat qiymatlari, tashish, saqlash va yetkazib berish haqlarining yig'indisidan tashkil topadi."
        ]
    },
    {
        "word": "Moddiy Yordam",
        "type": [],
        "definition": [
            "ishsizlar, qochoqlar va majburiy ко‘chib o'tganlarga bir martalik to'lanmalar va boshqalar."
        ]
    },
    {
        "word": "Model",
        "type": [],
        "definition": [
            "lotincha “modulus” so'zidan olingan bo'lib, o'lchov, me’yor degan ma’nolarni anglatadi. Real voqelik (hodisa) yoki obyektning aqliy in ikosi sifatida anglab yetilgan va ularning muhim elementlari o'rtasidagi munosabatlar, aloqalar, o'ziga xos xususiyatlarni namoyisb etishga xizmat qiluvchi analog."
        ]
    },
    {
        "word": "Modellar Banki",
        "type": [],
        "definition": [
            "marketing yechimlarini qabul qilish uchun mo'ljallangan matematik modellar to'plami"
        ]
    },
    {
        "word": "Modelning Adekvatligi",
        "type": [],
        "definition": [
            "modelning modellashtirilayotgan obyekt yoki jarayonga mos kelishi."
        ]
    },
    {
        "word": "Modernizatsiya",
        "type": [],
        "definition": [
            "obyektni takomillashtirish, yaxshilash, yangilash, uni yangi talab va me’yorlarga, texnik shart-sharoitlarga, sifat ko'rsatkichlariga moslashtirish."
        ]
    },
    {
        "word": "Modifikatsiya Qilingan Tovar",
        "type": [],
        "definition": [
            "tovarning iste’mol xossalariga ijobiy o'zgartirishlar kiritib, ishlab chiqarilgan varianti"
        ]
    },
    {
        "word": "Moliya",
        "type": [],
        "definition": [
            "taqsimot xarakteriga ega bo'Igan, pul ko'rinishidagi daromad va yig'imlar shaklida moddiylashuvchi, o'zaro bog'liq iqtisodiy munosabatlar majmuyi bo'lib, xo'jalik yurituvchi subyektlar va davlat tomonidan kengaytirilgan takror ishlab chiqarish, ishchilarni moddiy rag'batlantirish, jamiyatning ijtimoiy ehtiyojlarini qondirishga yo'naltiriladi. Moliyaning asosiy ikkita funksiyasi mavjud bo'lib, ular: taqsimlash va qayta taqsimlash hamda nazorat."
        ]
    },
    {
        "word": "Moliya Aktivlari Va Passivlari",
        "type": [],
        "definition": [
            "Barcha moliyaviy aktivlar moliyaviy majburiyatdan kelib chiqadi, ammo monetar oltin va Xalqaro valyuta jamg'armasining qarz olish maxsus huquqi ham, garchandularuchuntegishlimoliyamanbalaribo'lmasa-da,moliyaviy aktiv sifatida qaraladi. Bundan tashqari, korporatsiyalarning aksiyalari va derivatlar deb nomlanuvchi muayyan turdagi moliya omillari (instrumentlari) ham moliyaviy aktiv sanaladi."
        ]
    },
    {
        "word": "Moliya Birjasi",
        "type": [],
        "definition": [
            "qimmatbaho qog'ozlar, valyuta oldi-sotdisi bilan savdo-sotiq qiluvchi tashkilot. U fond birjalari deb ham ataladi."
        ]
    },
    {
        "word": "Moliya Bozori",
        "type": [],
        "definition": [
            "moliyaviy mablag'larni vaqtincha haq to'lab ishlatish yoki ularni sotib olish yuzasidan bo'ladigan munosabatlar. U tarkiban qimmatbaho qog'ozlar bozori va qarzga beriladigan pul bozoridan iborat. Moliya bozori tizimiga - qimmatbaho qog'ozlar bozori, valyuta bozori, ssuda kapitali bozori kabilar kiradi. Moliya bozorida pulga obligatsiya va aksiyalar, veksel va sertifikatlar, valyutalar oldi-sotdi qilinadi."
        ]
    },
    {
        "word": "Moliya Hisobi",
        "type": [],
        "definition": [
            "sektorlardan turli moliya aktivlari va passivlarining o'zgarish jarayonini qayd etadi. Mamlakatning turli turdagi moliya aktivlari va passivlarining Tashqi dunyo”ga nisbatan bo'lgan o'zgarishlarini ifodalaydi."
        ]
    },
    {
        "word": "Moliya Kapitali",
        "type": [],
        "definition": [
            "bank kapitalining sanoat kapitali bilan qo'shilib yoki bir bo'lib ketishi natijasida vujudga kelgan kapital."
        ]
    },
    {
        "word": "Moliya Korp О Ratsiyalari Sektori",
        "type": [],
        "definition": [
            "ko'proq moliyaviy vositachilik yoki moliyaviy vositachilik bilan yaqindan bog'langan moliyaviy faoliyat bilan shug'ullanadigan barcha rezident korporatsiyalari va kvazikorporatsiyalar moliyaviy korporatsiyalar sektorini tashkil etadi."
        ]
    },
    {
        "word": "Moliya Mexanizmi",
        "type": [],
        "definition": [
            "taqsimot va qayta taqsimot munosabatlarining keng tizimini amalga oshirish, daromad va jamg'armalar tashkil qilish, markazlashgan va markazlashmagan pul fondlari tuzishni taminlovchi shakl va usullar yig'indisidan iborat."
        ]
    },
    {
        "word": "Moliya Oligarxiyasi",
        "type": [],
        "definition": [
            "(“oligarxiya” so'zi ozchilikning idora etishini anglatadi) - mamlakat moliyasiga bir guruh yirik korporatsiyalarning yuqori martabali boshqaruvchilari hukmronlik qilishi. Moliya kapitalining yuzaga kelishi oligarxiyani vujudga keltirad"
        ]
    },
    {
        "word": "Moliya Siyosati",
        "type": [],
        "definition": [
            "moliyaviy resurslarni jamlash, ularni davlatning o'z funksiya va vazifalarini amalga oshirish uchun taqsimlash hamda ishlatish shakli va usullarida tizimli namoyon bo'luvchi tadbirlar yig'indisidir."
        ]
    },
    {
        "word": "Moliya Siyosatining Asosiy Yonalishlari",
        "type": [],
        "definition": [
            "moliyaviy resurslarning imkon qadar yuqori hajmini aniqlash va ushbu manbalar doimiyligi va uzluksizligini ta’minlashdir, chunki moliyaviy resurslar potensiali barcha o'zgarishlarning bazasidir"
        ]
    },
    {
        "word": "Moliya Siyosatining Muhim Vazifasi",
        "type": [],
        "definition": [
            "u yoki bu iqtisodiy va ijtimoiy rivojlanishning davlat rejasi yoki chora-tadbirlarini amalga oshirish uchun tegishli moliyaviy resurslar bilan ta’minlashdir."
        ]
    },
    {
        "word": "Moliya Strategiyasi Prinsiplari",
        "type": [],
        "definition": [
            "korxonaga o'z-o'zini tashkil etishga qodir ochiq tizim sifatida qarash prinsipi; korxona operatsion faoliyati bazaviy strategiyalarini hisobga olish prinsipi; moliyaviy faoliyatni strategik boshqarishning tadbirkorlik stiliga maqsadli yo'naltirish prinsipi; strategik moliyaviy rivojlanishning dominant sohalarini belgilash prinsipi; moliyaviy strategiyaning moslashuvchanligini ta’minlash prinsipi; strategik moUyaviy tanlovlarmuqobilinitanlashprinsipi;moliyaviyfaoliyatdatexnologik rivojlanish natijalaridan doimiy foydalanishni ta’minlash prinsipi; strategik moliyaviy qarorlar qabul qilish j arayonida moliyaviy risklar darajasini hisobga olish prinsipi; moliyaviy strategiyani amalga oshirish jarayonining moliyaviy menejerlar professional apparatiga yo'naltirish prinsipi; ishlab chiqilgan moliyaviy strategiyaning tashkiliy tuzilma va tashkiliy madaniyatga muvofiqligini ta’minlash prinsipi."
        ]
    },
    {
        "word": "Moliya Tizimi",
        "type": [],
        "definition": [
            "davlat va korxonalar pul mablag' lari fondlarini shakllantirish, taqsimlash va foydalanish shakllari hamda metodlari tizimi."
        ]
    },
    {
        "word": "Moliya Yili",
        "type": [],
        "definition": [
            "birinchi yanvardan o'ttiz birinchi dekabr kuni oxirigacha bo'lgan vaqtni o'z ichiga oluvchi davr."
        ]
    },
    {
        "word": "Moliya-Bank Tizimi",
        "type": [],
        "definition": [
            "tarixan shakllangan va belgilangan qonun-qoidalar asosida faoliyat yurituvchi mamlakatdagi moliya-kredit muassasalari majmuyidir."
        ]
    },
    {
        "word": "Moliyalashtirish",
        "type": [],
        "definition": [
            "biror tadbir uchun davlat tomonidan mablag' ajratish, mablag' bilan ta’minlash, moliyalashtirish, masalan, xalqxo'jaligini mablag' bilan ta’minlash"
        ]
    },
    {
        "word": "Moliyani Boshqarish",
        "type": [],
        "definition": [
            "subyektlarning moliyaviy munosabatlarini amalga oshirish, pul oqimi fondlarini uyushtirish, taqsimlash va samarali ishlatishga oid faoliyatni bildiradi."
        ]
    },
    {
        "word": "Moliya Funksiyalari",
        "type": [],
        "definition": [
            "moliya mohiyatining amalda namoyon bo'lishi. Uning taqsimlash va nazorat funksiyalari mavjud"
        ]
    },
    {
        "word": "Moliyaning Xalqaro Aloqalarga Taʼsir Etuvchi Yoʻnalishi",
        "type": [],
        "definition": [
            "xorijiy sarmoyadorlar mablag'larini jalb etish"
        ]
    },
    {
        "word": "Moliyashtirish Limiti",
        "type": [],
        "definition": [
            "joriy moliya yili mobaynida ajratiladigan pul mablag'lari chegarasi."
        ]
    },
    {
        "word": "Moliyaviy “Koʻpiklar”",
        "type": [],
        "definition": [
            "real qiymatga ega bo'lmagan pul va obligatsiyalar haj mining ko'payishi."
        ]
    },
    {
        "word": "Moliyaviy Aktivlar",
        "type": [],
        "definition": [
            "birlikning o'z mablag'laridan iborat. Ular monetar oltin, naqd pul, depozit, investitsiya, kreditlar, qimmatli qog'ozlar ko'rinishida bo'lishi mumkin"
        ]
    },
    {
        "word": "Moliyaviy Apparat",
        "type": [],
        "definition": [
            "moliyaviy boshqaruvni amalga oshiruvchi organlar. 0 ‘zbekistonda ularning tarkibiga O'zbekiston Respublikasining Oliy majlisi va uning ikki (Senat va Qonunchilik) palatasi, O'zbekiston Respublikasi Moliya vazirligi, Davlat soliq qo'mitasi, Davlat bojxona qo'mitasi va ularning joylardagi quyi organlari, turli mulkchilik shakllaridagi korxonalarda moliyaning operativ boshqarish fimksiyasini amalga oshiruvchi moliyaviy bo'limlar va boshqarmalar va h.k.lar kiradi."
        ]
    },
    {
        "word": "Moliyaviy Bozor",
        "type": [],
        "definition": [
            "qisqa, o'rta va uzoq muddatli kreditlar hamda fond qiymatlari, ya’ni aksiyalar, obligatsiyalar va qimmatli qog'ozlarning boshqa ko'rinishlari bozori. Birlamchi moliyaviy bozorda yangi qimmatli qog'ozlar chiqariladi, ikkilamchi moliyaviy bozorda esa oldin chiqarilgan qimmatli qog'ozlarning qayta sotilishi sodir etiladi."
        ]
    },
    {
        "word": "Moliyaviy Budjet",
        "type": [],
        "definition": [
            "kapital qo'yilmalar budjeti, pul mablag'lari budjeti va bashorat qilinadigan balansni o'zida mujassamlashtirgan bosh budjetning bir qismi."
        ]
    },
    {
        "word": "Moliyaviy Dastaklar Va Ragʻbatlantirish Vositalari",
        "type": [],
        "definition": [
            "ularga foydani taqsimlash usullari, turli fondlarga to'lovlar, ajratmalar, qo'llaniladigan imtiyozlar, sanksiyalar, jarimalar, soliqlar, subsidiya, subvensiya va sanatsiyalar kiradi."
        ]
    },
    {
        "word": "Moliyaviy Derivatlar",
        "type": [],
        "definition": [
            "bozor narxiga ega bo'Igan pulli dastak bo'lib, uning sohibiga birlamchi qimmatbaho qog'ozlarni sotish yoki sotib olish huquqini beradi. Bularga opsionlar, fyucherslar, varrantlar, svoplar kiradi."
        ]
    },
    {
        "word": "Moliyaviy Faoliyatdan Olingan Daromadlar",
        "type": [],
        "definition": [
            "deganda qimmatli qog'ozlar, valyuta operatsiyalari, kredit va qarzlarni berishdan olingan daromadlar tushuniladi. Bularga royalti, dividendlar va foizlar, ijobiy kurs farqlari ko'rinishidagi daromadlar va boshqalar kiradi."
        ]
    },
    {
        "word": "Moliyaviy Hisobot",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyektlar tomonidan mahsulot (ish va xizmat)lar sotish natijalari to'g'risidagi ma’lumotlar majmuyi bo'lib, u subyektning moliyaviy-xo'jalik faoliyati holatining ma’lum davr (chorak, yillik)ga qiymat ko'rinishida aks etishidir. Hisobot axborotlari sotilgan mahsulot (ish va xizmat)lar, ishlab chiqarish xarajatlari, xo'jalik mablag'lari va ularning tashkil topish manbalari, ishlarning moliyaviy natijalari, soliqqa tortish hamda dividendlar to'g'risidagi ma’lumotlarni o'z ichiga oladi."
        ]
    },
    {
        "word": "Moliyaviy Hisobotni Tayyorlash",
        "type": [],
        "definition": [
            "o'z vaqtida g'azna axborot tizimiga kiritilgan, budjet tashkilotlariga yetkazilgan tovarlar va xizmatlar hajmini tasdiqlovchi hujjatlar, to'lov hujjatlari va hududiy g'azna bo'limlariga topshirilgan budjet tashkilotlarining oylik hisobotlari asosida barcha hududiy g'azna bo'limlari mahalliy budjetlarni boshqarish va ularning ijrosini nazorat qilish uchun kerakli hisobotlarni markaziy g'aznachilikda o'rnatilgan maxsus kompyuter dasturi orqali tezda umumlashtirishdir."
        ]
    },
    {
        "word": "Moliyaviy Institutlar",
        "type": [],
        "definition": [
            "investorlar bilan omonatchilar o'rtasida faoliyatning o'zlari mashg'ul bo'lgan turidan foyda oluvchi vositachilik faoliyati bilan shug'ullanadigan shaxslardir. Banklar, pensiya va investitsiya fondlari, sug'urta kompaniyalari, tovar, xomashyo va fond birjalari, aksiyadorlar va boshqalar moliyaviy vositachi sifatida harakat qiladilar."
        ]
    },
    {
        "word": "Moliyaviy Investitsiyalar",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar (aksiya, obligatsiya), sotib olish va bank depozitlariga uzoq muddatga jalb qilingan qo'yilmalardir."
        ]
    },
    {
        "word": "Moliyaviy Jihatdan Tartibga Solish",
        "type": [],
        "definition": [
            "uy xo'jaligi, korxona yoki davlat ixtiyoridagi jami pul mablajlari, shuningdek, daromadlar manbayining hosil qilinishi va ulardan foydalanishni boshqarish"
        ]
    },
    {
        "word": "Moliyaviy Korxonalar",
        "type": [],
        "definition": [
            "tizimda moliya vositachiligi bilan qattiq bog'langan holda, asosan, moliyaviy vositachilik yoki yordamchi moliyaviy faoliyat bilan shug'ullanuvchi korxonalar."
        ]
    },
    {
        "word": "Moliyaviy Lizing",
        "type": [],
        "definition": [
            "ijara munosabatlarining alohida turi bo'lib, bunda bir tomon (lizing oluvchi)ningtopshirig'igabinoanuchinchi tomondan (sotuvchidan) mulk (lizing obyekti)ni lizing shartnomasida belgilangan shartlarda lizing oluvchiga to'lov asosida foydalanish va egalik qilish uchun hamda keyinchalik lizing oluvchining xususiy mulkiga o'tishi sharti bilan berish maqsadida sotib oladi."
        ]
    },
    {
        "word": "Moliyaviy Majburiyat",
        "type": [],
        "definition": [
            "bir institutsion birlik boshqa birlikka mablag' berganda va ana shu mablag'ga egalik qiluvchi boshqa institutsion birlik (kreditor) boshqa birlikdan, ya’ni qarzdordan bir qator to'lov yoki to'lovlar olganda ro'y beradi. Bunday muomalalar o'zaro tuzilgan shartnoma talablariga muvofiq amalga oshiriladi."
        ]
    },
    {
        "word": "Moliyaviy Manbalar",
        "type": [],
        "definition": [
            "iqtisodiyotning turli darajasidagi choratadbirlarni amalga oshirish uchun taqozo etiluvchi moliyaviy mablag'laming kelib chiqish manbalari. Masalan, moliyaviy manbalar aholi va korxonalarning manbalari, davlat budjeti mablag'lari, qarzga olingan mablag'lar, xorijiy investorlarning mablag'lari va boshqa ko'rinishlarda bo'lishi mumkin."
        ]
    },
    {
        "word": "Moliyaviy Mexanizm",
        "type": [],
        "definition": [
            "moliyaviy munosabatlarni tashkil etishning davlat tomonidan o'rnatilgan shakllari, turlari va metodlari tizimi. Davlat tomonidan tartibga solishning darajasiga bog'liq ravishda ikkiga bo'linadi: direktiv moliyaviy mexanizm va tartibga soluvchi moliyaviy mexanizm. Direktiv moliyaviy mexanizm davlat bevosita ishtirok etadigan munosabatlar (soliqlar, davlat krediti, budjet jarayoni va boshqalar) bilan bog'langan. Tartibga soluvchi moliyaviy mexanizm esa davlat manfaatlariga to'g'ridan-to'g'ri tasir etmaydigan moliyaviy munosabatlardan (masalan, korxona ichki xo'jalik faoliyatini tashkil etish) foydalanishning asosiy yo'nalishlarini belgilab (aniqlab) beradi."
        ]
    },
    {
        "word": "Moliyaviy Munosabatlar",
        "type": [],
        "definition": [
            "pul jamg'armalarining xarajati natijasida davlat hamda uning quyi va yuqori tashkilot idoralari, turli xo'jalik yuritish shaklidagi korxonalar, firmalar, kooperativlar, birlashmalar, jamoa uyushmalari, alohida aholi qatlamlari o'rtasida o'zaro yuzaga keluvchi iqtisodiy munosabatlar."
        ]
    },
    {
        "word": "Moliyaviy Menejment",
        "type": [],
        "definition": [
            "xo'jalik subyektining joriy va strategik maqsadlariga erishishda ularning moliyaviy resurslari va moliyaviy faoliyatini boshqarishdir."
        ]
    },
    {
        "word": "Moliyaviy Menejmentda Arbitraj",
        "type": [],
        "definition": [
            "bir xil aktivlarga turli baholardan foydalanish yo'li bilan tavakkalchiliksiz daromad olish tushuniladi. Arbitraj keng tarqalgan investitsion taktika hisoblanadi va bir davrning o'zida bir xil aktivlar (yoki uning funksional ekvivalenti)ni nisbatan yuqori baholarda sotish va nisbatan past narxlarda sotib olishdan iborat."
        ]
    },
    {
        "word": "Moliyaviy Natija",
        "type": [],
        "definition": [
            "korxona, birlashma, aksiyadorlik jamiyati, tashkilot, muassasa va hokazolarning ma’lum hisobot davrida, uning tadbirkorlik faoliyati jarayonida o'ziga qarashli mablag'ning oshishi yoki kamayishi."
        ]
    },
    {
        "word": "Moliyaviy Nazorat",
        "type": [],
        "definition": [
            "moliyaviy boshqaruv tizimining elementlaridan biri. Barcha iqtisodiy subyektlar (davlat, hududiy-ma’muriy bo'linmalar, korxona va tashkilotlar)ning moliyaviy faoliyati moliyaviy-xo'jalik qonunchiligiga rioya etilishi, amalga oshirilgan xarajatlarning maqsadga muvofiqligi, moliyaviy-xo'jalik operatsiyalarining iqtisodiy samaradorligi ustidan amalga oshiriladigan qiymatiy nazoratning alohida sohasi."
        ]
    },
    {
        "word": "Moliyaviy Nazorat Obyektlari",
        "type": [],
        "definition": [
            "moliya tizimi va iqtisodiy samaradorligini tekshirish lozim bo'lgan moliya-xo'jalik-tijorat tuzilmalari paydo bo'lganida nazorat subyektlari (taftishchilar)ni tashkil etish zarurati paydo bo'ladi."
        ]
    },
    {
        "word": "Moliyaviy Nazorat Tizimi",
        "type": [],
        "definition": [
            "subyektlar (nazorat qiluvchilar), obyektlar (nazorat qilinuvchilar), nazoratning usul va vositalarini birgalikda jamlab, o'z ichiga oladi."
        ]
    },
    {
        "word": "Moliyaviy Nazoratning Subyektlari",
        "type": [],
        "definition": [
            "nazorat vazifalarini ifodalovchi organlar"
        ]
    },
    {
        "word": "Moliyaviy Rejalashtirish",
        "type": [],
        "definition": [
            "muayyan muddat uchun moliyaviy resurslar harakati va tegishli moliyaviy munosabatlar harakatini asoslashdan iborat jarayon"
        ]
    },
    {
        "word": "Moliyaviy Resurslar",
        "type": [],
        "definition": [
            "davlat va korxonalar pul mablag'lari maqsadli fondlarining majmuyi. Ular o'sishining asosiy sharti milliy daromadning ko'payishidir. Mamlakatning moliyaviy resurslari Iqtisodiyot vazirligi tomonidan tuziladigan yig'ma moliyaviy balansda o'z ifodasini topadi. U o'z ichiga davlat budjet tizimi, hukumatning nobudjet fondlari va turli mulkchilik shaklidagi korxonalar (amortizatsiya va ularning ixtiyorida qoladigan foyda summasi) ning resurslarini qamrab oladi."
        ]
    },
    {
        "word": "Moliyaviy Sogʻlomlashtirish",
        "type": [],
        "definition": [
            "korxona bankrotligini bartaraf etish yoki raqobatbardoshligini oshirish maqsadida chora-tadbirlar tizimini qo'llash orqali uning moliyaviy holatini sog'lomlashtirish"
        ]
    },
    {
        "word": "Moliyaviy Strategiya",
        "type": [],
        "definition": [
            "korxonaning muhim funksional strategiyalaridan biri bo'lib, tashqi vositalar o'zgaruvchanligi sharoitida uzoq muddatli moliyaviy maqsadlarni shakllantirish, ular muvaffaqiyatini ta’minlashning eng samarali yo'llarini tanlash, moliyaviy resurslarni shakllantirish va ulardan foydalanish yo'nalishlarini korrektirovka qilish yo'lida moliyaviy faoliyat va moliyaviy munosabatlarni rivojlantirishning barcha asosiy yo'nalishlarini ta’minlashni o'zida aks ettiradi."
        ]
    },
    {
        "word": "Moliyaviy Taktika",
        "type": [],
        "definition": [
            "strategiya belgilab bergan vazifalarni jamiyat rivojlanishining konkret bosqichida moliyaviy munosabatlarni tashkil etish usullari orqali amalga oshiradi"
        ]
    },
    {
        "word": "Moliyaviy Tranzaksiya",
        "type": [],
        "definition": [
            "mablag'lar ning elektron ko'rinishdagi harakati tushuniladi"
        ]
    },
    {
        "word": "Moliyaviy Veksel",
        "type": [],
        "definition": [
            "korxona tomonidan bo'sh mablag'lari hisobidan boshqa korxonalarga ssuda berishdir. Moliyaviy veksellarga korxonaning muddatida qaytarilmagan kreditor qarzlarini rasmiylashtiradigan veksellarni kiritish mumkin."
        ]
    },
    {
        "word": "Moliyaviy Vositachilar",
        "type": [],
        "definition": [
            "qo'yilgan vazifalarni hal etish uchun taqsimlash va nazorat vazifasini bajaradilar, zero, to'plangan fondlarni to‘g'ri taqsimlashgina emas, balki ulardan jamiyat uchun naqadar samarali, qanday foyda bilan ishlatilayotganligini nazorat qilish ham muhim."
        ]
    },
    {
        "word": "Moliyaviy Yoki Pul Bozori",
        "type": [],
        "definition": [
            "moliyaviy mablag'lar, ya’ni pul, zayomlar, aksiyalarga bo'lgan talab va taklifni aks ettiruvchi bozor. Moliyaviy bozorda indidiumlar va muassasalar pulni qarzga oladi va beradi. Odatda, moliyaviy bozor fond, valyuta birjalari faoliyat ko'rsatishini talab etadi."
        ]
    },
    {
        "word": "Mol-Mulk",
        "type": [],
        "definition": [
            "egalik qilish, foydalanish, tasarruf etish obyektlari bo'la oladigan moddiy obyektlar, shu jumladan, pul mablag'lari, qimmatli qog'ozlar, ulushlar (paylar, hissalar) hamda nomoddiy obyektlar"
        ]
    },
    {
        "word": "Mol-Mulk Soligʻi Toʻlovchilar",
        "type": [],
        "definition": [
            "o'z mulkiga ega bo'lgan yuridik shaxslar hisoblanadi. Soliq to'lashning ixchamlashtirilgan tizimiga o'tgan yuridik shaxslar (savdodan tashqari) va imtiyoz olgan yuridik shaxslar bu soliqni to'lamaydilar."
        ]
    },
    {
        "word": "Monetar Qoida",
        "type": [],
        "definition": [
            "monetaristlar tomonidan ilgari surilgan qoida. Unga binoan muomaladagi pul massasi har yili YaMM potensial o'sishiga teng sur’atlarda oshib borishi kerak. Pul massasi har yili izchillik bilan 3% dan 5% sur’atlarda oshib borishi zarur."
        ]
    },
    {
        "word": "Monetar Siyosat",
        "type": [],
        "definition": [
            "iqtisodda pul massasini muvofiqlashtirishga yo'naltirilgan davlat xatti-harakatlari"
        ]
    },
    {
        "word": "Monetarizm",
        "type": [],
        "definition": [
            "iqtisodiyot nazariyasidagi G'arbda keng tarqalgan neoklassik oqim nazariyalaridan biri. Monetarizm sof bozor iqtisodiyoti nazariyasi hisoblanib, uning bosh g'oyasi bozor mexanizmi iqtisodiy o'sishini ta’minlaydi. Bu mexanizmning asosiy vositasi pul degan xulosadan iborat. Monetarizm nazariyasi asoschilari M. Fridman, F. Keygan, A. Keltsar, D. Leyder va boshqalar bo'lib, ular o'sishning eng muhim sharti inflyatsiyani yo'qotish va pulni sog'lomlashtirish, pulni xo'jalik muomalasi vositasiga aylantirish deb qaraydilar. Ular pulning barqarorligi va iqtisodiy faollik o'rtasida uzviy bog'lanish borligini qayd etgan holda, iqtisodiy inqirozlarning sababini pul muomalasidagi buzilishlardan axtaradilar."
        ]
    },
    {
        "word": "Monitoring",
        "type": [],
        "definition": [
            "tizim yoki obyekt holatini kuzatish, baholash, bashorat qilish, uning faoliyatini nazorat qilish."
        ]
    },
    {
        "word": "Monopoliyaning Oʻlik Yuki Yoki Jamiyatning Sof Yoʻqotishi",
        "type": [],
        "definition": [
            "monopolist bo'lmagandagi mahsulot ishlab chiqarish hajmidan monopolist ishlab chiqargan mahsulot ayirmasiga teng."
        ]
    },
    {
        "word": "Monopolistik Raqobat",
        "type": [],
        "definition": [
            "bozor strukturasi, unda ko'p sotuvchilar o'xshash, ammo ayrim tasniflari bilan farq qiladigan mahsulotlarni sotadilar.Monopolistikraqobatdamukammal (sof) raqobatdagidan farqli o'laroq, nisbatan ko'p bo'lmaydigan (ularning 1 miqdori 25, 35, 60 yoki 70 ta bo'Isa kifoya) sonli sotuvchilar harakat qiladilar. Monopolistik raqobatga quyidagi belgilar xos: a) sotuvchilarning narx ustidan nazoratijuda cheklangan; b) mahsulot siyosati, o'ralishi, joylashtirilishi va xizmatlar to'plami bo'yicha tabaqalashtirilgan. 1. Raqobat narxiy va g'ayri-narxiy usullarda olib boriladi. 2. Tarmoqqa kirish va chiqish hech qanday qiyinchiliklarsiz amalga oshiriladi"
        ]
    },
    {
        "word": "Monopoliya",
        "type": [],
        "definition": [
            "(yun. tanho sotaman) - iqtisodiyotning biron-bir sohasidagi tanho hukmronlik. Monopohya ishlab chiqarish vositalari, ish kuchi va yaratilgan mahsulotlar asosiy qismining yagona yoki ozchilik korxonalar, tadbirkor shaxslar yoki davlat qo'lida to'planishi natijasida paydo bo'ladi. Monopol korxonalar hukmronlik mavqeyidan foydalanib, sarflarni kamaytirish, monopol baho belgilash orqali foyda ko'rish, raqobatning yo'qligi yoki zaifligidan bozorda o'z izmini o'tkazishi mumkin. Monopoliya bozor munosabatlarini cheklaydi, shu sababli davlatlar antimonopol chora-tadbirlar joriy etadilar. Monopoliya o'z tabiatiga ko'ra ishlab chiqarishda turg'unlik paydo qiladi, chunki monopol mavqega tayanib, sarflarni kamaytirmay foyda ko'rish, raqobatning yo'qligi yoki zaifligidan foydalanib, bozorda o'z izmini o'tkazishi mumkin. Monopoliya bozor munosabatlarini cheklaydi."
        ]
    },
    {
        "word": "Monopoliyadan Chiqarish",
        "type": [],
        "definition": [
            "raqobat munosabatlarini rivojlantirishga yo'naltirilgan davlat tomonidan tartib-qoidalarning joriy etilishi. Bunda yirik korxonalar va xo'jalik tuzilmalari maydalashtiriladi yoki parallel tuzilmalar tashkil etiladi. Shu bilan birga, tarmoqqa yangi ishlab chiqaruvchilar kirishi uchun turli xil rag'batlantiruvchi sharoitlar yaratiladi."
        ]
    },
    {
        "word": "Monopsoniya",
        "type": [],
        "definition": [
            "bozor holati. Bunda bozorda bir nechta o'zaro raqobat qiladigan korxonalar tovar ishlab chiqaruvchilar bo'lib, xaridor esa tanho bo'ladi. Natijada xaridor hukmini o'tkazib, bozorda yetakchi mavqeni egallaydi, ishlab chiqaruvchilarni narxni pasaytirishga majbur qiladi."
        ]
    },
    {
        "word": "Moslashtirilgan Tovar",
        "type": [],
        "definition": [
            "tovarning aniq iste’molchilar talab-istaklari va xususiyatlari, konkret iste’mol sharoitlariga moslashtirilgan"
        ]
    },
    {
        "word": "Motiv",
        "type": [],
        "definition": [
            "ma’lum ehtiyojlarni qondirish uchun asos bo'ladigan kishining ichki faoliyat mazmuni"
        ]
    },
    {
        "word": "Motivatsiya",
        "type": [],
        "definition": [
            "o'z-o'zini va boshqalarni shaxsiy va tashkilot umumiy maqsadlariga erishishga qiziqtirish (rag'batlantirish) jarayoni. Real mehnat xulq-atvorini tushuntirish, asoslab berish uchun sabablar (mulohazalar) tanlashga qaratilgan og'zaki xatti-harakatdir."
        ]
    },
    {
        "word": "Motivlashtirish",
        "type": [],
        "definition": [
            "ruhiy omil bo'lib, shaxs faoliyatining manbayi, sababi, dalili va har xil ehtimollaridir. U xodimlarni jonli mehnat faoliyatiga rag'batlantiruvchi kuchli vositadir."
        ]
    },
    {
        "word": "Mualliflik Huquqi",
        "type": [],
        "definition": [
            "qonun tomonidan adabiyot asarlari, musiqa, tasviriy sanat kabi ijodiy ishlaming mualliflariga qaratilgan himoya shakli. Mualliflik huquqi egalariga ma’lum ekskluziv huquq, shu jumladan, o'z ishlarini nashr qilish, qayta nashr qilish va ko'paytirish, o'z asarlarini sotish va nusxalarini tarqatish, ijro etish va yozish huquqi beriladi."
        ]
    },
    {
        "word": "Muammoli Oʻqitish",
        "type": [],
        "definition": [
            "o'quv mashg'ulotini tashkil etish shakli bo'lib, unda pedagog rahbarligida muammoli vaziyat yuzaga keltiriladi va uning hal qilinishida ta’lim oluvchilar faol mustaqil harakat qiladilar"
        ]
    },
    {
        "word": "Muammoli Ssudalar",
        "type": [],
        "definition": [
            "qaytarilish muddati kelgan, lekin bank mijozining to'lovga noqobilligi tufayli to'lanmayotgan ssudalardir"
        ]
    },
    {
        "word": "Muddati Oʻtgan Kreditlar",
        "type": [],
        "definition": [
            "kredit shartnomasida belgilangan qaytarish muddati, shuningdek, garchi ularning muddati uzaytirilgan bo'lsa, uzaytirish muddati ham tugagan qarzlardir. Muddati o'tgan kreditlar iqtisodiy mohiyatiga ko'ra qayta rasmiylashtirilgan hisoblanadi. Chunki kredit shartnomasida muddati o'tkazib yuborilganligi uchun oshirilgan foiz stavkalarini qo'llash ko'zda tutiladi."
        ]
    },
    {
        "word": "Muddati Uzaytirilgan Kredit",
        "type": [],
        "definition": [
            "ayrim hollarda kreditni qaytarish muddati kelmasdan awal qarzdor tomonidan bankka taqdim etilgan iqtisodiy asoslangan yozma iltimosnoma asosida kreditni qaytarish muddatini keyinroqqa surish to'g'risida filial kredit komissiyalari qarorlari asosida Bosh bank kredit qo'mitasi bilan kelishilgan holda ijobiy qaror qabul qilingan qarzlar."
        ]
    },
    {
        "word": "Muddatli Kredit",
        "type": [],
        "definition": [
            "kredit shartnomasiga ko'ra to'lov muddati hali yetib kelmagan ssudadir."
        ]
    },
    {
        "word": "Muhofaza Muddatini Uzaytirish",
        "type": [],
        "definition": [
            "birlik mahsulot uchun zarur bo'Igan tovar moddiy zaxiralar o'zgarish koeffitsiyentini qoplash uchun zarur bo'Igan muddat."
        ]
    },
    {
        "word": "Muhtojlik",
        "type": [],
        "definition": [
            "kishining o'z hayoti va faoliyatida biror narsa yetishmayotgani, zarur bo'layotganini his qilishi; biror narsaga zaruriyat."
        ]
    },
    {
        "word": "Mujassamlashtirilgan Marketing Strategiyasi",
        "type": [],
        "definition": [
            "korxona butun marketing kuch-g'ayratini bozorning bir yoki bir necha bo'g'iniga mujassamlashtirishdan iborat marketing turi yoki strategiyasi"
        ]
    },
    {
        "word": "Mukammal (Sof) Raqobat",
        "type": [],
        "definition": [
            "yuzlab, minglab mustaqil sotuvchi, xaridorlar mavjudligi hamda ularning erkin ravishda bozorga kirishi va undan chiqa olishi bilan tasniflanadigan bozor strukturasi. Ishlab chiqaruvchilarning har biri bozorda bir xil mahsulot sotishning kichik ulushiga ega bo'lganlari sababli bozor narxiga ta’sir eta ololmaydigan, shuningdek, unda bir xil mahsulot sotilgani uchun g'ayri-narxiy raqobat usulidan foydalanilmaydi. Amalda mukammal raqobat sof holda kam uchraydi. Ammo bir qator tarmoq bozorlari mavjud bo'lib, ular nisbatan shunday strukturaga ega. Masalan, qishloq xo'jaligi mahsulotlari bozori."
        ]
    },
    {
        "word": "Mukammal Boʻlmagan Raqobat",
        "type": [],
        "definition": [
            "sotuvchi va xaridorlarning soni cheklanganligi, bozorga kirish va chiqish qiyinligi, ayrim hollarda umuman mumkin emasligi, bozor agentlari narx darajasi va ishlab chiqarish ko'lamiga tasir eta olishi bilan xarakterlanadigan bozor strukturasi. Uning monopolistik raqobat, oligopoliya va monopoliya turlari mavjud (ushbu tushunchalarga qarang)."
        ]
    },
    {
        "word": "Mukofot",
        "type": [],
        "definition": [
            "tashkilot xodimlariga aniq natija uchun asosiy ish haqidan tashqari beriladigan qo'shimcha haq"
        ]
    },
    {
        "word": "Mulk",
        "type": [],
        "definition": [
            "birorta narsaga, mulkka egalik qilish; ega bo'lish; mulk, mol-mulk, ko'chmas mulk. Mulkchilik kishilar o'rtasida ishlab chiqarish vositalari va mehnat mahsulini o'zlashtirish yuzasidan paydo bo' lgan mulkiy munosabatlardir. Mulkning obyekti fuqaro yaratgan moddiy va madaniy boyliklar, tabiat boyliklari, intellektual mehnat mahsuli va mehnat qobiliyati hisoblanadi. Jamiyatda mulk turli shakllarda namoyon bo'lishi mumkin: xususiy, jamoa, davlat, aralash mulk va hokazo."
        ]
    },
    {
        "word": "Mulk Daromadi",
        "type": [],
        "definition": [
            "mablag' yoki noishlab chiqarish aktivini boshqa institutsion birlik ixtiyoriga berganlik uchun moliya aktivi yoki noishlab chiqarish aktivi sohibi oladigan daromad mulk daromadi deyiladi."
        ]
    },
    {
        "word": "Mulk Obyekti",
        "type": [],
        "definition": [
            "inson yaratgan moddiy va madaniy boyliklar, tabiat boyliklari, intellektual mehnat mahsuli va insonning mehnat qobiliyati (ish kuchi)."
        ]
    },
    {
        "word": "Mulk Soligʻi",
        "type": [],
        "definition": [
            "davlat tomonidan yuridik va jismoniy shaxslar (aholi, korxona va tashkilot) mulkidan majburiy undiriladigan to'lovlar"
        ]
    },
    {
        "word": "Mulk Soligʻi (Mulkiy Soliq)",
        "type": [],
        "definition": [
            "o'z tarkibiga ko'chmas mulk (yer, binolar) solig'i va shaxsiy mulk (asbob-uskunalar, zaxiralar) solig'ini oladi. Mahalliy hokimiyat organlari foydasiga hisoblanib, ko'pgina mamlakatlarda ular daromadlarining asosiy manbayi hisoblanadi. Bizning mamlakatimizda bu soliq yuridik shaxslarning mol-mulki va jismoniy shaxslarning mol-mulkiga solinadigan soliqlarga bo'lingan."
        ]
    },
    {
        "word": "Mulk Subyekti",
        "type": [],
        "definition": [
            "jamiyatda ma’lum ijtimoiy-iqtisodiy mavqega ega bo'lgan kishilar bo'lib, ular jamoa, sinf, tabaqa yoki boshqa ijtimoiy guruhlarga birlashgan bo'ladi."
        ]
    },
    {
        "word": "Mulk Uchun Daromad",
        "type": [],
        "definition": [
            "hamma sektorlarga tegishli ko'rsatkich. Har bir birlik mulk uchun daromad olishi va berishi mumkin."
        ]
    },
    {
        "word": "Mulkchilik",
        "type": [],
        "definition": [
            "kishilar o'rtasida ishlab chiqarish vositalariga egalik qilish va yaratilgan mahsulotni o'zlashtirish yuzasidan paydo bo' lgan, tarixan aniq bir shaklda namoyon bo'luvchi munosabatlar."
        ]
    },
    {
        "word": "Mulkchilik Shakllari",
        "type": [],
        "definition": [
            "davlat, jamoa, xususiy va aralash mulklardir"
        ]
    },
    {
        "word": "Mulkiy Huquqlar",
        "type": [],
        "definition": [
            "agarda firmani barpo qilish uchun ko'pchilik mulkdorlarning mablag'lari foydalaniladigan bo'lsa, bunday korxona korporatsiya deb ataladi"
        ]
    },
    {
        "word": "Mulkiy Soliqqa Tortish",
        "type": [],
        "definition": [
            "soliq to'lovchining mulkidan, ko'p hollarda uning kapitalidan olinadigan soliqlar tizimi. Odatda, progressiv xarakterga ega. Mulkning o'lchami (hajmi, miqdori) oshishiga qarab soliq stavkasi ham ortadi."
        ]
    },
    {
        "word": "Mulkiy Sugʻurta",
        "type": [],
        "definition": [
            "turli ko'rinishdagi mol-mulklarni saqlash bilan bog'liq manfaatlar sug'urta munosabatlarining obyekti hisoblangan sug'urtaning mustaqil tarmog'i. Sug'urtalanuvchining shaxsiy mulki, uning qaramog'ida joylashgan mol-mulklar sug'urtalanishi mumkin. Sug'urtalanuvchi sifatida nafaqat mol-mulk sohiblari, balki mol-mulkning saqlanishi uchun mas’uliyatli bo'lgan jismoniy va yuridik shaxslar ham bo'lishi mumkin."
        ]
    },
    {
        "word": "Multikollinearlik",
        "type": [],
        "definition": [
            "umumiy natijaga birgalikda ta’sir etuvchi omillar o'rtasidagi zich korrelyatsion bog'liqlik."
        ]
    },
    {
        "word": "Multiplikator",
        "type": [],
        "definition": [
            "1. Ko'paytiruvchi; iqtisodiyot ta’limotlarida ma’lum bog'lanishlarni o'rganishda, multiplikatsiya effekti bor joylarda qo'llaniladi. Masalan, Keyns ta’limoti bo'yicha qo'yilgan investitsiya va daromadlar o'rtasidagi bog'lanishni ko'rsatuvchi koeffitsiyent. 2. Akselerator mexanizmi - multiplikator va akseleratorning o'zaro harakati va birgalikda yalpi milliy mahsulot (YaMM) dinamikasiga tasiri. Investitsiyalarning o'sishi YaMM dinamikasiga multiplikativ ta’sir ko'rsatadi. Akseleratsiya qoidasining tasiri natijasida YaMM o'sishi investitsiyalarning tebranishini yuzaga keltiradi."
        ]
    },
    {
        "word": "Multiplikator Samarasi",
        "type": [],
        "definition": [
            "investitsiyalar va davlat sarflarining yalpi milliy mahsulot hajmi ortishiga ta’sirining kuchayishi. Investitsiyalar oshgan sari YaMM hajmi birlamchi pul investitsiyalarga nisbatan katta miqdorda o'sadi, chunki investitsiyalar multiplikatsion (ortib boruvchi) samaraga olib keladi. Birlamchi samaradan keyin ikkinchi, uchinchi va h.k. samaralar vujudga keladi. Bir xil sohalardagi bandlik boshqa tarmoqlardagi bandlikka (hosila sifatida) olib keladi. Xuddi ana shu ortib boruvchi samara multiplikalashgan samara deyiladi."
        ]
    },
    {
        "word": "Munosabatlarning Fondlilik Xususiyati",
        "type": [],
        "definition": [
            "markazlashtirilgan pul fondlari (davlat budjeti, budjetdan tashqari fondlar) va markazlashtirilmagan pul fondlari (korxonalarda shakllantiriladigan moddiy rag'batlantirish, iste’mol va boshqa fondlar)."
        ]
    },
    {
        "word": "Munosabatlarning Pulli Xususiyati",
        "type": [],
        "definition": [
            "yaratilgan qiymatni taqsimlash bilan bog'liq pul munosabatlari hamda turli xil pul fondlarini shakllantirish bilan bog'liq munosabatlar."
        ]
    },
    {
        "word": "Munosabatlarning Taqsimlash Xususiyati",
        "type": [],
        "definition": [
            "birlamchi taqsimlash (ish haqi fondini shakllantirish, foydani shakllantirish va boshqalar) va qayta taqsimlash (ish haqi fondini taqsimlash, foydani taqsimlash, soliqlar)."
        ]
    },
    {
        "word": "Muntazam Rahbarlar",
        "type": [],
        "definition": [
            "korxona va tashkilotlar asosiy faoliyatida band bo'Igan bo'linmalar rahbarlari. Funksional rahbarlar esa asosiy faoliyatda bevosita ishtirok etmaydigan bo'linmalar rahbarlaridir"
        ]
    },
    {
        "word": "Muomala Xarajatlari",
        "type": [],
        "definition": [
            "mahsulotlar muomalasi jarayoniga xizmat qiluvchi xarajatlardan iborat. Ular ikki ko'rinishda bo'lishi mumkin: l) oldi-sotdi jarayoni bilan bog'liq bo'Igan xarajatlar (sofmuomala xarajatlari); 2) ishlab chiqarish jarayonining muomala sohasida ham davom etishi bilan bog'liq bo'Igan xarajatlar (mahsulotlarni saqlash, ortib jo'natish, qadoqlash va boshqalar). Muomala xarajatlari absolyut summalarda va mahsulot aylanmasiga nisbatan foizda ijtimoiy zaruriy xarajatlar chegarasida (doirasida) rejalashtiriladi."
        ]
    },
    {
        "word": "Muqobil Savdo",
        "type": [],
        "definition": [
            "eksport-import harakatlarida muvozanatni ta’minlash uchun tovarlar xaridini ular summasiga teng miqdordagi tovarlar yetkazib berish bilan qo'shib borish kelishuvlari"
        ]
    },
    {
        "word": "Muqobil Standartlar",
        "type": [],
        "definition": [
            "iqtisodiy jarayonni amalga oshirish davridagi o'rtacha bahodan kelib chiqqan holda hisoblangan standartlar."
        ]
    },
    {
        "word": "Muqobillashtirish (Optimallashtirish)",
        "type": [],
        "definition": [
            "topshirilgan chegaraga to'g'ri keladigan muqobillikning tashkil topish jarayoni."
        ]
    },
    {
        "word": "Murojaat Tarqatish",
        "type": [],
        "definition": [
            "ma’Iumotlarni, murojaatni iste’molchilarga yetkazish yo'llari."
        ]
    },
    {
        "word": "Mustaqil Faoliyat Ко ʼ Rsatadigan Auditor",
        "type": [],
        "definition": [
            "auditorlik faoliyatini jismoniy shaxs sifatida yuritishni tashkil etmasdan, xususiy tadbirkor sifatida belgilangan tartibda ro'yxatdan o'tgan auditor faoliyati"
        ]
    },
    {
        "word": "Mutanosib Xarajatlar",
        "type": [],
        "definition": [
            "o'zgaruvchan xarajatlarning bir turi. Bir necha mahsulot yoki ishlar turlariga taalluqli va subyektning ishbilarmonlik faolligi o'zgarsa o'zgarib turadigan xarajatlar"
        ]
    },
    {
        "word": "Mutaxassislar",
        "type": [],
        "definition": [
            "ixtisoslashtirilgan xodimlar bo'lib, ular mavjud bo'lgan axborotlar asosida ishlab chiqarish va boshqaruv xarakteridagi masalalarni hal qilish variantlarini ishlab chiqadilar. Boshqaruv mutaxassislariboshqaruvfunksiyalarivaularningkasbiytayyorgarligi bilan xarakterlanadi. Bosh mutaxassislar, yetakchi mutaxassislar, turli kategoriya darajadagi mutaxassislar farqlanadi. Mutaxassislar guruhiga injenerlar, iqtisodchilar, buxgalterlar, huquqshunoslar, psixologlar va boshqalar kiradi"
        ]
    },
    {
        "word": "Mutlaq, Huquq",
        "type": [],
        "definition": [
            "faqatgina huquq egasi tomonidan yoki uning roziligi bilan qonun hujjatlarida belgilangan tartibda uchinchi shaxsga berilishi mumkin bo'lgan mulkiy huquq."
        ]
    },
    {
        "word": "Muvaqqat Narx",
        "type": [],
        "definition": [
            "ayrim tovarlarga ma’lum vaqt oralig'ida amal qiladigan narx."
        ]
    },
    {
        "word": "Muvozanat Narx",
        "type": [],
        "definition": [
            "talab bilan taklifni tenglashtiruvchi narx. Muvozanat narxga to'g'ri keladigan tovar miqdoriga muvozanat mahsulot miqdori deyiladi."
        ]
    },
    {
        "word": "Muzokaralar",
        "type": [],
        "definition": [
            "ixtiloflarni hal qilish usuli sifatida taktik usullarning majmuyidan iborat bo'lib, qarama-qarshi tomonlarning o'zaro maqbul yechimga kelishlariga qaratilishidir."
        ]
    },
    {
        "word": "Markazlashgan Buxgalteriya",
        "type": [],
        "definition": [
            "hisobni markazlashtirishning yuqori shakli bo'lib, bunda bir xil korxonalar faoliyatining buxgalteriya hisobi bitta markazlashgan hisob organida yig'iladi. Bunda hisob ishlari keng avtomatlashtiriladi. Markazlashtirilgan buxgalteriyani tashkil etish hisobni markazlashtirishning barcha afzalliklaridan to'la foydalanish imkoniyatini beradi."
        ]
    },
    {
        "word": "Markazlashgan Moliyaviy Resurslar",
        "type": [],
        "definition": [
            "makrodarajadagi ijtimoiy ishlab chiqarish ehtiyojlarini qondirib, ularga budjet va budjetdan tashqari fondlarning mablag'lari kiradi"
        ]
    },
    {
        "word": "Markazlashish",
        "type": [],
        "definition": [
            "biror narsaning bir joyda to'planishi, masalan, pul mablag'larining davlat budjetida to'planishi bu markazlashgan pul mablag'lari deyiladi yoki markazlashgan rezervlar va hokazo."
        ]
    },
    {
        "word": "Marketing",
        "type": [],
        "definition": [
            "(ingl. “market” - bozor) - marketing kompaniyalari tomonidan tovar ishlab chiqarish va sotishni amalga oshirish uchun oldindan bozor holatini o'rganish maqsadida olib boriladigan tadqiqotlar va tadbirlar yig'indisi. Dastlab marketing nazariyasi bozorni o'rganish bo'yicha uslublar sifatida o'ziga xos amaliy va nazariy masalalarni jonlantirgan. Marketing rivojlanishining asosiy sabablari iste’mol bozorini tovar va xizmatlarga to'yintirishning nisbiy darajada ekanligi iste’molchilar uchun raqobatning kuchayishi, ilmiy asosda ishlab chiqarishning o'sishi. Asosiy shart iste’molchini topish va talabini qondirishdir. Marketingning asosiy vazifasi iste’molchilar iste’mol talablarini ishlab chiqarish jarayonigacha o'rganish. Marketing xizmati bozor to'g'risidagi ma’lumotlarga asoslanadi. Marketing ishlab chiqarish jarayonixarajatlarikamayishiga,tijoratva iqtisodiyotning samarali bo'lishiga ta’sir etadi. Marketingning turli faoliyat sohalari va o'z strategiyasi, prinsiplari va qoidalari mavjud. Marketing, asosan, ikki vazifa bajaradi: bir tomondan, mavjud va potensial talablarni qondirishga ishlab chiqarishni yo'naltirish, ikkinchi tarafdan talabni tarkib toptirish va rag'batlantirish"
        ]
    },
    {
        "word": "Marketing Axborot Tizimi",
        "type": [],
        "definition": [
            "(MAT) - l) marketing tadbirlarini rejalashtirish, hayotga tatbiq etish va nazorat qilish maqsadida aniq, dolzarb ma’lumotlarni o'z vaqtida to'plash, tasniflash, tahlil qilish, baholash va undan marketing sohasida foydalanish maqsadida tarqatish uchun mo'ljallangan metodik usullar, asbob-uskunalar va odamlarning muntazam faoliyat ko'rsatuvchi o'zaro aloqalar tizimi; 2) marketing sohasida qarorlami ishlab chiqish va qabul qilish jarayonida foydalaniluvchi ma’lumotlarni to'plash, tahlil qilish va yetkazish usullari, asbob-uskunalar va xodimlar majmuyi."
        ]
    },
    {
        "word": "Marketing Budjeti",
        "type": [],
        "definition": [
            "firmaning marketing faoliyatini amalga oshirishdagi xarajatlar, foyda va daromadlar miqdori detallashtirilgan tarzda (marketing kompleksi elementlari yoki marketing tadbirlari bo'yicha) aks ettirilgan ko'rsatkichlar tizimi, marketingning moliyaviy rejasi, korxona marketing rejasining bo'limi. Marketing budjetini rejalashtirish maqsadli foydaga asoslanishi yoki foydani optimallashtirishdan kelib chiqishi mumkin."
        ]
    },
    {
        "word": "Marketing Chora-Tadbirlarining Iqtisodiy Samara Dorligi",
        "type": [],
        "definition": [
            "l) marketing chora-tadbirlarini amalga oshirish samarasining (natijasi) buning uchun sarflangan barcha xarajatlar miqdoriga nisbati; 2) marketing majmuasining (marketing-miks) samaradorlik ko'rsatkichi natural va qiymat shaklida o'Ichanadi"
        ]
    },
    {
        "word": "Marketing Faoliyati",
        "type": [],
        "definition": [
            "l) tadbirkorlik sohasida bajariladigan ishlar va vazifalar turi; 2) talabni shakllantirish va takror ishlab chiqarish, firmaning foyda olishini ta’minlash maqsadida amalga oshiriluvchi marketing funksiyalari (marketing tadqiqotlari, savdo, narxning hosil bo‘lishi, tovarni yetkazib berish, marketing razvedkasi, benchmarketing va h.k.) bilan bog'liq faoliyat; 3) bozor iqtisodiyotida takror ishlab chiqarish zanjirining barcha bo'g'inlarida marketing vositalari va falsafasini qo'llash jarayonini qamrab oluvchi hamda tovar yoki xizmat talabini qondirish va foyda keltirish uchun nimani, qayerda, qancha va qanday qilib ishlab chiqarish lozim degan savollarga javob berishga imkon beruvchi har qanday faoliyat."
        ]
    },
    {
        "word": "Marketing Faoliyatining Iqtisodiy Samaradorligi",
        "type": [],
        "definition": [
            "l) marketing faoliyatining oraliq va yakuniy maqsadlarini amalga oshirishgajavobberuvchinisbatanko'pturli(marketingjarayonining barcha bosqichlari bo'yicha) natija; 2) marketing faoliyatini amalga oshirish samarasining (natijasi) bu jarayonda sarflanuvchi barcha xarajatlarga nisbati; 3) marketing faoliyati bilan bog'liq xarajatlar qaytimi natural yoki qiymat (narx) shaklida aks ettirilgan natija va samaraning marketing faoliyatini tashkil etish hamda amalga oshirish uchun zarur bo'lgan barcha (moddiy-texnik mehnat va hokazo) resurslarga nisbati yordamida baholanadi."
        ]
    },
    {
        "word": "Marketing Innoyatsiyasi",
        "type": [],
        "definition": [
            "firma tomonidan marketingning yangi uslubini joriy etish (mahsulotning dizayni va qadoqlash, uni joylashtirish, narx belgilash, bozorga chiqarish); agarda u firma tomonidan birinchi marta ishlatilayotgan bo'lsa."
        ]
    },
    {
        "word": "Marketing Jarayoni",
        "type": [],
        "definition": [
            "yangi ehtiyoj va g'oyalami izlab topish, tanlash va ularni tovar yoki xizmatga aylantirish, tovarlarni bozorlarda yoki savdo taqsimot tarmoqlariga sotish bilan bog'liq harakatlar va bosqichlarning tartibga solingan majmuyi."
        ]
    },
    {
        "word": "Marketing Kommunikatsiyalari Tizimi",
        "type": [],
        "definition": [
            "l) marketing tizimining tashqi muhit bilan o'zaro aloqalari jarayonida subyektlar (jo'natuvchi va qabul qiluvchi), vositalar, kanallar, to'g'ri (xabar) va teskari (qabul qiluvchining tahriri) aloqalar majmuyi; 2) insonlar o'rtasidagi o'zaro aloqa shakli va vositalari majmuyi."
        ]
    },
    {
        "word": "Marketing Konsepsiyasi",
        "type": [],
        "definition": [
            "l) bozor munosabati sharoitlarida faoliyat ko'rsatayotgan firma, tashkilot yoki shaxsning ish yuritish, tadbirkorlikni tashkil etish falsafasi; 2) korxonaning yakuniy maqsadi - daromad olish va iste’molchilar ehtiyojini qondirish uchun foydalaniluvchi marketing faoliyatining asosiy vositalari, qoidavag'oyalari tizimi. Atrofdagi aniq hoIatga,bozormunosabatlari rivojlanish darajasiga qarab ananaviy, ishlab chiqarish, savdo, tovar, ijtimoiy va servis konsepsiyalarini ajratib ko'rsatish mumkin"
        ]
    },
    {
        "word": "Mobil Taʼlim ",
        "type": [],
        "definition": [
            "ta’lim berish va о‘rganish jarayonini qо‘llab-quvvatlash uchun portativ kompyuterlar, planshetlar, MR3 pleyerlar va smartfonlar kabi mobil texnologiyalardan foydalanish jarayoni.  "
        ]
    }
]