[
    {
        "word": "Nafaqa",
        "type": [],
        "definition": [
            "aholining ijtimoiy yordamga muhtoj qatlamlarining moddiy ta’minoti.Unafaqagamuhtojliktanolinganda,qonunhujjatlaribilan asoslanganda tayinlanadi va ijtimoiy ta’minot fondlari hisobidan to'lanadi. Nafaqa vaqtinchalik mehnat qobiliyatini yo'qotganda, homiladorlik va tug'ishda, bola tug'ilganda, bola parvarishi bo'yicha va shunga o'xshash boshqa holatlarda mamlakat fuqarolariga beriladigan doimiy ravishdagi yoki bir martalik pul to'lanmasi. "
        ]
    },
    {
        "word": "Naflik ",
        "type": [],
        "definition": [
            "iqtisodiy ne’matlar, shaxs ehtiyojini qondirish darajasi. Ne’mat inson ehtiyojini qancha to'laroq qondirsa, uning nafligi shuncha yuqori bo'ladi."
        ]
    },
    {
        "word": "Naflik Funksiyasi ",
        "type": [],
        "definition": [
            "iste’mol qilingan ne’matlar miqdorining o'zgarishi natijasida olinadigan naflikning o'zgarishini ifodalovchi funksiya."
        ]
    },
    {
        "word": "Naflilik",
        "type": [],
        "definition": [
            "ne’matning ehtiyojlarni qondira olish layoqati. Mehnat mahsuli ikki hil xususiyatga ega, ya’ni iste’mol qiymatiga, ma’lum bir naflilikka va qiymatga ega bo'ladi. Ne’matlarning naflilik darajasi turli xilda ifodalanadi hamda jismoniy va huquqiy sub’yektlarning ma’lum bir iste’mol darajalarini qanoatlantiradi."
        ]
    },
    {
        "word": "Naqd Pulsiz Hisob-Kitoblar ",
        "type": [],
        "definition": [
            "korxona va tashkilotlarning tovar ayirboshlash, xizmat ko'rsatish va tovarsiz operatsiyalari bo'yicha bir-biriga bo'lgan talab va majburiyatlarni naqd pul ishlatmasdan pul mablag'larini bir hisob-varaqdan ikkinchi hisob-varaqqa o'tkazish orqali amalga oshirish tushuniladi."
        ]
    },
    {
        "word": "Naqd Pulsiz Oborot",
        "type": [],
        "definition": [
            "pul oborotining bir qismi bo'lib, unda pullar harakati o'zaro talablar hisobiga kredit muassasalardagi schyotlar bo'yicha pul o'tkazish yo'li bilan amalga oshiriladi va bunda naqd pullar ishlatilmaydi."
        ]
    },
    {
        "word": "Naqd Toʻlovlar",
        "type": [],
        "definition": [
            "tovar haqi etkazib berilganidan keyin sotuvchilar taqdim etgan hujjat bo'yicha shu zahoti yoki avans bilan to'lash. Xalqaro savdoda naqd to'lovlar chek, pul o'tkazish, akkreditiv va inkasso orqali amalga oshiriladi."
        ]
    },
    {
        "word": "Narx",
        "type": [],
        "definition": [
            "tovar qiymatining pulda ifodalanishi. Narxni tovar qiymati belgilaydi, ammo bozor sharoitida u aniq qiymatdan yuqori yoki kam bo'lishi mumkin, bu esa bozordagi o'sha tovarga bo'lgan talab va uning taklifiga bog'liq bo'ladi. Tovar narxining darajasi, shuningdek, tovarning ijtimoiy foydaliligi, sifati va boshqa tovarlar o'rnini bosa olishi muomaladagi pulning xarid quwatiga ham bog'liq bo'ladi. Bozor iqtisodiyoti sharoitida erkin narxning quyidagi turlari mavjud bo'ladi: chakana, ulgurji, xalqaro, auksion, kelishuv, davlat belgilagan yoki davlat boshqarib turadigan narxlar."
        ]
    },
    {
        "word": "Narx Belgilashda Peshqadamlik",
        "type": [],
        "definition": [
            "oligopolik bozordagi firma mahsulotga narxni belgilaydi, boshqa firmalar esa peshqadam belgilagan narxni hisobga olib, unga yaqin qilib narx qo'yadilar."
        ]
    },
    {
        "word": "Narx Bilan Raqobatlashuv ",
        "type": [],
        "definition": [
            "bozordagi raqobat usullaridan biri. Bozor narxini o'zgartirish orqali raqibni bozordan siqib chiqarib, o'z mavqeyini mustahkamlash. "
        ]
    },
    {
        "word": "Narx Chegirimi (Tashlamasi) ",
        "type": [],
        "definition": [
            "ayrim hollarda tovar narxidan ma’lum qismi chegirib, olib tashlanishi yo'libilan pasaytirilgan narx."
        ]
    },
    {
        "word": "Narx Chizigʻ1 ",
        "type": [],
        "definition": [
            "bir tovar narx diapazoni oralig'ida uning turli variantlariga har xil narxlar belgilash."
        ]
    },
    {
        "word": "Narx Diapazoni",
        "type": [],
        "definition": [
            "aniq tovar narxining eng yuqori va eng quyi chegaralari oralig'i. "
        ]
    },
    {
        "word": "Narx Diskriminatsiyasi ",
        "type": [],
        "definition": [
            "bunda firma bir xil tovarni turli narxda sotib olish imkoniyati har xil bo'Igan xaridorlarga sotadi. "
        ]
    },
    {
        "word": "Narx Hosil Boʻlish Usullari ",
        "type": [],
        "definition": [
            "mahsulot va xizmatlar narxini shakllantirishda qo'llanuvchi usullar. Ularning xarajatlarga, xaridorlar liniyasiga va raqobatchilar narxiga asoslangan turlari mavjud."
        ]
    },
    {
        "word": "Narx Kafolati ",
        "type": [],
        "definition": [
            "ishlab chiqarish va savdo korxonasi omborida saqlanib, jo'natiladigan tovarlar qiymatini yo'qotmasligi uchun xaridor olib ketadigan paytda amal qilayotgan eng quyi narxdan past narx. "
        ]
    },
    {
        "word": "Narx Mexanizmi ",
        "type": [],
        "definition": [
            "narx signallari asosida resurslami taqsimlash va ulardan foydalanish (qarang: bozor mexanizmi)."
        ]
    },
    {
        "word": "Narx Omillari ",
        "type": [],
        "definition": [
            "narxning shakllanishiga, uning o'zgarishiga ta’sir etuvchi omillar: qiymat, raqobat, naflik, talab va taklif. Ular harakati bir yo'nalishda bormay, narx darajasiga nisbatan qarama-qarshi ta’sir etishi mumkin. Ushbu omillardan biri narxni ko'tarsa, boshqasi pasaytiradi. Masalan, qiymatning pasayishi narxni arzonlashtiradi, talabning ortishi uni qimmatlashtiradi. Naflikning yuqori bo'lishi yuqori narxni taqozo etsa, raqobat kurashi uni pasaytiradi. "
        ]
    },
    {
        "word": "Narx Raqobati",
        "type": [],
        "definition": [
            "bozor narxini o'zgartirish orqali raqibni bozordan siqib chiqarish va o'z mavqeyini mustahkamlash."
        ]
    },
    {
        "word": "Narx Siyosati ",
        "type": [],
        "definition": [
            "narx va narx xosil bo'lishini boshqarish tadbir va strategiyalari, tovar yoki xizmatlarga ishlab chiqarish xarajatlari va bozor kon’yunkturasiga mos keluvchi, xaridomi qondiruvchi va rejalashtirilgan foydani keltiruvchi narx belgilash san’ati."
        ]
    },
    {
        "word": "Narx Ustamasi ",
        "type": [],
        "definition": [
            "tovarning hisoblab chiqarilgan haqiqiy narxi ustiga qo'yiladigan qo'shimcha (ishlab chiqarish korxonasi) ustamasi, savdo ustamasi."
        ]
    },
    {
        "word": "Narx Yordamida Raqobatlashuv",
        "type": [],
        "definition": [
            "narxlarni tushirish yordamida olib boriladigan raqobat kurashining turi bo’lib, u raqobatchilardan mahsulot narxini pasaytirishni talab etadi. Buning uchun esa tadbirkor ishlab chiqarishni yangi texnika va texnologiya bilan ta’minlashi, mehnatni ilmiy tashkil etish yo'li bilan xarajatlami pasaytirishga erishishi shart. "
        ]
    },
    {
        "word": "Narx-Franko ",
        "type": [],
        "definition": [
            "- tovarnixaridorga tashib etkazib berish sarflarini ham o'z ichiga olgan ulgurji narx. U odatdagi transport sarflarining kiritilganligi bilan farqlanadi."
        ]
    },
    {
        "word": "Narxlar (Narxli) Raqobati ",
        "type": [],
        "definition": [
            "- narx vositasida raqobatni amalga oshirib, raqiblarning bir-biriga nisbatan narxni pasaytirib borishlari."
        ]
    },
    {
        "word": "Narxlar Indeksi ",
        "type": [],
        "definition": [
            "har xil vaqt oralig'ida tovar va xizmatlarga narxning muvozanati o'zgarishini aks ettiruvchi ko'rsatkich."
        ]
    },
    {
        "word": "Narxlarjangi ",
        "type": [],
        "definition": [
            "raqobatlashuvning narx vositasida olib boriladigan usuli .Uni olib borishdan maqsad muttasil yoki, uzoq vaqt narxlarni pasaytirib borish orqali raqiblarni tarmoqdan siqib chiqarishdir."
        ]
    },
    {
        "word": "Narxlar Korrektirovkasi",
        "type": [],
        "definition": [
            "bozor vaziyati o'zgarishiga narxlarning moslashuv jarayoni."
        ]
    },
    {
        "word": "Narx-Navo",
        "type": [],
        "definition": [
            "tovarlar narxlari, xizmatlar tariflari, to'lovlar, kreditlar, sug'urta foizlari (stavkalari) va narxningboshqa ko'rinishlari hamda ularning harakati. "
        ]
    },
    {
        "word": "Narxni Oʻzgartirmay Raqobatlashuv",
        "type": [],
        "definition": [
            "bozordagi raqobat usuli, o'z tovarlarini sotish shart-sharoitini xaridor uchun qulaylashtirib, raqibni bozordan siqib chiqarish. "
        ]
    },
    {
        "word": "Narxni Oʻzgartirmay Raqobatlashuv",
        "type": [],
        "definition": [
            "o'z tovarlarini sotish shart-sharoitini xaridor uchun qulaylashtirib, raqibni bozordan surib chiqarish."
        ]
    },
    {
        "word": "Narxning Qayd Qilinishi",
        "type": [],
        "definition": [
            "raqib korxonalarining o'zaro kelishib, o‘xshash tovarlarga bir xil narx belgilashi."
        ]
    },
    {
        "word": "Narxsiz Raqobat",
        "type": [],
        "definition": [
            "narxga tegmay raqobatlashuv (mahsulot sifati, o'rami, savdo xizmati, rag'batlantirishni oshirish, yuqori texnologiyani o'zlashtirish, savdo taqsimoti va siljitishni yaxshilash va boshqalar)."
        ]
    },
    {
        "word": "Narxsiz Raqobatlashuv ",
        "type": [],
        "definition": [
            "raqobat kurashining bir turi, u tovarlarning texnik tasnifi va uning xossalarini (sifatini oshirish, qo'shimcha xizmatlarni taklif etish, dizayn va h.k.) o'zgartirish orqali amalga oshiriladi, shuningdek, unda reklama muhim o'rin tutadi."
        ]
    },
    {
        "word": "Natura Oʻlchovi",
        "type": [],
        "definition": [
            "hisobga olinayotgan narsaning harakatini, masalan, material, mahsulot va boshqalami natura holida ifodalash uchun xizmat qiladi. Turli xil xo'jalik mablag'larini qo'shishda natura o'lchovidan foydalanilmaydi."
        ]
    },
    {
        "word": "Natura Shaklidagi Asosiy Transfert",
        "type": [],
        "definition": [
            "agar transfertda mulk aktiv uchun berilsa, natura shaklidagi asosiy transfert ro'y bergan bo'ladi. Bundan moddiy aylanma vositalar zaxirasi mustasnodir."
        ]
    },
    {
        "word": "Natura Shaklidagi Boshqa Ijtimoiy Taʼminot Nafaqalari",
        "type": [],
        "definition": [
            "nafaqalar natura shaklidagi ijtimoiy transfertlami o'z ichiga oladi. Ijtimoiy ta’minot jamg'armalari tomonidan uy xo'jaliklariga to'lov sifatida berilgan nafaqalar bundan mustasnodir."
        ]
    },
    {
        "word": "Natura Shaklidagi Ijtimoiy Transfert",
        "type": [],
        "definition": [
            "umum davlat boshqaruvining individual iste’moli, ijtimoiy ta’minot va notijorat tashkilotlarning jamg'armalari tizimi tarkibidagi natura tarzidagi ijtimoiy transfertlar."
        ]
    },
    {
        "word": "Natura Shaklidagi Ijtimoiy Transfertdan Tashqari Ijtimoiy Nafaqalar ",
        "type": [],
        "definition": [
            "ijtimoiy ta’minotda natura bilan beriladigan nafaqalar hamda nafaqa sifatida natura bilan beriladigan ijtimoiy yordamlar. Bu qoidadan ijtimoiy ta’minotda natura shaklida beriladigan nafaqalar hamda ijtimoiy yordam sifatida natura bilan beriladigan nafaqalar istisnodir. "
        ]
    },
    {
        "word": "Natura Shaklidagi Ijtimoiy Transfertlar ",
        "type": [],
        "definition": [
            "umumdavlat boshqaruvi birliklari (ijtimoiy ta’minot jamg'armalari ham qo'shiladi) va notijorat tashkilotlar natura shaklidagi transfertlar sifatida yolg'iz uy xo'jaliklariga individual tovar va xizmat shaklida yetkazib beradigan transfertlar. Natura shaklidagi bu transfertlar bozorda sotib olingan yoki bozorga mo'ljallanmagan mahsulot sifatida umumdavlat boshqaruv birliklari yoki notijorat tashkilotlarda ishlab chiqarilgan bo'lishi ham mumkin. "
        ]
    },
    {
        "word": "Natura Shaklidagi Ijtimoiy Yordam Nafaqasi",
        "type": [],
        "definition": [
            "umumdavlat boshqaruv birliklari va notijorat tashkilotlar tomonidan uy xo'jaliklariga natura shaklida beriladigan transfertlar. Bu nafaqa o'z tabiati bilan natura shaklidagi ijtimoiy taminot nafaqasiga o'xshab ketsa-da, ijtimoiy taminot dasturi doirasidagi nafaqa hisoblanmaydi."
        ]
    },
    {
        "word": "Natura Shaklidagi Transfert",
        "type": [],
        "definition": [
            "tovar yoki aktiv evaziga bevosita mulk berilsa, natura shaklidagi transfert ro‘y beradi. Bu turdagi transfertda naqd pul ishtirok etmaydi, ko'rsatilgan xizmat uchun ekvivalent sifatida hech narsa qaytarilmaydi. "
        ]
    },
    {
        "word": "Natural Daromad ",
        "type": [],
        "definition": [
            "mehnat haqi hisobiga olinadigan va uy xo'jaliklarining o'z iste’moli uchun ishlab chiqargan mahsulotlari."
        ]
    },
    {
        "word": "Natural О ʼLchovlar",
        "type": [],
        "definition": [
            " buxgalteriya hisobidagi o'lchovlarning biri bo'lib, uning yordamida buxgalteriya hisobi ob’yektlari to'g'risida natural (massa, uzunlik, metr va h.k.) ko'rinishidagi ko'rsatkichlar olinadi. Natural o'lchovlar asosiy vositalar, materiallar, tovarlar va boshqa moddiy qiymatliklarni hisobga olish uchun qo'llaniladi. Natural ko'rsatkichlar kattanazoratahamiyatigaega.Buko'rsatkichlarxo'jalik mablag'larini baholash yo'li bilan pul o'lchoviga aylantiriladi."
        ]
    },
    {
        "word": "Natural Xoʻjalik",
        "type": [],
        "definition": [
            "tarixan eng dastlab tarkib topgan xo'jalik shakli bo'lib, unda mahsulotlar bozorda sotish uchun emas, balki xo'jalikning o'zida uning xodimlari va yaratuvchilari iste’moli uchun yetishtiriladi. Ishlab chiqaruvchi kuchlar o'sib, ijtimoiy mehnat taqsimoti chuqurlashib borishi natijasida natural xo'jalik o'rnida tovar xo'jaligi yuzaga keladi. Natural xo'jalikka patriarxal dehqon oilasi xo'jaligi, hozirgi oilalarning chorbog' xo'jaligi, shuningdek, ayrim korxonalar (agarda yetishtirilgan mahsulot xodimlarga bepul ulashilsa) misol bo'la oladi."
        ]
    },
    {
        "word": "Navoiy Erkin Industrial Iqtisodiy Zonasi",
        "type": [],
        "definition": [
            "jahon standartlariga j avob beradigan va j ahon bozorlarida talab qilinadigan mahsulot ishlab chiqarishni ta’minlaydigan, zamonaviy yuqori texnologiyali ishlab chiqarishlarni tashkil etish uchun xorijiy investitsiyalarni, birinchi galda to'g'ridan-to'g'ri investitsiyalarni jalb etish bo'yicha qulay shart-sharoitlar yaratish, shuningdek, Navoiy viloyatining sanoat salohiyatini, ishlab chiqarish, transporttranzit va ijtimoiy infratuzilmasini rivojlantirish maqsadida O'zbekiston Respublikasi Prezidentining 2008 yil 3 dekabrdagi “Navoiy viloyatida erkin industrial iqtisodiy zona tashkil etish to'g'risida’gi qarori asosida tashkil etilgan. “Navoiy” erkin industrial iqtisodiy zona hududida xo'jalik yurituvchi subyektlar faoliyatining asosiy yo'nalishi - zamonaviy xorijiy yuqori unumli asbobuskunalar va texnika, texnologik liniyalar va modullar, innovatsiya texnologiyalarini joriy etish hisobiga yuqori texnologiyali, jahon bozorlarida raqobatbardosh mahsulotlarni keng ko'Iamda ishlab chiqarishdan iborat. "
        ]
    },
    {
        "word": "Nazariya",
        "type": [],
        "definition": [
            "umumlashtirilgan bilim, voqelikning u yoki boshqa tomonlarini izohlash tizimi. Nazariya amaliyot bilan chambarchas bog'liq. Amaliyot va uning natijalari umumlashgan tarzda har qanday nazariyaga uzviy element bo'lib kiradi."
        ]
    },
    {
        "word": "Nazorat",
        "type": [],
        "definition": [
            "boshqaruv elementi sifatida bir vaqtning o'zida moliyani rejalashtirishda hamda operativ boshqarishda qo'llaniladi. Nazorat haqiqiy natija bilan rejadagi ko'rsatkichlarni taqqoslashga yordam beradi, moliyaviy resurslami o'stirish yo'llarini ko'rsatadi va ulardan samarali xo'jalik yuritish yo'llarini ko'rsatib beradi."
        ]
    },
    {
        "word": "Nazorat Paketi",
        "type": [],
        "definition": [
            "egasini (aksiyadorni) aksiyadorlik jamiyatida amaldagi hokimiyat (ovozlarning ko'pligi) bilan ta’minlovchi aksiya ulushi."
        ]
    },
    {
        "word": "Nazorat Taqqoslashlar (Benchmarking) ",
        "type": [],
        "definition": [
            "o'z ustida ishlashdan faoliyatning biror bir sohasidagi dunyo yetakchilarining tajribasini o'rganishga o'tish. "
        ]
    },
    {
        "word": "Nazorat-Hisob Nuqtasi ",
        "type": [],
        "definition": [
            "o'zi ishlab chiqargan yarim fabrikatlarning nazoratini amalga oshirish va hisob yuritish bo'yicha tugallanmagan mahsulotning joyini aniqlash."
        ]
    },
    {
        "word": "Nazoratning Maqsadi ",
        "type": [],
        "definition": [
            "tuzatish choralarini ko'rish, aybdorlarni javobgarlikka tortish va buzishlarning oldini olishdan iborat."
        ]
    },
    {
        "word": "Negotsiant",
        "type": [],
        "definition": [
            "boshqa mamlakatlar bilan yirik savdo ishlarini bajaruvchi tijoratchi, savdogar."
        ]
    },
    {
        "word": "Neoliberalizm",
        "type": [],
        "definition": [
            "iqtisodiyot nazariyasidagi ushbu yo'nalish iqtisodiyotni davlat tomonidan tartiblashga qarshi chiqadi. Hozirgi zamon neoliberalizmi ikkita, chunonchi, bozor xo'jaligi yuritishning samarali shakli sifatida iqtisodiy o'sishga yaxshi sharoit yaratadi va iqtisodiy faoliyat sub’yektlarining erkinligi ustuvor bo‘lishi kerak degan xulosaga asoslanadi. Asosiy vakillari L. fon Mizes (1881- 1973), F. fon Xayek (1899-1992) bo'lib, bu oqim Avstriya maktabi deb ham yuritiladi. Sotsialistik (imperativ) rejalashtirishga qat'iy qarshi, chunki bu rejalangan tartibsizlikka olib keladi, mehnat taqsimoti, xususiy mulk va erkin almashuv tsivilizatsiyaning mutlaq asosi deb sanaladi. Xayek 1974 yilda Nobel mukofoti sovrindori bo'lgan. Neoliberalizm g‘oyalari asosida “Ijtimoiy yo'naltirilgan bozor iqtisodiyoti” yuzaga keladi, uning asoschilari - nemis olimlari V.Rebke (1899-1966), V.Oyken (1891-1950), L.Erhard (1897- 1977)lardir. Bu konsepsiya GFR va Shvetsiyada yaxshi natija berdi, uning asosiy g'oyalari mustaqil O'zbekiston iqtisodiyotida qo'IIanilmoqda. Ijtimoiy yo'naltirilgan bozor iqtisodiyotining asosiy qoidalari: erkin baholarning zarurligi; erkin raqobat; talab va taklifning muvozanati; iqtisodiyotning muvozanati; davlat bozor xo'jaligida shu shartlarni kafolatlashi va uning ijtimoiy yo'naltirilgan rivojini ta’minlash. Neoliberalizm nafaqat ma’muriy-buyruqbozlik tizimidan, balki kapitalizmning erkin raqobatlarga asoslangan davridan ham qat’iyan farq qiladi. Mustaqil O'zbekistonda undan ijobiy foydalanilmoqda."
        ]
    },
    {
        "word": "Netto",
        "type": [],
        "definition": [
            "o'ralmagan holdagi tovarning sof massasi; foiz skidkasini chegirgan holdagi tovarning sof bahosi; xarajatlarni chegirgan holdagi sof daromad."
        ]
    },
    {
        "word": "Netting",
        "type": [],
        "definition": [
            "mijozning barcha pul talablarini uning barcha pul majburiyatlariga nisbatan hisobga olish orqali amalga oshiriladigan kliring usuli."
        ]
    },
    {
        "word": "Netto-Stavka",
        "type": [],
        "definition": [
            "brutto-stavkaning asosiy tarkibiy qismi. Netto-stavka sug'urta qoplamasini to'lashga mo'ljallangan pul mablag'lari resurslari bo'lib, u brutto-stavkaning 90 foizigacha miqdorini tashkil etadi."
        ]
    },
    {
        "word": "Nisbiy Afzallik",
        "type": [],
        "definition": [
            "ayrim iqtisodiy agentlarning tovar va xizmatlarni kamroq xarajatlar evaziga ishlab chiqarish xususiyati. Makrodarajada nisbiy afzallik prinsipi ishlab chiqarish va eksportning samarali strukturasini shakllantirish uchun qo'llaniladi."
        ]
    },
    {
        "word": "Nisbiy Afzallik Prinsipi",
        "type": [],
        "definition": [
            "D.Rikardo tomonidan izohlab berilgan prinsip bo'lib, ishlab chiqarish omillari (kapital, mehnat, yer) xarajatlarining afzalligini ko'rsatadi va tashqi iqtisodiy aloqalarda keng qo'llaniladi. "
        ]
    },
    {
        "word": "Nisbiy Ustunlik",
        "type": [],
        "definition": [
            "ishlab chiqarilayotgan mahsulotning muqobil qiymati boshqa mamlakatlarnikiga nisbatan past bo'lganda, yuzaga kelgan holat. Erkin savdo taqqoslash xarajatlari qoidasiga asoslanganligi sababli jahon iqtisodiyoti resurslarini samarali joylashtirish va farovonlikning yuqori darajasiga erishish imkoniyatiga egadir."
        ]
    },
    {
        "word": "Nizo",
        "type": [],
        "definition": [
            "birgalikda amalga oshiriladigan faoliyat davomida ikki va undan ortiq kishilar o'rtasida maqsadlar, manfaatlar, pozitsiyalar (nuqtai nazar), fikr-mulohazalar yoki g'oyaviy qarashlar asosida yuzaga keladigan keskin kelishmovchilik. Tashkilotlarda yuzaga keladigan konfliktlarning eng xavfli oqibatlaridan biri shuki, vujudga kelgan . va avj ola boshlagan nizo oqibatida inqirozli vaziyat yuzaga kelishi mumkin. Boshqa tarafdan olib qaralsa, inqirozli vaziyatlar ham pirovardida turli xil to'qnashuvlarga sabab bo'lishi mumkin."
        ]
    },
    {
        "word": "Nizolarni Bartaraf Etishga Yoʻnaltirilgan Strategiya",
        "type": [],
        "definition": [
            "vujudga kelgan ixtilof zamiridagi muammoni bartaraf etish yo'llarini izlashga va ziddiyat ishtirokchilarini o'zaro murosaga keltirishga qaratilgan muayyan chora-tadbirlar majmuyi. Ushbu xildagi strategiyani ro'yobga oshirmoq uchun nizolami keltirib chiqargan real sabablar, shart-sharoitlarni chuqur tahlil qilish asosida ulami bartaraf etish vositalarini izlab topish lozim bo'ladi. Tashkiliy-tuzilmaviy, ma’muriy va shaxslararo nizolarni boshqarish tafovutlanadi."
        ]
    },
    {
        "word": "Nizoli Holatning Tahlili",
        "type": [],
        "definition": [
            "nizoli vaziyatni yuzaga keltirgan omillarni aniqlab olib, nizoni yuzaga keltirgan sabablarni, ulami bartaraf etish yo'llari va vositalarini aniqlashga xizmat qiluvchi ish jarayoni. "
        ]
    },
    {
        "word": "Nizom (Ustav)",
        "type": [],
        "definition": [
            "korxonani tashkil qilishning qonuniyligini tasdiqlovchi, korxona xarakteri va faoliyat turi, qoidalari, a’zolar o'rtasidagi munosabatlar va hokazolarni o'z ichiga oluvchi rasmiy hujjat."
        ]
    },
    {
        "word": "Nizoning Rivojlanish Jarayoni ",
        "type": [],
        "definition": [
            "muayyan makon va zamonda nizoni keltirib chiqargan voqealar rivoji, jarayon ishtirokchilarining o'zaro munosabatlarida kuzatiladigan dinamik o'zgarishlar. Ayni jarayonning to'rt bosqichini ajratib ko'rsatish mumkin: nizoning zimdan yetilib borishi, insident (janjal)ning ro'y berishi, o'zaro munosabatlardagi tanglik, nizoning barxam topishi. "
        ]
    },
    {
        "word": "Noaniqlik",
        "type": [],
        "definition": [
            "axborotlar yetarli, to'liq bo'lmaganda qabul qilingan qarorlarda noaniqlik vujudga keladi. Noaniqlik sharoitida qabul qilingan qarorlar natijasida tavakkalchilik vujudga keladi. "
        ]
    },
    {
        "word": "Nobozor Ishlab Chiqarish",
        "type": [],
        "definition": [
            "tovar va xizmatni bozor bahosidan past yoki bepul berishga qaratilgan amaliyot yoki faoliyat turi. "
        ]
    },
    {
        "word": "Nodavlat Moliyaviy Nazorati",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi sub’yektlarning moliyaviy ahvoli va likvidliligi, moliyaviy hisobotlarining ishonchliligi, foydaliligi va to'lovga layoqatliligi ustidan auditorlik firmalari, korxona va tashkilotlarning rahbariyati va moliyaviy xizmatlari, aksionerlari, tijorat banklari, sug'urta firmalari tomonidan amalga oshiriladigan nazorat. "
        ]
    },
    {
        "word": "Nodavlat Moliyaviy Nazoratining Maqsadi",
        "type": [],
        "definition": [
            "joylashtirilgan kapitaldagi foyda normasini oshirish maqsadida davlat foydasidagi ajratmalar va boshqa xarajatlarni minimallashtirish "
        ]
    },
    {
        "word": "Nodiskretsion Fiskal Siyosat",
        "type": [],
        "definition": [
            "iqtisodiy kon’yunkturani o'zgartirish sababli davlat budjeti sarflari va soliqlarning nisbiy darajalaridagi avtomatik o'zgarishlar. Avtomatik deganda shunday iqtisodiy mexanizm tushuniladiki, u iqtisodiy ahvolning o'zgarishiga tezda javob qaytaradi, bunda hukumat hech qanday choralar ko'rmaydi Unga birinchidan soliq tushumlarining o'zgarishi kiradi.Soliqlar miqdori esa daromadlarga bog'liq bo'ladi. Shuning uchun yalpi milliy mahsulotning o'sishi sharoitida, ya’ni iqtisodiyotning ko'tarilishi sharoitida soliq tushumlari avtomatik tarzda oshib boradi, bu esa sotib olish qobiliyatining pasayishi va iqtisodiy o'sishini to'xtatib turadi."
        ]
    },
    {
        "word": "Noemissiyaviy Qimmatli Qogʻozlar",
        "type": [],
        "definition": [
            "emissiyaviy qimmatli qog'ozlar tushunchasiga oid bo'lmagan qimmatli qog'ozlar."
        ]
    },
    {
        "word": "Noishlab Chiqarish Asosiy Vositalari ",
        "type": [],
        "definition": [
            "bunga ishlab chiqarishga taalluqsiz bo'lgan madaniy-maishiy, sog'liqni saqlash muassasalari, kommunal xo'jalik korxonalari va shu kabi tarmoqlar xizmat qiladi va ishlab chiqarish jarayonida qatnashmaydi. Ular ishlatish jarayonida asta-sekin eskirib, o'z qiymatini qisman yo'qotib boradi."
        ]
    },
    {
        "word": "Noishlab Chiqarish Aktivlari (Ishlab Chi Qarilmag An Aktivlar) ",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonining mahsuli."
        ]
    },
    {
        "word": "Nokapitalistik (Kapitalizmni Chetlab) Rivojlanish Konsepsiyasi",
        "type": [],
        "definition": [
            "ilgari qoloq bo'lgan, kapitalizm taraqqiyoti bosqichini to'la bosib o'tmagan mamlakatlar uchun tavsiya etilgan rivojlanish yo'li. Bir qancha mamlakatlar shu yo'ldan borib, sotsializm quryapmiz, deb o'ylagan. Hayot buni inkor etdi."
        ]
    },
    {
        "word": "Nokooperativ Оʼyin ",
        "type": [],
        "definition": [
            "o'yinda qatnashchilar mustaqil ravishda qaror qabul qiladi (iqtisodiyotda misol sifatida oligopolikbozordaharakat qiluvchi firmalar o'rtasidagi “Narxlar jangini” keltirish mumkin)."
        ]
    },
    {
        "word": "Nol Soʻm Yutuqqa Ega Boʻlgan Oʻyin",
        "type": [],
        "definition": [
            "o'yinda bir kishining yutug'i boshqa o'yinchilarning yutqazgan summalari yig'indisiga teng. "
        ]
    },
    {
        "word": "Nol-Gipoteza",
        "type": [],
        "definition": [
            "ikkita to'plam taqqoslanadigan belgilarga qarab bir-biridan farq qilmaydi, deb aytilgan taxmindir"
        ]
    },
    {
        "word": "Nollik Foyda",
        "type": [],
        "definition": [
            "firma faqat buxgalteriya foydasini olishini bildiradi, demakki u iqtisodiy foydani ko'rmaydi. Bu tadbirkor o'ziga tegishli resurslarni jamiyat uchun mumkin bo'lgan minimal (eng kam) samaradorlik bilan ishlatishidan dalolat beradi. Bu tadbirkorni tarmoqda ushlab qolish uchun yetarti hisoblanadi."
        ]
    },
    {
        "word": "Nomaʼqul Talab",
        "type": [],
        "definition": [
            "iste’molchilar va jamiyatga ziyon keltiradigan tovarlarga bo'lgan talab (narkotik moddalar, tamaki mahsulotlari, qurol-yarog' va boshqalar). "
        ]
    },
    {
        "word": "Nomenklatura",
        "type": [],
        "definition": [
            "buyumlar, narsalar, nomlar ro'yxati, masalan: schyot, tovar nomenklaturasi."
        ]
    },
    {
        "word": "Nominal",
        "type": [],
        "definition": [
            "qimmatbaho qogozning blankada (sertifikatda) qayd etilgan boshlangich qiymati."
        ]
    },
    {
        "word": "Nominal Daromad",
        "type": [],
        "definition": [
            "ma'lum bir davr mobayaida narxi dinamikasini inobatga olmaydigan daromadlarning pul summasi."
        ]
    },
    {
        "word": "Nominal Foiz Stavkasi ",
        "type": [],
        "definition": [
            "oriy kurs (inflyatsiyaga to‘g‘rilangan) pul birliklarida ifodalangan foiz stavkasi."
        ]
    },
    {
        "word": "Nominal Ish Haqi",
        "type": [],
        "definition": [
            "ishchi va xizmatchining ma’lum ish vaqt davrida sarflagan mehnatining miqdori va sifatiga ko'ra oladigan pul qiymati. Nominal yalpi milliy mahsulot, joriy narxlarda hisoblangan yalpi milliy mahsulot, YaMM darajasini hisoblash maqsadida nominal YaMM va real YaMM tushunchalar farqlanadi, ya’ni ular pulda hisoblangan ko'rsatkichlar bo'lib, ularning miqdori narxlar ta’sirida o'zgarishi mumkin. Faraz qilamizki, mamlakat joriy yildagi narxlarda hisoblaganda YaMM 465 mlrd doll, tashkil etdi, bu nominal yalpi milliy mahsulotni tashkil etadi. "
        ]
    },
    {
        "word": "Nominal Ish Haqi ",
        "type": [],
        "definition": [
            "pul formadagi ish haqi, faqat pul hajmini ifodalaydi, uning sotib olish qobiliyatini hisobga olmaydi."
        ]
    },
    {
        "word": "Nominal Yaim",
        "type": [],
        "definition": [
            " joriy narxlarda aks ettirilgan yalpi ichki mahsulot."
        ]
    },
    {
        "word": "Nomoddiy Aktivlar",
        "type": [],
        "definition": [
            "korxona tomonidan ulardan ishlab chiqarish, ishlar bajarish, xizmatlar ko'rsatish yoki tovarlarni sotish jarayonida foydalanish maqsadida yoxud ma’muriy va boshqa funksiyalarni amalga oshirish uchun uzoq muddat mobaynida tutib turiladigan, moddiy-ashyoviy mazmunga ega bo'lmagan mol-mulk ob’yektlari."
        ]
    },
    {
        "word": "Nomoddiy Aktivlar",
        "type": [],
        "definition": [
            "moddiy-ashyoviy mazmunga ega bo'lmagan, xo'jalik yurituvchi aktivlar sub’yekt tomonidan xo'jalik faoliyatida foydalanish maqsadida nazorat qilinadigan, shuningdek, uzoq vaqt (bir yildan ko'p) ishlatish uchun mo'ljallangan mol-mulk ob’yektlari."
        ]
    },
    {
        "word": "Nomoliyaviy Korporatsiya",
        "type": [],
        "definition": [
            "nomoliyaviy yoki kvazi korporatsiyalarning asosiy faoliyati moliyaviy vositachilik yoki moliyaviy vositachilik bo'yicha yordamchi faoliyatdangina iborat bo'lib qolmaydi. "
        ]
    },
    {
        "word": "Nomoliyaviy Korporatsiyalar Sektori ",
        "type": [],
        "definition": [
            "institutsion birliklar rezidentlarining quyidagi yig'indisidan iborat: rezidentlik va mulkdorlik shaklidan qat’iy nazar, barcha rezidentlik nomoliyaviy korporatsiyalar; muayyan iqtisodiy hududda uzoq muddatga mo'ljallab tuzilgan barcha xorijiy nomoliyaviy korxonalarning bo'linmalari hamda barcha rezidentlik nomoliyaviy kvazikorporatsiyalar; asosiy faoliyati bozor uchun mahsulot chiqarish bo'Igan yoki nomoliyaviy xizmat ko'rsatadigan rezidentlik no tijorat tashkilotlar (NT)."
        ]
    },
    {
        "word": "Nonillion",
        "type": [],
        "definition": [
            "birning yonidagi nollar soni 30 ta bo'lgan son."
        ]
    },
    {
        "word": "Norasmiy Jamoa",
        "type": [],
        "definition": [
            "odamlarning sirtqi ta’sir natijasida emas, balki ichki sabab natijasida vujudga kelgan guruhi, u ma’lum maqsadlarga erishish uchun vaqtinchalik o'zaro hamkorlikka kirishadi. "
        ]
    },
    {
        "word": "Norezidentlar",
        "type": [],
        "definition": [
            "O'zbekiston hududida tashkil etilmagan yoki bosh korxonasi O'zbekistonda joylashmagan yuridik shaxslardir. Norezidentlar faqat O'zbekiston hududida olgan daromadlaridan soliq to'laydilar. "
        ]
    },
    {
        "word": "Normal Buxgalteriya Foydasi ",
        "type": [],
        "definition": [
            "firma yoki korxona iqtisodiy foydasining bir qismi, ya’ni umumiy tushumdan buxgalteriya xarajatlarining ayirmasidan qolgan qismi."
        ]
    },
    {
        "word": "Normal Tovarlar",
        "type": [],
        "definition": [
            "iste’molchilarning daromadlari oshganda talab hajmi ortadigan tovarlar."
        ]
    },
    {
        "word": "Normativ",
        "type": [],
        "definition": [
            "minimal talab darajasida belgilangan, qurilish tashkilotining to'xtovsiz ishlashini ta’minlaydigan pul ko'rinishidagi oborot mablag'larining rejadagi miqdori."
        ]
    },
    {
        "word": "Normativ (Meʼyoriy) Iqtisodiy Nazartya",
        "type": [],
        "definition": [
            "iqtisodiy nazariyaning bir qismi, alohida firma va davlatning iqtisodiy siyosatini amalga oshirish uchun amaliy yo'riqlar ishlab chiqiladi. Birinchi marta A.Smit iqtisodiyot nazariyasi vazifalarini asoslaganda, ushbu atamani muomalaga kiritgan. "
        ]
    },
    {
        "word": "Nostro Hisobvaragʻ1",
        "type": [],
        "definition": [
            "bir bankning boshqa bankdagi hisobvarag'i."
        ]
    },
    {
        "word": "Nota",
        "type": [],
        "definition": [
            "(qarz majburiyati - note) qisqa muddatli (3-6 oy) pulli dastak bo'lib, bank bilan kelishuv asosida qarz oluvchining o'z nomiga chiqariladi, bozorda joylashtirilishi kafolatlanadi va sotilmagan notalar sotib olinadi, rezerv kreditlar bilan ta’minlanadi. Keng tarqalgan notalar- yevronotalardir."
        ]
    },
    {
        "word": "Notarif Toʻsiqlar",
        "type": [],
        "definition": [
            "xalqaro savdoni cheklovchi bojxona poshlinasidan tashqari har xil to'siqlar: import kvotalar, maxsus litsenziyalar va shu kabilar (qarang: import kvotasi, litsenziya)."
        ]
    },
    {
        "word": "Notifikatsiya",
        "type": [],
        "definition": [
            "veksel egasining veksel majburiyati bo'yicha hamma to'lovlardan bosh tortishi, shuningdek, to'lovchining oddiy imzosi yoki summasining jami yoki bir qismini to'lash haqida belgi yoki tasdiqnomaning yo'qligi, ya’ni vekselning aksept emasligi haqida bildirish."
        ]
    },
    {
        "word": "Notijorat Tashkilotlar (Ntt) ",
        "type": [],
        "definition": [
            "foyda olishni va uni ishtirokchilar o'rtasida taqsimlashni o‘z oldiga maqsad qilib qo'ymagan muassasalardan iborat. Yuridik va jamoatchi shaxslardan iborat bo‘lib; mahsulot ishlab chiqarish va xizmat ko'rsatish maqsadida tashkil etiladi. Bu tashkilotlar o'z maqomi (statusi)ga ko'ra ularni tashkil etgan nazoratchi va moliya beruvchi birliklar uchun daromad, foyda yoki boshqa turdagi moliya manfaati manbai bo' la olmaydilar. Masalan: jamoatchilik yoki diniy tashkilotlar, xayriya fondlari va hokazo. Odatda ixtiyoriylik asosida, yagona maqsad bilan ma’naviy va boshqa nomoddiy ehtiyojlami qondirish maqsadida tashkil etiladi."
        ]
    },
    {
        "word": "Notijorat Tashkilotlarning Pirovard Isteʼmol Xarajatlari ",
        "type": [],
        "definition": [
            "uy xo'jaligiga xizmat ko'rsatuvchi notijorat tashkilotlaming pirovard iste’mol xarajatlari, NTTning iste’mol tovarlari va xizmatlari uchun qilingan xarajat."
        ]
    },
    {
        "word": "Notijorat Yuridik Shaxs",
        "type": [],
        "definition": [
            "ixtiyoriylik asosida tashkil etilgan, daromad (foyda) olishni o'z faoliyatining asosiy maqsadi qilib olmagan hamda olingan daromadlar (foyda)ni o'z a’zolari o'rtasida taqsimlamaydigan o'zini-o'zi boshqarish tashkiloti."
        ]
    },
    {
        "word": "Nou-Xau (Ishlab Chiqarish Siri) ",
        "type": [],
        "definition": [
            "(ingl. “bilaman qandayligini”) ishlab chiqarish texnologiyasi, ishlab chiqarishni yo'lga qo'yish uchun zaruriy ilmiy-texnikaviy, tijorat, tashkiliy bilimlar. Mahsulot ishlab chiqarishni o'zlashtirishni yengillashtirish va tezlashtirishga imkon beruvchi texnik bilim, texnik tajriba, ishlab chiqarishning yashirin imkoniyatlari."
        ]
    },
    {
        "word": "Noverbal Axborotlar",
        "type": [],
        "definition": [
            "jo'natuvchi tomonidan so'zlardan foydalanmasdan yuborilgan axborotlar."
        ]
    },
    {
        "word": "Nusxada Tiklash (Imitatsiya)",
        "type": [],
        "definition": [
            "EHM yordamida qog'ozda qayd etiladigan xilma-xil marketing omillarining qaytadan yaratilishi."
        ]
    },
    {
        "word": "Nodavlat Va Jamoat Tashkilotlari ",
        "type": [],
        "definition": [
            "davlatga qarashli bo'lmagan, ammo ma’lum qonunlar yoki me’yoriy hujjatlarga bo'ysungan holda faoliyat ko'rsatadigan tuzilmalar nodavlat va jamoat tashkilotlari hisoblanadi."
        ]
    },
    {
        "word": "Nominal Daromad",
        "type": [],
        "definition": [
            "aholi tomonidan ma’lum vaqt oralig'ida olingan daromadlarning pul ко‘rinishidagi miqdori."
        ]
    }
]