[
    {
        "word": "Obligatorli Qayta Sugʻurtalash",
        "type": [],
        "definition": [
            "l) qayta sug'urtalashning majburiy shakli. Ayrim mamlakatlar qonunchiligiga ko'ra, ushbu mamlakat hududida faoliyat ko'rsatayotgan barcha sug'urta kompaniyalari qabul qilgan risklarning bir qismini majburiy ravishda qayta sug'urtalash kompaniyasiga beradi. Bu chora qayta sug'urtalash orqali chet elga valyuta chiqib ketishining oldini oladi; 2) sug'urta kompaniyasi (sedent) ma’lum bir sug'urta turi bo'yicha riskni qayta sug'urtalovchiga berishini va, o'z navbatida, qayta sug'urtalovchi riskni qabul qilishni nazarda tutuvchi qayta sug'urtalash shartnomasi."
        ]
    },
    {
        "word": "Obligatsiya",
        "type": [],
        "definition": [
            "(lot. “obligo”- “qarz olish” mazmunini bildiradi). 1. Davlat yoki aksionerlik kompaniyasi tomonidan qarz majburiyati sifatida chiqariladigan qimmatli qog'oz. Davlat chiqargan obligatsiyalardan olingan daromad yutuqlar shaklida to'lanadi. Aksionerlik kompaniyalari chiqargan obligatsiya egasi daromadni oldindan belgilangan foiz sifatida oladi. Ma’lum davrdan so'ng u sotib olinadi. Aksiyadan farqli o'laroq obligatsiya egasiga aksionerlar majlisida ovoz berish huquqi berilmaydi. Obligatsiyalar pul bozorida harakat qiladi va o'z kursiga egadir. Obligatsiya kursi u keltiradigan daromad darajasi va ssuda foiziga bog'liq bo'ladi. 2. Emissiyaviy qimmatli qog'ozbo'lib, u obligatsiyani saqlovchining obligatsiyaning nominal qiymatini yoki boshqa mulkiy ekvivalentini obligatsiyani chiqargan shaxsdan unda nazarda tutilgan muddatda, nominal qiymatidan qat’iy belgilangan foizni olishga bo'lgan huquqini yoxud boshqa mulkiy huquqlarini tasdiqlaydi."
        ]
    },
    {
        "word": "Obligatsiyasiz Qarz (Zayom)",
        "type": [],
        "definition": [
            "mavjud banklar hukumatga yoki mahalliy tashkilotlarga obligatsiyalar sotish o'rniga kredit berish orqali beriladigan qarzdir. U davlat qarzining bir shaklidir."
        ]
    },
    {
        "word": "Oborot Soligʻi",
        "type": [],
        "definition": [
            "ishlab chiqarishning yakuniy bosqichida xalq iste’moli uchun ishlab chiqarilgan mahsulotlarning qiymatidan olinadigan soliq turi. Asosan, uch xil metod bo'yicha aniqlanadi: l) chakana baho (savdo va ta’minot ustamalari chegirilgan) va korxona ulgurji bahosi o'rtasidagi farq; 2) chakana baholardagi (savdo ustamalari chegirilgan) tovar oborotga nisbatan foizda; 3) mahsulot birligiga nisbatan absolyut pul summalarida. Barcha mahsulotlardan olinmasdan, balki texnologik zanjirning oxiridagi mahsulotdan olinadi (masalan, cho'yan rudasidan emas, balki muzlatgich, avtomobildan olinadi). Hozirgi paytda Buyuk Britaniya, Fransiya, Germaniya, Rossiya, O'zbekiston kabi mamlakatlarda bu soliqdan qo'shilgan qiymat solig'iga o'tilgan bo'lsa, AQSHda uning o'rniga sotuvdan olinadigan soliq joriy etilgan."
        ]
    },
    {
        "word": "Obroʻ",
        "type": [],
        "definition": [
            "hamma tomonidan tan olingan hamda mehnat evaziga orttirilgan, rahbar uchun zarur ishoncb va qalqondir."
        ]
    },
    {
        "word": "Obroʻli Narx",
        "type": [],
        "definition": [
            "qadr-qimmati yuqori bo'Igan maxsus talabli tovarlarga belgilanadigan narx."
        ]
    },
    {
        "word": "Obʼyekttv (Matematik) Ehtimol",
        "type": [],
        "definition": [
            "voqea va hodisalar jarayonida takrorlanishlarni hisob-kitob qilishga asoslangan ehtimol."
        ]
    },
    {
        "word": "Ochiq, Aksiyadorlar Jamiyati",
        "type": [],
        "definition": [
            "ishtirokchilar o'zlariga qarashli aksiyalami boshqa aksiyadorlarning roziligisiz o'zga shaxslarga berishlari mumkin bo'Igan jamiyat."
        ]
    },
    {
        "word": "Ochiqauksion",
        "type": [],
        "definition": [
            " auksionning ochiq shakli bo'lib, savdo-sotiqxaridorlaming shaxsiy ishtirokida olib boriladi. Savdo jarayonida qimmatbaho qog'ozlar, tovar va mol-mulklami taklif etilgan eng yuqori baho bo'yicha sotish yoki sotib olish mumkin."
        ]
    },
    {
        "word": "Ochiq Bozordagi Operatsiyalar",
        "type": [],
        "definition": [
            "Markaziy bank tomonidan davlat qimmatbaho qog'ozlarini sotish va xarid qilish, pul-kredit siyosatini amalga oshirish usullaridan biri. Markaziy bank nufuzi katta banklar guruhi bilan birgalikda amalga oshiradi. Markaziy bank xazinadagi qimmatbaho qog'ozlarini sotish (agarda muomalada pul ko'p bo'lsa) va xarid qilish (agarda muomalada pul kam bo'lsa) yo'li bilan pul taklifiga ta’sir etadi, ya ni pul bozoridagi talab va taklif muvozanatini ta’minlaydi."
        ]
    },
    {
        "word": "Ochiq Iqtisodiyot",
        "type": [],
        "definition": [
            "tashqi iqtisodiy bozorda keng savdo-iqtisodiy va moliyaviy aloqalarga ega bo' lgan iqtisodiyot. Tovar va xizmatlarning eksport importi hamda moliyaviy operatsiyalarni amalga oshiruvchi iqtisodiyot. Ochiq iqtisodiyot modelida tovarlar, xizmat va kapital oqimlari milliy chegaralar tashqarisiga chiqib turadi va unda asosiy makroiqtisodiy ayniyat quyidagi ko'rinishga ega bo'ladi U=Sh+I+G+NX, bunda U - milliy mahsulot, Sh - shaxsiy iste’mol uchun xarajatlar, I - korxonalarning yalpi investitsiyalari, G - davlatning tovar va xizmatlarni sotib olish bilan bog'liq xarajatlari,NX - sof eksport."
        ]
    },
    {
        "word": "Ochiq, Schyotlar Boʻyicha Beriladigan Kredit",
        "type": [],
        "definition": [
            "eksportyor jo'natilgan har bir tovarlar qiymatini importyorning hisobiga qarz sifatida qayd qilib boradi. Importyor shartnomada ко‘rsatilgan vaqtda kredit summasini to‘lab boradi. Ochiq schyotlar bo'yicha beriladigan kreditlar faqatgina doimiy aloqada bo'lgan firmalar o'rtasidagina amalga oshirilishi mumkin."
        ]
    },
    {
        "word": "Ochiq Shartnomaviy Narxlar",
        "type": [],
        "definition": [
            "bunday narxlar qurilish shartnomasi shartlari asosida qurilish materiallari, ish haqi to'lovlari shartlari va boshqa xarajatlarning vujudga kelishi hisobiga aniqlashtiriladigan narxlardir."
        ]
    },
    {
        "word": "Ochiq Tipdagi Aksionerlik Jamiyati ",
        "type": [],
        "definition": [
            "aksiyalari bir shaxsdan boshqa shaxsgaboshqa aksionerlarning roziligisiz o'tkazish mumkin bo'lgan jamiyat. Bunda korxona ixtiyorida bo'lmagan shaxslar ham aksiyaga egalik qilishi mumkin."
        ]
    },
    {
        "word": "Ochiq. Turdagi Hissadorlik Jamiyati",
        "type": [],
        "definition": [
            "shunday aksionerlik jamiyatiki, uning aksiyalari ochiq savdoga chiqadi va ular ochiq obuna sifatida ta’sischilar qaroriga muvofiq tarqatilishi (sotilishi) mumkin."
        ]
    },
    {
        "word": "Oddiy Aksiya",
        "type": [],
        "definition": [
            "aksiyadorlar yig'ilishida ovoz berish huquqini beradi, u bo'yicha olinadigan dividend miqdori esa aksiyadorlik jamiyatining yil davomidagi ish faoliyatining natijalariga bog'liq va boshqa xech narsa bilan kafolatlanmagan."
        ]
    },
    {
        "word": "Oddiy Buxgalteriya Provodkasi",
        "type": [],
        "definition": [
            "bitta schyot debetlanib, ikkinchi schyot kreditlanadigan buxgalteriya provodkasi."
        ]
    },
    {
        "word": "Oddiy Ishbay",
        "type": [],
        "definition": [
            "mehnatga haq to'lashning bu shaklida ishlab chiqarilgan mahsulot sonini ishbay narxiga ko'paytirish yoli bilan ish miqdori aniqlanadi."
        ]
    },
    {
        "word": "Oddiy Monopoliya",
        "type": [],
        "definition": [
            "mahsulot birligini bir xil narxda sotuvchi monopoliya. Mahsulot qo'shimcha birligini sotishdan olgan chegaraviy daromadi uning narxidan doim pastdir."
        ]
    },
    {
        "word": "Oddiy Vaqtbay",
        "type": [],
        "definition": [
            "ish haqining bu shaklida muhandis-texnik xodimlar, xizmatchilar haqiqatan ishlagan vaqtiga qarab belgilangan maosh asosida haq olishadi. Vaqtbay ish haqi oluvchi ishchilar mehnatiga haq ularning ishlagan vaqti va tarif stavkalari asosida aniqlanadi."
        ]
    },
    {
        "word": "Oferdraf ",
        "type": [],
        "definition": [
            "mijoz joriy hisob varag'ining salbiy qoldig'i bo'lib, bank krediti bilan qoplanadi."
        ]
    },
    {
        "word": "Oferta ",
        "type": [],
        "definition": [
            "1 . Muayyan ishni amalga oshiradigan shaxsning niyatlari batafsil bayon etilgan taklif bo'lib, u bir yoki bir necha aniq shaxslarga yuboriladi va tomonlar bilan tuzilgan shartnoma o'rnida qabul qilinishi mumkin. 2. Oferta sotuvchining tovar turkumini sotuvchi belgilagan shartlar asosida sotish haqida ehtimol tutilgan xaridorga yo'llangan yozma taklifi. Bunday taklifni yo'llagan shaxs oferent deb nomlanadi. Ofertada quyidagilar ko'rsatiladi: tovar nomi, uning miqdori, narxi, bazis shartlari, idish va o'raladigan narsa xususiyati, tovarni qabul qilib olish-topshirish tartibi, yuridik manzil, imzo. Xalqaro savdoda ikki xil oferta farqlanadi: qat’iy oferta va erkin oferta."
        ]
    },
    {
        "word": "Offshor Hudud ",
        "type": [],
        "definition": [
            "yuridik shaxslarga bojxona va soliq imtiyozlari va boshqa qulayliklar keng yaratib berilgan hudud va mamlakatlar. Bunday hududlarda norezident bo'lgan offshor kompaniyalar tashkil qilinadi va faoliyat olib boradi. Bu yerda xorijiy huquqiy va jismoniy shaxslar tijoriy operatsiyalarni chet el valyutasida amalga oshirashadi."
        ]
    },
    {
        "word": "Offshor Sugʻurta Kompaniyasi",
        "type": [],
        "definition": [
            "maxsus maqomga ega bo'lgan sug'urta kompaniyasi. Offshor sug'urta kompaniyalari soliq to'lash stavkalari eng kam bo'lgan offshor zonalarda (Bermud oroli, Gernsi, Men va Keymanov orollari) tashkil etiladi. Offshor zonalarda amalga oshiriladigan sug'urta operatsiyalari sug'urta kompaniyasini tashkil etishda qatnashgan tasischilar joylashgan davlat organlari tomonidan nazorat etilmaydi."
        ]
    },
    {
        "word": "Ofis",
        "type": [],
        "definition": [
            "idora, kanselyariya (yozuv chizuvlar) xizmat binosi."
        ]
    },
    {
        "word": "Oila Budjeti",
        "type": [],
        "definition": [
            "oilaning mazkur vaqtda vujudga kelgan pulli yoki jami daromadlari va sarf-xarajatlari."
        ]
    },
    {
        "word": "Oila Ehtiyoji",
        "type": [],
        "definition": [
            "butun oilaga kerak bo'ladigan va xizmat qiladigan narsalarga bo'lgan ehtiyoj."
        ]
    },
    {
        "word": "Oilavty Biznes",
        "type": [],
        "definition": [
            "tadbirkorlik turi bo'lib, xonadon funksiyasi hisoblanmaydi."
        ]
    },
    {
        "word": "Oklad",
        "type": [],
        "definition": [
            "(maosh) ma’lum vaqt uchun belgilangan ish haqi miqdori."
        ]
    },
    {
        "word": "Oktillion",
        "type": [],
        "definition": [
            "birning yonidagi nollar soni 27 ta bo'lgan son."
        ]
    },
    {
        "word": "Oldindan Aytish (Bashorat, Istiqbolni Koʻra Bilish)",
        "type": [],
        "definition": [
            "shu kun tendensiyalari asosida kelajak haqida taxminlar tuzish."
        ]
    },
    {
        "word": "Oligarxiya",
        "type": [],
        "definition": [
            "bir to'da shaxslarning yoki guruhlarning (boylar, harbiylarning) siyosiy va iqtisodiy xukmronligi bo'lgan tuzum."
        ]
    },
    {
        "word": "Oligopoliya ",
        "type": [],
        "definition": [
            "shunday bozor strukturasining turiki, bunda bir nechta yirik firmalar ishlab chiqarishda monopollik qilib, mahsulotning asosiy qismini sotadi. Oligopoliya nazariyasi - monopol xukmronlikni inkor etuvchi iqtisodiy nazariya, har bir xo'jalik tarmog'ida bitta emas, bir nechta yirik firmalar xukmronlik qiladi degan g'oyani oldinga suradi. Oligapoliyaga quyidagi belgilar xos bo'ladi: 1. Tarmoqda nisbatan kam sonli firmalar hukmronlik qiladi. Ular qimmatli texnologiyalar, xarajatlarni iqtisod qilish, tarmoqqa kirishga to'siqlar qo'yishbilan o'zaro muomala qiladilar. 2. Mahsulot tabaqalashtirilgan yoki standartlashtirilgan bo'lishi mumkin. 3. O'zaro qo'shilishga rag'batning kuchliligi, chunki u bozorning katta ulushiga ega bo'lishga imkon yaratadi. 4. Umumiy o'zaro bog'liqlik."
        ]
    },
    {
        "word": "Oliy Kategoriyali Tovar",
        "type": [],
        "definition": [
            "daromad oshganda talab oshib ketadigan tovarlar."
        ]
    },
    {
        "word": "Oliy Maʼlumot Darajasi",
        "type": [],
        "definition": [
            "shaxs tomonidan oliy ta'limning muayyan o'quv rejalari va fanlar dasturini mazkur ma’lumot haqida tegishli davlat hujjati berilgan holda, o'zlashtirilishi natijasi."
        ]
    },
    {
        "word": "Oliy Maʼlumot Haqida Davlat Hujjati (Diplom) ",
        "type": [],
        "definition": [
            "akkreditatsiyadan o'tgan oliy ta’lim muassasalari bitiruvchilariga beriladigan va ularning oliy ta’limning o'quv rejalari va fanlar dasturini bajarganliklarini tasdiqlovchi davlat namunasidagi hujjat. Hujjat uzluksiz ta’limning keyingi bosqichlarida o'qishni davom ettirish yoki olingan akademik darajaga muvofiq ishlash huquqini beradi."
        ]
    },
    {
        "word": "Oliy Taʼlim",
        "type": [],
        "definition": [
            "uzluksiz ta’limning yuqori malakali mutaxassislar tayyorlovchi mustaqil turi. Oliy ta’lim muassasalarida amalga oshiriladi. Oliy ta’lim ikki bosqichdan iborat: bakalavriat va magistratura."
        ]
    },
    {
        "word": "Oliy Taʼlim Muassasasi Akkreditatsiyasi ",
        "type": [],
        "definition": [
            "oliy ta’lim muassasasi faoliyati darajasining ОТ DTS mezon va talablariga javob berishining davlat tomonidan e’tirof etilishi."
        ]
    },
    {
        "word": "Oliy Taʼlim Muassasasi Attestatsiyasi",
        "type": [],
        "definition": [
            "oliy ta’lim muassasasida kadrlar tayyorlash mazmuni, darajasi va sifatining ОТ DTS talablariga muvofiqligini aniqlovchi tadbir."
        ]
    },
    {
        "word": "Oliy Taʼlim Yoʻnalishlari Va Mutaxassisliklari Klassifikatori",
        "type": [],
        "definition": [
            "oliy ma’lumotli kadrlar tayyorlash uchun bakalavriat ta’limi yo'nalishlari va magistratura mutaxassisliklarining tizimlashtirilgan ro'yxati."
        ]
    },
    {
        "word": "Oliy Taʼlimning Davlat Taʼlim Standarti",
        "type": [],
        "definition": [
            "muayyan ta’lim sohasiga (soha tarkibiga) qo‘yiladigan malaka talablari, ta’lim mazmu, bitiruvchilar umumiy tayyorgarligining zaruriy va yetarli darajasi, kadrlar tayyorlash sifatini baholash darajalarini belgilaydigan etalon darajasi."
        ]
    },
    {
        "word": "Oltin Andoza",
        "type": [],
        "definition": [
            "oltinning pul tovari sifatida tayyorlanishga asoslangan shakli bo'lib, pul-valyuta munosabatlarini tashkil qilishda ishlatiladi."
        ]
    },
    {
        "word": "Oltin Andoza Valyuta Tizimi ",
        "type": [],
        "definition": [
            "XIX asr oxirida yuzaga kelgan valyuta tizimi bo'lib, unga ko'ra ayrim mamlakatlarning valyutasi boshqa mamlakat bozorida oltinga erkin almashtirilgan. 1930-yillardagi butun dunyoni qoplagan “Buyuk depressiya” davrida oltin andozaga bog'langan turli mamlakatlar to'lov balansida kamomad yuzaga kelib, oltin zaxiralarining oqib chiqib ketishining oldini olish va eksportni rag'batlantirish maqsadida ko'p mamlakatlar o'z milliy valyutalarini oltinga nisbatan devalvatsiya qila boshladilar va natijada oltin andoza valyuta tizimi izdan chiqib ketadi. 1944-yilda ko'pgina ittifoqchi mamlakatlar o'zaro kelishilgan holda oltin andozaga asoslangan valyuta tizimini qayta tashkil etadilar. Mamlakat agarda 3 ta shartni bajarsa, oltin andozaga qabul etilgan hisoblanadi: a) o'zining pul birligiga ma’lum miqdorda oltin o'matish; b) mavjud oltin zaxirasi bilan taklif etayotgan pul miqdori o'rtasida qat’iy nisbatni saqlash; d) oltinning erkin eksport va importiga qarshilik ko'rsatmaslik. Bunda xalqaro valyuta fondi (XVF) tashkil etilib, AQSH dollari mamlakatlar o'rtasida asosiy vositachi valyuta qilib belgilanadi. Unga a’zo davlatlar savdo balanslarida yuzaga kelgan nomutanosiblikni valyutalarini devalvatsiya qilish yo'li bilan izga solishga haqlari bo'lmaydi. Turli mamlakatlar valyutalarining o'zaro kursi o'zining pul birligiga belgilangan oltin miqdoriga ko'ra aniqlanadi. Mamlakatlar to'lov balansidagi kamomadni oltin zaxirasini chiqarib sotishi yoki XVFdan qarz olish yo'li bilan qoplashlari mumkin bo'ladi. Lekin jahondagi pul zaxirasining o'sishi qazib olinayotgan oltin miqdoriga bog'liq bo'lib qoldi, shuningdek, oltin zaxiralarining o'sishi xalqaro savdo va moliya miqyoslarining o'sishidan orqada qola boshladi. Bu orada chet mamlakatlarga chiqib ketgan AQSH dollari miqdori ko'payib, savdo balansidagi kamomad ortib ketdi, ularda dollami oltinga aylantirib olishga shubha tug'ila boshlandi. Shunga ko'ra, 1971-yil avgustda AQSH hukumati dollarning oltinga andoza valyuta tizimi ham tugadi."
        ]
    },
    {
        "word": "Oltin Bilan Taʼminlash",
        "type": [],
        "definition": [
            " olingan majburiyatning bajarilishini ta’minlash uchun oltin zaxirasi ko'rinishidagi garov narsalari. Masalan, zayom, kredit, shartnomaning oltin bilan ta’minlanganligi."
        ]
    },
    {
        "word": "Oltin Zaxira",
        "type": [],
        "definition": [
            "mamlakatning oltin zaxira jamg'armasi bo'lib, markaziy bankda xazina quyma (yombi) va tanga shaklida to‘planadi, shuningdek, xalqaro to'lovlar da zaxira sifatida foydalaniladi vavalyuta barqarorligini ta’minlash uchun xizmat qiladi."
        ]
    },
    {
        "word": "Ommaviy Marketing",
        "type": [],
        "definition": [
            "barcha xaridorlar uchun ma’lum bir tovarni ommaviy ishlab chiqarish, ommaviy tarqatish va uning sotuvini ommaviy rag'batlantrish."
        ]
    },
    {
        "word": "Ommaviy Mulk ",
        "type": [],
        "definition": [
            "davlat mulki, respublika mulkidir, u ma’muriy-hududiy tuzilmalar, ya’ni munitsipal mulkdan iboratdir. "
        ]
    },
    {
        "word": "Omonat Sertifikatlari ",
        "type": [],
        "definition": [
            " kredit muassasalarining pul mablag* larining deponentlangani to‘g‘risidagi guvohnomasidir. Bu guvohnomani tasarruf etuvchi omonat sertifikati muddati o'tgandan so'ng depozit summani va uning foizini olish huquqiga ega. Omonat sertifikatlarini davlat va tijorat banklari beradi. Omonat sertifikatlari shaxsi yozilgan va ko'rsatuvchiga berilgan bo'ladi. Ko'rsatuvchiga berilgan sertifikatlar muomalada bo'lishi mumkin, ismi yozilgan sertifikat esa oldi-sotdi muomalasida qatnashmaydi. Ko'rsatuvchiga berilgan sertifikat debitor va kreditorlar o'rtasida hisob-kitob vazifasini bajarishi mumkin. Sertifikatlar bo'yicha foizlar faqat depozit muddati tugagandan keyin to'lanadi. "
        ]
    },
    {
        "word": "Opek",
        "type": [],
        "definition": [
            " neft qazib olish va uning xalqaro bozordagi narxini tartiblash maqsadida tuzilgan xalqaro kartel. U 1960 yilda tashkil etilgan. Tarkibiga Eron, Iroq, Venesuela, Quvayt, Saudiya Arabiston, Qatar, Indoneziya, Liviya, Birlashgan Arab Amirliklari, Aljir, Nigeriya, Ekvador, Gabon davlatlari kiradi. OPEK jahon bo'yicha neft savdosi hajmining yarmiga yaqinini nazorat qiladi, xom neftga rasmiy baho belgilaydi, ko'pincha bahoning jahon darajasini aniqlab beradi. Shtab kvartirasi Venada joylashgan. "
        ]
    },
    {
        "word": "Operativ Boshqarish ",
        "type": [],
        "definition": [
            " minimal xarajat qilib maksimal samaraga erishish va moliyaviy resurslarni yuqori samara olish uchun qayta taqsimlashga qaratilgan kompleks ishlar yig'indisidir. Operativ boshqarish egiluvchanlik xususiyatiga egadir."
        ]
    },
    {
        "word": "Operativ Hisob ",
        "type": [],
        "definition": [
            " ayrim xo'jalik operatsiyalari va jarayonlarini bevosita ular j sodir bo'layotgan vaqtida boshqarish maqsadida joriy kuzatish va nazorat qilish tizimi bo'lib hisoblanadi. Bu hisobning korxona va uning tarkibiy bo'linmalariga joriy rahbarlik qilish maqsadida ma’lumotlami operativ ravishda olish va ulardan foydalanish uning farq qiladigan belgisi hisoblanadi. "
        ]
    },
    {
        "word": "Operativ Ijara ",
        "type": [],
        "definition": [
            " moliyaviy ijara shartnomasi bo‘lmagan mulkiy ijara (ijaraga berish) shartnomasi asosida mol-mulkni vaqtincha egalik qilish va foydalanishga berish "
        ]
    },
    {
        "word": "Operativ Lizing ",
        "type": [],
        "definition": [
            " lizingning bu turida ijaraga berilayotgan texnika uskunalarining ijara muddati ularning xizmat qilish muddatiga qaraganda qisqa bo'ladi. "
        ]
    },
    {
        "word": "Operativ Moliya Strategiyasi ",
        "type": [],
        "definition": [
            "asosiy moliyaviy strategiyadan farqi, u o'z ichiga yalpi daromadlar va mablag'laming ko'payishini (ish haqi; sotilgan mahsulot uchun sotib oluvchilar bilan hisob- kitob qilish^ kredit operatsiyalaridan tushumlar) va hamma yalpi xarajatlarini (taminlovchilar bilan hisob-kitob, ish haqi, barcha darajadagi budjetlar va banklar bilan majburiyatlarni uzmoq) oladi. "
        ]
    },
    {
        "word": "Operatsion Menejment ",
        "type": [],
        "definition": [
            "korxonaning asosiy mahsulotini ishlab chiqarish va yetkazib berishga yo'naltirilgan, operatsion tizimlarini loyihalashtirish, ekspluatatsiya qilish va mukammallashtirish bilan bog'liq bo'lgan faoliyat. "
        ]
    },
    {
        "word": "Operatsion Strategiya",
        "type": [],
        "definition": [
            "firmaning uzoq muddatli raqobatbardosh strategiyasini maksimal samarali qo'llab-quvvatlashga yo'naltirilgan firma umumiy siyosatining va resurslar ishlatilishi rejalari rivojlanishining konseptual aksidir. "
        ]
    },
    {
        "word": "Operatsion Vaqt ",
        "type": [],
        "definition": [
            " malum bir uskunani tayyorgarlik vaqti va shu uskunada mahsulot partiyasini ishlab chiqarish vaqining yig'indisi. "
        ]
    },
    {
        "word": "Operatsiya Kuni ",
        "type": [],
        "definition": [
            " moliya-kredit tashkilotlari ish kunining bir qismi yoki mijozlarga xizmat ko'rsatish va mijozlar bilash ishlash vaqti. "
        ]
    },
    {
        "word": "Operatsiya Kunida Daromadlarni Hisobga Olish ",
        "type": [],
        "definition": [
            "g'aznachilik organlaridagi ma’lum lavozimdagi xodimlarning davlat budjeti mablag'larini hisoblash, taqsimlash o'tkazish va hisobini yuritishdan iborat aniq harakatdagi faoliyati. "
        ]
    },
    {
        "word": "Opsion",
        "type": [],
        "definition": [
            " emissiyaviy qimmatli qog'oz bo'lib, u o'z emitentining muayyan miqdordagi qimmatli qog'ozlarini unda nazarda tutilgan muddatda, qat’iy belgilangan narx bo'yicha sotib olishga bo'lgan huquqini tasdiqlaydi. 1. Kompaniya o'z xizmatchisiga aksiyani qat’iy bahoda sotib olish huquqini berishi. 2. Qimmatli narsalarni va moliyaviy huquqni sotish yoki sotib olish to'g'risidagi majburiyat shartnomasi. 3. Qimmatli narsalarni sotish yoki sotib olish huquqi uchun to'langan haq. "
        ]
    },
    {
        "word": "Oqimlar",
        "type": [],
        "definition": [
            "hisobot davrida bo'Igan iqtisodiy o'zgarishlarni ifodalovchi operatsiyalardir. "
        ]
    },
    {
        "word": "Oraliq, Isteʼmol ",
        "type": [],
        "definition": [
            "hisobot davrida o'z shaklini o'zgartirgan (transformatsiyalangan) yoki ishlab chiqarish xarajati sifatida butunlay iste’mol qilingan tovar va xizmatlar qiymati. "
        ]
    },
    {
        "word": "Oraliq. Mahsulot ",
        "type": [],
        "definition": [
            "ishlab chiqarish va muomala jarayonidan chiqib ketmagan, yakuniy iste’mol uchun yetib bormagan, qayta ishlash yoki sotishga mo'ljallangan mahsulot. "
        ]
    },
    {
        "word": "Ortiqcha Talab ",
        "type": [],
        "definition": [
            " mavjud baholar darajasida tovarlar va xizmatlar taklifidan ularga bo'Igan talabning ko'pligi. To'liq bandlilik sharoitida inflyatsiya darajasining oshishiga olib keladi. "
        ]
    },
    {
        "word": "Ortiqcha Zaxiralar ",
        "type": [],
        "definition": [
            " bankning Markaziy bankdagi depozitlar summasi, shuningdek, kassa naqdi. "
        ]
    },
    {
        "word": "Oshkoralik Prinsipi ",
        "type": [],
        "definition": [
            "ochiq matbuotda tasdiqlangan budjet va uning ijrosi to'g'risidagi hisobotlarning, albatta, e’lon qilinishi, budjet ijrosi jarayonida ma’lumotlarning to'liq va to'g'ri berilishi, davlat hokimiyati qonunchilik organlari va mahalliy o'z-o'zini boshqarish organlarining qarorlariga oid boshqa ma’lumotlarni olish imkoniyatining yaratilganligini, budjet loyihasi bo'yicha qarorlarni ко'rib chiqish va qabul qilish tartiblarining (jumladan, davlat hokimiyati qonunchilik organi ichida yoki davlat hokimiyatining qonunchilik va ijroiya organlari o'rtasidagi qarama-qarshiliklarni ifodalovchi masalalar bo'yicha ham) jamiyat va ommaviy axborot vositalari uchun albatta ochiq bo'lishini ko'zda tutadi. "
        ]
    },
    {
        "word": "Osiyo Taraqqiyot Banki ",
        "type": [],
        "definition": [
            " Osiyo va Uzoq Sharq mintaqasiga bevosita qarzlar berish hamda texnik jihatdan ko'maklashish orqali mazkur mamlakatlar iqtisodiyoti o'sishini rag'batlantirish maqsadida 1965 yilda tashkil etilgan bank. Shuningdek, Osiyoning rivojlanayotgan mamlakatlari iqtisodi va tashqi savdosini hamda kontinental hamkorlikni mustahkamlash, texnik yordam ko'rsatishni asosiy maqsad qilib olgan. "
        ]
    },
    {
        "word": "Ossillyatorlar",
        "type": [],
        "definition": [
            "trendsiz (yonbosh) bozorlarda baho ko'p holatlarda o'z yo'nalishini o'zgartiradi, yuqoriga va pastga bo'Igan qisqa harakatlarning boshlanishi va oxirini bilish eng murakkab muammoga aylanadi. Mazkur masalaning qisman yechimi - ossillyatorlardir. "
        ]
    },
    {
        "word": "Ossillyatorlarning Oʻziga Xos Xususiyati ",
        "type": [],
        "definition": [
            " bozorning qayta burilishi to'g'risida oldindan darak berishidir. Ular kanaldagi o'yin singari, trend bozoridagi o'yinlarda ham foydali bo'lishi mumkin - qayta burilishning yaqinlashib kelayotgan nuqtalarini aniqlash uchun. "
        ]
    },
    {
        "word": "Ouen Robert ",
        "type": [],
        "definition": [
            "(1771-1858) - ingliz xayoliy sotsializmining vakili, kelajakda xususiy mulkni inkor etgan, barcha sog' odamlar uchun mehnat zarur deb hisoblab, “Har kimdan qobiliyatiga yarasha va har kimga mehnatiga yarasha” prinsipini ilgari surgan. "
        ]
    },
    {
        "word": "Ouken Qonuni",
        "type": [],
        "definition": [
            " iqtisodiy faollik va ishsizlik o'rtasida miqdoriy bog'liqlikni aks ettiradi. Agarda aslidagi ishsizlik darajasi uning tabiiy darajasidan 1 % oshsa, unda YaMM orqada qolishi 2,5% ni tashkil etadi. Masalan, ishsizlikning tabiiy darajasi 6% sharoitida ishsizlik darajasi 9,5%. Unda 9,5 - 6,0 = 3,5%; 3,5*2,5 = 8,75%. Ishsizlikning ko'payishi natijasida YaMMning orqada qolishi 8,75% ni tashkil etadi yoki ishsizlik tabiiy darajadan past bo'lmaganda, YaMM aslidagiga nisbatan 8,75% ko'p bo'lar edi. Shu qonunga muvofiq YaMM hajmining har yili 2,7% ga ortishi ishsizlikni doimiy darajada ushlab turishga imkon beradi. YaMMning 2% ortishi ishsizlar sonini 1% ga kamaytiradi. "
        ]
    },
    {
        "word": "Overdraft",
        "type": [],
        "definition": [
            "kontokorrent hisob raqamining maxsus shakli hisoblanadi. Uning o'ziga xos xususiyati shundan iboratki, bank mijozning asosiy “talab qilib olinguncha” depozit hisob raqamida qisqa muddat mobaynida debetli (qoplanmagan) qoldiq bo'lishiga ruxsat beradi. Overdraft hisob raqamidan foydalanish huquqi eng ishonchli mijozlargagina beriladi. "
        ]
    },
    {
        "word": "Overnayt Operatsiyasi",
        "type": [],
        "definition": [
            "hisob-kitob bitim tuzilgan kunda yoki ertasiga amalga oshiriladigan valyuta operatsiyasi. "
        ]
    },
    {
        "word": "Oxirgi Isteʼmol Uchun Qilingan Xarajatlar ",
        "type": [],
        "definition": [
            "uy xo'jaligi a’zolari rezidentlarning iste mol tovarlari va xizmatlar sotib olish uchun qilinganxarajatlari, shuningdek, davlatniboshqarish organlari va uy xo'jaliklariga xizmat ko'rsatuvchi notijorat tashkilotlarning yakka tartibli va jamoa iste’moli uchun qilgan xarajatlari yig'indisi. xarajatlarni bunday guruhlash oxirgi iste’molni kim tomonidan moliyalashtirilishini ko'rsatadi. "
        ]
    },
    {
        "word": "Oziq.-Ovqat Xavfsizligi ",
        "type": [],
        "definition": [
            "milliy va global ehtiyojlarni oziq-ovqat mahsulotlari bilan ta’minlash imkoniyati."
        ]
    },
    {
        "word": "Oooc (Ommaviy Ochiq Onlayn Kurslar)",
        "type": [],
        "definition": [
            "tо‘liq onlayn rejimda harajatlarsiz, malaka va boshqa cheklovlarsiz hamma uchun ochiq va kо‘plab qatnashuvchilarga ega bо‘lgan kurs turidir.   "
        ]
    }
]