[
    {
        "word": "Oʻlchov Birligi",
        "type": [],
        "definition": [
            "muayyan kattalikni miqdoran baholash uchun asos qilib olinadigan kattalik."
        ]
    },
    {
        "word": "Oʻqitish Sifatini Nazorat Qilish ",
        "type": [],
        "definition": [
            "talabaning bilim saviyasini tekshirish va uning o'quv dasturini o'zlashtirish darajasini aniqlash;"
        ]
    },
    {
        "word": "Oʻqitishning Meʼyoriy Muddati ",
        "type": [],
        "definition": [
            "ta’lim oluvchilar tomonidan o'quv rejalari va fanlar dasturi o'zlashtirilishi uchun belgilangan muddat; "
        ]
    },
    {
        "word": "Oʻquv Fani",
        "type": [],
        "definition": [
            "ta’lim muassasasida o'rganish uchun fan, texnika, san’at, ishlab chiqarish faoliyatining muayyan sohasidan saralab olingan bilimlar, o'quv va ko'nikmalar tizimi;"
        ]
    },
    {
        "word": "Oʻquv Fani Dasturi ",
        "type": [],
        "definition": [
            "ta’lim mazmuni, uning talabalar tomonidan o'zlashtirilishining eng maqbul usullari, axborot manbalari ko'rsatilgan normativ hujjat."
        ]
    },
    {
        "word": "Oʻquv Fanlari Bloki",
        "type": [],
        "definition": [
            "o'quv rejalari va fanlar dasturlarining kadrlar tayyorlash jarayonida aniq maqsad va vazifalarga erishish uchun muayyan bilim sohasi yoki faoliyatning o'zlashtirilishini ta’minlaydigan o'quv fanlarini birlashtiruvchi tarkibiy qismi;"
        ]
    },
    {
        "word": "Oʻquv Rejasi",
        "type": [],
        "definition": [
            "oliy ta’limning muayyan bakalavriat ta’lim yo'nalishi yoki magistratura mutaxassisligi bo'yicha o'quv faoliyati turlari, o'quv fanlari va kurslarining tarkibi, ulami o'rganishning izchilligi va soatlardagi hajmini belgilaydigan hujjat;"
        ]
    },
    {
        "word": "Oʻquv Semestri",
        "type": [],
        "definition": [
            "oliy ta’lim muassasasida o'quv yilining yarmini tashkil etuvchi o'zaro bog'langan fanlarning ma’lum majmuyini o'zlashtirishga mo'ljallangan va ular bo'yicha yakuniy nazorat bilan tugallanadigan qismi."
        ]
    },
    {
        "word": "Oʻquv Yili ",
        "type": [],
        "definition": [
            "oliy ta’lim muassasasida bir ta’lim kursini yakunlashga mo'ljallangan o'quv faoliyati davri. O'quv yili ikki kalendar yil bilan belgilanadi, masalan, 2016\/2017 o'quv yili."
        ]
    },
    {
        "word": "Oʻrganish Egrisi",
        "type": [],
        "definition": [
            "berilgan bitta mahsulotni ishlab chiqarish vaqti va bu mahsulotdan oldin ishlab chiqarilgan mahsulotlar soni orasidagi bog'liqlikni ko'rsatuvchi grafik."
        ]
    },
    {
        "word": "Oʻrindosh Tovarlar",
        "type": [],
        "definition": [
            "iste’mol qilishda bir-birining o'rnini bosuvchi tovarlar yoki bir xil ehtiyojni qondiruvchi tovarlar."
        ]
    },
    {
        "word": "Oʻrindosh Tovarlarni Almashtirish Samarasi",
        "type": [],
        "definition": [
            "iste’molchining iste’mol majmuasiga kiruvchi ne’matlardan binning narxi o'zgarishi natijasida iste’mol tarkibining o'zgarishi."
        ]
    },
    {
        "word": "Oʻrov (Qadoqlash) ",
        "type": [],
        "definition": [
            "l) tovar solinuvchi, joylashtiriluvchiidish, material. Tovar ishlab chiqarilgandan so'ng uning xususiyatlarini saqlash hamda yukni tashishda qulaylik yaratish uchun mo'ljallanadi; 2) muhim reklama manbai. "
        ]
    },
    {
        "word": "Oʻrta Taʼmir",
        "type": [],
        "definition": [
            "tamirlanadigan agregatni qisman ajratib yig'ish yoki detallar qismlarini qayta tiklash yoki almashtirish amalga oshiriladi."
        ]
    },
    {
        "word": "Oʻrtacha Daromad",
        "type": [],
        "definition": [
            "bir birlik tovarni sotishdan tushgan daromad."
        ]
    },
    {
        "word": "Oʻrtacha Doimiy Xarajatlar",
        "type": [],
        "definition": [
            "mahsulot birligiga sarflangan doimiy xarajatlar, ya’ni doimiy xarajatlarning mahsulot chiqarish hajmiga nisbati."
        ]
    },
    {
        "word": "Oʻrtacha Mahsulot ",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayoniga jalb qilingan moddiy va ish kuchi resurslarining bir birligiga to'g'ri keladigan ishlab chiqarilgan mahsulot birligiga aytiladi."
        ]
    },
    {
        "word": "Oʻrtacha Oʻzgaruvchan Xarajat",
        "type": [],
        "definition": [
            "mahsulot birligiga mos keluvchi o'zgaruvchan xarajatlar, ya’ni o'zgaruvchan xarajatlarning mahsulot chiqarish hajmiga nisbati. "
        ]
    },
    {
        "word": "Oʻrtacha Qiymat",
        "type": [],
        "definition": [
            "asosiy vositalar, nomoddiy aktivlar, lizing shartnomasi bo'yicha sotib olingan vositalarning hamda ishga tushirilmagan mulklar qiymatining yil boshi va oxiridagi summalarining yarmi, boshqa oylar boshidagi balans qiymatining to'liq summalari yig'indisini 12 ga bo'lish bilan aniqlanadigan qiymatdir. Bu qiymat choraklik va yil bo'yicha aniqlanadi."
        ]
    },
    {
        "word": "Oʻrtacha Umumiy Xarajatlar ",
        "type": [],
        "definition": [
            "mahsulot birligiga hisoblangan umumiy xarajatlar, ya’ni umumiy xarajatlarning mahsulot chiqarish hajmiga nisbati."
        ]
    },
    {
        "word": "Oʻrtacha Xarajatlar",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonida yaratilgan umumiy mahsulotning birligiga sarf etilgan xarajatlardir."
        ]
    },
    {
        "word": "Oʻsayotgan Talab ",
        "type": [],
        "definition": [
            "talab darajasining dam-badam o'sib va pasayib turish holati."
        ]
    },
    {
        "word": "Oʻsib Boruvchi Xarajatlar Samarasi",
        "type": [],
        "definition": [
            "olish oson bo'lmagan va kam munosib resurslardan foydalanish zaruriyati natijasida mamlakat ixtisoslashgan mahsulotni ishlab chiqarishni ko'paytirganda o'rtacha umumiy xarajatlarning o'sishi."
        ]
    },
    {
        "word": "Oʻstirilmaydigan Kreditlar ",
        "type": [],
        "definition": [
            "belgilangan tartibga muvofiq foizlar hisoblanishi to'xtatiladigan kreditlar."
        ]
    },
    {
        "word": "Oʻtish Davri",
        "type": [],
        "definition": [
            "bir mulk shakliga asoslangan iqtisodiy tizimdan boshqa mulk shakllariga asoslangan yangi iqtisodiy tizimga o'tish bilan bog'liq bo'lgan davr. "
        ]
    },
    {
        "word": "Oʻxshash Tovarlar",
        "type": [],
        "definition": [
            "bir ehtiyojni qondirishga mo'ljallangan, lekin birbiridan qandaydir hislatlari bilan farq qiladigan tovarlar."
        ]
    },
    {
        "word": "Oʻyin ",
        "type": [],
        "definition": [
            "oldindan belgilangan qoidalar asosida iqtisodiy subyektlar o'rtasidagi o'zaro munosabatlar (qarorlar qabul qilish)."
        ]
    },
    {
        "word": "Oʻyinlar Nazariyasi ",
        "type": [],
        "definition": [
            "fan yo'nalishi bo'lib, u o'yin qatnashuvchilarining vaziyat bo'yicha harakat qilish va qaror qabul qilishni matematik usullar yordamida o'rganadi. "
        ]
    },
    {
        "word": "Oʻz Daromadlari ",
        "type": [],
        "definition": [
            "mahalliy hududdan yig'iluvchi va shu hudud budjetiga tushuvchi mahalliy soliq va yig'imlar."
        ]
    },
    {
        "word": "Oʻzaro Aloqador Shaxslar ",
        "type": [],
        "definition": [
            "tijorat banki aksiyadorlari va boshqaruvida o'z faoliyati yurituvchi shaxslarning qarindoshlari hisoblanadi. "
        ]
    },
    {
        "word": "Oʻzaro Bir-Birini Toʻldiradigan Tovarlar",
        "type": [],
        "definition": [
            "foydalanilayotganda bir-birini to'ldiruvchi tovarlar, uning biri narxining oshishi ikkinchisining narxi oshishiga olib keladi, pirovard natijada ularga talab kamayadi."
        ]
    },
    {
        "word": "Oʻzaro Bir-Birining Oʻrnini Bosadigan Tovarlar",
        "type": [],
        "definition": [
            "xususiyat-lari bilan bir-biriga yaqin va bir-birlarini almashtira oladigan tovarlar. Bir mahsulot narxining o'sishi iste’molchini 482 uning o'rnini bosa ola-digan tovarga o'tishga va uning narxining ko'tarilishiga olib keladi. "
        ]
    },
    {
        "word": "Oʻzaro Hisoblar",
        "type": [],
        "definition": [
            "davlat bilan korxonaning yoki korxona bilan tashkilotning o'zaro hisoblari. Masalan: tovar, mahsulot ishlab chiqarish, sotish va xizmat ko'rsatish borasida."
        ]
    },
    {
        "word": "Oʻzaro Sugʻurtalash Jamiyati ",
        "type": [],
        "definition": [
            "foyda olishni ko'zlamaydigan notijorat shaklidagi sug'urta kompaniyasi. Sug'urta qilishning tashkiliy shakli. O'zlarining mulkiy manfaatlarini sug'urtaviy himoyalash uchun yuridik va jismoniy shaxslarning ixtiyoriy bitim asosida birlashuvi. O'zaro sug'urtalash jamiyati yuridik shaxs hisoblanib, harbir sug'urtalanuvchi ushbu jamiyatninga’zosibo'ladi. AQSh va Yaponiyada asosan, hayot sug'urtasi bilan shug'ullanuvchi kompaniyalar o'zaro sug'urtalash jamiyati shaklidadir. Hozirgi paytda Yaponiyada o'zaro sug'urtalash jamiyatlari hayotni sug'urtalash bozorining 89,4% ni tashkil etadi."
        ]
    },
    {
        "word": "Oʻzbekcha Model ",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasining o'ziga xos xususiyatlari, shart-sharoitlardan kelib chiqqan holda tanlangan o'zining bozor iqtisodiyoti modeli. U o'zining tarkibiga bozor va harakat qilish tamoyillarini, chunonchi, xususiy mulk, erkin tadbirkorlik, raqobat va narxlarning erkin shakllanishini qamrab olgan. Undan tashqari O'zbekiston Respublikasi Birinchi Prezidenti I.A. Karimov tomonidan ishlab chiqilgan besh tamoyilga, ya’ni: qonun ustuvorligi, iqtisodning siyosatdan ustunligi, islohotlarni bosqichma-bosqlch amalga oshirish, davlat tomonidan iqtisodiyotni tartibga solishni, islohotlarning ijtimoiy yo'naltirilishiga asoslanadi. Ushbu modelning o'ziga xos ta’rifi kuchli ijtimoiy siyosatni olib borishga yo'naltirilganligidir. "
        ]
    },
    {
        "word": "Oʻzbekistan Respublikasining Gʻazna Majburiyatlari ",
        "type": [],
        "definition": [
            "emissiyaviy qimmatli qog'ozlar bo'lib, ular emissiyaviy qimmatli qog'ozlar egalari O'zbekiston Respublikasining Davlat budjetiga pul mablag'lari kiritganligini tasdiqlaydi va bu qimmatli qog'ozlarga egalik qilishning butun muddati mobaynida qat’iy belgilangan daromad olish huquqini beradi."
        ]
    },
    {
        "word": "Oʻzbekiston Metallurgiya Zavodi",
        "type": [],
        "definition": [
            "O'zbekiston metallurgiya zavodi - qora metallurgiya sanoati korxonasi Toshkent viloyatining Bekobod shahrida joylashgan. U O'rta Osiyo respublikalaridagi mashinasozlik korxonalari va qurilish tashkilotlarini metall bilan ta’minlaydi, navli prokat, tunuka, emallangan idishlar ishlab chiqaradi. O rta Osiyoda yig'iladigan temir-tersakni qayta eritadi. "
        ]
    },
    {
        "word": "Oʻzbekiston Respubhkasi Tashqi Iqtisodiy Faoliyat Milliy Banki",
        "type": [],
        "definition": [
            "ixtisoslashtirllgan aksionerlik, tijorat banki. Respublikada valyuta zaxirasini to'plash va uni maqsadga muvofiq sarflash, xalqaro valyuta muomalasi, tovarlar eksporti va importi bo'yicha hisob-kitoblar, korxona va tashkilotlarning tashqi iqtisodiy faoliyatlarini kreditlash, davlat valyuta siyosatini ta’minlash va nazorat qilishni amalga oshiradi."
        ]
    },
    {
        "word": "Oʻzbekiston Respublikasi Soliq Toʻlovchilarining Yagona Reestri ",
        "type": [],
        "definition": [
            "soliq to'lovchilarga oid davlat ma’lumotlar bazasi tizimi"
        ]
    },
    {
        "word": "Oʻzbekiston Tadbirkorlari Uyushmasi ",
        "type": [],
        "definition": [
            "respublikada ishbilarmonlikni rivojlantirish va unga rahbarlik qilish maqsadlarida ishbilarmonlaming birinchi ta’sis qurultoyida (1991- yil 6-iyunda) tashkil etilgan. Uyushma o'z nizomi va dasturi asosida iqtisodiyotni barqarorlashtirish, xo'jalik aloqalarini tiklash, raqobatni rivojlantirish, iste’mol bozorini tovarlar bilan to'ldirish, chet ellardagi tadbirkorlar bilan hamkorlik aloqalarini o'rnatish va boshqa yo'nalishlarda ish olib boradi."
        ]
    },
    {
        "word": "Oʻzbekiston Respublikasi Tiklanish Va Taraqqiyот Fondi",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasi Vazirlar Mahkamasi huzuridagi moliyaviy muassasa bo'lib, faoliyatining asosiy maqsadi iqtisodiyotning yetakchi, eng awalo bazaviy tarmoqlarini modernizatsiyalash va texnikaviy qayta qurollantirish bo'yicha loyihalarning amalga oshirilishini ta’minlash, shuningdek, mamlakatni muttasil, barqaror va mutanosib ravishda ijtimoiyiqtisodiy rivojlantirishga erishish hamda samarali tarkibiy va investitsiyaviy siyosatni amalga oshirishdan iborat. "
        ]
    },
    {
        "word": "Oʻzgaruvchan Almashuv Kursi ",
        "type": [],
        "definition": [
            "ichki muvozonatni tiklash maqsadida mamlakat almashuv kursiga ega bo'ladigan xalqaro hisob-kitoblar tizimi. "
        ]
    },
    {
        "word": "Oʻzgaruvchan Almashuv Kursi",
        "type": [],
        "definition": [
            "ichki muvozonatni tiklash maqsadida mamlakat almashuv kursiga ega bo'ladigan xalqaro hisob-kitoblar tizimi."
        ]
    },
    {
        "word": "Oʻzgaruvchan Chiqimlar ",
        "type": [],
        "definition": [
            "korxonaning ishlab chiqarish hajmlari ko'paygan sari oshib boruvchi xarajatlar."
        ]
    },
    {
        "word": "Oʻzgaruvchan Narx",
        "type": [],
        "definition": [
            "bozordagi vaziyatga qarab o'zgartirib boriladigan narx. "
        ]
    },
    {
        "word": "Oʻzgaruvchan Talab",
        "type": [],
        "definition": [
            "erkin bozorda mahsulot narxining ma’lum bir foizga o'zgarishi, talabning necha foizga o'zarishini belgilovchi ko'rsatkich. U baholarning o'zgarishi va ularning darajasi bo'yicha qaror qabul qilish jarayonida keng qo'llaniladi."
        ]
    },
    {
        "word": "Oʻzgaruvchan Xarajatlar ",
        "type": [],
        "definition": [
            "ishlab chiqarilayotgan mahsulotlar miqdoriga bog'liq xarajatlar, xomashyo materiallari, ish haqiga va h.k. sarflangan xaraj atlardan tashkil topadi."
        ]
    },
    {
        "word": "Oʻzini-Oʻzi Band Etuvchi Shaxs ",
        "type": [],
        "definition": [
            "bunday shaxs o'zi mehnat qiladigan korporatsiyalashmagan korxonalarning shaxsiy yoki sherik mulkdori hisoblanadi, ammo kvazikorporatsiyalar deb baholanuvchi korporatsiyalashmagan korxonalar bundan istisno."
        ]
    },
    {
        "word": "Oʻzi-Oʻzini Ish Bilan Band Qiluvchi Va Ish Bilan Band Boʻlmagan Shaxslarning Ijtimoiy Sugʻurta Ajratmasi ",
        "type": [],
        "definition": [
            "yollanma xodim bo'lmagan, ya’ni o'z-o'zini ish bilan band qiluvchi va ish bilan band bo'lmagan shaxslar tomonidan o'z shaxsiy farovonligini ta’minlash uchun to'laydigan ijtimoiy sug'urta ajratmasi. "
        ]
    },
    {
        "word": "Oʻzlik Kapitali ",
        "type": [],
        "definition": [
            "uchinchi shaxslar talablari qondirilgandan so'ng korxona mulkdorlarga tegishli korxona aktivlari qiymatining bir qismi hisoblanadi. O'zlik kapitalining baholanishi rasmiy (ikkita usul yordamida, balansli baholash, ya’ni joriy xisob-kitoblar va hisobotlarga asosan yoki bozor baholarida) yoki haqiqiy baholarda amalga oshirilishi mumkin, ya’ni korxona tugatilishi vaqtida."
        ]
    },
    {
        "word": "Oʻz-Oʻzin I Moliyalashtirish",
        "type": [],
        "definition": [
            "qo'shimcha mablag'lar manbalarini jalb qilishning eng ko'zga ko'ringan usuli, lekin uni uzoq muddatlar uchun prognoz qilish qiyin va miqdor jihatidan ham chegaralangan."
        ]
    },
    {
        "word": "Oʻz-Oʻzin I Qoplash ",
        "type": [],
        "definition": [
            "korxona o'z xarajatlarini olgan foydasi bilan qoplashi, mahsulotni sotish va xizmat ko'rsatishdan kelgan daromad bilan korxona o'z xarajatlarini qoplashi."
        ]
    }
]