[
    {
        "word": "Pablisiti",
        "type": [],
        "definition": [
            "mijozlar bilan korxona o'rtasidagi jamoatchilik ijobiy fikrini ommaviy axborot vositalarida shakllantirish, yaxshi ovozalar tarqatish."
        ]
    },
    {
        "word": "Paketdagi Lizing",
        "type": [],
        "definition": [
            "mavjud ishlab chiqarish inshootlari va binolar kreditga berilib, zarur bo'lgan mashina va uskunalar esa ijarachiga ijara shartnomasi asosida beriladi"
        ]
    },
    {
        "word": "Parafirlash",
        "type": [],
        "definition": [
            "tasdiqlash, muzokaralar natijasida tuzilgan shartnoma tekstiga rozilikni tasdiqlash shakli; bunda tomonlar vakillari shartnoma teksti oxiriga yoki har varag'iga ism va familiyalarining bosh harflarini qo'yib chiqadilar."
        ]
    },
    {
        "word": "Pareto Optimum (Pareto Samaradorlik)",
        "type": [],
        "definition": [
            "nematlarning shunday taqsimlanishiki, bunda biror kishining turmush farovonligini pasaytirmasdan boshqa kishining turmush farovonligini oshirib bo'lmaydi"
        ]
    },
    {
        "word": "Parij Klubi",
        "type": [],
        "definition": [
            "dunyoning asosiy (bosh) kreditor-davlatlari guruhi. Agar biror-bir qarzdor mamlakat o'z to'lov balansini balanslashtirishda qiyinchilikka duch kelib, XVF yordamida o'z iqtisodiyotini sog'lomlashtirish dasturini amalga oshirishga kirishsa, Parij klubi qarzdor mamlakatning moliyaviy muammolarini hal etishda o'z hissasini qo'shadi. Buning uchun hamkorlikda o'sha mamlakat bilan (birgalikda) bitim ishlab chiqiladi. Unga ko'ra, uning tashqi qarzlarini qaytarish muddatlari uzaytiriladi. Masalan, Rossiyaning Parij klubi davlatlariga qarzining hajmi 40 mlrd AQSH dollariga teng bo'lgan bir paytda, 1996 yil aprelining oxirida Parijda Rossiyaning Parij klubi kreditorlarigabo'lgan qarzini uzoq muddatli restrukturizatsiya qilish to'g'risida bitim imzolandi. Unga muvofiq ravishda Rossiya tomonidan qarzning qaytarilishi 2002 yildan boshlanishi va 2020 yilga kelib tugashi kerak. Bu narsa iqtisodiy krizisdan chiqqandan, iqtisodiyotda real o'sish sodir bo'lgandan so'ng Rossiyaga Parij klubi kreditorlarining tashqi qarzlarini qaytarishga kirishishga imkon beradi."
        ]
    },
    {
        "word": "Paritet",
        "type": [],
        "definition": [
            "valyutalarni sotib olish (sotish) jarayonida ularning sotib olish qobiliyatini tenglashtiruvchi almashtirish kursining darajasidir."
        ]
    },
    {
        "word": "Parlament",
        "type": [],
        "definition": [
            "frans. “parle” - gapirmoq so'zidan kelib chiqqan bo'lib, rasmiy so'zlashish joyi ma’nosini anglatadi. Parlament davlatning oliy vakillik organi hisoblanadi va qonun chiqaruvchi hokimiyatni amalga oshiradi"
        ]
    },
    {
        "word": "Passiv",
        "type": [],
        "definition": [
            "(lot. faolsiz) xolis turmoq, tushuntirish kabi so'zlarning ildizidan olingan. Tarixan bu atama dastlab faqat qarzga olingan mablag‘larga nisbatan, ya’ni uchinchi shaxslar oldidagi majburiyatlarga nisbatan qo'llanar edi. Bu bilan mulk egasi qarzga olingan mablag‘larga bo'Igan munosabatda o‘zboshimchalikdan o'zini tutishi kerakligi ta’kidlangan edi. Keyinchalik “passiv” atamasi manbalarning boshqa moddalariga ham tarqatilgan bo'lib, faqat korxona majburiyatlarini tavsiflabgina emas, mablag'lar turlarini qanday maqsadlarga mo'ljallanganligini ham tavsiflash uchun ishlatiladigan bo'ldi. l) balansning (o'ng) qismi bo'lib, unda korxona mablag'larining manbalari va ularning qanday maqsadlarga mo'ljallanganligi ko'rsatiladi. 2) korxona barcha qarz va majburiyatlari majmuasi. Balansning passiv qismida majburiyatlar va xususiy kapital aks ettiriladi."
        ]
    },
    {
        "word": "Passiv Kapital",
        "type": [],
        "definition": [
            "uzoq muddatli mablag'lar manbai bo'lib, ular hisobiga xo'jalik subyektining aktivlari shakllantiriladi. Ular o'z va qarz kapitalga ajratiladi."
        ]
    },
    {
        "word": "Passiv Savdo Balansi",
        "type": [],
        "definition": [
            "mamlakatga keltiriladigan tovarlar (importi) miqdorining jo'natiladigan tovarlar (eksporti) miqdoridan oshib ketishi."
        ]
    },
    {
        "word": "Passiv Schyotlar",
        "type": [],
        "definition": [
            "o'z mablag'lar manbaini va majburiyatlarni hisobga oluvchi buxgalteriya hisobi schyotlari. Mablag'lar manbalari ko'payishi passiv schyotlarning kreditiga, kamayishi debetiga yoziladi. Qoldig'i kreditida bo'lib, balansning passivida ko'rsatiladi. Schyotlar rejasida passiv schyotlarning ro'parasiga “P” (passiv) harfi qo'yilgan."
        ]
    },
    {
        "word": "Passiv Toʻlovlar Balansi",
        "type": [],
        "definition": [
            "mamlakatning xorijiy sarf-xarajatlari va to'lovlari mamlakatga xorijdan kelib tushadigan tushumlaridan oshib ketishini bildiruvchi to'lov balansi."
        ]
    },
    {
        "word": "Passivlar",
        "type": [],
        "definition": [
            "boshqa birlik oldidagi majburiyat. Passivlar tasnifi aktivlar tasnifi bilan deyarli bir xil. Asosiy farq aktivdagi monetar oltin boshqalar uchun passiv bo'lmaydi. Bundan tashqari, aktivdagi debitorlik majburiyati (qarzi), berilgan kreditlar, boshqa moliyaviy aktivlar turlari o'rniga mos ravishda passivda kreditorlik qarzi, olingan kreditlar va boshqa moliyaviy passivlar, deb yoziladi."
        ]
    },
    {
        "word": "Past Kateg О Rtyali Tovarlar",
        "type": [],
        "definition": [
            "daromad oshganda talab kamayadigan tovarlar."
        ]
    },
    {
        "word": "Past Talab",
        "type": [],
        "definition": [
            "mo'ljallangan daraja va qondirish imkoniyatlariga nisbatan past bo'Igan talab"
        ]
    },
    {
        "word": "Patent",
        "type": [],
        "definition": [
            "(lot. “patents” guvohnoma, yorliq) -1 ) xususiy tarzda tadbirkorlikning biror-bir turi bilan shug'ullanishga ruxsat beruvchi guvohnoma, tegishli hujjatlar asosida moliya organlari tomonidan beriladi; 2) ilmiy kashfiyot va ixtiroga mualliflikni tasdiqlovchi guvohnoma. Patent davlat tomonidan patentlashtiriladi. Masalan, savdo yoki hunarmandchilik bilan shug'ullanish huquqi. Amaldagi soliq qonunchiligiga muvofiq doimiy savdo nuqtalarida (joylarida) savdoni amalga oshiruvchi yuridik va jismoniy shaxslar savdo qilish huquqiga ega bo'lish uchun vaqtinchalik patentni sotib oladilar. Patentda uning berilish muddati (patent amal qiladigan davr), savdo amalga oshiriladigan mahsulotlar guruhi va savdo qilish joyi o'z aksini topgan bo'lishi lozim."
        ]
    },
    {
        "word": "Pay",
        "type": [],
        "definition": [
            "qism, a’zolik hissasi, badal, pay; birorta korxona tashkil etilganda a’zolari to'laydigan a’zolik badallari"
        ]
    },
    {
        "word": "Pay Fondi",
        "type": [],
        "definition": [
            "shirkat xo'jaligi ustaviga muvofiq shirkat xo'jaligi a’zolarining qiymatda ifodalangan mulkiy paylari, har bir a’zoning shirkat xo'jaligi pay fondidagi ulushi."
        ]
    },
    {
        "word": "Paychilik Munosabatlari",
        "type": [],
        "definition": [
            "sherikchilik asosida biznes yuritishga hissa qo'shish va shu hissaga qarab daromad ko'rish sohasidagi iqtisodiy munosabatlar."
        ]
    },
    {
        "word": "Pensiya",
        "type": [],
        "definition": [
            "1) fuqarolar keksalik yoshiga yetganda yoki mehnat qilish qobiliyatini yo'qotgan taqdirda oladigan pul ta’minoti; 2) mehnat stajiga ko'ra qo'Iga kiritilgan huquq, ijtimoiy nafaqa esa muhtojlarga davlat tomonidan ko'rsatiladigan yordam deb belgilab qo'yildi. Pensiya qarilik, nogironlik, xizmat qilgan yillari uchun va boquvchisini yo'qotganda fuqarolarni moddiy jihatdan ta’minlash uchun pul summalarining kafolatlangan har oylik to'lovi. Uning quyidagi turlari bo'lishi mumkin: qarilik pensiyasi; nogironlik pensiyasi, xizmat qilgan yillari uchun pensiya; boquvchisini yo'qotganligi uchun pensiya; ijtimoiy pensiya."
        ]
    },
    {
        "word": "Pensiya Fondi",
        "type": [],
        "definition": [
            "pensiya bilan ta’minlovchi davlat moliya boshqaruvining organi bo'lib, mustaqil moliya instituti hisoblanadi, fondning mablag'lari davlat budjeti tarkibiga kirmaydi"
        ]
    },
    {
        "word": "Penya",
        "type": [],
        "definition": [
            "fuqarolik huquqida jazo choralari (jarima)ning ko'rinishlaridan biri, qonun yoki shartnomaga muvofiq to'lovlar muddatini buzganlik uchun undiriladigan moliyaviy jazoning shakli. Uning miqdori qonunga ko'ra to'lovning har bir kechiktirilgan kuni uchun to'lanishi lozim bo'lgan summaga nisbatan foizda belgilanadi. Korxona tomonidan to'langan penya summasi noishlab chiqarish xarajatlarining tarkibiga kiritiladi."
        ]
    },
    {
        "word": "Perikl",
        "type": [],
        "definition": [
            "(m.a. 490-429) qadimgi yunon siyosiy arbobi. Qul ekspluatatsiyasini keng qo'llagan, lekin savdo va pul xo'jaligini ham rivojlantirgan. Afinani eng rivojlangan davrda boshqargan."
        ]
    },
    {
        "word": "Petti Uilyam",
        "type": [],
        "definition": [
            "(1623-1687) ineliz iatisodchisi, klassik iqtisodiyot nazariyasi vakili, mehnat qiymati nazariyasi asoschisi. Uning iqtisodiy qarashlari “Soliqlar va yig'imlar xususida traktat” (1662), “Siyosiy arifmetika” (1676) kabi asarlarida o'z aksini topgan va birinchi marta o'z tadqiqotlarida analiz va statistika uslublaridan foydalanib, iqtisodiy foyda, uslubiyat masalalarini rivojlantirgan. U. Pettining qarashlari merkantilizmdan klassik iqtisodiyot nazariyasiga o'tish tasnifiga ega bo'lgan. Shuning uchun uning nazariy qarashlari yaxlit bir butun tizim sifatida shakllanmagan. Ammo u mehnat qiymat nazariyasidan kelib chiqqan holda tovar narxi, ish haqi, yer narxi kabi tushunchalami asoslagan. U. Pettining fikricha, foyda faqat ishlab chiqarish sohasida yaratiladi. U birinchi marta iqtisodiyot nazariyasini o'rganish obyektini muomala sohasidan ishlab chiqarish sohasiga olib o'tgan."
        ]
    },
    {
        "word": "Petti Vilyam",
        "type": [],
        "definition": [
            "(1623-1687) - Angliya klassik iqtisodiy maktabining asoschisi, merkantilizmni inkor etgan, boylikning asosi ishlab chiqarishda, degan fikrni ilgari surgan, “mehnat boylikning otasi, yer esa uning onasidir” degan iborani qo'llagan. Kapitalistik tuzumni tabiiy va abadiy deb hisoblagan. Tovarning almashuv qiymatini tan olgan. Statistika (“Siyosiy arifmetika”) faniga asos solgan. Aholiga boylik yaratuvchisi sifatida qaradi."
        ]
    },
    {
        "word": "Pirovard Isteʼmol Uchun Uy Xoʻjalik Xarajatlari",
        "type": [],
        "definition": [
            "xarajatlar rezident uy xo'jaliklari tovar va xizmatlarning pirovard iste’moli uchun qiladigan xarajatlardan tarkib topadi"
        ]
    },
    {
        "word": "Pirovard Isteʼmolga Umumdavlat Boshqaruvi Xarajatlari",
        "type": [],
        "definition": [
            "umumdavlat boshqaruvi sektorining iste’mol mollari va ko'rsatilgan xizmat uchun qilingan xarajatlar."
        ]
    },
    {
        "word": "Pirovard Mahsulot",
        "type": [],
        "definition": [
            "qarang: yalpi milliy mahsulot."
        ]
    },
    {
        "word": "Platon (Aflotun)",
        "type": [],
        "definition": [
            "(m.a. 428\/427-348\/347) “Davlat” va “Qonunlar” asarlarining muallifi. Jamiyatni ish quroli - natural ishlab chiqarish deb qaragan, natural xo'jalikni qo'llagan, pulni jamiyatdagi dushmanlikning bosh sababchisi deb bilgan"
        ]
    },
    {
        "word": "Plyuralizm",
        "type": [],
        "definition": [
            "bilim asoslari va uning shakllanishi to'g'risida bir necha filosofik qarashlar yoki bir muammoga turlicha yondashish, fikrlar turlitumanligi. Masalan: mulk plyuralizmi - mulklar turli-tumanligini bildiradi."
        ]
    },
    {
        "word": "Podani Takror Ishlab Chiqarish",
        "type": [],
        "definition": [
            "chorva mollari sonini doimo yangilab borish, bosh sonini ko'paytirib borish, mollar zotini yaxshilash jarayoni."
        ]
    },
    {
        "word": "Polis",
        "type": [],
        "definition": [
            "(fran. “police”, ital. “pollissa” - tilxat) shaxsiy yoki mulkiy sug'urta shartnomasi tuzilgani va uning shartlari haqidagi hujjat."
        ]
    },
    {
        "word": "Portfel",
        "type": [],
        "definition": [
            "qimmatli qog'ozga qilingan investitsiya va boshqa korxonaning aksiyasiga kiritish."
        ]
    },
    {
        "word": "Portfel Investitsiyalar",
        "type": [],
        "definition": [
            "shunday investitsiyalarki, bunda kapital daromad olish maqsadida korxonalarning aksiyalari, obligatsiyalari va boshqa qimmatli qog'ozlarini sotib olish uchun sarflanadi."
        ]
    },
    {
        "word": "Portfelni Boshqarish",
        "type": [],
        "definition": [
            "faqatgina moliyaviy qurollarning maqbul yig'indisini yaratish emas, balki uning orqasidan u yoki bu qurollarning haqiqiy dinamikasiga muvofiq portfel tarkibini o'zgartirish hamdir."
        ]
    },
    {
        "word": "Poshlina",
        "type": [],
        "definition": [
            "qonunda belgilangan tartibda va shartlarda to'lovchilar tomonidan belgilangan miqdorda budjetga yoki budjetdan tashqaridagi foizga o'tkaziladigan majburiy to'Iov."
        ]
    },
    {
        "word": "Poshlinalar (Boj, Boj Puli)",
        "type": [],
        "definition": [
            "bojxona nazorati ostida davlat tomonidan mamlakat chegarasidan olib o'tiladigan import tovarlar, mol-mulk va qimmatbaho buyumlardan undiriladigan pul yig'imlari. U bilvosita soliq turi bo'lib, uning mol chiqarish, mol kiritish va mamlakat territoriyasi orqali tashib o'tkazish (tranzit) uchun undiriladigan turlari mavjud. Boj muayyan tovarlar ro'yxati, tovar miqdori, massasi, birligi, shuningdek, tovar bahosi bo'yicha belgilangan bojxona tariflari doirasida undiriladi."
        ]
    },
    {
        "word": "Potensial Bozor",
        "type": [],
        "definition": [
            "korxonaning tovari (xizmati) qiziqtirishi, jalb etish, ehtiyojini qondirish mumkin bo'Igan iste’molchilar guruhi."
        ]
    },
    {
        "word": "Potensial Yaim",
        "type": [],
        "definition": [
            "to'liq bandlilik sharoitida, yoki mavjud sarmoya resurslari va ishchi kuchidan to'liq foydalanish hisobiga erishilishi mumkin bo'Igan ishlab chiqarish hajmi."
        ]
    },
    {
        "word": "Pozitiv Iqtisodiyot Nazariyasi",
        "type": [],
        "definition": [
            "obyektiv iqtisodiy voqelikni tahlil etib, uning rivojlanish qonuniyatlarini aniqlaydi. U iqtisodiy sohadagi omil, sharoitlar va hodisalar bilan shug'ullanadi"
        ]
    },
    {
        "word": "Prays-Teyker",
        "type": [],
        "definition": [
            "o'zining mahsuloti narxiga ta’sir eta ololmaydigan firma."
        ]
    },
    {
        "word": "Predmet Prinsipi Boʻyicha Uskuna Joylashishi",
        "type": [],
        "definition": [
            "shunday joylashtirish uslubiki, bunda uskunalar yoki ishlab chiqarish jarayonlari mahsulot ishlanayotganda ketma-ket o'tadigan texnologik operatsiyalar bo'yicha joylashadi; bundan tashqari uni material oqimi bo'yicha joylashuvi deb atashadi"
        ]
    },
    {
        "word": "Preferensial Tartib",
        "type": [],
        "definition": [
            "bir davlatdan ikkinchi davlatga beriladigan, ammo uchinchi davlatga joriy etilmaydigan alohida imtiyozli va intizomli tartib. Ko'pincha chetdan keltirilgan tovarlarga qo'yiladigan bojlami kamaytirish, tashqi savdo muomalalarini imtiyozli kreditlash hamda sug'urta qilish, maxsus valyuta tartibi, moliyaviy va texnik yordam ko'rsatishdan iborat bo'ladi."
        ]
    },
    {
        "word": "Preferensiya",
        "type": [],
        "definition": [
            "imtiyoz yoki afzallik bo'lib, investitsion va innovatsion xarajatlarni moliyalashtirish uchun investitsion soliq krediti va maqsadli soliq imtiyozi shaklida belgilanadi."
        ]
    },
    {
        "word": "Press-Reliz",
        "type": [],
        "definition": [
            "gazeta va jurnallar, tele- va radio redaksiyalari ularni qiziqtirayotgan ma’lumotlarni olish mumkin bo'lgan byulleten, pablik-rileyshnz vositasi"
        ]
    },
    {
        "word": "Prestij",
        "type": [],
        "definition": [
            "(obro‘, nufuz) rahbar xodimningbilim saviyasi, ishdagi muvafFaqiyati, shaxsiy sifat va salohiyatining umum e’tirof etilishi va ushbu omillarning xodimlarning ijrochilik mas’uliyatini kuchaytirishga ko'rsatadigan ta’sir samarasi."
        ]
    },
    {
        "word": "Prezentatsiya",
        "type": [],
        "definition": [
            "taqdim etmoq, tortiq qilmoq topshirish, tasawur, tushuncha; o'tkazma vekselni, to'lovni (trassat) amalga oshiruvchi shaxsga topshirish."
        ]
    },
    {
        "word": "Prinsiplar",
        "type": [],
        "definition": [
            "qonuniyatlarga asoslanib, jamiyat tomonidan amalga oshiriladigan qoidalarni bildiradi va ular iqtisodiy-ekologik siyosatning yo'nalishlarini belgilab beradi."
        ]
    },
    {
        "word": "Prtvatizatsiya",
        "type": [],
        "definition": [
            "davlat tasarrufidagi mol-mulkning xususiylashtirilishi asosida individual yoxud kollektiv mulkdorlikning shakllanishi (qarang: xususiylashtirish)."
        ]
    },
    {
        "word": "Professional",
        "type": [],
        "definition": [
            "o'z ishining ustasi, kasbini yaxshi biladigan shaxs"
        ]
    },
    {
        "word": "Prognozlash",
        "type": [],
        "definition": [
            "biror obyektning yoki hodisaning kelajakdagi me’yoriy yoki maqbul holatlari, ularga erishish va ularni ro'yobga chiqarish yo'llari to'g'risidagi ehtimolga yaqin tasawumi ishlab chiqish. Prognozlash oldindan ko'rish shakli bo'lib, ijtimoiy-iqtisodiy, ilmiy-texnikaviy dasturlar va rejalar ishlab chiqish uchun amalga oshiriladi. Turli xil tarkibiy qismlarni prognozlashga asoslangan qisqa muddatli (1,5) yilgacha, o'rta muddatli (5 yil) va uzoq muddatli (10-15 yil) prognozlar mavjud. Taqdim etish shakliga ko'ra, miqdoriy va sifat prognozlariga, tadqiqot obyektlarini qamrab olish bo'yicha umumiy va qisman prognozlashga taqsimlanadi."
        ]
    },
    {
        "word": "Programmalash",
        "type": [],
        "definition": [
            "ish faoliyati rejasi, asosiy prinsiplar, yo'nalishlarning vazifa va maqsadlarini bayon qilib berish."
        ]
    },
    {
        "word": "Progressiv Soliq",
        "type": [],
        "definition": [
            "soliqqa tortish bazasining oshishi bilan soliq stavkasining ko'tarilishi xarakterlidir. Progressiv soliqlarning orasida eng ko'p uchraydigani jismoniy shaxslarning daromadidan olinadigan soliqdir. Masalan, 2017-yil oktyabr oyidan boshlab respublikada minimal oylik maosh 149 775 so'm qilib belgilangan. 5 minimal oylik maoshdan 7,5%, 5 minimaldan - 10 minimalgacha oylik maoshdan 17%, 10 minimaldan yuqori oylik maoshdan 23% soliq olinadi."
        ]
    },
    {
        "word": "Progressiv Soliqqa Tortish",
        "type": [],
        "definition": [
            "soliqqa tortiladigan summaning o'sishiga mos ravishda soliq stavkasi ham ortadigan soliqqa tortish tizimi. Ular quyidagi shakllarda mavjud bo'ladi: l) oddiy progressiya - daromadning barcha summasi uchun soliqning stavkasi daromadning o'sishiga muvofiq o'sadi (ortadi); 2) murakkab progressiya - daromad qismlarga bo'linadi va ularning har biri o'z stavkasi bo'yicha soliqqa tortiladi. Daromadning har bir keyingi qismi uchun soliqning stavkasi oldingisiga nisbatan yuqoriroq bo'ladi."
        ]
    },
    {
        "word": "Progressiv Xarajatlar",
        "type": [],
        "definition": [
            "subyektning ishbilarmonlik faoliyatiga nisbatan tezroq o'sadigan xarajatlar"
        ]
    },
    {
        "word": "Prolongatsiya",
        "type": [],
        "definition": [
            "l) kelishuv shartnomalarining amal qilish muddatini uzaytirish; 2) o'zaro kelishgan holda sug'urta shartnomasining amal qilish muddatini uzaytirish. Prolongatsiya yozma ko'rinishda tasdiqlanishi mumkin."
        ]
    },
    {
        "word": "Promessa",
        "type": [],
        "definition": [
            "Shunday hujjatki, unga ko'ra obligatsiya, yutuqli zayom yoki lotoreya bileti egasi (sotuvchi) yutuqni, agar u ushbu obligatsiya (bilet)ning yaqin oradagi tirajiga to'g'ri kelsa, ma’lum miqdordagi pulga boshqa shaxsga (xaridorga) sotish majburiyatini zimmasiga oladi. Yutuq chiqmasa, xaridorning hamma xuquqlari tugaydi"
        ]
    },
    {
        "word": "Proporsional Qayta Sugʻurtalash",
        "type": [],
        "definition": [
            "qayta sug'urtalash shartnomasini tuzish shakli. Bu erda qayta sug'urtalash kompaniyasi sug'urta mukofotlarining umumiy tushumidagi va sug'urta qoplamalarini to'lashda o'z ulushiga ega. Proporsional qayta sug'urtalash shartnomalari kvotali, eksedentli va kvota-eksedentli shartnomalarini o'z ichiga oladi."
        ]
    },
    {
        "word": "Proporsional Soliq",
        "type": [],
        "definition": [
            "soliq shaklida olinishi mumkin bo'lgan summa soliqqa tortish bazasining o'lchamiga (miqdoriga, hajmiga) proporsionaldir. Bu soliq yagona stavkali soliqlar jumlasiga kiradi"
        ]
    },
    {
        "word": "Proteksionizm Siyosati",
        "type": [],
        "definition": [
            "davlatning milliy iqtisodiyotni chet el raqobatidan, ichki bozorni chet el tovarlari kirib kelishidan himoya qilishga qaratilgan siyosati. Eksportni rag'batlantirish, importni cheklash va shunga o'xshash tadbirlarni amalga oshirish uchun chet el tovarlariga ustama haqlar belgilash, boj haqlarini oshirish orqali proteksionizm siyosatini olib boradi."
        ]
    },
    {
        "word": "Protseduralar",
        "type": [],
        "definition": [
            "o'tmish tajribasi uning muvaffaqiyati va mag'Iubiyati asosida ishlab chiqiladi. Protseduralar shunday sharoitlarda, yarn aniq vaziyat awalgisiga o'xshash bo'lganda ishlatiladi. Inson oldindan tayyorlangan qoida, ya’ni protsedura bo'yicha harakat qilayotgan bo'lsa, uning darajasiga ega bo'ladi. Shunday qilib protseduralar masalaning yechish kafolati va qarorning yechilishi aniq va to'g'riligini nazorat qiluvchi sifatida ishlatiladi."
        ]
    },
    {
        "word": "Proteksionizm",
        "type": [],
        "definition": [
            "davlatning xorij raqobatidan ichki bozorni himoya qilish siyosati, mamlakatga olib kelinayotgan tovarlarga yuqori bojlar belgilaydi, ayrim tovarlarni olib kelish cheklanadi yoki umuman taqiqlanadi."
        ]
    },
    {
        "word": "Prudon Per Jozef",
        "type": [],
        "definition": [
            "fransiyalik mayda ishlab chiqarish iqtisodchisi va sotsiologi, mayda ishlab chiqarishni himoya qildi, “ishchi puli” orqali mahsulot sotishni, kapitalizmni isloh qilishni taklif etdi. Prudon pulga qarshi bo'Igan. Klassik maktabga muqobil fikrlar bildirgan."
        ]
    },
    {
        "word": "Puashal Soliq",
        "type": [],
        "definition": [
            "daromad miqdoridan qat’iy nazar olinadigan soliq"
        ]
    },
    {
        "word": "Pudrat",
        "type": [],
        "definition": [
            "shartnoma yoki xo'jalik yuritishning bir turi. Bir tomonning ikkinchi tomon talabiga kora belgilangan ishni bajarishi to'g'risidagi shartnoma. Masalan, qurilish tashkilotining jamoa xo'jaligiga biror obyektni qurish to'g'risidagi kelishuvi"
        ]
    },
    {
        "word": "Pudratchilar-",
        "type": [],
        "definition": [
            "yuridik va jismoniy shaxslar bo'lib, ular buyurtmachilar tuzgan shartnomalar asosida ishlami bajaradilar. Pudratchilar qurilish-montaj ishlarini amalga oshirish uchun ruxsatnomaga (litsenziyaga) ega bo'lishlari kerak."
        ]
    },
    {
        "word": "Pul",
        "type": [],
        "definition": [
            "hamma tovarlar va xizmatlar ayirboshlanadigan, umumiy ekvivalent bo'Igan maxsus tovar, bozor iqtisodiyotining asosiy vositasi. Pul bozor yuzaga kelishi va rivojlanishining mahsulidir. Pul kelib chiqish tarixi va tabiatiga ko'ra 3 xil xususiyatga ega: a) hamma narsaga ayirboshlanadigan muhim xarid vositasi; b) boylik timsoli; c) mehnatni qiymat shaklida o'lchab boradigan vosita."
        ]
    },
    {
        "word": "Pul Agregatlari",
        "type": [],
        "definition": [
            "pul guruhlari. Jamg'arila borib xarid qobiliyatini saqlovchi barcha pul vositalari pul agregati deb ataladi. Bunga naqd pullar, ma’lum muddatga yoki muddatsiz bankka qo'yilgan pullar, sertifikatlar va boshqalar kiradi. Pul muammosini muqobil o'lchovchi hisoblanadi. Hozirda quyidagi pul agregatlari farqlanadi: Mj - pullar, unga naqd pullar (metall va qog'oz pullar), chekli qo'yilmalar, gohida kredit kartochkalari kiradi. M - pullar, unga Mj cheksiz jamg'arma hisoblaridagi qo'yilmalar, qisqa muddatli qo'yilmalar kiradi. M - pullar, unga M muddatli yirik qo'yilmalar kiradi."
        ]
    },
    {
        "word": "Pul Akttvlari",
        "type": [],
        "definition": [
            "ma’lum sohada korxonaning hisob raqami, kassasida bo' lgan pul mablag'lari."
        ]
    },
    {
        "word": "Pul Aylanish Tezligi",
        "type": [],
        "definition": [
            "nominal yalpi ichki mahsulotning o'rtacha yillik pul massasiga nisbati orqali aniqlaniladi"
        ]
    },
    {
        "word": "Pul Bazasi",
        "type": [],
        "definition": [
            "bank tizimidan tashqaridagi naqd pullar va Markaziy bankdagi tijorat banklarining zaxiralari"
        ]
    },
    {
        "word": "Pul Bozori",
        "type": [],
        "definition": [
            "davlat xazinasiga bevosita naqd pul tushishini ta’minlaydi va firma yoki jismoniy shaxsga o'zlarining vaqtinchalikbo'sh mablag'laridan daromad olishga imkon beradi. Pul bozorisiz to'liq ma’nodagi moliya bozori bo'lishi mumkin emas"
        ]
    },
    {
        "word": "Pul Bozori",
        "type": [],
        "definition": [
            "pul taklifi va unga bo'Igan talab foiz stavkasi darajasi bilan aniqlanadigan bozor. Pulga talab xo'jalik faoliyati uchun zarur pulga ehtiyoj dir. Uning shakllanishining asosiy ikkita sababi mavjud: a) insonlarga har doim tovar va xizmatlarni sotib olish uchun, korxonalarga esa resurslar olish uchun pul zarur bo'ladi; b) insonlar o'zlarining pullarini har xil (aksiya, obligatsiya va h.k.) shaklda saqlaydilar, demak, aktivlar tomonidan pulga talab bo'ladi. Pul bozoridagi talab va taklifning bir-biriga to'g'ri kelishi iqtisodiyot uchun o’ta muhim masala hisoblanadi. Ayrim sabablarga ko'ra muomaladagi pul massasining ko'payib ketishi inflyatsion jarayonlarning zo'rayishiga, jami talabning jami taklifga nisbatan oshib ketishi makroiqtisodiy muvozanatningbuzilishiga olib keladi. Pulning muomalada kamayib ketishi ham pirovard natijada jami taklifning jami talabdan oshib ketishi, umuman muvozanatning buzilishiga olib keladi. Shuning uchun pul bozorida talab va taklifni muvozanatlab turish lozim deb hisoblanadi. Buni, asosan, davlat o'zining chiqargan qimmatli qog'ozlarini sotish va sotib olish natijasida amalga oshiradi, ular ochiq bozorlardagi “operatsiyalar” deyiladi."
        ]
    },
    {
        "word": "Pul Bozori Dastaklari",
        "type": [],
        "definition": [
            "pulli dastak bo'lib, uning sohibiga ma’lum bir davr ichida kafolatlangan va qat’iy belgilangan pul daromadi olish huquqini beradi."
        ]
    },
    {
        "word": "Pul Emissiyasi",
        "type": [],
        "definition": [
            "amaldagi pul massasining ortishiga olib keluvchi pullami muomalaga chiqarish."
        ]
    },
    {
        "word": "Pul Islohoti",
        "type": [],
        "definition": [
            "pulni bekor qilib, yangi pul nusxalarining joriy etilishi. Pul islohoti qog'oz pullaming qadri ketib, ularning to'lov quwati nolga tenglashib qolgan kuchli inflyatsiya sharoitlarida amalga oshiriladi"
        ]
    },
    {
        "word": "Pul Mablagʻlarining Tushumi Va Chiqimi Rejasi",
        "type": [],
        "definition": [
            "korxona pul oqimlariniprognozlashtirish natijalarini aks ettirishga qaratilgan, pul mablag'larining yil boshidagi qoldiq ko'rsatkichi, reja davridagi tushum va chiqimi hamda pul mablag'larining yil oxiridagi qoldiq ko'rsatkichlarining o'zaro bog'liqligini ta’minlaydigan reja turi."
        ]
    },
    {
        "word": "Pul Massasi",
        "type": [],
        "definition": [
            "har qanday mamlakat iqtisodiyotida tovarlar va xizmatlar aylanishini ta’minlaydigan, xususiy shaxslar, institutsional mulkdorlar (korxonalar, birlashmalar, tashkilotlar va b.) va davlat egalik qiladian naqd va naqd pulsiz xarid hamda to'lov vositalari majmuyidir."
        ]
    },
    {
        "word": "Pul Miqdori",
        "type": [],
        "definition": [
            "muomalaga chiqarilgan metall tangalar va qo'g'oz pullari (xazina va bank biletlari) jami miqdori. Bankdagi barcha pul vositalari ham kiradi. Pul miqdori aholi qo'lida, kredit tizimi kassalari, korxona va tashkilotlarda to'planadi"
        ]
    },
    {
        "word": "Pul Muomalasi",
        "type": [],
        "definition": [
            "naqd pul bo'lib, tovarlar aylanishi va notovarlar harakati, to'lov va hisoblar uchun xizmat qiladi. Aynan bir jarayonning doimo bir xilda takrorlanishidir."
        ]
    },
    {
        "word": "Pul Muomalasining Barqarorligi",
        "type": [],
        "definition": [
            "pulning xarid quwati pasaymagan holda uzluksiz harakatda bo'lishi. Pul muomalasining barqarorligini ta’minlash (awalo, bozorga yetarli miqdorda va sifatli tovarlar chiqarilishi) kerak. Tovarlar taqchilligi mavjud bo'lgan sharoitda pul muomalasi barqarorligiga erishib bo'lmaydi, tovarlar qimmatlashib, pul qadrsizlanib boradi."
        ]
    },
    {
        "word": "Pul Qadri",
        "type": [],
        "definition": [
            "pulning tovar va xizmatlarni xarid etish, chet el valyutalariga almasha olish qobiliyati."
        ]
    },
    {
        "word": "Pul Qiymati",
        "type": [],
        "definition": [
            "pul birligiga almashtirilishi mumkin bo'lgan tovar va xizmatlar miqdori; pul birligini sotib olish qobiliyati; baho darajasiga teskari kattalik"
        ]
    },
    {
        "word": "Pul Shaklidagi Asosiy Transfert",
        "type": [],
        "definition": [
            "biror narsa sotib olish yoki aktivlarni (moddiy aylanma vositalar zaxirasi bundan mustasno) boshqalarga berish bilan bog'liq pul shaklidagi transfertga deyiladi."
        ]
    },
    {
        "word": "Pul Shaklidagi Ijtimoiy Yordam Nafaqasi",
        "type": [],
        "definition": [
            "uy xo'jaliklariga davlat birliklariva notijorat tashkilotlar tomonidan naqd pul shaklida beriladigan joriy transfertlar. Bu nafaqa ijtimoiy sug'urta nafaqasi qanday maqsadni ko'zda tutsa, o'sha maqsadni ko'zda tutadi. Lekin pul shaklidagi ijtimoiy yordam nafaqasi ijtimoiy sug'urta dasturi hisobidan berilmaydi."
        ]
    },
    {
        "word": "Pul Taklifi (Muomiladagi Pul Miqdori)",
        "type": [],
        "definition": [
            "metall va qog'oz pullar, talab qilinganda beriladigan omonatlar, chek ko'rinishidagi omonatlar, shuningdek, (pul taklifining bir oz keng ma’nodagi ta’riflarida) muddatli omonatlar, depozitlar va hokazolar"
        ]
    },
    {
        "word": "Pul Tizimi",
        "type": [],
        "definition": [
            "tovar muomilasi rivojlanishining natijasi bo'lib, davlatlar tomonidan qonunchilik asosida mamlakatda pul muomilasini tashkil etish."
        ]
    },
    {
        "word": "Pulga Boʻlgan Talab -",
        "type": [],
        "definition": [
            "uy xo'jaliklari va firmalar tomonidan bitimlarda to'lov vositasi sifatida foydalanish, ko'zda tutilmagan xarajatlar uchun saqlab turish, moliyaviy aktivlar sifatida foydalanib, daromad olish uchun jamg'arish maqsadida ega bo' lishga intilgan pul miqdori."
        ]
    },
    {
        "word": "Pulga Umumiy Talab -",
        "type": [],
        "definition": [
            "bitimlar uchun pul va aktivlar tomonidan pullarga talab summasi (qarang: pul bozori)."
        ]
    },
    {
        "word": "Pul-Kredit Siyosati",
        "type": [],
        "definition": [
            "to'la bandlik sharoitida jami mahsulotni ishlab chiqarishga inflyatsiyaning tasirini kamaytirish yoki bartaraf etish maqsadida muomaladagi pul miqdorini o'zgartirish tushuniladi. Uning yordamida har qanday davlat mamlakatda iqtisodiy barqarorlikni ta’minlash vazifasini amalga oshiradi. Deyarli hamma mamlakatlarda muomaladagi pul miqdorini tartibga solishda quyidagi vositalardan foydalaniladi: a) ochiq bozorda operatsiyalar; b) hisob-kitob stavkasi siyosati; v) bank majburiy zaxiralarining me’yorini o'zgartirish siyosati."
        ]
    },
    {
        "word": "Pulli Kapital Daro Mad Lari Dan Olinadigan Soliq.",
        "type": [],
        "definition": [
            "omonatlar bo'yicha foizlar, zayomlar bo'yicha yutuqlar va boshqa shunga o'xshash bir necha daromadlardan olinadi. Avstriya, Kanada, Ispaniya, Fransiya kabi mamlakatlarda amal qiladi. Pulli kapitalning egasiga daromad berilayotgan paytda soliq ushlab qolinadi. Soliqning stavkasi 20% dan 40% gacha tebranadi."
        ]
    },
    {
        "word": "Pulning Aylanish Tezligi",
        "type": [],
        "definition": [
            "muomaladagi pul birligining yiliga necha marta tovarlarni sotib olishga xizmat qilishi soni."
        ]
    },
    {
        "word": "Pulning Xarid Qobiliyati",
        "type": [],
        "definition": [
            "aniq pul birligining bozordagi tarif va narxlar darajasi sharoitida ma’lum miqdordagi tovar va xizmadarga almashinuv qobiliyati."
        ]
    },
    {
        "word": "Pulning Miqdoriy Nazariyasi",
        "type": [],
        "definition": [
            "pul taklifi va iqtisodiyotdagi baholarning umumiy darajasi o'rtasidagi to'g'ridan-to'g'ri bog'liqlikni o'rnatuvchi nazariya. Birinchi bor ingliz faylasufi va iqtisodchisi D. Yum tomonidan XVIII asrda ilgari surildi, amerikalik iqtisodchi I. Fisher tomonidan 1911 yilda rivojlantirildi va keyinchalik Kembrij universiteti iqtisodchilari tomonidan takomillashtirildi."
        ]
    },
    {
        "word": "Pulning Muomala Tezligi",
        "type": [],
        "definition": [
            "yil davomida bir so'm (dollar, frank va hokazo)ning o'rtacha necha marta tovar va xizmatlar sotib olishga sarflanganligini ko'rsatuvchi son."
        ]
    },
    {
        "word": "Pulning Qadrsizlanishi",
        "type": [],
        "definition": [
            "xarid quwatining pasayishi (qarang: inflyatsiya)."
        ]
    },
    {
        "word": "Pulning Vazifalari",
        "type": [],
        "definition": [
            "pul vositachiligida bajarilishi mumkin bo'Igan tadbirlar bo'lib, ular 5 tani tashkil etadi: a) tovarlarning qiymat o‘lchovivazifasi,yanibarchatovarlardagavdalanganmehnatmiqdori pul orqali o'lchanadi; b) muomala vositasi vazifasi, yani tovarlar oldi-sotdi qilinishi muomalasi pul vositasida amalga oshiriladi; d) jamg'arish, xazina to'plash vositasi vazifasi, yani o'zida mehnatni gavdalantirgani uchun boylikning umumiy shakliga aylanadi va kishilar ehtiyojlaridan ortiqcha pullarni jamg'ara boshlaydilar. Lekin pulning boylik sifatida jamg'arilishi uchun uning qadri, xarid quwatining saqlanishi muhim ahamiyatga ega; e) to'lov vositasi vazifasi, nasiyaga sotilgan tovarlar va xizmatlar haqi to'langan pul to'lov vositasi vazifasini bajaradi; f) jahon puli vazifasini, tovarlar muomalasi bir mamlakat doirasidan chiqa boshlashi va xalqaro savdoning yuzaga kelishi bilan bog'liq. Jahon puli vazifasini oltin, u bilan bir qatorda konvertlangan valyutalar ham bajaradi."
        ]
    },
    {
        "word": "Punkt",
        "type": [],
        "definition": [
            "indeksning o'lchovbirligi."
        ]
    }
]