[
    {
        "word": "Qadriyatlar",
        "type": [],
        "definition": [
            "subyekt, jamiyat, sinf, ijtimoiy guruhning hayot va ishning asosiy va muhim maqsadlari to'g'risidagi, shuningdek, ana shu maqsadlarga erishishning asosiy vositalari haqidagi tasawurlaridir. QAROR - bajarilishi mumkin bo'lgan ishning aniq yo'lini tanlab olishdir. Qaror boshqaruv faoliyatini oxirgi natijasidir. Agar boshqaruvda mehnat predmeti axborot bo'lsa, uning mehnat mahsuloti - boshqaruv qaroridir"
        ]
    },
    {
        "word": "Qaror Qabul Qilish",
        "type": [],
        "definition": [
            "mavjud holatning bo'lishi lozim bo'lgan holat bilan mos tushmasligi natijasida yuzaga keladi."
        ]
    },
    {
        "word": "Qarshi Harakatlanuvchi Marketing",
        "type": [],
        "definition": [
            "ilmiy-texnika progressi va atrof-muhitni muhofaza qilishga javob bermaydigan tovar va ishlab chiqarish vositalariga qarama-qarshi marketing chora-tadbirlarini tashkillashtirish."
        ]
    },
    {
        "word": "Qarzdorlik",
        "type": [],
        "definition": [
            "debitorning kreditorga bo'lgan omonatlar qimmatli qog'ozlar (aksiyalar bunga kirmaydi), debitorning qarzga olgan mablag'lari (ssudalar) va boshqa turdagi schyotlariga nisbatan bo'lgan majburiyati. Bular muayyan muddat davomida qarz shaklida baholanishi ham mumkin"
        ]
    },
    {
        "word": "Qarzga Olingan Vajalb Qilingan Mablagʻlar",
        "type": [],
        "definition": [
            "bank kreditlari; kreditorlik qarzlari; aksiya va obligatsiyalar chiqarishdan kelib tushadigan foyda."
        ]
    },
    {
        "word": "Qarz Kredit Kapitali",
        "type": [],
        "definition": [
            "bank, budjet, moliya muassasalari yoki boshqa korxonalarlan olinadigan kreditlar, chiqariladigan obligatsiyalar evaziga shakllanadi."
        ]
    },
    {
        "word": "Qarzli Moliyalashtirish",
        "type": [],
        "definition": [
            "davlat tomonidan olinayotgan qarzlar - bu davlat xarajatlarini moliyalashtirish uchun zarur bo'lgan pul mablag'larini moliya bozorlaridan qarz olish yo'li bilan mablag' jalb qilishdagi davlat faoliyatidir. Asosan, davlat qarzlari ikkita vazifani bajaradi: fiskal - davlat g'aznasiga pul mablag'larini jalb qilish va iqtisodiy rivojlantirishni rag'batlantirish"
        ]
    },
    {
        "word": "Qatʼiy (Absolyut) Stavka",
        "type": [],
        "definition": [
            "korxonalar soliqqa tortish qonunlari, belgilangan stavkalar orqali soliqqa tortiladi"
        ]
    },
    {
        "word": "Qatʼiy Va Yakuniy Shartnomaviy Narx",
        "type": [],
        "definition": [
            "bunda qurilishning butun muddatiga qabul qilingan shartnomaviy baho o'zgarmaydi Bunday baholar asosan muddati bir yildan oshmaydigan qurilish obyektlari uchun tavsiya etiladi. Ushbu narxlar tarkibida prognoz o'zgartirishlar kiritishni inobatga oluvchi pudratchi tashkilo darning riski ham hisobga olinadi."
        ]
    },
    {
        "word": "Qattiq. Majburiylik, Imperativlik",
        "type": [],
        "definition": [
            "davlat budjetining nazorat funksiyasiga tegishli bo'lgan uchinchi xususiyatdir."
        ]
    },
    {
        "word": "Qattiq, Nazorat Yoʻli",
        "type": [],
        "definition": [
            "bozor iqtisodiyotiga o'tishning muqobil yo'llaridan biri bo'lib, o'ta muhim tovarlarga davlat tomonidan qat’iy narx o'rnatiladi va nazorat qilinadi. Bu bilan ishlab chiqarish, almashuv, taqsimot qattiq nazorat ostida bo'ladi. Shu yo'l orqali qishloq xo'jaligi nisbatlari, iqtisodiy barqarorlik va ijtimoiy himoya markazdan turib boshqariladi."
        ]
    },
    {
        "word": "Qayd Etilgan Valyuta Kursi",
        "type": [],
        "definition": [
            "Markaziy bank tomonidan valyuta intervensiyasi yordamida ta’minlab turiladigan valyuta kursi."
        ]
    },
    {
        "word": "Qayd Noma",
        "type": [],
        "definition": [
            "birlamchi hujjat yoki hisob registri. Qaydnoma yig'ma hujjat bo'lishi ham mumkin. Qaydnomadan buxgalteriya hisobining hamma shakllarida ham foydalaniladi."
        ]
    },
    {
        "word": "Qayishqoq. Budjet",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyekt faoliyatining bir necha darajasini ko'zlab tuzilgan budjet"
        ]
    },
    {
        "word": "Qayta Ishlash Sanoati",
        "type": [],
        "definition": [
            "sanoat va qishloq xo'jaligi xomashyosini qayta ishlash bilan shug'ullanuvchi ishlab chiqarish sohalari; qora va rangli metallar, kimyo va neft kimyosi mahsulotlari, mashinalar va uskunalar, yog'ochsozlik va selyuloza-qog'oz sanoati buyumlari, sement va boshqa xil qurilish materiallari, yengil va oziq-ovqat sanoati mahsulotlari ishlab chiqaruvchi, sanoat mahsulotlari va hokazolarni ta’mir qiluvchi korxonalar."
        ]
    },
    {
        "word": "Qayta Ishlashga Berilgan Xomashyo Va Materiallar",
        "type": [],
        "definition": [
            "buyurtmachiga tegishlixomashyo va materiallar bo'lib, buyurtmachi ularni mahsulot ishlab chiqarish uchun boshqa shaxsga sanoat asosida qayta ishlashgaberadi hamda tuzilgan shartnomaga muvofiq mahsulot keyinchalik buyurtmachiga qaytariladi."
        ]
    },
    {
        "word": "Qayta Moliyalashtirish Siyosati",
        "type": [],
        "definition": [
            "Markaziy bank tomonidan kredit institutlarining veksellarini sotib olish shakli va qimmatbaho qog'ozlarni garovga olish yo'li bilan kreditlash tushuniladi"
        ]
    },
    {
        "word": "Qayta Sugʻurtalash",
        "type": [],
        "definition": [
            "sug'urtalashga riskni qabul qilish bilan bog'liq iqtisodiy munosabatlar tizimi (risklarni birlamchi joylashtirish); sug'urtalovchi muvozanatlashgan sug'urta portfelini yaratish va sug'urta operatsiyalarining moliyaviy barqarorligini ta’minlash maqsadida qabul qilib olingan riskning bir qismini o'zaro kelishilgan holda boshqa sug'urtalovchigaberishi (riskni ikkilamchi joylashtirish). Qayta sug'urtalash operatsiyalarini sug'urta kompaniyalar bilan bir qatorda, asosan, ixtisoslashgan qayta sug'urtalash kompaniyalari amalga oshiradi. Qayta sug'urtalash aktiv (riskni berish) va passiv (riskni qabul qilib olish) ko'rinishida bo'ladi."
        ]
    },
    {
        "word": "Qayta Sugʻurtalovchi",
        "type": [],
        "definition": [
            "sug'urta brokeri yordamida qayta sug'urtalash uchun riskni qabul qilib oladigan jismoniy yoki yuridik shaxs. Qayta sug'urtalovchi yordamida riskni ikkilamchi taqsimlash amalga oshiriladi. Qayta sug'urtalovchi sifatida sug'urta kompaniyasi ham bo'lishi mumkin. Jahondagi eng yirik qayta sug'urtalovchilar guruhiga Myunxen qayta sug'urtalash jamiyati, Shveytsariya qayta sug'urtalash jamiyati, Kyoln qayta sug'urtalash jamiyatlari kiradi."
        ]
    },
    {
        "word": "Qayta Sugʻurtalovchi Broker",
        "type": [],
        "definition": [
            "ikkita sug'urta kompaniyasi o'rtasidagi professional vositachi."
        ]
    },
    {
        "word": "Qayta Tayinl An Gan Auditorlik Tashkiloti",
        "type": [],
        "definition": [
            "mazkur xo'jalik subyekti buxgalteriya hisobotini o'z amaliyotida ilk bor audit qilayotgan auditorlik tashkilotidir. Bundan mazkur buxgalteriya hisobotini oldin audit qilinganmi yoki yo'qmi hamda mazkur auditorlik tashkiloti ushbu xo'jalik subyektiga oldin ham ko'rsatganligi ahamiyatga ega bo'lmaydi."
        ]
    },
    {
        "word": "Qayta Tiklanadi Gan Zaxiralar",
        "type": [],
        "definition": [
            "to'liq ishlov berish natijasida tiklanadigan xomashyo va materiallar."
        ]
    },
    {
        "word": "Qayta Tiklash -",
        "type": [],
        "definition": [
            "mavjud ishlab chiqarishni texnik takomillashtirish, asosiy fondlarni kompleks ravishda yangilash va zamonaviylashtirish asosida to'liq qayta qurish jarayoni"
        ]
    },
    {
        "word": "Qaytariladigan Chiqindilar",
        "type": [],
        "definition": [
            "korxonaning asosiy va yordamchi sexlarida foydalanish yoki sotish mumkin bo'lgan chiqindilarga aytiladi."
        ]
    },
    {
        "word": "Qaytarilmaydigan Sarflar",
        "type": [],
        "definition": [
            "ilgari qabul qilingan qarorlaming natijasida sodir bo'lgan oldingi davr xarajatlari."
        ]
    },
    {
        "word": "Qaytarilmaydigan Xarajatlar",
        "type": [],
        "definition": [
            "boshqaruv qarorlari orqali tasir qilish mumkin bo'lmagan xarajatlar"
        ]
    },
    {
        "word": "Qimmat Pullar Siyosati",
        "type": [],
        "definition": [
            "mamlakatdagi pul miqdorini cheklash yoki qisqartirishga qaratilgan hukumat siyosati. Bu siyosat mamlakatda inflyatsiya kuchayganda olib boriladi. Qimmat pullar siyosati kreditni qimmatlashtirib, uni olishni qiyinlashtiradi Pulni, taklifni kamaytirish uchun ochiq bozorda davlat qimmatli qog'ozlari sotiladi, banklarning rezerv me’yori va hisob stavkasining kotarilishiga, pirovard natijada investitsiyalarning kamayishiga inflyatsiyani cheklashga imkon beradi."
        ]
    },
    {
        "word": "Qimmatbaho (Qimmatli) Qogʻozlar",
        "type": [],
        "definition": [
            "egalariga daromad keltiradigan hamda turli aktivlarga (sertifikat, aksiya, obligatsiya va boshqa) bo'Igan huquqni tasdiqlovchi hujjat. Qimmatbaho qog'oz aniq, real kapitalni qog'ozda ifodalaydi. Qimmatbaho qog'ozlarning quyidagi turlari mavjud: veksel, chek, aksiya, obligatsiya, sertifikat, turli muassasa, tashkilot va idoralarning (bank, xayriya va ishonch fondlari) qonunda ko'zda tutilgan hollarda mablag' bilan ta’minlaydigan ishonch qog'ozlari"
        ]
    },
    {
        "word": "Qimmatbaho Tovarlar",
        "type": [],
        "definition": [
            "yuksak qiymatli tovarlar. Bu tovarlar asosan ishlab chiqarish yoki iste’mol maqsadida ishlatilmaydi, ammo ulardan qiymatni uzoq vaqt saqlash vosita sifatida foydalaniladi, chunki ularning qiymati narxlarning umumiy darajasiga nisbatan kamaymasligi mumkin."
        ]
    },
    {
        "word": "Qimmatli Qoʻgʻozlarning Ikkilamchi Bozori",
        "type": [],
        "definition": [
            "dastlabki kreditor va zayomchilar bo'lmagan shaxslar o'rtasidagi qimmatli qo'g'ozlar muomalasi; ikkilamchi savdo banklar va maxsus firmalar tomonidan qo'llab-quwatlanadi"
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Bozori",
        "type": [],
        "definition": [
            "daromad keltiruvchi qimmatbaho qog'ozlar - aksiya, obligatsiya, veksel, chekva h.koldi-sotdi qilishdir. Qimmatbaho qog'ozlar bozori amalda fond birjalari, auksionlar va banklardan iborat bo'ladi. Qimmatbaho qog'ozlar savdosida maklerbrokerlar vositachilik qiladilar. Qimmatbaho qog'ozlar bozori milliy va jahon bozoridan iborat. Nyu-York fond birjasi amalda xalqaro qimmatli qog'ozlar bozoridan iborat. O'zbekistonda ham qimmatli qog'ozlar bozori shakllanib bormoqda."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Bozori Ishtirokchilari",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarning emitentlari, qimmatli qog'ozlarning egalari, investorlar, qimmatli qog'ozlar bozorining professional ishtirokchilari, shuningdek, bir j alar va qimmatli qog'ozlar markaziy depozitariysi."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Bozori Professional Ishtirokchisining Mijozi (Mijoz)",
        "type": [],
        "definition": [
            "deponent yoki qimmatli qog'ozlar bozori professional ishtirokchisining xizmatlaridan foydalanuvchi boshqa shaxs"
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Bozorida Professional Faoliyat",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarni chiqarish, joylashtirish va ularning muomalasi bilan bog'liq xizmatlar ko'rsatish bo'yicha litsenziyalanadigan faoliyat turi."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Bozorining Professional Ishtirokchisi",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar bozorida professional faoliyatni amalga oshiruvchi yuridik shaxs"
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Davlat Obligatsiyalari",
        "type": [],
        "definition": [
            "moliya vazirligi tomonidan ma’lum bir muddatga chiqariladi va belgilangan marja to'lash sharti bilan qaytib sotib olinadi."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Egalarining Reestri",
        "type": [],
        "definition": [
            "ro'yxatdan o'tkazilgan qimmatli qog'ozlar egalarining belgilangan sanadagi holatga ko'ra shakllantirilgan, ularga qarashli egasining nomi yozilgan qimmatli qog'ozlar emitentining nomi, ushbu qimmatli qog'ozlarning soni, nominal qiymati, turi va xili, shuningdek, reestrda ro'yxatdan o'tkazilgan shaxslarga axborot yuborish imkoniyatini beradigan ma’lumotlar ko'rsatilgan ro'yxati"
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Egasi",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar o'ziga mulk huquqi yoki boshqa ashyoviy huquq asosida tegishli bo' lgan yuridik yoki jismoniy shaxs."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Emissiyasi",
        "type": [],
        "definition": [
            "emissiyaviy qimmatli qog'ozlarni chiqarish va joylashtirish."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Hosilalari",
        "type": [],
        "definition": [
            "foydasi yoki zarari bir necha bozor ko'rsatkichlari, ya’ni bozor indekslari bilan bog'liqdir."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Komissiyasi",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar mijozdan o'z mablag'lari hisobiga sotib olish yoki o'z portfelidan qimmatli qog'ozlarni sotishdir"
        ]
    },
    {
        "word": "Qimmatli Qogʻozlar Markaziy Depozitariysi",
        "type": [],
        "definition": [
            "depo hisob-varaqlari bo'yicha emissiyaviy qimmatli qog'ozlarni saqlashning, bunday qimmatli qog'ozlarga bo'lgan huquqlami hisobga olishning va emissiyaviy qimmatli qog'ozlar harakatining yagona tizimini ta’minlovchi davlat depozitariysi."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarga Doir Bitimlar",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarning oldi-sotdisi, hadyasi, merosi, ustav fondiga kiritilishi va qimmatli qog'ozlar egasining almashuviga olib keladigan boshqa harakatlar, shuningdek, qimmatli qog'ozlar garovi."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarga Doir Fyuchers",
        "type": [],
        "definition": [
            "qimmatli qog'oz bo'lib, u o'zida nazarda tutilgan muddatda qimmatli qog'ozlarning muayyan sonini qat’iy belgilangan narxda sotib olish yoki sotish majburiyatini tasdiqdaydi. "
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarni Chiqarish",
        "type": [],
        "definition": [
            "yuridik shaxsning fuqarolik huquqlarining obyekti sifatida qimmatli qog'ozlar paydo bo'lishiga qaratilgan harakadari"
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarni Joylashtirish",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarni ularning dastlabki egalariga berish."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarni Keltirib Chiqaruvchilar",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarni keltirib chiqaruvchilar sifatida asos deb aytiladigan ba’zi real yoki moliyaviy aktivlar bo'yicha tuziladigan kelishuvlar, huquqlar va majburiyatlar qabul qilingan."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarni Nominal Saqlovchi",
        "type": [],
        "definition": [
            "qimmatli qog'ozlar egasining yoki u vakil qilgan shaxsning topshirig'iga ko'ra qimmatli qog'ozlarni hisobga olishni va ularga bo'Igan huquqlarni tasdiqlashni qimmatli qog'ozlarning egasi bo'lmagan holda amalga oshiruvchi investitsiya vositachisi, qimmatli qog'ozlar markaziy depozitariysi."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarning Emissiya Risolasi",
        "type": [],
        "definition": [
            "emitent va u chiqaradigan qimmatli qog'ozlar to'g'risidagi ma’lumotlarni, shuningdek, investorning qimmatli qog'ozlar olish to'g'risidagi qaroriga ta’sir ko'rsatishi mumkin bo'Igan boshqa axborotni aks etgiruvchi hujjat"
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarning Hosilalari",
        "type": [],
        "definition": [
            "o'z egalarining boshqa qimmatli qog'ozlarga nisbatan huquqlarini yoki majburiyatlarini tasdiqlovchi va yuridik shaxslar tomonidan emitentning opsionlari, qimmatli qog'ozlarga doir fyucherslar va boshqa moliyaviy vositalar tarzida chiqariladigan qimmatli qog'ozlar."
        ]
    },
    {
        "word": "Qimmatli Qogʻozlarning Muomalasi",
        "type": [],
        "definition": [
            "qimmatli qog'ozlarni sotib olish va sotish, shuningdek, qonun hujjatlarida nazarda tutilgan, qimmatli qog'ozlarning egasi almashuviga olib keladigan boshqa harakatlar."
        ]
    },
    {
        "word": "Qishloq. Ijtimoiy Infratuzilmasi",
        "type": [],
        "definition": [
            "odamlar turmush faoliyatining umumiy sharoitlarini ta’minlaydigan sohalar."
        ]
    },
    {
        "word": "Qishloq. Qurilish Bank Aksiyadorlik Tijorat Banki",
        "type": [],
        "definition": [
            "qishloq qiyofasini va qishloq aholisining uy-joy sharoitlarini sifatli yaxshilash, qishloq joylarda ishlab chiqarish va ijtimoiy infratuzilmani jadal rivojlantirish, uy-joy qurilishini uzoq muddatli imtiyozli kreditlash tizimini keng joriy etish maqsadida hamda “Qishloq taraqqiyoti va farovonligi yili” Davlat dasturiga muvofiq 2009-yil 30 martda O'zbekiston Respublikasi Prezidentining Qishloq qurilish bank” aksiyadorlik tijorat a bankini tashkil etish to'g'risida’ gi qaroriga muvofiq “G'alla-bank” aksiyadorlik tijorat banki negizida tashkil etilgan. “Qishloq qurilish bank” aksiyadorlik tijorat bankining ustav kapitali 150 milliard so'm miqdorida shakllantirilgan."
        ]
    },
    {
        "word": "Qishloq. Qurilish Invest - Ixtisoslashtirilgan Sho Ba Injiniringkompaniyasi",
        "type": [],
        "definition": [
            "Qishloqtaraqqiyotivafarovonligi yili” Davlat dasturini ijro etish hamda aholipunktlariningbosh rejalar va arxitekturaviy rejalashtirishni tashkil etish loyihalariga muvofiq tasdiqlangan namunaviy loyihalar bo'yicha yakka tartibdagi uy-joy qurilishi ko'lamini kengaytirish asosida qishloq aholisining turarjoy sharoitlarini tubdan yaxshilash maqsadida 2009-yil 3 avgustdagi O'zbekiston Respublikasi Prezidentining “Qishloq joylarda uy-joy qurilishi ko'lamini kengaytirishga oid qo'shimcha chora-tadbirlar to'g'risida’ gi Qaroriga muvofiq tashkil etilgan"
        ]
    },
    {
        "word": "Qishloq, Xoʻjaligi Ishlab Chiqarish Tarmoqlari",
        "type": [],
        "definition": [
            "qishloq xo'jaligi uchun ishlab chiqarish vositalarini ishlab chiqaruvchi va uning moddiy texnika ta’minoti hamda xizmat ko'rsatish tarmoqlari."
        ]
    },
    {
        "word": "Qishloq, Xoʻjalik Kooperativi (Shirkat Xoʻjaligi)",
        "type": [],
        "definition": [
            "tovar qishloqxo'jalikmahsulotiyetishtirishuchunpayusulgavaasosanoila (jamoa) pudratiga, fuqarolarning ixtiyoriy ravishda birlashishiga, boshqarishning umumiyligiga, yuridik shaxs huquqiga asoslangan mustaqil xo'jalik yurituvchi subyekt."
        ]
    },
    {
        "word": "Qishloq, Xoʻjalik Tovar Ishlab Chiqaruvchilarning Yagona Yer Soligʻi -",
        "type": [],
        "definition": [
            "yagona yer solig'ini to'lovchilar bo'lib, qishloq xo'jaligi kooperativlari (shirkatlar), fermer xo'jaliklari, agrofirmalar, boshqa qishloq xo'jalik mahsulotlarini ishlab chiqaruvchilar hisoblanadi. Bu korxonalar o'z xohishlari bo'yicha budjetga, yoki yagona yer solig'i to'lovchilar, yoki qishloq xo'jalik korxonalari uchun belgilangan yagona soliq to'lovchilari bo'lishi mumkin."
        ]
    },
    {
        "word": "Qisman Konvertirlangan Valyuta",
        "type": [],
        "definition": [
            "faqat ma’lum to'lov muomalasi uchun ishlatiladigan va boshqa valyutaga cheklangan tarzda almashadigan valyuta"
        ]
    },
    {
        "word": "Qisman Taʼminlangan Kreditlar",
        "type": [],
        "definition": [
            "“yaxshi ta’minlanmagan kreditlar” mezoniga muvofiq kelmaydigan ta’minotga ega kreditdir."
        ]
    },
    {
        "word": "Qisqa Muddatga Xizmat Qiladigan Tovarlar",
        "type": [],
        "definition": [
            "bir zumda yoki juda qisqa vaqt ichida iste’mol qilinadigan tovarlar."
        ]
    },
    {
        "word": "Qisqa Muddatli Ijara",
        "type": [],
        "definition": [
            "ijaraga beruvchi ijarachiga haq evaziga mol mulkni 12 oydan kam muddatga egalik qilish va foydalanish yoki foydalanish huquqini beradigan kelishuv."
        ]
    },
    {
        "word": "Qisqa Muddatli Kreditlar",
        "type": [],
        "definition": [
            "qaytarish muddati bir yildan oshmaydigan qarzlar."
        ]
    },
    {
        "word": "Qisqa Muddatli Likvidlilik",
        "type": [],
        "definition": [
            "bankning so'ngdirish muddati 30 kundan 1 yilgacha bo'Igan aktivlar bilan 30 kundan 1 yilgacha qabul qilingan depozitlar va resurslarga nisbati tushuniladi."
        ]
    },
    {
        "word": "Qiymat",
        "type": [],
        "definition": [
            "tovarda gavdalangan ijtimoiy mehnat. Qiymatga asoslanib, tovarlar o'lchovdosh hisoblanadi va bir-biriga ayirboshlanadi. Bozorda, awalo, ikki inson - sotuvchi va xaridor munosabatga kirganlari uchun tovarlar sotiladi va sotib olinadi. Shuning uchun tovar o'zida insonlar o'rtasidagi iqtisodiy munosabatlarni gavdalantiradi. Qiymat tovarning xossasi hisoblanadi."
        ]
    },
    {
        "word": "Qiymat Qoʻshadigan Xizmatlar",
        "type": [],
        "definition": [
            "korxonani uning bozordagi raqiblaridan ajratib turadigan va ushbu korxonani mijozlari bilan bo'Igan munosabatlarini yaxshilashga yo'naltirilgan xizmatlardir"
        ]
    },
    {
        "word": "Qiymatni Loyihalashtirish",
        "type": [],
        "definition": [
            "mahsulot va jarayonlarning tannarxini kamaytirgan holda yaxshilangan faoliyat yurutish bilan ta’minlash hisobiga soddalashtirishga mo'ljallangan jarayondir"
        ]
    },
    {
        "word": "Qiymat Qonuni",
        "type": [],
        "definition": [
            "tovar ishlab chiqarish sharoitida ishlab chiqaruvchilar o'rtasidagi aloqalarni, ijtimoiy mehnatni taqsimlash va rag'batlantirishni tartibga soluvchi obyektiv iqtisodiy qonundir. Unga binoan tovar ishlab chiqarish va ayirboshlash ularning qiymati asosida amalga oshiriladi. Bu qiymatning miqdori ijtimoiy-zaruriy mehnat sarflari bilan o'lchanadi. Ijtimoiy degan ibora, awalo, shuni bildiradiki tovar qiymatining miqdori yoki bu ishlab chiqarishning o'ziga alohida qilgan mehnat sarflari bilan emas, balki ijtimoiyzaruriy mehnat sarflari (IZMS) bilan o'lchanadi. IZMS ishlab chiqarishning mavjud ijtimoiy normal sharoitida va shu jamiyatda mehnat mahoratining va intensivligining o'rtacha darajada, biroq iste’mol qiymatini ishlab, tayyorlash uchun talab qilinadigan ish vaqti mehnati sarflaridir. Qiymat qonuni bozor iqtisodiyotiga xos bo'Igan asosiy iqtisodiy qonunlardan biridir. Bozor iqtisodiyotining eng asosiy talabi shuki, ishlab chiqaruvchi kam mehnat sarflab, ko'p va sifatli tovar ishlab chiqargandagina, ya’ni kishilarning talab va ehtiyojlarini to'liq qondirgandagina foyda ko’rib ishlashi mumkin, aks holda u sinadi. Qiymat qonuni uchta muhim vazifalarni bajaradi: l) ijtimoiy mehnatni hisobga olish va tartibga solish; 2) vaqtni tejashni rag'batlantirish; 3) tovar ishlab chiqaruvchilarni tabaqalashtirish."
        ]
    },
    {
        "word": "Qiziqish",
        "type": [],
        "definition": [
            "shaxsning u yoki bu narsaga qaratilgan bilish ehtiyojining namoyon etishi shakli bo'lib, bu narsa ijobiy his-tuyg'u uyg'otishi mumkin (musiqaga, texnikaga va h.k.)"
        ]
    },
    {
        "word": "Qo ʼL Ostidagilarga Eʼtibor",
        "type": [],
        "definition": [
            "ishchilarga g amho'rlik qilish, ularni samarali mehnat qilishga undash, ishlab chiqarishni yo'lga qo'yish kabi boshqaruvning asosiy vazifalaridan biridir. Boshqaruvchini ishchilarga nisbatan “ochiq eshiklar” siyosatini olib borishi korxona yuksalishining garovidir."
        ]
    },
    {
        "word": "Qoʻshilgan Qiymat",
        "type": [],
        "definition": [
            "birlik tomonidan yangitdan yaratilgan qiymatdir. U iqtisodiy ishlab chiqarishning o'lchovidir. Uni ikki xil usulda - yalpi yoki sof usulda hisoblash mumkin. Yalpi mahsulot tarkibida asosiy kapitalning qiymati o'tirgan bo'lsa hisoblangan qo'shilgan qiymat yalpi qo'shilgan qiymat deyiladi. Yalpi mahsulot tarkibida asosiy kapitalning qiymati o'tirmagan bo'lsa, hisoblangan qo'shilgan qiymat - sof qo'shilgan qiymat deyiladi. Sof qo'shilgan qiymat iqtisodiy ishlab chiqarishning aniq o'lchovidi"
        ]
    },
    {
        "word": "Qoʻshilgan Qiymat Soligʻi",
        "type": [],
        "definition": [
            "ishlab chiqarish va muomala jarayonlarining barcha bosqichlarida yaratilgan qo'shilgan qiymat bir qismining budjetga olish shakli. Egri (bilvosita) soliqlarning tarkibiga kiradi. Mahsulot (ish, xizmat)larni realizatsiya va import qilish oboroti qo'shilgan qiymat solig'i solinadigan obyekt hisoblanadi. Realizatsiya bo'yicha soliq solinadigan oborot realizatsiya qilinadigan mahsulotlar (ishlar, xizmatlar) qiymati asosida, qo'llaniladigan narxlar va tariflarni inobatga olgan holda, aksiz solig'ini hisobga olib, ularga qo'shilgan qiymat solig'ini kiritmasdan belgilanadi. Bu soliqni to'lovchilar qatoriga mulkchilik shakli va kimga tegishli ekanligidan qat’iy nazar ishlab chiqarish va tijoriy faoliyat bilan shug'ullanuvchi yuridik shaxslar (xorijiy investitsiyali korxonalar ham) kiradi"
        ]
    },
    {
        "word": "Qoʻshilgan Qiymat Soligʻi (Qqs) Ustiga Qoʻshiladigan Soliq",
        "type": [],
        "definition": [
            "ishlab chiqaruvchi o'z savdosidan to'lashi shart bo'lgan soliq. Bu soliq schyot-fakturada alohida ko'rsatiladi va uni ishlab chiqaruvchi sotib oluvchiga beradi."
        ]
    },
    {
        "word": "Qoʻshilgan Qiymat Soligʻidan Imtiyozlar",
        "type": [],
        "definition": [
            "korxonaning iste’molchilarga tovar ortganda, ish bajarganda, xizmat sotganda QQSnihisoblamaslikhamdabudjetga soliq to'lamaslikni ifodalaydi. QO'SHIMCHA ISH HAQI - ishchi va xizmatchilarning ishlamagan vaqti uchun amaldagi qonun-qoidalarga muvofiq to'lanadigan haq. Masalan, mehnat ta’tili uchun, yoshi 18 ga yetmagan o'smirlarning ishlamagan soati uchun, davlat, jamoa ishlari bilan band bo'lgani uchun to‘lanadigan haq va boshqalar."
        ]
    },
    {
        "word": "Qoʻshimcha Mahsulot",
        "type": [],
        "definition": [
            "ishchi va xizmatchilaming qo'shimcha ish vaqtida yaratilgan va ishchi kuchini me’yoriy holda saqlash va qayta tiklash uchun zarur bo'Igan mahsulotning ortiqcha qismiga aytiladi. Qo'shimcha mahsulotni ishlab chiqarish uchun sarf etilgan vaqt A qo'shimcha ish vaqti, mehnat esa qo'shimcha sarf etilgan mehnat deb ataladi. Qo'shimcha mahsulot ishlab chiqarish tarixiytaraqqiyotning asosi bo'lib, kengaytirilgan takror ishlab chiqarishning va jamiyat a’zolarini ijtimoiy himoyalashning asosiy manbai hisoblanadi. Turli mulkchilikka asoslangan ishlab chiqarishning maqsadi nafaqat zaruriy mahsulotni, balki qo'shimcha mahsulotni ishlab chiqarish hisoblanadi. Chunki u ishlab chiqarish samaradorligini ifodalaydi. Qo'shimcha mahsulotning miqdori yangi ishlab chiqarilgan mahsulot miqdoriga va uni zaruriy qo'shimcha mahsulotlarga bo'linish nisbatiga bog'liq. Mehnat unumdorligining o'sishi bu nisbatning o'zgarib borishiga, ishchining yashash darajasiga salbiy ta’sir etmagan holda amalga oshadi."
        ]
    },
    {
        "word": "Qoʻshimcha Masʼuliyati В Оʼlg An Uyushma",
        "type": [],
        "definition": [
            "uyushma; hamkorlar javobgarligi pay (badal) miqdori bilan cheklanmagan, xususiy mulkni qisman xolida yoki to'laligicha yoritadigan yopiq aksioner jamiyat."
        ]
    },
    {
        "word": "Qoʻshimcha Qiymat Shakllanish Vaqti",
        "type": [],
        "definition": [
            "mos mahsulot ustida olib borilgan foydali ish bajarilishining taktik vaqti"
        ]
    },
    {
        "word": "Qoʻshimcha Xarajat",
        "type": [],
        "definition": [
            "qo'shimcha mahsulot ishlab chiqarish uchun sarf qilingan xarajatlardir."
        ]
    },
    {
        "word": "Qoʻshma Kapital",
        "type": [],
        "definition": [
            "tezda jalb etilgan resurslar bo'lib, u asosan aksiyalarni sotish, pay va kirish badallarini to'plash, korxonalarni birlashtirish natijasida aktivlarning ko'payishi evaziga shakllanadi."
        ]
    },
    {
        "word": "Qoʻshma Korxonalar",
        "type": [],
        "definition": [
            "aralash mulkka asoslangan va har xil mamlakatlardan ta’sis etuvchilar kelishuviga binoan shartnoma asosida tashkil etilgan korxona. O'zbekiston tarafidan davlat korxonalari va tashkilotlari, jamoa korxonalari, aksionerlik jamiyatlari, ijtimoiy tashkilotlar, istiqbolda esa ayrim fuqarolar ham bo'lishi mumkin. Qo'shma korxonalarni tashkil etishdan O'zbekistonlik ishtirokchilarning manfaatlari quyidagicha: ustav fondidagi ulushiga binoan foyda olish va u mustaqil ravishda korxona fondlariga yo'naltirilishi mumkin; progressiv texnika va texnologiyaga, ishlab chiqarishni tashkil etish va boshqarishning yangi shakllaridan foydalanishga imkon beradi, marketingni yaxshilash, reklama va mahsulotni sotish imkoniyatlarining kengayishi; ichki bozorni tovarlar bilan to'ldirish; chet ellik ishtirokchining manfaatlari uchun arzon ish kuchi mavjudligi; kapitalni samaraliroq ishlatish, sotish bozorining sezilarli darajada kengligi. Qo'shma korxonani barpo qilishda va uning faoliyatini ta’minlashda O'zbekiston Respublikasida chet el investitsiyalari to'g'risida” O'zbekiston Respublikasidagi korxonalar to'g'risida”, “Korxonalar, birlashmalar va tashkilotlardan olinadigan soliqlar to'g’risida’ gi va ularga tegishli normativhujjatlar asos bo'lib xizmat qiladi."
        ]
    },
    {
        "word": "Qobiliyat",
        "type": [],
        "definition": [
            "xodimda o'ziga yuklangan vazifalami baj arish uchun kasb malakasi mavjudligi, yetarli darajadagi jismoniy kuch-quwat va chidamlilik, uquvlilik; umumiy madaniyat borligi va shu kabilardir."
        ]
    },
    {
        "word": "Qoldiq, (Balans) Qiymat",
        "type": [],
        "definition": [
            "nomoddiy aktiv moliyaviy hisobot (buxgalteriya balansi)da aks ettiriladigan, boshlang'ich (tiklash) qiymati va jamlangan amortizatsiya summasi o'rtasidagi farq sifatida aniqlanadigan miqdor;"
        ]
    },
    {
        "word": "Qondirilgan Ehtiyoj",
        "type": [],
        "definition": [
            "ma’lum paytda ehtiyojning narsalar bilan qondirilgan, haqiqatan ta’minlangan qismi."
        ]
    },
    {
        "word": "Qondirilgan Talab",
        "type": [],
        "definition": [
            "ma’lum davrda tovarlar sotib olish uchun mo'ljallangan mablag'ni sarf qilib, kerakli tovarlarning sotib olinishi."
        ]
    },
    {
        "word": "Qondirilmagan Talab",
        "type": [],
        "definition": [
            "iste’molchi talab-istaklariga mos keladigan tovar tanlab olish imkoniyatibo'lmasligi tufayli olishga mo'ljallangan mablag'ning sarf bo'lmay qolishi."
        ]
    },
    {
        "word": "Qonun",
        "type": [],
        "definition": [
            "l) obyektiv borliqda turli hodisalar o'rtasida, kishi ongidan va ixtiyoridan tashqarida doimiy bo'lgan zaruriy ichki, muhim, takrorlanadigan bog'lanish, munosabat; 2) davlat hokimiyati tomonidan qabul qilingan, hamma uchun majburiy bo'lgan ijtimoiyhuquqiy norma va munosabatlarni belgilovchi rasmiy qoida; 3) bajarilishi shart, majburiy bo'lgan, norma, qoida tusiga kirgan talab, topshiriq va shu kabilar."
        ]
    },
    {
        "word": "Qpnuniyatlar",
        "type": [],
        "definition": [
            "barqaror, mustahkam, ko'p marta takrorlanadigan hodisalar va jarayonlarbo'lib, ulargaxos ichki, muhim zaruriy, sabab-oqibatlar, doimiy, umumiy, o'zaro sifat va miqdor aloqalarini ifodalaydi"
        ]
    },
    {
        "word": "Qoplashning Ichki Koeffitsiyenti",
        "type": [],
        "definition": [
            "kapital qo'yilmaning sof keltirgan qiymati nolga teng bo'lgan holatidagi foiz darajasi (diskonti). Ushbu koeffitsiyent izlanish vaxatolar usulida aniqlanadi, uning taxminiy miqdori statistika jadvali ko'rinishida keltirilishi mumkin"
        ]
    },
    {
        "word": "Qoplashning Ichki Koeffitsiyenti",
        "type": [],
        "definition": [
            "kapital qo'yilmaning sof keltirgan qiymati nolga teng bo'lgan holatidagi foiz darajasi (diskonti). Ushbu koeffitsiyent izlanish va xatolar usulida aniqlanadi, uning taxminiy miqdori statistika jadvali ko'rinishida keltirilishi mumkin."
        ]
    },
    {
        "word": "Qoraqalpogʻiston Respublikasining Budjeti",
        "type": [],
        "definition": [
            "Davlat budjetining Qoraqalpog'iston Respublikasi pul mablag'lari fondini tashkil etuvchi bir qismi bo'lib, budjetda daromadlar manbalari va ulardan tushumlar miqdori, shuningdek, moliya yili mobaynida aniq maqsadlar uchun ajratiladigan mablag'lar sarfi yo'nalishlari va miqdori nazarda tutiladi."
        ]
    },
    {
        "word": "Qqs Toʻlovchilari",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasi hududida tadbirkorlik faoliyati bilan shug'ullanuvchi yuridik shaxslar tovarlar importi bo'yicha yuridik va jismoniy shaxslar hisoblanadi"
        ]
    },
    {
        "word": "Quvvatlangan Tovar",
        "type": [],
        "definition": [
            "real, aniq tovarni ishlatish uchun zarur bo'ladigan boshqa tovarlar, ehtiyot qismlar, xizmatlar bilan birgalikdagi ko'rinishi."
        ]
    },
    {
        "word": "Quwatlantiruvchi Marketing",
        "type": [],
        "definition": [
            "talabning pasayishini to'xtatish maqsadida qo'llash vaziyatlarini saqlab qolish uchun tegishli choralami amalga oshirish."
        ]
    },
    {
        "word": "Qatʼiy Va Yakuniy Shartnomavty Narx",
        "type": [],
        "definition": [
            "bunda qurilishning butun muddatiga qabul qilingan shartnomaviy baho o'zgarmaydi. Bunday baholar asosan muddati bir yildan oshmaydigan qurilish obyektlari uchun tavsiya etiladi. Ushbu narxlar tarkibida prognoz o'zgartirishlar kiritishni inobatga oluvchi pudratchi tashkilotlarning riski ham hisobga olinadi."
        ]
    },
    {
        "word": "Qonun Ustuvorligi",
        "type": [],
        "definition": [
            "ushbu tamoyilning mazmuni shuni anglatadiki, qonun ijtimoiy hayotning barcha sohalarida qat’iy hukmron bo'ladi. Ya’ni hech kim, hech bir davlat organi, mansabdor shaxs, tadbirkor yoki boshqa bir fuqaro qonunga bo'ysunmasligi mumkin emas, ijtimoiy, iqtisodiy va siyosiy munosabatlar faqat qonun bilan tartibga solinadi; uning barcha ishtirokchilari esa, hech bir istisnosiz, huquq normalarini buzganligi uchun javobgarlikka tortilishi kerak. Huquqiy normalarni tatbiq etishda konstitutsiya va qonunlarning normalari boshqa huquqiy normalardan ustun turadi."
        ]
    },
    {
        "word": "Qonunchilik",
        "type": [],
        "definition": [
            "l) davlat tomonidan o'z funksiyalarini amalga oshirishning asosiy usullaridan biri bo'lib, davlat hukumati organlari tomonidan qonunlar chiqarishda ifodalanadi; 2) ijtimoiy munosabatlarni to'la tartibga soluvchi huquqiy normalar yig'indisi yoki ijtimoiy munosabatlarning bir ko'rinishi."
        ]
    },
    {
        "word": "Qonunchilik Palatasi",
        "type": [],
        "definition": [
            "O'zbekiston Respublikasi Oliy Majlisining quyi palatasi. Qonunchilik palatasi saylov okruglari bo'yicha ko'ppartiyaviylik asosida saylanadigan bir yuz ellikta deputatdan iborat. Qonunchilik palatasining ishi palata barcha deputatlarining professional, doimiy faoliyat ko'rsatishiga asoslanadi"
        ]
    }
]