[
    {
        "word": "Ragʻbatlantirish",
        "type": [],
        "definition": [
            "tashkilot oldida turgan masalani yechishda kishining urinishi, harakati, matonati va halolligiga maqsadli yondashish."
        ]
    },
    {
        "word": "Ragʻbatlantiruvchi Marketing",
        "type": [],
        "definition": [
            "iste’molchilarning e’tiboridan qolgan tovarlarga talabni faollashtirish."
        ]
    },
    {
        "word": "Rahbarlar",
        "type": [],
        "definition": [
            "jamoaga boshchilik qiluvchi, butun boshqaruv apparati va uning alohida bo‘g‘inlari ishini yo'naltiruvchi vazifalar va maqsadlarga erishish bo'yicha jamoa faoliyatini tartibga soluvchi va nazorat qiluvchi hodimlar. Rahbarlar chiziqli va funksional turlarga bo'linadi. Chiziqli rahbarlar - tashkilotning yoki uning alohida tashkiliy rasmiylashtirilgan qismi holati va rivojlanishi uchun mas’ul, hamjihatlik asosida harakat qiluvchi shaxslar. Funksional rahbarlarga - boshqaruv tizimida ma’lum funksional ish qismi uchun mas’ul va boshqaruvning aniq funksiyalarini amalga oshiruvchi bo' linmalarga boshchilik qiluvchi shaxslar kiradi. Rahbarlar shuningdekb о shqaruv darajalari bo'yicha ham tasniflanadi. Masalan, chiziqli rahbarlar bo'lib, quyi (sexlar, uchastkalar boshliqlari, masterlar), o'rta (korpuslar boshliqlari, korxonalar direktorlari, uyushmalarning bosh mutaxassislari) va yuqori (vazirlar, qo'mitalar raislari) bo'g'inlar rahbarlari hisoblanadi."
        ]
    },
    {
        "word": "Rahbarning Oʻzini O ʼZi Boshqarishi",
        "type": [],
        "definition": [
            "rahbar tomonidan kunlik amaliyotda ishning sinalgan usullaridan izchil va maqsadga qaratilgan holda foydalanilishi, uning o'zini o‘zi rivojlantirishi"
        ]
    },
    {
        "word": "Rambursli Kredit",
        "type": [],
        "definition": [
            "akkreditivni akseptli kredit bilan uyg‘unlashuvidir"
        ]
    },
    {
        "word": "Raqobat",
        "type": [],
        "definition": [
            "1) basma-baslikka bellashuv 2) biror-bir sohada eng yuqori natijaga erishish borasida olib borilgan kurash; 3) yuqori foyda olish maqsadida mahsulotni ishlab chiqarish va sotish uchun ishlab chiqaruvchilar o'rtasidagi kurash; xo'jalik yurituvchi shaxslarning bozorda o'z mahsulotini aynan shunday mahsulotlar sotish shartlariga ta’sir qilish maqsadidagi bellashuvi. Raqobat ikki ko'rinishda: a) tarmoqlararo; b) tarmoqichidabo'ladi. Tarmoqlararo raqobat - turli yo'nalishlarda mahsulot ishlab chiqaruvchilarning kapitalini eng qulay joylashtirish, ko'p foyda olish uchun olib borgan kurashi. Tarmoq ichidagi raqobat - bir xil ko'rinishda mahsulot ishlab chiqaruvchilarning bozor uchun, mahsulotni foydali, qulay sotish uchun olib borgan kurashi. Halol raqobat - bozordagi kurashda qabul qilingan qonun-qoida, hammaga ma’qul usullarga asoslanadi. G'irrom raqobat o'z ichiga quyidagi xarakterli belgilarni oladi: 1) raqib haqida noto‘g‘ri va noaniq ma’lumotlar tarqatish; 2) mahsulotning sifati, ishlab chiqarilgan joyi xususida iste’molchini aldash, uni adashtirish; 3) raqibning mahsulot belgisidan, nomidan noto'g'ri foydalanish; 4) past sifatli mahsulotlarni reklama qilish; 5) raqib mahsulotining sifati to'g'risida asossiz ma’lumot tarqatish va h.k."
        ]
    },
    {
        "word": "Raqobat Koʻrinishlari",
        "type": [],
        "definition": [
            "raqobat asosan ikki turga bo'linadi: a) mukammal; b) mukammal bo'lmagan. Agarda bozorda ko'p sonli sotuvchilar bo'lsa, ularning har biri sotadigan tovarlarning kichik ulushiga ega bo'lsalar va mahsulotga bahoning shakllanishiga ta’sir eta olmasalar, bunday raqobat mukammal raqobat hisoblanadi. Raqobatni bozor ishtirokchilari baholar ishlab chiqarish texnologiyasi, olishi mumkin bo'Igan foyda miqdori kabi axborotlarni olishga bir xil imkoniyatlarga ega bo'ladilar, o'z navbatida xaridorlar mahsulot bahosi, uning o'zgarishi to'g'risida axborotga ega bo'ladilar va bozorga kirish va chiqishda to'siqlar bo'lmaydi. Amaliyotda mukammal raqobat sof holda kam uchraydi. Ammo bir qancha tarmoq bozorlarida, masalan, qishloq xo'jaligi mahsulotlari bozorida raqobatning ushbu shaklini uchratish mumkin. Mukammal bo'lmagan raqobat deganda, sof (mukammal) raqobatning biror-bir sharti bajarilmaydigan bozor tushuniladi. Amaliyotda ko'pgina bozorlarda mahsulotning ko'p qismi cheklangan sonli firmalar tomonidan taklif etiladi. Yirik korporatsiyalar o'zlarining mavqelaridan foydalangan holda mahsulotni sotish shartlariga, baholarga tasir eta oladilar."
        ]
    },
    {
        "word": "Raqobat Muhiti",
        "type": [],
        "definition": [
            "aktivlar taklifining rangbarangligi bilan ifodalanadi. Masalan: bozorda mahsulotni sotuvchilar yagona emas, ular 2 va undan ortiq;"
        ]
    },
    {
        "word": "Raqobat Ustunligi",
        "type": [],
        "definition": [
            "kapital va aktivlar mukammal tuzilishi, muomala xarajatlarining past darajasi, boshqarishni yaxshi tashkil etish hisobiga bozorning boshqa ishtirokchilaridan ustunlik."
        ]
    },
    {
        "word": "Raqobatbardoshlik",
        "type": [],
        "definition": [
            "o'z faoliyatini bozor munosabatlari sharoitida amalga oshirish va bunda ishlab chiqarishni ilmiy-texnik jihatdan takomillashtirish, xodimlarni rag'batlantirish va mahsulot sifatining yuqori bo'lishini ta’minlashga yetarli bo'Igan foyda olish."
        ]
    },
    {
        "word": "Raqobatchilik Muhiti Diagnostikasi",
        "type": [],
        "definition": [
            "marketing tadqiqotining raqobatchilar xatti-harakatlarining ichki motivlari haqida to'liq va aniq tasawurni shakllantirish uchun zarur bo'Igan o'ziga xos mustaqil bosqichi."
        ]
    },
    {
        "word": "Raqobatga Qarshi Amaliyot",
        "type": [],
        "definition": [
            "monopoliyalaming bozorda xukmronlik qilish yo'li bilan boshqa ishlab chiqaruvchilarning unga kirishini chegaralovchi, narx-navoga o'zi baho va tijoratchilik faoliyatining boshqa shartlarini cheklaydigan raqobatchilik kurashi normalarini buzish."
        ]
    },
    {
        "word": "Rasmiy Zaxiralar",
        "type": [],
        "definition": [
            "Markaziy bank ixtiyoridagi xorijiy valyutalar"
        ]
    },
    {
        "word": "Ratsional Ehtiyoj",
        "type": [],
        "definition": [
            "ehtiyojning ilmiy nuqtai nazardan kishi hayoti va faoliyatini to'la qanoatlantiradigan turlari va darajasi."
        ]
    },
    {
        "word": "Ratsional Kutish Nazariyasi",
        "type": [],
        "definition": [
            "gipoteza, unga muvofiq uy xo'jaligi va firmalar, davlatning pul-kredit va budjet sohasidagi siyosati iqtisodiyotga tasir etadi deb kutadilar va o'zining foydasidan kelib chiqqan holda ushbu siyosatni samarasiz qiladigan choralarni ko'radilar."
        ]
    },
    {
        "word": "Ratsionallashtirish",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonini ixchamlashtiradigan, mukamallashtiradigan va arzonlashtiradigan tadbirlar yig'indisi."
        ]
    },
    {
        "word": "Real Aktiv Bozori",
        "type": [],
        "definition": [
            "moddiy resurslarning oldi-sotdi mexanizmi."
        ]
    },
    {
        "word": "Real Almashinuv Kursi",
        "type": [],
        "definition": [
            "ikkala mamlakatdagi baholar darajasining o'zaro nisbatini hisobga oluvchi almashinuvkursi. Solishtirilayotgan mamlakatlardagi nominal almashinuv kursini baholar indekslarining o'zaro nisbatiga ko'paytirish yo'li bilan topiladi"
        ]
    },
    {
        "word": "Real Almashinuv Kursi",
        "type": [],
        "definition": [
            "ikkala mamlakatdagi baholar darajasining o'zaro nisbatini hisobga oluvchi almashinuvkursi. Solishtirilayotgan mamlakatlardagi nominal almashinuv kursini baholar indekslarining o'zaro nisbatiga ko'paytirish yo'li bilan topiladi"
        ]
    },
    {
        "word": "Real Daromad",
        "type": [],
        "definition": [
            "nominal (pul) daromadi miqdoriga sotib olish mumkin bo'Igan tovar va xizmatlar miqdori. Agarda nominal daromad narxlarganisbatantezsur atlardao'ssa,undarealdaromado'sibboradi va aksincha. Real daromadning o'zgarishini quyidagicha ifodalash mumkin: real daromadning o'zgarishi nominal daromadning va narx darajasining o'zgarishiga bog'liq. Agarda nominal daromad bir yilda 10% oshsa, baholar darajasi 8% ko'tarilgan bo'lsa, unda real daromad 2% o'zgargan (oshgan) bo'ladi."
        ]
    },
    {
        "word": "Real Foiz Stavkasi",
        "type": [],
        "definition": [
            "inflyatsiyadan tozalangan foiz stavkasi. Nominal, real foiz stavkalari va narx o'sishi (inflyatsiya) o'rtasidagi miqdoriy bog'liqlikni quyidagicha yozish mumkin"
        ]
    },
    {
        "word": "Real Investitsiya",
        "type": [],
        "definition": [
            "ishlab chiqarishni kengaytirishga noishlab chiqarishni rivojlantirishga qilingan investitsiyalar."
        ]
    },
    {
        "word": "Real Investitsiyalar (Kapital Qoʻyilmalar)",
        "type": [],
        "definition": [
            "pul mablag'larini korxonaning moddiy va nomoddiy aktivlariga sarflanishidan iborat."
        ]
    },
    {
        "word": "Real Ish Haqi",
        "type": [],
        "definition": [
            "pul shakldagi ish haqini, sotib olish qobiliyati, nominal ish haqiga sotib olish mumkin bo'lgan tovar va xizmatlar miqdori. Real ish haqi ish haqining haqiqiy darajasini ko'rsatuvchi iqtisodiy ko'rsatkich hisoblanadi. Real ish haqiga soliqlar miqdori, tovar va xizmatlarga baho, inflyatsiya va boshqa shunga o'xshash omillar ta sir ko'rsatadi."
        ]
    },
    {
        "word": "Real Soliq",
        "type": [],
        "definition": [
            "to'g'ri soliq bo'lib, soliq to'lovchining ayrim mulklarini soliqqa tortish orqali undiriladi"
        ]
    },
    {
        "word": "Realyaim",
        "type": [],
        "definition": [
            "qiyosiybaholarda aks ettirilganYaIM.Ujoriybaholarda hisoblangan nominal YalMni deflyatorga bo'lib topiladi."
        ]
    },
    {
        "word": "Realizatsiya",
        "type": [],
        "definition": [
            "sotish, pullash, tarqatish, amalga oshirish, foyda olish, foizli qog'ozlar veksel va boshqa qimmatli narsalarni pulga aylantirish."
        ]
    },
    {
        "word": "Realizatsiya Qilish",
        "type": [],
        "definition": [
            "sotish, ayirboshlash, beg'araz berish maqsadida tovarlarni jo'natish (topshirish), ishlarni bajarish va xizmatlar ko'rsatish, shuningdek, garovga qo'yilgan tovarlarga bo'lgan mulk huquqini garovga qo'yuvchi tomonidan garovga oluvchiga topshirish. Hisob-varaq - fakturalar, ishlar bajarilganligi yoki xizmatlar ko'rsatilganligi to'g'risidagi dalolatnomalar, tovarlar jo'natilganligini (top shir ilganligini), ishlar bajarilganligini, xizmatlar ko'rsatilganligini tasdiqlovchi kvitansiyalar, cheklar va boshqa hujjatlar realizatsiya qilganlikni tasdiqlovchi hujjatlardir"
        ]
    },
    {
        "word": "Reeksport",
        "type": [],
        "definition": [
            "ma’lum bir mamlakat mahsulot ishlab chiqaruvchi mamlakatdan tovarlarni o'z iste’moli uchun emas, balki boshqa bir uchinchi mamlakatlarga qayta sotib yuborish uchun sotib olish."
        ]
    },
    {
        "word": "Refaksiya",
        "type": [],
        "definition": [
            "shartnomada kelishilgan, andoza yoki texnik sharoit shartlarida belgilanganidan past bo'lgan tovarlarning ulgurji bahosi yoki tovar og'irligiga nisbatan chegirma; ko'p miqdorda yuk mavjud bo'lgan maxsus kelishuvda yuk jo'natuvchiga beriladigan tarifdan chegirma hisoblanadi."
        ]
    },
    {
        "word": "Regional (Hududiy) Davlat Muassasalari",
        "type": [],
        "definition": [
            "kichik sektor, alohida institutsion birliklami tashkil etuvchi davlat regional (hududiy) muassasalari hamda davlat muassasalari tomonidan nazorat qilinuvchi va moliya bilan ta’minlanuvchi regional davlat muassasalaridan tarkib topadi."
        ]
    },
    {
        "word": "Regional Bozor",
        "type": [],
        "definition": [
            "ma’lum hudud doirasida tovarlarni oldi-sotdi qilish munosabatlari. Regional bozor bir mamlakat doirasidagi mintaqalar o'rtasida yoki bir necha chegaradosh davlat o'rtasida ishlab chiqarishning ixtisoslashuvi natijasidir. Ixtisoslashgan mamlakatyoki hududlar tovar ayirboshlab, bir-birining iqtisodiyotini to'ldiradi, ularning o'zaro bog'liqligi kuchayadi. Regional bozor bir necha, lekin ko'pchilik bo'lmagan davlatlar o'rtasidagi bozorni ham bildiradi. Masalan, Afrika, Shimoliy Afrika, Markaziy Afrika mamlakatlarining regional bozori"
        ]
    },
    {
        "word": "Regional Marketing",
        "type": [],
        "definition": [
            "1) regionda marketing faoliyatini tashkil etish; 2) regionning mahalliy, milliy va xalqaro investorlarga ko'rsatiluvchi xizmat va tovarlar marketingi; 3) regionning ijtimoiy-iqtisodiy rivojlanishni boshqarish tizimidagi marketing."
        ]
    },
    {
        "word": "Reglament",
        "type": [],
        "definition": [
            "majlisni olib borish tartibi; ish tartibi, ish qoidasi."
        ]
    },
    {
        "word": "Regress",
        "type": [],
        "definition": [
            "qimmatbaho qog'ozlardan veksel yoki cheklarni qabul qilinayotganda, ularga to'langan summani qoplash haqidagi teskari talab"
        ]
    },
    {
        "word": "Regression Tahlil",
        "type": [],
        "definition": [
            "natijaviy belgiga tasir etuvchi omillarning samaradorligini aniqlab beruvchi usul."
        ]
    },
    {
        "word": "Regressiv Soliq.",
        "type": [],
        "definition": [
            "soliqqa tortiladigan daromadning oshishi bilan soliq stavkasining pasayishi xarakterlidir. Bunday soliqlar toifasiga, xususan, egri (bilvosita) soliqlami kiritish mumkin. Regressiv soliqlarning yuki (og'irligi) boylarga nisbatan kambag'al qatlamlar uchun og'irroq deb sanaladi. Masalan, qo'shilgan qiymat solig'ini to'lash uchun kambag'allar boylarga nisbatan o'z daromadlarining ko'proq qismini (hissasini) sarflaydilar. Proporsional soliq ham regressiv bo'lishi mumkin."
        ]
    },
    {
        "word": "Regressiv Soliqqa Tortish",
        "type": [],
        "definition": [
            "soliq asosi (bazasi)ning o'sib borishi soliq stavkasining pasayishini taqozo etadi. Soliq undirish og'irligi daromadga teskari proporsionaldir: daromad qancha kam bo'lsa, soliq to'lovchi uchun soliqning og'irligi shuncha og'irdir. Hozirgi paytda qo'shilgan qiymat solig'ining joriy etilishi bilan egri (bilvosita) soliqlarning regressivligi kuchayib bormoqda"
        ]
    },
    {
        "word": "Reimport",
        "type": [],
        "definition": [
            "chet elga chiqarilgan, ammo u erda qayta ishlov berilmagan tovarlarni qayta sotib olib, mamlakatning o'ziga qaytarish. Kimoshdi savdosida sotilmagan, konsignatsiyaviy omborlar, ko'rgazma va yarmarkalardan qaytarilgan tovarlar reimportga kirmaydi."
        ]
    },
    {
        "word": "Reinjiniring",
        "type": [],
        "definition": [
            "fimksional bo'limlarni qayta tashkil etish va asosiy biznes jarayonlarni yaratish, ularning har biri multidissiplinar jamoa tomonidan boshqariladi"
        ]
    },
    {
        "word": "Reinvestitsiya",
        "type": [],
        "definition": [
            "investorlar tomonidan korxonalar faoliyatidan olingan foydani ishlab chiqarishni rivojlantirish maqsadida uni shu korxonaga qayta kiritishdir."
        ]
    },
    {
        "word": "Rejalashtirish",
        "type": [],
        "definition": [
            "korxonani iqtisodiy va ijtimoiy rivojlantirish yo'llari va sur’ati, tarmoqlar va bo'Iinmalar, takror ishlab chiqarishning asosiy bo'g'inlari o'rtasida to'g'ri mutanosiblik (proporsionallik)ni tashkil etish jarayoni, boshqarishning tarkibiy qismlaridan biri bo'lib, u iqtisodiy tizimning kelgusi holatini, unga erishish yo'llari, usullari va vositalarini belgilab beruvchi rejalarini ishlab chiqish va amalda qollashdan iborat."
        ]
    },
    {
        "word": "Rejalashtirishga Strategik Yondashish",
        "type": [],
        "definition": [
            "barcha imkoniyatlar va kamchiliklarni o'rgangan holda tuzilgan uzoq muddatli reja korxonalarning doimiy hamroxi bo'lishi kerak. Boshqaruvchilar korxona faoliyatining texnik, ijtimoiy, siyosiyva madaniy aspektlarini bir butun holatda ко'rib chiqishi kerak. Bu aspektlarning har biri o'zaro to'ldiruvchi bo'lishi kerak. Shu bilan bir qatorda zamonaviy menejer muammolarni yechishda o'z qo'l ostidagilarning fikrlarini ham inobatga olishi kerak."
        ]
    },
    {
        "word": "Rejali Investitsiyalar",
        "type": [],
        "definition": [
            "yillik daromadning har qanday potensial darajasidaishlabchiqaruvchilarsarfqilmoqchibo'lganinvestitsiyalar"
        ]
    },
    {
        "word": "Reja-Naryad",
        "type": [],
        "definition": [
            "ishning xususiyatiga ko'ra, individual xodimga, ishchilarning mayda guruhiga, traktor otryadiga yoki agregatiga qisqa muddatga (bir, besh kun va dekadaga) beriladigan reja topshiriqlar"
        ]
    },
    {
        "word": "Reklama",
        "type": [],
        "definition": [
            "bozorga chiqariladigan mahsulot (xizmat) bilan iste’molchilarni tanishtirish. Tovar va xizmatlarni ishlab chiqaruvchilar reklamani mustaqil yoki ixtisoslashgan reklama agentligi orqali amalga oshiradilar. Reklama vositalari quyidagilardir: reklama e’lonlari, informatsion materiallar, informatsion xatlar, kataloglar, reklama filmlari va boshqalar. Reklama marketingda mahsulotni sotish tadbirlari majmuyida markaziy o'rin tutadi. Reklama quyidagi vazifalarni bajaradi: a) axborot beruvchi (yangi tovar to'g'risida ma’lumotni yoki mavjud tovarning yangi xossalarini iste’molchiga yetkazish, baholarning o'zgarishi to'g'risida axborotni yetkazish; b) ko'ndiruvchi (tovarni olish zarurligiga iste’molchini ishontirish); d) esga soluvchi (iste’molchining tovar to'g'risida xabardorligini ta’minlab turish, iste’molchilarni tovar ularga kerak bo'lib qolishi xususida ogohlantirish va hokazo)."
        ]
    },
    {
        "word": "Reklama Auditoriyasi",
        "type": [],
        "definition": [
            "muayyan axborot manbalari orqali e’lon qilingan reklama xabarlarini eshitishi, ko'rishi va o'qishi mumkin bo'lgan barcha shaxslar."
        ]
    },
    {
        "word": "Reklama Matni",
        "type": [],
        "definition": [
            "gazeta yoki jurnalda beriladigan e’lonlar, pochta jo'natmalari, televizion va radio oraliqlarning so'z qismi."
        ]
    },
    {
        "word": "Reklama Piramidasi",
        "type": [],
        "definition": [
            "asosiy iste’molchilar doiralarining birikuvi, ularning reklama qilinayotgan tovarni xarid qilishga tayyorligi. O'sib borish tartibiga ko'ra quyidagi bosqichlarga taqsimlanadi: bexabarlik, xabardor bo'lish, moyillik, afzal ko'rish, xarid qilish, qayta xarid qilish."
        ]
    },
    {
        "word": "Reklama Samaradorligi",
        "type": [],
        "definition": [
            "reklama vositalarining ishlab chiqaruvchi yoki vositachilari manfaatlari yo'li da istemolchilarga tasir ko'rsatish darajasi. Reklama murojaatidan oldin va keyin aniqlanadi. Reklamaning savdo natijalariga ko'rsatuvchi tasirini aniqlash (iqtisodiy samaradorlik) reklama xarajatlarini awalgi faoliyat natijalari bo'yicha tovar sotish hajmiga nisbati yordamida aniqlanadi. Bu usulning aniqligi yuqori emas, chunki savdo natijalariga reklamadan tashqari boshqa ko'plab omillar ham tasir ko'rsatadi."
        ]
    },
    {
        "word": "Reklama Va Savdoni Ragʻbatlantirish",
        "type": [],
        "definition": [
            "kommunikativlik (aloqadorlik)ning rivojlanishi. Barcha ommaviy axborot vositalaridan foydalangan holda reklama uzatish."
        ]
    },
    {
        "word": "Reklamatsiya",
        "type": [],
        "definition": [
            "xaridor tomonidan sotuvchiga shartnoma asosida yetkazib berilgan tovar sifati va miqdorining shartnomaga to'g'ri kelmasligi tufayli bildiruvchi daVosi."
        ]
    },
    {
        "word": "Rekonstruktsiya (Qayta Qurish)",
        "type": [],
        "definition": [
            "takomillashtirish maqsadida biron narsani tubdan qayta qurish (tashkillashtirish). Tashkilot, korxona, iqtisodiy tizimning ishlab turishi va rivojlanishi xususiyatlarini o'zgartirishga qaratilgan kompleks chora-tadbirlar."
        ]
    },
    {
        "word": "Rekreatsiya Zonalar",
        "type": [],
        "definition": [
            "aholining tashkil etilgan, ommaviy dam olishi va turizmga mo'ljallangan yer va suv muhitining tabiiy yoki madaniy uchastkalari kiradi. Shunday zonalar tarkibiga shahar hududlari uchastkalari, shahar atrofi va yashil zonalar, o'rmonlar, parklar, milliy va tabiiy parklar (bog'lar),botanika, zoologiya bog'lari, dendrologik parklar, turistik marshrutlar, dam olish uylari va bazalari kiradi."
        ]
    },
    {
        "word": "Rekvizit",
        "type": [],
        "definition": [
            "ifola etiladigan obyektning aniq belgilarini ko'rsatadigan hujjatning ajralmas elementi."
        ]
    },
    {
        "word": "Relevant Xarajatlar",
        "type": [],
        "definition": [
            "muqobil boshqaruv qarorini qabul qilishni tanlashda e’tiborga olinadigan xarajatlar. Zaxiralarni saqlash va buyurtmalarni bajarish bilan bog'liq kelgusidagi xarajatlar."
        ]
    },
    {
        "word": "Remarketing",
        "type": [],
        "definition": [
            "talabning pasayishi sharoitida uni jonlantirish jarayonlari"
        ]
    },
    {
        "word": "Remissiya",
        "type": [],
        "definition": [
            "to'lov mablag'ini hisob-varaq bo'yicha kamaytirish tomoniga yaxlitlash."
        ]
    },
    {
        "word": "Remoliyalashtirish Siyosati",
        "type": [],
        "definition": [
            "Markaziy bank tomonidan tijorat banklari ixtiyoridagi tijorat veksellarni hamda qimmatbaho qog'ozlarni garovga olish va shu yo‘l bilan kredit berishdir."
        ]
    },
    {
        "word": "Rendit",
        "type": [],
        "definition": [
            "dividend summasining aksiyani sotib olish bahosiga nisbati"
        ]
    },
    {
        "word": "Renta",
        "type": [],
        "definition": [
            "kochmas mulk egasi mulkini muqobil ishlatishdagi olgan daromadi. Yer, imorat, kvartira, uy-joy va boshqalar ijaraga berilib, undan daromad ko'riladi. Masalan, uy-joy ijaraga berilib, har oyda 500000 so'm daromad ko'riladi. Uyga talabgorlar ko'payganda uni yangidan 540000 so'mga ijaraga beriladi. Oldingi va keyingi pul tushumi orasidagi farq 40000 so'm (540000-500000) renta hisoblanadi"
        ]
    },
    {
        "word": "Renta Daromadlari",
        "type": [],
        "definition": [
            "yer egalarining qishloq xo'jaligi yerlarini foydalanishga berish natijasida oladigan daromadlari"
        ]
    },
    {
        "word": "Rentabellik",
        "type": [],
        "definition": [
            "(nem. rentabel - foydali, daromadli) foyda olish darajasi. Rentabellik ma’lum davr mobaynida olingan foyda miqdorining shu davrda sarflangan asosiy ishlab chiqarish fondlari va oborot vositalari qiymati yig'indisiga yoki mahsulotning ishlab chiqarish va sotish xarajatlari - tannarxga nisbati sifatida foizlarda hisoblanadi. Uning to'rt xil ko'rsatkichi mavjud: korxona aktivlari rentabelligi, xususiy kapital rentabelligi va sotilgan mahsulot rentabelligi. Bu ko'rsatkichlar balansdagi (sof) foyda ko'rsatkichini korxona aktivlarining o'rtacha yillik qiymati, muomalaga chiqarilgan aksiyalar miqdori, xususiy kapital miqdori va sotilgan mahsulot tannarxiga nisbati bilan aniqlanadi."
        ]
    },
    {
        "word": "Renting",
        "type": [],
        "definition": [
            "mulkni bir kundan to bir yilgacha bo'Igan qisqa muddatga ijaraga berishni nazarda tutadi."
        ]
    },
    {
        "word": "Report",
        "type": [],
        "definition": [
            "birjada tuziladigan bitimlardan biri bo'lib, uning asosida qimmatli qog'oz yoki valyuta ma’lum muddat o'tgach awalgiga nisbatan yuqoriroq kurs bo'yicha sotib olish sharti bilan sotiladi"
        ]
    },
    {
        "word": "Respublika Budjeti -",
        "type": [],
        "definition": [
            "davlat budjetining umumdavlat tusidagi tadbirlarini moliyalashtirishda foydalaniladigan qismi bo'lib, unda daromadlar manbalari va ulardan tushumlar miqdori, shuningdek, moliya yilida aniq maqsadlar uchun ajratiladigan mablag'lar sarfi yo'nalishlari va miqdori nazarda tutiladi."
        ]
    },
    {
        "word": "Respublika Budjeti Defitsitini Moliyalashtirish",
        "type": [],
        "definition": [
            "davlat tomonidan xorijdan va ichki mablag'ni jalb qilish, respublika budjeti mablag'larining moliya yili boshlanishidagi qoldiqlari va qonunlarga muvofiq boshqa manbalar hisobidan amalga oshiriladi."
        ]
    },
    {
        "word": "Respublika Budjetining Daromadlari",
        "type": [],
        "definition": [
            "l) qonun hujjatlarida belgilangan tartibdagi va normativlar asosidagi umumdavlat soliqlari, yig'imlari, bojlari va boshqa majburiy to'lovlar; 2) qonun hujjatlarida belgilangan normativlar bo'yicha davlat moliyaviy va boshqa aktivlarining joylashtirilishi, foydalanishga berihshi va sotilishidan olingan daromadlar; 3) qonun hujjatlariga muvofiq meros olish, hadya etish huquqi bo'yicha davlat mulkiga o'tgan pul mablag'lari; 4) yuridik va jismoniy shaxslardan, shuningdek, chet el davlatlaridan kelgan qaytarilmaydigan pul tushumlari; 5) rezident - yuridik shaxslarga va chet el davlatlariga berilgan budjet ssudalarini qaytarish hisobiga berilgan to'lovlar; 6) qonun hujjatlarida taqiqlanmagan boshqa daromadlardan iborat"
        ]
    },
    {
        "word": "Respublika Budjetining Xarajatlari",
        "type": [],
        "definition": [
            "o'z tarkibiga l) respublika budjetidan moliyalashtiriladigan budjet mablag'i oluvchilarning joriy xarajatlari; 2) joriy budjet transfertlari; 3) kapital xarajatlar (asosiy fondlar va vositalarni (ular bilan bog'liq ishlar va xizmatlar ham shular jumlasiga kiradi) davlat ehtiyojlari uchun olish va takror ishlab chiqarish, chet elda davlat ehtiyojlari uchun yer va boshqa mol-mulk olish, davlat ehtiyojlari uchun yerga bo'lgan huquqni va boshqa nomoddiy aktivlarni olish, davlat zaxiralarini vujudga keltirish xarajatlari); 4) kapital xarajatlami qoplash uchun yuridik shaxslarga beriladigan budjet transfertlari; 5) Qoraqalpog'iston Respublikasi budjeti va mahalliy budjetlarga budjet dotatsiyalari, budjet subvensiyalari va budjet ssudalari; 6) rezident - yuridik shaxslarga va chet el davlatlariga beriladigan budjet ssudalari; 8) davlat maqsadli jamg'armalariga beriladigan budjet dotatsiyalari va budjet ssudalari; 9) qonun hujjatlarida taqiqlanmagan boshqa xarajatlami oladi."
        ]
    },
    {
        "word": "Restrikatsiya",
        "type": [],
        "definition": [
            "l) yuqori narxlarni ushlab turish maqsadlarida ayrim tovarlarni ishlab chiqarish, sotish va eksport qilishni cheklash; 2) oltin jamg'armalarining chet elga chiqib ketishini, bank sinishining oldini olish maqsadlarida banklar va davlat tomonidan kredit hajmini cheklash."
        ]
    },
    {
        "word": "Restrukturizatsiyalash",
        "type": [],
        "definition": [
            "boshqa tashkilotlarga qo'shib yuborish, ajratish, maqomini o'zgartirish va hokazo tarzda korxona tashkiliy tuzilmasini o'zgartirish."
        ]
    },
    {
        "word": "Resurs",
        "type": [],
        "definition": [
            "pul mablag'lari, qimmatbaho narsalar, zaxiralar, imkoniyatlar, mablag'lar va daromadlar (tabiiy, iqtisodiy, moliyaviy) manbalari"
        ]
    },
    {
        "word": "Resurs Toʻlovlari Va Mol-Mulk Soligʻi",
        "type": [],
        "definition": [
            "mol-mulk va yerga ega bo'lganlik va tabiiy resurslardan foydalanganlik uchun to'lanadigan soliqlar (mol-mulk solig'i, yer solig'i, yer osti boyliklaridanoydalanganlik uchun soliq va suv resurslaridan foydalanganlik uchun soliq)."
        ]
    },
    {
        "word": "Resurslar",
        "type": [],
        "definition": [
            "1. Resurs, imkoniyat, boylik manbai; vosita, chora, iloji. Masalan, iqtisodiy, moliyaviy, resurslar. 2. Umuman olganda, fundamental iqtisodiy nazariya tushunchasi bo'lib, ishlab chiqarishni ta’minlaydigan omil va vositalarni bildiradi. Iqtisodiy resurslar quyidagilami o'z ichiga oladi: tabiiy (xomashyoviy, geofizik), mehnat (inson kapitali), kapital, muomala vositalarini, informatsion va moliyaviy resurslar."
        ]
    },
    {
        "word": "Resurslar Bozori",
        "type": [],
        "definition": [
            "ishlab chiqarish ehtiyojlarini qondiruvchi tovarlar, ya’ni ishlab chiqarish omillari sotiladigan bozor. Uy xo'jaligi o'ziga tegishli resurslarni sotadi, korxonalar esa uni xarid qiladi. Asosan, ishlab chiqarish vositalari (dastgoh, xomashyo, asbob-uskuna va h.k.) va ish kuchi sotiladi."
        ]
    },
    {
        "word": "Resurslarga Chekli Xarajat",
        "type": [],
        "definition": [
            "qo'shimcha bir birlik resurs sotib olish uchun sarflangan qo'shimcha xarajat."
        ]
    },
    {
        "word": "Resursning Chekli Daromadliligi Yoki Resursning Pulda Ifodalangan Chekli Mahsuloti",
        "type": [],
        "definition": [
            "resursdan qo'shimcha bir birlik foydalanish natijasida olingan qo'shimcha mahsulotni sotishdan tushgan qo'shimcha daromad."
        ]
    },
    {
        "word": "Retrotsedent",
        "type": [],
        "definition": [
            "qabul qilib olingan qayta sug'urtalash riskini retrotsessiyaga (ikkinchi qayta sug'urtalash) beruvchi sug'urta yoki qayta sug'urtalovchi kompaniya"
        ]
    },
    {
        "word": "Retrotsessionarty",
        "type": [],
        "definition": [
            "retrotsedentdan riskni qabul qilib oluvchi qayta sug'urtalovchi kompaniya"
        ]
    },
    {
        "word": "Retrotsessiya",
        "type": [],
        "definition": [
            "l) qayta sug'urtalashga ilgari qabul qilib olingan risklarni yana qaytasug'urtalashgaberish; 2) risklarni uchlamchi joylashtirish"
        ]
    },
    {
        "word": "Revalvatsiya",
        "type": [],
        "definition": [
            "lotincha so'zdan olingan bo'lib, qadrini oshirish ma’nosini anglatadi, milliy pul birligi kursining boshqa mamlakatlar pul birligi kursiga nisbatan ko'tarilishi. Oltin paritetlar bekor qilinguncha (1971-yil) revalvatsiya valyuta asosida sotuvchi oltin miqdorini ko'paytirish bilanbirga amalga oshirilgan. О 'zining milliy valyutasini revalvatsiya qiluvchi mamlakat uchun chet el valyutasini arzonroq sotib olishga imkoniyat vujudga keladi. Shuning uchun, kapitalni eksport qiluvchilar tovarlarni import qiluvchilar manfaatlari qarzdorlar va tovarlarni eksport qiluvchilar manfaatlari dan baland bo'lganda revalvatsiya amalga oshiriladi. Shuningdek, revalvatsiya inflyatsiyaga qarshi kurashda va to'lov balansining aktiv saldosini tiyib turishda qo'llaniladi. Qog'oz - pul muomalasi sharoitida revalvatsiya va devolvatsiyadan asosan milliy valyuta kursini tartibga solishda foydalaniladi. Revalvatsiya valyuta qiymatini faqat xalqaro iqtisodiy aloqalarda oshiradi. Ichki bozorda inflyatsiya tasiri natijasida uning sotib olish qimmati boshqa mamlakadarga nisbatan kamroq darajada pasayishi ham mumkin. Ikkinchi jahon urushidan song dunyoda 500 marta devolvatsiya va faqat 10 marta revalvatsiya amalga oshirilgan. Oxirgi yillarda g‘arb mamlakatlari valyutaning suzib yuruvchi kurslaridan foydalanmoqdalar, bunda ular revalvatsiyani boshqa shaklda, ya’ni o'z valyutalarining bozor kursini oshirib, uning rasmiy kursini o'zgartirmasdan qoldirgan holda amalga oshirmoqdalar."
        ]
    },
    {
        "word": "Reyting",
        "type": [],
        "definition": [
            "1. Baho, biron tabaqa, sinf, tipga bo'lish, ommaviylik va mashhurlik darajasi. 2. Biror narsani biron-bir sinfga, razryadga yoki toifaga kirishini aniqlash, baholash"
        ]
    },
    {
        "word": "Rezerv Valyuta",
        "type": [],
        "definition": [
            "xalqaro hisob-kitob ishlarida, jumladan savdo-sotiq, kredit va investitsiya ishlarida, shuningdek, xorijiy valyuta rezervlarini jamlashda qo'llaniladigan, jahon bozorida tan olingan, lekin kelib chiqishi milliy bo'Igan valyuta."
        ]
    },
    {
        "word": "Rezerv Valyutasi",
        "type": [],
        "definition": [
            "1. Davlat xazinasi va markaziy bankka tegishli bo'Igan mamlakat quyma va tanga oltinlar, xorij valyuta mablag'lari, xalqaro hisoblaruchun jamg'arib, saqlab qo'yiladigan valyuta. 2. Rivojlangan davlatlarning xalqaro hisoblar olib borish uchun foydalaniladigan milliy va kredit pullari."
        ]
    },
    {
        "word": "Rezidentlar",
        "type": [],
        "definition": [
            "kalendar yilida mamlakatda 183 kundan kam bo'lmagan muddatda yashagan, O'zbekistonda doimiy yashash joyiga ega bo'Igan va bo'lmagan soliq to'lovchilardan iborat. Shu mamlakat rezidentlarining daromadlari (shu mamlakat hududida va undan tashqarida olinganlari ham) shu mamlakatda soliqqa tortilishi shart"
        ]
    },
    {
        "word": "Rikardo David",
        "type": [],
        "definition": [
            "(1772-1823) ingliz iqtisodchisi, klassik iqtisodiy nazariyasining ko'zga ko'ringan namoyandasi. Uning eng mashhur asari “Siyosiy iqtisod va soliq solish qoidalari” ( 1817-yil). U iqtisodiy qonunlarni kapitalistik ishlab chiqarishga tadbiq etish va ular orqali ishlab chiqarishni boshqarish masalalarini tahlil etgan, qiymat nazariyasini rivojlantirgan. D. Rikardo ayniqsa xalqaro iqtisodiyotdagi savdo erkinligi afzalliklarini tadqiq etish doirasida dong taratdi. A. Smit ta’limotining buyuk davomchisi, sanoat to'ntarishi davrining iqtisodchisi. Mehnat taqsimotini korxona doirasidan mamlakatlarga ham joriy etishni taklif etgan, nisbiy ustunlik, nisbiy chiqimlar ustunligi nazariyalariga asos solgan. Fabrika davrini to'g'ri tushungan, fritreyderlik (erkin savdo)ni qo‘ llab -quwatlagan"
        ]
    },
    {
        "word": "Risk",
        "type": [],
        "definition": [
            "l) bitta kutilayotgan hodisa bo'yicha xavfning yuzaga kelishi. Risk tushunchasi ko'rinishlarining xilma-xilligi, uni sodir bo'lishi natijasida yuzaga kelgan oqibatlarning og'irligi, riskning ro'y berishi sababli paydo bo'lgan zararlarni mutloq tugatishning imkoniyati bo'lmaganligi sug'urta ishini tashkil etish uchun asos yaratadi. Shunday qilib, risk sug'urtaviy huquqiy munosabatlarni shakllantirish uchun shart-sharoit yaratadi. Risk - riskli holatlarning yagonalik va o'zaro aloqadorlik yig'indisi. Sug'urta fanida risk tushunchasiga turlicha ta riflar berilgan. Jumladan, risk - bu konkret hodisa yoki hodisalar yig'indisi bo'lib, ular sodir bo'lgan taqdirda sug'urta kompaniyasi qoplamalar to'laydi. Risk sug'urta obyekti bilan to'g'ridan to'g'ri bog'langan. Obyektga risk salbiy tasir ko'rsatib, uni shikastlashi yoxud nobud qilishi mumkin. Shu tufayli risk - bu yagona tasodifiy hodisa bo'lib, uning ro'y berishi inson ongiga yoki irodasiga bog'liq emas. Sug'urta risklarining ro'yxati sug'urtalovchining sug'urta javobgarligi hajmini tashkil etadi. Risk bahosining puldagi ifodasi sug'urta tarif stavkasini tashkil etadi; 2) sug'urta obyekti: 3) sug'urta javobgarligining turi"
        ]
    },
    {
        "word": "Risk Menejmenti",
        "type": [],
        "definition": [
            "riskni kamaytirish yoki chegaralash bo'yicha sug'urta kompaniyasining maqsadli yo'naltirilgan harakati. Risk menejmentining tarkibiy elementiga quyidagilar kiradi: riskni aniqlash, riskni baholash, riskni nazorat qilish va riskni moliyalashtirish."
        ]
    },
    {
        "word": "Risklarni Joylashtirish",
        "type": [],
        "definition": [
            "l) sug'urta manfaati tufayli yuzaga keladigan sug'urtaviy huquqiy munosabatlarning boshlanish jarayoni. Risklarni birlamchi, ikkilamchi va uchlamchi joylashtirish, teng ravishda sug'urtalash, qayta sug'urtalash va retrotsessiyaga to'g'ri keladi. Bozor munosabatlariga asoslangan iqtisodiyotda risklarni joylashtirish sug'urta vositachilari orqali sug'urta bozorida amalga oshiriladi; 2) sug'urta brokeri yordamida bir vaqtning o'zida yirik va xavfli risklarni qismlarga bo'lib, bir nechta sug'urta kompaniyasida sug'urtalash uslubi. Bir qancha sug'urta kompaniyalari tarkibidan bittasi etakchi sifatida ajralib chiqadi va u sug'urta shartnomasidagi shartlarni ma’qullab, riskning tegishli qismini o'z javobgarligiga oladi. Keyin, broker boshqa sug'urta kompaniyalariga murojaat qilib, riskning qolgan qismini ham joylashtiradi"
        ]
    },
    {
        "word": "Risklarni Tanlash",
        "type": [],
        "definition": [
            "sug'urta shartnomasini tuzish bo'yichamijozlardan kelib tushgan takliflarni tahlil etishga qaratilgan sug'urta kompaniyasining faoliyati. Sug'urta kompaniyasining muvozanatlashgan sug'urta portfelini shakllanishida risklarni tanlash iborasini amaliy jihatdan ishlatish muhimdir. Sug'urta amaliyotida risklarni tanlash ishini syurveyerlar amalga oshiradi. Risklarni tanlash - bu risk menejment sohasida olib boriladigan chora-tadbirlarning bir qismidir."
        ]
    },
    {
        "word": "Riskliholatlar",
        "type": [],
        "definition": [
            "risk darajasiga tasir qiluvchi omillar. Sug'urtalanuvchiga ma’lum bo'Igan barcha riskli holatlar sug'urta kompaniyasiga xabar qilinadi. Bu riskni baholashda muhim ahamiyatga ega. Riskli holatlarni tahlil etish syurveyer yoki adjasterning funksiyasiga kiradi. Bu sug'urta kompaniyasining sug'urta shartnomasini tuzish yoki tuzmaslik masalasi bo'yicha qaror qabul qilishida hamda sug'urta qoplamalari va summalarini to'lashda muhim o'rin tutadi. Riskli holatlar: shaxsiy va ashyoviy; to'g'ri va egri; tasdiqlanadigan va inkor qilinadigan: obyektiv va subyektiv turlarga bo'linadi"
        ]
    },
    {
        "word": "Riskni Baholash",
        "type": [],
        "definition": [
            "risk parametrlarini xarakterlovchi barcha riskli holatlarni natura va qiymat ko'rinishida tahlil etish. Eng ahamiyatli belgisiga qarab tegishli risklar guruhi ajratilgan hamda u riskni baholash mezoni hisoblanadi. Masalan, shaxsiy sug'urta shartnomasini tuzishda insonning yoshiga e’tibor beriladi. Sug'urta shartnomasi tuzilgan paytdan sug'urtalanuvchining o'limiga yoki nogiron bo'lib qolishiga olib keluvchi xavfli kasalliklarni aniqlash maqsadida mijoz qo'shimcha ravishda dastlabki tibbiy tekshiruvdan o'tkazilishi mumkin. Sug'urta kompaniyalarida riskni baholash ishini syurveyerlar amalga oshiradi. U sug'urta obyekti bilan jiddiy tanishadi, har tomonlama tahlil etadi. Tahlil natijalariga muvofiq sug'urtalanuvchi bilan sug'urtaviy huquqiy munosabatlarga kirishishning maqsadga muvofiqligi to'g'risida sug'urta kompaniyasiga yozma xulosa beradi"
        ]
    },
    {
        "word": "Ritm Berish",
        "type": [],
        "definition": [
            "alohida bir predmetni jarayondan o'tish vaqtini ma’lum bir taymerli mexanizm yordamida majburiy cheklash. Ko'p j arayonlarda ritm berish ishlatilmaydi, lekin odatda yig'ish konveyerlarida ritm beriladi"
        ]
    },
    {
        "word": "Rivojlanish Bank",
        "type": [],
        "definition": [
            "sanoat, qishloq xo'jaligi, qurilish va boshqa tarmoqlarni uzoq muddatli kreditni ta’minlash ishlari bilan shug'ullanuvchi maxsus davlat va yarim davlat (xususiylari kamroq) investitsiya institutlari. Milliy bozorlar faoliyat ko'rsatadigan mamlakatlarda rivojlanish banklari ham fond birjasida, ham undan tashqarida qimmatli qog'ozlar oldi-sotdisini amalga oshiradilar. Bu vazifalarni turli kredit bank institutlari bajaradilar: moliya ко гр о г at s iyalar i, industrial banklar, sanoat rivojlanishidagi tarmoqli va ko'p tarmoqli korporatsiyalar, sanoat va qishloq xo'jaligi rivojlanishi banklari va fondlari mayda korxona va qishloqxo'jaligini mablag' bilan ta’minlovchi maxsus kredit muassasalar. Rivojlanish banklari tijorat banklaridan farqli o'laroq hisob-kitob va to'lov operatsiyalarni amalga oshirmaydigan omonatchi va korxonalardan depozit olmaydilar, qisqa muddatli kreditlar bermaydilar"
        ]
    },
    {
        "word": "Rivojlanishning Ekstensiv Yoʻli",
        "type": [],
        "definition": [
            "intensiv rivojlanishdan farqi shundaki, ishlab chiqarishni kengaytirish, hajmini ko'paytirish, ekin maydonini kengaytirish xomashyo miqdorini ko'paytirish, yangi ishchilarni yollash yo'li bilan amalga oshiriladi."
        ]
    },
    {
        "word": "Rtvojlantiruvchi Marketing",
        "type": [],
        "definition": [
            "yangi tovarlarni yaratib, ularni iste’molchilarga taklif qilgan tarzda bo'Iajak talabni real talabga aylantirish."
        ]
    },
    {
        "word": "Rodbertus Karl Iogann",
        "type": [],
        "definition": [
            "(1805-1875) nemis iqtisodchisi, o'z iqtisodiy g'oyalarini “Sotsialxatlar” shaklida ilgari surdi, qo'shimcha qiymat, pul va renta bo'yicha mayda burjuacha qarashlar tarafdori. Vulgar qarash - “o'ta soddalashtirilgan” “soxtalashtirilgan”, degan ma’nosi bor, g'ayriilmiy iqtisodiy nazariyalar majmuyi, asosiy namoyandalari Sey (1767-1832) va Maltusdir (1766-1834). Ular kapitalizmni himoya qilish maqsadida iqtisodiy jarayonlarning tashqi ko'rinishini tavsiflash va “xo'jako'rsin'ga klassifikatsiya qilish bilan chegaralanib, hodisaning mohiyatini tadqiq etmaydilar. Ularga faqat ayrim masalanigina olib, butun muammoni hal qilish xosdir. Vulgar qarash namoyandalari klassik iqtisodiy maktabni inkor etadilar."
        ]
    },
    {
        "word": "Rosher Vilgelm Georg",
        "type": [],
        "definition": [
            "(1817-1894) Germaniya tarixiy maktabining faollaridan, iqtisodiy qonunlarning obyektivligini rad etadi, iqtisodiyotni ma’naviy fan deydi, sinfiy kurashning mavjudligini rad etadi, urushlar madhiyachisi - Sey g'oyalarini qo'llab-quwatlaydi"
        ]
    },
    {
        "word": "Royalti",
        "type": [],
        "definition": [
            "quyidagilar uchun har qanday turdagi to'lovlar: fan, adabiyot va sanat asarlaridan, shu jumladan elektron-hisoblash mashinalari uchun dasturlar, audiovizual asarlardan hamda turdosh huquqlar obyektlaridan, jumladan ijrolar va fonogrammalardan foydalanganlik yoxud ulardan foydalanish huquqini berganlik uchun; sanoat mulki obyektiga, tovar belgisiga (xizmat ko'rsatish belgisiga), savdo markasiga, dizayn yoki modelga, rejaga, maxfiy formula yoki jarayonga bo'lgan huquqni tasdiqlovchi patentdan (guvohnomadan) yoxud sanoat, tijorat yoki ilmiy tajribaga taalluqli axborotdan (nou-xaudan) foydalanganlik uchun"
        ]
    },
    {
        "word": "Raqamli Didaktika ",
        "type": [],
        "definition": [
            "ta’limning mazmuni, usullari va vositalari uchun mantiqiy asosni, raqamli jamiyatda о‘quv jarayonini tashkil qilishni ta’minlaydigan ilm-fan. Xakaton – dasturchilar forumi bо‘lib, turli sohadagi dasturiy ta’minot ishlab chiquvchi (dasturchi, loyihalovchi, boshqaruvchi)lar birgalikda bir muddat muammoni birgalikda hal qilishi.  "
        ]
    }
]