[
    {
        "word": "Sabab",
        "type": [],
        "definition": [
            "insonning nima uchun harakat qilishini ko'rsatadigan, faoliyatga ichki undovchi narsa bo'lib, u muayyan ehtiyojlami qondirish bilan bog'Iiqdir."
        ]
    },
    {
        "word": "Salbiy Auditorlik Xulosasi",
        "type": [],
        "definition": [
            "auditorlik tashkilotning xo'jalik yurutuvchi subyektning moliyaviy hisoboti buzib ko'rsatilganligi va moliyaviy hisobotdan foydalanuvchini yanglishtirishi mumkinligi to'g'risidagi fikrini o'z ichiga olgan hujjat."
        ]
    },
    {
        "word": "Salbiy Solishtirma Dalolatnoma",
        "type": [],
        "definition": [
            "mijoz korxona va mijoz xaridorlariga mol yetkazib beruvchilari o'rtasida amalga oshirilgan va ikki taraf buxgalteriya tizimida aks ettirilgan hisob-kitob operatsiyalari natijalarining auditor tomonidan inventarizatsiyasi turli ma’lumotlarni aks ettirishi (muhim farqningyuzaga kelishi)."
        ]
    },
    {
        "word": "Salbiy Talab",
        "type": [],
        "definition": [
            "ma’lum talabni qondirish uchun tovar mavjud, uning sifati yomon emas, lekin shunga qaramay iste’molchilar u tovarni rad etadilar."
        ]
    },
    {
        "word": "Saldo",
        "type": [],
        "definition": [
            "(ital. saldo - hisob, qoldiq) qoldiq, ma’lum bir muddatda kirim va chiqim orasida vujudga kelgan farq; buxgalteriyada - debet va kredit, umumiy aktiv va passiv o'rtasidagi tafovut, farq; xalqaro savdoda - eksport hamda import o'rtasidagi farq; muayyan vaqt davomida moliyaviy tushumlar va sarflar, eksport va import qiymati (savdo balansi saldosi), xorijiy to' lovlar va tushumlar (to' lov balansi saldosi) o'rtasidagi farq."
        ]
    },
    {
        "word": "Samaradorlik",
        "type": [],
        "definition": [
            "korxona uchun maksimal qiymat yaratish maqsadiga yo'naltirilgan faoliyat natijasini aks ettiruvchikategoriya hisoblanadi"
        ]
    },
    {
        "word": "Samaradorlik Asosiy Koʻrsatkichlari",
        "type": [],
        "definition": [
            "menejerlarga korxona faoliyatini baholash va undagi o'zgarishlar zaruriyatini aniqlashga imkon beradigan ko'rsatkichlardir. Bular kundalik mablag' zaruriyati, bitta mahsulot birligiga yoki bo'limga to'g'ri keladigan operatsion daromadi kabi moliyaviy ko'rsatkichlar va buyurtma bajarilish vaqti, umumiy sotuvdagi yangi mahsulotlar sotilishi qismi kabi nomoliyaviy korsatkichlar."
        ]
    },
    {
        "word": "Samarali Iqtisodiy Siyosat",
        "type": [],
        "definition": [
            "davlatning iqtisodiyotni barqaror rivojlantirishga qaratilgan, har tomonlama asoslangan, izchil va o'zaro uyg'unlashtirilgan chora-tadbirlari majmuyi"
        ]
    },
    {
        "word": "Samarali Xarajatlar",
        "type": [],
        "definition": [
            "tegishli mahsulotlarni ishlab chiqarish uchun sarflangan xarajatlardan olingan mahsulotlarni sotish natijasida daromad (foyda) keltiradigan xarajatlar."
        ]
    },
    {
        "word": "Samuelson Pol",
        "type": [],
        "definition": [
            "(1915, AQSH) - ko‘p marta qayta nashr etilgan “Ekonomiks” (1948) darsligini yaratdi, 1970 yilda iqtisodiyot fanlarida ilmiy tahlil darajasini oshirishga qo'shgan hissasi uchun Nobel mukofotini olgan. Iqtisodiyotning barcha sohalariga oid ilmiy ishlari bor. “Aralash iqtisodiyot”ning nazariyotchisi. Neoklassik tahlil bo'ycha, taraqqiyotning “to'rt g'ildiragi” asoschisi"
        ]
    },
    {
        "word": "Sanatsiya",
        "type": [],
        "definition": [
            "1. davlat yoki yirik bank yordamida katta korxona va firmalar sinishining oldini olish chora-tadbirlari. 2. Qarzdor korxonaning mol-mulkini korxonaning holatini sog'lomlashtirish maqsadlarida biron-bir shaxslar yoki tashkilotlarga topshirilishi bilan bog'liq tashkiliy-huquqiy taomil."
        ]
    },
    {
        "word": "Sanirlash",
        "type": [],
        "definition": [
            "korxonalar (firmalar) va tashkilotlarni sinishdan qutqarish maqsadida ularni moliyaviy sog'lomlashtirish. Sanirlash bir qator tadbirlarni nazarda tutadi, xususan, korxonaga berilayotgan kreditlarni va davlatning subvensiyalarini ko'paytirish, korxona tomonidan olingan kreditlar muddatini uzaytirib berish, qo'shimcha mablag'larni jalb etish maqsadida yangidan aksiya va obligatsiyalarni chiqarib sotish va boshqalar. Sanirlash orqali davlat bozor iqtisodiyotiga ta’sir etadi."
        ]
    },
    {
        "word": "Sanksiya",
        "type": [],
        "definition": [
            "joriy qonunchilik me’yorlari asosida yo'l qo'yilgan qonunbuzarlik yoxud zimmasiga olingan majburiyatlarning bajarilmasligi faktiga javoban vakolatli davlat organlarining javob reaksiyasi."
        ]
    },
    {
        "word": "Sanoat Namunalari",
        "type": [],
        "definition": [
            "sanoat yoki hunarmandlik buyumlarining tashqi ko'rinishini belgilovchi badiiy-konstruktorlik yechimidir"
        ]
    },
    {
        "word": "Sanoat Siri",
        "type": [],
        "definition": [
            "ishlab chiqarish sirlari, nou-xau, ixtiro va kashfiyotlar."
        ]
    },
    {
        "word": "Sanoat Taraqqiyoti Boʻyicha Bmt Anjumani (Yunido)",
        "type": [],
        "definition": [
            "BMT tizimi doirasidagi maxsus muassasa"
        ]
    },
    {
        "word": "Sanoat Toʻntarilishi (Inciilobi)",
        "type": [],
        "definition": [
            "Angliyada birinchi bor XVIII asr o'rtalarida qo'l kuchiga asoslangan manufakturadan (ikkinchi bosqichdan) mashinalashgan zavod-fabrikaga (uchinchibosqichga) o'tish jarayoni (XIX asrning o'rtalarida yakunlangan). Iqtisodiy rivojlanishda muhim o'rinni egallaydi, ijtimoiy-siyosiy sohalarda katta o'zgarishlarga sabab bo'lgan."
        ]
    },
    {
        "word": "Sanoat Tovarlari",
        "type": [],
        "definition": [
            "ishlab chiqarish ehtiyojini qondiradigan tovarlar"
        ]
    },
    {
        "word": "Sanoatga Taalluqli Boʻlmagan Ishlab Chiqarish Va Xoʻjalik Mablagʻlari",
        "type": [],
        "definition": [
            "bularga ushbu korxonadagi uy-joy, madaniy-maishiy va sog‘liqni saqlash maqsadlariga xizmat qiluvchi mablag'lar kiradi. Masalan, klub, bolalar bog'chasi va yaslisi, dam olish uylari, ambulatoriya, tibbiy yordam ko'rsatish binolari hamda ulardagi uskunalar. Bu mablag'lar korxona xodimlari va ularning oila a’zolari uchun xizmat qiladi."
        ]
    },
    {
        "word": "Sarflar",
        "type": [],
        "definition": [
            "chiqim, xarajat, sarflar. Masalan, ma’muriy, yalpi, kalkulyatsiya sarflari."
        ]
    },
    {
        "word": "Savdo",
        "type": [],
        "definition": [
            "mahsulotni ayirboshlash, bunda mahsulot ashyoviy shakldan pul shakliga aylanadi. Savdo bo'lishi uchun sotuvchi va xaridor bo'lishi shart. Savdo muomala sohasida amalga oshadi."
        ]
    },
    {
        "word": "Savdo Agenti",
        "type": [],
        "definition": [
            "firma nomidan ish ko'ruvchi va quyidagi funksiyalarning bir nechtasini bajaruvchi shaxs: mijozlarni jalb qilish, aloqa yo'lini o'rnatish sotishni amalga oshirish, xizmat ko'rsatishni tashkil qilish, ma’lumot yig'ish va resurslarni taqsimlash."
        ]
    },
    {
        "word": "Savdo Balansi",
        "type": [],
        "definition": [
            "eksport va import operatsiyalari bo'yicha valyuta to'lovlari va tushumlarining haqiqatdagi summasi aks ettiriladi. Kreditga sotib olingan tovarlar qiymati bu yerda aks ettirilmaydi."
        ]
    },
    {
        "word": "Savdo Faoliyati",
        "type": [],
        "definition": [
            "qayta sotish maqsadida olingan tovarlarni sotishga doir faoliyat"
        ]
    },
    {
        "word": "Savdo Foydasi",
        "type": [],
        "definition": [
            "tovarlarni iste’molchiga yetkazishda sotib olish bahosi bilan sotish bahosi o'rtasida farq hisobiga olinadigan foyda. Savdo foydasi ishlab chiqarish sohasidagi foydaning bir qismini tashkil etadi. Mahsulot ishlab chiqargan tadbirkor mahsulotini savdoda harakat qiluvchi tadbirkorga sotadi, bu bilan u o'zi olishi mumkin bo'Igan foydaning bir qismini ongli ravishda unga mahsulotini sotganligi uchun beradi. Bu esa uning kapitali aylanishini tezlashtiradi"
        ]
    },
    {
        "word": "Savdo Kapitali",
        "type": [],
        "definition": [
            "l) Muomala sohasida amal qiluvchi kapital. 2) Sanoat kapitalining alohidalashgan qismi"
        ]
    },
    {
        "word": "Savdo Krediti",
        "type": [],
        "definition": [
            "korxonalarningbir-birlariga tovar ko'rinishdagi qarzberishi. Bunda berilgan tovarlar pullarini muayyan muddatga kechiktirib to'lash ko'zda tutiladi. Odatda, savdo kreditining foizi, bank krediti foizidan past bo'ladi."
        ]
    },
    {
        "word": "Savdo Kvotasi",
        "type": [],
        "definition": [
            "tashqi savdoda ishtirok etishning miqdoriy chegarasi. Savdo kvotasi eksport yoki import qilinadigan tovarlarning miqdori, tuzilishi, ularni sotish yoki sotib olishning pul bilan hisoblangan miqdorini bildiradi. Savdo kvotasi tashqi savdo bitimiga qo'shilgan mamlakatlar, firmalar yoki tashkilotlarning birgalikdagi kelishuvi qaroriga binoan belgilanadi yoki bir tomonlama o'rnatiladi. Bir tomonlama joriy etilgan eksport, importni, o'z ixtiyori bilan qisqartirish yoki norozilik bildirish uchun qo'llaniladi. Savdo kvotasiga binoan eksport, import litsenziyalari beriladi."
        ]
    },
    {
        "word": "Savdo Markalari Va Savdlo Nomlari",
        "type": [],
        "definition": [
            "savdo markalari (masalan, “Nestle”, “Adidas”) va (yoki) savdo nomlari (Coca- Cola) - bu kompaniyalarga, mahsulot yoki xizmatlarga berilgan nomlar, belgilar yoki boshqa belgilovchi aksiyalardir. Ular egalik qilishni asoslash uchun ro'yxatdan o'tkazilishi mumkin. Bunday holatda mahsulotlarning nomi, belgisi yoki boshqa belgilovchi identifikatsiyalar yuridik tomondan himoyalangan bo'ladi."
        ]
    },
    {
        "word": "Savdo Markasini Boshqarish",
        "type": [],
        "definition": [
            "xaridorlar tomonidan, qator tovarlarga nisbatan, ijobiy munosabat hosil qilish maqsadida ularni yangilash bo'yicha amalga oshiriladigan tadbirlar. Savdo markasini boshqarish (yoki brend - menejment) asosan xalq iste’moli mollarini ishlab chiqarish va sotishda qo'llaniladi."
        ]
    },
    {
        "word": "Savdо Palatasi",
        "type": [],
        "definition": [
            "turli davlatlar o'rtasida tashqi savdo aloqalar ini rivojlanishiga tasir etish maqsadida tashkil etilgan ijtimoiy tashkilot. Masalan: Savdo-sanoat palatasi, Savdo palatasi."
        ]
    },
    {
        "word": "Savdo Ustamasi",
        "type": [],
        "definition": [
            "savdo korxonalari (vositachilar) o'z xarajatlarini qoplab, foyda topish uchun tovarni sotib olgan narxi ustiga qo'yiladigan qo'shimcha."
        ]
    },
    {
        "word": "Savdo Uyi",
        "type": [],
        "definition": [
            "savdo korxonasining maxsus turi, ixtisoslashgan yoki sertarmoq bo'ladi. Ixtisoslashgan savdo uyi ayrim tovarlar bilan, masalan, ust kiyim, oyoq kiyimi, gazlama va hokazolar bilan, universal (sertarmoq) savdo uyi esa har xil tovarlar bilan savdo qiladi"
        ]
    },
    {
        "word": "Savdo Vositachilari",
        "type": [],
        "definition": [
            "kompaniyagamijozlarni topish va ularga tovarlarni sotishga yordam beruvchi firmalar. Savdo vositachilari, xaridorlarga tovarni sotib olish uchun kompaniyaga nisbatan qulayroq vaqt, joy, jarayon va kamroq xarajatlami ta’minlashi mumkin."
        ]
    },
    {
        "word": "Savdoda Eng Qulay Sharoit Yaratish Rejimi",
        "type": [],
        "definition": [
            "mamlakatlar o'rtasida kelishilgan xolda o'rnatilgan savdo operasiyalarining imtiyozli tartibi."
        ]
    },
    {
        "word": "Savd О - Sotiq",
        "type": [],
        "definition": [
            "savdo, savdo-sotiq, oldi-sotdi, auksion, kimoshdi savdosi; manfaatli shartlarni taklif qilib, shaxslar bilan yuridik bitim tuzish; savdoning bir shakli."
        ]
    },
    {
        "word": "Schyot (Hisob)",
        "type": [],
        "definition": [
            "pul mablag*larining muayyan bir yo'nalish bo'yicha harakatini ifodalovchi (bayon qiluvchi) buxgalteriya hisobining yozuvlar majmuasi. Schyotda buxgalteriya balansining bir yoki bir-birlariga yaqin bir nechta moddalari birlashtirilib, hisobkitob qilinadi. Schyot jadval ko'rinishida bo'lib, u ikki qismga bo'Iinadi: chap tomoni debet, o‘ng tomoni esa kredit. Aktiv moddalarni hisoblashga mo'ljallangan schyotlar aktiv schyotlar, passiv moddalarga taalluqli schyotlar esa passiv schyotlar deyiladi. Aktiv schyotlar debetida mablag'larning ko'payishiga, kreditida esa kamayishiga olib keluvchi operatsiyalar ko'rsatilsa, passiv schyotlarida buning teskarisi bo'ladi."
        ]
    },
    {
        "word": "Schyot Saldosi",
        "type": [],
        "definition": [
            "aktiv schyotlardagi debet bilan kredit va passiv schyotlardagi kredit bilan debet o'rtasidagi farq (yoki qoldiq). Aktiv schyotlarda saldo har doim uning debetida (debetli saldo) bo'lsa, passiv schyotlarda uning kreditida (kreditli saldo) bo'ladi."
        ]
    },
    {
        "word": "Schyotlar Korrespondentsiyasi",
        "type": [],
        "definition": [
            "ikkiyoqlama yozuv vositasida schyotlar o'rtasida paydo bo'Igan o'zaro aloqa schyotlar korrespondensiyasi deyiladi. Bu korrespondensiya qatnashuvchi schyotlar korrespondensiyalanuvchi schyotlar deb ataladi. Schyotlar korrespondensiyasini aks ettiruvchi qisqacha yozuv buxgalteriya provodkasi deyiladi."
        ]
    },
    {
        "word": "Schyotlarning Aylanmalari",
        "type": [],
        "definition": [
            "buxgalteriya hisobi schyotlarning debeti va krediti bo'yicha yozuvlar jami. Ular tegishli ravishda debet va kredit aylanmalari deyiladi. Aylanmalar har oyning oxirida jamlab chiqiladi. Aktiv schyotlar bo'yicha debet aylanma oy davomida hisob obyekti ko'payishini, passiv schyotlar bo'yicha kamayishini anglatadi. Kredit aylanma aktiv schyotlar bo'yicha oy davomida hisob obyekti kamayishini, passiv schyotlar bo'yicha ko'payishini ko'rsatadi. Schyotning qoldig'ini chiqarish uchun oldin uning aylanmalarini aniqlash kerak."
        ]
    },
    {
        "word": "Schyotning Shifri",
        "type": [],
        "definition": [
            "schyotning shartli raqamli belgisi (nomeri). Buxgalteriya hisobining schyotlar rejasida har bir schyotning nomi va uning shifiri ko'rsatiladi. Hisobni avtomatlashtirishda schyotlar shifrlarining ahamiyati katta. Hozirgi vaqtda sintetik hisob schyotlar tort raqamli bo'lib, ular 0100 dan 9910 gacha. 21-son BHMS bilan joriy etilgan schyotlar rejasida subschyotlar keltirilmagan."
        ]
    },
    {
        "word": "Segmentlar Boʻyicha Hisobot",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyekt faoliyatining ayrim segmentlari (sexlar, bo'limlar, ishlab chiqarish, sotish, ta’minot) bo'yicha hisobot."
        ]
    },
    {
        "word": "Segmentlar Boʻyicha Hisobot",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyekt faoliyatining ayrim segmentlari (sexlar, bo'limlar, ishlab chiqarish, sotish, ta’minot) bo'yicha hisobot."
        ]
    },
    {
        "word": "Sekstillion",
        "type": [],
        "definition": [
            "birning yonidagi nollar soni 21 ta bo'lgan son."
        ]
    },
    {
        "word": "Sektor",
        "type": [],
        "definition": [
            "institutsion birliklarni oldiga qo ygan maqsadi va iqtisodiy vazifalarining bir-biriga yaqinligi yoki o'xshashligiga qarab hamda asosiy faoliyatlarini yuritishga kerak bo'lgan mablag'lar manbaalarining o'xshashligiga qarab guruhlashdir"
        ]
    },
    {
        "word": "Sektorlararo Eksternaliya",
        "type": [],
        "definition": [
            "iqtisodiyot tarmoqlari, ayniqsa, tabiatni ekspluatatsiya qiluvchi sohalar boshqa sohalarga ekologik ziyon keltirishini hisobga oladi, ekologik muammolarning muqobil yechimini topishga va iqtisodiyotni tuzilmaviy qayta qurishga yo'naltiradi."
        ]
    },
    {
        "word": "Sekulyarlashtirish",
        "type": [],
        "definition": [
            "davlat va jamiyat boshqaruvini din ta’siridan holi qilish jarayoni."
        ]
    },
    {
        "word": "Sekvestr",
        "type": [],
        "definition": [
            "yilning oxirigacha qolgan vaqt davomida budjetning barcha moddalari bo'yicha (himoya qilinganlaridan tashqari) davlat xarajatlarini proporsional ravishda qisqartirish"
        ]
    },
    {
        "word": "Selektiv Talab",
        "type": [],
        "definition": [
            "bir xil yoki o'xshash tovarlarni qiyosiy baholash natijasida tovarning iste’molchiga eng ma’qul kelgan aniq turi, varianti, markasiga shakllangan talab."
        ]
    },
    {
        "word": "Sen-Simon Klod Anri",
        "type": [],
        "definition": [
            "(1760-1825) Fransiya xayoliy sotsializmining vakili, ammo Sen-Simon xususiy mulkni saqlab qolish tarafdori bo'lgan."
        ]
    },
    {
        "word": "Septillion",
        "type": [],
        "definition": [
            "birning yonidagi nollar soni 24 ta bo'lgan son."
        ]
    },
    {
        "word": "Sermehnat, Mehnat Talab Faoliyat",
        "type": [],
        "definition": [
            "l) sermehnat bo'lishlik, ko'p mehnat sarf qilish, ko'p mehnat talab qilish; masalan, texnologik, boshqarish va to'la mehnat faoliyatlari; 2) mahsulotning har bir birligida sarf qilinadigan mehnat hajmi bilan aniqlanadi"
        ]
    },
    {
        "word": "Sertifikat-",
        "type": [],
        "definition": [
            "(firan. certifikat- tasdiqlayman, guvohlikberaman) - l) Guvohlik beruvchi hujjatdir. Masalan: auditor sertifikati - e’lon qilingan firma balansining to'g'riligini tasdiqlovchi hujjat. Sug'urta sertifikati - bu sug'urta shartnomasining shartlari qayd etilgan hujjat. Aksionerlik sertifikati - bu o'z egasining jamiyat (kompaniya) kapitalining bir qismiga egaligini tasdiqlovchi hujjat. Tashqi iqtisodiy aloqalarda tovar sifati guvohnomasi va h.k. 2) Pul belgilarining turlari va uning o'rnini bosuvchi obligatsiyalarning bir xil turlari va maxsus davlat zayomlari, qarzgaberganlikhaqidagi guvohnoma sertifikat deyiladi."
        ]
    },
    {
        "word": "Servis",
        "type": [],
        "definition": [
            "jismoniy va yuridik shaxslarga, umuman keng aholi qatlamiga xizmat ko'rsatish; ishlab chiqarish maqsadlarida mahsulotlarni moddiymaishiy, xo'jalik va boshqa sanoat mahsulotlarini sotish hamda ularni ishlatish bilan bog'liq bo'lgan xizmat ko'rsatish sohalari"
        ]
    },
    {
        "word": "Servis Korxonasida Xizmat Koʻrsatish",
        "type": [],
        "definition": [
            "xizmat ko'rsatilishi uchun mijoz ushbu xizmat ko'rsatiladigan servis korxonasiga yetib kelishi shart"
        ]
    },
    {
        "word": "Sessionariy-",
        "type": [],
        "definition": [
            "qayta sug'urtalashda riskni o'ziga qabul qiluvchi sug'urtalovchi"
        ]
    },
    {
        "word": "Sey Jan Batist",
        "type": [],
        "definition": [
            "(1767-1837) - fransuz iqtisodchisi, klassik maktabga qarshi, “kompensatsiya” nazariyasini ilgari surgan, “Sey qonuni’ ning (“Bozorlar qonuni”) muallifi, unga ko'ra taklif talabni avtomatik ravishda vujudga keltiradi. Sey inqirozlarni inkor etgan, sinflar o'rtasidagi qarama-qarshilikni tan olmaydi (“ular o'rtasida uyg'unlik bor”, deydi). Protektsionizm o'rniga savdoni targ'ib qilgan. Ishlab chiqarishning uch omilini (kapital, ishchi kuchi va yer) ilgari surdi"
        ]
    },
    {
        "word": "Sey Qonuni",
        "type": [],
        "definition": [
            "unga asosan jami taklif o'zining jami talabini yuzaga keltiradi, shuning uchun jami taklif va jami talab bir-biriga mos keladi, degan makroiqtisodiy tamoyilga asoslanadi. Agar shunday bo'ladigan bo'lsa, tovarlar keragidan ko'proq ishlab chiqarilmaydi. Masalan, ishlab chiqaruvchi 2000 so'mlik mahsulot sotsa, bir vaqtning o'zida u o'ziga zarur bo' lgan tovarlardan 2000 so'mlikxarid qilishi mumkin. U o'zining talabini yuzaga keltirmoqda, ya’ni taklif 2000 = talab 2000. Shu bois iqtisodiyotni tartibga solishga davlat aralashmasligi kerak, degan xulosa ilgari surilgan."
        ]
    },
    {
        "word": "Sifat",
        "type": [],
        "definition": [
            "tovarning muayyan iste’molchilar ehtiyojini qondirish qobiliyatini belgilab beruvchi, qo'yilgan talablarga mos keluvchi xususiyatlari majmuyi. Oldi-sotdi shartnomalarida tomonlar sifat ko'rsatkichlari, uni tekshirish tartibi, tovar sifatining belgilangan talablarga mos kelishini tasdiqlovchi hujjatlarni taqdim etish tartibi kelishib olinadi, zarur hollarda tovarni sifati bo'yicha qabul qilish va topshirish shartlari, shuningdek, tovar sifati yoki uni saqlash muddati bo'yicha kafolatlar belgilab qo'yiladi"
        ]
    },
    {
        "word": "Sifat 0 ʼLchagichlari",
        "type": [],
        "definition": [
            "sifat baholanadigan o'lchovlar"
        ]
    },
    {
        "word": "Sifat Taʼminl Anadi Gan Xarajatlar",
        "type": [],
        "definition": [
            "mahsulot yoki xizmat sifatini ta’minlash (masalan nuqsonlarning oldini olish, tekshiruv qilish bilan bog'liq xarajatlar) bilan bog'liq bo'lgan xarajatlar"
        ]
    },
    {
        "word": "Sifat Uyi Matritsasi",
        "type": [],
        "definition": [
            "mahsulotni loyihalashtirish bilan shug'ullanuvchi funksionalaro guruhga iste’molchilarning talablarini operatsion va konstruksion masalalarga aylantirishga imkon beradigan matritsa"
        ]
    },
    {
        "word": "Sifatning Mos Tushishi",
        "type": [],
        "definition": [
            "mahsulot loyihasida ko'rsatilgan talablarga javob bera olish darajasi."
        ]
    },
    {
        "word": "Sikl",
        "type": [],
        "definition": [
            "iqtisodiy faoliyatning birin-ketin qayta-qayta takrorlanishi. Odatda, to'rtta bosqichda: krizis (inqiroz), depressiya (bir joyda depsinish), jonlanish va yuksalishdan iborat. Amaliy hayotda ko'proq ikki bosqich: bum (cho'qqi, zudlik bilan yuqori bosqichga ko'tarilish) va repressiya, ya’ni ishbilarmonlik faoliyatining susayishi, orqaga ketishi bilan xarakterlanadi. Sikl mexnizmi investisiya hajmi bilan bog'liqdir."
        ]
    },
    {
        "word": "Sikl Vaqti",
        "type": [],
        "definition": [
            "ma’lum bir jarayonda ketma-ket ishlanadigan “birliklar” chiqishi orasidagi o'rtacha vaqt. Bu atamaga ko'pgina hollarda ma’lum bir takrorlanuvchi ishning boshi va ohiri orasidagi o'rtacha vaqt deb tavsifberiladi."
        ]
    },
    {
        "word": "Sikllik (Davriy) Ishsizlik",
        "type": [],
        "definition": [
            "ishlab chiqarishning qisqarishi natijasida vujudga keladigan ishsizlik turi. Asosan iqtisodiyotda davriy rivojlanib, inqiroz bosqichida vujudga keladi"
        ]
    },
    {
        "word": "Sikllik Balanslashtiriladigan Budjet",
        "type": [],
        "definition": [
            "budjet siyosatidagi konsepsiyalardan biri. Uning asosida budjet iqtisodiy sikl davrida muvozanatlashtirilishi lozim, degan qoida yotadi. Davlat bir vaqtning o'zida siklga qarshi choralarni amalga oshiradi va budjetni muvozanatlashtirisbga harakat qiladi. Tanazzulga qarshi chora, deb hukumat soliqlarni pasaytiradi, xarajatlarni oshiradi va ongli ravishda budjet kamomadini yuzaga keltiradi. Ko'tarilish davrida esa hukumat soliqlarni oshiradi, davlat xarajatlarini kamaytiradi, natijada yuzaga kelgan budjetning ijobiy saldosi tanazzul vaqtidagi kamomadni qoplashda ishlatiladi. Ammo asosiy muammo shundan iboratki, iqtisodiy faoliyatning ko'tarilishi va tanazzul vaqti davomiyligi nuqtai nazaridan farq qiladi. Masalan, tanazzul davri 2 yil, ko'tarilish davri esa 1 yil bo'lishi mumkin. Unda 2 yilda yuzaga kelgan kamomad miqdorini 1 yilda budjetning ijobiy saldo miqdori bilan qoplab bo'lmaydi."
        ]
    },
    {
        "word": "Siljitish Murojaati",
        "type": [],
        "definition": [
            "iste’molchilarga etkaziladigan ma’lumotlar shakli."
        ]
    },
    {
        "word": "Siljitish Strategiyasi",
        "type": [],
        "definition": [
            "tovar siljitish vositalari, usullari, tadbirlarini aniq bozor sharoitiga mos qo'llash tartibi."
        ]
    },
    {
        "word": "Siljitish Strukturasi",
        "type": [],
        "definition": [
            "korxonaning iste’molchilar bilan aloqa o'rnatish va uni ta’minlash dasturi bo'lib, reklama, sotishni rag'batlantirish, targ'ibot, shaxsan sotish usullari, vositalari tizimi."
        ]
    },
    {
        "word": "Siljitish Vositalari",
        "type": [],
        "definition": [
            "tovar haqidagi ma’lumotlarni iste’molchiga etkazish va singdirish, iste’molchilar bilan aloqa o'rnatish vositalari."
        ]
    },
    {
        "word": "Sindikat",
        "type": [],
        "definition": [
            "monopolistik birlashmaning shakli. Unda sindikatga birlashayotgan korxonalar ishlab chiqarish mustaqilligini saqlab qolgan holda o'zlarining tijorat sohasidagi mustaqilligidan mahrum bo'ladilar. Bunda buyurtmalarni taqsimlash, xomashyo sotib olish, ishlab chiqarilgan mahsulotni sotish uchun o'zlarining tijorat faoliyatlarini birlashtirib, yagona idora tuzadilar."
        ]
    },
    {
        "word": "Sinergetik Samara",
        "type": [],
        "definition": [
            "tashkilotning yagona bir butun sifatidagi salohiyati va imkoniyatlari uning alohida elementlarining salohiyatlari va imkoniyatlaridan oshib ketadi, bu narsa ularni o'zaro qo'llabquwatlanishlari va to'ldirilishlari bilan asoslangan"
        ]
    },
    {
        "word": "Sintetik Schyotlar",
        "type": [],
        "definition": [
            "mablag'lar va xo'jalik jarayonlarining umumlashgan hisobi pul ko'rsatkichlarida yuritiladigan schyotlar"
        ]
    },
    {
        "word": "Sintetik Hisob",
        "type": [],
        "definition": [
            "pul o'lchovida umumiy ko'rsatkichlarni beruvchi hisob. Bunday ko'rsatkichlar sintetik schyotlarda bo'lib, ular mavjud mablag'lar hamda ularning manbalari va harakati (asosiy vositalar, xomashyo, materiallar, yoqilg'i, ishlab chiqarish xarajatlari, g'aznadagi va hisob-kitob schyotidagi pul mablag'lari, ustav kapitali va h.k.) to'g'risida umumiy tasawurga ega bo'lish uchun zarur. Sintetik hisob ma’lumotlari analitik hisoblarda detallashtiriladi, ular Sintetik hisob registrlari bo'lib, bosh daftar, jurnal-orderlar hisoblanadi."
        ]
    },
    {
        "word": "Sintetik Hisob Schyotlari",
        "type": [],
        "definition": [
            "sintetik hisob yuritiladigan buxgalteriya hisobi schyotlari oddiy vamurakkab sintetikhisob schyotlari bo'lishi mumkin. Oddiy schyotlarning ko'rsatkichlari detallashtirilmaydi va ular bo'yicha analitik hisob yuritilmaydi. Murakkab schyotlarning ko'rsatkichlari, zarur bo'lgan hollarda, analitik hisobda detallashtiriladi. Sintetik schyotlarning ro'yhati schyotlar rejasida keltirilgan. Har bir sintetik schyot o'zining shifri (nomeri)ga ega. Hozirgi qo'llanilayotgan schyotlar rejasida (21-son BHMS) subschyotlar yo'q."
        ]
    },
    {
        "word": "Sinxromarketing",
        "type": [],
        "definition": [
            "ishlab chiqarishni talabningtebranishiga moslashtirish."
        ]
    },
    {
        "word": "Sirgʻaluvchi Oʻrtacha",
        "type": [],
        "definition": [
            "qator darajalarini birin-ketin ma’lum tartibda surish yo'li bilan hisoblangan o'rtacha darajadir."
        ]
    },
    {
        "word": "Sirgʻanma Narx",
        "type": [],
        "definition": [
            "ayrim yangi tovarlarga belgilangan nisbatan yuqori narx; bozorning to'yinishi bilan pasayib boradi"
        ]
    },
    {
        "word": "Sirpanuvchan Oʻrtacha",
        "type": [],
        "definition": [
            "trend yo'nalishi daraklarini turlicha ko'rsatadigan oynaning katta kichikligiga qarab sirpanuvchan o'rtachalar."
        ]
    },
    {
        "word": "Sismondi Shakl",
        "type": [],
        "definition": [
            "(1773-1842) Jenevada tug'ilgan, Fransiyada yashagan, mayda ishlab chiqarish iqtisodining asoschisi, yirik kapitalistik ishlab chiqarishga qarshi chiqdi va buni “isbotlab berish’ ga harakat qildi. Mamlakatdagi barcha illatlar yirik ishlab chiqarish tufayli, deb hisoblagan. U kapitalizmni tan olmagan, davlat yo'li bilan yirik korxonalarni tugatishni taklif etgan."
        ]
    },
    {
        "word": "Sivilizatsiya",
        "type": [],
        "definition": [
            "jamiyatning o'z taraqqiyoti jarayonida yaratgan moddiy va ma’naviy boyliklarining, ularni yanada ko'paytirib hamda takomillashtirib berish usullarining majmuyi"
        ]
    },
    {
        "word": "Siyosiy Risk",
        "type": [],
        "definition": [
            "davlat organlarining xatti-harakati yoxud uyushgan shaxslar guruhining siyosiy talab bo'yicha chiqishi natijasida vujudga keladigan xavf. Siyosiy riskga urush harakatlari, siyosiy hokimiyatning yoki tuzumning o'zgarishi, qonun hujjatlaridagi o'zgarishlar, fuqarolarning ommaviy chiqishlari va ish tashlashlari, milliylashtirish, konfiskatsiya kiradi. Siyosiy risk ro'y bergan vaqtda sug'urta kompaniyasi javobgarlikdan ozod bo'ladi. Chunki siyosiy risklar, faqat, davlatga qarashli maxsus sug'urta kompaniyalari tomonidan sug'urtalanishi mumkin."
        ]
    },
    {
        "word": "Skonto",
        "type": [],
        "definition": [
            "to'lov muddatidan oldin tovar uchun haq to'langan taqdirda tovar qiymatidan chiqariladigan chegirma"
        ]
    },
    {
        "word": "Slip",
        "type": [],
        "definition": [
            "birja faoliyatida aksiyaga qo'shib jo'natiladigan hujjat (sertifikat). Ushbu hujjatda aksiyaga tegishli tor doiradagi ba’zi ma’lumotlar (sirkulyasiyaga ruxsat olingan, aksiya konkurent tomonga tegishli emas va boshqalar) keltirilgan bo'ladi. Slipda sug'urta kompaniyasining riskni sug'urtalashdagi hissasi ko'rsatiladi. Angliyada slip sug'urta polisiga tenglashtiriladi. Ayrim holatlarda slip sug'urta qoplamasini to'lashda asosiy hujjat hisoblanadi"
        ]
    },
    {
        "word": "Smenalilik Koeffitsient",
        "type": [],
        "definition": [
            "uskunalaming vaqt bo'yicha ish bilan ta’minlash darajasi ko'rsatkichi; sutka davomida ishlab berilgan mashina - smenalarning o'rnatilgan barcha smenalar soniga nisbati orqali aniqlanadi."
        ]
    },
    {
        "word": "Smeta",
        "type": [],
        "definition": [
            "qurilish, montaj ishlari, asbob uskunalar sotib olish uchun ketgan mehnat, material va pul xarajatlari miqdori belgilangan hujjatlar yig'indisi; moliya rejasining bir turi, bunda asosan xarajatlar aks ettiriladi."
        ]
    },
    {
        "word": "Smetali Moliyalashtirish",
        "type": [],
        "definition": [
            "noishlab chiqarish sohasi korxona va tashkilotlari xarajatlarini qoplash metodi."
        ]
    },
    {
        "word": "Smit Adam",
        "type": [],
        "definition": [
            "(1723-1790) shotlandiyalik iqtisodchi olim, o'zining “Xalqlar boyligining tabiati va sabablari to'g'risida tadqiqot” 1776-yil) asari"
        ]
    },
    {
        "word": "Soʻnggi Usul",
        "type": [],
        "definition": [
            "mamlakatning oltin valyuta rezervlarini ishlatish yo'li bilan to'lov balansi defitsitini qoplashga aytiladi."
        ]
    },
    {
        "word": "Soʻrov",
        "type": [],
        "definition": [
            "kishilarning bilimlari, e’tiqodlari, xohishlari va mamnunliklari to'g'risidagi ma’lumotlar olish uslubi."
        ]
    },
    {
        "word": "Sof Aktivlar",
        "type": [],
        "definition": [
            "birlikning hisobot davrida majburiyatlariga nisbatan aktivlarining ko'payganligini ifodalaydi"
        ]
    },
    {
        "word": "Sof Aralash Daromad",
        "type": [],
        "definition": [
            "uy xo'jaligi sektoriga qarashli nokorporativ korxonalar daromadlarining hosil bo'lishi schyotidagi muvozanatlashtiruvchi ko'rsatkichdir."
        ]
    },
    {
        "word": "Sof Daromad",
        "type": [],
        "definition": [
            "milliy daromadning bir qismi, xalq xo'jaligida yaratilgan qo'shimcha mahsulotning puldagi ifodasi. Sof daromad foyda, renta, foizga bo'linadi, ya’ni ularning jami jamiyat miqyosida sof daromadni tashkil etadi."
        ]
    },
    {
        "word": "Sof Diskontirlangan (Keltirilgan) Qiymat",
        "type": [],
        "definition": [
            "kelajakda olinadigan sof daromadning diskontirlangan qiymatidan diskontirlangan investitsiya ayirmasi:"
        ]
    },
    {
        "word": "Sof Eksport",
        "type": [],
        "definition": [
            "tovar va xizmatlarning eksporti va ularning importi o'rtasidagi ayirma: eksport - import = sof eksport."
        ]
    },
    {
        "word": "Sof Foyda",
        "type": [],
        "definition": [
            "korxona moliyaviy faoliyati natijasida ko'rilgan daromaddan mahsulot tannarxi va soliqlar hisoblanganidan so'ng korxona ixtiyorida qoldirilgan foyda."
        ]
    },
    {
        "word": "Sof Foyda",
        "type": [],
        "definition": [
            "korxona moliyaviy faoliyati natijasida ko'rilgan daromaddan mahsulot tannarxi va soliqlar hisoblanganidan so'ng korxona ixtiyorida qoldirilgan foyda."
        ]
    },
    {
        "word": "Sof Ichki Mahsulot (Sof Milliy Daromad)",
        "type": [],
        "definition": [
            "makroiqtisodiy ko'rsatkich bo'lib, YalM (YaMD)dan amortizatsiya ajratmalari miqdorini ayirib tashlash yo'li bilan topiladi."
        ]
    },
    {
        "word": "Sof Investitsiyalar",
        "type": [],
        "definition": [
            "yalpi investitsiyalardan amortizatsiya miqdorining ayirmasi. Masalan, yalpi investitsiyalar = 40 p.b., amortizatsiya = 20 p.b., sof investitsiyalar = 40 - 20 = 20 p.b. (pul birligi)."
        ]
    },
    {
        "word": "Sof Iqtisodiy Renta",
        "type": [],
        "definition": [
            "narx bo'yicha absolyut elastik bo'lmagan taklifga ega bo'lgan resurs egasi tomonidan olinadigan daromad"
        ]
    },
    {
        "word": "Sof Kreditlar Va Sof Qarzlar",
        "type": [],
        "definition": [
            "birlikning boshqa birliklarga bergan va ulardan olgan mablag'lari o'rtasidagi farqdir. Natija musbat bo'lsa, u sof kreditlar, aks holda sof qarzlar deb ataladi"
        ]
    },
    {
        "word": "Sof Kreditlar Yoki Qarzlar",
        "type": [],
        "definition": [
            "kapital bilan bo'ladigan muomala hisobining balanslantiruvchi moddasi (natijasi) sof kreditlar yoki qarzlardan iborat bo'ladi; bu modda moliya bilan ta’minlash manbaining nomoliyaviy aktivlar xarajatiga nisbatan oshiq yoki kamligini ko'rsatadi."
        ]
    },
    {
        "word": "Sof Kreditlash (Qarz Olish)",
        "type": [],
        "definition": [
            "nomoliyaviy aktivlarni sotib olish uchun moliyalashtirish mablag'larining, sof xarajatlarga nisbatan ortiqligi (defitsitligi). Uning hajmini aniqlash uchun yalpi asrash bilan yalpi jamg'arish, yerlarni va nomaterial aktivlarni sof sotib olish plyus *qolgan dunyo” kapital transfertlari orasidagi farqqa teng. Makrodarajadagi sof kreditlash yoki sof qarz olish mamlakatning “boshqa dunyo’ga bergan yoki “boshqa dunyo”dan olgan sof resurslari hajmini ko'rsatadi."
        ]
    },
    {
        "word": "Sof Lizing",
        "type": [],
        "definition": [
            "bunda ijaraga berilayotgan mulk va ularni ishlatishga sarflanadigan barcha qoshimcha xarajatlar ijarachi zimmasiga yuklatiladi."
        ]
    },
    {
        "word": "Sof Mahsulot",
        "type": [],
        "definition": [
            "moddiy ishlab chiqarish sohasida korxona yoki tarmoqda yangidan yaratilgan qiymatni xarakterlovchi ko'rsatkich. Sof mahsulot yalpi mahsulotdan iste’mol qilingan ishlab chiqarish vositalari qiymatiga farq qiladi. Rejalashtirish va statistikada sof mahsulot yalpi yoki tovar mahsulotidan moddiy xarajatlami (uning ichiga asosiy fondlar amortizatsiyasi ham kiritiladi) ayirib tashlash orqali aniqlanadi. Hamma tarmoqlarda sof mahsulotlarning jami ishlab chiqarilgan milliy daromadni tashkil etadi."
        ]
    },
    {
        "word": "Sof Majburtyatlar",
        "type": [],
        "definition": [
            "birlikning hisobot davrida aktivlariga nisbatan majburiyatlari ko'payganligini bildiradi."
        ]
    },
    {
        "word": "Sof Milliy Daromad",
        "type": [],
        "definition": [
            "mamlakat rezident birliklarining yangitdan yaratgan daromadidir."
        ]
    },
    {
        "word": "Sof Milliy Mahsulot (Smm)",
        "type": [],
        "definition": [
            "yalpi milliy mahsulotning amortizatsiya qiymatiga kamaytirilgan miqdori, yoki YaMM - amortizatsiya = SMM. Amortizatsiya daromadga qo'shilmaydi, u shuni bildiradiki, YaMMning bir qismi ishlab chiqarishda ishlatiladigan mashina va uskunalar qiymatini kelajakda qoplash uchun olib ko’rilishi lozim"
        ]
    },
    {
        "word": "Sof Raqobat",
        "type": [],
        "definition": [
            "qarang: mukammal raqobat"
        ]
    },
    {
        "word": "Sof Raqobat Bozori",
        "type": [],
        "definition": [
            "yakka sotuvchi yoki sotib oluvchi joriy bahoga katta ta’sir ko'rsata olmaydigan, jarayondagi sotuvchi va xaridorlar yig'indisi."
        ]
    },
    {
        "word": "Sof Soliqlar",
        "type": [],
        "definition": [
            "soliqlardan subsidiyalami ayirish orqali topiladi"
        ]
    },
    {
        "word": "Sof Tushum",
        "type": [],
        "definition": [
            "tovarlar (ishlar, xizmatlar) narxida hisobga olinadigan qo'shilgan qiymat solig'i, aksiz solig'i hamda transport vositalariga benzin, dizel yoqilg'isi va gaz ishlatganlik uchun olinadigan soliq summalarini kiritmagan holda tovarlarni (ishlarni, xizmatlarni) realizatsiya qilishdan olingan tushum\/"
        ]
    },
    {
        "word": "Soliq_",
        "type": [],
        "definition": [
            "majburiy to'lov. Soliqningmohiyati, rolivatarkibijamiyatning iqtisodiy va siyosiy tizimi, davlatning iqtisodiy-ijtimoiy tabiati va funksiyalariga ko'ra belgilanadi. Davlat budjeti daromadlarining asosiy manbai soliqlardir. Masalan, aksiz, daromad, transport soliqlari va hokazo"
        ]
    },
    {
        "word": "Soliq. Asosi (Negizi, Bazasl)",
        "type": [],
        "definition": [
            "umumiy holda belgilangan soliqqa tortish davri mobaynida ma’lum hududdagi soliq to'lovchilar va soliqqa tortish obyektlarining yig'indisi"
        ]
    },
    {
        "word": "Soliq, Badallari (Toʻlovlari)",
        "type": [],
        "definition": [
            "soliq qonunchiligi bo'yicha belgilangan tartibda va muddatda soliq to'lovchilar tomonidan to'lanadigan, hisoblangan yoki qat’iylashtirilgan summalardir. Ularni hisoblash tartibi har bir soliq turi bo'yicha qonunga binoan aniqlanadi."
        ]
    },
    {
        "word": "Soliq Badallari (Toʻlovlari)",
        "type": [],
        "definition": [
            "soliq qonunchiligi bo'yicha belgilangan tartibda va muddatda soliq to'lovchilar tomonidan to'lanadigan, hisoblangan yoki qat’iylashtirilgan summalar. Ularni hisoblash tartibi har bir soliq turi bo'yicha qonunga binoan aniqlanadi."
        ]
    },
    {
        "word": "Soliq, Bitimlari",
        "type": [],
        "definition": [
            "bir mamlakat yuridik va jismoniy shaxslarining ikkinchi mamlakatda olgan daromadlarining ayrim turlarini va boshqa mamlakat hududida joylashgan shu shaxslarning molmulkini soliqqa tortish huquqini har bir mamlakatga biriktirishga mo'ljallangan mamlakatlar o'rtasidagi o'zaro soliq munosabatlarini tartibga solishga yo'naltirilgan yuridik hujjat. Amaliyotda soliq bitimlarining ikki turi uchraydi: l) maxsus (cheklangan) soliq bitimlari - ular cheklangan xarakterdagi masalalarni (xalqaro yuk tashish, bojxona to'lovlari, imtiyozli soliq rejimi va shu kabilar; 2) umumiy soliq bitimlari. Soliq bitimlari imzolanayotganda davlatlar quyidagi asosiy vazifalarni yechishga harakat qiladilar: ikki marta soliqqa tortishga barham berish sxemasini aniqlash-o'zaro kelishayotgan davlatlar uchun faqat u yoki bu daromaddan soliq undirish huquqi biriktiriladi; har ikkala davlatda soliqqa tortish huquqi saqlanib qolganda ham ikki marta soliqqa tortish mexanizmigabarham berish; soliqto'lovchiniboshqamamlakatlarda diskriminatsion tarzda soliqqa tortilishidan himoya qilish; soliqqa tortishdan bo'yin tovlashni aniqlash va konvensiyani bajarish maqsadida o'zaro informatsiya almashish. Bunda quyidagi to'rt guruh masalalar ko'rib chiqiladi: konvensiyaning qo'llanish doirasi; soliqlarni davlatlar o'rtasida taqsimlash; ikki marta soliqqa tortishga barham berish; harakat qilish qoidalari. Shu bitim bo'yicha tartibga solib turiladigan soliqlaming turlari va shaxslarning (yuridik va jismoniy) ro'yxati ham aniqlanadi."
        ]
    },
    {
        "word": "Soliq.davri",
        "type": [],
        "definition": [
            "soliq bazasi (negizi, asosi)ning shakllanish jarayoni tugaydigan muddat. Bu muddatda soliq majburiyatining yakuniy hajmi (miqdori) aniqlanadi. Qonun tomonidan belgilangan soliqqa tortish davri davomida bir obyekt soliqning bir turi bo'yicha bir marta soliqqa tortilishi mumkin"
        ]
    },
    {
        "word": "Soliq. Deklaratsiyasi",
        "type": [],
        "definition": [
            "soliq to'lovchining muayyan vaqt davomida topgan daromadi miqdorini ko'rsatuvchi hujjat. Ushbu hujjatda daromadining miqdori va manbalarini aniq qilib ko'rsatadi. Olinadigan soliq deklaratsiyaga qarab belgilanadi. Soliq deklaratsiyasida soliq miqdori naqadar to'g'ri ko'rsatilganligini soliq inspeksiyasi nazorat qiladi. O'zbekistonda qabul qilingan soliq to'g'risidagi qonunga binoan har bir fuqaro yilning oxirida soliq deklaratsiyasini to'ldirishi zarurligi qayd etilgan."
        ]
    },
    {
        "word": "Soliq. Elementlari",
        "type": [],
        "definition": [
            "davlatning qonun aktlari asosida aniqlangan soliqlarning tuzilishi (qurilishi) prinsiplari va ularni undirishni tashkil qilish, soliqlarning ijtimoiy-iqtisodiy mohiyatini o'zida aks ettiradi. Soliqlarning elementlari tarkibiga quyidagilar kiradi: l) soliq subyekti (soliq to'lovchi); 2) soliqni o'zida tashuvchi (namoyon etuvchi); 3) soliq obyekti; 4) soliq manbai; 5) so liqqa tortish birligi; 6) soliq stavkasi (soliqqa tortish normasi, me’yori); 7) soliq imtiyozlari; 8) soliq okladi. Soliq qonunchiligi nuqtainazaridan yuqorida sanab o'tilganlardan tashqari soliqning muhim elementlari qatoriga yana quyidagilarni kiritish mumkin: l) soliq masshtabi; 2) soliqqa tortish bazasi (asosi, negizi)ni hisobga olish usuli; 3) soliq davri; 4) soliqni hisoblash tartibi; 5) hisobot davri; 6) soliqni to'lash muddatlari; 7) soliqni to'lash usuli va tartibi."
        ]
    },
    {
        "word": "Soliq. Hisob-Kitoblari",
        "type": [],
        "definition": [
            "yuridik shaxslar tomonidan qonunda ko'zda tutilgan muddatlarda buxgalteriya hisoboti bilan birgalikda soliq organlariga taqdim etilib, o'zida ma’lum hisobot davri mobaynida to'lanishi lozim bo'lgan, hisoblangan to'lovlar summasini aks ettiradi. Soliq summalarini hisoblash tartibi soliq qonunchiligiga ko'ra har bir soliq turi bo'yicha alohida-alohida belgilanadi"
        ]
    },
    {
        "word": "Soliq, Huquqi",
        "type": [],
        "definition": [
            "soliqlarni belgilash, amalga oshirish, undirish va ular bilan bog'liq bo'lgan ixtisoslashgan maxsus davlat nazoratini amalga oshirish jarayonida yuzaga keladigan iqtisodiy-huquqiy munosabatlar majmuyidir."
        ]
    },
    {
        "word": "Soliq,Imtiyozi",
        "type": [],
        "definition": [
            "soliq to'lovchi soliq majburiyatlari hajmining to'liq yoki qisman qisqarishi, to'lov muddatining kechiktirilishi yoki orqaga surilishi. Soliqlarning rag'batlantiruvchi funksiyasi soliq imtiyozlari tizimi orqali amalga oshiriladi. Soliq imtiyozi soliqqa tortish obyektining o'zgarishida, soliqqa tortish bazasining kamayishida (qisqarishida), soliq stavkalarining pasaytirilishida va boshqalarda o'z ifodasini topadi. Soliqqa tortilmaydigan obyekt minimumi, alohida shaxslar va soliq to'lovchilarning ayrim toifalarini soliq to' lashdan ozo d qilish, soliqqa tortish obyektidan ayrim elementlarni chiqarish, soliq stavkalarini pasaytirish, maqsadli soliq imtiyozlari, soliq kreditlari (soliqlarning undirilishini kechiktirish) va boshqalar soliq imtiyozlarining ko'rinishlari (turlari) dir. Masalan, korxonalar foydasidan olinadigan soliq bo'yicha imtiyozlar ishlab chiqarishni kengaytirish va uy-joy qurilishini rivojlantirish xarajatlarini moliyalashtirish, tadbirkorlikning kichik shakllarini, nogironlar va pensionerlarning bandligini ta’minlash, ijtimoiy-madaniy va tabiatni muhofaza qilish sohalarini rag' batlantirishga qaratilgandir. Individual xarakterga ega bo'lgan soliq imtiyozlarini berish, odatda, ta’qiqlanishi kerak."
        ]
    },
    {
        "word": "Soliq, Inspektsiyalari",
        "type": [],
        "definition": [
            "Davlat soliq qo'mitasiing yagona tizimi tarkibiga kiruvchi tuzilmaviy birlik. Ularning tarkibiy tuzilishi funksional belgiga ko'ra aniqlanadi. Buning asosi sifatida turli belgilar: mulkchilik shakli, xo'jalik faoliyatining turi, to'lovlar hajmi, soliqlarning turlari va h.k.lar olinishi mumkin. Fuqarolarning faoliyati ustidan nazoratni amalga oshirish uchun soliq inspektsiyasi nazorati ostida bo'lgan hudud uchastkalarga bo'linadi."
        ]
    },
    {
        "word": "Soliq, Islohoti",
        "type": [],
        "definition": [
            "soliq tizimini qayta ko'rish va uni yangilash, moliyaviy munosabatlarning o'zgarishi tufayli yuzaga keladi."
        ]
    },
    {
        "word": "Soliq, Kanikullari",
        "type": [],
        "definition": [
            "korxonalarning samarali ishlaganliklari uchun yoki boshqa sabablarga ko'ra davlat tomonidan beriladigan imtiyozlar davri. Bu davrda ular soliqlardan ozod qilinadi."
        ]
    },
    {
        "word": "Soliq, Krediti",
        "type": [],
        "definition": [
            "budjetga to'lanishi lozim bo'lgan soliq summasini ma’lum muddatga kechiktirish, bo‘lib-bo‘lib to'lash yoki soliqni qaytarish shakli."
        ]
    },
    {
        "word": "Soliq. Kvotasi",
        "type": [],
        "definition": [
            "soliqqa tortishning ma’lum birligidan olinadigan soliqning miqdori, hajmi, o'lchami."
        ]
    },
    {
        "word": "Soliq. Mexanizmi",
        "type": [],
        "definition": [
            "soliqqa tortish bilan bog'liq bo'lgan soliqlarning tashkil qilishning barcha elementlari, usullar vatamoyillar yig'indisi tushuniladi. Bunday elementlarga soliq obyekti, subyekti, manbai, stavkasi, to'lov muddatlari, soliq huquqi va hujjatlari kiradi."
        ]
    },
    {
        "word": "Soliq Nazorati",
        "type": [],
        "definition": [
            "yuridik va jismoniy shaxslar tomonidan soliqlar va boshqa majburiy to'lovlarning to'liq va o'z vaqtida to'lanishini ta’minlash ustidan amalga oshiriladigan nazorat. Nazorat tekshiruv ishlarini amalga oshirish davomida bevosita korxonaning o'zida (hujjatli tekshiruv) yoki korxona tomonidan belgilangan muddatlarda taqdim etiladigan va soliq organi ixtiyoriga kelib tushadigan bank hujjatlari, buxgalteriya hisobotlari va hisobkitoblari asosida (kameral tekshiruv) amalga oshirilishi mumkin. Korxonalar ustidan doimiy nazorat soliq organlarida har bir soliq turi va boshqa majburiy to'lovlarni hisoblash va kelib tushish ustidan operativ buxgalteriya hisobini joriy etish orqali erishiladi."
        ]
    },
    {
        "word": "Soliq Obyekti",
        "type": [],
        "definition": [
            "soliq solinadigan daromad yoki mol-mulk"
        ]
    },
    {
        "word": "Soliq. Ogʻirligi (Yuki)",
        "type": [],
        "definition": [
            "davlat va jamiyat hayotida soliqlarning rolini xarakterlab (ko'rsatib) beradigan eng umumlashgan ko'rsatkich. Ishlab chiqarishning umumiy hajmi va daromadlarda soliq ajratmalari va bozor iqtisodiyotining salmog'ini (hissasini) ko'rsatuvchi, bozor iqtisodiyotining amalga oshirilayotgan modelidan kelib chiqadigan o'lcham. Soliq yig'imlarining jami milliy mahsulotga nisbati bilan aniqlanadi."
        ]
    },
    {
        "word": "Soliq Organlari",
        "type": [],
        "definition": [
            "soliq qonunchiligiga rioya qilish, mamlakatning qonunlariga muvofiq belgilangan (o'rnatilgan) soliqlar va boshqa majburiy to'lovlarning to'g'ri hisoblanishi, ularning to'liq va o'z vaqtida budjetga o'tkazilishi ustidan nazoratni ta’minlovchi yagona mustaqil markazlashtirilgan tizim. Davlat soliq qumitasining yagona tizimiga kiruvchi soliq organlari davlat boshqaruvining markaziy organi (Davlat soliq qo'mitasi), viloyat, tuman va shahar soliq inspeksiyalaridan iboratdir. Soliq organlari yuridik shaxs hisoblanib, o'z nomiga o'zlarining mustaqil xarajatlar smetasiga, banklardagi joriy schyotiga va o'z muhriga egadir."
        ]
    },
    {
        "word": "Soliq, Qarzi",
        "type": [],
        "definition": [
            "soliqlar va boshqa majburiy to'lovlar bo'yicha qarz summasi, shu jumladan ushbu soliq kodeksida belgilangan muddatda to'lanmagan moliyaviy sanksiyalar"
        ]
    },
    {
        "word": "Soliq. Qonunchiligi",
        "type": [],
        "definition": [
            "davlatda soliqlarning turi, ularni undirish mexanizmi va soliq majburiyatlarining vujudga kelishi, o'zgarishi va to'xtatilishini tartibga solib turuvchi yuridik me’yorlar yig'indisi; moliyaviy huquq instituti. Soliq huquq davlatning ijtimoiy-iqtisodiy tuzilishi (qurilishi), uning vazifa va funksiyalari bilan belgilanadi"
        ]
    },
    {
        "word": "Soliq. Qonunchiligi Buzilganda Qoʻllaniladigan Jazolar (Sanksiyalar)",
        "type": [],
        "definition": [
            "intizomsiz soliq to'lovchilarga nisbatan soliq qonunchiligi buzilganda beriladigan jazolardir. Ular uch xil bo'ladi: ma’muriy, moliyaviy va jinoiy."
        ]
    },
    {
        "word": "Soliqsiyosati",
        "type": [],
        "definition": [
            "davlatning soliq sohasidagi barcha tadbirlarini rejalashtirish, qonun, farmon va qarorlar ijrosini ta’minlash hamda uni tashkil qilishdagi ishlab chiqilgan chora-tadbirlar yig'indisidir"
        ]
    },
    {
        "word": "Soliq, Solishning Soddalashtirilgan Tartibi",
        "type": [],
        "definition": [
            "soliq solishning ayrim toifadagi soliq to'lovchilar uchun belgilanadigan hamda ayrim turdagi soliqlarni hisoblab chiqarish va to'lashning, shuningdek, ular yuzasidan soliq hisobotini taqdim etishning maxsus qoidalari qo'llanilishini nazarda tutuvchi alohida tartibi."
        ]
    },
    {
        "word": "Soliq, Stavkasi",
        "type": [],
        "definition": [
            "soliqqa tortish birligiga to'g'ri keluvchi soliqning hajmi (miqdori, darajasi). Qat’iy soliq stavkalari daromadlarga bog'liq bo'lmagan holda soliqqa tortish birligiga nisbatan absolyut summalarda o'rnatiladi. Proporsional stavkalar daromadning hajmiga (miqdoriga) bog'liq bo'lmagan holda unga nisbatan bir xil foizlarda belgilanadi. Progressiv soliq stavkalari soliqqa tortiladigan daromad hajmining ortishi bilan oshib boradi. Regressiv soliq stavkalari esa, aksincha, daromadning ortib borishi bilan pasayadi."
        ]
    },
    {
        "word": "Soliq, Tizimi",
        "type": [],
        "definition": [
            "davlat budjetiga undiriladigan soliqlar turi majmuyi, ularni yig'ib olish pullari va usullarni tashkil etish tushuniladi. Unga soliq turlari, soliq imtiyozlari, soliq stavkasi, soliq undiriladigan daromadlarni aniqlash kabilar kiradi. Soliq tizimining asosiy vazifalari quyidagilardan iborat: a) soliq to'lovchilar bilan davlat o'rtasida daromadlarni taqsimlash va qayta taqsimlash; b) ma’lum sohadagi faoliyatni rag'batlantirish yoki cheklab qo'yish; d) aholining muayyan tabaqalariga ijtimoiy imtiyozlar berish."
        ]
    },
    {
        "word": "Soliq, Toʻlangungacha Olingan Foyda",
        "type": [],
        "definition": [
            "umumxo'jalik faoliyatidan olingan foyda plyus favqulodda (ko'zda tutilmagan) vaziyatlardan ko'rilgan foyda va minus zararlar sifatida aniqlanadi."
        ]
    },
    {
        "word": "Soliq. Toʻlovchilar",
        "type": [],
        "definition": [
            "qonun hujjatlariga ko'ra soliq to'lash majburiyati yuklangan jismoniy va yuridik shaxslar hamda to'lovchilarning boshqa toifalari."
        ]
    },
    {
        "word": "Soliq Toʻlovchilarni Hisobga Olish (Qayddan Oʻtkazish)",
        "type": [],
        "definition": [
            "ularni xo'jalik yurituvchi subyektning identifikatsiyalashuvini ta’minlaydigan soliq to'lovchining Davlat reestriga kiritish orqali amalga oshiriladi. Soliq to'Iovchilar majburiy ravishda soliq organlarida hisobdan (qayddan) o'tishi shart. Bunda bank va boshqa kredit tashkilotlari soliq to'Iovchilar tomonidan ularning soliq organlarida hisobdan (qayddan) o'tganligini tasdiqlovchi ma’lumotnomani taqdim etganlaridan so'nggina ularga hisob-kitob va boshqa hisob varaqlarini ochishi hamda belgilangan muddat ichida ularga (soliq to'lovchilarga) xabar berishi kerak. Ko'rsatilgan talablar bajarilmagan holda bank va boshqa kredit tashkilotlarining rahbarlari belgilangan tartibda ma’muriy jazoga tortiladilar."
        ]
    },
    {
        "word": "Soliq. Toʻlovchilarning Identifikatsion Raqami (Stir)",
        "type": [],
        "definition": [
            "soUq to'lovchining soliq idoralaridan ro'yxatdan o'tganligini ko'rsatuvchi dalildir. Bu raqam soliq to'lovchining tegishli hisobot va hisoblarini, boshqa hujjatlarini tez topishda yordam beruvchi sondir"
        ]
    },
    {
        "word": "Soliq. Toʻxtatuvchanligi (Tosqinchiligl)",
        "type": [],
        "definition": [
            "soliq progressiyasining noproporsionalligi bilan xarakterlanadigan soliqqa tortish tizimi. Ma’lum darajadan yuqoridagi daromadlarga yanada yuqoriroq (ko'proq) soliq o'rnatiladi. Buning natijasida yuqori daromadga ega bo'lish foydasiz bo'lganligi uchun tijoriy faoliyat susayadi (pasayadi)"
        ]
    },
    {
        "word": "Soliq. Tushumlari",
        "type": [],
        "definition": [
            "Moliya vazirligi tomonidan tasdiqlangan budjet daromadlari va xarajatlari klassifikatsiyasining daromadlari qismidagi har bir soliq va boshqa majburiy to'lovlarga mo'ljallangan qism, band, kod va moddaga muvofiq vakolatli banklarning hisobkitob schyotiga yoziladigan, hisoblangan va haqiqatda kelib tushgan soliq badallari (to'lovlari) va moliyaviy sanksiyalar."
        ]
    },
    {
        "word": "Soliq Tushumlarini Bashoratlash (Prognozlashtirish)",
        "type": [],
        "definition": [
            "aniq va miqdoriy jihatdan aniqlangan shaklda soliqtushumlarininghajmiga ta’sir ко'rsatuvchiobyektivvasubyektiv omillarni oldindan ko'rish va bilish instrumenti. Soliq tushumlarini bashoratlash perspektivxarakterdagi tadqiqot hisoblanib, uni ishlab chiqishda (yaratishda) real iqtisodiy shartlar va jarayonlar hisobga olinishiga qaramasdan u ehtimollik, dastlabkilik xarakteriga egadir. Mamlakatyokianiqbirmintaqaiqtisodiyvaijtimoiyrivojlanishining kompleks dasturi bashoratlashning asosidir. Shu bilan birgalikda bunda sodir bo'lishi mumkin bo'lgan cheklanish (og'ish)lar, hukmron tendensiya (oqim)lar va ularni farq qilish sohalarini aniqlashga ham e’tibor bermoq lozim. Bashoratlash shoshilinch (operativ, bir oygacha), qisqa muddatli (bir yilgacha), o‘rta muddatli (besh yilgacha) va uzoq muddatli (besh yildan ortiq) kabi turlarga bo'linishi mumkin. Xilma-xil davriy gorizontlarga (ufqlarga) ega bo'lgan istiqbolni belgilashning (bashoratlashning) mazmuni istiqboli belgilanayotgan jarayonlarning tabiati bilan belgilanadi: qanchalik barqarorlik bo'lsa, bashoratlash gorizonti (ufqi) shunchalik keng bo'ladi. Bashoratlash hisob-kitob qilinayotganda o'tgan davrlarda soliqlarning qanchalik tushib turganligini xarakterlaydigan haqiqatdagi dinamik qatorlar ham hisobga olinishi kerak."
        ]
    },
    {
        "word": "Soliq, Yuki",
        "type": [],
        "definition": [
            "mablag'larni boshqa foydalanish mumkin bo'lgan yo'nalishlardan olib, soliqlarni to'lash uchun yo'naltirish orqali vujudga keladigan iqtisodiy cheklovlar darajasi bo'lib, odatda, soliq to'lovchining muayyan davrda budjetga to'langan soliqlar va boshqa majburiy to'lovlarning yig'indisi sifatida namoyon bo'ladi. Mamlakat miqyosida soliq yuki darajasi soliqlarning yalpi ichki mahsulotdagi salmog'i orqali ifodalanadi."
        ]
    },
    {
        "word": "Soliq Yukini Yengillashtirish",
        "type": [],
        "definition": [
            "soliqlarning foiz stavkalarini kamaytirish va imtiyozlar yaratish"
        ]
    },
    {
        "word": "Soliq, Yurisdiktsiyasi",
        "type": [],
        "definition": [
            "davlat soliq organlarining huquqiy masalalarni va soliq huquqbuzarligi to'g'risidagi ishlarni hal qilish bo'yicha qonunga binoan (yoki boshqa me’yoriy hujjatga ko'ra) belgilangan vakolatlari yig'indisi. Bu vakolatlar ikki me’zon bo'yicha aniqlanadi: l) rezidentlik; 2) hududiylik. Bular, o'z navbatida soliqqa tortiladigan daromadlarning tarkibini aniqlab beradi. Barcha mamlakatlarda bu me’zonlami qo'llashda yagonalik bo'lmaganligi uchun ikki marta soliqqa tortish muammosi vujudga keladi. Me’zonlarni tanlash har bir mamlakatning milliy manfaatlari bilan bog'liqdir. Ayrim mamlakatlar amaliyotida bu me’zonlarni turli variantlarda kombinatsiya qilib qo'llash keng tarqalgan. Masalan, AQSH va Buyuk Britaniyada asos sifatida rezidentlik me’zoni olinsa-da, u mamlakatlarning aniq manfaatlariga bog'liq ravishda hududiylik mezoni bilan to'ldirilgan. Lotin Amerikasi mamlakatlarida esa soliq yurisdiktsiyasi ustuvorlik bilan hududiylikme’zonini qo‘llash orqali amalga oshiriladi. Bu tartib Fransiya, Shveytsariya va boshqa mamlakatlarning soliq amaliyotida ham muhim ahamiyat kasb etgan."
        ]
    },
    {
        "word": "Soliqlar",
        "type": [],
        "definition": [
            "davlatning korxona va tashkilotlardan hamda aholidan undiradigan pul mablag'laridir. Soliq ikki vazifani o'taydi: fiskal va iqtisodiy. Uning fiskal vazifasi asosiy bo'lib, u hamma davlatlarga xos. U davlat pul daromadlarini shakllantirishi va davlat harakati uchun moddiy asos yaratishdan iboratdir. Iqtisodiy vazifasi soliqlar ishlab chiqarishni tartibga soluvchi vosita sifatida qo'llashda namoyon bo'ladi. Uning yordamida iqtisodiy o'sish sur atlarini tiyib turish yoki rag'batlantirish kapital jamg'arishni ko'paytirish yoki susaytirish, aholining to' lashga qodir talabini o'stirish yoki kamaytirish mumkin. Iqtisodiy mohiyatiga ko'ra soliqlar to'g'ri va egri soliqlarga bo'linadi. To'g'ri soliqlar to'g'ridan-to'g'ri ochiq daromad yoki mulklarga solinadi. Bu turdagi soliqlarga korxona va tashkilotlardan olinadigan daromad solig'i, mol-mulk daromadi, aholidan daromad solig'i va boshqalarni misol qilib ko'rsatish mumkin. Egri soliqlar tovar molmulki narxidan qimmatga, ustiga qo'yib sotish yordamida davlat xazinasiga kelib tushadigan soliqlardir. Masalan, aksizlar, bojlar va boshqalar."
        ]
    },
    {
        "word": "Soliqlar Klassifikatsiyasi",
        "type": [],
        "definition": [
            "soliqlarning undirilish uslubi, qo'llaniladigan stavkalarning xarakteri, soliq imtiyozlari, soliqqa tortish manbai va obyekti kabibelgilar bo'yicha guruhlarga ajratilishi (bo'linishi). Belgilanish uslubiga ko'ra soliqlar to'g'ri (bevosita) va egri (bilvosita) soliqlarga bo'linadi. Daromad solig'i, foyda solig'i, resurs to'lovlari va mol-mulk solig'i kabilar to'g'ri (bevosita) soliqlardir. Egri (bilvosita) soliqlar xo'jalik aktlari va aylanmalari, moliyaviy operatsiyalarni amalga oshirishdan vujudga keladi. Qo'shilgan qiymat solig'i, boj to'lovlari, aksizlar, qimmatbaho qog'ozlar bo'yicha operatsiyalardan olinadigan soliq va boshqalar ana shular jumlasidandir. Soliqqa tortish manbalari bo'yicha ham soliqlar guruhlanadi: ishlab chiqarish xarajatlarining (tannarx) ning tarkibiga kiruvchi, foyda (daromad) dan olinuvchi va boshqa soliqlar. Soliqqa tortish obyektlari bo'yicha soliqlar klassifikatsiya qilinganda ular quyidagi guruhlarga bo'linadi: mulk soliqlari, resurs soliqlari (er solig'i ham shu guruhga kiradi), daromad yoki foyda solig'i, harakat soliqlari (xo'jalik aktlari, moliyaviy operatsiyalar, realizatsiya bo'yicha aylanmalar, bazi bir qolgan soliqlar va bir martalik yig'imlardan iborat bo'Igan soliqlar."
        ]
    },
    {
        "word": "Soliqlar Va Boshqa Majburiy Toʻlovlarning Toʻgri Hisoblanishi Hamda Toʻlanishi Ustidan Soʻnggi Nazorat",
        "type": [],
        "definition": [
            "davlattomonidansoliqorganlariyordamida ikki bosqichda amalga oshiriladi: a) korxonalardan buxgalteriya hisobotlari va soliq hisob-kitoblari qabul qilinayotganda; b) bevosita korxonaning o'zida boshlang'ich buxgalteriya hujjatlarini tekshirish yo'li bilan."
        ]
    },
    {
        "word": "Soliqlarni Unifikasiya Qilish",
        "type": [],
        "definition": [
            "soliq mexanizmini soddalashtirish maqsadida iqtisodiy mohiyati, soliqqa tortish obyekti o'xshash bo'lgan soliq turlarini birxillashtirish"
        ]
    },
    {
        "word": "Soliqlarning Fiskal Funksiyasi",
        "type": [],
        "definition": [
            "soliqlarning eng asosiy ijtimoiy mo'ljallanganligini o'zida aks ettiradi, davlatning moliyaviy natijalarini shakllantiradi, uning o'z funksiyalarini bajarishi uchun zarur bo'lgan resurslarni budjet tizimi va nobudjet fondlarga to'plash imkonini beradi."
        ]
    },
    {
        "word": "Soliqlarning Funksiyalari",
        "type": [],
        "definition": [
            "shu iqtisodiy kategoriyaning daromadlarni qiymat jihatidan taqsimlash va qayta taqsimlash instrumenti sifatida ijtimoiy mo'ljallanganligining qay darajada amalga oshirilayotganligini ko'rsatadi. Soliqlar quyidagi funksiyalarni bajaradi: fiskal, tartibga solish (rag'batlantirish)."
        ]
    },
    {
        "word": "Soliqlarning Tartibga Solish (Ragʻbatlantirish) Funksiyasi",
        "type": [],
        "definition": [
            "moliyaviy (soliq) mexanizm (i) orqali davlatning mamlakat ijtimoiy hayotida faol ishtirok etishini ta’minlaydi. Bu funksiyaning quyidagi bir necha shakllari bo'lishi mumkin: nazorat; rag'batlantirish; tartibga solish; takror ishlab chiqarish. Ular soliq mexanizmining samaradorligini baholash imkonini beradi, moliyaviy resurslarning harakati ustidan nazoratni ta’minlaydi, soliq tizimi va budjet siyosatiga o'zgartirish kiritish zarurligini aniqlaydi. Rag'batlantirish imtiyozlar, cheklashlar, chegirmalar, afzal ko'rish tizimi orqali amalga oshiriladi va ular soliqqa tortish obyektining imtiyozlarni shakllantirish belgilari bilan uzviy ravishda bog'liq bo'ladi, soliqqa tortish obyektining o'zgarishida, soliqqa tortiladigan baza (asos)ning kamayishida, soliq stavkasining pasaytirilishida va shu kabilarda namoyon bo'ladi. Takror ishlab chiqarish tabiiy resurslardan foydalanganlik uchun to'lovlarda, yo'l fondlari uchun olinadigan soliqlarda, mineral xomashyo bazalarini takror ishlab chiqarishga mo'ljallangan soliqlarda namoyon bo'ladi."
        ]
    },
    {
        "word": "Soliqlarning Turlari",
        "type": [],
        "definition": [
            "O'zbekiston hududida olinadigan umumdavlat soliqlari, mahalliy soliqlar va yig'imlardan iborat. Umumdavlat soliqlarining tarkibiga yuridik shaxslardan olinadigan daromad (foyda) solig'i, jismoniy shaxslardan olinadigan daromad solig'i, qo'shilgan qiymat solig'i, aksizlar, yer osti boyliklaridan, suv resurslaridan foydalanganlik uchun soliq kabilar kiradi. Mahalliy soliqlar va yig'imlar mol-mulk solig'i, yer solig'i, reklama solig'i, avtotransport vositalarini sotganlik uchun soliq, savdo-sotiq qilish huquqi uchun yig'im, shu jumladan, ayrim turdagi mahsulotlarni sotish huquqini beruvchi litsenziya yig'imlari, yuridik shaxslarni, shuningdek, tadbirkorlik faoliyati bilan shug'ullanuvchi jismoniy shaxslarni ro'yxatga olganlik uchun yig'im, avtotransport to'xtash joyidan foydalanganlik uchun yig'im, obodonlashtirish ishlari uchun yig'imlardan iboratdir."
        ]
    },
    {
        "word": "Soliqqa Tortish",
        "type": [],
        "definition": [
            "qonuniy ravishda o'rnatilgan soliq undirish (olish) tartibi. Iqtisodiyotni tartibga solish soliqqa tortishning asosiy funksiyasidir. Soliq siyosatining richaglari yordamida davlat xo'jalik kon’yunkturasining holatiga tasir ko'rsatadi va iqtisodiy o'sishni rag'batlantiradi. Soliqqa tortishning boshqa bir funksiyasi pul mablag'larini qayta taqsimlashdir. Soliqqa tortishning bir-biridan farq qiluvchi digressiv, progressiv, proporsional va regressiv turlari mavjud."
        ]
    },
    {
        "word": "Soliqqa Tortish Manbai",
        "type": [],
        "definition": [
            "soliqlarni to'lash uchun foydalaniladigan rezerv, odatda, soliq to'lovchining daromadi va kapitali. Engumumiy shaklda soliqqa tortish manbai bo'lib soliqqa tortish obyektidan qat’iy nazar ijtimoiy takror ishlab chiqarish asosiy qatnashchilarining va davlatning birlamchi pul daromadlarini shakllantiruvchi yalpi ijtimoiy (ichki) mahsulot hisoblanadi"
        ]
    },
    {
        "word": "Soliqqa Tortish Nazariyalari",
        "type": [],
        "definition": [
            "soliqqa tortish amaliyotini nazariy jihatdan asoslashga urinish. Soliqqa tortish nazariyasi tarixida eng dolzarb muammo sifatida quyidagi savollarning javobini izlab topish sanaladi: budjet daromadlarini shakllantirishda sof fiskal usullardan foydalanish maqsadga muvofiqmi yoki soliqlarni pasaytirish orqali tadbirkorlik faoliyatini rag'batlantirish va soliqqa tortish bazasini kengaytirish kerakmi? Bularning qaysi biri afzal? Qaysi biri maqsadga muvofiq? Va hokazo."
        ]
    },
    {
        "word": "Soliqqa Tortish Normasi",
        "type": [],
        "definition": [
            "soliqqa tortiladigan qiymatning haqiqiy qiymatga nisbati."
        ]
    },
    {
        "word": "Soliqqa Tortish Obyektlari",
        "type": [],
        "definition": [
            "qonunga muvofiq foyda (daromad), ma’lum bir mahsulotlar qiymati, yuridik va jismoniy shaxslarning mulki, mol-mulkni berish (meros, hadya etish), qimmatbaho qog'ozlar bo'yicha operatsiyalar, faoliyatning ayrim turlari va boshqalardan iborat. Soliqqa tortishning bir obyekti bir turdagi soliq bilan belgilangan muddatda (oy, chorak, yarim yil, yil) bir marta soliqqa tortilishi mumkin."
        ]
    },
    {
        "word": "Soliqqa Tortish Prinsiplari (Tamoyillari)",
        "type": [],
        "definition": [
            "soliq siyosatini amalga oshirishni belgilab beradigan va soliqlar bo'yicha budjet topshiriqlarini tuzish orqali realizatsiya qilinadigan mustahkam o'rnashib qolgan qoidalar yig'indisi. Ularning eng muhimlari qatoriga quyidagilar kiradi: l) adolatlilik. Bu prinsip fuqarolar o'rtasida ularning daromadlariga mos ravishda soliqlarning bir tekis taqsimlanishini va soliqqa tortishning hammaga (eng umumiyligini) tegishli ekanligini taqozo etadi; 2) aniqlilik. Bu prinsip soliqning summasi, uni hisoblash tartibi (uslubi) va to'lov vaqti soliq to'lovchiga oldindan aniq ma’lum bo'lishi kerakligini talab qiladi; 3) qulaylilik. Bu prinsip soliq to'lovchilar uchun soliqning olinish uslubi (tartibi) va vaqti eng qulay bo'lishi kerakligini anglatadi; 4) iqtisod qilish, tejab-tergash. Bu prinsipning mazmuni soliqqa tortish tizimini oqilonalashtirish va soliqlarni undirish xarajatlarini kamaytirishdan iboratdir. Vaqt o'tishi bilan soliqqa tortishning bu prinsiplari qatoriga soliqlarning harakatchanligi va yetarliligini ta’minlash (davlatning obyektiv ehtiyojlari va imkoniyatlariga muvofiq soliq oshirilishi yoki qisqartirilishi (kamaytirilishi) mumkin), soliqqa tortishning zaruriy manbasi va obyektini tanlash, soliqqa tortishning bir martaliligi kabi prinsiplar ham qo'shildi."
        ]
    },
    {
        "word": "Soliqqa Tortish Tizimi",
        "type": [],
        "definition": [
            "qonun chiqaruvchi idoralar tomonidan belgilangan va ijrochi idoralar tomonidan undiriladigan soliqlarning tashkil etish usullari, elementlari va tamoyillari yig'indisiga aytiladi"
        ]
    },
    {
        "word": "Soliqqa Tortishning Maqbulligi",
        "type": [],
        "definition": [
            "to'lovchining muddatlari, turi va summalari har bir kishiga, ya’ni ham soliq to'lovchilarga, ham soliq oluvchilarga tushunarli bo'lishi kerak."
        ]
    },
    {
        "word": "Soliqqa Tortishning Tengligi",
        "type": [],
        "definition": [
            "soliq to'lovchilar soliqlarni o'z imkoniyatlariga, ya’ni ularning davlat yordamida olingan daromadlariga bog'liq holda to'lashi lozim. Boshqacha qilib aytganda, imkoniyatlardan kelib chiqib soliq to'lashi kerak."
        ]
    },
    {
        "word": "Solon",
        "type": [],
        "definition": [
            "(taxm. m.a. 640\/635-559) - Yunoniston siyosiy arbobi, islohotlar o'tkazgan. Qullarni qarzga berishni man etgan (chet elliklar bundan mustasno)."
        ]
    },
    {
        "word": "Somuelson Pol",
        "type": [],
        "definition": [
            "amerikalik iqtisodchi, Nobel mukofoti sovrindori (1970), neoklassik sintezi nazariyasi asoschisi. U keynschilik va neoklassik nazariyasini qo'shishga harakat qilgan. Davlat iqtisodiyot uchun maqsadlarni aniqlashni o'z zimmasiga olishi va bu maqsadlarga erishish uchun o'z kuchidan foydalanishi kerak ammo shu bilan birga davlat iqtisodiy tanazzul davrida iqtisodiyotni tartibga solmog'i zarur, iqtisodiy o'sish davrida esa uni susaytirish lozim, deb hisoblaydi"
        ]
    },
    {
        "word": "Sotib Olish Soligʻi",
        "type": [],
        "definition": [
            "davlat daromadlarini ko'paytirish yoki ayrim mahsulotlarni ishlab chiqarishni cheklab qo'yish maqsadida mamlakatda ishlab chi qarilay otgan ayrim mahsulotlardan olinadigan soliq. Odatda eksportga mo'ljallangan mahsulotlardan olinmaydi."
        ]
    },
    {
        "word": "Sotib Oluvchi Narxi",
        "type": [],
        "definition": [
            "bu narx sotib oluvchi tomonidan to'lanadi, ammo QQS yoki ana shunga o'xshash soliqlar bundan istisnodir. Sotib oluvchi narxi barcha transport xarajatlarini o'z ichiga oladi. Sotib oluvchi tomonidan alohida to'lanadigan bu chiqim xarid qilingan narsa shartlashilgan furs at da belgilangan joyga yetkazib berilishini ko'zda tutadi."
        ]
    },
    {
        "word": "Sotilgan Mahsulotlar",
        "type": [],
        "definition": [
            "l) korxona tomonidan ishlab chiqarilgandan so'ng sotilgan, pullangan mahsulot; 2) ta’minot yoki savdo tashkiloti, iste’molchi to'lagan tovar mahsulotining pul ko'rinishidagi ko'rsatkichi."
        ]
    },
    {
        "word": "Sotish (Xarid) Narxi",
        "type": [],
        "definition": [
            "tovarga xaridor to'laydigan narx"
        ]
    },
    {
        "word": "Sotish Opsioni (Rut)",
        "type": [],
        "definition": [
            "o'z egasiga kelajakda bazis aktivini qimmatli qog'oz xosilasi shartlariga muvofiq sotish huquqini beradi."
        ]
    },
    {
        "word": "Sotish Sharti",
        "type": [],
        "definition": [
            "eksport narxlarining import narxlariga nisbati."
        ]
    },
    {
        "word": "Sotish Soligʻi",
        "type": [],
        "definition": [
            "mahsulotlarning sotish qiymatiga nisbatan foizlarda belgilanadigan va ishlab chiqaruvchilar tomonidan to'lanadigan soliq. Aksizlarning ko'rinishlaridan biri"
        ]
    },
    {
        "word": "Sotishdan Olinadigan Soliq",
        "type": [],
        "definition": [
            "ayrim xorijiy mamlakatlarda (masalan, AQSHning ayrim shtatlarida) qo'llaniladi va iste’moldan olinadigan egri (bilvosita) soliqni o'zida gavdalantiradi. Odatda, bu soliqqa iste’mol mahsulotlari (restoranlar bundan mustasno) tortilmaydi."
        ]
    },
    {
        "word": "Sotishni Ragʻbatlantirish",
        "type": [],
        "definition": [
            "iste’molchilarni xarid qilishga undash faoliyatidan farqli bo'lgan, sotish tarmogi ishi samaradorligini oshirishga qaratilgan marketing faoliyatidir. Bunday shakl sotuvlarni qisqa muddatli o'sishiga olib kelib, harakatlantirishning (ilgari surishning) yuqorida tilga olingan turlarini to'ldiradi."
        ]
    },
    {
        "word": "Sotsial Sugʻurta Ajratmalari",
        "type": [],
        "definition": [
            "korporatsiya tomonidan har bir mamlakatda qonun bilan belgilangan tartibda to' lanadigan majburiy sug'urta to'lovlardan iborat. Ishchi-xizmatchilarning ixtiyoriy ravishda sug'urta korporatsiyalariga to'lagan sug'urta badallari bunga kirmaydi. Ular joriy transfert sifatida qayta taqsimlash operatsiyalari hisoblanadi."
        ]
    },
    {
        "word": "Sotsial Taʼminot",
        "type": [],
        "definition": [
            "qariganda, nogironlik bo'yicha, boquvchisini yuqotganda va qonunda belgilangan boshqa holatlarda fuqarolarni moddiy ta’minlash uchun milliy daromadning bir qismini pul mablag' larining ijtimoiy fondini shakllantirish va undan foydalanish jarayoni bilan bog'liq bo'lgan taqsimlash munosabatlari tizimi."
        ]
    },
    {
        "word": "Sotuv Va Taqsimot",
        "type": [],
        "definition": [
            "sotuv va tovar harakati kanallarini tanlash. Tovar aylanmasi prognozi va uni rejalashtirish. Tovarni sotish usullarini aniqlash."
        ]
    },
    {
        "word": "Sotuvgacha Va Undan Keyingi Xizmat Koʻrsatish",
        "type": [],
        "definition": [
            "xaridorlarni turli ma’Iumotlar, detallar, mutaxassislar yordami, qulaylik va rangbarang xizmatlar bilan ta’minlash."
        ]
    },
    {
        "word": "Sponsor",
        "type": [],
        "definition": [
            "bironta tadbir yoki faoliyatni amalga oshirishda moliyaviy yordam ko'rsatuvchi puldor, obro'-e’tiborli shaxs, firma, korporatsiya, tashkilot va boshqalar"
        ]
    },
    {
        "word": "Spot",
        "type": [],
        "definition": [
            "naqd pul yoki valyuta oldi-sotdisi, sotilgan narsaning haqini darhol, narsaning o'zini esa xaridorga ertasigayoq berishni nazarda tutadigan kelishuv turi."
        ]
    },
    {
        "word": "Spot Operatsiyalari",
        "type": [],
        "definition": [
            "valyuta bitimi tuzilgandan so'ng, valyutalar ikki ish kunida kelib tushadigan operatsiyalar."
        ]
    },
    {
        "word": "Ssuda",
        "type": [],
        "definition": [
            "foiz to'lash sharti bilan qarzga berilgan pul mablag'lari. Masalan, tadbirkor bankdan 200 ming so'm ssuda oladi. U bir yilga 10 foiz sharti bilan berilgan, deb faraz qilamiz. Demak, tadbirkor bir yildan keyin 200 ming emas, balki 220 ming so'mni bankka qaytarishi shart. Aksariyat banklar korxonaning maqsadlari bo'yicha, ya’ni muayyan maqsadlarni moliyalash uchuy maqsadli ssuda beradi. Qisqa (1 yilgacha) va uzoq (bir necha yilga) muddatli ssudalar bor."
        ]
    },
    {
        "word": "Ssuda Foizi",
        "type": [],
        "definition": [
            "kapital egasiga uni kapitalidan foydalangani uchun iqtisodiy subyekt tomonidan to'lanadigan narx"
        ]
    },
    {
        "word": "Ssuda Kapitali",
        "type": [],
        "definition": [
            "qarzga berilgan pul ishga solinib, yangidan pul topish, daromad olish uchun ishlatilishidir."
        ]
    },
    {
        "word": "Ssudalarni Berish",
        "type": [],
        "definition": [
            "bank tomonidan qarz mablag'larini berish, tarqatish."
        ]
    },
    {
        "word": "Stabilizatsiya",
        "type": [],
        "definition": [
            "barqaror bo'lish, mustahkamlash, masalan, narx-navoning barqaror bo'lishi, pul muomalasining mustahkamlanishi"
        ]
    },
    {
        "word": "Stagflyatsiya",
        "type": [],
        "definition": [
            "(lot. stagno - “harakatni so'ndiraman” va inflatio- shishmoq”, “puflangan”) iqtisodiy tanglik bilan inflyatsiyaning birgalikda yuz berishidir. U ishlab chiqarishning turg'unlashtirilishi yoki pasayishi (stagnatsiya), o'sib boruvchi ishsizlik va inflyatsiya bilan xarakterlanadi. Shuningdek, stagflyatsiya ishlab chiqarish quwatlarining to‘la ishlatilmasligi investitsiya jarayonining sustlashuvi, ijtimoiy beqarorlik bilan ham xarakterlanadi. Stagflyatsiya g'arb mamlakatlarida 70 yillarda, SSSRda 80 yillarda yuz bergan. Bu holatdan chiqish uchun ishlab chiqarishni tashkil etish, investitsiya, texnika, texnologiya tizimini yangilash, ishlab chiqarish tarkibini o'zgartirish va boshqa bir qator tadbirlami amalga oshirish zarur"
        ]
    },
    {
        "word": "Stagnatsiya",
        "type": [],
        "definition": [
            "jamiyat va iqtisodiyotning o'ziga xos holati. Iqtisodiy jihatdan olib qaralsa, bunday vaziyatda ishlab chiqarish ko'lamining keskin pasayishi, ishsizlikning, inflyatsiyaning kuchayishi, aholi turmush darajasining pasayib ketishi, ijtimoiy tanglikning oshib ketish hollari kuzatiladi."
        ]
    },
    {
        "word": "Stajirovka-",
        "type": [],
        "definition": [
            "(ishlab chiqarishda, ilmiy-tadqiqot muassasasida, xorijda tajriba orttirish)magistraturamutaxassisligibo‘yichamaqsadlikasbiyta’lim o'quv reja va dasturlarini o'zlashtirish, magistratura talabalarida ilmiy-tadqiqot kompetensiyalarni shakllantirish maqsadida ta’limning fan va ishlab chiqarish bilan integratsiyasini rivojlantirish yo'li orqali magistrlarni eng yangi ilmiy-texnik rivojlanishdagi yutuqlar hamda iqtisod, fan, texnika, madaniyat va sog'liqni saqlash tarmoqlaridagi zamonaviy texnika va texnologiyalar bazasida ilmiy tadqiqot olib borishi."
        ]
    },
    {
        "word": "Standartlashtirish",
        "type": [],
        "definition": [
            "ishlab chiqarishning ma’lum bir sohasida faoliyatni tartibga solish maqsadida barcha manfaatdor tomonlar ishtirokida qoidalar belgilash va qo'llash. Normativ hujjatlar, standartlar, yo'riqnomalar, usullar, talablarda aks ettiriladi."
        ]
    },
    {
        "word": "Standart",
        "type": [],
        "definition": [
            "faoliyat natijalarini baholovchi mezon; standartizatsiya obyektiga nisbatan norma va talablarni belgilovchi mezon."
        ]
    },
    {
        "word": "Standart (O Rta Kvadratik) Chetlanish",
        "type": [],
        "definition": [
            "dispersiyadan olingan kvadrat ildiz."
        ]
    },
    {
        "word": "Standart Коst",
        "type": [],
        "definition": [
            "hamma xarajatlarni qattiq me’yorlashtirgan va mahsulotning standart (me’yoriy) tannarxini hisoblash imkoniyatini yaratadigan kalkulatsiya qilish tizimi. Xarajatlarning sarflanishi jarayonida chetga chiqishlarni nazorat qilish, mas’uliyat va xarajat markazlari, xarajat moddalari bo'yicha hisobga olish, chetga chiqishning sabablarini aniqlash maqsadida chuqur tahlil qilish hamda nazoratni o'matish imkoniyatini yaratadigan tizim. Hozirda amaliyotda qo‘llanilayotgan me’yoriy hisobga olish va tannarxni kalkulatsiya qilish usuliga o'xshaydi."
        ]
    },
    {
        "word": "Statistik Gipoteza",
        "type": [],
        "definition": [
            "tanlanma ma’lumotlar asosida tekshirish mumkin bo'lgan bosh to'plam xossasi haqida oldindan aytilgan ilmiy taxmindir."
        ]
    },
    {
        "word": "Statistik Hisob",
        "type": [],
        "definition": [
            "ommaviy xo'jalik hodisalar to'g'risidagi ma’lumotlarni yig'ish va ishlash tizimidan iborat. Xo'jalik hisobining bu turi butun xo'jalik va uning tarmoqlari rivojlanish jarayonini o'rganishga yo'naltirilgan. Undan korxona, tashkilot va muassasalarda sodir bo'layotgan turli-tuman ommaviy hodisalami kuzatish uchun foydalaniladi. Uning yordamida xo'jalik faoliyatining turli-tuman miqdoriy va sifat ko'rsatkichlari hisoblab chiqiladi. Sanoatda bundaylarga, masalan, ishlab chiqarish hajmi, o'rtacha ish haqi, ish vaqtidan foydalanish, mehnat unumdorligi darajasi o'sishi vahokazo ко'rsatkichlar kiradi. Dastlabki statistik kuzatuvlarning ma’lumotlari tumanlar, viloyatlar va umuman respublika xalq xo'jaligining ayrim tarmoqlari bo'yicha umumlashtiriladi."
        ]
    },
    {
        "word": "Statistik Masalalar",
        "type": [],
        "definition": [
            "barcha parametrlari vaqtincha bog'liq ravishda o'zgarmaydigan masalalar."
        ]
    },
    {
        "word": "Statistika",
        "type": [],
        "definition": [
            "ко'plab ijtimoiy voqealarning miqdoriy tomonlarini, ularning sifat tomonlari bilan uzviy boqliqligini, shuningdek, ijtimoiy voqealarni aniq sharoitlar, joy va vaqtlarda rivojlanish qonuniyatlarini o'rganuvchi ijtimoiy fan. Buning uchun turli statistika usullari qo'llaniladi: statistik kuzatish, iqtisodiy indekslar, guruhlash, o'rtacha kattalik va boshqalar. Shu bilan birga statistika tezkor va buxgalteriya hisobi ma’lumotlaridan foydalaniladi. O'zbekiston Respublikasida statistika ma’lumotlarini yig'ish va ishlab chiqish bilan har bir viloyat va tumanlardagi davlat statistika organlari shug'ullanadi. Bu organlaming barchasi yagona metodologiya asosida ish olib boradi va Davlat statistika qo'mitasi boshchiligida yagona tizimni tashkil etadi."
        ]
    },
    {
        "word": "Storno",
        "type": [],
        "definition": [
            "buxgalteriya hisobi hujjadaridagi xatolami tuzatishning usullaridan biri bo'lib, mohiyati shundan iboratki, bunda xato yozuv qizil siyoh bilan xuddi o'zidek qilib yana bir marta yoziladi, undan keyin to'g'ri yozuv awalgidek tegishli registrda aks ettiriladi. Hisob-varaq bo'yicha jami oborot topilayotganida qizil siyoh bilan yozilgan summa umumiy yig'indidan ayirib tashlanadi"
        ]
    },
    {
        "word": "Stoxastik Yoki Statistik Qonunlar",
        "type": [],
        "definition": [
            "bir turli hodisalarni ommaviy takrorlanishida namoyon bo'ladigan qonunlar"
        ]
    },
    {
        "word": "Strategik Biznes-Birlik (Sbb)",
        "type": [],
        "definition": [
            "xo'jalik yurituvchi subyektning tashkiliy tarkibini mukammallashtirishga imkoniyat yaratadigan konsepsiya. Har bir biznes birligi uchun mustaqil strategiyani ishlab chiqishni taqozo qiladi"
        ]
    },
    {
        "word": "Strategik Guruhlar Kartasi",
        "type": [],
        "definition": [
            "tarmoqda raqobatlashayotgan firmalaming raqobat mavqelarini aks ettiruvchi asbobdir. Bu tahliliy usul tarmoqning umumiy tahUli va har bir firmaning bozordagi mavqeyini bir-biriga bog‘ laydi. Buning uchun tarmoqda ishlayotgan barcha kompaniya va firmalar strategik guruhlarga bo'linadi."
        ]
    },
    {
        "word": "Strategik Marketing",
        "type": [],
        "definition": [
            "l) asosiy iste’molchilar guruhlari talab va ehtiyojlarini muntazam, sistemali tahlil qilish, shuningdek, kompaniyaga xaridorlarning tanlab olingan guruhlariga raqobatchilarga qaraganda yaxshiroq xizmat ko'rsatish va shu tariqa raqobatchilik ustunligiga ega bo'lish imkonini beruvchi tovar va xizmatlar konsepsiyasini ishlab chiqish; 2) tashkilotlar va jismoniy shaxslar ehtiyojlarini tahlil qilish; 3) firmaning maqsadlarinibelgilab olish, rivojlanish strategiyasini ishlab chiqish va muvozanatlangan tovar portfeli tuzilmasini ta’minlash; 4) strategik majmua - miks hamda muntazam o'zgarib turuvchi marketing muhiti omillarini xisobga olgan holda firmaning tovar, narx, kommunikatsiya, taqsimlash va sotish sohasidagi strategik siyosatining asosiy yo'nalishlarini ishlab chiqish jarayoni."
        ]
    },
    {
        "word": "Strategik Rejalashtirish",
        "type": [],
        "definition": [
            "firmaning maqsadlari, uning marketing sohasidagi potensial imkoniyatlari o'rtasidagi strategik muvozanatni yaratish va qo'llab-quwatlashni boshqarish jarayoni. U firmaning aniq shakllantirilgan dasturi, qo'shimcha vazifa va maqsadlarni ifodalash,sog'lomxo'jalikportfeliva o'sish strategiyasiga asoslanadi"
        ]
    },
    {
        "word": "Strategik Rivojlantirish",
        "type": [],
        "definition": [
            "korxonaning maqsadi, resurslari va marketing imkoniyatlarining o'zaro strategik muvofiqligini ta’minlash jarayoni."
        ]
    },
    {
        "word": "Strategiya",
        "type": [],
        "definition": [
            "grekcha “strategos” iborasidan olingan bo'lib, “general san’ati” ma’nosini bildiradi. Bozorlarning va huquqiy tizimning holati, ichki va tashqi korxonalar bilan raqobatchilik kabi korxonaning hozirdagi va kelajakda tushib qolishi mumkin bo'lgan turli vaziyatlarni hisobga olgan holda korxonaning boshqaruvchilik, texnik, moliyaviy va boshqa resurslarini ishlatish haqida qaror qabul qilishdir. Strategiya mahsulot nomenklaturasi va ishlab chiqarish hajmlari, sotish bozorlari, xomashyo va investitsiya manbalarini o'z ichiga oluvchi restrukturizatsiyaning turli bosqichlarida korxona rivojlanishining asosiy yo'nalishlarini belgilab berishi lozim."
        ]
    },
    {
        "word": "Strategiya Ikkiga Boʻlinishi",
        "type": [],
        "definition": [
            "korxona o'z raqibining bozordagi o'rnini egallash maqsadida, shu bilan birga, o'z o'rnini ham saqlab qolgan holda faoliyat yuritishda o'rinlidir. Bunda ushbu korxona o'z mahsuloti xarakteristikalariga qo'shimcha tarzda raqibining faoliyatini takrorlab, yaxshilaydi. Ko'p hollarda bu holat korxona uchun mag'lub bir murosalarga borish muammolarini tug'diradi."
        ]
    },
    {
        "word": "Strategik Moliyaviy Boshqaruvning Oʻsish Stili",
        "type": [],
        "definition": [
            "korxona moliyaviy faoliyatining rivojlanish darajasi yuqori bo'Igan holatda qabul qilinadigan moliyaviy qarorlar muqobil variantlarini minimallashtirishni va rivojlanish darajasini saqlab qolishni o'zida aks ettiradi."
        ]
    },
    {
        "word": "Strategik Moliyaviy Boshqaruvning Tadbirkorlik Stili",
        "type": [],
        "definition": [
            "moliyaviy faoliyatning barcha yo'nalishlari va shakllari bo'yicha samarali boshqaruv qarorlari ustida faol ishlashni tashkil etadi. Moliyaviy boshqaruvning bu stili tashqi omillar o'zgarishini hisobga olgan holda qo'yilgan strategik maqsadlarga erishish uchun barcha yo'llarda moliyaviy faoliyatlami amalga oshirishning yo'nalishlari, shakllari va metodlari doimiy transformatsiyasi bilan bog'liq."
        ]
    },
    {
        "word": "Struktura",
        "type": [],
        "definition": [
            "(lot. tuzilish) narsalar tarkibiy qismlarining o'zaro bog'liq ravishda joylashishi, tuzilishini bildiradi."
        ]
    },
    {
        "word": "Strukturaviy (Tarkibiy) Ishsizlik",
        "type": [],
        "definition": [
            "ishchi kuchi strukturasi sekin o'zgaradi va har doim takomillashib boradigan ishlab chiqarishning strukturasiga mos kelmaydi, ish kuchiga bo'Igan taklif va talabning mos kelmasligi natijasida ishsizlik vujudga keladi, bu strukturaviy ishsizlik deyiladi. Masalan, 80-yillardadunyobozoridaneftnarxining pasayishi natijasida AQSHda shu sohada ishlaydiganlarning ko'pchiligi ishsizga aylandilar. Kompyuterning kashf etilishi va ishlab chiqarishga joriy etilishi natijasida idora xizmatchilarining ko'pchiligi o'z ishlarini yo'qotadilar, ammo shu vaqtning o'zida matematiklar, programmistlarga minglab bo'sh joylar bor edi."
        ]
    },
    {
        "word": "Subschyotlar",
        "type": [],
        "definition": [
            "obyektlarning turli nomenklaturadagi hisobini olib borish uchun foydalaniladi. Asosiy schyotlar ko'rsatkichiga qo'shimcha sifatida kiritiladi"
        ]
    },
    {
        "word": "Subsidiya",
        "type": [],
        "definition": [
            "muhtojxo'jaliklargaalohigayordamko'rsatishuchundavlatiqtisodiy sarflarining turi. Dotatsiya subsidiyaning bir turi hisoblanadi. U iqtisodiyotni tartibga solish vositasi bo'lib, uning maqsadi mavjud ijtimoiy-iqtisodiy muammolarni hal etishda moliyaviy yordam ko'rsatishdir. Masalan, o'ta muhim ilmiy-texnikaviy ishlar, ekologik muammolarni hal etishda qatnashadigan korxonalar, eksportni ko'paytirish yoki kamaytirish uchun tovarlar zaxirasini hosil etishda subsidiyalardan foydalaniladi. Subsidiya ikki yo'l bilan berilishi mumkin: a) bevosita budjetdan qaytarib bermaslik sharti bilan pul ajratish; b) davlat tomonidan har xil imtiyozlar berish (soliq va bojlarni kamaytirish, davlat tomonidan kamaytirilgan stavkada qarz berish va boshqalar)."
        ]
    },
    {
        "word": "Substandart",
        "type": [],
        "definition": [
            "aktivlar aniq ifodalangan kamchiliklarga ega bo'lib, bu holat dastlabki shartnomaga muvofiq qarz qaytarilishi shartlarining bajarilishiga shubha uyg'otadi. Substandart sifatida tasniflangan aktivlar bo'yicha tijorat banklar qarzining to'lanmagan summasi 25 foiziga teng bo'lgan zaxiralari ikkilantirishi lozim."
        ]
    },
    {
        "word": "Substandart Kreditlar",
        "type": [],
        "definition": [
            "2 to'lov davrida foiz yig'indisi to'lanmagan kreditlardir."
        ]
    },
    {
        "word": "Substitsiya",
        "type": [],
        "definition": [
            "lotinchada, “o'rnimga boshqani tayinlayman”, degan ma’noni bildiradi. Vasiyatnomada ko'rsatilgan merosxo'rdan tashqari, yana (rezerv) boshqa merosxo'rni (substitut) ko'rsatish huquqi. Substitut tovarlar deganda bir-birining o'rnini bosishi mumkin bo'lgan mahsulotlar tushuniladi."
        ]
    },
    {
        "word": "Subvensiya",
        "type": [],
        "definition": [
            "konkret maqsadga mo'ljallangan subsidiya, davlat tomonidan boshqaruvni mahalliy organlarga markaz tomonidan ma’qullagan loyiha va dasturlarni amalga oshirish uchun beriladi. Shu maqsadda davlat budjetida maxsus subsidiya fondi tashkil etiladi"
        ]
    },
    {
        "word": "Subyekt",
        "type": [],
        "definition": [
            "(lot. - ega) faol amal qiluvchi hamda biluvchi ong va irodaga ega bo'lgan inson tushuniladi. Masalan: mulk subyekti deganda, o'sha mulkka egalik qiluvchi inson tushuniladi."
        ]
    },
    {
        "word": "Sud Tomonidan Tayinlan Gan Ish Boshqaruvchi",
        "type": [],
        "definition": [
            "bankrotlikni e’tirof etish bilan bog'liq masalalar yuzasidan huquqiy taomilga ko'ra ish olib boruvchi yoxud qonunlarda ko'rsatilgan boshqa xildagi vakolatlardan foydalana olish huquqiga ega bo'lgan shaxs."
        ]
    },
    {
        "word": "Sudga Murojaat Qilgunga Qadar Amalga Oshiriladigan Huquqiy Taomillar",
        "type": [],
        "definition": [
            "xo'jalik sudining aralashuvidan ilgariroq qarzdorning o'z kreditorlari bilan murosaga kelishiga yordam beradigan chora-tadbirlar."
        ]
    },
    {
        "word": "Sudxoʻr",
        "type": [],
        "definition": [
            "sudxo'r, ijarachi, foydaxo'r, foyda olishni ko'zlab pulni qarz beruvchi kishi."
        ]
    },
    {
        "word": "Sugʻurta",
        "type": [],
        "definition": [
            "har xil noxush hodisalar ro'y berishi natijasida ko'rilgan zararni qoplash hamda fuqorolaming hayotida tegishli sug'urta hodisalari ro'y berganda ularga moddiy yordam ko'rsatish maqsadida tashkil etiladigan va undan foydalanish bilan bog' liq (maqsadli pul fondlari) iqtisodiy munosabatlar yig'indisi. O'tkazish shartiga qarab, sug'urta majburiy va ixtiyoriy bo'ladi. Obyektiga ko'ra, mulkiy, shaxsiy va javobgarlik sug'urtasiga bo'linadi. Sug'urtaning asosini risk tashkil etadi. Sug'urta - bu riskni taqsimlash usulidir."
        ]
    },
    {
        "word": "Sugʻurta Bahosi",
        "type": [],
        "definition": [
            "sug'urtalash maqsadida aniqlanadigan mol-mulkning qiymati. Amaliyotda mol-mulklar haqiqiy qiymati, bozor qiymati va boshqa qiymatlar vositasida baholanadi. Zarur hollarda sug'urta bahosini to‘g'ri hisoblash uchun malakali ekspertlar jalb etiladi. Sug'urta bahosi to'g'risidagi haqiqiy ma’lumot ta’rif stavkasi va sug'urta mukofoti miqdorini aniqlashda muhim ahamiyatga ega. Amaldagi qonunchilikka binoan, sug'urta summasi mol-mulkning sug'urta bahosidan oshib ketmasligi zarur."
        ]
    },
    {
        "word": "Sugʻurta Bozori",
        "type": [],
        "definition": [
            "oldi-sotdi obyekti o'ziga xos tovar - sug'urta xizmati bo'lgan va unga nisbatan taklif va talab shakllanadigan pul munosabatlari sohasi. Sug'urta huquqiy munosabatlari ishtirokchilari o'rtasidagi o'zaro aloqadorlikning shakli"
        ]
    },
    {
        "word": "Sugʻurta Bozori Assortimenti",
        "type": [],
        "definition": [
            "sug'urtalanuvchi murojaat qilishi mumkin bo'lgan sug'urta turli ko'rinishlarining (turlarining) to'plami (majmuyi)"
        ]
    },
    {
        "word": "Sugʻurta Dalolatnomasi",
        "type": [],
        "definition": [
            "sug'urta hodisasi ro'y berganda sug'urta kompaniyasi tomonidan tuziladigan hujjat. Dalolatnomada molmulkning zararlanish yoxud nobud bo'lish sabablari, ko'rilgan zarar miqdori va boshqa ko'rsatkichlar bo'ladi. Dalolatnomaga zarur hollarda sug'urta hodisasi va mol-mulkning zararlanganligini tasdiqlovchi tegishli tashkilotlarning (yong'inga qarshi kurash, davlat avtomobil nazorati, qishloq xo'jaligi, veterinariya xizmati va boshqalar) yozma hulosasi ilova etiladi. Xalqaro sug'urta munosabatlarida sug'urta dalolatnomasini adjaster tuzadi va mohiyatan avariya sertifikatiga yaqinlashadi."
        ]
    },
    {
        "word": "Sugʻurta Guvohnomasi (Sugʻurtaviy Polis)",
        "type": [],
        "definition": [
            "tuzilgan sug'urta shartnomasi va uning shartlari mazmunini o'zida mujassam etganligiga guvohlik beruvchi sug'urtalovchi tomonidan sug'urtalanuvchiga o'rnatilgan namunaga muvofiq beriladigan hujjat. Sug'urtalanuvchiga u tomonidan birinchi marta yoki bir martalik sug'urta badali to'langanidan so'ng beriladi. Unda sug'urtaning asosiy shartlari: sug'urtalanuvchining familiyasi va ismi sharifi, uning rekvizitlari, sug'urta hajmi, sug'urta majburiyati hajmi, sug'urta summasining miqdori, sug'urta tarifi, sug'urta qoplanmasini oluvchi va boshqalar o'z ifodasini topadi."
        ]
    },
    {
        "word": "Sugʻurta Himoyasi",
        "type": [],
        "definition": [
            "ijtimoiy ishlab chiqarish va aholining turmush darajasiga nisbatan yetkazilgan yo'qotmalarga barham berish yoki ularni qoplash (tiklash) bilan bog'liq bo'lgan o'ziga xos taqsimlash va qayta taqsimlash munosabatlarining majmuyini o'zida mujassam etgan iqtisodiy kategoriya (keng ma’noda); konkret obyektlarga: moddiy boyliklar, hayot, sog'lik, fuqarolarning mehnatga layoqatliligi va boshqalarga yetkazilgan ziyonlarni tiklash va ularga barham berish borasidagi qayta taqsimlash munosabatlarining majmuyi (tor ma’noda)."
        ]
    },
    {
        "word": "Sugʻurta Hodisalari Chastotasi",
        "type": [],
        "definition": [
            "inshoodarning yonish, transport vositalarining avariya bo'lish darajasini, aholi nogironligi darajasi va shunga o'xshash darajalarni ifodalovchi ko'rsatkich. Sug'urta hodisalari sonini sug'urta qoplamalari miqdoriga yoki sug'urtalangan obyektlar miqdoriga nisbati sug'urta hodisalari chastotasini aniqlaydi."
        ]
    },
    {
        "word": "Sugʻurta Hodisasi",
        "type": [],
        "definition": [
            "stixiyali, tabiiy yoki oldindan ко'rib bo'lmaydigan voqea-hodisalarning amalda yuz berishi. Sug'urta hodisasi yuzaga kelgan zarar sug'urta kompaniyasi tomonidan shartnomaga muvofiq qoplanadi. Mulkiy sug'urtada sug'urta hodisasi deyilganda, stixiyali hodisalar, yong'in, avariya, portlash, zilzila, dovul va boshqalar tushuniladi. Shaxsiy sug'urtada esa sug'urta hodisasiga fuqarolarning ma’lum bir muddatgacha yashashi, ularning hayotida baxtsiz hodisalarning ro'y berishi yoki o'limi kiradi. Xalqaro amaliyotda sug'urta hodisasi ba’zan “fors-major” deb yuritiladi."
        ]
    },
    {
        "word": "Sugʻurta Huquqi",
        "type": [],
        "definition": [
            "sug'urtalovchilar, sug'urtalanuvchilar va ular o'rtasidagi vositachilarning xatti-harakati qoidalari yig'indisi. Sug'urta huquqi qonun va qonun hujjatlarida o'z aksini topadi. Sug'urta huquqi moliyaviy huquqning bir qismi hisoblanadi."
        ]
    },
    {
        "word": "Sugʻurta Kompaniyasi",
        "type": [],
        "definition": [
            "sug'urta shartnomasini tuzish va unga xizmat qilishni amalga oshiruvchi, sug'urtalanuvchi bilan huquqiy munosabatda bo'luvchi yuridik shaxs. U o'z nizomi asosida faoliyat yurituvchi mustaqil xo'jalik subyektidir. Tegishli iqtisodiy muhitda faoliyat yurituvchi sug'urta kompaniyalarining yig'indisi sug'urta tuzimini tashkil etadi. Sug'urta kompaniyalari bajaradigan sug'urta operatsiyalariga ko'ra, ular universal va ixtisoslashgan bo'ladi. Ustav kapitali miqdori hamda kelib tushgan sug'urta mukofotlari hajmiga muvofiq, sug'urta kompaniyalarini yirik, o'rta va kichik guruhlarga bo'lish mumkin."
        ]
    },
    {
        "word": "Sugʻurta Коrpоratsiyalari Va Nafaqa Jamgʻarmalari",
        "type": [],
        "definition": [
            "kichiksektor,rezidentsug'urtakorporatsiyalari,kvazikorporatsiyalar va muxtor nafaqa jamg'armalaridan tarkib topadi"
        ]
    },
    {
        "word": "Sugʻurta Korporatsiyalari Va Nafaqa Jamgʻarmalaridan Tashqari Boshqa Moliya Vositachilari",
        "type": [],
        "definition": [
            "kichik sektor, depozit korporatsiyalar, sug'urta korporatsiyalar va nafaqa jamg'armalaridan tashqari asosan moliyaviy vositachilik bilan shug'ullanuvchi barcha rezident korporatsiyalari va kvazikorporatsiyalarni o'z ichiga oladi."
        ]
    },
    {
        "word": "Sugʻurta Kvotasi",
        "type": [],
        "definition": [
            "l) bir necha sug'urta kompaniyasi tomonidan birgalikda tegishli obyekt sug'urtalanayotganda, bitta sug'urta kompaniyasiga to'g'ri keladigan hissa. Bunday holatda har bir sug'urta kompaniyasiga tegishli kvota yagona sug'urta polisida o'z aksini topadi; 2) qayta sug'urtalash kompaniyasini qayta sug'urtalashda qatnashish hissasi."
        ]
    },
    {
        "word": "Sugʻurta Manfaati",
        "type": [],
        "definition": [
            "sug'urtada moddiy manfaatdorlik chorasi. Sug'urta hodisasi ro'y berishi natijasida sug'urtalanuvchiga moddiy zarar keltiruvchi predmetlar (mol-mulk) yoki sug'urtalanuvchining uchinchi shaxsga zarar keltirish holatlari. Masalan, sug'urtalanuvchining avtomobil transporti yo'l-transport hodisasi tufayli shikastlanganda, sug'urtalanuvchida ushbu mulkka nisbatan manfaatdorlik yuzaga keladi va sug'urta moddiy manfaatdorlik chorasi sifatida maydonga chiqadi."
        ]
    },
    {
        "word": "Sugʻurta Maydoni",
        "type": [],
        "definition": [
            "sug'urtaga tortilishi zarur bo'lgan obyektlaming eng katta soni. Ayrim ekspertlarxulosasiga ko'ra, O'zbekistonda sug'urta maydoni hali to'la o'zlashtirilmagan. Faqat mol-mulklarning 20-30 foizigina sug'urtaga tortilgan."
        ]
    },
    {
        "word": "Sugʻurta Mukofoti",
        "type": [],
        "definition": [
            "sug'urta mukofotining miqdori sug'urta summasiga nisbatan foizlarda aniqlanadi. Sug'urta mukofotining miqdori aniq summalarda ham ifodalanishi mumkin. Masalan, avtomobil egalarininguchinchi shaxsga zarar keltirish fuqarolikj avobgarligining sug'urtasida sug'urta mukofoti aniq pul birligida ko'rsatiladi"
        ]
    },
    {
        "word": "Sugʻurta Mukofotlari Zaxirasi",
        "type": [],
        "definition": [
            "hayotni va nafaqani uzoq muddatli sug'urtalash bo'yicha to'lovlami oldindan to'lash uchun sug'urta kompaniyasida tashkil etiladigan fond. Bu fond sug'urta operatsiyalarining moliyaviy barqarorligini ta’minlashda hamda sug'urtalovchi zimmasidagi majburiyatlami bajarishda muhim о'rin tutadi. Hayot sug'urtasi shartnomalari, odatda, bir necha yilga tuziladi. Sug'urta mukoftlarini kelib tushish va sug'urta summasini to'lash vaqtlari o'zaro to'g'ri kelmaganligi uchun, sug'urta kompaniyasiga kelib tushgan sug'urta mukofoti ma’lum vaqt mobaynida uning ixtiyorida bo'sh xolda bo'ladi. Kelib tushgan sug'urta mukofotlarining bir qismi joriy to'lovlar uchun sarflanadi, qolgan qismi esa zaxira fondini shakllantirish uchun yo'naltiriladi. Uzoq muddatli hayot sug'urtasi bo'yicha zaxira fondining mablag'lari kredit resursi sifatida foydalanilishi mumkin."
        ]
    },
    {
        "word": "Sugʻurta Obyekti",
        "type": [],
        "definition": [
            "shaxsiy sug'urtada fuqarolarning hayoti, sog'lig'i, mehnat qobiliyati: mulkiy sug'urtada binolar, qurilmalar, transport vositalari, uy-joy mulki, tashiladigan yuklar va boshqa moddiy boyliklarni saqlash bilan bog'liq manfaatlar; jismoniy yoki yuridik shaxsning o'z xatti-harakati bilan uning shaxsga zarar keltirish fuqarolik mas’uliyati - mas’uliyatni sug'urtaiashda sug'urta obyektlari bo'lib hisoblanadi. Riskni baholash maqsadida sug'urta obyekti sug'urta kompaniyasining mutaxassislari tomonidan ekspertiza qilinishi mumkin"
        ]
    },
    {
        "word": "Sugʻurta Polisi Egalarining Mulk Uchun Daromadlari",
        "type": [],
        "definition": [
            "Sug'urta kompaniyalari fuqarolarning hayotini sug'urta qiladilar. Natijada yig'ilgan mablag'lar investitsiya sifatida ishlatilib evaziga ma’lum bir daromad keltiradilar. Sug'urta kompaniyalarining bu daromadlari (aslida sug'urta qilingan fuqarolarning mablag'lari evaziga kelgani uchun va MHT qoidalariga ko'ra) uy xo'jaligi sektorining mulkdan olgan daromadi sifatida talqin qilinadi. Chunki, bu mablag'lar pirovardida sug'urta polisiga ega bo'lgan fuqarolarga sug'urta mukofoti sifatida beriladi."
        ]
    },
    {
        "word": "Sugʻurta Polisi",
        "type": [],
        "definition": [
            "sug'urta shartnomasi tuzilganlik faktini tasdiqlovchi hujjat. Sug'urta polisida quyidagi rekvizitlar bo'lishi shart: sug'urta kompaniyasining yuridik manzili, sug'urtalanuvchining nomi, sug'urta obyekti, sug'urta mukofotining miqdori, shartnomaning amalqilishmuddati.Sug‘urtaqoplamasinito‘lashdasug'urtalanuvchi sug'urta polisini sug'urta kompaniyasiga taqdim etishi zarur"
        ]
    },
    {
        "word": "Sugʻurta Polisidan Daromad",
        "type": [],
        "definition": [
            "sug'urta polisi egalarining sug'urta shartnomasiga ko'ra oladigan daromadlari"
        ]
    },
    {
        "word": "Sugʻurta Portfeli",
        "type": [],
        "definition": [
            "sug'urta kompaniyasiga kelib tushgan sug'urta mukofotlarining yig'indisi. Sug'urtalangan obyektlar soni, sug'urta shartnomalarining miqdori ham sug'urta portfeli tushunchasini anglatadi. Chet mamlakatlar sug'urta amaliyotida ushbu ibora ishlab topilgan sug'urta mukofotining hajmi tushunchasiga to'g'ri keladi."
        ]
    },
    {
        "word": "Sugʻurta Puli",
        "type": [],
        "definition": [
            "sug'urta majburiyatini bajarish hamda sug'urta operatsiyalarining moliyaviy barqarorligini ta’minlash maqsadida yuridik shaxs maqomiga ega bo'lmasdan o'zaro kelishgan holda bir qancha sug'urta kompaniyalarining ixtiyoriy uyushmasi. Sug'urta puli, asosan, xavfli, yirik obyektlami sug'urtalash maqsadida tashkil etiladi. Har qaysi kompaniya o'z sug'urtalangan riskni pulga beradi va buning uchun pul orqali yig'ilgan sug'urta mukofotlarining bir qismini oladi. Olingan sug'urta mukofotlari hajmida sug'urta qoplamasini to'lash bo'yicha javobgarlikni o'z zimmasiga oladi. Xorijiy mamlakatlarda aviatsiya, atom, xarbiy risklarni sug'urtalash uchun sug'urta puli tashkil etilgan."
        ]
    },
    {
        "word": "Sugʻurta Qoplamasi",
        "type": [],
        "definition": [
            "mulkiy sug'urtada va sug'urtaianuvchining uchinchi shaxs oldida fuqarolik javobgarligi sug'urtasida zararni qoplash uchun sug'urta fondidan to'lanadigan pul mablag'i. Sug'urta qoplamasi sug'urta summasiga teng yoki undan kam bo'lishi mumkin. Sug'urta hodisasi ro'y berganlik holati va shakli bo'yicha adjaster yoki avariya komissarining xulosasi sug'urta kompaniyasi tomonidan sug'urta qoplamasi to'lanishida asos bo'lib xizmat qiladi."
        ]
    },
    {
        "word": "Sugʻurta Qoplamasi Limiti",
        "type": [],
        "definition": [
            "sug'urta kompaniyasining filiali, bo'limi,shu bakorxonasitomonidanbittasug'urtahodisasibo'yicha mustaqil to'lanadigan sug'urta qoplamasining eng yuqori miqdori. Bu miqdorni sug'urta kompaniyasi boshqaruvi joylardagi sug'urta summasining zararlilik darajasidan, kadrlarning malakasidan va boshqa omillardan kelib chiqqan holda belgilaydi."
        ]
    },
    {
        "word": "Sugʻurta Rezervlari",
        "type": [],
        "definition": [
            "sug'urta badallari hisobidan shakllanadigan va birinchi navbatda, sug'urtalanuvchilarga sug'urta to'lovlarini amalga oshirishga sarf (xarj) qilinadigan maxsus fondlar. Daromadlarga emas, balki sug'urtalovchining majburiyatlariga bog'liq ravishda shakllanadi (tashkil qilinadi)."
        ]
    },
    {
        "word": "Sugʻurta Shartnomasi",
        "type": [],
        "definition": [
            "ikki tomonlama yozma ravishdagi bitim bo'lib, bunda sug'urta kompaniyasi sug'urta hodisasi tufayli zarar ko'rilganda sug'urtalanuvchiga sug'urta qoplamasi yoki sug'urta summasini to'lash majburiyatini, sug'urtalanuvchi esa belgilangan muddatlarda sug'urta mukofotini to'lash majburiyatini oladi. Sug'urta shartnomasi tuzilganlik faktini tasdiqlash uchun sug'urtalovchi sug'urtalanuvchiga sug'urta polisi beradi. Sug'urta shartnomasini tuzishdagi asosiy, oddiy va qo'shimcha shartlar sug'urta shartnomasining mazmunini tashkil etadi."
        ]
    },
    {
        "word": "Sugʻurta Summasi",
        "type": [],
        "definition": [
            "sug'urta manfaati va sug'urta riskiga mos keluvchi pul mablag'i. Xalqaro amaliyotda sug'urta summasi sug'urta qoplamasi deyiladi. Sug'urta summasiga nisbatan sug'urta mukofoti aniqlanadi va sug'urta qoplamasi to'lanadi. Sug'urta summasi iborasi, ko'proq, shaxsiy sug'urtada - fuqarolarning hayoti, sog'lig'ini sug'urtalashda ishlatiladi"
        ]
    },
    {
        "word": "Sugʻurta Summasining Zararliligi",
        "type": [],
        "definition": [
            "sug'urta summasi va sug'urta qoplamasi to'lovi o'rtasidagi nisbatni xarakterlovchi iqtisodiy ko'rsatkich. Bu ko'rsatkich zarar miqdori ehtimolligini ko'rsatadi va undan riskning o'zgarishi ustidan nazorat o'rnatishda foydalaniladi. Sug'urta summasining zararlilik ko'rsatkichi quyidagi omillar ta’siri ostida shakllanadi: sug'urtalangan obyektlar soni va ularning sug'urta summasi, sug'urta hodisalarining soni, zarar ko'rgan obyektlar soni va sug'urta qoplamasi. Sug'urta summasining zararlilik ko'rsatkichi netto-stavka tuzilishiga qarab har bir sug'urta turi yoki javobgarlik turi bo'yicha aniqlanadi. Agar zararlilik ko'rsatkichi netto-stavkaga yaqinlashsa yoki undan oshib ketsa, bu holda sug'urta summasining zararlilik ko'rsatkichi yuqori darajada ekanligidan dalolat beradi."
        ]
    },
    {
        "word": "Sugʻurta Tizimi",
        "type": [],
        "definition": [
            "l) turli xil sug'urta kompaniyalari va ularni sug'urta nazorati bilan aloqadorligining yig'indisi: 2) sug'urta huquqiy munosabatlarni tashkil etishning davlat - huquqiy shakli."
        ]
    },
    {
        "word": "Sugʻurta Yigʻimi",
        "type": [],
        "definition": [
            "jismoniy shaxsning yo'lovchilarning majburiy sug'urta bo'yicha bir marta to'lanadigan sug'urta mukofoti. Odatda, sug'urta yig'imi yo'l haqi tarkibida bo'ladi va chiptada sug'urta yig'imi “kiritilgan”, degan so'z bo'ladi."
        ]
    },
    {
        "word": "Sugʻurta Zaxiralari",
        "type": [],
        "definition": [
            "sug'urta summalarini to'lashni kafolatlash maqsadida sug'urta kompaniyalari tashkil etgan fondlar. Agar, ma’lum bir vaqtda sug'urta qoplamalarini to'lash uchun joriy sug'urta mukofotlari etmasa, sug'urta kompaniyasi zaxira fondlaridan foydalanishi mumkin. Sug'urta zaxiralariga quyidagilar kiradi: hayotning sug'urtasi bo'yicha zaxira fondlari, ro'y bergan, ammo arz qilmagan zararlarni qoplash zaxiralari va boshqalar. Ushbu zaxira fondlarining mablag'lari vaqtincha bo'sh bo'lgani uchun investitsiya maqsadlarida foydalanilishi mumkin. Buning natijasida sug'urta kompaniyasi qo'shimcha daromad oladi"
        ]
    },
    {
        "word": "Sugʻurtada Tarif Siyosati",
        "type": [],
        "definition": [
            "sug'urta operatsiyalarining zararsiz o'tkazilishini va sug'urtalanuvchilarning manfaati yo'lida sug'urta tariflarini belgilash, aniqlash, tartibga solish va tabaqalashtirish bo'yicha sug'urta kompaniyasining maqsadli yo'naltirilgan faoliyati. Sug'urtada tarif siyosati quyidagi asosiy prinsiplarga asoslanadi: Netto-mukofotlar va sug'urta qoplamasi o'rtasidagi ekvivalentlik. Har bir sug'urta turi bo'yicha netto-stavka zararlarning ehtimol tutilgan miqdoriga maksimal darajada to'g'ri kelishi zarur. Sug'urtalanuvchilarning asosiy qismi uchun sug'urta tarifi miqdorining qulayligi. Tarif stavkalarining yuqori darajada belgilanishi sug'urta ishining rivojlanishi uchun to'siq bo'ladi."
        ]
    },
    {
        "word": "Sugʻurtalanuvchi",
        "type": [],
        "definition": [
            "qonun yoki ikki tomonlama shartnoma asosida sug'urta kompaniyasi bilan fuqoralik-huquqiy munosabatlarga kiruvchi yuridik yoki jismoniy shaxs. Sug'urtalanuvchi uchinchi shaxs foydasiga sug'urta shartnomasini tuzishga xaqli. Sug'urtalanuvchi sug'urta mukofotini o'z vaqtida to'lashi shart. Sug'urta shartnomasini tuzish jarayonida sug'urtalanuvchi sug'urta obyektiga taalluqli bo'lgan barcha ma’lumotlarni sug'urta kompaniyasiga ma’lum qilishi shart"
        ]
    },
    {
        "word": "Sugʻurtalash",
        "type": [],
        "definition": [
            "bankning amalga oshirayotgan operatsiyalarida yuzaga kelishi mumkin bo'lgan risklarni ma’lum bir sug'urta badali asosida sug'urta kompaniyalari tomonidan ko'rilgan zararni qoplab berish shartnomasini tuzish."
        ]
    },
    {
        "word": "Sugʻurtalovchi",
        "type": [],
        "definition": [
            "sug'urtani amalga oshiruvchi ixtisoslashtirilgan tashkilot. Tabiiy ofat yoki boshqa ko'zda tutilmagan sabablar natijasida ko'rilgan zararlarni sug'urta qonunchiligi yoki sug'urta shartnomasi asosidagi shartlarni ko'zda tutib qoplashni o'z zimmasiga oluvchi tashkilotlar."
        ]
    },
    {
        "word": "Sugʻurtalovchilar Uyushmasi",
        "type": [],
        "definition": [
            "sug'urta faoliyatini muvofiqlashtirish, uyushma a’zolarining manfaatini davlatning qonun chiqaruvchi va ijroiya organlari oldida himoya etish hamda mahalliy sug'urta kompaniyalari va xorijiy sug'urta kompaniyalari o'rtasida o'zaro foydali aloqalarni o'rnatish maqsadida tashkil etiladigan sug'urta kompaniyalarining uyushmasi. Bunga o'zaro sug'urtalash jamiyatlarining xalqaro uyushmasini, texnik risklarni sug'urtalovchi kompaniyalar ittifoqini, Buyuk Britaniya sug'urtalovchilar uyushmasini misol qilib keltirish mumkin. Hozirgi paytda O'zbekistonda sug'urtalovchilar uyushmasi tashkil etilmagan. Faqat, avtosug'urtalovchilar ittifoqi faoliyat ko'rsatmoqda"
        ]
    },
    {
        "word": "Sugʻurtalovchining Javobgarlik Limiti",
        "type": [],
        "definition": [
            "tuzilgan sug'urta shartnomasidan kelib chiqqan holda belgilanadigan sug'urta kompaniyasining mumkin bo'lgan eng yuqori darajadagi javobgarligi. Sug'urtalovchining javobgarlik limiti sug'urta polisida o'z aksini topadi."
        ]
    },
    {
        "word": "Sunʼiy Intellekt",
        "type": [],
        "definition": [
            "informatikaning alohida sohasi bo‘lib, odatda inson ongi bilan bog‘liq imkoniyatlar: tilni tushunish, o‘rgatish, muhokama qilish, masalani yechish, tarjima va shu kabi imkoniyatlarga ega kompyuter tizimlarini yaratish bilan shug‘ullanadi."
        ]
    },
    {
        "word": "Sugʻurtani Turkumlash (Klassifikatsiyalash)",
        "type": [],
        "definition": [
            "l) sug'urta turlarini ierarxiya ko'rinishida tarmoqlarga, tarmoqchalarga va turlarga bo'linishi. Bunda har bir keyingi bo'g'in oldingi bo'g'inning bir qismi shaklida ifodalanadi. Sug'urta obyekti sug'urtaning toifasi, sug'urta javobgarligining hajmi va sug'urta qismining shakli sug'urtani turkumlashning asosiy mezoni bo'lib hisoblanadi. 2) xorij amaliyotida sug'urta turlarining tartiblashtirilgan tizimi. Hozirgi vaqtda Evropa Ittifoqi davlatlarida sug'urtaning yagona klassifikatsiyasi ishlab chi qilgan va hayotga joriy etilgan."
        ]
    },
    {
        "word": "Sugʻurtaning Obyekti Va Predmeti",
        "type": [],
        "definition": [
            "mulk sug'urtasida obyekt sifatida moddiy boyliklar mol-mulk sifatida ko'zda tutilsa, shaxsiy sug'urtada fuqarolarning hayoti, sog'lig'i va mehnat qobiliyati ko'zda tutiladi. Sug'urta predmeti - ana shu obyektlarning tarkibiy qismlaridir, masalan, qishloq xo'jaligi sug'urta obyekti bo'lsa, ekinlar, hosili, chorva mollarining soni, mol-mulk xillari, binolar, inshootlar, transport vositalari sug'urta predmeti hisoblanadi. Uy-joyda saqlanuvchi mol-mulklar obyekt bo'lsa, uyro'zg'or buyumlari, mebellar, gilamlar, televizorlar bu sug'urtaning predmeti hisoblanadi. Shaxsiy sug'urta predmetiga ma’lum yoshga yetish, mehnat qobiliyatini yo'qotish va vafot etish hodisalari misol bo'la oladi."
        ]
    },
    {
        "word": "Sugʻurtavty Foyda",
        "type": [],
        "definition": [
            "sug'urta xizmatining bahosi va tannarxi o'rtasidagi farq. Sug'urtaviy foyda sug'urta operatsiyalarini amalga oshirish natijasida shakllanadi. Sug'urtaviy foyda balans uslubi asosida sug'urta mukofotlari tushumi va sug'urta operatsiyalari tannarxini o'zaro taqqoslash natijasida aniqlanadi. Sug'urta operatsiyalarining tannarxi bu - sug'urta kompaniyasining sug'urta himoyasini ta’minlashga qaratilgan to'g'ri va egri, (shu jumladan zaxira fondlariga ajratmalar) xarajatlarning yig'indisidir. Odatda, sug'urta tarifini hisoblashda netto-stavkaga yuklamada foyda ulushi ham ko'rsatiladi. Shakllanish manbaiga ko'ra, haqiqatdagi sug'urtaviy foyda o'z ichiga quyidagi foyda turlarini oladi: sug'urta summasi zararlik ko'rsatkichini kamaytirishdan olingan foyda, boshqaruv xarajatlarini iqtisod qilish natijasida olingan foyda, investitsiyadan olingan foyda va sug'urta tarifida belgilangan foyda."
        ]
    },
    {
        "word": "Sugʻurtaviy Tibbiyot",
        "type": [],
        "definition": [
            "turli kasalliklardan majburiy sug'urtani nazarda tutuvchi sog'liqni saqlash ishini tashkil etish shakli. Sug'urtaviy tibbiyot bo'yicha sug'urta fondi ishchi-xodimlarning ish haqidan, tadbirkorlarning foydasidan, davlat dotatsiyasi hisobidan hamda xayr-ehson fondlarining majburiy ajratmasi hisobidan shakllanadi. Sug'urtaviy tibbiyot bo'yicha sug'urtalangan kontingentgatibbiysug'urtapolisiberiladi.Sug'urtalanuvchidatibbiy sug'urta polisi bo'lgan taqdirda tibbiy xizmat ko'rsatiladi. Bunda tibbiy sug'urta kompaniyasi, bir tomondan sug'urtalanuvchilar bilan, ikkinchi tomondan tibbiyot muassasalari bilan shartnoma tuzadi."
        ]
    },
    {
        "word": "Supermarket",
        "type": [],
        "definition": [
            "xaridorning o‘z-o‘ziga xizmat ko'rsatishiga asoslangan juda keng assortimentda oziq-ovqat istemol tovarlari sotiladigan do'kon. Supermarket xaridorlarga bepul maslahatlar beradi. tovarlarni buyurtmaga ko'ra xaridor uyiga yetkazadi va boshqa turdagi xizmatlar ko'rsatadi."
        ]
    },
    {
        "word": "Supervayzer",
        "type": [],
        "definition": [
            "(superviser) kuzatuvchi; inspektor."
        ]
    },
    {
        "word": "Sust Talabli Tovarlar",
        "type": [],
        "definition": [
            "ayni paytda tovarga talab imkoniyat darajasidan ancha past bo'ladi."
        ]
    },
    {
        "word": "Suv Kadastri",
        "type": [],
        "definition": [
            "suv obyektlari to'g'risida, ularning suv resurslari, suv obyektlaridan foydalanish, suvdan foydalanuvchilar to'g'risida tizimlashtirilgan ma’lumotlar to'plamidir"
        ]
    },
    {
        "word": "Suzib Yuruvchi Inflyatsiya",
        "type": [],
        "definition": [
            "bunda narxlar tez o'sa boshlaydi, yiliga 10 foiz atrofida o'sish kuzatiladi."
        ]
    },
    {
        "word": "Svift",
        "type": [],
        "definition": [
            "1. Kompyuter tarmog'i orqali xalqaro to'lovlarni amalga oshirishning avtomatik tizimi. 2. Maxsus telekommunikatsiyalar yordamida amalga oshirilgan hisob-kitoblar haqida banklar o'rtasida axborotni elektron ayirboshlash maqsadida 1973 yilda tuzilgan xalqaro banklararo tashkilot. Hozirgi paytda SVIFT tizimida 54 ta davlatdan 1500 dan ortiq bank ishtirok etmoqda"
        ]
    },
    {
        "word": "Svop (Swap)",
        "type": [],
        "definition": [
            "savdo qoidalariga amal qilgan holda bitta qarzni to'lash bo'yicha ma’lum bir muddat o'tgandan so'ng shartlarni o'zgartirish bo'yicha bitim"
        ]
    },
    {
        "word": "Svop Operatsiyasi",
        "type": [],
        "definition": [
            "bir valyutani spot operatsiyasi bo'yicha sotib olish va forvard sharti bo'yicha sotishiga yoki forvard sharti bo'yicha sotib olish va spot sharti bo'yicha sotishga aytiladi"
        ]
    },
    {
        "word": "Syurveyer",
        "type": [],
        "definition": [
            "sug'urtaga tortiladigan mol-mulkni ko'rikdan o'tkazuvchi sug'urta kompaniyasining xodimi. Sug'urta kompaniyasi syurveyerning xulosasi asosida sug'urta shartnomasini tuzish to'g'risidaqaror qabul qiladi. Chetelamaliyotidayong'inhavfsizligini ta’minlovchi ixtisoslashgan firmalar, mehnat muhofazasi bo'yicha tashkilotlar syurveyer funksiyasini bajaradi."
        ]
    }
]