[
    {
        "word": "Shakllanayotgan Talab ",
        "type": [],
        "definition": [
            "biror narsaga bo'Igan ehtiyoj konkret darajaga, talabga aylana borish va talabning rivojlanib borish bosqichi. "
        ]
    },
    {
        "word": "Shakllangan Talab",
        "type": [],
        "definition": [
            "ma’lum tovarga ehtiyoj konkret, aniq bo'lib, talabning o'sib barqaror darajaga yetishi."
        ]
    },
    {
        "word": "Shakllanmagan Talab",
        "type": [],
        "definition": [
            "biror narsaga bo'Igan ehtiyoj hali abstrakt darajada bo'lib, uni qanday tovar va tovar turi bilan qondirish aniq emas. "
        ]
    },
    {
        "word": "Sharqjy Yevropa Uchun Qayta Qurish Va Taraqqiyot Yevropa Banki ",
        "type": [],
        "definition": [
            "Sharqiy Yevropa mamlakatlariga, jumladan, MDHga kredit berish orqali ularning taraqqiyotiga ko'maklashuvni ko'zda tutgan Yevropa banki. 1990-yil yanvar oyida tuzilgan. Mazkur bank 42 davlat ishtirokida tuzilgan. Dastlabki kapitali 12 mlrd dollar."
        ]
    },
    {
        "word": "Shartli Foyda",
        "type": [],
        "definition": [
            "birlamchi daromadning bir elementi hisoblanadi. U real operatsiya emas. U buxgalteriya hisoblarida qayd etilmaydi."
        ]
    },
    {
        "word": "Shartli Majburiyatlar ",
        "type": [],
        "definition": [
            "mazkur xo'jalik subyektining kelajakdagi xo'jalik faoliyatining natijasi bo'Igan va uning auditorlik firmasi tomonidan tasdiqlangan hozirgi buxgalteriya hisobotida aks ettirilgan moliyaviy holatiga sezilarli darajada ta’sir etuvchi noaniq summadagi kelgusi davr majburiyatlarning qutilishi. "
        ]
    },
    {
        "word": "Shartnoma ",
        "type": [],
        "definition": [
            "tomonlar o'rtasida o'rmatilgan, o'zgartirilgan yoki bekor qilingan huquq va majburiyatlar to'g'risidagi kelishuv, bitim. Bozor iqtisodiyoti sharoitida shartnoma tomonlarining o'zaro majburiyatlarini o'z vaqtida aniq bajarishini ta’minlash va intizomni mustahkamlash, mahsulot sifatini yaxshilashning vositasi hisoblanadi. Shartnomaning muhim bandlari bo'lib uningpredmeti, baho, muddati hisoblanadi. Tomonlar barcha muhim bandlar bo'yicha kelishgan holdagina shartnoma qabul qilingan hisoblanadi. Shartnoma qonun talab etadigan tarzda rasmiylashtirilishi shart."
        ]
    },
    {
        "word": "Shartnoma Bahosi ",
        "type": [],
        "definition": [
            "tovarlar oldi-sotdisi bo'yicha shartnomada ko'rsatilgan baho."
        ]
    },
    {
        "word": "Shartnoma Boʻyicha Tannarx Kalkulatsiyasi ",
        "type": [],
        "definition": [
            "tannarxning buyurtmali kalkulatsiya tizimi bo'lib, u ishlab chiqarish ko'p vaqt talab qilinadigan mahsulotning katta miqdordagi biletlarga qo'llaniladi."
        ]
    },
    {
        "word": "Shartnoma Narxlari ",
        "type": [],
        "definition": [
            "bozor iqtisodiyotiga xos baholar, tovar ishlab chiqaruvchi va savdo tashkilotlari orasida kelishish natijasida belgilanadi. Bunda tovarlarga bo'lgan talab va taklif hal qiluvchi ahamiyatga ega bo'ladi. Ichki va xalqaro shartnoma narxlari farqlanadi. Ichki shartnoma belgilanganida tovarlar sotuvchi ham, xaridor ham naf ko'rgan narxlarda sotiladi. Ichki shartnoma narxlari erkin bozor, raqobat bor joyda yaxshi natija beradi. Xalqaro yoki tashqi shartnoma narxlari turli davlatlar yoki turli mamlakatlardagi korxona, tashkilotlarnnng bevosita tashqi aloqalariga xizmat qiladi. Tashqi shartnoma narxlari kontrakt narxlar deb yuritiladi. Ular jahon bozori konyunkturasiga qarab vaqti-vaqti bilan o'zgarib turadi."
        ]
    },
    {
        "word": "Shartnomalar Chizigʻi ",
        "type": [],
        "definition": [
            "ikki iste’molchi o'rtasida ikkita ne’matning samarali taqsimlanish variantlarini ifodalovchi chiziq."
        ]
    },
    {
        "word": "Shaxs ",
        "type": [],
        "definition": [
            "o'z qobiliyatidan kelib chiqan holda ma’lum bir ijtimoiy vazifani bajaruvchi inson. Shaxs vazifalarining turli xilligi, uning tuzilishini ifodalaydi. Jamiyatda shaxs boshqa individlar, ijtimoiy holat, shaxs va jamiyat o'rtasidagi munosabatlarni tartibga soluvchi, davlat turi bilan uzviy bog'liq."
        ]
    },
    {
        "word": "Shaxs Talabi ",
        "type": [],
        "definition": [
            "bitta iste’molchining tovarga talabi. "
        ]
    },
    {
        "word": "Shaxsan Tanlab Olinadigan Tovarlar ",
        "type": [],
        "definition": [
            "tovarning turlari, variantlari ko'p bo'lib, har bir xaridor didi, istaklari, tasawuriga mos keladigan turi, variantini tanlab, sotib olishi mumkin. "
        ]
    },
    {
        "word": "Shaxsiy (Bir Nomga Berilgan) Aksiyalar ",
        "type": [],
        "definition": [
            "ushbu hujjat egasi vakolatli shaxs bo'lgan aksiyalar. Ularningnomi aksiyada ko'rsatiladi va aksionerlik jamiyati kitobiga kiritiladi. Shaxsiy aksiyalar bo'yicha yonbosish, imtiyozlar, hujjatda boshqa shaxsga o'tkazilganligi va hujjat ham boshqa kishiga tegishli bo'lganligi haqidagi yozuv bilan amalga oshiriladi va uning yangi egasi hissadorlik jamiyati kitobiga kiritiladi. "
        ]
    },
    {
        "word": "Shaxsiy Daromad",
        "type": [],
        "definition": [
            "jismoniy shaxslarning soliq to'lagunga qadar daromadi."
        ]
    },
    {
        "word": "Shaxsiy Daromaddan Souq, ",
        "type": [],
        "definition": [
            "uy xo'jaligi va korxonalarning molmulklari va xizmatlaridan olgan daromaddan to'lanadigan soliq."
        ]
    },
    {
        "word": "Shaxsiy Ehtiyoj ",
        "type": [],
        "definition": [
            "alohida kishilar shaxsiy hayoti va faoliyati uchun kerak bo'ladigan narsalarga bo'lgan ehtiyoj."
        ]
    },
    {
        "word": "Shaxsiy Hisob Varaqasi",
        "type": [],
        "definition": [
            "bankning o'z mijozlari bilan bo'lgan barcha pul-kredit va hisob-kitob munosabatlarini aks ettiruvchi bank hujjati."
        ]
    },
    {
        "word": "Shaxsiy Hisob-Raqam",
        "type": [],
        "definition": [
            "korxonalarning hisob-kitob operatsiyalarni ko'rsatishga mo'ljallangan alohida ta’minotchilar, sotuvchilar va javobgar shaxslar bilan, shuningdek, kredit muassasalarining mijozlar, moliyaviy organlar va soliq to'lovchilar bilan analitik hisob-kitob yuritishning hisob-raqami."
        ]
    },
    {
        "word": "Shaxsiy Investitsiyalar ",
        "type": [],
        "definition": [
            "tadbirkorlar, xususiy firmalar, konsernlar va aksioner tashkilotlar tomonidan taqiqlanmagan faoliyatlarga sarflanadigan mulkdorlik va intellektual boyliklarni anglatadi."
        ]
    },
    {
        "word": "Shaxsiy Isteʼmol Fondlari ",
        "type": [],
        "definition": [
            "shaxsiy jamg'arma va iste’mol fondlarini tashkil etib, aynan shaxsiy iste’mol fondining ana shu ikki qismi tovar mexanizmining faoliyat ko'rsatishi uchun tegishli sharoitni yaratadi. "
        ]
    },
    {
        "word": "Shaxsiy Isteʼmol",
        "type": [],
        "definition": [
            "jamiyat a’zolarining yashashi va barkamol inson sifatida kamol topishlari uchun zarur bo'lgan moddiy va ma’naviy ne’matlar yig'indisidir."
        ]
    },
    {
        "word": "Shaxsiy Isteʼmol Uchun Sarflar",
        "type": [],
        "definition": [
            "uy xo'jaliklarining iste’mol daromadidan ayrim chegirmalar va imtiyozlar chegirib tashlanganidan so'ng olinadi."
        ]
    },
    {
        "word": "Shaxsiy Jamgʻarib Boriladigan Pensiya Hisob-Raqami",
        "type": [],
        "definition": [
            "fuqarolarning Xalq bankidagi egasi yozilgan shaxsiy hisobraqami bo'lib, badal kirituvchilarning jamg'arib boriladigan pensiya badallari va shaxsiy jamg'arib boriladigan pensiya hisobraqamlaridagi mablag'larga hisoblab qo'shilgan foizlar ana shu hisob-raqamga kelib tushadi va unda hisobga olinadi."
        ]
    },
    {
        "word": "Shaxsiy Mulk ",
        "type": [],
        "definition": [
            "jamiyatning alohida a’zolari tomonidan, individual yoki oilaviy ehtiyojlami qondiruvchi moddiy ne’matlarni o'zlashtirish bo'yicha tarkib topuvchi iqtisodiy munosabatlar, shaxsiy mulk subyekti (egalari), ayrim fuqarolar, uning obyekti esa iste’mol buyumlari (xolodilnik, televizor, mebel va h.k.) turar joy va boshqalar, umuman shaxsiy ehtiyojni qondirishga xizmat qiladigan vositalardir. Uning manbalari quyidagilar: topilgan daromad, merosga olingan yoki in’om sifatida olingan mol-mulk, dividend, bank foizi, xususiy tadbirkorlik daromadi va boshqalar O'zbekiston Respublikasida harakat qiluvchi mulkchilik to'g'risidagi qonunda shaxsiy mulk, umuman, fuqarolar mulki manbalari va uning davlat tomonidan kafolatlari belgilab berilgan."
        ]
    },
    {
        "word": "Shaxsiy Sugʻurta ",
        "type": [],
        "definition": [
            "sug'urta obyekti sifatida fuqarolarning hayoti, sog'Iig'i va mehnat qobiliyatini saqlash bilan bog'liq manfaatlar majmuasi shaklidagi sug'urta tarmog'i. Shaxsiy sug'urta hayot sug'urtasiga va baxtsiz hodisalardan sug'urtaga va tibbiy sug'urtaga bo'linadi. U riskli va jamg'arma funksiyalariga ega. Chet el tajribasida shaxsiy sug'urta to'rtta sug'urta klassidan iborat bo'lib, inson hayotida ro'y berish mumkin bo'lgan hodisalar (tug'ilish, o'lim, voyaga etish, nikohdan o'tish, ma’lum bir yoshgacha yashash) ehtimoli bilan bog'liq barcha sug'urta turlarini o'z ichiga oladi. Keng ma’noda shaxsiy sug'urta - bu uzoq muddatli hayot sug'urtasi, aralash sug'urta va annuitetlardir. "
        ]
    },
    {
        "word": "Shaxsiy Tajriba Yigʻilishi ",
        "type": [],
        "definition": [
            "bu ishchi bir xil jarayonni ko'p takrorlashi natijasida olinadigan ustachilik va o'z ishlab chiqaruvchanligi oshishi hisoblanadi."
        ]
    },
    {
        "word": "Shaxsiy Talab ",
        "type": [],
        "definition": [
            "- alohida odamlar, oilalar talabi."
        ]
    },
    {
        "word": "Shaxsni Muntazam Kamol Toptirish ",
        "type": [],
        "definition": [
            "fuqarolik jamiyati asoslarini barpo etishning muhim sharti va tarkibiy qismi. Shaxsni rivojlantirish jarayonlari insonning salohiyat va maqsadlarini ro'yobga chiqarish borasida nafaqat davlat, jamiyat ta’siri, balki shaxsning o'z sa’y-harakatlarini faollashtirishni ham taqozo etadi."
        ]
    },
    {
        "word": "Shaxsning Ehtiyoji ",
        "type": [],
        "definition": [
            "inson harakatga intilishni vujudga keltiruvchi biror-bir narsaning yo'qligini anglashidir. Uning normal hayot kechirishi uchun ozuqa, uy-joy, ob-havo zarur."
        ]
    },
    {
        "word": "Shaxta ",
        "type": [],
        "definition": [
            "foydali qazilmalarni yer ostidan qazib olish bilan shug'ullanuvchi konchilik korxonasi. Shaxtada yer osti va yer usti inshootlari bo'ladi. Yirik shaxtalarda yiliga bir necha million tonnagacha foydali qazilma olish mumkin. Shaxtalarning chuqurligi 100 m dan bir necha km ga yetadi. Eng chuqur shaxtalar Janubiy Afrika va Hindistonda bo'lib, ularning chuqurligi 3 km dan oshadi."
        ]
    },
    {
        "word": "Shirkat",
        "type": [],
        "definition": [
            "umumlashgan mulk va hamkorlik asosida ish yuritish faoliyati."
        ]
    },
    {
        "word": "Shirkat Firma",
        "type": [],
        "definition": [
            "bir necha tadbiroklarning o'zaro mulkiy birlashuvi va tadbirkorlikdan olinadigan foydani baham ko'rishga asoslangan sherikchilik korxonasi."
        ]
    },
    {
        "word": "Shisha Sanoati ",
        "type": [],
        "definition": [
            "sanoatning shishadan listli oyna, arxitektura-qurilish, optika, yorug'lik texnikasi, elektrotexnika materiallari, shisha idishlar, idish-tovoqlar, shisha tolalari va mahsulotlar ishlab chiqaruvchi tarmog'i. "
        ]
    },
    {
        "word": "Shmoller Gustav",
        "type": [],
        "definition": [
            "(1838-1917) nemis iqtisodchisi, yangi tarixiy maktabning asoschisi, siyosiy iqtisodni xalq xo'jaligi tarixi bilan bir deb qaradi, tarixiy formatsiyaga qarshi chiqdi, unga empirizm xos edi. Iqtisodiyotda odob-huquq omilini birinchi o'ringa qo'ygan."
        ]
    },
    {
        "word": "Shoʻba Korxona",
        "type": [],
        "definition": [
            "o'ziga biriktirib qo'yilgan mol-mulkka nisbatan mulkdor tomonidan mulk huquqi berilmagan tijoratchi tashkilot."
        ]
    },
    {
        "word": "Shosse ",
        "type": [],
        "definition": [
            "asfalt, beton, tosh va shag'al yotqizilgan 6 metrdan keng yo'llar. "
        ]
    },
    {
        "word": "Shou-Biznes ",
        "type": [],
        "definition": [
            "har xil pullik tomoshalar ko'rsatish yo'li bilan daromad topish. Shou-biznesdan tushadigan daromad bu aholidan olinadigan tomoshahaqi,firmalardantushadiganreklamapuli,tomoshabinlarga savdo-maishiy xizmat ko'rsatish haqi va boshqalarda shakllanadi."
        ]
    },
    {
        "word": "Shtakelberg Muvozanati ",
        "type": [],
        "definition": [
            "duopolik sharoitda lider firma bilan ergashuvchi firma faoliyat ko'rsatganda lider tovar narxini va ishlab chiqarish hajmini mustaqil belgilaydi, ergashuvchi firma lider firmaga moslashgan holda narx va mahsulot hajmini belgilaydi."
        ]
    },
    {
        "word": "Shubhali Kreditlar",
        "type": [],
        "definition": [
            "1. Uch to'lov davrida foiz yig'indisi to'lanmagan va bir marta asosiy qarz yig'indisi to'lanmagan kreditlardir. 2. Ziyon qilish ehtimoli yuqori bo'Igan, lekin ayrim ijobiy amallari mavjud bo'Igan ushbu kreditlar sharoit oydinlashguncha shubxali deb tasniflanadi. Shubhali deb tasniflangan kreditlarga asosiy to'lanmagan summasining 50 foizi miqdorida zaxira tashkil etiladi."
        ]
    }
]