[
    {
        "word": "Taʼlim",
        "type": [],
        "definition": [
            "l) shaxsning jismoniy va ma’naviy shakllanishining yagona jarayoni, ijtimoiy etalonlarning ijtimoiy ong sifatida u yoki bu darajada qayd qilingan, tarixan shartlangan ideal timsollarga ongli yo'naltirilgan ijtimoiylashish jarayoni; 2) muayyan bilimlarni egallash, g'oyaviy- axloqiy qadriyatlar, malaka, ko'nikma, axloq me’yorlariga qaratilgan jamiyat a’zolarining ta’lim va tarbiyasi vazifasini bajaradigan nisbiy mustaqil tizim. "
        ]
    },
    {
        "word": "Taʼlim Kreditlari ",
        "type": [],
        "definition": [
            "tijorat banklari filiallari tomonidan oliy ta’lim muassasalarining kunduzgi bo'limlariga to'lov-kontrakt asosida qabul qilingan O'zbekiston Respublikasi fuqarosi bo'lgan talabalarning o'qishi uchun talabalarning o'zlariga, ularning ota- onalariga yoki vasiylariga berilishi mumkin. "
        ]
    },
    {
        "word": "Taʼlim Sifatini Nazorat Qilish ",
        "type": [],
        "definition": [
            "'qitish mazmuni va natijalarining davlat ta’lim standartlari talablariga muvofiqligini tekshirish. "
        ]
    },
    {
        "word": "Taʼminlanmagan Kreditlar ",
        "type": [],
        "definition": [
            " biror-bir ta’minotsiz berilgan kreditlar. "
        ]
    },
    {
        "word": "Taʼrif Ish Haqi Fondi",
        "type": [],
        "definition": [
            "ishlab chiqarish texnologiyasiga ko'ra bajariladigan ishning hajmi, me’yori va razryadi stavkasiga ko'ra aniqlanadigan ish haqi fondi. "
        ]
    },
    {
        "word": "Taʼrif Jadvali ",
        "type": [],
        "definition": [
            " mehnatga haq to'lash razryadlari, ta’rif koeffitsientlari va stavkalarini ichiga olgan jadval. "
        ]
    },
    {
        "word": "Taʼsis Hujjatlari ",
        "type": [],
        "definition": [
            " yangi tashkil qilinuvchi korxona, kompaniya, aksiyadorlik jamiyatini ta’sis etish va ularni belgilangan tartibda ro'yxatga olish uchun asos bo'lib xizmat qiluvchi hujjatlar. "
        ]
    },
    {
        "word": "Taʼsis Shartnomasi ",
        "type": [],
        "definition": [
            "irmani ta’sis etuvchilarning o'zaro munosabatlarini aniqlovchi hujjat. "
        ]
    },
    {
        "word": "Taʼsischilarfoydasi",
        "type": [],
        "definition": [
            " aksionerlar jamiyati a’zolari tomonidan chiqarilgan aksiyalarning umumiy qiymati bilan aksiyalarni sotish orqali olingan umumiy qiymati o'rtasidagi farq bo'lib, u jamiyatni tashkil etuvchilar tomonidan aksiyadorlik jamiyatini tuzishda qo'shgan mablag' lariga qarab, ular tomonidan dividend shaklida o'zlashtiriladigan qiymatdir. "
        ]
    },
    {
        "word": "Tabaqalangan Marketing Strategiyasi ",
        "type": [],
        "definition": [
            "bozor bo‘g‘inlaridan bir nechtasi tanlanib, ularning har biri uchun alohida tovar taklif etish va maxsus marketing kompleksini qo'llashga mo'ljallangan marketing turi yoki strategiyasi. "
        ]
    },
    {
        "word": "Tabaqalangan Narx ",
        "type": [],
        "definition": [
            "bir xil yoki o'xshash tovarlarga, tovarning turli variantlari, turli savdo shart-sharoitlari farqiga qarab belgilanadigan har xil narx. "
        ]
    },
    {
        "word": "Tabiat Yodgorliklari ",
        "type": [],
        "definition": [
            "ekologik, ilmiy, estetik, madaniy jihatdan qimmatli, noyob, o'mini to'ldirib bo'lmaydigan, kelib chiqishi tabiiy va sun’iy bo'Igan obyektlar hisoblanadi. "
        ]
    },
    {
        "word": "Tabiatdan Foydalanish ",
        "type": [],
        "definition": [
            " tabiiy-resurs potensiali ekspluatatsiyasining va ularni saqlab qolish tadbirlarining barcha shakllari majmuyidir. Agar tabiatdan foydalanish tabiiy-resurs potensialining keskin o'zgarishiga olib kelmasa, u tabiatdan ratsional foydalanish hisoblanadi. "
        ]
    },
    {
        "word": "Tabiatdan Foydalanishni Litsenziyalash ",
        "type": [],
        "definition": [
            "ma’muriy-huquqiy yo'l bilan iqtisodiy-ekologik munosabatlarni tasdiqlash, ruxsat va vakolat berish metodlari orqali tartibga solishning namoyon bo'lishidir. "
        ]
    },
    {
        "word": "Tabiiy Boylik ",
        "type": [],
        "definition": [
            "tabiat tomonidan yaratilgan yer osti va yer usti boyliklari yig'indisi. "
        ]
    },
    {
        "word": "Tabiiy Ishsizlik ",
        "type": [],
        "definition": [
            " ishchi kuchi harakati va uning ma’lum bir jamiyat a’zosi sifatidagi mehnat hulqiga aloqador bo'Igan ish bilan band bo'lmaganlik holatiga aytiladi. "
        ]
    },
    {
        "word": "Tabiiy Monopoliya ",
        "type": [],
        "definition": [
            " ishlab chiqarish xarajatlarida iqtisod qilishga asoslangan monopoliya, bir firma o'z mahsulotini boshqa firmalarga nisbatan kam xarajatlar bilan ishlab chiqaradigan tarmoq. "
        ]
    },
    {
        "word": "Tabiiy Resurslar ",
        "type": [],
        "definition": [
            "tabiatning bir qismi (uning obyektlari jarayonlari, sharoitlari), ular insonlarning moddiy va ma’naviy ehtiyojlarini qondirish maqsadida jamiyat tomonidan ishlatiladi yoki ishlatilishi mumkin. Quyidagilar tabiiy resurslarning muhim turlari hisoblanadi: mineral, yer-suv resurslari, o'simlik va hayvonot dunyosi, quyosh energiyasi. Tabiiy resurslar iqtisodiy resurslarning tarkibiy qismi hisoblanadi. Ishlatilish turiga qarab baholangan u yoki bu hududdagi resurslarning jami tabiiy resurslar potensialini  tashkil etadi. Mamlakatning tabiiy resurslar potensiali uning milliy boyligining tarkibiy qismini tashkil etadi. "
        ]
    },
    {
        "word": "Tabiiy Resurslar Uchun Toʻlov ",
        "type": [],
        "definition": [
            "yer, suv, qazilma boyliklaridan foydalanganlik uchun korxona daromadidan davlat budjetiga to'lanadigan to'lov, joriy normativlar bo'yicha belgilanadi. Ushbu mablag'lar, birinchi navbatda, tabiat muhofazasi tadbirlariga sarflanadi. "
        ]
    },
    {
        "word": "Tadbirkor",
        "type": [],
        "definition": [
            " iqtisodiy resurslarni bir-biriga qo'shilishini ta’minlaydigan tashkilotchi, yangilikka intiluvchi, tashabbuskor, iqtisodiy va boshqa xavfdan, javobgarlikdan qo'rqmaydigan kishilar. Bunday xislatlar tadbirkorlik qobiliyati deb ataladi."
        ]
    },
    {
        "word": "Tadbirkorlik",
        "type": [],
        "definition": [
            " mulkchilik subyektlarining foyda olish maqsadida tavakkal qilib va mulkiy javobgarligi asosida amaldagi qonunchilik doirasida tashabbus bilan iqtisodiy faoliyat ko'rsatishdir. Amalda qabul qilingan qonunlar doirasida korxona, firma tashkil qilish, foyda olish maqsadida mahsulot ishlab chiqarish (yoki xizmat ko'rsatish) bilan shug'ullanuvchi faoliyat. Tadbirkorlik faoliyati bir yoki bir necha xususiy va huquqiy shaxslar mulklarini yoki qarzga olgan mulk, to'lov vositalarini ishga solish orqali amalga oshiriladi. O'zbekistonda tadbirkorlik faoliyatining sohiblari: l) respublika fuqarolari; 2) bir guruh fuqarolar (mehnat jamoalari va boshqalar); 3) chet ellik fuqarolar yoki xususiy shaxslar; 4) respublika fuqarosi bo'lmagan shaxslar (o'z vakolatlari doirasida); 5) qo'shma mulk egalari. "
        ]
    },
    {
        "word": "Tadbirkorlik Kapitali ",
        "type": [],
        "definition": [
            " tadbirkor (ishbilarmon) o'z faoliyatini yuritish uchun qo'lida zarur bo'lgan pul kapitaliga aytiladi. "
        ]
    },
    {
        "word": "Tadbirkorlik Qobiliyati ",
        "type": [],
        "definition": [
            " insonning ishlab chiqarish jarayonida qo'llaniladigan resurslardan qanday foydalanish xususida oqilona, maqsadga muvofiq qarorlarni qabul qila olishi, innovatsion jarayonlarda faol qatnashishi, tavakkal qilish va yutuqqa erishish layoqati; iqtisodiy resurslarning elementi. "
        ]
    },
    {
        "word": "Tadqiqot Muammosi ",
        "type": [],
        "definition": [
            " ijtimoiy ziddiyatlarni hal etish va ularni tartibga solish uchun turmushning biron-bir jabhasini o'rganishga bo'lgan ehtiyoj dir. "
        ]
    },
    {
        "word": "Tafakkur",
        "type": [],
        "definition": [
            " inson aqliy faoliyatining oliy shakli, insonlarni o‘rab olgan dunyodagi o'zaro bog'langan narsa va hodisalarni bilish jarayoni, muhim hayotiy jarayonlarni his qilish va muammolarni hal qilish, ma'lum bo'lmagan voqea hodisalarni qidirish, kelajakni ko'ra olish. Tafakkur, tushuncha, hukm, xulosa shakllarida namoyon bo'ladi."
        ]
    },
    {
        "word": "Tahlil Usullari ",
        "type": [],
        "definition": [
            " grafiklardan foydalangan holda tahlil qilish usullari. "
        ]
    },
    {
        "word": "Tajriba (Eksperiment) Oʻtkazish ",
        "type": [],
        "definition": [
            " shunday tadqiqot o'tkazish uslubiki, nazorat qilinadigan vaziyatda bir yoki bir necha omillar o'zgarishi bilan qolganlari o'zgartirilmas holatini saqlab qoladilar. "
        ]
    },
    {
        "word": "Taklif",
        "type": [],
        "definition": [
            " ishlab chiqaruvchilar bozorda sotishga tayyorlagan (chiqargan), muayyan narxlarga ega tovarlar va xizmatlar miqdori. "
        ]
    },
    {
        "word": "Taklif Chizigʻi ",
        "type": [],
        "definition": [
            " tovar narxi bilan taklif qilinadigan ushbu tovar miqdori o'rtasidagi bog'liqlikni ifodalovchi egri chiziq. "
        ]
    },
    {
        "word": "Taklif Egiluvchanligi (Elastikligi) ",
        "type": [],
        "definition": [
            " narx o'zgarishiga nisbatan taklifning ortib borishi. "
        ]
    },
    {
        "word": "Taklif Egri Chizigʻi ",
        "type": [],
        "definition": [
            " sotuvchilar bozorda taklif eta oladigan tovar narxi va miqdori o'rtasidagi bog'liqlikning grafik ifodasi. "
        ]
    },
    {
        "word": "Taklif Funksiyasi ",
        "type": [],
        "definition": [
            " taklifga tasir qiluvchi omillar miqdori bilan taklif miqdori urtasidagi bog'liqlikni ifodalovchi matematik bog'liqlik. "
        ]
    },
    {
        "word": "Taklif Hajmi ",
        "type": [],
        "definition": [
            " tadbirkor ma’lum narxga va vaqtda ishlab chiqarmoqchi hamda sotmoqchi bo'lgan mahsulotning miqdori. Masalan, bugun ertalab tadbirkor ishlab chiqargan 20 juft oyoq kiyimini bozorga olib chiqdi va har birini 40 ming so'mdan sotmoqchi, binobarin, taklif hajmi 20 juft oyoq kiyimga teng. "
        ]
    },
    {
        "word": "Taklif Hajmining Oʻzgarishi ",
        "type": [],
        "definition": [
            " tovar narxining o'zgarishi natijasida uning taklif miqdorining o'zgarishi. Masalan, shakar narxining ko'tarilishi uning taklifini oshiradi, uning pasayishi esa shakar taklifni qisqartiradi. "
        ]
    },
    {
        "word": "Taklif Inflyatsiyasi ",
        "type": [],
        "definition": [
            "iqtisodiyotda tovar va xizmatlar taklifi kamayib borishi natijasida narxning ko'tarilishi. Taklif qisqarishining asosiy sababi mahsulot birligiga sarflangan xarajatlarning o'sishidir. Xarajatlarning o'sishi natijasida vujudga keladigan inflyatsiyaning ikki shakli mavjud: a) ish haqining o'sish inflyatsiyasi ishlab chiqarilayotgan mahsulot hajmi to'lanadigan ish haqi va daromadlarga mutanosib borishi shart, agarda u buziladigan bo'lsa, jami taklif kamayadi, narx ko'tariladi; b) taklif mexanizmining buzilishi natijasida vujudga kelgan inflyatsiya, u kutilmaganda birdaniga xomashyo va energiya narxining ko'tarilishi natijasida vujudga keladi. Masalan, rivojlangan mamlakatlarda 1973-1974 va 1979-1980-yillarda chetdan olib kelinadigan neft narxining keskin ko'tarilishi. "
        ]
    },
    {
        "word": "Taklif Iqtisodiyoti Nazariyasi ",
        "type": [],
        "definition": [
            " hozirgi davr makroiqtisodiy nazariyasining bir qismi, unda inflyatsiya va ishsizlikni tushuntirish uchun xarajatlari va jami taklif tushunchalaridan foydalanilgan."
        ]
    },
    {
        "word": "Taklif Miqdori ",
        "type": [],
        "definition": [
            " ishlab chiqaruvchi (sotuvchi) muayyan vaqtda, muayyan joyda va muayyan narxda sotishni xohlaydigan va sotishi mumkin bo'Igan tovar va xizmatlar miqdori. "
        ]
    },
    {
        "word": "Taklif Qonuni ",
        "type": [],
        "definition": [
            " baho bilan taklif o'rtasidagi bog'liqlik, ya’ni bahoning o'sishi bilan taklifning hajmi ortishi, bahoning pasayishi natijasida esa taklifning qisqarishi. Ushbu o'ziga xos bog'liqlikka taklif qonuni deyiladi. U ishlab chiqaruvchilarning past bahoga nisbatan yuqori bahoda mahsulotlami ishlab chiqarish va bozorga taklif etish xohishlarini ko'rsatadi. Bunga sabab, tovarlarni yetkazib beruvchilar mahsulot evaziga pul oluvchi sifatida maydonga chiqadilar. Unga baho har bir mahsulot birligi uchun olgan tushumni tashkil etadi, bu esa mahsulotning o'rtasida bevosita ishlab chiqarish va sotishga rag'bat bo'lib xizmat qiladi. Taklif hajmiga bahodan tashqari bir qancha omillar ta’sir ko'rsatadi: resurslarga baholarning o'zgarishi, texnologiyalarning o'zgarishi, soliqlar va dotatsiyalardagi o'zgarish va h.k. "
        ]
    },
    {
        "word": "Taklif Qonuni ",
        "type": [],
        "definition": [
            " narx bilan sotishga chiqarilayotgan tovarlar o'rtasidagi bevosita, ya’ni to'g'ridan-to'g'ri bog'liqlikdir. "
        ]
    },
    {
        "word": "Taklif Setkasi ",
        "type": [],
        "definition": [
            " ish toifalari nisbatiga qarab ish haqi to'lash. "
        ]
    },
    {
        "word": "Taklif Strukturasi ",
        "type": [],
        "definition": [
            " tovar turlarining umumiy hajmiga nisbatan hissasi. "
        ]
    },
    {
        "word": "Taklifga Taʼsir Etuvchi Gʻayrinarxiy Omillar ",
        "type": [],
        "definition": [
            " talabga narxdan bo'lak ta’sir etuvchi omillar. 1. Resurslar baholarining o'zgarishi. Masalan, mineral o'g'itlarga bo'Igan bahoning pasayishi paxtaning taklifini oshiradi. 2. Texnologiyadagi o'zgarishlar. Masalan, paxta viltiga qarshi samarali vositani yaratish paxtaning taklifini oshiradi. 3. Dotatsiya va soliqlardagi o'zgarishlar. Masalan, sigaretlarga aksiz soliqlarining ortishi uning taklifini qisqartiradi; universitetlarga beriladigan dotatsiyalar kamayishi oliy ma’lumotli mutaxassislar taklifini kamaytiradi; 4. Boshqa tovarlarga bo'Igan bahoning o'zgarishi. Masalan, mol go'shtiga bo'Igan bahoning pasayishi qo'y go'shtining taklifini oshiradi. 5. Kutishdagi o'zgarishlar. Masalan, kelgusida neftga bo'Igan bahoning pasayishi neft kompaniyalarini uning j oriy taklifiga ko'nishlariga majbur qiladi. 6. Tovar ishlab chiqaruvchilarning sonining o'zgarishi. Masalan, muzlatkichlarni ishlab chiqaruvchi firmalar sonining o'sishi uning taklifining ortishiga olib keladi. "
        ]
    },
    {
        "word": "Taklifning Oʻzgarishi ",
        "type": [],
        "definition": [
            " g'ayrinarxiy omillar ta’siri natijasida ishlab chiqaruvchilarning sotmoqchi bo'Igan tovarlari yoki xizmatlari miqdorining o'zgarishi. Masalan, paxta viltiga qarshi samarali vositani yaratish paxtaning taklifini oshiradi."
        ]
    },
    {
        "word": "Takror Ishlab Chiqarish ",
        "type": [],
        "definition": [
            " uzluksiz davom etib, takrorlanib va tiklanib turuvchi ishlab chiqarish jarayoni. Ushbu jarayonning mavjudUgi sababi ehtiyojlarning mavjudligi va ularning о'sib borishidir. Uning amalga oshishi uchun ishlab chiqarishning barcha omillari (ish kuchi, ishlab chiqarish vositalari) mavjud bo'lishi kerak. Takror ishlab chiqarish ikki xil bo'ladi: a) oddiy takror ishlab chiqarish - ishlab chiqarishning miqdori o'zgarmagan holda takrorlanadi, ishlab chiqarish omillari o'zgarmagan holda harakat qiladi, yaratilgan qo'shimcha mahsulot shaxsiy iste’molga sarflanadi; b) kengaytirilgan takror ishlab chiqarish - ishlab chiqarish hajmi navbatdagi har bir ishlab chiqarish siklida ko'payadi, ishlab chiqarish omillari miqdori ortib boradi. Tovar ishlab chiqarish kengaytirilgan miqyosda sodir bo'lishi uchun har bir siklning boshida qo'shimcha sifatliroq resurslar zarurdir. Bunga erishish kengaytirilgan takror ishlab chiqarishning manbai bo'lib qo'shimcha mahsulot xizmat qiladi, uning hammasini shaxsiy iste’molga sarf etmay, ma’lum qismi ishlab chiqarishni kengaytirish uchun sarf etiladi. "
        ]
    },
    {
        "word": "Taktik Rejalashtirish ",
        "type": [],
        "definition": [
            " kompaniya (korxona) faoliyatining barcha yo'nalishlari bo'yicha muayyan xatti-harakatlarni aniqlash; joriy reja tuzish va uni amalga oshirish yo'llarini ishlab chiqish. "
        ]
    },
    {
        "word": "Talab",
        "type": [],
        "definition": [
            " iste’molchining muayyan joyda va muayyan vaqtda tovar yoki xizmat sotib olish imkoniyatidir. Boshqacha qilib aytadigan bo'Isak, bu pul bilan ta’minlangan ehtiyoj, ya’ni to'lovga qodir ehtiyojdir. Aynan mana shu ehtiyojga qarab, bozorga chiqarilishi lozim bo'lgan tovarlarning miqdori va assortimenti aniqlanadi. "
        ]
    },
    {
        "word": "Talab Chizigʻi ",
        "type": [],
        "definition": [
            " talab bilan narx o'rtasidagi bog'liqlikning chizma ifodasi. "
        ]
    },
    {
        "word": "Talab Chizigʻi ",
        "type": [],
        "definition": [
            " tovar narxi bilan sotib olinadigan ushbu tovar miqdori o'rtasidagi bog'liqlikni ifodalovchi egri chiziq. "
        ]
    },
    {
        "word": "Talab Egri Chizigʻi ",
        "type": [],
        "definition": [
            " tovarga qo'yilgan narx bilan talab miqdori o'rtasidagi bog'liqlikning grafik ifodasi. "
        ]
    },
    {
        "word": "Talab Funksiyasi ",
        "type": [],
        "definition": [
            " talabga ta’sir qiluvchi omillar miqdori bilan talab miqdori o'rtasidagi bog'liqlikni ifodalovchi matematik bog'liqlik. "
        ]
    },
    {
        "word": "Talab Hajmi ",
        "type": [],
        "definition": [
            " iste’molchilar ma’lum narxda va vaqtda xarid qilishi mumkin bo'lgan mahsulot miqdori. Masalan, hozir xaridor 10 kg kartoshka sotib olmoqchi va unga imkoniyati bor, binobarin 10 kg kartoshka talab hajmini tashkil etadi. "
        ]
    },
    {
        "word": "Talab Hajmining Oʻzgarishi ",
        "type": [],
        "definition": [
            "tovarlar narxining o'zgarishi natijasida xarid qilinayotgan tovarlar miqdorining o'zgarishi. Masalan, guruch narxining pasayishi unga bo'lgan talab hajmini oshiradi va aksincha. Talabga ta’sir etuvchi g'ayrinarxiy omillar  talabga narxdan bo'lak tasir etuvchi omillardir. Bular: 1. Iste’molchilar didlarining o'zgarishi. Masalan, jismoniy sog'lom bo'lish keng yoyilsa, bunda sport anjomlariga talab oshadi. 2. Sotib oluvchilar sonining o'zgarishi. Masalan, aholining kamayishi xaridorlaming kamayishiga olib keladi, buning natijasida tovar va xizmatlarga bo'lgan talab kamayadi. 3. Daromadlarning o'zgarishi, daromadlarning o'sishi insonlarning mahsulot sotib olish imkoniyatlarini oshiradi, bu esa talabning o'sishiga olib keladi va aksincha. 4. Bir-biriga bog'liq tovarlar baholarining o'zgarishi. 5. Iste’molchilarning kutishidagi o'zgarishlar. Masalan, biron davlatda iqtisodiyot keyingi yilda tanazzulga yuz tutishi kutilmoqda, bu esa inflyatsiyaning o'sishi demakdir. Buning natijasida insonlarning ko'chmas mulk, uzoq muddat ishlatiladigan uy-ro'zg'or anjomlariga bo'lgan joriy talabi oshadi."
        ]
    },
    {
        "word": "Talab Inflyatsiyasi ",
        "type": [],
        "definition": [
            " iqtisodiyotda talabning keskin oshib ketishi va uni ishlab chiqarishning real hajmi bilan qondirilishi mumkin emasligi sababli talabning taklifga nisbatan ortiqligi natijasida narxlarning ko'tarilishi. Talab inflyatsiyasining asosiy sababi aholining ish bilan to'liq bandligi, ish haqining oshib borishi hisoblanadi. Talab inflyatsiyasi ayrim hollarda quyidagi ibora bilan tushuntiriladi: “juda ko'p pullar juda oz miqdordagi tovarlarni ovlaydi”. "
        ]
    },
    {
        "word": "Talab Koʻrsatkichlari ",
        "type": [],
        "definition": [
            "talabni miqdor va sifat jihatidan ifoda etadigan belgilar, vositalar. "
        ]
    },
    {
        "word": "Talab Miqdori ",
        "type": [],
        "definition": [
            " iste’molchi muayyan vaqtda, muayyan joyda va muayyan narx bo'yicha sotib olishni xohlaydigan va sotib olishi mumkin bo'lgan tovar va xizmatlar miqdori. "
        ]
    },
    {
        "word": "Talab Qayishqoqligi ",
        "type": [],
        "definition": [
            "talabning unga ta’sir etuvchi omilning o'zgarishi natijasida o'zgarish qobiliyati bo'lib, qayishqoqlik koeffitsientida o'z aksini topadi. "
        ]
    },
    {
        "word": "Talab Qonuni ",
        "type": [],
        "definition": [
            " mahsulot narxi bilan sotib olinayotgan tovar miqdori o'rtasida bo'ladigan teskari yoki qarama-qarshi bog'liqlikning mavjudligi. Talab qonuni orqali talabni tovarlar va xizmatlarga bo'lgan ehtiyojlari aniqlanadi. Baho bilan talab o'rtasida teskari bog'liqlik mavjud ekanini ifodalaydi. Tovarlarning va ko'rsatilayotgan xizmatlarning baholari bilan talab hajmi o'rtasida bog'liqlikbo'ladi. Ana shu bog'liqlikka talab qonuni deyiladi. Uning asosida nima yotishini tushunish uchun quyidagilarga e’tibor berish zarur: insonga mahsulotning keyingi birliklari borgan sari kamroq qoniqishberadi, xaridor qo'shimcha mahsulotlarningbahosipasayib borishi sharoitida sotib oladi. Yuqoriroq darajada talab qonunini daromad va o'rnini bosish samarasi bilan tushuntirish mumkin. Daromad samarasi mahsulot bahosi pasayishi xaridorni sotib olish qobiliyatini oshiradi va buning natijasida u oldingiga nisbatan bu tovardan ko'proq tovar sotib oladi. Masalan, mol go'shtiga bahoning pasayishi xaridor daromadining sotib olish quwatini to'ldiradi va u oldingiga nisbatan ko'p hajmda mol go'shti sotib oladi. O'rnini bosish samarasida baho past bo' lgan sharoitda insonda arzon tovarni sotib olishga rag'bat paydo bo'ladi, qimmatga nisbatan, masalan, mol go'shtiga baho past bo'lganda, xaridorlar qo'y yoki parranda go'shti o'rniga mol go'shtini sotib oladi. Daromad samarasi bilan o'rnini bosish samarasi birga qo'shiladi. Natijada iste’molchilarda mahsulotlarni ko'proq miqdorda qimmat emas, balki arzon baholarda sotib olishga layoqat va xohish vujudga keladi. Talabni faqat baho aniqlamaydi unga boshqa omillar, xususan, xaridorlar didlarining o'zgarishi, bog'liq tovarlar baholarining o'zgarishi, iste’molchilaming kutishlaridagi o'zgarishlar va h.k. tasir ko'rsatadi. "
        ]
    },
    {
        "word": "Talab Va Taklifning Narxsiz Determinant (Aniqlovchl) Lari ",
        "type": [],
        "definition": [
            " muayyan tovar uchun talab va taklifning o'zgarishiga sabab bo'luvchi, narxdan tashqari omillar. Talab uchun bunday aniqlovchilarga, masalan, moda, mavsum yoki iste’molchilar daromadlarining o'rtacha ko'rsatkichi kiradi, taklif uchun esa - umumiy xarajatlar. "
        ]
    },
    {
        "word": "Talabalarni Kasbga Yoʻnaltirish ",
        "type": [],
        "definition": [
            "talaba-yoshlarga kelajakda o'z kasblarini aniqlab olish uchun yordam ko'rsatishga qaratilgan ijtimoiy-iqtisodiy, psixologik, pedagogik, tibbiy-biologik va ishlab chiqarish texnik tadbirlarning asoslangan tizimi. "
        ]
    },
    {
        "word": "Talabni Baholash ",
        "type": [],
        "definition": [
            "umuman yoki aniq tovar bo'yicha talab hajmi, darajasi, o'zgarishini uning ko'rsatkichlari yordamida aks ettirish, taqqoslash va xulosa qilish jarayoni. "
        ]
    },
    {
        "word": "Talabning Oʻzgarishi ",
        "type": [],
        "definition": [
            " g'ayrinarxiy omillar natijasida so'ralayotgan tovarlar miqdorining o'zgarishi. Masalan, faraz qilamizki, iste’molchilar didlarining o'zgarishi natijasida jismoniy sog'lom bo'lish keng yoyiladi, unda sport anjomlariga talab oshadi. "
        ]
    },
    {
        "word": "Talabni Prognoz Qilish ",
        "type": [],
        "definition": [
            " talabning kelgusida bo'lajak holati va o'zgarishlarini ilmiy asosda oldindan aniqlash jarayoni. "
        ]
    },
    {
        "word": "Talabni Tahlil Qilish ",
        "type": [],
        "definition": [
            "umumiy talabni tarkibiy qismlarga, elementlarga bo'lib, ulardan qiziqtirganlarini ajratib olib6 o'rganish jarayoni. "
        ]
    },
    {
        "word": "Talabning Darajasi ",
        "type": [],
        "definition": [
            " talab hajmining biror ko'rsatkich, belgi, mo'ljalga nisbatan qiyosiy ifodasi. "
        ]
    },
    {
        "word": "Talab Ning Hajmi ",
        "type": [],
        "definition": [
            " ma’lum tovarga bo'Igan talabning natural birlik yoki so'mda ifodalangan umumiy miqdori. "
        ]
    },
    {
        "word": "Talabning Narx Boʻyicha Oʻzgaruvchanligi ",
        "type": [],
        "definition": [
            "narx o'zgarganda, sotish hajmi qanchaga o'zgarganligini ko'rsatadi. "
        ]
    },
    {
        "word": "Talabning Rivojlanish Qonuniyatlari ",
        "type": [],
        "definition": [
            "talabning zaruriy obyektiv o'zgarishlarini aks ettiruvchi jarayonlar. "
        ]
    },
    {
        "word": "Talabning Strukturasi ",
        "type": [],
        "definition": [
            " umumiy talabni tashkil etuvchi elementlar va ularning hissalari. "
        ]
    },
    {
        "word": "Talabning Tarkibi ",
        "type": [],
        "definition": [
            " umumiy talabni tashkil etuvchi elementlar ro'yxati. "
        ]
    },
    {
        "word": "Tamoyil",
        "type": [],
        "definition": [
            " belgilangan qoida, u bilan har qanday faoliyatda, shu jumladan boshqaruv faoliyatida ham foydalanish mumkin. "
        ]
    },
    {
        "word": "Tanlanma",
        "type": [],
        "definition": [
            " o'rganilayotgan to'plamdan saylab olingan birliklar majmuasidir, ularning har biri ushbu to'plamning tarkibiy elementi. "
        ]
    },
    {
        "word": "Tannarx",
        "type": [],
        "definition": [
            "korxonalar mahsulot tayyorlashga qiladigan sarflarning pul shaklida ifodalanishi. Mahsulot tannarxini hisoblash iqtisodiyotning har bir tarmog'ida o'z xususiyatiga ega. Shuning uchun ham amalda mahsulot birligi tannarxi, yuk tashish tannarxi, qurilish-montaj ishlari tannarxi kabi tarmoq hisob-kitob usullari qo'llaniladi. Birlik tannarxi qilingan sarf-xarajatlarni tayyorlangan mahsulot yoki bajarilgan ishlarning miqdoriga bo'lish orqali hisoblanadi. Sanoatda tovar mahsuloti tannarxi qo'llanilib, o'z navbatida 3 ta turga - sex, korxona va to'la yoki tijorat tannarxiga bo'linadi. Sex tannarxi shu sex doirasida, korxona tannarxi korxona doirasidagi tovar ishlab chiqarish xarajatlarini o'z ichiga oladi. To'la tannarx esa barcha ishlab chiqarish xarajatlaridan tashqari, tovarni iste’molchiga yetkazib berish bilan bog'liq bo'Igan xarajatlarni o'z ichiga oladi. Mahsulot tannarxiga quyidagilar kiradi: a) xomashyo va materialiar; b) yoqilg'i va moylash materiallari; d) elektr energiya xarajatlari; e) amortizatsiya ajratmasi; f) ish haqi; g) ijtimoiy sug'urta ajratmalari; h) umumiy ishlab chiqarish xarajatlari; i) umumiy xo'jalik xarajatlari. Bozor iqtisodiyotiga o'tilishi munosabati bilan “Korxonalar va tashkilotlardan olinadigan soliqlar to'g'risida’gi O'zbekiston Respublikasi qonuniga binoan tibbiyot sug'urtasiga to'lov, majburiy sug'urta to'lovi, qisqa muddatli bank kreditiga foiz ajratmasi to'lovlari joriy etilishi tannarx tarkibiga qo'shimcha xarajatlar kiritdi. Bozor iqtisodiyoti sharoitida mahsulot ishlab chiqarish va sotish tannarx miqdoriga bog'liqdir. Zero, ishlab chiqarish uchun eng asosiy masala shuki, yuqori foyda olish va raqobatda yutish tannarxini qanchalik kamaytira olishga bog'liq bo'ladi."
        ]
    },
    {
        "word": "Tanqid",
        "type": [],
        "definition": [
            " amaldagi faoliyatning takomillashtirilishini ko zlab turib, uning salbiy jihatlarini ko'rsatish, baho berish. "
        ]
    },
    {
        "word": "Tanqid Qilish ",
        "type": [],
        "definition": [
            " mehnat faoliyati jarayonida xodimlarning bir-birlari sha’niga tanqidiy mulohazalar bildirishidir. "
        ]
    },
    {
        "word": "Tantema",
        "type": [],
        "definition": [
            " savdo, sanoat, bank, aksionerlar tashkilotlari foydasidan bu tashkilotlarning boshqaruv xodimlariga to'lanadigan qo'shimcha mukofot. "
        ]
    },
    {
        "word": "Taqchillik (Tanglik) ",
        "type": [],
        "definition": [
            " xalq iste’mol tovarlari va xizmatlarning aholi talabini qondirish uchun yetishmasligi. "
        ]
    },
    {
        "word": "Taqsimlanmagan Foyda Soligʻi ",
        "type": [],
        "definition": [
            " alohida soliq to'lovchi sifatida tan olingan aksionerlik kompaniyalari, banklar va boshqa institutlar foydasining dividendlarga taqsimlanmagan qismidan olinadi. "
        ]
    },
    {
        "word": "Taqsimlash Samarasi ",
        "type": [],
        "definition": [
            " biror-bir davr mobaynida ishlab chiqarilgan, ma’lum miqdordagi mahsulot iste’molchilar o'rtasida taqsimlanadigan ahvol, bunda bir iste’molchining ahvolini boshqa iste’molchining ahvolini yomonlashtirmasdan yaxshilab bo'lmaydi. "
        ]
    },
    {
        "word": "Taqsimlovchi Schyotlar ",
        "type": [],
        "definition": [
            " ma’lum ishlab chiqarish xarajatlarini hisobga olish va ularnig kalkulyatsiya obyektlari, hisobot davrlari va hokazolar bo'yicha to'g'ri taqsimlashni ta’minlash uchun tayinlangan buxgalteriya hisobi schyotlari. Taqsimlovchi schyotlar ikki turda bo'ladi. Ularning bir xili hisobot davri davomida egri xarajatlar smetasining bajarilishi va hisobot davri oxirida kalkulyatsiya obyektlari bo'yicha taqsimlanishi ustidan nazorat qilish uchun tayinlangan. Bunday schyotlar yig'uvchi-tarqatuvchi hisoblanadi. Boshqa taqsimlovchi schyotlar kelgusi davrlar xarajatlari bo'yicha to'g'ri taqsimlash uchun tayinlangan. Bunday schyotlarga davrlar bo'yicha taqsimlovchi schyotlar deyiladi. Ular budjet-taqsimlovchi ham deyiladi. "
        ]
    },
    {
        "word": "Taqsimot Kanali ",
        "type": [],
        "definition": [
            "bu tovarni savdo joylariga etkazib berishni ta’minlovchi tizimdir. "
        ]
    },
    {
        "word": "Taqsimot Qatorlari ",
        "type": [],
        "definition": [
            " to'plam birliklarini ma’lum belgilar asosida guruhlarga (qismlarga) bo'linishi. "
        ]
    },
    {
        "word": "Taraqqiyot Budjeti ",
        "type": [],
        "definition": [
            "davlat budjetining tarkibiy qismi, uning kapital xarajatlari tarkibida shakllantiriladi va investitsion loyihalarni kreditlashtirish, investitsiyalashtirish va kafolatli ta’minlash uchun foydalaniladi. "
        ]
    },
    {
        "word": "Tarbiya",
        "type": [],
        "definition": [
            " 1) shaxsning ma’naviy va jismoniy holatiga muntazam va maqsadga muvofiq ta’sir etish; 2) pedagogik jarayonda ta’lim maqsadlarini amalga oshirish uchun pedagog va tarbiyalanuvchilarning maxsus tashkil etilgan faoliyati. "
        ]
    },
    {
        "word": "Targibot (Pablisitl)",
        "type": [],
        "definition": [
            " iste’molchilarda korxona va uning tovari to'g'risida yaxshiroq tasawur shakllantirish maqsadida ommaviy axborot vositalari orqali ma’Iumotlar tarqatish va tushuntirish. "
        ]
    },
    {
        "word": "Tarif",
        "type": [],
        "definition": [
            "1. Korxonalar, tashkilotlar, alohida ko'rsatiladigan turli ishlab chiqarish va noishlab chiqarish yo'nalishidagi xizmatlar uchun to'lanadigan haq. 2. Rasmiy belgilangan stavka, soliq, birorta to'lov yig'im, stavkalar tizimi, masalan: transport tariflari, aloqa bo'yicha, bojxona tariflari.  "
        ]
    },
    {
        "word": "Tarif Koeffitsiyenti ",
        "type": [],
        "definition": [
            " tarif setkasini tasniflovchi tarif tizimining elementi. U yoki bu razryad tarif stavkasini bir hisobiga qabul qilinadigan birinchi razryad tarif stavkasiga nisbati. Tarif koeffitsiyenti ushbu razryadga mansub ishchilar (xodimlar) ish haqi darajasining eng malakasiz (1-razryadli) ishchilarga nisbatan ortiqchaligini ko'rsatadi. "
        ]
    },
    {
        "word": "Tarif Razryadi ",
        "type": [],
        "definition": [
            "ishchi bajaradigan ishlarning murakkabligini va malaka darajasini tavsiflovchi ko'rsatkich, ta’rif setkasi elementlaridan biri hisoblanadi. "
        ]
    },
    {
        "word": "Tarif Setkasi ",
        "type": [],
        "definition": [
            " ikkinchi, uchinchi va hokazo razryad stavkasiga ega bo'lgan ishchilarning birinchi razryad stavkasiga nisbatini aniqlovchi shkala. Yagona tarif setkasini davlat ishlab chiqib, joriy etadi. Shuningdek, davlat tomonidan belgilangan minimal ish haqi darajasi tarif setkasiga asosan ish haqini belgilashning asosi bo'ladi. Keyingi razryadga taalluqli bo'lgan ishchilarning ish haqlari razryad oralaridagi belgilangan koeffitsiyentga ko'ra hisoblab chiqariladi. "
        ]
    },
    {
        "word": "Tarif Stavkasi ",
        "type": [],
        "definition": [
            " ishchining razryadiga muvofiq unga ma’lum vaqt birligi (soat, kun) uchun to'lanadigan haq miqdorini aniqlaydi. Odatda, tarif stavkasi birinchi razryad uchun belgilanib, qolgan razryadlar uchun esa birinchi razryad tarif stavkasi qolgan razryadlar tarif koeflitsientiga ko'paytirish yo'li bilan aniqlanadi. "
        ]
    },
    {
        "word": "Tarif Tizimi ",
        "type": [],
        "definition": [
            " ishlab chiqarish turlari, ish sharoiti, ishchining malakasiga ko'ra ish belgilash uchun qaratilgan normativ hujjatlar jamlanmasi. Tarif tizimi o'z ichiga quyidagilarni qamrab oladi: tarif stavkalari, tarif setkalari, tarif malaka ma’lumotnomasi. "
        ]
    },
    {
        "word": "Tarif-Malaka Maʼlumotnomasi ",
        "type": [],
        "definition": [
            "ishchilarni tasniflash (tarifikatsiyalash) va ishchilarga malakaviy razryadlarni berish uchun foydalaniladigan me’yoriy hujjat. U tarif tizimining elementi hisoblanadi. Tarif malaka ma’lumotnomasida xizmatchilarning kasbi va mahoratiga ko'ra tarif setkasidagi qaysi razryadga taalluqli ekanligi ko'rsatilgan bo'ladi. "
        ]
    },
    {
        "word": "Tarixiy Maktab ",
        "type": [],
        "definition": [
            "Germaniyada (vakillari: F. List, V. Rosher, B. Gildebrand, K. Knis) vujudga kelgan siyosiy iqtisod. Unda foydalilikva yuqori nafbirinchi o'ringa qo'yiladi. Iqtisodiy qonunlar inkor etilib, iqtisodiy tarix bilan almashtiriladi. "
        ]
    },
    {
        "word": "Tarkibida Shaharlar! Boʻlgan Tuman Budjeti ",
        "type": [],
        "definition": [
            "umumtuman budjeti hamda tuman bo'ysunuvidagi shaharlar budjetlari. "
        ]
    },
    {
        "word": "Tarkibiy Inqiroz ",
        "type": [],
        "definition": [
            " xomashyo, tovarlarning keskin yetishmasligi natijasida vujudga keladi. Bunga misol qilib energetik resurslarning yetishmasligini olish mumkin. Oqibatda talab va taklif mutanosibligi buziladi va xomashyoning bahosi ko'tarilib ketadi. Natijada shu vaqtgacha yashirin ko'rinishda bo'Igan iqtisodiyotning muhim tarmoqlarida ortiqcha yig'ilib qolgan kapitallar yuzaga chiqadi. Ularda ishlab chiqarish vositalarining bir qismida ishlab chiqarish samarasiz bo'lib qoladi, ishlab chiqarish to'xtaydi, korxonalar yopiladi, ishsizlik ko'payadi. Tarkibiy inqirozlar davriy xarakterga ega emas, ammo uzoq muddat davom etishi bilan xarakterlanadi. Davriy inqirozdan farqli ravishda, tarkibiy inqirozda, masalan, po'lat qo'yish, ko'mir sanoati izdan chiqib turganda, to'qimachillk sanoati, kemasozlik va shunga o'xshash ayrim alohida tarmoqlar rivojlanishi mumkin. "
        ]
    },
    {
        "word": "Tarkibiy Ishsizlik ",
        "type": [],
        "definition": [
            " iqtisodiyotni tarkibiy qayta qurish oqibatida ishchi kuchiga talab tarkibida o'zgarish ro'y berishi natijasida yuzaga keladigan majburiy ishsizlikning ko'rinishi. "
        ]
    },
    {
        "word": "Tarkibiy Oʻzgarishlar ",
        "type": [],
        "definition": [
            "milliy iqtisodiyotning samarali va barqaror tarkibiy tuzilishini ta’minlash maqsadida uning tarmoq va sohalarini izchil ravishda o'zgartirib borish. Tarkibiy o'zgarishlar yangi tarmoqlami barpo etish, ba’zilarini kengaytirish, ayrim samarasiz, istiqbolga ega bo'lmagan tarmoqlarni qisqartirish kabi chora- tadbirlarni o'z ichiga oladi. "
        ]
    },
    {
        "word": "Tarkibiy Siyosat ",
        "type": [],
        "definition": [
            " milliy iqtisodiyotning fan, texnika va texnologiyadagi o'zgarishlarga muvofiq tarzda umumiy va alohida ehtiyojlarni hisobga olgan holda rivojlantirishga qaratilgan tadbirlar tizimi. "
        ]
    },
    {
        "word": "Tarmoq",
        "type": [],
        "definition": [
            " 1. Jarayonlarning maxsus bo'limlarga ajratilishi, masalan, “qishloq xo'jaligi” “yengilsanoat ”\/‘og'irsanoat”vahokazo. 2. Qo'llanilayotgan vositalar, ishlab chiqarish texnologiyasi, tashkil qilish xususiyati hamda mahsulotlardan foydalanish tartibiga ko'ra bir-biridan farq qiladigan ishlab chiqarishning bir qismi. "
        ]
    },
    {
        "word": "Tarmoq Tasnifi ",
        "type": [],
        "definition": [
            "hisobotlarni soddalashtiradi, iqtisodiy jarayonlarni tahlil qilishga va modellashtirishga imkon yaratadi, iqtisodiy siyosatni yuritishda qulayliklar tug'diradi."
        ]
    },
    {
        "word": "Tarmoqlararo Balans ",
        "type": [],
        "definition": [
            " MHTning muhim bo'limi bo'lib, uning yordamida tarmoqlararo aloqalar, oraliq iste’mol, tarmoqlar ishlab chiqarishi va talabi orasidagi murakkab bog'lanishlar tadqiq qilinadi. "
        ]
    },
    {
        "word": "Tarmoqlararo Balans ",
        "type": [],
        "definition": [
            " tarmoqlararo ishlab chiqarish va ijtimoiy mahsulotni taqsimlash, iqtisodiy matematik model bo'lib, u yakuniy natijalar bo'yicha bir-biriga bog'liq bo'lgan (shaxmat balans), mahsulot taqsimoti balansining ko'paytma ustamasidan (jadval satrlari) va ularni ishlab chiqarish xarajatlaridan (ustunlari) tashkil topgan bo'ladi; u tarmoqlarning ishlab chiqarish va xo'jalik aloqalarini o'zida aks ettiradi. Tarmoqlararo balans pul va natura shaklida tuziladi. Asosiy ko'rsatkichlari - to'liq xarajatlar koefitsientlari va bevosita xarajatlar koefiitsientlaridan iborat bo'ladi. U xorijda “ishlab chiqarish xarajatlari” usuli deb ataladi. "
        ]
    },
    {
        "word": "Tartibga Solish ",
        "type": [],
        "definition": [
            " iqtisodiyotning ma’lum bir holatda bo'lishini ta’minlash. Iqtisodiyot subyektlari aloqalarini o'zgartirishni yoki quwatlashni ta’minlovchi, maqsadli yo'naltirilgan jarayonlar. Masalan: sohalar, pul-kredit, moliya, tashqi iqtisodiy aloqalarni tartibga solish. "
        ]
    },
    {
        "word": "Tartibga Soluvchi (Tartiblovchi) Daromadlar ",
        "type": [],
        "definition": [
            " tegishli budjetda ko'zda tutilgan barcha xarajatlami to'liq qoplash maqsadida umumdavlat soliqlaridan quyi budjetdagi biriktirilgan daromadlarning ustiga yuqori budjetdan beriladigan daromadlar. Bunday daromadlarning tarkibiga qo'shilgan qiymat solig'i, aksizlar, korxonalardan olinadigan daromad (foyda) solig'i, jismoniy shaxslardan olinadigan daromad solig'i kabilar kiradi. Bu soliqlar bo'yicha daromadlar quyi budjetlardagi tushumlarni tartibga solish uchun moliyaviy hisobot davrida (odatda, bir yilda) belgilangan tartibda tasdiqlangan stavkalar bo'yicha soliqlardan foiz ajratmalari ko'rinishida foydalaniladi. Tartibga soluvchi daromadlar bo'yicha ajratmalar bevosita quyi budjetlarga borib tushadi, ajratmalar stavkasi (normativi) esa davlat budjeti tasdiqlanayotgan paytda aniqlanadi. "
        ]
    },
    {
        "word": "Tartibga Soluvchi Schyotlar ",
        "type": [],
        "definition": [
            " xo'jalik mablag'lari baholarini tuzatish (tartibga solish), bu mablag'lar holati to'g'risida qo'shimcha ko'rsatkichlarni olish, shuningdek, ularning manbalarini aniqlash uchun tayinlangan buxgalteriya hisobi schyotlari. Har bir schyot ma’lum asosiy schyotni tartibga solish uchun tayinlangan. Bunda tartibga soluvchi schyotlarda hisobga olingan summa asosiy schyot summasiga qo'shiladi, yoki undan olib tashlanadi. Tartibga soluvchi schyotlami qo'llash zaruriyati xo'jalik mablag'larini baholash bo'yicha belgilangan qoidalar bilan bog'liq."
        ]
    },
    {
        "word": "Tartibga Soluvchi Soliqlar",
        "type": [],
        "definition": [
            " budjet darajasiga qarab ajratmalar miqdori belgilanadigan barcha turdagi soliqli daromadlar. "
        ]
    },
    {
        "word": "Tartib-Intizom ",
        "type": [],
        "definition": [
            "birgalikda amalga oshiriladigan faoliyatning muayyan turdagi tashkiliy shakllari va qonun-qoidalarini barqaror saqlab turish uchun xizmat qiladigan o'ziga xos munosabatlar shakli. "
        ]
    },
    {
        "word": "Tasarruf Etish ",
        "type": [],
        "definition": [
            " mulk bo'lgan boylik taqdirini mustaqil hal etish. "
        ]
    },
    {
        "word": "Tasdiqlangan Kafolatlar ",
        "type": [],
        "definition": [
            " kafolatlarni tasdiqlash shaklida namoyon bo'ladi. Masalan, bank o'z mijozi bo'lgan importyorning to'lov majburiyatlari bo'yicha kafolat bergan bo'lsa, eksportyorning banki ham ushbu kafolatlar bo'yicha majburiyatni o'z zimmasiga oladi. Bu esa, mavjud kafolatlarni tasdiqlash yo'li bilan amalga oshiriladi. "
        ]
    },
    {
        "word": "Tashabbuskorlik",
        "type": [],
        "definition": [
            " tadbirkorlik, yaratuvchanlik, tajribachilik. "
        ]
    },
    {
        "word": "Tashabbusli Auditorlik Tekshiruvi ",
        "type": [],
        "definition": [
            " tashabbusli audit har qanday vaqtda hamda xohlagan hajmda o'tkazilishi mumukin. Uni o'tkazish hajmi yuridik shaxs bo'lgan xo'jalik subyekt boshqaruv organi yoki tadbirkorlik faoliyati bilan shug'ullanuvchi jismoniy shaxs bilan auditorlik tashkiloti o'rtasidagi kelishuv asosida belgilanadi. "
        ]
    },
    {
        "word": "Tashkiliy Huquqiy Tizim ",
        "type": [],
        "definition": [
            " 1. Biror maqsadning samaradorligiga erishishni ta’minlash uchun tashkil etilgan boshqaruv va funksional qismlarning o'zaro munosabati. 2. Korxonaning hajmi, uning kapitali, mulk shakliga bog'liq bo'lgan, mavjud bo'lgan mamlakat qonunlarida ko'zda tutilgan korporatsiya, tashkilot, kompaniya turlari va shakllari. "
        ]
    },
    {
        "word": "Tashkiliy Innovatsiya ",
        "type": [],
        "definition": [
            "firmaning ish amaliyotiga yangi tashkiliy uslubni joriy etish."
        ]
    },
    {
        "word": "Tashkiliy Jihatdan Inson Resurslarini Boshqarish ",
        "type": [],
        "definition": [
            "kadrlar bilan ishlashga javobgar bo'lgan shaxslar va institutlar (masalan, rahbarlar, kadrlar bo'limi, ishlab chiqarish kengashlari, kasaba uyushmalari va hokazolar) faoliyatidan iborat. "
        ]
    },
    {
        "word": "Tashkiliy Madaniyat ",
        "type": [],
        "definition": [
            "ashkilotning ichida va uning chegarasidan tashqaridagi munosabatlar asosidagi tashkilotning kattaroq qismi tomonidan qo'llaniladigan falsafa, qadriyatli mo'ljallar, hulqning me’yorlari, qoidalar va muhit. "
        ]
    },
    {
        "word": "Tashkiliy Texnika ",
        "type": [],
        "definition": [
            " chizma ishlari, hisob-kitob operatsiyalari, hujjatlarni tayyorlash, ularni ko'paytirish, qayta ishlash, saqlash, avtomatik qidirish va boshqalar uchun texnik vositalar majmuyi. Uning tarkibiga yozuv mashinkalari, fakslar, kartotekalar, nusxa olish  apparatlari, chizma priborlari, elektron hisoblagichlar va boshqalar kiradi. "
        ]
    },
    {
        "word": "Tashkiliy Tuzilish ",
        "type": [],
        "definition": [
            " avvalo an’anaviy ravishda mehnat taqsimoti asos qilib olingan tamoyildir. "
        ]
    },
    {
        "word": "Tashkiliy-Muvozanatlovchi ",
        "type": [],
        "definition": [
            " mazkur uslublarga reglamentlash, me’yorlashtirish va instruktsiyalash kiradi. "
        ]
    },
    {
        "word": "Tashkilot",
        "type": [],
        "definition": [
            " 1. Tashkilot, muassasa; idora, uyushma tashkil etish. 2. Tizim elementlarini tartibga solish va koordinatsiya qilishga qaratilgan boshqaruvning tarkibiy qismi. Tashkilot odamlarning ma’lum maqsadlari: boshqaruv vazifalariga erishishni ko'zda tutuvchi tizimlashtirilgan, ongli birlashmasi. "
        ]
    },
    {
        "word": "Tashkilot Strategiyasi ",
        "type": [],
        "definition": [
            " kompaniyaning turgan joyidan erishmoqchi bo'Igan joyiga qanday qilib o'tkazish mumkin, degan masalani yechish haqidagi yo'riqnomadir. "
        ]
    },
    {
        "word": "Tashkilot Tajribasi Yigʻilishi ",
        "type": [],
        "definition": [
            " tashkilot amaliy faoliyati yig'ilishi va uning boshqaruvi, texnologiyalari va injiniringidagi o'zgarishlari natijasidir. "
        ]
    },
    {
        "word": "Tashkilotchilik Qobiliyati ",
        "type": [],
        "definition": [
            "odamga tashkiliy faoliyat usullarini egallash va ularni muvaffaqiyatli amalga oshirishga imkon beruvchi shaxsning shaxsiy-psixologik xususiyatlari. "
        ]
    },
    {
        "word": "Tashkilotning Missiyasi ",
        "type": [],
        "definition": [
            "tashkilot mavjud bo'lishining ma’nosini ochib beruvchi shakllantirilgan tasdiq, unda ushbu tashkilotning boshqalardan farqi namoyon bo'ladi. "
        ]
    },
    {
        "word": "Tashqi Audit ",
        "type": [],
        "definition": [
            " tashqi auditor bilan ichki auditor faoliyatlari hamda tashqi audit va ichki auditlarni ajratish uchun qo'llaniladigan termin. "
        ]
    },
    {
        "word": "Tashqi Boshqaruv ",
        "type": [],
        "definition": [
            "bankrotlik holatiga tushib qolgan qarzdor korxonaning hayotiy layoqatini tiklashga yo ‘naltirilgan chora-tadbir. Unga ko'ra, qarzdor korxonaning faoliyatini boshqarish mas’uliyati xo'jalik sudining qarori bilan tayinlangan tashqi boshqaruvchiga topshirilishi nazarda tutiladi. "
        ]
    },
    {
        "word": "Tashqi Boshqaruvchi ",
        "type": [],
        "definition": [
            "xo'jalik sudining qarori bilan qonunda ko'zda tutilgan majburiy chora-tadbirlami amalga oshirish maqsadida tayinlangan shaxs. "
        ]
    },
    {
        "word": "Tashqi Dunyo ",
        "type": [],
        "definition": [
            "shu mamlakatni tashqi iqtisodiy aloqalar olib boruvchi iqtisodiy agentlar bilan birlashtiruvchi institutsional sektor. "
        ]
    },
    {
        "word": "Tashqi Dunyo Hisobi ",
        "type": [],
        "definition": [
            " tashqi iqtisodiy faoliyat shaklida ro‘y beruvchi va faoliyat natijasi quyidagi to'rt hisobda - tovarlar va xizmatlar tashqi hisobi, birlamchi daromadlar va joriy transfertlaming tashqi hisobi; jamlashning tashqi hisobi (kapital hisobi, moliya hisobi, aktivlarda boshqa o'zgarishlar hisobi, baholash hisobi) aktivlar va majburiyatlarni tashqi hisoblarda o'z ifodasini topadi va turli mamlakatlarning iqtisodiy aloqasini tavsiflaydi. "
        ]
    },
    {
        "word": "Tashqi Investitsiyalar ",
        "type": [],
        "definition": [
            "foyda olish maqsadida chet el investorlari tomonidan boshqa davlat iqtisodiyotiga qo'yiladigan investitsiyalardir. "
        ]
    },
    {
        "word": "Tashqi Mablag Larni Jalb Qilish ",
        "type": [],
        "definition": [
            "davlat tomonidan aktivlarni xorij manbalardan - chet el davlatlaridan, norezident yuridik shaxslardan va xalqaro tashkilotlardan jalb etish hamda buning natijasida O'zbekiston Respublikasining qarz oluvchi sifatidagi yoki qarz oluvchi rezidentlarning o'z kreditlarini - qarzlarini to'lashiga kafil sifatidagi majburiyatlari yig'indisining yuzaga kelishidir. "
        ]
    },
    {
        "word": "Tashqi Nodavlat Qarzlar ",
        "type": [],
        "definition": [
            " mamlakatdagi xususiy shaxslar (moliya muassasalari, korxonalar va aholi) tomonidan boshqa mamlakatlar moliya-kredit muassasalaridan qarzga olgan moliyaviy mablag'larining jami hajmi. "
        ]
    },
    {
        "word": "Tashqi Qarz ",
        "type": [],
        "definition": [
            " mamlakat hukumati, moliya-kredit tashkilotlari, yirik korxonalariningboshqa mamlakatlar moliya-kredit muassasalaridan qarzga olgan moliyaviy mablag'larining jami hajmi. "
        ]
    },
    {
        "word": "Tashqi Qarzni Restrukturizatsiya Qilish ",
        "type": [],
        "definition": [
            "qarzni qaytarish va u bo'yicha foizlarni to'lash muddatlarini uzaytirish. "
        ]
    },
    {
        "word": "Tashqi Savdo ",
        "type": [],
        "definition": [
            " chet mamlakatlar bilan savdo-sotiq ishlarini yuritish, xorijga tovar chiqarish (eksport) va xorijdan tovar kiritish (import)ni o'z ichiga oladigan savdo. "
        ]
    },
    {
        "word": "Tashqi Savdo Aylanmasi ",
        "type": [],
        "definition": [
            " mamlakat, mamlakatlar guruhi tashqi savdo faoliyati hajmining pul ko'rinishidagi ifodasi bo'lib, muayyan vaqt oralig'idagi (masalan, yil davomidagi) eksport va import hajmining yig'indisiga teng bo'ladi. "
        ]
    },
    {
        "word": "Tashqi Savdo Aylanmasi Saldosi ",
        "type": [],
        "definition": [
            " mamlakat eksporti va importi hajmlari o'rtasidagi farq, tafovut."
        ]
    },
    {
        "word": "Tashqi Savdo Balansi ",
        "type": [],
        "definition": [
            " ma’lum davr mobaynida (oy, chorak, yil) eksport va import qiymati o'rtasidagi nisbat. Tashqi savdo balansiga, naqd to'langan va kredit hisobiga amalga oshirilgan tovar bitimlar kiritiladi. Savdo balansi ikki turga bo'linadi: a) aktiv balans, bunda eksport importdan ortiq va mamlakatga tashqaridan valyuta oqib kelib, moliyaviy ahvoli faollashadi; b) passiv balans, bunda import eksportdan ustun, mamlakatdan valyuta chiqib keta boshlaydi, moliyaviy ahvol zaiflashadi. Eksport va import nisbati quyidagilarga bog'liq bo'ladi: a) oldi-sotdi qilinadigan tovarlarning turi va miqdoriga; b) tovarlarning narxiga. Savdo balansi holati mamlakatdagi milliy ishlab chiqarish darajasiga, mamlakatning xalqaro savdodagi ishtirokiga, mamlakat tovarlarini dunyo bozorida raqobatlasha olishiga bog'liqdir. Savdo balansi holati mamlakatga valyuta kirib turishini izohlaydi, mamlakatning to'lov balansini shakllantiradi. "
        ]
    },
    {
        "word": "Tashqi Savdo Siyosati ",
        "type": [],
        "definition": [
            " bir mamlakatning boshqa mamlakatlar bilan olib borayotgan savdosi (eksporti va importi) borasidagi siyosati. Bunga teng huquqlilik va ikki tomonlama manfaat olish ko'zda tutiladi. Eksport va importning tovar tarkibi va geografik hajmiga asosan olib boriladi. "
        ]
    },
    {
        "word": "Tashqi Savdo Aylanmasi Diversifikatsiyasi ",
        "type": [],
        "definition": [
            "eksport va importning tovar nomenklaturasi va hamkor davlatlar sonining kengaytirilishi. "
        ]
    },
    {
        "word": "Tashqi Xarajatlar ",
        "type": [],
        "definition": [
            " ishlab chiqarish jarayonini rivojlantirish uchun tashqaridan keltirilgan xomashyo, ishlab chiqarish vositalari yoki texnologiyalari uchun sarf etiladigan qiymat shaklidagi xarajatlar. "
        ]
    },
    {
        "word": "Tasnifiy Baholash Modeli ",
        "type": [],
        "definition": [
            "kreditni baholashning balli modeli (reyting uslubi) va bankrotlikni bashorat qilish (MDA - Multiple Discriminate Analysisga asoslangan statistik baholash) modellariga asoslanadi. "
        ]
    },
    {
        "word": "Tasodifiy Hodisa ",
        "type": [],
        "definition": [
            "sinov natijasida ro'y berishi yoki ro'y bermasligi mumkin bo'lgan har qanday fakt. "
        ]
    },
    {
        "word": "Tasodifiy Miqdor ",
        "type": [],
        "definition": [
            " sinov natijasida, awaldan e’tiborga olib bo'lmaydigan tasodifga bog'liq holda, o'zining mumkin bo'lgan qiymatlaridan birini qabul qiladigan (aynan qaysi ekani awaldan ma’lum bo'lmagan) o'zgaruvchi tushuniladi. "
        ]
    },
    {
        "word": "Tasodifiy Miqdorning Taqsimot Qonuni ",
        "type": [],
        "definition": [
            " tasodifiy miqdor qabul qilishi mumkin bo'lgan qiymatlari bilan ularning mos ehtimollarini bog'laydigan biror munosabat. "
        ]
    },
    {
        "word": "Tasodifiy Talab ",
        "type": [],
        "definition": [
            " to'satdan paydo bo'lib, qondiriladigan talab. "
        ]
    },
    {
        "word": "Tavakkalchilik",
        "type": [],
        "definition": [
            "biron ish bilan shug'ullanish oqibatida zarar ко'rib qolishdan qutulib qolish imkoniyati. "
        ]
    },
    {
        "word": "Tavakkalchilikka Befarq Qarovchi Shaxs ",
        "type": [],
        "definition": [
            "kutiladigan daromadda u kafolatlangan daromad bilan tavakkal daromaddan qaysi birini tanlashga befarq qaraydigan shaxs. "
        ]
    },
    {
        "word": "Tavakkalchilikka Moyillik ",
        "type": [],
        "definition": [
            "kutiladigan daromadda kafolatlangan natijaga ko'ra ko'proq tavakalchilik bilan bog'liq bo'lgan natijani ustun ko'radigan shaxs. "
        ]
    },
    {
        "word": "Tavakkalchilikka Qarshi Inson ",
        "type": [],
        "definition": [
            " kutilgan daromadga nisbatan kafolatlangan daromadni ustun ko'radigan inson. "
        ]
    },
    {
        "word": "Tavakkalchiliklarni Qoʻshish ",
        "type": [],
        "definition": [
            "ushbu usul tasodifiy yo'qotishlarni o‘zgarmas xarajatlarga aylantirish orqali tavakkalchilikni kamaytirishga qaratilgan (mulkni sug'urtalash). "
        ]
    },
    {
        "word": "Tavakkalchilikni Taqsimlash ",
        "type": [],
        "definition": [
            "ushbu usulga ko'ra zarar ko'rish ehtimoli bilan bog'liq bo'Igan tavakkalchilik qatnashuvchi subyektlar o'rtasida shunday taqsimlanadiki, oqibatda har bir subyektning kutiladigan zarari nisbatan kichik bo'ladi. Yirik moliya kompaniyalari katta masshtabdagi loyihalarni tavakkalchilikdan qo'rqmasdan moliyalashtiradi. "
        ]
    },
    {
        "word": "Tayyor Mahsulot ",
        "type": [],
        "definition": [
            " korxonada ishlab chiqarishi tugatilgan, belgilangan standartlarga yoki texnik shartlarga to'g'ri keladigan mahsulot. Tayyor mahsulot texnik nazoratchi tomonidan qabul qilinib, belgilanganhujjatlarbilanrasmiylashtiriladivaomborgatopshiriladi. Ayrim hollarda tayyor mahsulotlar omborga topshirilmasdan, mol oluvchilarga jo'natiladi. Tayyor mahsulotning har bir turiga kartochkalar ochiladi yoki daftarlarda bir necha betlar ajratiladi. Kartochka yoki daftarda mahsulot nomi, uning nomenklatura nomeri, razmeri, markasi, o'lchov birligi, har birining bahosi ko'rsatiladi. Tayyor mahsulotlarning buxgalteriya hisobi, odatda, saldo usulida yuritiladi. Tayyor mahsulotlar joriy hisobda reja tannarxida yoki korxonaning ulgurji bahosida baholanadi. Oy oxirida tayyor mahsulotlarning haqiqiy tannarxi aniqlanib, shu bahoda buxgalteriya balansida ko'rsatiladi. Ayrim tarmoqlarda mahsulotlarning haqiqiy tannarxi har oyda emas, yil oxirida aniqlanadi. "
        ]
    },
    {
        "word": "Tayyorgarlik Vaqti (Qayta Tayyorlash Vaqti) ",
        "type": [],
        "definition": [
            " uskunalarni, ma'lum bir mahsulot turini ishlab chiqarishga tayyorlash uchun lozim bo'ladigan vaqt "
        ]
    },
    {
        "word": "Tebranuvchi Talab ",
        "type": [],
        "definition": [
            " talab darajasining dambadam o'sib va pasayib turish holati."
        ]
    },
    {
        "word": "Tehnologik Prinsip Boʻyicha Uskuna Joylashishi",
        "type": [],
        "definition": [
            "shunday joylashtirish uslubiki, bunda o'xshash uskunalar bir joyda joylashadi. Bu uslub funksional prinsip bo'yicha uskuna joylashtiruvi yoki mayda seriyali jarayon joylashtiruvi deb ataladi. "
        ]
    },
    {
        "word": "Tejamkorlik",
        "type": [],
        "definition": [
            " jamiyat ijtimoiy-iqtisodiy taraqqiyotining muayyan darajasida barcha resurslardan tejamli foydalanish bo'yicha iqtisodiy munosabat bo'lib, ishlab chiqarish samaradorligini ta’minlashning asosiy omili hisoblanadi. "
        ]
    },
    {
        "word": "Telekommunikatsion Infratuzilma ",
        "type": [],
        "definition": [
            "kompaniyaning telekommunikatsion infratuzilmasi - bu turli axborotlarni: avtomatlashgan boshqaruv tizimlari ma’lumotlari, elektron xabarlar, internet-grafika, turli fayllar hamda “ovoz” va video ko'rinishidagi axborotlarni uzatish vazifasini hal qiluvchi o'zaro aloqador tizim chalar majmuasidir. "
        ]
    },
    {
        "word": "Telekommunikatsiya",
        "type": [],
        "definition": [
            " simli, radio, optik yoki boshqa elektromagnit tizimlardan foydalanib, signal, belgi, matn, tasvir va tovushlarni yoki boshqa ko'rinishdagi axborotni uzatish, qabul qilish va unga ishlov berish jarayoni. Axborot-kommunikatsiya texnologiyalari asosida ma’lumotlarni masofadan uzatish jarayoni. "
        ]
    },
    {
        "word": "Telemarketing",
        "type": [],
        "definition": [
            "marketing turi bo'lib, uni amalga oshirish potensial iste’molchilarga tovar va xizmatlarni real va virtual bozorlardan izlash va xarid qilish imkonini beruvchi telekommunikatsiya vositalari va Internet tarmog'idan foydalaniladi. "
        ]
    },
    {
        "word": "Tendensiya",
        "type": [],
        "definition": [
            " xo'kiz yoki ayiq tendensiyalarini tavsiflovchi grafikdagi trend chizig'i. "
        ]
    },
    {
        "word": "Tendensiya Fazalari ",
        "type": [],
        "definition": [
            "trendning ko'tarilayotgan yoki pasayib borayotgan yo'nalishlarini tavsiflaydi. "
        ]
    },
    {
        "word": "Tende",
        "type": [],
        "definition": [
            "-1) yozma taklif, oferta, talabnoma; 2) qimmatli qo'g'ozlar, savdo uchun obuna bo'lish haqidagi ariza; 3) muddatli shartnomaga ko'ra tovarni yetkazib berish to'g'risidagi xabarnoma; 4) bozorda obligatsiya va g'azna vekselini taklif etish vositasi; 5) xalqaro savdo shakli. Savdo tashkilotchilari tomonidan qatnashuvchilar orqali ma’lum tovarni yetkazib berish yoki ma’lum xizmatlarni bajarish taklifi qayd etilgan qo'g'oz (blank); 6) biror-bir ishni amalga oshirish uchun e’lon qilingan tanlov. Xaridor yoki buyurtmachi eng awalo tanlov e’lon qilib, tanlov shartlari bilan tanishtiradi. Tanlovda ishtirok etish niyatini bildirgan firmalar, korxona va tashkilotlar o'z takliflarini - tenderlarni buyurtmachiga ko'rib chiqish uchun yuborishadi. "
        ]
    },
    {
        "word": "Tender Komissiyasi ",
        "type": [],
        "definition": [
            "tenderdagi takliflarni baholovchi va golibni aniqlovchi doimiy yoki vaqtinchalik tarkibga ega organ. "
        ]
    },
    {
        "word": "Test",
        "type": [],
        "definition": [
            " l) standart shakldagi topshiriqlar bo'lib, aqliy taraqqiyot, qobiliyat, bilim va malakani aniqlash maqsadida o'tkaziladigan sinovdir; 2) aniq sotsiologik tadqiqotlardan foydalaniladigan tarqatma material, savolnoma; 3) shaxs ruhiyati va xulqini aniq miqdoriy va ma’lum sifat baholarini oldindan berilgan ba’zi standart - test me’yorlari bilan qiyosiy o'rganishga mo'ljallangan psixologik tadqiqotlarning standartlashtirilgan metodi."
        ]
    },
    {
        "word": "Texnik Qayta Qurollantirish ",
        "type": [],
        "definition": [
            " ishlab chiqarish alohida uchastkalarining texnik imkoniyatlarini zamonaviy darajaga chiqarish jarayoni. "
        ]
    },
    {
        "word": "Texnik Tahlil ",
        "type": [],
        "definition": [
            " tendensiyalami o'rganishga asoslangan moliyaviy tahlil usuli. "
        ]
    },
    {
        "word": "Texnik Yoʻnalishlar ",
        "type": [],
        "definition": [
            " diagrammada chiziladigan yoki joylashtiriladigan chiziqdir."
        ]
    },
    {
        "word": "Texnologik Ishsizlik ",
        "type": [],
        "definition": [
            " insonlarni mashinalar bilan almashtirish natijasida vujudga kelgan ishsizlik turi. Masalan, yog'-moy zavodida 10 kishi chigitni vagonlardan tushirar edi, zavod 2 ta avtoyukortgich sotib oladi, natijada 10 kishi bajaradigan ishni 2 kishi bajaradi, 8 tasi ishsiz qoladi. "
        ]
    },
    {
        "word": "Texnologik Jarayon ",
        "type": [],
        "definition": [
            "ishlab chiqarishning asosini tashkil etib, xomashyolarni ishlab chiqarish (iste’mol) mahsulotlariga aylantirish jarayonida sarflanadigan ishlar majmuyidan iboratdir. Ishlab chiqariladigan mahsulotlar, ishlatilayotgan xomashyolar, qo'llanilayotgan jihoz va usullaming turli xilda bo'lishi texnologik jarayonning ham turlicha bo'lishini taqozo etadi. "
        ]
    },
    {
        "word": "Texnologik Karta ",
        "type": [],
        "definition": [
            " ayrim ekin turlari bo'yicha mahsulot yetishtirish bilan bog'liq ishlarni tashkil qilishda korxonaning mashina va uskunalarga, ishchi kuchlari va mehnat xarajatlariga, yoqilg'i va moylash materiallariga bo'lgan talabi, mexanizatsiya ishlarining hajmi, traktor va qishloq xo'jaligi mashina va uskunalariga bo'lgan talab rejalashtiriladigan ish hujjati. "
        ]
    },
    {
        "word": "Texnologik Karta ",
        "type": [],
        "definition": [
            " biror buyumga ishlov berish uchun mo'ljallangan operatsiyalarning qay tartibda bajarilishi, qanday asboblar ishlatilishi, ish rejimlari va shu kabilar aks ettirilgan texnologik hujjat. "
        ]
    },
    {
        "word": "Texnologik Park ",
        "type": [],
        "definition": [
            " iqtisodiy jihatdan rivojlangan mamlakatlarda keng tarqalgan yangi ilmiy kashfiyotlar asosidagi texnologiyalarni, joylarni iqtisodiyotga joriy etishga yordam beruvchi ilm-fan, maorif va ishlab chiqarish tizimlarining o'zaro integratsiyasini ifodalovchi hududiy birlashmalar shakli. "
        ]
    },
    {
        "word": "Texnologik Usul ",
        "type": [],
        "definition": [
            " ishlab chiqarish jarayonini tashkil etishda foydalaniladigan mehnat vositalari: homashyolar, energiya va axborotlar yig'indisi ishlab chiqarish texnologik usulini ifodalaydi. "
        ]
    },
    {
        "word": "Texnologtya",
        "type": [],
        "definition": [
            " tayyor mahsulot olish uchun ishlab chiqarish jarayonlarida (xomashyo, material yoki yarim fabrikatlarga ishlov berish, tayyorlash) qo'llaniladigan usul va usullar majmuyi; shunday usul va usullarni ishlab chiquvchi va takomillashtiruvchi fan. Ishlab chiqarish jarayonining tarkibiy qismi bo'Igan operatsiyalar (materiallarni qazib olish, tashish, yuklash, yuklash-taxlash, saqlash va b.) ularni bajarish bo'yicha instruksiyalar, texnik qoida va talablar, grafiklar va b. ham texnologiyaga kiradi. Texnologiyaning fan sifatidagi vazifasi amalda eng samarali va tejamli ishlab chiqarish jarayonlari (eng kam vaqt va material resurslar talab qiladigan)ni aniqlash va ulardan foydalanish maqsadida Hzik, kimyoviy, mexaniq va b. qonuniyatlarni aniqlashdan iborat. Zamonaviy texnologiyani rivojlantirishning asosiy yo'llari mashina va uskunalardan samarali foydalanish, uzlukli (diskret, siklli) texnologikjarayonlardan uzluksiz potok usuliga o'tish, yoqilg'i, energiya, material va xomashyodan to'la foydalanishdan iborat. "
        ]
    },
    {
        "word": "Texnopolis",
        "type": [],
        "definition": [
            " innovatsion jarayonni aktivlashtirishga mo'ljallangan ochiq iqtisodiy zona shakllaridan biri. Texnopolisning rivojlanish dasturi o'z ichiga fundamental va amaliy ilmiy tadqiqotlarni o'tkazib, ularning natijalarini ishlab chiqarishga joriy qilishni talab etadi. Texnopolis davlat yordami (qo'llab-quwatlashi)da faoliyat olib boradi. "
        ]
    },
    {
        "word": "Texnopark",
        "type": [],
        "definition": [
            " o'z hududida kichik innovatsion korxonalarni yaratish va rivojlantirish orqali ilmiy salohiyatdan foydalanish va ishlab chiqilgan texnologiyalarni tijoratlashtirish maqsadida tashkil etiluvchi tuzilma. "
        ]
    },
    {
        "word": "Tezkor Hisob ",
        "type": [],
        "definition": [
            " tezkor yoki tezkor-texnik hisob xo'jalik faoliyatining ayrim uchastkalarida reja bajarilishi to'g'risidagi axborotlarni sistematik ravishda olib turish maqsadida ma’lum xo'jalik muomalalarini bevosita joyida va ular amalga oshishi paytida ro'yxatga olish tizimi bo'lib hisoblanadi. Tezkor hisob ma’lumotlaridan xo'jalik jarayonlari bevosita amalga oshgan paytda kundalik nazorat qilish va boshqarish uchun foydalaniladi. Tezkor hisobning ko'p ma’lumotlari umumlashtirilib, tarmoqlarni boshqarish uchun foydalaniladi. "
        ]
    },
    {
        "word": "Tibbiy Sugʻurta",
        "type": [],
        "definition": [
            " aholi sog'lig'ini himoya qilish vositalaridan biri. Sug'urta hodisasi ro'y berishi munosabati bilan, sug'urta polisi orqali bepul tibbiy xizmat ko'rsatilishi. Tibbiy xizmat ko'rsatish bilan bog'liq xarajatlarni sug'urta kompaniyasi to'laydi. Tibbiy sug'urta majburiy yoki ixtiyoriy bo'ladi. "
        ]
    },
    {
        "word": "Tijorat Banki ",
        "type": [],
        "definition": [
            " sanoat va savdoni qisqa muddatli kreditlar bilan ta’minlash, shuningdek, xususiy mijozlarga turli turdagi bank xizmatlari ko'rsatish (joriyschyotlarniyuritish, tijorat, iste’molchilikva ipoteka qarzlarni berish va hokazolar)ga ixtisoslashtirilgan bank. Tijorat banklari pay badali yoki aksionerlik (hissadorlik) asosda tuziladi va quyidagicha farqlanadi: ustav kapitalini shakllantirish bo'yicha (davlat, xorijiy kapital va boshqalar ishtirokida), ixtisoslashish bo'yicha (masalan, agrobank, innovatsiya banki), faoliyat ko'rsatish hududi bo'yicha, amalga oshiriladigan operatsiya turlari bo'yicha va hokazo usullariga qarab. Tijorat bankining mablag'lari o'zining xususiy (ustav fondi, zaxira fondi va boshqa foyda hisobiga tashkil topadigan fondlari) va jalb qilingan (korxonalar schyotlaridagi, ularning qo'yilmalari va depozitlari, fuqarolarning omonatlari va hokazolar) mablag'lariga bo'linadi. "
        ]
    },
    {
        "word": "Tijorat Jadvali ",
        "type": [],
        "definition": [
            " har oyda tuziladigan tashqi savdo yuklarining kemalarga ortilishi ko'rsatilgan asosiy hujjat. "
        ]
    },
    {
        "word": "Tijorat Kreditlari ",
        "type": [],
        "definition": [
            " ishlab chiqaruvchi subyektlarning iste’molchi subyektlar va xo'jalik subyektlari o'rtasida tovar shaklida ma’lum muddati uzaytirilgan qarzi. "
        ]
    },
    {
        "word": "Tijorat Siri ",
        "type": [],
        "definition": [
            "korxona, ishlab chiqarish va savdo-sotiqning bevosita ishtirokchilarigagina ma’lum bo'lgan va boshqalarga e’lon qilinmaydigan ma’Iumotlar. "
        ]
    },
    {
        "word": "Tijoratchi",
        "type": [],
        "definition": [
            " tadbirkorlik bilan shugullanuvchi, bitimlar tuzuvchi mustaqil xo'jalik birligi yoki shaxs. "
        ]
    },
    {
        "word": "Tijoratlashtirish (Kommersializatsiya) ",
        "type": [],
        "definition": [
            " yangi mahsulotni ishlab chiqish bosqichi; bozorga kirib borish vaqtini to‘g'ri tanlash, turlibozorlarda faoliyatko‘rsatish hajmi vaketma-ketligi, mahsulotni operativ harakatlantirish va taqsimlash bo'yicha samarali usullar, shuningdek, marketing rejasini ishlab chiqish jarayoni. "
        ]
    },
    {
        "word": "Tijoratlashuv ",
        "type": [],
        "definition": [
            " tovar, mahsulotni yirik masshtabda (seriyali) ishlab chiqarish va taqsimlash (sotish). "
        ]
    },
    {
        "word": "Tilxat",
        "type": [],
        "definition": [
            " kvitansiya, pul yoki biror qimmatli narsa qabul qilinganligi to'g'risida berilgan rasmiy tilxat. "
        ]
    },
    {
        "word": "Tiqilib Qolish ",
        "type": [],
        "definition": [
            " ma’lum bir bosqich faoliyati, natijalarini keying bosqichga yetkazib bera olmasligi sababli, majburiy to'xtatib turilishi holati. "
        ]
    },
    {
        "word": "Tirikchilik Minimumi ",
        "type": [],
        "definition": [
            " mehnatkashlar va ularning oilasi tirikchiligini eng past darajada ta’minlash uchun zarur bo'lgan hayot vositalari (iste’mol mollari va xizmatlar) qiymatining pul shaklidagi ifodasi. "
        ]
    },
    {
        "word": "Tizim",
        "type": [],
        "definition": [
            "l) yaxlit ta’limni, uning birligini belgilovchi bir-biri bilan qonuniy bog'liq aksariyat unsurlar (predmetlar, hodisalar, qarashlar, bilimlar va boshqalar); 2) qismlarning ma’lum bir bog'lanishlarda, harakatlarning o'ta izchillikda rejali, to'g'ri joylashish tartibi."
        ]
    },
    {
        "word": "Tizimli Yozuv ",
        "type": [],
        "definition": [
            "buxgalteriya hisobi schyotlarida xo'jalik muomalalarini ma’lum tizimda registratsiya qilish. Bu yozuv yordamida xo'jalik muomalalarini bir xil iqtisodiy belgilariga qarab guruhlash amalga oshiriladi. Tizimli yozuv buxgalteriya hisobi obyektlari bo'yicha ma’lumot olish imkoniyatini beradi. U alohida hisob registrlari (bosh daftar) da yoki xronologik yozuv bilan birga bir registr (jumal- order)da amalga oshiriladi. Tizimli yozuv ma’lumotlari xronologik yozuv ma’lumotlari bilan bog'langan. "
        ]
    },
    {
        "word": "Toʻplam Birligi ",
        "type": [],
        "definition": [
            " to'plamda kuzatish talab etiladigan element. "
        ]
    },
    {
        "word": "Toʻplam Birliklari ",
        "type": [],
        "definition": [
            " bu statistik to'plamni tashkil etuvchi elementlardir. "
        ]
    },
    {
        "word": "Toʻgʻri (Bevosita) Soliqlar ",
        "type": [],
        "definition": [
            "daromad solig'i, foyda solig'i, resurs to'lovlari, mol-mulk solig'i va boshqalardan iborat bo'lib, ularga egalik qilish va ulardan foydalanish soliqqa tortish uchun asos bo'lib xizmat qiladi. "
        ]
    },
    {
        "word": "Toʻgʻri (Bevosita) Soliqqa Tortish ",
        "type": [],
        "definition": [
            " shaxsan yoki ish beruvchi orqali soliqlarni soliq xizmatlariga to'g'ridan-to'g'ri to'lash orqali amalga oshiriladigan jamiyat a’zolarini bevosita soliqqa tortishdan iborat. Aniq bir shaxsning ahvoliga bog'liq bo'lmasdan, balki uning qanday mahsulotlarni sotib olishiga bog'liq bo'lgan egri (bilvosita) soliqqa tortishdan farq qiladi. "
        ]
    },
    {
        "word": "Toʻgʻri Kafolatlar ",
        "type": [],
        "definition": [
            " bunda kafolat beruvchi tomon bevosita eksportimportoperatsiyalarigakafolatberadi. Bunda mazkur to'Iovbo'yicha majburiyatlarini to'liq o'z zimmasiga oladi. Bunday kafolatlar to'lov talabnomalari bo'yicha hisob-kitoblar, hujjatlashtirilgan akkreditiv bo'yicha hisob-kitoblarda keng qo'llaniladi. "
        ]
    },
    {
        "word": "Toʻgʻridan-Toʻgʻri Investitsiyalar ",
        "type": [],
        "definition": [
            " bevosita mahsulot ishlab chiqarish yoki xizmat ko'rsatish jarayonini tashkil etish yoki yanada kengaytirish maqsadida xorijiy sheriklar tomonidan uzoq muddatli kapital qo'yilmalar kiritish. To'g'ridan-to'g'ri investitsiyalar investorlarga mazkur ishlab chiqarish jarayonlari ustidan nazorat qilish imkonini beradi. "
        ]
    },
    {
        "word": "Toʻgʻridan-Toʻgʻri Xorijiy Investitsiyalar ",
        "type": [],
        "definition": [
            "o'zga mamlakat rezidentlari tomonidan boshqa mamlakat real aktivlariga mablag' kiritish, uni tasarruf etish va ular ishlatilishi ustidan nazorat o'rnatish. Iqtisodiy hamkorlik va rivojlantirish tashkiloti tavsifiga ko'ra aksiyalarning kamida 10 foiziga egalik qilish. "
        ]
    },
    {
        "word": "Toʻldiruvchi Tovarlar",
        "type": [],
        "definition": [
            " birgalikda, komplektlarda iste’mol qilinadigan tovarlar."
        ]
    },
    {
        "word": "Toʻliq Bandlik ",
        "type": [],
        "definition": [
            "ishlab chiqarish uchun yaroqli bo'Igan barcha resurslardan foydalanish. Ishchilar majburiy ishsiz bo'lmasliklari, ekiladigan yerlar va dastgohlar bekor turmasligi kerak. "
        ]
    },
    {
        "word": "Toʻliq Ish Bilan Taʼminlash ",
        "type": [],
        "definition": [
            " kasbga oid mehnat bilan ta’minlanish bo'lib, u shaxsga daromad keltiradi va o'zi hamda oilasining munosib turmush kechirishiga sharoit yaratadi. "
        ]
    },
    {
        "word": "Toʻliq Ishlab Chiqarish Hajmi ",
        "type": [],
        "definition": [
            " resurslarni samarali taqsimlash, ya’ni qo'llanilayotgan resurslardan shunday foydalanish kerakki, bunda mahsulotning hajmi o’sib borsin. "
        ]
    },
    {
        "word": "Toʻlov Aylanmasi ",
        "type": [],
        "definition": [
            " mamlakat iqtisodiyotidagi barcha pulli to'lovlar (pul to'lovlarining) majmuyi (yig'indisi, to'plami). "
        ]
    },
    {
        "word": "Toʻlov Balansi ",
        "type": [],
        "definition": [
            " 1. Ma’lum bir davr (oy, chorak, yarim yil, yil) mobaynida mamlakat tomonidan xorijga to'langan to'lanmalar va xorijdan olingan to'lovlar o'rtasidagi nisbat. O'z ichiga tegishli davrda mamlakat tovarlari eksporti va importi qiymatlarini ifodalovchi savdo balansi, xizmatlar balansi va notijoriy to'Iovni oladi. Bularning barchasi joriy operatsiyalar bo'yicha to'lov balansini shakllantiradi. Mamlakatningumumiyto'lovbalansiesajoriyoperatsiyalarbo'yicha to' lov balansi, kapitallar va kreditorlar harakati balansi, shuningdek, oltin va valyuta rezervlari harakati balansidan tashkil topadi. 2. Mamlakatning butun xalqaro iqtisodiy faoliyati natijalarini o'zida aks ettiruvchi balans. Xalqaro valyuta fondining klassifikatsiyasi bo'yicha to'lov balansi o'z ichiga: a) joriy operatsiyalar balansi; b) pul kapitallari balansi; d) rasmiy valyuta rezervlaridagio'zgarishlarni qamrab oladi. Umuman olganda, har qanday tashqi iqtisodiy bitim valyutalarni xarid qilish, sotish bilan bog'liq, binobarin, davlatning tashqi iqtisodiy faoliyati xorijiy valyutalarning kelib tushishi va sarflanishida o'z aksini topadi. Shuning uchun to'lov balansida valyutalarning kelib tushishi (+) sarf qilinishi (-) bilan belgilanadi (qarang, joriy operatsiyalar balansi, kapitallar harakati balansi). "
        ]
    },
    {
        "word": "Toʻlov Funksiyasi ",
        "type": [],
        "definition": [
            "o'yin natijasi bo'lib o'yinchining yutug'ini yoki yo'qotishini bildiradi. "
        ]
    },
    {
        "word": "Toʻlov Manbai ",
        "type": [],
        "definition": [
            " soliq to'lovchiga to'lovlami amalga oshiruvchi yuridik shaxs."
        ]
    },
    {
        "word": "Toʻlov Qobiliyatiga Ega Boʻlgan Ehtiyoj ",
        "type": [],
        "definition": [
            "ehtiyojning ma’lum paytda to'lov vositasi (mablag') bilan ta’minlangan qismi. "
        ]
    },
    {
        "word": "Toʻlov Topshirigʻi ",
        "type": [],
        "definition": [
            "korxona, firma, tashkilotning unga xizmat qiladigan o'z schyotidan mablag' o'tkazish zarurligi haqidagi topshirig'i."
        ]
    },
    {
        "word": "Toʻlov Topshiriqnomasi ",
        "type": [],
        "definition": [
            "muassasaning boshqa shaxsning hisobraqamiga pul o'tkazishi ko'rsatiladigan va ushbu muassasaga xizmat ko'rsatadigan bankka bergan topshirig'i mazmuniga ko'ra tayyorlangan hisob-kitob hujjati. "
        ]
    },
    {
        "word": "Toʻlov Valyutasi ",
        "type": [],
        "definition": [
            "tomonlarning keUshuvi bilan tovarlarning tashqi savdo aloqalarida haqini to'lashda yoki xalqaro kreditni qaytarishda ishlatiladigan valyuta. "
        ]
    },
    {
        "word": "Toʻlovga Layo Qatlilik ",
        "type": [],
        "definition": [
            "bank zarur muddatlarda kredit-omonatchilar, banklar davlat oldidagi majburiyatlarini to'la summada bajara olish layoqatini bildiradi. "
        ]
    },
    {
        "word": "Toʻlovga Qobiliyatsizlik ",
        "type": [],
        "definition": [
            "firma yoki davlatning moliya yoki valyuta-moliyaviy ahvoli, bunda ular o'z vaqtida moliyaviy majburiyatlarini bajara olmaydilar. "
        ]
    },
    {
        "word": "Toʻlovga Qodirlik ",
        "type": [],
        "definition": [
            "yuridik yoki jismoniy shaxsning moliyaviy majburiyatlarini o'z vaqtida bajara olish imkoniyati. "
        ]
    },
    {
        "word": "Toʻlovlarning Navbatliligi ",
        "type": [],
        "definition": [
            "bir necha muddatli va muddati o'tib ketgan to'lovlar mavjud bo'lganda va ularni to'liq to'lash (qaytarish, uzish) uchun mablag'lar yetarli bo'lmagan holda to'lovchining hisob varag'idan pul mablag'larini o'tkazish (olish, undirish) ketma-ketligi. "
        ]
    },
    {
        "word": "Toʻlqinsimon Nazariya ",
        "type": [],
        "definition": [
            "Elliotning to'lqinsimon nazariyasi, texnik tahlil nazariyasi. "
        ]
    },
    {
        "word": "Toʻxtovsiz Inventarizatsiya Usuli ",
        "type": [],
        "definition": [
            " asosiy fondlami tiklashdagi bahosini aniqlash uchun (u yoki bu kunga nisbatan). Buning uchun baho indekslari yordamida investitsiyalarning tiklashdagi bahosi aniqlanadi. "
        ]
    },
    {
        "word": "Tomas Mor",
        "type": [],
        "definition": [
            " (1478-1535) ingliz olimi. “Utopiya” (1516) asarida hayoliy sotsializm g'oyalarini bergan, “qo'ylar odamlarni yeb qo'ydi” iborasining muallifi (dehqonlarning o'z yerlaridan mahrum qilinishi). “Utopiya” so'zi yunoncha “u” - yo'q va “topos” - joy so'zlaridan tashkil topgan, ya’ni bu so'zning ma’nosi “o'zi yo'q » 1 • joy dir. "
        ]
    },
    {
        "word": "Tommazo Kampanella ",
        "type": [],
        "definition": [
            " (1568-1639) italyan iqtisodchisi. Italiyadagi og'ir iqtisodiy ahvolni ko'rgan. “Oftob shahri” (1602 yilda yozilib, 1632 yilda chop etilgan) kitobida umumiy mulkchilik, mehnat asosida hayoliy sotsializm g'oyalari rivojlantirilgan. "
        ]
    },
    {
        "word": "Tomoman (Prinsipial) Yangi Tovar ",
        "type": [],
        "definition": [
            " birinchi marta yaratilgan va hayotda o'z o'xshashlariga ega bo'lmagan tovar."
        ]
    },
    {
        "word": "Total (Har Tomonlama) Yonaltirilganlik ",
        "type": [],
        "definition": [
            "doimiy tarzda iste’molchiga yo'naltirilganlik, u bilan teskari aloqa o'rnatish hamda sotuvdan keyingi xizmat ko'rsatish hisobiga, mahsulotni tizimli takomillashtirib borish. "
        ]
    },
    {
        "word": "Tovar",
        "type": [],
        "definition": [
            " bozorda oldi-sotdi orqali ayirboshlanadigan mehnat mahsuli. Tovar shunday mahsulotki, u ishlab chiqaruvchilarning emas, balki boshqalarning talab-ehtiyojini qondirish uchun yaratiladi. Shu sababli u ayirboshlanadi. Tovar moddiy shakldagi mahsulot bo'lishi shart emas, xizmatlar ham tovar shakliga kiradi. Turli moddiy shakldagi aqliy mehnat mahsuli, ilmiy-texnikaviy g'oyalar va ishlanmalar, nomoddiy shakldagi xizmatlar (davolash, o'qitish, muzika, raqs ijro etish, qo'shiq kuylash kabilar) har xil qiymatli qog'ozlar (aksiya, obligatsiya, sertifikat, valyuta) ham tovar bo'ladi. Tovar bozorda pul vositasida ayirboshlanadi. "
        ]
    },
    {
        "word": "Tovar Assortimenti ",
        "type": [],
        "definition": [
            "- foydalanish maqsadi, bir xil mijozlarga sotilishi, yoki bir xil do' konlar orqali sotishni, yoki bir xil narxlar chegarasida sotilishiga qarab turib o'zaro bog'liq bo'lgan tovarlar guruhidir (avtomobillar assortimenti, pardoz vositalari assortimenti va h.k.) "
        ]
    },
    {
        "word": "Tovar Belgisi ",
        "type": [],
        "definition": [
            "qonun bilan himoyalangan marka yoki uning qismi, biror ishlab chiqaruvchining tovar va xizmatlarini boshqa ishlab chiqaruvchining o'xshash tovar va xizmatlaridan farqlash uchun mo'ljallangan original grafik tasvir, raqam, harf yoki so'zlarning birikmasidir. "
        ]
    },
    {
        "word": "Tovar Birjasi ",
        "type": [],
        "definition": [
            "bir yoki bir necha xil tovar bilan ulgurji savdo-sotiqni amalga oshiruvchi tijorat korxonasi. Tovar birjasi korxona va tashkilotlar o'rtasida oldi-sotdi aloqalarini yurgizadi. Tovar birjasi ochiq yoki yopiq turda bo'ladi. Ochiq birjada birja a’zolari bilan bir qatorda boshqa tadbirkor savdo qila oladi. Yopiq birjada birjaning a’zosi bo'lganlargina savdo qiladi. Birja savdolashuvida shakllangan narxlarbirjakotirovkalari deb yuritiladi va ular har kunie'lonqilinadi. Tovar birjasi daromadi birja muomalasi ishtirokchilari to‘laydigan xizmat haqidan tashkil topadi. O'zbekistonda 1993-yilda tovar- xomashyo birjasi tashkil etilgan. "
        ]
    },
    {
        "word": "Tovar Harakati ",
        "type": [],
        "definition": [
            "tovarlarning ishlab chiqarilgan joydan iste’mol qilinadigan joygacha jismoniy harakati bo'lib, ularni joylashtirish, saqlash, jo'natish, tashish, yuklash, tushirish, zaxiralarini shakllantirish jarayonlaridan iborat. "
        ]
    },
    {
        "word": "Tovar Hayotining Bosqichlari ",
        "type": [],
        "definition": [
            " tovarning hayotiy davrida unga bo'lgan talab xarakteri va uni sotish darajasi bilan belgilanadigan hamda ajralib turadigan alohida paytlar (bosqichlar). "
        ]
    },
    {
        "word": "Tovar Innovatsiyasi ",
        "type": [],
        "definition": [
            " l) mahsulotni takomillashtirishning original, sifati yaxshilangan va modifikatsiyalangan mahsulot ishlab chiqarish bilan bog'liq bo'Igan uzluksiz jarayoni. Tovarning hayotiylik davri uzunligini vakorxonaningrentabelligini ta’minlovchi chora-tadbirlar ichida alohida o'ringa ega. O'z ichiga mahsulotni differensiyalash va diversifikatsiyalashni kiritadi; 2) bozorga yangi mahsulotni yoki mahsulotlar guruhini olib kirish. "
        ]
    },
    {
        "word": "Tovar Ishlab Chiqarish ",
        "type": [],
        "definition": [
            "oldi-sotdi orqali tovarlarni ayirboshlash uchun mahsulotiarni ishlab chiqarish. U ibtidoiy tuzum yemirilishi davrida vujudga kelgan. Tovar ishlab chiqarishning vujudga kdishi sabablari quyidagilar: ijtimoiy mehnat taqsimoti; tovar ishlab chiqaruvchilarning xususiy mulkni vujudga kelishi natijasida alohidalashuvi. Bozor iqtisodiyotinlng o'zi tovar ishlab chiqarishga asoslangandir. Tovar ishlab chiqarish umuminsoniy hodisa hisoblanadi. Tovar ishlab chiqarishni qiymat qonuni talab va taklif qonuni, pul muomalasi qonunlari tartibga soladi. "
        ]
    },
    {
        "word": "Tovar Isteʼmoli ",
        "type": [],
        "definition": [
            " sotib olingan mahsulotdan foydalanish, uni ishlatish jarayoni. "
        ]
    },
    {
        "word": "Tovar Kafolati ",
        "type": [],
        "definition": [
            "tovarning iste’mol jarayonida ma’lum davr ichida o'z foydali funksional xossalarini to'la saqlab qolishi bo'yicha olingan javobgarlik, mas’uliyat. "
        ]
    },
    {
        "word": "Tovar Markasi ",
        "type": [],
        "definition": [
            "bir ishlab chiqaruvchi, sotuvchi tovarlarini umumlashtiruvchi va boshqalar tovarlaridan ajratib turuvchi nom, termin, belgi, tasvir, timsol yoki ularning birgalikdagi yaxlit shakli. "
        ]
    },
    {
        "word": "Tovar Narxi",
        "type": [],
        "definition": [
            " ayirboshlashda tovar uchun to'lanadigan mablag', pul miqdori. "
        ]
    },
    {
        "word": "Tovar Nomenklaturasi ",
        "type": [],
        "definition": [
            " muayyan sotuvchi tomonidan xaridorlarga taklif qilinadigan barcha tovar assortiment guruhlari va tovar birikmalarining yig'indisi. Tovar nomenklaturasi uning kengligi (assortiment guruhlari soni), to'yinganligi (ayrim tovarlar soni), chuqurligi (tovar taklifi variantlari), uyg'unlashuvi (tovarlarning turli xil assortiment guruhlari o'rtasidagi yaqinlik) nuqtai nazaridan ta’riflanadi. "
        ]
    },
    {
        "word": "Tovar Oʻrami ",
        "type": [],
        "definition": [
            " tovarni solish, joylash, saqlash uchun xizmat qiladigan idish. "
        ]
    },
    {
        "word": "Tovar Oboroti ",
        "type": [],
        "definition": [
            "tovarlarning aylanishi, ishlab chiqarish va iste’molni birbiriga bog'lovchi takror ishlab chiqarish jarayonining bosqichi. Tovar muomalasi sohasida ishlab chiqarilgan mahsulot oldi-sotdi orqali ayirboshlanadi. Tovar oborotining aniq tashkil etilishi ishlab chiqarish samaradorligini oshirishga olib keladi. Tovar muomalasi sohasi tarmoqlar (savdo, tayyorlov) uchun tovar oboroti ular faoliyatlarining asosiy ko'rsatkichi hisoblanadi. Shu bilan birga tovar oboroti tovar muomalasi ko'lamlarini ko'rsatuvchi muhim xalq xo'jaligi ko'rsatkichi hisoblanadi. "
        ]
    },
    {
        "word": "Tovar Sifati ",
        "type": [],
        "definition": [
            "tovarni iste’mol qilish va undan foydalanish jarayonida aniq ehtiyojni qondirish darajasi. "
        ]
    },
    {
        "word": "Tovar Siljitish ",
        "type": [],
        "definition": [
            " tovar haqidagi ma’lumotlarni iste’molchilarga yetkazish va singdirish, iste’molchilar bilan aloqa o'rnatish faoliyati. "
        ]
    },
    {
        "word": "Tovar Siymosi",
        "type": [],
        "definition": [
            " tovarning iste’molchilar ongida shakllangan tasawuri. "
        ]
    },
    {
        "word": "Tovar Siyosati ",
        "type": [],
        "definition": [
            "tadbirkorlik maqsadlarini belgilash va ularga erishishga yo'naltirilgan tadbir va strategiyalar majmuyi, yangi tovar yoki tovarlar guruhini bozorga olib kirish (innovatsiya), bozorda mavjud bo'lgan tovarlarni zamonaviylashtirish (variatsiya) yoki ishlab chiqarish dasturidan tovar ishlab chiqarishni chiqarib tashlash (eliminatsiya), shuningdek, assortment siyosatidan iborat. "
        ]
    },
    {
        "word": "Tovar Sotishni Ragʻbatlantirish ",
        "type": [],
        "definition": [
            " turli vositalar, usullar, tadbirlar yordamida tovar sotuvchilar va oluvchilarning qiziqishini kuchaytirish. "
        ]
    },
    {
        "word": "Tovar Strategiyalari ",
        "type": [],
        "definition": [
            "1) tovar siyosatining korxonaga tovar hayotiylik davrining istalgan bosqichida foyda olish va savdo hajmining barqaror bo'lishini ta’minlashi mumkin bo'lgan asosiy prinsipial yo'nalishlari.Tovarstrategiyasiningasosiyturlari:tovaryokixizmatlar innovatsiyasi, variatsiyasi, eliminatsiyasi; 2) tovar nomenklaturasini optimallashtirish yo'nalishlarini ishlab chiqish hamda firmaning samarali faoliyat ko'rsatishi va raqobatbardoshligini ta’minlash uchun sharoitlar yaratuvchi tovarlar assortimentini aniqlash. "
        ]
    },
    {
        "word": "Tovartaklifi ",
        "type": [],
        "definition": [
            " bozorda mavjud bo'lgan tovarlar majmuyi. "
        ]
    },
    {
        "word": "Tovar Tannarxi ",
        "type": [],
        "definition": [
            " tovarni ishlab chiqarish uchun bevosita, to'g'ridan-to'g'ri qilingan xarajatlar qiymati. "
        ]
    },
    {
        "word": "Tovar Taqchilligi ",
        "type": [],
        "definition": [
            " bozorda tovarlarning muntazam va surunkasiga yetishmay, ularga bo'lgan talabning doimo qondirilmasligi. "
        ]
    },
    {
        "word": "Tovar Tarqatish ",
        "type": [],
        "definition": [
            "ishlab chiqarilgan tovarlarni iste’molchilarga yetkazib berish faoliyati. "
        ]
    },
    {
        "word": "Tovar Tarqatish Kanali ",
        "type": [],
        "definition": [
            "tovarlarni ishlab chiqaruvchilardan iste’molchilarga bo'lgan makon va zamonda tovar harakatini amalga oshirish va mulk huquqini o'z zimmasiga oladigan tashkilotlar, korxonalar, shaxslar to'plami; ishlab chiqarishdan iste’molgacha tovar o'tadigan yo'l."
        ]
    },
    {
        "word": "Tovar Variatsiyasi ",
        "type": [],
        "definition": [
            " ishlab chiqarilayotgan va bozorda mavjud bo'lgan tovarni uning ayrim xususiyatlari yoki ko'rsatkichlarini o'zgartirish yo'li bilan modifikatsiyalash. Tovarning tabiiy (materiali, sifati), estetik (dizayni, rangi, shakli), simvolik (tovar markasining nomi) xususiyatlari va firmaning bo' linmalari faoliyati bilan b og' liq b о' lgan xususiyatlari o'zgartirilishi mumkin. Tovar sifatini yaxshilash, uning foydaliligini oshirish, shakli va stilini yaxshilash strategiyasi tovar modifikatsiyasining muhim strategiyasi bo'lishi mumkin. "
        ]
    },
    {
        "word": "Tovar Xoʻjaligi ",
        "type": [],
        "definition": [
            " tovar ishlab chiqarishga asoslangan va bozor orqali ishlab chiqarish bilan iste’mol o'rtasidagi o'zaro aloqadorlikni ta’minlovchi, iqtisodiyotni tashkil qilishning ijtimoiy shaklidir. "
        ]
    },
    {
        "word": "Tovar Xossalari ",
        "type": [],
        "definition": [
            " tovarning iste’mol qiymati va qiymati. Tovar qiymati tovarda mujassamlashgan ijtimoiy mehnatdir. U tovarlar ayirboshlanishida ifoda etiladi, tovar narxining obyektiv asosi hisoblanadi. Qiymat miqdorini ayrim ishlab chiqarishning yakka tartibdagi sarflangan mehnati emas, balki ijtimoiy-zaruriy mehnat sarfi, ya’ni tovarning aksariyat qismini yaratish uchun ketgan, ya’ni o'rtacha mehnat malakasi, mehnat shiddati va texnika darajasi sharoitida sarflangan va ehtiyojini qondirganligi uchun jamiyat tomonidan e’tirof qilingan mehnat belgilaydi. Tovarning iste’mol qiymati uni biror-bir ehtiyojlarni qondira olishidir. Narsaning foydaliligi uni iste’mol qiymatiga aylantiradi va undan foydalanishda namoyon bo'ladi. Tovarning iste’mol qiymatlari har qanday jamiyat boyligining moddiy mazmunini tashkil etadi. Demak, tovar ikki xossaga, ya’ni iste’mol qiymati va qiymatga ega. Tovar iste’mol qiymati va qiymatning birligidan iborat. "
        ]
    },
    {
        "word": "Tovarda Gavdalangan Mehnatning Ikki Yoqlama Xarakteri ",
        "type": [],
        "definition": [
            " tovarning ikki xossasi borligiga sabab unda gavdalangan mehnatning ikki yoqlama xarakterda ekanligidan kelib chiqadi. Har bir alohida olingan tovarda nafli mehnat mujassamlangandir. Masalan, kostumdayigiruvchilar, to'qimachilar, tikuvchilar; nonda - nowoy, traktorchi, kombaynchi va boshqalar. Agar har bir aniq iste’mol qiymatida, masalan, kostumda ma’lum nafli aniq mehnat gavdalansa, uning qiymatida ish kuchi sarfi sifatida umumiy sarf qilingan inson mehnati gavdalanadi. Aniq mehnat turlari bir-biridan farq qiladi. Masalan, tikuvchining mehnati nowoyning mehnatidan farqlanadi, chunki birinchisi kostum yaratadi, ikkinchisi esa non. Inson mehnatining umuman sarflanishi nuqtai nazaridan, ya’ni inson jismoniy, ma’naviy, ruhiy energiyasi nuqtai nazaridan tikuvchi va nowoy mehnati bir xildir, ya’ni u abstrakt mehnatdir."
        ]
    },
    {
        "word": "Tovarlar",
        "type": [],
        "definition": [
            " mulkchilik huquqi qo'IIanishi mumkin bo'Igan fizik predmet (buyum)lar. Tovarlar ayni paytda turli turdagi subyektlarda egalik qilish xohishini uyg'atuvchi, talab hissini tug'diruvchi predmet shaklida namoyon bo'lishi kerak. "
        ]
    },
    {
        "word": "Tovarlar Hayotiy Sikli ",
        "type": [],
        "definition": [
            "marketing nazariyasining asosiy elementlaridan biri bo'lib tovarlar hayotiy sikli va uning asosiy bosqichlari tushunchasi xizmat qiladi. THTS konsepsiyasi asosida eski tovarlarni takomillashtirish va yangi tovarlarni yaratish bo'yicha marketing xatti-harakatlari ketma-ketligi aniqlanadi. "
        ]
    },
    {
        "word": "Tovarlar Va Xizmatlar Bozori ",
        "type": [],
        "definition": [
            "1. tovar birjalari; 2. ulgurji bozor va chakana savdo; 3. marketing tashkilotlarini tashkil etish va ularning faoliyat ko'rsatishini talab etadi. "
        ]
    },
    {
        "word": "Tovarlarga Soliqlar ",
        "type": [],
        "definition": [
            "narxdan aniq foizda tovarning har bir birligidan absolut miqdorda belgilanadigan tovar va xizmatlarga soliqlar. "
        ]
    },
    {
        "word": "Tovarlarni (Ishlarni, Xizmatlarni) Realizatsiya Qilishdan Olingan Tushum ",
        "type": [],
        "definition": [
            "realizatsiya qilingan tovarlar (ishlar, xizmatlar) uchun olingan (olinishi lozim bo'Igan) mablag'lar summasi, shu jumladan realizatsiya qilingan tovarlar (ishlar, xizmatlar) uchun haq to'lash yoki qarzni uzish hisobiga tushadigan mol-mulk qiymati. "
        ]
    },
    {
        "word": "Tovarlarni Eksklyuziv Tarqatish ",
        "type": [],
        "definition": [
            " ma’lum hududda ayrim tovarlarni tarqatish, sotish huquqi yagona bir vositachiga beriladi. "
        ]
    },
    {
        "word": "Tovarlarni Eksport Qilish ",
        "type": [],
        "definition": [
            " O'zbekiston Respublikasining bojxona hududidan tovarlarni, agar qonun hujjatlarida boshqacha qoida nazarda tutilmagan bo'lsa, qayta olib kirish majburiyatisiz olib chiqish "
        ]
    },
    {
        "word": "Tovarlarni Intensiv (Jadal) Tarqatish ",
        "type": [],
        "definition": [
            "kundalik iste’mol tovarlarini mumkin qadar ko'proq joylarda tezroq sotish. "
        ]
    },
    {
        "word": "Tovarlarni Jalb Etib Tarqatish ",
        "type": [],
        "definition": [
            " awaliga iste’molchilarda yangi tovarga talab shakllantirish, so'ng vositachilarni jalb etish. "
        ]
    },
    {
        "word": "Tovarlarni Selektiv Tarqatish ",
        "type": [],
        "definition": [
            " tovarlarni tarqatishda ishtirok etishni istagan vositachilardan faqat ayrimlari jalb etiladi. "
        ]
    },
    {
        "word": "Tovarlarni Shaxsiy Sotish",
        "type": [],
        "definition": [
            "tovar sotish maqsadida bir yoki bir necha bo'lajak xaridor bilan suhbatlashib, tovarni og'zaki taqdim etish. "
        ]
    },
    {
        "word": "Tovarlarni Sotish Tizimi ",
        "type": [],
        "definition": [
            " marketingning asosiy bo'g'ini va tovarni yaratish, ishlab chiqarish va iste’molchigacha etkazish bo'yicha butun firma faoliyatining so'nggi qismidir."
        ]
    },
    {
        "word": "Tovarlarni Zoʻrlab Tarqatish ",
        "type": [],
        "definition": [
            " ishlab chiqaruvchi tomonidan tovarni vositachilar noroziligiga qaramay o'tkazish. "
        ]
    },
    {
        "word": "Tovarlashgan Xizmat ",
        "type": [],
        "definition": [
            " tovar sifatida oldi-sotti qilinuvchi xizmatlar, ya’ni pulli xizmatlardir. "
        ]
    },
    {
        "word": "Tovarni Bozorda Joylashtirish ",
        "type": [],
        "definition": [
            "bozorda tovar uchun raqobatbardosh holatni ta’minlash bo'yicha harakatlar va unga mos marketing majmuyini ishlab chiqish. "
        ]
    },
    {
        "word": "Tovarni Bozorda Joylashtirish ",
        "type": [],
        "definition": [
            "tovarlarning bozordagi raqobatbardoshligini ta’minlash va mos keluvchi marketing majmuasini ishlab chiqish uchun amalga oshiriluvchi harakatlar. "
        ]
    },
    {
        "word": "Tovarning Bozor Ulushi ",
        "type": [],
        "definition": [
            "aniq tovarning shu xildagi hamma tovarlar sotish umumiy hajmidagi hissasi. "
        ]
    },
    {
        "word": "Tovarning Hayotiylik Davri ",
        "type": [],
        "definition": [
            "tovar rivojlanishining uni ishlab chiqishdan to bozorga olib kirishgacha bo'lgan asosiy bosqichlarini aks ettiruvchi ma’lum bir vaqt davri (sikli). Tovarni sotish va foyda olish jarayonida besh bosqich ajratib ko'rsatiladi: tovarni ishlab chiqish (bozorgacha) bosqichi, tovarni bozorga olib kirish (kiritish) bosqichi, tovarni sotish hajmining o'sish bosqichi, yetuklik (to'yinganlik) bosqichi, tovarning susayish bosqichi yoki tovar eliminatsiyasi. "
        ]
    },
    {
        "word": "Tovarning Mavqeyi ",
        "type": [],
        "definition": [
            " tovarning raqib tovarlarga nisbatan iste’molchilar ongi va ko'nglida tutgan o'rni. "
        ]
    },
    {
        "word": "Tovarning Raqobatbardoshligi ",
        "type": [],
        "definition": [
            "l) aniq ehtiyojni qondirishda bozordagi raqobatchilar tovarlari oldida ustunlikni ta’minlovchi tovarning sifat va narx tavsifnomalari majmuyi; 2) tovarning raqobatchi tovarlar bozorida birinchi bo'lib xarid qilish qobiliyati; 3) tovarni iste’mol qilish (foydalanish) samarasining uni sotib olish va ekspluatatsiya qilishga sarflanuvchi xarajatlarga (iste’mol narxi) nisbati; 4) korxonaning milliy va jahon tovar bozorlariga chiqishi maqsadga muvofiqligining muhim ko'rsatkichi. "
        ]
    },
    {
        "word": "Tovarning Texnik Darajasi ",
        "type": [],
        "definition": [
            "tovarning fan-texnika taraqqiyoti, standartlar, texnik shartlar va boshqa texnik talablarga mos kelishi. "
        ]
    },
    {
        "word": "Tovlamachilik",
        "type": [],
        "definition": [
            " o'zgalar mulkini talon-taroj qilish yoki aldov hamda ishonchni suiiste’mol qilish orqali birovlar mulkiga egalik qilish huquqini olish, mulkchilikka qarshi yo'nalgan iqtisodiy jinoyatdir. "
        ]
    },
    {
        "word": "Transaksion Xarajatlar ",
        "type": [],
        "definition": [
            " bozorda tovarlarni sotishda egalik huquqini aniqlash va uni berish bilan bog'liq xarajatlar. "
        ]
    },
    {
        "word": "Transfert",
        "type": [],
        "definition": [
            " l) xorij valyutasi yoki oltinni bir mamlakatdan ikkinchisiga o'tkazish; 2) nomi yozilish, qimmatli qo'g'ozga egalik qilish huquqini bir shaxsdan ikkinchisiga o'tkazish; 3) turistlarni aeroportdan mehmonxonaga eltish bo'yicha transport xizmati; 4) bir institutsion birlik boshqa institutsion birlikka ekvivalent sifatida biror turdagi tovar, xizmat yoki aktiv olmasdan tovar, xizmat yoxud aktiv yetkazib berishi. "
        ]
    },
    {
        "word": "Transfert Toʻlovlar! ",
        "type": [],
        "definition": [
            " evaziga hech qanday tovar yoki xizmatlar olinmaydigan davlat xarajatlari ( pensiya, stipendiyalar, ishsizlik nafaqasi va boshqalar). "
        ]
    },
    {
        "word": "Transfertla",
        "type": [],
        "definition": [
            "-1 .Joriy yoki kapital transfert bo'ladi. Kapital transfertlar -bir hisobot davridan ko'proq vaqt mobaynida ishlab chiqarish vositasi sifatida foydalaniladigan tovarlar va nomoddiy aktivlardan iborat. 2. Daromadlar va boyliklarni qayta taqsimlashni ifodalaydigan ko'rsatkich. U bir institutsional birlik tomonidan ikkinchisiga tekinga berilgan pullar, tovarlar, xizmatlar yoki aktivlarni ifodalaydi. Ular joriy va doimiyga yoki pul formadagi va natural formadagi transfertlarga bo'linadi. "
        ]
    },
    {
        "word": "Transformatsiyaning Chegaraviy Meʼyori ",
        "type": [],
        "definition": [
            "ishlab chiqarish imkoniyatlari egri chizig'iga asoslanib, alternativ tovarning har bir qo'shimcha birligini olish uchun voz kechish kerak bo'lgan bir tovarning miqdori. "
        ]
    },
    {
        "word": "Transmilliy Korporatsiyalar ",
        "type": [],
        "definition": [
            "kooperativ asosda tashkil etilgan, jahon xo'jaligida bitta yoki bir qator tarmoqlarni nazorat qiluvchi yirik birlashmalar. Ularning kapitallari esa transmilliy kapital deyiladi."
        ]
    },
    {
        "word": "Transport Magistrali ",
        "type": [],
        "definition": [
            " ko'plab yuk va yo'lovchi oqimlari tashiladigan va texnik jihatdan jahon talablariga javob beradigan transport yo'li. Temir yo'l magistrali, odatda, ikki izli bo'lib, elektrovozlar yoki teplovozlar yordamida amalga oshiriladi. Transport magistrali eng muhim yo'nalishlarda xo'jalik aloqalarining markazlashuvidan vujudga keladi. Masalan, Transibir temir yo' 1 magistrali, Transevropa temiryo'l magistrali, Transamerika magistrali va h.k. "
        ]
    },
    {
        "word": "Transport Markazlari ",
        "type": [],
        "definition": [
            " temir yo'l stantsiyalari, dengiz bandargohlari -daryo pristanlari tushuniladi. Bu yerda ortish-tushirish ishlari amalga oshiriladi. Yo'lovchilar boshqa transport vositalari bilan almashinish imkoniyati mavjud. Transport markazlari iqtisodiyotning barcha sohalarini bog'laydi. Masalan, temir yo'l stansiyasi, dengiz bandargohlari, daryo pristanlari tushuniladi. "
        ]
    },
    {
        "word": "Transport Punkti ",
        "type": [],
        "definition": [
            " mahalliy ishlab chiqarish bilan aloqador bo'lgan transport korxonalari, omborxonalar, alohida stansiyalarvaportlami o'z ichiga oladi. Asosiy vazifasiyuklarni o'z tasir doirasidagi yuklarni ortish-tushirish bir transport turidan ikkinchisiga o'tkazish kabi ishlarni bajaradi. "
        ]
    },
    {
        "word": "Transport Tizimi ",
        "type": [],
        "definition": [
            "unga kiruvchi elementlar transport to‘ri, transport turlari, transport tuguni, transport markazlari va transport vositalarining o'zaro uyg'unlashgan holda to'g'ri hududiy tashki etilganligiga, ularning mustaqil faoliyat ko'rsata olishi va boshqaruvchanligiga tizim deyiladi. "
        ]
    },
    {
        "word": "Transport Toʻri Zichligi ",
        "type": [],
        "definition": [
            " aholi jon boshiga yoki hudud maydoniga to'g'ri keluvchi transport yo'llari uzunligi. Mazkur ko'rsatkich transportning ish natijalariga katta ta’sir ko'rsatadi. "
        ]
    },
    {
        "word": "Transport Tuguni ",
        "type": [],
        "definition": [
            "bir necha transport turlari, aloqa yo'llari o'zaro qo'shilgan va tarmoqlangan joy. Transport tugunlari xilma- xil belgilari, transport turlari, transport asosiy shaxobchalar sxemasi, xalq xo'jaligidagi ahamiyati, yuk oborotidagi asosiy yuk turlari, yuk va yo'lovchi aylanmasining katta kichikligiga qarab turlanadi. Ahamiyatiga ko'ra xalqaro, respublika, viloyat, mahalliy ahamiyatdagi transport tugunlariga ajratiladi. "
        ]
    },
    {
        "word": "Transport Vositalari Egalaridan Olinadigan Soliq",
        "type": [],
        "definition": [
            "transport vositalariga ega bo'Igan yuridik va jismoniy shaxslar tomonidan to'lanadi. Soliqning stavkasi ot kuchida ifodalangan dvigatelning quwatigabog' liqdir. Uning summasi mahsulotni ishlab chiqarish va realizatsiya qilish xarajatlarining tarkibiga kiritiladi. "
        ]
    },
    {
        "word": "Transport Logistikasi ",
        "type": [],
        "definition": [
            "muayyan moddiy buyumlar, yuklar va boshqalarni bir joydan boshqa bir joyga optimal yo'nalish bo'yicha yetkazib berish, tashishni tashkil etish tizimi. "
        ]
    },
    {
        "word": "Tranzaksion Depozitlar ",
        "type": [],
        "definition": [
            " yuridik shaxslaming bo'sh pul mablag'lari, ularning mablag'ini talab qilib olinguncha saqlanadigan depozit turi. "
        ]
    },
    {
        "word": "Tranzit",
        "type": [],
        "definition": [
            " (lot. “tranz” - o'tish) yo'lovchi va yuklar tashiladigan vositalarning yuk jo'natiladigan hamda yuk borishi kerak bo'Igan manzillar o'rtasida joylashgan stansiyalar, yo'llar, shuningdek, mamlakatlar orqali o'tish. Aniqroq qilib aytganda, yuk yoki yo' lovchini bir joydan ikkinchi joyga borishi uchun uchinchi joyni (boshqa joyni) kesib o'tishi. Tranzit avtomobil, tranzit yuk, tranzit yo'lovchi, tranzit daryo kabi tushunchalar ham ishlatiladi. "
        ]
    },
    {
        "word": "Tranzit Komission Bitimlar",
        "type": [],
        "definition": [
            " birjada ishtirok etish huquqi berilgan banklaming birjada ishtirok etish huquqi berilmagan kredit institutlari nomidan ishtirok etishi. "
        ]
    },
    {
        "word": "Trast Operatsiyalari ",
        "type": [],
        "definition": [
            " bank mijoz topshirig'i bilan ma’lum mulkni, pul, qimmatli qog'ozlar ko'rinishida saqlash, o'tkazish va boshqarishni o'z zimmasiga oladi."
        ]
    },
    {
        "word": "Trast-Kompaniya ",
        "type": [],
        "definition": [
            " operatsiya olib borish uchun ishonch qo'g'ozi beruvchi kompaniyalar, birlashma, fondlar. Trast-kompaniya ishonch asosida boshqalarga tegishli qimmatli narsalarni saqlash va boshqa operatsiyalami bajaradi. Trast-kompaniya ishonchli shaxslar - fiskal agentlar, transport agentlari, voting trast vakillari sifatida ish bajaradilar. "
        ]
    },
    {
        "word": "Trendli Texnik Indikator ",
        "type": [],
        "definition": [
            " trend chizig'ini chizib olish uchun eng kichik to'rtburchaklar usulida qurilgan to‘g‘ri chiziqdan iborat. "
        ]
    },
    {
        "word": "Trest",
        "type": [],
        "definition": [
            " monopoliyalarning yuqori shakli. Unda mahsulotni ishlab chiqarish, sotish, korxonalar moliyasi birlashadi. Trest ma’lum tarmoqda xukmronlik qiluvchi yagona ulkan shirkatchilik jamiyati hisoblanadi. "
        ]
    },
    {
        "word": "Trestchilikka Qarshi Qonunchilik",
        "type": [],
        "definition": [
            "erkin raqobatga to'sqinlik qiladigan monopolistik birlashmalarga qarshi kurashish yo'li bilan kapitalni markazlashtirish jarayonini boshqarish uchun qabul qilinadigan qonunchilik hujjatlari. Monopoliyalarga qarshi faoliyatni antimonopol qo'mitasi tashkil etadi. "
        ]
    },
    {
        "word": "Trillion",
        "type": [],
        "definition": [
            " biming yonidagi nollar soni 12 ta bo'lgan son. "
        ]
    },
    {
        "word": "Tugʻilish Koeffitsientining Yigʻindisi ",
        "type": [],
        "definition": [
            "har bir yosh guruhi bo'yicha hisoblangan tug'ilish koeffitsientlarining yig'indisi, bir ayol butun umri mobaynida tuqqan bolalar sonini ifodalaydi. "
        ]
    },
    {
        "word": "Tugʻilish Va Vafot Etishning Umumiy Koeffitsienti ",
        "type": [],
        "definition": [
            "joriy yilda tirik tug'ilganlar soni bilan vafot etganlar sonini mavjud bo'lgan o'rtacha yillik aholi soniga bo'linadi va promilleda (1000 kishiga nisbatan) ifodalanadi. "
        ]
    },
    {
        "word": "Tugatish Qiymati ",
        "type": [],
        "definition": [
            "nomoddiy aktivning chiqib ketishi bo'yicha kutilayotgan xarajatlarni chegirgan holda uning foydali xizmat muddati oxirida aktivni tugatish chog'ida olinishi kutilayotgan, aktivning taxmin qilinayotgan (baholangan) summasi. "
        ]
    },
    {
        "word": "Tumanlarga Boʻlinadi Gan Shahar Budjeti ",
        "type": [],
        "definition": [
            " umumshahar budjetini hamda shahar tarkibiga kiruvchi tumanlar budjetlarini; "
        ]
    },
    {
        "word": "Tuproq Resurslari ",
        "type": [],
        "definition": [
            " biologik resurslar bo'lib, ularning hosil bo'lishi halok bo'lgan organik massaning qayta ishlanishi bilan va yashash muhiti - litosferaning yuqori yumshoq qobig'i bilan bog'liqdir. Shuning uchun ular tirik organizmlarning to'plangan zaxiralari, biologik modda aylanib yurishi hajmi, tuproqning yillik organik qismi yoki gumus ko'rinishidagi mahsulotlar va chiqindilar bilan ajralib turadi. "
        ]
    },
    {
        "word": "Turgʻun Ishsizlik ",
        "type": [],
        "definition": [
            " mehnatga layoqatli aholining doimiy ish joyiga ega bo'lmagan guruhiga aytiladi. "
        ]
    },
    {
        "word": "Turgʻunlik",
        "type": [],
        "definition": [
            " iqtisodiy krizislar davrida ishlab chiqarish jarayonining ma’lum davrda deyarli ishlamaslik iqtisodiy holatiga aytiladi. Bu bosqichda ishlab chiqarish jarayonining jonlanishi uchun ma’lum bir davr ichida shart-sharoit yaratiladi. "
        ]
    },
    {
        "word": "Turmush Darajasi ",
        "type": [],
        "definition": [
            " odatda aholi iste’mol qiladigan hayotiy ne’matlarning miqdori va sifatiga asoslanadi. Bu moddiy ne’matlar tarkibi judahamxilma-xil.TDko'rsatkichlariyaxlittizimishakllanganbo'lib, unga tug'ilish, olishva boshqa demografik korsatkichlar, hayotning sanitariya-gigiyena shart-sharoitlari, oziq-ovqat tovarlarini iste’mol qilish darajasi, sog'liqni saqlash, ta’lim, madaniyat, ish bilan bandlik, mehnat sharoiti, aholining daromadlari va xarajatlari, narx-navo darajasi, transport vositalari, dam olishning tashkil etilishi, ijtimoiy ta’minlanganligi, inson erkinligi kabi ko'rsatkich bilan belgilanadi. "
        ]
    },
    {
        "word": "Turmush Darajasi Tizimi ",
        "type": [],
        "definition": [
            " jismoniy ma’naviy va ijtimoiy jj ehtiyojlaming rivojlanish darajasi, qondirilganlik miqyosi va ularni qoniqtirish uchun yaratilgan imkoniyatlarni aks ettiruvchi kompleks ijtimoiy-iqtisodiy kategoriyadir. "
        ]
    },
    {
        "word": "Turmush Sifati ",
        "type": [],
        "definition": [
            "jamiyat farovonligi darajasini namoyon etuvchi va mohiyatiga ko'ra uning o'lchovi hisoblanuvchi tushuncha. "
        ]
    },
    {
        "word": "Tushayotgan Talab ",
        "type": [],
        "definition": [
            " ma’lum paytda erishgan yuqori darajasidan pasayib borayotgan talab. "
        ]
    },
    {
        "word": "Tushum",
        "type": [],
        "definition": [
            "l) korxonaning ishlab chiqarilgan mahsulotni sotishdan kelgan pul mablag‘i; 2) biror narsani sotishdan keladigan foyda; daromad ko'rinishidagi pul. "
        ]
    },
    {
        "word": "Tuzatish Kiritilgan Mavjud Daromad ",
        "type": [],
        "definition": [
            " institutsion birlik yoki sektorning mavjud daromadiga shu birlik va sektor olgan natura shaklidagi ijtimoiy transfertlar qiymatini qo'shish va undan shu birlik va sektor bergan natura shaklidagi ijtimoiy transfertlar qiymatini chegirib tashlashgandan so'nggi daromad. "
        ]
    },
    {
        "word": "Tuzilishini Qayta Коʼrib Chiqib Oʻzgartirish ",
        "type": [],
        "definition": [
            " obyektiv shartsharoitlar taqozosi bilan paydo bo'lgan konkret muammoni pozitiv tarzda hal etish maqsadida biron-bir narsaning tashkiliy tuzilishini muayyan parametrlarga (muddati, vazifasi, ko'lami, xarajatlar va xokazo) qarab o'zgartirish. Inqiroz xavfining oldini olishga yo'naltirilgan boshqaruvning o'ziga xos uslublaridan biri (bu o'rinda mavjud qarzdorlikning, korxona, moliyaviy tizim, texnologiyalar va personalning tarkibiy tuzilishini qayta ко'rib chiqib, o'zgartirish). "
        ]
    },
    {
        "word": "Tyurgo Ann Roberjak ",
        "type": [],
        "definition": [
            " (1727-1781) fransiyalik, fiziokratizm g'oyasini rivojlantirdi. Sof bozor iqtisodiyoti tarafdori. Minimal ish haqini qo'llagan, jamiyatda (kapitalist va ishchilarni qo'shgan holda) beshta sinf (Keneda esa uchta) borligini aytdi."
        ]
    }
]