[
    {
        "word": "Uchyot",
        "type": [],
        "definition": [
            "hisoblashish, ro'yxatga olish yo'li bilan narsalarning borligini aniqlash; hisob-kitob. "
        ]
    },
    {
        "word": "Ulgurji Baho ",
        "type": [],
        "definition": [
            "korxonalar yoki tovar yetkazib beruvchilarning katta miqdordagi o'z mahsulotini boshqa korxona va tashkilotlarga ko'tarasiga sotadigan baholari. Ulgurji baholar mahsulotni ishlab chiqarish va sotish uchun ketgan mehnat xarajatlari, iste’mol xususiyatlari, sifati va to'lovga qobil talabini ifodalashi kerak. Ular ishlab chiqarish samaradorligining oshishiga imkon yaratadi."
        ]
    },
    {
        "word": "Ulgurji Narx ",
        "type": [],
        "definition": [
            "ulgurji savdo qiluvchilarning chakana savdo qiluvchi firmalarga tovar sotishida qo'llaniladigan narx. Ishlab chiqaruvchilarning narxiga ulgurji savdo qiluvchining ishlab chiqarish, marketing xarajatlari va daromadini qo'shganda mahsulotning ulgurji narxi kelib chiqadi. "
        ]
    },
    {
        "word": "Ulgurji Savdo ",
        "type": [],
        "definition": [
            "tovar muomalasining shakllaridan biri, uning vositasida korxonalar o'rtasida iqtisodiy aloqalar amalga oshiriladi. O'zbekistonda ulgurji savdo asosan tovar, xomashyo birjasi orqali amalga oshiriladi. "
        ]
    },
    {
        "word": "Ulugʻbek Muhammad Taragʻay ",
        "type": [],
        "definition": [
            " (1394-1449) A.Temurning nabirasi, Shohruhning o'g'li, Movarounnahrda podsholik qildi, ilm-fan, madaniyat rivojiga, mamlakatning iqtisodiy ravnaqiga katta hissa qo'shdi, 1428-yil Fulusiy pullar islohotini o'tkazib, chaqa pullar qadrini mustahkamladi, “Tamg'a” bojiga alohida e’tibor berdi, uning podsholik davrida mamlakatda ichki va tashqi savdo o'sdi. "
        ]
    },
    {
        "word": "Umidsiz Qarz ",
        "type": [],
        "definition": [
            "sud qaroriga binoan majburiyatlarning tugatilishi, qarzdoming bankrotligi, tugatilishi yoki vafot etishi yoxud da’vo qilish muddati o'tishi oqibatida uzish mumkin bo'lmagan qarz."
        ]
    },
    {
        "word": "Umumdavlat Boshqaruvi Sektori Ichidagi Joriy Transfertlar ",
        "type": [],
        "definition": [
            " turli davlat birliklari yoki umumdavlat boshqaruvining turli sektorchalari o'rtasidagi joriy transfertlar. "
        ]
    },
    {
        "word": "Umumdavlat Boshqaruvining Haqiqiy Pirovard Isteʼmoli ",
        "type": [],
        "definition": [
            "umumdavlat boshqaruvi birliklarining haqiqiy pirovardiste’molning qiymati jamoaga ko'rsatilgan xizmat xarajatlari qiymatiga teng deb qabul qilinadi."
        ]
    },
    {
        "word": "Umumdavlat Moliyasi ",
        "type": [],
        "definition": [
            " davlatning funksiyalari va vazifalarini bajarish hamda kengaytirilgan takror ishlab chiqarish uchun sharoitlarni yaratish maqsadida markazlashtirilgan pul mablag'lari fondlarini shakllantirish, taqsimlash va ulardan foydalanish jarayonida vujudga keladigan iqtisodiy munosabatlar tizimi. "
        ]
    },
    {
        "word": "Umumishlab Chiqarish Xarajatlari ",
        "type": [],
        "definition": [
            " asosiy va yordamchi ishlab chiqarish sexlarini boshqarish hamda ular ishlab chiqarishini tashkil qilish bilan bog'liq xarajatlardir. Ularga “Xarajatlar tarkibi to'g'risidagi Nizom'ga muvofiq “Ishlab chiqarish xarakteridagi asosiy fondlar va nomoddiy aktivlar amortizatsiyasi”, “Ishlab chiqarish xarakteridagi boshqa xarajatlar” kiradi. "
        ]
    },
    {
        "word": "Umumiy Bozor ",
        "type": [],
        "definition": [
            " ishlab chiqarish omillarini milliy chegaralar orqali erkin ko'chib o'tishi ta’minlanadigan iqtisodiy integratsiya ko'rinishi. 12 ta G'arbiy Yevropa davlatlari a’zo bo'lgan iqtisodiy uyushma. U 1957-yilda tashkil etilgan bo'lib, uning maqsadlari: boj ittifoqi va hamjamiyatga a’zo mamlakatlar doirasida kapital, tovarlar, ish kuchi, xizmatlarning erkin ko'chib yuradigan umumiy bozorini shakllantirish; unga a’zo mamlakatlarga nisbatan yagona savdo siyosatini, shuningdek, valyuta, qishloqxo'jaligi, transport sohalarida umumiy siyosatnio'tkazish, moliya tizimini birxillashtirish, iqtisodiy va valyuta ittifoqini tuzish va boshqalar. Hozirgi vaqtda ittifoqqa kiruvchi davlatlar o'rtasida milliy chegaralar ramziy tus olib, yagona valyuta va yagona narxlarga o'tilmoqda. Uning oliy organi Brussel (Belgiya) shahrida joylashgan Komissiya va Vazirlar Kengashidir. "
        ]
    },
    {
        "word": "Umumiy Daromad (Tushum) ",
        "type": [],
        "definition": [
            " ishlab chiqarilgan hamma tovar birliklarini sotishdan ohngan tushum, ya’ni T = P*Qj bunda R - narx, Q_- sotish hajmi. Masalan, firma 1000 juft oyoq kiyim ishlab chiqardi va uning har bir juftini 100 so'mdan sotdi. Bunda umumiy daromad 100000 = (1000*100) so'mga teng bo'ladi. "
        ]
    },
    {
        "word": "Umumiy Kapitalning Yetarliligi ",
        "type": [],
        "definition": [
            "bankning umumiy kapitali miqdorini riskka tortilgan aktivlarga nisbati orqali aniqlovchi ko'rsatkich. "
        ]
    },
    {
        "word": "Umumiy Mehnat Taqsimoti ",
        "type": [],
        "definition": [
            "kishilar faoliyatining ishlab chiqarish va noishlab chiqarish sohalari o'rtasidagi mehnat taqsimoti, bu sohalar orasida esa sanoat, qishloq xo'jaligi, transport, aloqa, savdo, xalq ta’limi, fan, davlat boshqaruvi, madaniyat va hokazolar o'rtasidagi mehnat taqsimotidir. "
        ]
    },
    {
        "word": "Umumiy Mulk ",
        "type": [],
        "definition": [
            " jamoaga birlashgan hamma kishilarning asosiy ishlab chiqarish vositalariga birgalikda teng munosabatda bo'Iishligi. Mulkning bunday turi tarixan turli ko'rinish va shakllarda mavjud bo'lgan. Masalan, ibtidoiyjamoa tuzumi davridagi urug‘ lar, j am oalar mulki, hozirgi davrda oilaning umumiy mulki, turar-joy, dala-hovli, mashina, u yoki bu jihozlari va boshqalar. O'zbekistonda umumiy birgalikdagi egalik mulk: yer, suv, o'rmon, o'simlik va hayvonot dunyosi, shuningdek, davlat mulki va h.k. "
        ]
    },
    {
        "word": "Umumiy Muvozanat ",
        "type": [],
        "definition": [
            "hamma mavjud bozorlarning muvozanatlashtirilgan va kelishilgan holda harakat qilishini aks ettiruvchi holat. Masalan, bugun 4500 so'mga: 1 kg o'simlik yog'i - 400 so'mga, 1 kg shakarni - 100 so'mga, 1 juft oyoq kiyimni - 4 ming so'mga sotib olish mumkin, deb faraz qilamiz. Agar ma’lum muddatdan so'ng 4500 so'mga sotib olish mumkin bo'lgan tovar miqdori sifati nisbatan saqlanib qolsa, demak o'sha muddatda iqtisodiyot umumiy muvozanat holatida bo'ladi, deb hisoblanadi. "
        ]
    },
    {
        "word": "Umumiy Muvozanat Tahlili ",
        "type": [],
        "definition": [
            "bozor tizimini bir butun, yaxlit holda o'rganish hamma bozorlardagi muvozanatli narxlar va ishlab chiqarish hajmlari o'rtasida bog'liqlikni o'rganish. "
        ]
    },
    {
        "word": "Umumiy Muvozanatlik ",
        "type": [],
        "definition": [
            "barcha bozorlarning o'zaro bir-biriga ta’siri natijasida o'rnatiladigan muvozanatlik. Barcha bozorlarning muvozanat holatida bo'lishi. Bunda biror bozorda muvozanatlik buzulsa boshqa bozorlarda ham muvozanatlik buziladi "
        ]
    },
    {
        "word": "Umumiy Naflik ",
        "type": [],
        "definition": [
            " iste’mol qilingan ne’matlardan olingan jami naflik. UMUMIY NARX - bir xil yoki o'xshash tovarlarga hamma xaridorlar "
        ]
    },
    {
        "word": "Umumiy Sifat Boshqaruvi ",
        "type": [],
        "definition": [
            "tashkilotning shunday boshqaruv tizimiki, bu tashkilot mahsulotlarini raqiblarining o'xshash mahsulotlariga nisbatan barcha ko'rsatkichlari bo'yicha raqobatbardoshligi yuqoriligini ta’minlaydi. "
        ]
    },
    {
        "word": "Umumiy Sugʻurta ",
        "type": [],
        "definition": [
            "shaxsiy, mulkiy sug'urta, javobgarlikni sug'urta qilish hamda hayotni sug'urta qilish sohasiga taalluqli bo'lmagan boshqa sug'urta turlari. "
        ]
    },
    {
        "word": "Umumiy Usullar ",
        "type": [],
        "definition": [
            "bank risklari miqdorini daromadlariga bog'liq ravishda baholash va bashorat qilish hamda bank Iikvidliligiga nisbatan belgilangan iqtisodiy normativlarni bajarish kiradi. "
        ]
    },
    {
        "word": "Umumiy Xarajatlar ",
        "type": [],
        "definition": [
            "korxonaning mahsulot ishlab chiqarish uchun sarflangan barcha xarajatlari yig'indisi. "
        ]
    },
    {
        "word": "Umumiy Zaxiralar ",
        "type": [],
        "definition": [
            "bunday zaxiralar kredit portfeli uchun tashkil etiladi. Umumiy zaxiralar kredit portfeliga xos bo'lgan yashirin tavakkalchilikdan himoya qilish maqsadida tashkil etiladi. Ular odatda ssuda bo'yicha qarzdorlik summasiga nisbatan foizda belgilanadi."
        ]
    },
    {
        "word": "Umumlashtirilgan Moliyaviy Smeta (Budjet) ",
        "type": [],
        "definition": [
            "daromadlar va sarflar yig'ilgan shaklda keltirilgan naqd pul mablag‘larining harakati hisoblangan va balansi aks ettirilganyig'ma hujjat. "
        ]
    },
    {
        "word": "Umumlashtirilgan Smeta ",
        "type": [],
        "definition": [
            "foyda va zararlar to'g'risidagi hisobotning loyihasi. "
        ]
    },
    {
        "word": "Umumuslubiy Usullar ",
        "type": [],
        "definition": [
            "taftish, audit, tahlil, mavzuli tekshirish, tadqiq qilish, pirovard natijaga dasturiy baholash, “sanset” uslubi; "
        ]
    },
    {
        "word": "Undirma Sanoat Rentasi ",
        "type": [],
        "definition": [
            " asosan yer osti, yer usti boyliklarining joylashish darajasiga qarab belgilanadigan rentaga aytiladi. "
        ]
    },
    {
        "word": "Undiruvchi Sanoat ",
        "type": [],
        "definition": [
            " yer ostidan, suvdan va o'rmonlardan turli xil xomashyo va yoqilg'i chiqaruvchi sanoat sohasi. Asosiy sohalari foydali qazilmalar (ko'mir, neft, tabiiy gaz, slanets, torf, temir rudasi, rangli, nodir asl metallar va noruda xomashyolar) qazib chiqarish, ovchilik, baliqchilik, dengiz hayvonlarini ovlash va yog'och tayyorlashdir. Undiruvchi sanoat mahsulotlari asosan qayta ishlovchi sanoatda qo'llaniladi. "
        ]
    },
    {
        "word": "Unifikatsiya",
        "type": [],
        "definition": [
            "turli xildagi mahsulotlar, detallar, uzellar va boshqa qo'llaniladigan materiallar va texnologik jarayonlarni rasional jihatdan bir xilligini ta’minlash. "
        ]
    },
    {
        "word": "Unitar Davlat ",
        "type": [],
        "definition": [
            " ma’muriy hududiy birligiga ko'ra yagona qonun chiqaruvchi va ijroiya hokimiyat, yagona davlat organlari tizimi, yagona konstitutsiya mavjud bo'Igan davlat. "
        ]
    },
    {
        "word": "Unumdorlik ",
        "type": [],
        "definition": [
            "foydalanilgan moddiy resurslar yoki xarajat birligiga to'g'ri keladigan ishlab chiqarilgan mahsulot yoki bajarilgan ish birligi. "
        ]
    },
    {
        "word": "Unumli Isteʼmol ",
        "type": [],
        "definition": [
            "ishlab chiqarish jarayonida ishlab chiqarish vositalaridan, ish kuchidan va ishlab chiqarishga sarflangan kapitaldan foydalanish darajasini ifodalaydi. "
        ]
    },
    {
        "word": "Urbanizatsiya",
        "type": [],
        "definition": [
            "jamiyat taraqqiyotida shaharlar rolini oshirish jarayoni. Urbanizatsiya jarayoni shahar aholisining tabiiy o'sishi, qishloq aholi punktlarini shaharlarga aylantirish, keng shahar oldi hududlarini shakllantirish hamda aholining qishloq joylaridan shahar joylariga migratsiyasi hisobiga ro'y beradi. "
        ]
    },
    {
        "word": "Uskunalar Va Transport Vositalarini Kapital Taʼmirlash ",
        "type": [],
        "definition": [
            " agregatni to'liq ajratib yig'ish amalga oshiriladigan ta’mirlashdir,bazaviy va korpus detallari va uzellarini ta’mirlash, barcha eskirgan detallar vauzellarni almashtirish yoki tiklashhamda agregatni yig ish, sozlash va sinab ko'rishdir. Binolarva inshootlarni kapital ta’mirlash - bazaviy va korpus detallari va uzellarini ta’mirlash, barcha eskirgan konstruksiyalaming detallari va uzellarini almashtirish yoki tiklash amalga oshiriladigan ta’mirlashdir."
        ]
    },
    {
        "word": "Uskunalarni Zamonaviylashttrish ",
        "type": [],
        "definition": [
            "harakatdagi uskunalar konstruksiyasiga, uning texnik darajasini oshiruvchi hamda texnik va iqtisodiy ko'rsatkichlarini yaxshilovchi sezilarli o'zgarishlar kiritish. Zamonaviylashtirish ikkinchi shakldagi ma’naviy eskirishning oldini olishga ko'maklashadi. "
        ]
    },
    {
        "word": "Uslub ",
        "type": [],
        "definition": [
            " ishlash, boshqarishdagi o'ziga xos yo'l, usul ma’nosini anglatadi. "
        ]
    },
    {
        "word": "Uslubiyat",
        "type": [],
        "definition": [
            "iqtisodiy jarayonlarni ilmiy bilishning tamoyillari, qonunqoidalari, hodisalari tizimidir. "
        ]
    },
    {
        "word": "Ustama",
        "type": [],
        "definition": [
            "l) pul hisobida maosh ustiga qo'shib beriladigan qo'shimcha,- 2) qo'shimcha ravishda, takroran, yana; 3) mahsulotning ishlab chiqarilishi bilan bog'liq bo'lmagan, faqat uni tarqatish bilan bog'liq bo'lgan, qo'shimcha ravishda sarflanadigan (mehnat, xarajat va shu kabilar). "
        ]
    },
    {
        "word": "Ustama Xarajatlar ",
        "type": [],
        "definition": [
            " asosiy xarajatlarga qo'shimcha bo'lib, ular bilan birga ishlab chiqarish xarajatlari tarkibiga kiritiluvchi, ishlab chiqarish va korxona boshqaruviga xo'jalik xizmati ko'rsatish xarajatlari. "
        ]
    },
    {
        "word": "Ustav Fondi ",
        "type": [],
        "definition": [
            " ta’sischi (davlat, tashkilot muassasasi, mehnat jamoasi, jismoniy shaxs) tomonidan korxonaning doimiy ixtiyoriga beriladigan moddiy va pul mablag' larining yig'indisi. Ustav fondining dastlabki miqdori korxona tashkil etilayotganida uning ustavida qayt etiladi va asosiy hamda oborot fondlarini shakllantirish uchun shaxsiy mablag'laming asosiy manbai sifatida ishlatiladi. Ustav fondi miqdori hisobot davrining boshida va oxirida buxgalteriya balansining passivida aks ettiriladi hamda korxonaning asosiy fondlari qoldik qiymatiga va oborot mablag'lariga bo'lgan eng kam ehtiyojiga mos bo'ladi. Ustav fondi miqdori xo'jalik faoliyati jarayonida o'zgarmasdan qolmaydi. U ko'payishi yoki kamayishi mumkin. Ustav fondi asosiy vositalarda investitsiyalar, mehnat vositalarini qayta baholash yoki indeksatsiyalash hisobiga ko'payadi; uning kamayishi asosiy vositalarni hisobdan chiqarish, eskirishini hisoblash, ularni qayta baholash natijasi bo'lishi mumkin. Ustav fondi oborot vositalarida unga foydaning bir qismi qo'yilishi, tovar moddiy boyliklar va boshqa oborot vositalarini bepul olish hisobiga ko'payadi, o'tganyilgi xarajatlami hisobdan chiqarish, tovar moddiy boyliklarni arzonlashtirish va b. hisobiga kamayishi mumkin. "
        ]
    },
    {
        "word": "Ustav Kapitali ",
        "type": [],
        "definition": [
            " huquqlar va imtiyozlar olish uchun korxona muassislari tomonidan ta’sis hujjatlariga muvofiq qo'shilgan (to'langan) hamda korxonaningxo'jalik faoliyatini amalga oshirish uchun zarur bo'lgan moddiy boyliklar, pul mablag'lari va xarajatlar majmuyidir. "
        ]
    },
    {
        "word": "Ustama",
        "type": [],
        "definition": [
            "l) pul hisobida maosh ustiga qo'shib beriladigan qo'shimcha; 2) qo'shimcha ravishda, takroran, yana; 3) mahsulotning ishlab chiqarilishi bilan bog'liq bo' lmagan, faqat uni tarqatish bilan bog' liq bo'lgan, qo'shimcha ravishda sarflanadigan (mehnat, xarajat va shu kabilar). "
        ]
    },
    {
        "word": "Usul",
        "type": [],
        "definition": [
            " (metod yunoncha “metodos”) tushunchasi ikki ma’noni bildiradi: ayrim voqealarni bilish, o'rganish usuli va alohida usul, harakat usuli yoki ko'rinishi. "
        ]
    },
    {
        "word": "Uyjoy Fondi ",
        "type": [],
        "definition": [
            "l) uy-joy qurilishi va boshqa qurilishlardan iborat va ularga tegishli binolar yig'indisi. Uyjoy fondi hisoblashbirligibo'lib, uy-joy qurilishi, uy-joy binolari, umumiy va uy-joy maydoni hisoblanadi; 2. budjetdan uy-joylarni qurish uchun ajratiladigan fond. "
        ]
    },
    {
        "word": "Uy Xoʻjaligi ",
        "type": [],
        "definition": [
            " muayyan bir turar joyda istiqomat qiluvchi, jami yoki bir qism daromadlari yoki boyliklarini umumlashtirib, muayyan turdagi mahsulot va xizmatlarni, asosan uy-joy xizmati va oziq-ovqat mahsulotlarini birgalikda iste’mol qiluvchi uncha ko'p bo'lmagan odamlar guruhi. "
        ]
    },
    {
        "word": "Uy Xoʻjaligi Ihtiyoridagi Mol-Mulk ",
        "type": [],
        "definition": [
            "birgalikda va individual ishlatiladigan mol-mulkdan iborat bo'ladi, ular asosan iste’mol buyumlari hisoblanadi. "
        ]
    },
    {
        "word": "Uy Xoʻjaligi Moliya Resurslarining Yangi Manbalari ",
        "type": [],
        "definition": [
            "mulkdan kelgan daromaddir, lekin uning ahamiyatini mulkning miqdori va uni samarali ishlatilishi belgilaydi. "
        ]
    },
    {
        "word": "Uy Xoʻjaligi Sektorining Yakuniy Isteʼmoli ",
        "type": [],
        "definition": [
            "aholi tomonidan o'z mablag'lari evaziga sotib olingan, davlat budjeti hisobidan yoki notijorat tashkilotlari tomonidan bepul berilgan tovarlar va xizmatlar yig'indisidan iborat. "
        ]
    },
    {
        "word": "Uy Xoʻjaligiga Xizmat Koʻrsatuvchi Notijorat Tashkilotlar ",
        "type": [],
        "definition": [
            "yakuniy iste’moli bo'lmaydi. Ularning aholi iste’moli uchun qilgan sarf-xarajatlari uy xo'jaligining yakuniy iste’moli hisoblanadi."
        ]
    },
    {
        "word": "Uy Xojaligiga Xizmat Koʻrsatuvchi Notijorat Tashkilotlar Sektori ",
        "type": [],
        "definition": [
            " uy xo'jaligiga xizmat ko'rsatuvchi notijorat tashkilotlar sektori rezidentli barcha notijorat tashkilotlar yig'indisidan iborat bo'ladi, ammo bundan bozor uchun ishlab chiqaruvchi notijorat tashkilotlar hamda davlat birliklari tomonidan nazorat qilinuvchi va asosan moliya bilan ta’minlanuvchi bozor munosabatlariga aloqador bo'lmagan notijorat tashkilotlar istisno. Uning resurslari, asosan, ko'ngilli badallar, uy xo'jaligi xayr-ehsonlari va mulkdan olingan daromaddan iborat bo'ladi. "
        ]
    },
    {
        "word": "Uy Xojaligiga Xizmat Koʻrsatuvchi Tijorat Tashkilotlar ",
        "type": [],
        "definition": [
            " uy xo'jaligiga bepul yoki katta iqtisodiy ahamiyatga ega bo'lmagan narxlarda mahsulot yetkazib beradigan va xizmat ko'rsatadigan tashkilotlar. "
        ]
    },
    {
        "word": "Uy Xoʻjalik Lari Daromadlari ",
        "type": [],
        "definition": [
            " ma’lum bir davrda uy xo'jaliklarining ixtiyoriga kelib tushuvchi pul mablag'lari summalari. "
        ]
    },
    {
        "word": "Uy Xoʻjaliklari Moliyasining Ijtimoiy Funksiyasi ",
        "type": [],
        "definition": [
            "uy xo'jaliklarining daromadlari, xarajatlari va jamg'armalari aholi va uning alohida guruhlari ijtimoiy-iqtisodiy holatini bevosita aks ettiradi, shaxsning shakllanishi va demografik jarayonlarga o'z tasirini ko'rsatadi. "
        ]
    },
    {
        "word": "Uy Xoʻjaliklari Moliyasini Ragʻbatlantiruvchi Funksiya",
        "type": [],
        "definition": [
            " aholi real daromadlarining o'sishiga yo'naltirilgan ishlab chiqarish jarayonining rivojlanishiga va samarali budjet siyosatiga asoslangan rag'batlantiruvchi moliya mexanizmini (moliyaviy mexanizmni) yaratish orqali amalga oshiriladi. "
        ]
    },
    {
        "word": "Uy Xoʻjaliklari Sektori ",
        "type": [],
        "definition": [
            "sektor rezidentli barcha uy xo'jaliklaridan tarkib topadi. Institutsion birlik deb tan olingan ayrim uy xo'jaliklari o'z tarkibiga uy xo'jaliklarining va ularning mulki ajralmas qismi bo'lgan korporatsiyalashmagan korxonalarni ham kiritadi. Faqat kvazikorporatsiyalarni tashkil etuvchi uy xo'jaligi korxonalarigina alohida institutsion birlik hisoblanadi. "
        ]
    },
    {
        "word": "Uy Xoʻjaliklari Xarajatlari ",
        "type": [],
        "definition": [
            " uy xo'jaliklari tomonidan iste’molga, majburiy to'lovlarni amalga oshirishga va jamg'arishga yo'naltiriladigan pul mablag'lari. "
        ]
    },
    {
        "word": "Uy Xoʻjaliklarining Haqiqiy Pirovard Isteʼmoli ",
        "type": [],
        "definition": [
            "uy xo'jaliklarining haqiqiy pirovard iste’moli individual uy xo'jaliklari o'z xarajatlari hisobiga yoki ijtimoiy transfertlar orqali umumdavlat boshqaruv birliklari va notijorat tashkilotlardan natura shaklida oladigan iste’mol mollari va xizmatlar uy xo'jaliklarining haqiqiy pirovard iste’moli sanaladi. "
        ]
    },
    {
        "word": "Uy Xoʻjaliklarining Isteʼmolchilik Sarflari ",
        "type": [],
        "definition": [
            "kundalik tovarlarga foydalaniladigan iste’mol buyumlariga va boshqalarga qilinadigan sarflardir."
        ]
    },
    {
        "word": "Uy Xoʻjaliklarining Natural Shakldagi Daromadlari ",
        "type": [],
        "definition": [
            "tovar shakliga ega emas va ular o‘z-o‘zini ta’minlashga mo'ljallangan uy xo'jaligi azolari mehnatining natijasidan iborat bo'ladi. "
        ]
    },
    {
        "word": "Uyali Aloqa ",
        "type": [],
        "definition": [
            "uyali tarmoqqa asoslangan mobil radioaloqaning bir turi. "
        ]
    },
    {
        "word": "Uy-Joy Soligʻi ",
        "type": [],
        "definition": [
            "kirish materiallarini bitta uzluksiz jarayon davomida tugallangan mahsulotga aylantirishga mo'ljallangan (ko'p hollarda avtomatlashgan) oqim tizimi. "
        ]
    },
    {
        "word": "Uzluksiz Tasodifiy Miqdor ",
        "type": [],
        "definition": [
            "qabul qiladigan cheksiz ko'p qiymatli sonlar o'qidagi biror chekli yoki cheksiz oraliqni tashkil qiluvchi miqdor. "
        ]
    },
    {
        "word": "Uzoq Foydalaniladigan Isteʼmol Mollari ",
        "type": [],
        "definition": [
            " iste’mol ehtiyoji (maqsadi)ni bir yil yoki undan uzoqroq muddatga ko'p marta yoki doimo qondirish uchun mo'ljallangan tovarlar. "
        ]
    },
    {
        "word": "Uzoq Muddat Davomida Ishlatiluvchi Tovarlar ",
        "type": [],
        "definition": [
            "iste’molchilarga uzoq vaqt xizmat qiladigan (1 yildan kam) tovarlar. Bunday tovarlarga avtomobil, xolodilniklar va boshqa turdagi maishiy xizmat vositalari kiradi. "
        ]
    },
    {
        "word": "Uzoq Muddat Foydalaniladigan Tovar ",
        "type": [],
        "definition": [
            "bir yil yoki undan ko'proq muddat davomida fizik jihatdan normal yoki o'rtacha darajada foydalanilganda doim yoxud ko'p marta ishlatiladigan tovar. "
        ]
    },
    {
        "word": "Uzoq Muddatli Depozitlar ",
        "type": [],
        "definition": [
            "jismoniy va yuridik shaxslarning tijorat banklariga bir yildan ortiq muddatga qo'yilgan pul ko'rinishidagi jamg'arma va omonatlar. "
        ]
    },
    {
        "word": "Uzoq Muddatli Ijara Beruvchi ",
        "type": [],
        "definition": [
            "ijarachiga haq evaziga mol-mulkni 12 oydan ko'p muddatga egalik qilish va foydalanish yoki foydalanish huquqini beradigan kelishuv. "
        ]
    },
    {
        "word": "Uzoq Muddatli Zayomlar ",
        "type": [],
        "definition": [
            "davlat tomonidan olinadigan kredit. Zayom obligatsiyalari bank yoki omonat kassalari orqali aholiga sotiladi. Ma’lum muddatdan so'ng (5 yil) aholiga zayom obligatsiyalari summasi qaytariladi."
        ]
    }
]