[
    {
        "word": "Vaqf",
        "type": [],
        "definition": [
            "mulkdorlar tomonidan diniy muassasaa ixtiyoriga daromadidan foydalanib turish uchun o'tkazilgan yoki vasiyat qilib qoldirilgan mulk (yer, suv, bino va shu kabilar). "
        ]
    },
    {
        "word": "Vakolat",
        "type": [],
        "definition": [
            "vakillik huquqi bo'lsa, mas’uliyat biror ish, xatti-harakat oqibati, natijasi uchun bo'lgan javobgarlikdir. "
        ]
    },
    {
        "word": "Valras Leon ",
        "type": [],
        "definition": [
            "(1834-1910) shveytsariyalik iqtisodchi, xalq xo'jaligining iqtisodiy-matematik modelini va umumiy muvozanat nazariyasini yaratgan. Unga binoan qiymat, ma’ lum miqdordagi tovarni me’yoriy ijtimoiy nafliligi va uni ishlab chiqarishga sarf qilingan me’yoriy ijtimoiy xarajatlar o'rtasidagi muvozanat nuqtasida aniqlanadi. Bir vaqtning o'zida talab va taklif o'zaro qoplanadigan muvozanatli iqtisodiy tizimni topishga imkon beruvchi tenglamalar tizimini ishlab chiqqan. U o'z navbatida ishlab chiqarishning optimal strukturasini topish, iqtisodiyotda tarmoqlararo balanslarni ishlab chiqishga asos bo'lib xizmat qilgan."
        ]
    },
    {
        "word": "Valyuta",
        "type": [],
        "definition": [
            " (ital. “valyuta”, lot. ‘valere’ - qadrlanmoq, qiymat). 1. Muayyan mamlakatda qabul qilingan pul tizimi va shu mamlakatning pul birligi (dollar, so'm, rubl, manat, marka, iyen va boshqalar); 2. Chet el kredit biletlari, moneta va boshqalar; 3. Veksel muomalasida - vekselda ko'rsatilgan to'lov miqdori. Valyutaning ikki turi mavjud bo'lib, birinchisi har bir mamlakatning valyutasi bo'lmish milliy valyutadir; ikkinchisi erkin almashtiriladigan valyutadir. Milliy valyuta qaysi mamlakatniki bolsa, o'sha mamlakatda tovar bilan qoplangandagina haqiqiy kuchga va qadrga ega bo'ladi. Milliy valyuta faqatgina oltin zaxirasi bilangina emas, balki barqaror, erkin almashtiriladigan valyuta bilan ham yetarlicha mustahkamlangan bo'lishi kerak. Buning uchun esa mamlakat o'z mahsulotini eksport qila olishi kerak. Erkin almashtiriladigan valyuta Xalqaro valyuta fond tomonidan belgilanadi. AQSH dollar, Germaniya markasi, Fransiya franki, Angliya funt sterlingi va Yaponiya iyeni shunday valyutalardan hisoblanadi."
        ]
    },
    {
        "word": "Valyuta Arbitraji ",
        "type": [],
        "definition": [
            " foyda olish maqsadida valyutani sotib olish - sotish bo'yicha operatsiyalardir. Valyuta arbitraji - bu valyuta kurslari farqidan foyda olish maqsadida valyutani sotib olish va bir vaqtning o'zida sotishdir. "
        ]
    },
    {
        "word": "Valyuta Auksioni ",
        "type": [],
        "definition": [
            "erkin almashtiriladigan valutalarni milliy valyutaga sotish uchun tashkil etilgan kimoshdi savdolari. Unda chet el valyutasiga ega bo'Igan banklar qatnashadi. Valyuta bozori - milliy va xalqaro banklar, shuningdek, birjalar tomonidan chet el valyutasini, chek, veksel, o'tkazma veksel, akkreditiv va shu kabi qimmatbaho qog'ozlarni sotish, sotib olish va almashtirishdir. Jahon valyuta bozori mamlakatlarning banklari o'rtasidagi aloqalari natijasida vujudga kelgan bo'lib, tashqi savdo, sarmoya qo'yish, sayyohlik va boshqa munosabatlarga doir hisob-kitoblami amalga oshirishga xizmat qiladi. Davlatlarning milliy pullari valyuta bozorida qatnashishi uchun ular erkin almashtiriladigan valyuta, deb tan olingan bo'lishi kerak. "
        ]
    },
    {
        "word": "Valyuta Ayirboshlash ",
        "type": [],
        "definition": [
            "xorijiy valyutalarni xarid qilish va sotish operatsiyalari. "
        ]
    },
    {
        "word": "Valyuta Bilan Tartibga Solish ",
        "type": [],
        "definition": [
            " davlatning xalqaro hisob-kitoblari va valyuta boyliklari bilan bitimni bajarish tartibini qat’iy belgilashga qaratilgan faoliyat. Davlat valyuta bilan tartibga solish yordamida valyuta operatsiyalarini xorijiy yuridik va jismoniy shaxslarga kreditlar va qarzlar berish, valyutani olib kirish, olib chiqib ketish hamda chet elga o'tkazishni nazorat ostiga olish va shu tariqa milliy valyuta to'lov balansining muvozanati va barqarorligini saqlashga harakat qiladi. Ko'p mamlakatlarda valyutani chet elga olib chiqib ketishning limiti belgilangan, xorijiy yuridik shaxslarga kreditlar berishga ruxsatlarning maxsus tizimi joriy etilgan va hokazo. Valyuta bilan tartibga solish asosan normativ, ya’ni xalqaro valyuta bitimlarini tuzish va normativ hujjatlarni nashr ettirish orqali amalga oshiriladigan faoliyatdir. "
        ]
    },
    {
        "word": "Valyuta Birjasi ",
        "type": [],
        "definition": [
            "xorijiy valyuta oldi-sotdisini bozor narxlari bo'yicha muntazam va tartibli ravishdaboshqarish asosida amalga oshiradigan birja. "
        ]
    },
    {
        "word": "Valyuta Bozori ",
        "type": [],
        "definition": [
            " chet el valyutasi oldi-sotdisini va chet el valyutasidagi qimmatbaho qog'ozlarni hamda valyutaviy kapitalni investitsiya qilish munosabatlarini, shuningdek, iqtisodiy munosabatlarni amalga oshiruvchi markaz hisoblanadi. "
        ]
    },
    {
        "word": "Valyuta Bozori ",
        "type": [],
        "definition": [
            "valyutalar va oltin bilan savdo operatsiyalarini amalga oshiradigan markaz. Valyuta bozori banklar hisoblanadi. Har xil davlatlarning valyuta bozorlari o'zaro bir-biri bilan telekommunikatsiyalar yordamida bog'lanadi. "
        ]
    },
    {
        "word": "Valyuta Bozorlaridagi Operatsiyalar ",
        "type": [],
        "definition": [
            "tashqi savdo bo'yicha xalqaro hisob-kitoblar, xalqaro turizm, kapitallar va kreditlarningdavlatlararo harakati va chet el valyutasini oldi-sotdi qilish bilan bog'liq boshqa hisob-kitob operatsiyalari hisoblanadi. "
        ]
    },
    {
        "word": "Valyuta Chegaralari ",
        "type": [],
        "definition": [
            "bir mamlakatda valyuta operatsiyalari bo'yicha belgilangan cheklash tadbirlari; ma’muriy va qonuniy tartibda belgilangan xorij valyutasi va boshqa valyutaga tegishli qimmatli narsalar bo'yicha operatsiyalarni cheklash uchun yo'naltirilgan normativ qoidalar tizimi. "
        ]
    },
    {
        "word": "Valyuta Deklaratsiyasi ",
        "type": [],
        "definition": [
            " valyuta miqdori ko'rsatilgan hujjat; b о jxonaga chegaradan valyuta olib о' tkazilayo tgan da ко 'rsatilayotgan hujjat ariza. "
        ]
    },
    {
        "word": "Valyuta Dempingi ",
        "type": [],
        "definition": [
            " valyuta kursini tushirish natijasida uning xarid qilish qobiliyatining pasayishidan foydalangan holda tashqi bozordagi raqobatchilarni siqib chiqish maqsadi bilan bog'liq holda tovarlarni jahon o'rtacha narxlaridan past darajada keng ko'lamda eksport qilishdir. "
        ]
    },
    {
        "word": "Valyuta Fondi ",
        "type": [],
        "definition": [
            "eksportni rag'batlantirish maqsadida korxonalarda tashkil etiladi. Valyuta fondi o'zgarmaydigan normativlar asosida uzoq muddatga belgilanadi. Uning miqdori eksportga mo'ljallangan tovarlar va xizmatlarning hajmiga bog'liq. "
        ]
    },
    {
        "word": "Valyuta Intervensiyasi",
        "type": [],
        "definition": [
            "milliy yoki chet el valyutalari kursini oshirish yoki tushirishni ko'zlab valyuta bozoridagi muomalalarga yirik davlatlaming aralashuvidir. Uni Markaziy banklar amalga oshiradi. Har bir mamlakat uchun milliy valyuta kursini oshirish foydali bo'lsa, u o'zining banklari va hazinasidagi chet el valyutasini sotib, o'z milliy valyutasini esa sotib oladi. "
        ]
    },
    {
        "word": "Valyuta Intervensiyasi ",
        "type": [],
        "definition": [
            "davlatlaming valyuta bozoridagi muomalaga milliyyoki chet-el valyutasi kursini oshirish yoki tushirish maqsadida chet el valyutasining yirik summasini yoki oltinni sotib olish yo'li bilan aralashuvi. "
        ]
    },
    {
        "word": "Valyuta Kliringi ",
        "type": [],
        "definition": [
            "ikki yoki bir necha mamlakat o'rtasida tashqi savdo bo'yicha hisob-kitoblar va boshqa shakllardagi iqtisodiy munosabatlar usuli. Kliring qatnashchilari bo'lgan davlatlar o'rtasida tuziladigan xalqaro to'lovlar bitimlari asosida belgilanadi. Xalqaro to'lov bitimlarida quyidagilar nazarda tutiladi: l) Kliring hisob-kitoblari tizimi va ularni yuritishga vakolat bergan banklar; 2) Kliring hajmi, ya’ni yetkazib berilishi kliring bo'yicha to'lanadigan tovarlar yoki xizmatlar guruhlari; 3) Kliring valyutasi, ya’ni o'zaro talablarni hisobga olish o'tkaziladigan va qarzdorlik saldosi belgilanadigan valyuta; 4) Texnik kredit hajmi, qarzdor mamlakat Hiring saldosi bo'yicha shu chegarada boshqa mamlakatga foizlarni to'lamaydi; 5) To'lovlami baravarlashtirish va saldoni uzil-kesil qoplash tizimi. Saldoni qoplash usuli bo'yicha kliringlar quyidagicha bo'lishi mumkin: boshqa (konvertatsiyalanadigan) valyutaga erkin konversiyalanadigan; cheklangan miqdorda konversiyalanadigan; konversiyalash huquqiga ega bo'lmagan. Valyuta kliringi mamlakatlar yoki ulardan biri o'zaro hisob-kitoblarni ta’minlash uchun konvertatsiyalangan valyutaga ega bo'lmagan sharoitlarda qo'llaniladi. Ikki yoki ko'p tomonlama asosda rivojlanayotgan mamlakatlar tomonidan keng qo'llanadi. Hozirgi sharoitlarda o'tkaziladigan rubllarda ko'p tomonlama hisob-kitoblar tizimi tugatilishi va awal SSSR subyektlari bo'lgan bir qancha mustaqil davlatlar tashkil etilishi va ularda konvertatsiyalanadigan valyuta yo'qligi munosabati bilan bu mamlakatlarning o'zaro, awalgi sotsialistik lager mamlakatlari va jahonning boshqa mamlakatlari bilan hisob-kitoblari uchun valyuta kliringidan keng foydalanish zarurati vujudga keladi. "
        ]
    },
    {
        "word": "Valyuta Konvertirlashuvi ",
        "type": [],
        "definition": [
            " uning boshqa xorijiy valyutalarga almashish qobiliyati tushuniladi. "
        ]
    },
    {
        "word": "Valyuta Koridori ",
        "type": [],
        "definition": [
            "chet davlatlarda moliyaviy-iqtisodiy ahvolni, ularda krizisning oldini olishni, moliyaviy holiga tasir etadigan omillarni bartaraf etish maqsadida oldindan valyuta kursini belgilash tizimi. "
        ]
    },
    {
        "word": "Valyuta Kursi ",
        "type": [],
        "definition": [
            "bir mamlakat pul birligining boshqa mamlakatlar pul birliklarida yoki xalqaro valyuta birliklarida ifodalangan bahosi. Eng awalo, mamlakat iqtisodiyotining ahvoli bilan belgilanadi, shuningdek, turli mamlakatlardagi inflyatsiyaning nisbiy sur’atlari, mehnat unumdorligining o'sish sur atlari va uning mamlakatlar o'rtasidagi nisbati, YaMMning o'sish sur atlari (pulning tovar bilan to'ldirilish asoslariga), xalqaro savdodagi mamlakatning o'rni va roliga, kapitalning mamlakatdan chiqarilishiga bog'liq. Mamlakat to'lov balansining ahvoli, turli mamlakatlar pul bozorlaridagi foiz stavkalarining mamlakatlar o'rtasidagi farqlari, shu mamlakat valyutasining yevrobozorlarda va xalqaro hisob-kitoblarda foydalanish darajasi, mamlakat valyutasiga bo'lgan ishonch va boshqa omillar valyuta kursiga bevosita ta sir ko'rsatadi. "
        ]
    },
    {
        "word": "Valyuta Kursi ",
        "type": [],
        "definition": [
            " muayyan mamlakat pul birligining boshqa bir mamlakat pul birligida ifodalangan bahosidir. Valyuta kursining ikki turi mavjud: 1. Qat’iy qayd etilgan. 2. O'zgarib turadigan. Qat’iy qayd etilgan valyuta kursi - valyuta bozorlari va valyuta kursini aniqlash ishida davlatning aralashuviga asoslanadi. O'zgarib turadigan valyuta kursi esa, butunlay valyuta bozoridagi u yoki bu valyutaga bo'Igan erkin talab va taklifga asoslanadi."
        ]
    },
    {
        "word": "Valyuta Kurslari Farqlaridan Olingan Daromadlar ",
        "type": [],
        "definition": [
            "korxonaning valyuta schyotida saqlanayotgan chet el valyutasi va chet el valyutasidagi debitorlik qarzlar bo'yicha hisoblangan ijobiy kurs farqlari tushuniladi. "
        ]
    },
    {
        "word": "Valyuta Munosabatlari ",
        "type": [],
        "definition": [
            "valyutaning jahon oborotidagi harakati natijasida vujudga keladigan pul munosabatidir. "
        ]
    },
    {
        "word": "Valyuta Operatsiyalari ",
        "type": [],
        "definition": [
            " chet el banknoti va tangalari, chet el valyutasidagi to'lov hujjatlarini (cheklar, veksellar, akkreditiv, oltin bilan bo'ladigan oldi-sotdilar) xarid etish va sotish jarayoni. "
        ]
    },
    {
        "word": "Valyuta Opsioni ",
        "type": [],
        "definition": [
            "kontraktda belgilangan muqobil valyuta shartlarini tanlash huquqi. "
        ]
    },
    {
        "word": "Valyuta Pariteti ",
        "type": [],
        "definition": [
            "ikkita valyuta o'rtasida qonunga binoan belgilanib, valyuta kursining asosi hisoblanadigan nisbat. м"
        ]
    },
    {
        "word": "Valyuta Qamali ",
        "type": [],
        "definition": [
            "xalqaro tashkilotlar yoki ayrim mamlakatlar guruhi tomonidan ba’zi bir mamlakatlarga nisbatan valyuta tushumlarining kelish jarayonida to'sqinlik qilish tushuniladi. "
        ]
    },
    {
        "word": "Valyuta Qarzi ",
        "type": [],
        "definition": [
            " bir mamlakatning boshqa mamlakatlardan qarzga olgan valyuta manbalari, valyuta qarzi davlat yoki tijorat korxonasiniki bo'lishi mumkin. "
        ]
    },
    {
        "word": "Valyuta Rezervi ",
        "type": [],
        "definition": [
            " biror mamlakatning valyuta mablag'lari va oltin jamg'armalar. "
        ]
    },
    {
        "word": "Valyuta Rezervlari ",
        "type": [],
        "definition": [
            "xalqaro hisob-kitob va to'lovlar uchun foydalanish maqsadida Markaziy banklar va moliya muassasalarida to'plangan chet el valyutasi va oltin jamg'armalaridir. Chetga mol chiqarish va chetdan tovar olishni moliyalashga mo'ljallangan va korxonalar ixtiyorida bo'Igan chet el valyutasi va so'mning chet el valyutasi hisobidagi pul vositalari hamda fuqarolarning valyuta jamg'armalari mamlakatning valyuta fond-rezerviga kiradi."
        ]
    },
    {
        "word": "Valyuta Rezervlarini Diversifikatsiya Qilish ",
        "type": [],
        "definition": [
            "bir vaqtning o'zida 1 necha yetakchi erkin almashinadigan valyutalarda chet el valyuta rezervlarini tashkil qilish valyuta rezervlarini diversifikatsiya qilish deyiladi. "
        ]
    },
    {
        "word": "Valyuta Riski ",
        "type": [],
        "definition": [
            "valyuta kurslarining o'zgarishi natijasida yuzaga keladigan zarar ko'rish xavfi tushuniladi. "
        ]
    },
    {
        "word": "Valyuta Savati ",
        "type": [],
        "definition": [
            "chet el valyutalarini milliy valyutaga kotirovka qilishda ishlatiladigan valyutalar yig'indisi. "
        ]
    },
    {
        "word": "Valyuta Siyosati ",
        "type": [],
        "definition": [
            " valyuta munosabatlarida iqtisodiy, huquqiy va tashkiliy tadbirlar va shakllar yigindisi. Bu vositalar yordamida xalqaro moliya-kredit tashkilotlari, davlatning markaziy moliya va bank muassasalari valyuta munosabatlarini tartibga soladi. "
        ]
    },
    {
        "word": "Valyuta Tangligi ",
        "type": [],
        "definition": [
            " mamlakat pul-kredit tizimining izdan chiqishi. Valyuta tangligining ikkita shakli mavjud a) umumiy; b) xususiy. Umumiy valyuta tangligi - uzoq vaqt davom etlb, iqtisodiyotdagi umumiy tanglikning tarkibiy qismi hisoblanadi. Xususiy valyuta tangligi esa bir davlat doirasida vaqtinchalik omillar ta’sirida vujudga keladigan valyuta tangligidir. Bundan qutilish uchun samarali iqtisodiy islohotlar o'tkazish, pul muomalasini sog'lomlashtirish va raqobatbardosh mollar ishlab chiqarish orqali amalga oshiriladi. "
        ]
    },
    {
        "word": "Valyuta Tizimi ",
        "type": [],
        "definition": [
            " valyutalar ularni o'zaro ayriboshlash va qo'llash qoidalari va normalar, tolov vositasi sifatida qo'llanilishi bilan bog'liq pul kredit munosabatlarining yig'indisi. "
        ]
    },
    {
        "word": "Valyuta Tizimi ",
        "type": [],
        "definition": [
            "valyutaning amal qillshiga xizmat qiladigan iqtisodiy, huquqiy munosabatlarning yig'indisi. "
        ]
    },
    {
        "word": "Valyuta Tushumi ",
        "type": [],
        "definition": [
            " yil davomida tashqi iqtisidiy faoliyat Milliy Bank schyotlariga kelib tushadigan pul mablag'lari. Bir valyuta kursini boshqa valyutalar guruhiga nisbatan o'lchash metodi. "
        ]
    },
    {
        "word": "Valyutalashtirish ",
        "type": [],
        "definition": [
            "qarzga olingan (debitorlik) yoki qarzga berilgan (kreditorlik) pul miqdori uchun foizlarning hisoblanish vaqtini belgilash. Masalan, bir yil muddat ichida olingan qarzni ma’lum foiz to'lab qaytarish kerak bo'lsa-yu, lekin uni bir yil ichida qaytara olmasa, foiz ustiga yana ustama foiz qo'yiladi."
        ]
    },
    {
        "word": "Valyutaning Kurs Rejimi ",
        "type": [],
        "definition": [
            "birinchidan, agar milliy valyutaning kursi erkin tarzda valyuta bozorida talab va taklif asosida aniqlansa, bu erkin suzib yuruvchi kurs rejimi deb ataladi."
        ]
    },
    {
        "word": "Valyutaviy Cheklanmalar ",
        "type": [],
        "definition": [
            "valyuta, oltin va boshqa valyutaviy boyliklar bilan operatsiyalarning cheklanishiga yo'naltirilgan,qonuniy yoki ma’muriy tartibda o'matilgan tadbirlar va me’yoriy qoidalar majmuyi. Joriy to'lov balansi operatsiyalari bo'yicha ular erkin konvertatsiya qilinadigan valyutalarga (AQSH dollari, Yevropa Ittifoqi yevrosi, ingliz font sterlingi, Shveytsariya franki va boshqalarga) nisbatan qo'llanilmaydi. "
        ]
    },
    {
        "word": "Valyutaviy Inqiroz ",
        "type": [],
        "definition": [
            " xalqaro valyuta munosabatlarida yuzaga keladigan keskin ziddiyatlarga aytiladi. "
        ]
    },
    {
        "word": "Valvatsiya ",
        "type": [],
        "definition": [
            " chet el tangasi qiymatini davlat pul birligida baholash. "
        ]
    },
    {
        "word": "Vaqt Boʻyicha Ustun Koʻrish ",
        "type": [],
        "definition": [
            " joriy iste’molga sarflash bilan kelajakda iste’mol qilish uchun sarflashdan qaysi birini befarqlik chizig'i asosida tanlash. "
        ]
    },
    {
        "word": "Vaqt Boʻyicha Ustun Koʻrishni Cheklash Normasi ",
        "type": [],
        "definition": [
            "umumiy turmush darajasi o'zgarmaganda joriy iste’moldan bir birlik kechishni to'liq qoplaydigan kelajakdagi qo'shimcha iste’mol qiymati. "
        ]
    },
    {
        "word": "Vaqt Lagi ",
        "type": [],
        "definition": [
            "bir iqtisodiy holatning u bilan bog'liq bo'lgan boshqa xodisadan vaqt jihatidan orqada qolishi yoki ildamlab ketishini aks ettiruvchi iqtisodiy ko'rsatkich. "
        ]
    },
    {
        "word": "Vaqtbay Haq, Toʻlash ",
        "type": [],
        "definition": [
            " xodimlarning sarflangan ish vaqti, ya’ni soat, smena, kun uchun to'lanadigan ish haqi tizimi. "
        ]
    },
    {
        "word": "Vaqtbay Ish Haqi ",
        "type": [],
        "definition": [
            "xodimga uning malakasi, mehnatining sifati, ishlagan vaqtiga qarab belgilanadigan ish haqi. U odatda mehnatning natijalarini aniq hisoblab bo'lmaydigan, balki ular aniq vazifalar doirasini bajarish bilan belgilanadigan vaqtda (masalan, muhandis- texnik xodimlar va xizmatchilar, sozlovchilar, elektr ta’mirlovchilar va shu kabilarga haq to'lashda) yoki mahsulot ishlab chiqarish texnologik jarayonining borishi bilan belgilanadigan va bevosita ishchiga bog'liq bo'lmagan (masalan, konteynerlar va avtomat liniyalarda ishlash) sharoitida qo'llaniladi. "
        ]
    },
    {
        "word": "Vaqtbay Mukofot Tizimi ",
        "type": [],
        "definition": [
            "xodimlarning ish bajargan vaqtlari (soat, smena, kun, oy va h.k.) uchun to'lovdan tashqari ma’lum ko'rsatkichlar uchun mukofot beriladi. "
        ]
    },
    {
        "word": "Vaqtin Chalik Usul ",
        "type": [],
        "definition": [
            "to'lov balansi defitsitini chet el kapitalini, ya’ni tadbirkorlik va ssuda kapitallarini kiritish yo'li blan qoplashga aytiladi. "
        ]
    },
    {
        "word": "Vaqtinchalik Valyuta ",
        "type": [],
        "definition": [
            "vaqtincha amal qiluvchi pul birligi, pul belgidari, krediti vositalari. Misol uchun O'zbekiston Respublikasida so'm kiritilganga qadar ishlatilgan so'm-kupon. "
        ]
    },
    {
        "word": "Vaqtlararo Budjet Chegarasi ",
        "type": [],
        "definition": [
            " shaxsning daromadi va ssuda foizi stavkasi bilan aniqlanadigan vaqtlararo ustun ko'rish kartasidagi chiziqning holati. "
        ]
    },
    {
        "word": "Vaqtlararo Muvozanatlik ",
        "type": [],
        "definition": [
            "joriy va kelajakda iste’mol qilish o'rtasida tanlayotgan shaxs uchun maksimal naflik keltiruvchi holat. "
        ]
    },
    {
        "word": "Vaqt-Xarajatlar Turli Modellar ",
        "type": [],
        "definition": [
            "bular minimal xarajatlargrafiklariniyaratishuchun ishlatiladi, bun dan tashqari ishlar bajariUshiga ajratiladigan vaqt va loyiha muddati kamayganidagi xarajatlar oshishi orasida murosa topish uchun ham foydalaniladi. Bular ko'p hollarda Ioyihani qisqartirish modellari deb yuritiladi. "
        ]
    },
    {
        "word": "Variatsiya",
        "type": [],
        "definition": [
            "qator hadlarining tebranuvchanligi, variantda qiymatlarining o'zgaruvchanligidir. "
        ]
    },
    {
        "word": "Variatsiya Kengligi ",
        "type": [],
        "definition": [
            "taqsimot qatorining eng katta va eng kichik variantalari orasidagi farqdir. "
        ]
    },
    {
        "word": "Varrant ",
        "type": [],
        "definition": [
            "1. Opsionning bir turi bo'lib, egasiga belgilangan muddat ichida emitentdan imtiyozli sharoitda ma’lum bir miqdordagi aksiyalarni sotib olish imkonini beradi. 2. Qimmatbaho qog'ozni xarid qilish uchun xaridorga beriladigan kafolat. 3. Tovar omborlari tomonidan tovarni saqlab turish uchun qabul qilinganligi to'g'risida belgilangan guvohnoma. "
        ]
    },
    {
        "word": "Vaucher",
        "type": [],
        "definition": [
            "1) Korxonalarning mulklarini xarid qilish uchun beriladigan kupon, qimmatli qog'oz; 2) davlat tomonidan ota-onalarga bolalarini o'qitish uchun beriladigan pul sertifikati. "
        ]
    },
    {
        "word": "Vazifa",
        "type": [],
        "definition": [
            "amalga oshirilishi, xal qilinishi lozim bo'lgan masala, echilishi lozim bo'lgan, ko'zda tutilgan maqsad, yoki biror-bir topshiriq, xizmat, yumush, xizmat lavozimi, mansab, amal. "
        ]
    },
    {
        "word": "Vazirlar Kengashi ",
        "type": [],
        "definition": [
            "qarorlar qabul qilish organidir. Uning doirasida milliy xukumatlarning a’zolari muzokoralar o'tkazdilar, hamjamiyat qonunchilik hujjatlarini muhokama qiladilar va ularni ovozga qo'yish yo'li bilan qabul qiladilar yoki rad etadilar. "
        ]
    },
    {
        "word": "Vazirlik",
        "type": [],
        "definition": [
            "o'ziga tegishli tarmoqning xo'jalik tizimida boshqarishinng eng oliy bo'g'inidir."
        ]
    },
    {
        "word": "Vaziyat ",
        "type": [],
        "definition": [
            "belgilab qo'yilgan strategik maqsad yoki umume’tirof etilgan faoliyat me’yorlariga nisbatan tashkilot, boshqariladigan obyektning holatini baholash mumkin bo'lgan real holat. "
        ]
    },
    {
        "word": "Vaziyatli Tahlil ",
        "type": [],
        "definition": [
            " muvaffaqiyatlar va muvafFaqiyatsizliklarni hisobga olgan holdagi oldingi faoliyatini o'rganish: ishlab chiqarish va bozordagi vaziyat o'zgarish sabablarini aniqlash; xodimlar ishi samaradorligini baholash, ish ko'rsatkichlariga tashqi muhit ta’sirini hisobga olish; hozirgi kundagi vaziyat ta’sirini aniqlash va kelajak prognozi (bashorati). "
        ]
    },
    {
        "word": "Veksel",
        "type": [],
        "definition": [
            " (nem. “wechseF, aynan. ayirboshlash) - muayyan miqdordagi pulni qarzga olganligi va uni qancha muddatda qaytarib berishligi haqida shu davlatda amal qiluvchi qonun talablariga qat’iy rioya qilgan holda aniq shaklida maxsus yozib berilgan va rasmiylashtirilgan qarzdorlik hujjatidir. Veksel oluvchi hujjat da ko'rsatilgan qarzdorlik muddati tugashi bilanoq veksel beruvchi ham unda ko'rsatilgan miqdordagi mablag‘ni to'lashni talab qilish huquqiga ega bo'ladi. Vekselning oddiy va o'tkazma shakllari mavjud. Oddiy veksel - qarzdor tomonidan to'ldirilgan shaxsiy majburiyat; o'tkazma veksel - qarz beruvchining qarzni kimga qaytarish haqidagi buyrug'idir. "
        ]
    },
    {
        "word": "Veksel Kursi ",
        "type": [],
        "definition": [
            " milliy valyuta kursida belgilangan chet el valyutasining bahosi."
        ]
    },
    {
        "word": "Veksel Rekviziti ",
        "type": [],
        "definition": [
            "veksel blankini to'latishda ishlatilgan ma’lumotlar majmuyi. "
        ]
    },
    {
        "word": "Vekselli Kredit ",
        "type": [],
        "definition": [
            "eksportyor tovarni sotish haqida bitim tuzib, o'tkazma veksel (tratta)ni importyorga jo'natadi, importyor tijorat hujjatlarini olib akseptlaydi, ya’ni unda ko'rsatilgan muddatda to'lovni amalga oshirishga rozilik beradi. "
        ]
    },
    {
        "word": "Venchur Firma ",
        "type": [],
        "definition": [
            "tijorat bilan shug'ullanuvchi ilmiy-texnik firma, yangi texnologiyalar va mahsulotlarni daromadlarni awaldan belgilamagan holda ishlab chiqish va qo'llash bilan shug'ullanadi (tavakkalchilikka asoslangan kapital qo'yilmasi). "
        ]
    },
    {
        "word": "Venchur Korxonalar ",
        "type": [],
        "definition": [
            "kichik biznesning bir turi, ilmiy muhandislik ishlari, yangi texnika namunalarini yaratish, ishlab chiqarishni, tijorat ishlarini boshqarish, tijorat ishlarini tashkil etish usullarini ishlab chiqish va amaliyotga joriy etish, yirik firmalar va davlat ijara kontrakti buyurtmalarini bajarish. Ular tarkibida tijoratda vositachi bo'Igan korxonalar ham bo'ladi. Venchur korxonalar texnikaning yangi yo'nalishlarida ish ko'rib, fan-texnika taraqqiyotiga hissa qo'shadi. "
        ]
    },
    {
        "word": "Venchur Tarkibi ",
        "type": [],
        "definition": [
            "loyiha tarkibining zamonaviy o'zgartirilgan turi bo'lib, ‘‘tavakkalchilikbiznesi”bilanbog'liqdir. Belgilangan qoidagabinoan biznesdagi tavakkalli yangiliklar, ya’ni butkul yangi texnologiyalar, tovarlar, xizmatlarni yaratish bilan bog'liq."
        ]
    },
    {
        "word": "Venchurlisarmoyalar",
        "type": [],
        "definition": [
            "sarmoyalarni xatarli kiritish. "
        ]
    },
    {
        "word": "Verbal",
        "type": [],
        "definition": [
            "og'zaki bitim, kelishuv. "
        ]
    },
    {
        "word": "Verifikatsiya",
        "type": [],
        "definition": [
            " hujjatning haqiqiyligini belgilash jarayoni. "
        ]
    },
    {
        "word": "Verner Zombart ",
        "type": [],
        "definition": [
            " (1863-1941) yangi tarixiy maktabga yaqin turgan nemis iqtisodchisi, antagonistik ziddiyatlar va iqtisodiy inqirozlarning muqarrarligini inkor etgan, kapitalizm tartibga solingan va rejali rivojlanib boradigan xo'jalik tarzi deb tasvirlanadi. Turli tizimlarni plyuralizm asosida yaqinlashtirish mumkin, deydi. Verner Zombart shovinizm pozitsiyalarida turgan va fashizm mafkurasining shakllanishiga ko'maklashgan. "
        ]
    },
    {
        "word": "Vertikal Integratsiya",
        "type": [],
        "definition": [
            "bir texnologik zanjiming turli bosqichlariga (xomashyoni qazib olish, qayta ishlash, tayyor mahsulot ishlab chiqarish) - xizmat qiladigan korxonalar birlashmasi. Ushbu turdagi monopoliya-kombinatlar metallurgiya, kimyo, avtomobil, oziq-ovqat tarmoqlarida keng tarqalgan. Vertikal integratsiya konsernlarning vujudga kelishiga sabab bo' lgan. Vertikal integratsiya yanada umumiy bo'lgan diversifikatsiya jarayonining bir qismi hisoblanadi. "
        ]
    },
    {
        "word": "Vertikal Marketing Tizimi ",
        "type": [],
        "definition": [
            "bir kanal ishtirokchilari ularning biri rahbarligi yoki nazorati ostida birlashishi natijasida hosil bo'lgan tovar tarqatish tizimi. "
        ]
    },
    {
        "word": "Vertikal Tahlil ",
        "type": [],
        "definition": [
            " har bir ko'rsatkichlarning tarkibiy qismlarini va chetga chiqishning umumiy hajmidagi o'zgarishini o'rganish. "
        ]
    },
    {
        "word": "Vertual",
        "type": [],
        "definition": [
            " ma’lum bir sharoitda tahlil qilinayotgan holat, jarayon. "
        ]
    },
    {
        "word": "Veto ",
        "type": [],
        "definition": [
            "oliy ijro etuvchi organlarning (masalan, prezident) parlament tomonidan qabul qilgan qonunni tasdiqlamasligi. Absolyut vetoda qonun butunlay bekor qilinadi. Suspenziv veto qonunni tasdiqlashni kechiktiradi yoki qayta ко‘rib chiqishni talab qiladi. "
        ]
    },
    {
        "word": "Via",
        "type": [],
        "definition": [
            " (ingl. - orqali) shu belgi bilan VIA yuborilayotgan tovarning yo'nalishi ko'rsatiladi. Masalan, “Toshkent VIA” belgili tovar to'xtovsiz dunyoning har bir chekkasidan kelishi kerak. "
        ]
    },
    {
        "word": "Viloyat Budjeti ",
        "type": [],
        "definition": [
            "umumviloyat budjetini hamda viloyatga bo'ysunuvchi tumanlar va shaharlar budjetini; "
        ]
    },
    {
        "word": "Vindikatsiya",
        "type": [],
        "definition": [
            "da’vogarlik bayonnomasini berish orqali o'zgalar qonunsiz egalik qilib turgan buyumni talab qilish. "
        ]
    },
    {
        "word": "Viriment",
        "type": [],
        "definition": [
            "bir kishining joriy hisobidan ikkinchi kishining joriy hisobiga pul mablag'ining bank tomonidan o'tkazilishi. "
        ]
    },
    {
        "word": "Virtual Kutubxona ",
        "type": [],
        "definition": [
            "bitta yoki bir nechta kompyuter tizimlarida mavjud bо‘lgan resurslar tо‘plami, unda bitta interfeys yoki tо‘plamga kirish nuqtasi taqdim etiladi. Virtual zal – onlayn ta’lim muhiti bо‘lib, unda о‘qituvchi va talabalarning muloqot qilishlari, о‘zaro munosabatda bо‘lishlari, hamkorlik qilishlari, fikr almashishlari va guruhlarda ishlashlari jarayonida о‘quv manbalaridan foydalanishlari mumkin.  "
        ]
    },
    {
        "word": "Virtual Laboratoriya",
        "type": [],
        "definition": [
            "simulyatsiya tajribalarini yaratish  va о‘tkazish uchun interfaol muhit: tajribalar uchun platforma. Bu laboratoriya modellashtirish dasturlaridan, ma’lumot fayllarini qamrab oluvchi obyektlar deb nomlanuvchi tajriba bloklaridan va ushbu obyektlar bilan ishlaydigan vositalardan iborat.  "
        ]
    },
    {
        "word": "Virtual Reallik Voqelik ",
        "type": [],
        "definition": [
            "foydalanuvchilarga obyektlarni boshqarish va atrof- muhit bilan о‘zaro munosabatda bо‘lishi mumkin bо‘lgan dunyoni raqamli modellashtirishga kirishishni talab qiladigan sun’iy muhit.  "
        ]
    },
    {
        "word": "Virtual Universitet ",
        "type": [],
        "definition": [
            "virtual ta’lim muhitidagi universitetning modeli, ya’ni ta’lim xizmatlarining barcha turini taqdim etadigan multiservisli krossplatforma. Geymifikatsiya – ta’lim jarayonida motivatsiya berish va ishtirok etish darajasini oshirish uchun ta’lim muhitida о‘yin prinsiplari va mexanizmlarini joriy etish. "
        ]
    },
    {
        "word": "Virtual Zavod ",
        "type": [],
        "definition": [
            " boshqa hududlarda joylashgan va strategik alyans tarkibiga kiruvchi yetkazib beruvchilar va hamkor firmalar tomonidan amalga oshiriladigan, ishlab chiqarish faoliyatining tashkillashtirish shakli. "
        ]
    },
    {
        "word": "Vositachilik",
        "type": [],
        "definition": [
            "vositachilik, dallolchilik vositasi, maxsulot yaratish va uni iste’mol uchun yetkazib berish operatsiyasi. Masalan: vositachilik instituti, vositachilik firmasi va hokazo. "
        ]
    },
    {
        "word": "Vositalashgan Kafolatlar",
        "type": [],
        "definition": [
            "kafolat beruvchi o'ziga xos tarzda vositachilik vazifasini o'taydi. Bunday kafolatlar eksport-import operatsiyaiarida keng ishlatiladi."
        ]
    }
]