[
    {
        "word": "Xarid Qobiliyati Pariteti",
        "type": [],
        "definition": [
            "valyutalar almashinuv kurslarining shunday darajasiki, bunda har bir valyutaning xarid qobiliyati tenglashadi"
        ]
    },
    {
        "word": "Xalq, Isteʼmol Tovarlari ",
        "type": [],
        "definition": [
            "aholining shaxsiy ehtiyojini qondiradigan tovarlar. "
        ]
    },
    {
        "word": "Xalq. Kapitalizmi Nazariyasi ",
        "type": [],
        "definition": [
            "kapitalizm transformatsiyasi (o'zgarishi) bilan bog'liq, go'yoki hozirgi kapitalizm “eski kapitalizm”dan keskin farq qiladi; ilgarigi illatlar yo'qolgan. Xalq kapitalizmining vakillari: Berli, Nidler, Cheyz, Klark, Gelbreyt. “Kapitalning demokratizatsiyalashuvi” yo'li bilan aholining barcha qismi mulkka egalik qiladi (aksionerlik jamiyatlari). "
        ]
    },
    {
        "word": "Xalq, Xoʻjaligi ",
        "type": [],
        "definition": [
            " mamlakatning umumiy iqtisodiyotini bildiradi. Bu tushuncha sobiq sovet tuzumi davrida keng foydalanilgan. Bozor iqtisodiyoti sharoitida ishlab chiqarish tarmoqlari turli mulkchilik shakliga asoslangan bo'lishiga qaramay mamlakat miqyosida umumlashgan xalq xo'jaligi iqtisodiyotini bildiradi. "
        ]
    },
    {
        "word": "Xalq, Xoʻjaligi Balansi ",
        "type": [],
        "definition": [
            "sobiq SSSR va sotsialistik mamlakatlarda qo llanilgan tizim bo'lib, unda makroiqtisodiy ko'rsatkichlar tizimi o'z aksini topgan. XXB markscha kengaytirilgan takror ishlab chiqarish ta’limotiga asoslangan. "
        ]
    },
    {
        "word": "Xalq, Xoʻjalik Hisobi ",
        "type": [],
        "definition": [
            "iqtisodiyotni erkinlashtirish sharoitidagi xo'jalikhisobihisobningyagonatizimibo'lib,undaxo'jalikhisobining barcha turlari (tezkor, statistika, buxgalteriya) qo'shilgan. Lekin bu mexanik qo'shilgan degan ma’noni bildirmaydi. Tezkor, statistika va buxgalteriya hisoblarining birortasi ustunligi to'g'risida gap bo'lishi mumkin emas, chunki bularning har biri kengaytirilgan takror ishlab chiqarishning ma’lum tomonlarini aks ettirib, iqtisodiyotni boshqarish jarayoni to'g'risidagi ko'rsatkichlami beradi. "
        ]
    },
    {
        "word": "Xalqaro Bazel Qoʻmitasi ",
        "type": [],
        "definition": [
            " rivojlangan mamlakatlar markaziy banklari rahbarlari tomonidan 1974-yilda tashkil etilgan tashkilot. Uning doirasida xalqaro bank faoliyatini tartibga solish muammolari muhokama qilinadi. 1975-yilda qo'mita tomonidan Bazel kelishuvi ishlab chiqilgan. Keyinchalik Bazel qo'mitasi bank faoliyati me’yorlari bo'yicha xalqaro tavsiyalar ishlab chiqa boshladi. "
        ]
    },
    {
        "word": "Xalqaro Hisob-Kitoblar ",
        "type": [],
        "definition": [
            "tashqi savdo, kapitallar va kreditlarning harakati bilan bog'liq valyutaviy operatsiyalar, valyutada oldi-sotdi qilish operatsiyalari va boshqa tovarsiz harakatdagi operatsiyalar majmuyi tushuniladi."
        ]
    },
    {
        "word": "Xalqaro Iqtisodiy Aloqalar (Xia) ",
        "type": [],
        "definition": [
            " xalqaro mehnat taqsimotiga asoslangan turli milliy iqtisodiyotlar o'rtasidagi xo'jalik aloqalari tizimi. XIA xalqaro savdo, ilmiy-texnik, ishlab chiqarish, valyuta- moliya va kredit aloqalarida o'z aksini topadi. "
        ]
    },
    {
        "word": "Xalqaro Iqtisodiy Munosabatlar ",
        "type": [],
        "definition": [
            " mamlakatlar va hududlar o'rtasidagi, xalqaro tashkilotlar va korporatsiyalar ishtirokidagi xo'jalik aloqalari tizimi. "
        ]
    },
    {
        "word": "Xalqaro Iqtisodiy Tashkilotlar ",
        "type": [],
        "definition": [
            "ikki turdagi - ishtirokchilari bevosita davlatlardan iborat hukumadararo (davlatlararo) hamda tarkibiga ishlab chiqaruvchilar birlashmalari, kompaniya va firmalar, ilmiy jamiyatlar va boshqalar kiruvchi nohukumat tashkilotlari. "
        ]
    },
    {
        "word": "Xalqaro Ishlab Chiqarish Kooperasiyasi ",
        "type": [],
        "definition": [
            "ishlab chiqarish bosqichlariningo'zarobir-birinito'ldirishivaularnimuvofiqlashtirish maqsadida milliy iqtisodiy komplekslarning hamkorlik qilishi. "
        ]
    },
    {
        "word": "Xalqaro Ishlab Chiqarishning Ixtisoslashuvi ",
        "type": [],
        "definition": [
            "mamlakatlar o'rtasidagi mehnat taqsimoti ko'rinishi bo'lib, unda o'zlarining ichki ehtiyojlaridan ortiqcha bir turdagi mahsulotlar tayyorlash bilan shug'ullanuvchi milliy ishlab chiqarishlarning tabaqalanishi yuz beradi. "
        ]
    },
    {
        "word": "Xalqaro Kafolatlar ",
        "type": [],
        "definition": [
            "tovarlar va kapitallar harakatining uzluksiz va doimiy harakat qilinishi ta’minlanishiga xizmat qilib, Markaziy banklar, tijorat banklari, korporatsiyalar, hukumat va xalqaro tashkilotlar tomonidan beriladi. "
        ]
    },
    {
        "word": "Xalqaro Kredit ",
        "type": [],
        "definition": [
            "bir davlat, shu davlat banki, huquqiy shaxsi tomonidan ikkinchi bir davlatga, uning banklariga, boshqa huquqiy shaxslariga muddatlilik va to'lovlilik asosida beriladigan kreditdir. "
        ]
    },
    {
        "word": "Xalqaro Kredit Munosabatlarining Subyekt Lari ",
        "type": [],
        "definition": [
            "tijorat banklari, markaziy banklar, davlat organlari, yirik korxonalar, regional va xalqaro moliya-kredit tashkilotlari qatnashadi. "
        ]
    },
    {
        "word": "Xalqaro Marketing ",
        "type": [],
        "definition": [
            "tashkilot joylashgan mamlakat hududidan tashqaridagi tovarlar va xizmatlar marketingi. "
        ]
    },
    {
        "word": "Xalqaro Mehnat Taqsimoti (Xmt) ",
        "type": [],
        "definition": [
            "mehnat taqsimoti, alohida mamlakatlar doirasidan chlqishi bilan bog'liq, ijtimoiy mehnat taqsimotining yuqori pog'onasi. XMT alohida mamlakatlarning ma’lum turdagi mahsulotlarni ishlab chiqarishga ixtisoslashuvini bildiradi, bu esa xalqaro savdoning zarurligini belgilaydi. Butun jahon xo'jaligining tashkil topish va rivojlanishining hal qiluvchi omili. Birinchi bo'lib uning zarurligini D. Rikardo aytgan. Ayrim ishlab chiqarish korxonalaridagi kabi (A. Smit), jahon xo'jaligida ham mehnat taqsimoti nisbiy chiqimlar ustunligini beradi, ya’ni ayrim mamlakatlarning ma’lum sohada ixtisoslashuvi yuqori samara beradi. "
        ]
    },
    {
        "word": "Xalqaro Mehnat Tashkiloti ",
        "type": [],
        "definition": [
            " BMTning ixtisoslashgan muassasasi, uning faoliyati mehnatning ijtimoiy-iqtisodny muammolarini hal etishga qaratilgan. "
        ]
    },
    {
        "word": "Xalqaro Moliya Korporatsiyasi ",
        "type": [],
        "definition": [
            "rivojlanayotgan mamlakatlarga sarmoyasarflabvaboshqaruvmasalalariyuzasidanmaslahatlarberish yo'li bilan ularda tadbirkorlikni rivojlantirishga ko'maklashuvchi tashkilot. "
        ]
    },
    {
        "word": "Xalqaro Moliya Tashkilotlari ",
        "type": [],
        "definition": [
            "davlatlar o'rtasidagi valyuta va moliya-kredit munosabatlarini tartibga solish, mamlakatlarning iqtisodiy rivojlanishiga ko'maklashish, kredit ko'rinishida yordam berish maqsadida davlatlararo kelishuvlar asosida tashkil etilgan tashkilotlar. Bunday tashkilotlar qatoriga Xalqaro hisoblashuvlar banki, Xalqaro valyuta fondi, Xalqaro tiklanish va taraqqiyot banki, Xalqaro rivojlanish assotsiatsiyasi, Xalqaro moliyaviy korporatsiya, Osiyo Taraqqiyot Banki, Yevropa Investitsiya Banki, Mintaqaviy Xalqaro Rivojlanish banklari va boshqalarni kiritish mumkin. "
        ]
    },
    {
        "word": "Xalqaro Moliyavty Bozor ",
        "type": [],
        "definition": [
            " global fond, valyuta va hosilaviy moliyaviy instrumentlar bozori sifatida keltiriligan. "
        ]
    },
    {
        "word": "Xalqaro Qayta Tiklash Va Rivojlantirish Banki ",
        "type": [],
        "definition": [
            "unga a’zo bo'lgan mamlakatlarga, ularni iqtisodiy rivojlanishini rag'batlantirish maqsadida uzoq muddatli zayomlar beradi. 1995-yilda tashkil etilgan. Bank mablag'lari, uning ustav kapitalidan (a’zolari qo'shgan puldan), o'z obligatsiya (zayom)larini xalqaro bozorda sotishdan kelgan puldan va bankning ishlab topgan daromadidan iborat XQTRB. Unga a’zo bo'lgan mamlakatlarga iqtisodiy rivojlantirishni rag'batlantirish maqsadida uzoq muddatli zayomlar beradi. "
        ]
    },
    {
        "word": "Xalqaro Savdo ",
        "type": [],
        "definition": [
            " mamlakatlar o'rtasidagi savdo-sotiq tovarlarni chetdan olib kelish (import) va chetga chiqarish (eksport), jahon iqtisodiy munosabatlarining shakli. Xalqaro savdoning iqtisodiy asosini xalqaro mehnat taqsimoti tashkil etadi. "
        ]
    },
    {
        "word": "Xalqaro Savdo Nazariyasi ",
        "type": [],
        "definition": [
            " iqtisodiy nazariyaning bir qismi. Ishlab chiqarish tovar ayirboshlashga xalqaro ixtisoslashuv sabablarini hamda bundan mamlakatlar oladigan manfaatlarni o'rganadi."
        ]
    },
    {
        "word": "Xalqaro Tartibdagi Hududlar ",
        "type": [],
        "definition": [
            "davlat chegaralaridan tashqarida bo'lgan va xalqaro huquqqa binoan dunyoning barcha davlatlari umumiy foydalanadigan yer sharidagi bo'sh makonlar."
        ]
    },
    {
        "word": "Xalqaro Tashkilotlar ",
        "type": [],
        "definition": [
            "mustaqil davlatlar yoki milliy jamiyatlarning, siyosiy, iqtisodiy, ijtimoiy maqsadlarga erishish uchun tuzilgan birlashmalar, mamlakatlar o'rtasida ko'p tomonlama hamkorlikning eng muhim turlaridan biri. Ularning har biri xalqaro siyosatda o'zlarining faoliyat maqsadlari yo'nalishlariga qarab, yer yuzi taraqqiyotida egallab turgan mavqelariga qarab, umuman xalqaro siyosiy-amaliy munosabatlar jarayonida harakatlarga kirishadigan boshqa xalqaro tashkilotlar tizimidagi maqomlariga qarab ahamiyat kasb etadilar. "
        ]
    },
    {
        "word": "Xalqaro Tenderlar ",
        "type": [],
        "definition": [
            "xalqaro bozorda mashina-uskunalami xarid etish, qurilish-montaj ishlarini bajarish, injenering xizmati ko'rsatish uchun konkurs asosida buyurtmalar berish. "
        ]
    },
    {
        "word": "Xalqaro Tranzit ",
        "type": [],
        "definition": [
            " xorijiy yuklarni jo'natish va qabul qilib olish punktlari berilgan mamlakat hududidan tashqarida bo'lishi shartida tashilishidir. Agar tovarlar bojxona omboriga joylashtirilmasdan tashilsa - bevosita, xalqaro tranzit, bojxona omboridan foydalanilsa - bilvosita xalqaro tranzit hisoblanadi. "
        ]
    },
    {
        "word": "Xalqaro Valyuta Fondi (Xvf) ",
        "type": [],
        "definition": [
            "xalqaro valyuta-kredit tashkiloti 1944-yili tashkil etilgan. Uni tuzishdan maqsad xalqaro savdoni rivojlantirish, valyuta kursini, me’yorlarini, nisbatlarini belgilash, ko'p tomonli to'lovlar tizimiga rioya qilinishini nazorat qilish hamda fond a’zolariga valyuta yetishmovchiligi holatlarida kredit, qarz berishdir. Unga 1998-yilda 167 ta mamlakat a’zo bo'lgan. Valyuta fondining ikki asosiy vazifasi bor: o'z a’zolari bo'lmish mamlakatlarning valyuta aloqalarini (valyuta ayirboshlash, valyuta bilan to'lovlami amalga oshirish va h.k.) boshqarib turish, umumiy kredit mablag'laridan a’zo mamlakatlarga qarz berib, ularning taraqqiyotiga ko'maklashish. Valyuta fondining kapitali unga a’zo mamlakatlarning badal pulidan tashkil topadi. Uning o'sishi yangi a’zolaming badal puli va kredit uchun olingan foizlar hisobiga yuz beradi."
        ]
    },
    {
        "word": "Xalqaro Valyuta Tizimi ",
        "type": [],
        "definition": [
            "xalqaro valyuta munosabatlarida davlatlararo bitimlarda huquqiy jihatdan mustahkamlangan va xalqaro hisob- kitoblarni amalga oshirishda qo'llaniladigan qoida va tartiblar. "
        ]
    },
    {
        "word": "Xalqaro Tranzit",
        "type": [],
        "definition": [
            "xorijiy yuklarni jo'natish va qabul qilib olish punktlari berilgan mamlakat hududidan tashqarida bo'lishi shartida tashilishidir. Agar tovarlar bojxona omboriga joylashtirilmasdan tashilsa - bevosita xalqaro tranzit, bojxona omboridan foydalanilsa - bilvosita xalqaro tranzit hisoblanadi."
        ]
    },
    {
        "word": "Xarajat Elementlari ",
        "type": [],
        "definition": [
            "iqtisodiy mazmuniga ko'ra, mahsulot ishlab chiqarish tannarxini tashkil qiladigan xarajat turlari. Xarajat elementlari quyidagilardan iborat: a) ishlab chiqarish material xarajatlari (qaytariladigan chiqindilar qiymati chiqarib tashlangan holda); b) ishlab chiqarish xarakteridagi mehnatga haq to'lash xarajatlari; d) ishlab chiqarishga taalluqli ijtimoiy sug'urta ajratmalari; e) ishlab chiqarish ahamiyatidagi asosiy fondlar va nomoddiy aktivlar amortizatsiyasi; ishlab chiqarish ahamiyatidagi boshqa xarajatlar."
        ]
    },
    {
        "word": "Xarajat Moddalarining Guruhlanishi ",
        "type": [],
        "definition": [
            "xarajat moddalari quyidagicha guruhlanadi: 1. Mahsulot ishlab chiqarish tannarxi: a) to'g'ri va egri material xarajatlari; b) to'g'ri va egri mehnat xarajatlari; d) ishlab chiqarish ahamiyatidagi ustama xarajatlar qo'shilgan holda boshqa egri va to'gri xarajatlar. 2. Davr xarajatlari (ishlab chiqarish tannarxiga qo'shilmaydigan xarajatlar): a) realizatsiya bo'yicha xarajatlar; b) boshqarma (ma’muriy) bo'yicha xarajatlar; d) boshqa operatsion xarajatlar va zararlar. 3. Moliyaviy faoliyat bo'yicha xarajatlar: a) foizlar bo'yicha xarajatlar; b) chet el valyutasi bilanbog'liq operatsiyalar bo'yicha salbiy kurs farqlari; d) qimmatli qog'ozlarga sarflangan mablag'larni qayta baholash; e) moliyaviy faoliyat bo'yicha boshqa xarajatlar. 4. Tasodifiy zararlar."
        ]
    },
    {
        "word": "Xarajatlar",
        "type": [],
        "definition": [
            "foydani ko'paytirish maqsadida xo'jalik faoliyatidan kelib chiqadigan aktivlarning kamayishi yoki majburiyatlarni o'z zimmasiga olish orqali ro'y beradigan iqtisodiy resurslarning kamayishidir. "
        ]
    },
    {
        "word": "Xarajatlar Boʻyicha Yammni Hisoblash Usuli ",
        "type": [],
        "definition": [
            "pirovard mahsulotlarni ishlab chiqarishga sarf qilingan hamma sarflarni qo'shish. Unda quyidagilar jamlanadi: shaxsiy iste’mol uchun xarajatlar, ya’ni aholining iste’mol buyumlari va xizmatlari (Ix); korxona va firmalarning investitsiyalari, ya’ni ulami mashina va dastgohlar sotib olishi, qurilishi, zaxiralarning o'zgarishi bilan bog'liqbarcha xarajatlari (YAi); davlat tomonidan tovar va xizmatlar xaridi (Dx); sof eksport (Se) YaMM = Ix+YAi-(-\/+Dx+Se) "
        ]
    },
    {
        "word": "Xarajatlar Va Natijalarning Tahlili ",
        "type": [],
        "definition": [
            "iqtisodiyotning shu’ba va tarmoqlari o'rtasidagi bog'liqlikni, ishlab chiqarish xarajatlari va natijalari jadvalidan foydalangan holda ularni rivojlantirish va istiqbolini asoslash uchun foydalanish. "
        ]
    },
    {
        "word": "Xarajatlari Pasayuvchi Tarmoq",
        "type": [],
        "definition": [
            "ishlab chiqarishni kengaytirish iste’mol qilinayotgan resurslar narxining pasayishiga olib keluvchi tarmoq."
        ]
    },
    {
        "word": "Xarajatlari Oʻsuvchi Tarmoq",
        "type": [],
        "definition": [
            "ishlab chiqarishni kengaytirish iste’mol qilinayotgan resurslar narxini oshishiga oUb keluvchi tarmoq. "
        ]
    },
    {
        "word": "Xarajatlarni Qoraqalpogʻiston Respublikasi Budjetidan Va Mahalliy Budjetlardan Moliyalashtirish ",
        "type": [],
        "definition": [
            "quyidagilar yuqorida ta’kidlangan budjetlardan moliyalashtiriladi: fan, ta’lim, madaniyat, sog'liqni saqlash, jismoniy tarbiya va sport (Qoraqalpog'iston Respublikasi budjeti, viloyatlar va Toshkent shahri budjetlaridan moliyalashtiriladigan budjet tashkilotlari bo'yicha); ijtimoiy ta’minot; aholini ijtimoiy himoya qilish; Qoraqalpog'iston Respublikasi davlat hokimiyati va boshqaruv organlari hamda mahalliy davlat hokimiyati organlari faoliyatini ta’minlash; iqtisodiyot turli tarmoqlarining Qoraqalpog'iston Respublikasi, viloyatlar va Toshkent shahri budjet tashkilotlarini saqlash; qonun hujjatlariga muvofiq iqtisodiyot tarmoqlarini rivojlantirishning maqsadli dasturlari va tadbirlarini amalga oshirish; qonun hujjatlarida nazarda tutilgan boshqa maqsadlar. "
        ]
    },
    {
        "word": "Xarajatlarni Respublika Budjetidan Moliyalashtirish ",
        "type": [],
        "definition": [
            "quyidagilar respublika budjetdan moliyalashtiriladi: fan, ta’lim, madaniyat, soqliqni saqlash, jismoniy tarbiya va sport (respublikaga bo'ysunadigan tashkilotlar bo'yicha); ijtimoiy ta’minot; mudofaa, milliy xavfsizlik va jamoat tartibini ta’minlash; sudlar va prokuratura organlari faoliyatini ta’minlash; davlatzaxirasivasafarbarlikzaxirasini vujudga keltirish hamda ularni saqlash; davlat markazlashtirilgan investitsiyalarini amalga oshirish; davlat hokimiyati va boshqaruv organlari, O'zbekiston Respublikasining chet ellardagi diplomatik vakolatxonalari hamda missiyalari faoliyatini ta’minlash; iqtisodiyot turli tarmoqlarining respublikaga bo'ysunadigan budjet tashkilotlarini saqlash; O'zbekiston Respublikasi Vazirlar Mahkamasining qarorlariga muvofiq iqtisodiyot tarmoqlarini rivojlantirishning maqsadli davlat dasturlari va tadbirlarini amalga oshirish; yer tuzish, meliorativ, tabiatni muhofaza qilish va qishloq xo'jaligi zararkunandalariga qarshi kurash; gidrometeorologiya, do'lga qarshi kurash chora-tadbirlari; qonun hujjatlarida nazarda tutilgan boshqa maqsadlar. "
        ]
    },
    {
        "word": "Xarajatlarning Guruhlanishi ",
        "type": [],
        "definition": [
            "“Xarajatlar tarkibi to'g'risidagi Nizom’ga muvofiq hamma xarajatlar quyidagicha guruhlanadi: 1) mahsulot ishlab chiqarish tannarxiga qo'shiladigan xarajatlar; 2) ishlab chiqarish tannarxiga qo'shilmaydigan, ammo asosiy faoliyatdan olinadigan foydada hisobga olinadigan davr xarajatlari; 3) korxona umumxo'jalik faoliyatidan olinadigan foyda yoki zararlarda hisobga olinadigan korxona moliyaviy faoliyati bo'yicha xarajatlar; 4) daromaddan yoki foydadan soliqlar to'langunga qadar foyda yoki zarar hisob-kitobida hisobga olinadigan tasodifiy zararlar. "
        ]
    },
    {
        "word": "Xarid Ayansi ",
        "type": [],
        "definition": [
            "eksport kreditlashning bir formasi bo'lib hisoblanadi va shu vaqtning o'zida importyorning majburiyatini ta’minlovchi vositadir. Chunki importyor o'zi buyurtma bergan tovarni sotib olishga majbur bo'ladi. Rivojlangan mamlakatlarning import bilan shug'ullanuvchi firmalari rivojlanayotgan mamlakatlardan farqli o'laroq, xarid avansidan shu davlatlaming qishloq xo'jalik mahsulotlarini olib chiqib ketishda foydalanmoqdalar. "
        ]
    },
    {
        "word": "Xarid Baholari ",
        "type": [],
        "definition": [
            " qishloq, xo'jaligi mahsulotini sotib olishda ishlatiladi. "
        ]
    },
    {
        "word": "Xarid Krediti ",
        "type": [],
        "definition": [
            "eksportyor bankning to'g'ridan-to'g'ri milliy eksportyorni kreditlamasdan, balki chet ellikxaridorni, ya’ni, importyor mamlakat firmasi va uning bankini kreditlash hisoblanadi. "
        ]
    },
    {
        "word": "Xarid Narxi ",
        "type": [],
        "definition": [
            "bozorda tovarga xaridor taklif etgan narx, bozorda sotilgan tovar qiymatinig amaldagi pul ifodasi. "
        ]
    },
    {
        "word": "Xarid Qobiliyati ",
        "type": [],
        "definition": [
            "pulning quwati (qiymati). "
        ]
    },
    {
        "word": "Xaridor",
        "type": [],
        "definition": [
            " tovar ayirboshlashda bevosita ishtirok etib, tovarni tanlash, qiymatini to'lash va o'z ixtiyoriga olish ishlarini amalga oshiradigan shaxs, korxona, tashkilot, muassasa yoki ularning vakili. "
        ]
    },
    {
        "word": "Xaridor Bahosi",
        "type": [],
        "definition": [
            "xaridorning tovar yoki uning alohida xossasining o'z istaklariga, tasawuriga mos kelish darajasi ifodasi. "
        ]
    },
    {
        "word": "Xaridor Didi ",
        "type": [],
        "definition": [
            "xaridorning tovarni tasawur qilishi va tanlashida namoyon bo'ladigan o'ziga xos takrorlanmas ta’bi. "
        ]
    },
    {
        "word": "Xaridor Fikri ",
        "type": [],
        "definition": [
            "xaridorning tovar sifati, assortimenti, bezatilishi, mavqeyi, narxvaboshqaiste’molxossalari to'g'risidagi ma’lum tushunchalarda ifodalangan tasawuri. "
        ]
    },
    {
        "word": "Xaridor Istaklari ",
        "type": [],
        "definition": [
            " xaridor sotib olmoqchi bo'lgan tovarlarda ko'rishni xohlagan xossalar to'plami, ya’ni u tovarning qanday bo'lishini istaydi. "
        ]
    },
    {
        "word": "Xaridor Munosabati ",
        "type": [],
        "definition": [
            "xaridorning tovar sifati, assortimenti, bezatilishi, siymosi, mavqeyi, narx va boshqa iste’mol xossalari to'g'risidagi ma’lum tushunchalarda ifodalangan tasawuri. "
        ]
    },
    {
        "word": "Xaridorniyati",
        "type": [],
        "definition": [
            " xaridorning kelajakda nimalar olmoqchi ekanligi, kelajakda tovarlar sotib olish bo'yicha orzu havaslari. "
        ]
    },
    {
        "word": "Xaridor Umidi ",
        "type": [],
        "definition": [
            " xaridorning sotib olgan tovardan kutgan naf, qulayliklar, his-tuyg'ular."
        ]
    },
    {
        "word": "Xavf-Xatar ",
        "type": [],
        "definition": [
            "korxona rejalari va budjetini amalga oshirish nohushliklar (muvafFaqiyatsizliklar)ning yuzaga kelish ehtimoli. "
        ]
    },
    {
        "word": "Xayring ",
        "type": [],
        "definition": [
            " bunda mulk 1 yildan 3 yilgacha muddatga ijaraga beriladi. "
        ]
    },
    {
        "word": "Xazina",
        "type": [],
        "definition": [
            "xon, podsho va davlatning pullari; qimmatbaho buyumlari va boshqa moddiy boyliklari saqlanadigan joy. "
        ]
    },
    {
        "word": "Xazina Majburiyatlari ",
        "type": [],
        "definition": [
            "uning egasi tomonidan ma’lum bir pul mablag'ini budjetga kiritganligi va uning butun aylanish davrida aniq chegaralangan foizni to'lab berish majburiyatini guvoxlovchi kimmatli qog ozidir. "
        ]
    },
    {
        "word": "Xedjir",
        "type": [],
        "definition": [
            " baho bo'yicha tavakkalchilik sug'urtasi, fyuchers shartnomasi. "
        ]
    },
    {
        "word": "Xejirlash",
        "type": [],
        "definition": [
            "yo'qotiladigan, himoyalanishi kutilayotgan daromadlar darajasini istemolchi va mahsulot etkazib beruvchi o'rtasida oldindan shartnoma tuzish yo'li bilan sug'urta qilish. "
        ]
    },
    {
        "word": "Xiks Djon ",
        "type": [],
        "definition": [
            "ingliz iqtisodchisi, Nobel mukofoti sovrindori (1972-yil). Neoklassik sintez nazariyasining asoschilaridan biri. Qiymat va kapital” (1939-yil) asarida pul, kredit, moliya tizimini tadqiq etgan. Shuningdek, xalqaro savdo, iqtisodiy o'sish muomalalarini tahlil etgan. "
        ]
    },
    {
        "word": "Xizmat",
        "type": [],
        "definition": [
            "o'ziga xos tovar. Moddiy shakldagi tovarlardan farqli o'laroq, xizmatlarni jamg'arib borish va zaruriyat bilan sotish mumkin emas. Jahon iqtisodiy rivojlanishiga sezilarli darajada tasir ko'rsatadi. Xizmatlarning ko'p turlari kontraktlar asosida oldi-sotdi qilinadi. Bu ayniqsa, murakkab mashina-texnik mahsulotlar va kompleks korxonalar tomonidan ko'proq qo'llaniladi. "
        ]
    },
    {
        "word": "Xizmat Haqi Chegirilgan Hayot Sugʻurtasiga Bogʻliq Boʻlmagan Sugʻurta Tovoni ",
        "type": [],
        "definition": [
            "hayot sug'urtasi bilan bog'liq bo'lmagan, xizmat haqi chegirib tashlangan, tavakkalchilik tufayli ro'y beradiganxavf-xatarda sug'urta himoyasidan foydalanish uchun to'lanadigan xaq yig'indisi. Bu tovon uchinchi tomon majburiyati, tovar yoki mulkning shikastlanishi, unga zarar yetishi, turli tasodiflar tufayli (to'qnashish, avariya, toshqin, suvga cho'kish, yong'in, kasallik, o'g'irlik, zo'rlik) yoxud kasallik, baxtsiz hodisalar, ishsizlik singari voqealar tufayli daromadning kamayishi oqibati hisoblanadi. "
        ]
    },
    {
        "word": "Xizmat Koʻrsatish Kafolatlari ",
        "type": [],
        "definition": [
            "xizmat ko'rsatish vadasi. Bunda ushbu va’da bajarilishida lozim bo'ladigan tadbirlar bilan mahkamlanadi."
        ]
    },
    {
        "word": "Xizmat Koʻrsatish Rejasi ",
        "type": [],
        "definition": [
            "xizmat ko'rsatish jarayonining mijozning ko'zi oldida bo'ladigan qismi va mijoz kuzata olmaydigan qismi oralig'i aniq chegaralangan sxemasi. "
        ]
    },
    {
        "word": "Xizmat Koʻrsatish Sohasi ",
        "type": [],
        "definition": [
            " ijtimoiy ishlab chiqarishning moddiybuyumlashgan ko'rinishga ega bo'lmagan iste’mol qiymatlarini yaratishga yo'naltirilgan sohalari. U o'z ichiga moddiy xizmatlar ko'rsatish (transport, aloqa, savdo, maishiy xizmat va boshqalar) hamda nomoddiy xizmatlar ko'rsatish (huquqiy maslahatlar berish, o'qitish, malaka oshirish va boshqalar)ni oladi. Hozirgi iqtisodiy adabiyotlarda ko'proq “investitsiyalar” sinonim termini qo' llaniladi, to'g'ridan-to'g'ri investitsiyalar, real investitsiyalar va asosiy kapital kabi terminlar ham qo'llaniladi. "
        ]
    },
    {
        "word": "Xizmatlar Va Tijorat Xarakteriga Ega Boʻlmagan Toʻlovlar Balansi ",
        "type": [],
        "definition": [
            "transport, pochta, telegraf, telefon, turizm, madaniy aloqalar, perevodlar, xorijiy mamlakatlar hududida harbiy qismlarni saqlash, chet elda savdo va diplomatik vakolatxonalarni ochish, xalqaro kreditlar bo'yicha to'lanadigan foizlar va boshqa shu kabi sohalarda yuzaga keluvchi valyutaviy tushumlar va to'lovlar summasi aks ettiriladi. "
        ]
    },
    {
        "word": "Xoʻjalik Hisobi ",
        "type": [],
        "definition": [
            "xo'jalik yuritish usuli, korxonalarning o'z xarajatlarini o'zi qoplashi, o'z-o'zini moliyalash, ishlab chiqarish-xo'jalik faoliyati natijalaridan moddiy manfaatdorlik va javobgarlik kabi qoidalarga asoslanadi. Xo'jalik hisobi korxonalari foyda keltirib ishlashini ko'zda tutadi va tovar-pul munosabatlariga asoslanadi. "
        ]
    },
    {
        "word": "Xoʻjalik Mexanizmi ",
        "type": [],
        "definition": [
            "iqtisodiyotni boshqarishga yordam beradigan iqtisodiy dastak va rag'batlar hamda tashkiliy shakllar majmuyi va birligi. Xo'jalik mexanizmi rejalashtirish, boshqaruv usullari, baholar, moliyaviy va kredit dastaklari, mehnatga haq to'lash shakllari va boshqa iqtisodiy rag'batlarni o'z ichiga oladi. "
        ]
    },
    {
        "word": "Xoʻjalik Muomalalari ",
        "type": [],
        "definition": [
            " mablag'larning hajmida, tarkibida, joylashish va foydalanishida, shuningdek, bu mablag'lar manbaining tarkibi va tayinlanishida o'zgarishlarini hosil qiladigan alohida xo'jalik harakati. Xo'jalik muomalalari va ular tufayli hisob obyektlarida bo'ladigan o'zgarishlar buxgalteriya hisobida qayd qilinadi. Xo'jalik muomalalarini buxgalteriya hisobida qayd qilish yo'li bilan uning predmeti aks ettiriladi. "
        ]
    },
    {
        "word": "Xoʻjalik Muomalasi (Operatsiyasi) ",
        "type": [],
        "definition": [
            " xo'jalik jarayonlarini amalga oshirishdagi korxona mablag' lari va xo'jalik jarayonlarining harakati yoki mablag'larning harakati, ularning bir shakldan ikkinchisiga o'tishi. Boshqacha qilib aytadigan bo'lsak, xo'jalik muomalasi, bu - mablag'lar va ularning tashkil topish manbalarining yozma holda aks ettirilgan harakati. "
        ]
    },
    {
        "word": "Xoʻjalik Subyekti Bilan Ishni Davom Ettirayotgan Auditorlik Tashkiloti ",
        "type": [],
        "definition": [
            "xo'jalik subyektining oldingi davr buxgalteriya hisobotlarini auditini o'tkazgan va audit o'tkazish shartnomasi bo'yicha ushbu auditni oxirgi hisobot davri uchun o'tkazayotgan auditorlik tashkiloti."
        ]
    },
    {
        "word": "Xoʻjalik Yurituvchi Subyekt Faoliyati Haqida Maʼlumot ",
        "type": [],
        "definition": [
            "audit tekshiruvi o'tkazilayotgan xo'jalik yurituvchi subyekt iqtisodiyoti va ushbu xo'jalik yurituvchi subyektga tegishli soha to'g'risida ma’lumotlar yig'indisi, shuningdek, uning faoliyatidagi o'ziga xos xususiyatlar to'g'risidagi ma’lumotlar yig'indisi bo'lib, auditor o'z majburiyatlarini tegishli darajada bajarish uchun rejalashtirish bosqichida olishi lozim bo'lgan va auditorlik tekshiruvining boshqa bosqichlarida to'Idirishi mumkin bo'lgan ma’lumotlar hisoblanadi. "
        ]
    },
    {
        "word": "Xoʻjalik Yurituvchi Subyektlar Oʻrtasida Oʻzaro Moliyalashtirish ",
        "type": [],
        "definition": [
            "korxonalar o'zaro xujalik munosabatlarini amalga oshirish jarayonida bir-birlariga turli xildagi mahsulotlar yetkazib berishda to'lovlami kechiktirish hollari ham yuz beradi va buning natijasida o'zaro moliyalashtirish holati yuzaga keladi. "
        ]
    },
    {
        "word": "Xodimlar",
        "type": [],
        "definition": [
            "ishlab chiqarish yoki boshqaruv operatsiyalarini bajaruvchi va mehnat vositalaridan foydalanib, mehnat predmetini qayta ishlash bilan band bo'lgan barcha xodimlar. "
        ]
    },
    {
        "word": "Xodimlarni Boshqarish ",
        "type": [],
        "definition": [
            "xodimlar imkoniyatlari va tashkilot maqsadlari, strategiyasi, rivojlanishi sharoitlarini muvofiqlikka keltirishga yo'naltirilgan maqsadga qaratilgan ta’sir. "
        ]
    },
    {
        "word": "Xodimlarni Boshqarish Prinsiplari ",
        "type": [],
        "definition": [
            " ayni turdagi faoliyat jarayonida rahbarlar, mutaxassislar amal qilishi lozim bo'lgan qonun-qoidalar, me’yorlar majmuyi. "
        ]
    },
    {
        "word": "Xodimlarni Tanlab Olish ",
        "type": [],
        "definition": [
            "bo'sh lavozimlarga nomzodlarni baholash. O'z ichiga quyidagi bosqichlami oladi: dastlabki suhbatlashish, anketa ma’lumotlarini tahlil qilish; nomzod haqida ma’lumotlarni to'plash; tekshiruvchi sinovlar, test o'tkazish, tibbiy ko'rikdan o'tkazish; asosiy suhbat; ekspertlar xulosasini tayyorlash. "
        ]
    },
    {
        "word": "Xolding",
        "type": [],
        "definition": [
            "(ingl. “holding” - ega) o‘zga firma, korxonaning nazorat paketini o'zida ushlab turuvchi bosh kompaniya. Xolding qo‘l ostidagi kompaniyalarni rivojlantirib, daromadni ko‘paytirib, o‘zi ham tadbirkorlik faoliyati bilan shug'ullanadi. Huquqiy nuqtai nazardan aksionerlik jamiyati, mas’uliyati cheklangan jamiyat yoki xususiy korxona sifatida harakat qiladi. Xolding kompaniyasi sof xolding va aralash xolding ko'rinishida bo'ladi. Sof xolding umumiy boshqaruvni ta’minlash uchun moliyaviy nazorat vazifalarini bajaradi. Aralash xolding moliyaviy nazorat vazifalaridan tashqari tadbirkorlik faoliyatlari bilan ham shug'ullanadi. U boshqa firmalarning nazorat paketini qo'lga olib, ularni ishlab chiqarish faoliyatini o'ziga bo'ysundiradi. Xolding kompaniyasi faoliyati aksiya paketlarini boshqarish bilan chegaralanmay, birja va boshqa operatsiyalardan dividendlar yig'ish, boshqaruvga, direktorlar kengashiga va boshqa qaramog'idagi kompaniyalarga vakillar tayinlash bilan ham shug'ullanadi."
        ]
    },
    {
        "word": "Xolding Foydasi ",
        "type": [],
        "definition": [
            "ishlab chiqarish faoliyatining mahsuli emas. Xolding foydasi - ishlab chiqarishdan olingan daromad emas. "
        ]
    },
    {
        "word": "Xolding Kompaniyasi ",
        "type": [],
        "definition": [
            "aksionerlar kompaniyasi bo'lib, o'zga huquqiy mustaqil kompaniyalarning nazorat paketlariga ega bo'lib, ular ishlab chiqarish faoliyatlari bilan shug'ullanmaydilar. Xolding kompaniyasining ikki turi farqlanadi: belgilangan funksiyalarni bajarish uchun tashkil etilgan haqiqiy xolding va aniq tadbirkorlik faoliyati (sanoat, savdo, transport, moliya-kredit va boshqalar) bilan ham shug'ullanuvchi aralash xolding. "
        ]
    },
    {
        "word": "Xomashyo ",
        "type": [],
        "definition": [
            "mehnat tasirida o'zgargan, ammo yana ishlanishi lozim bo'Igan mehnat predmeti. Ishlab chiqarish jarayonida xomashyodan tayyor mahsulot yoki yarim fabrikat hosil qilinadi. Natijada xomashyoning to'la qiymati tovar formasini olgan yangi mahsulotga o'tadi. Xomashyo kelib chiqishiga ko'ra sanoat va h.k. xomashyosiga bo'linadi. Sanoat xomashyosi, o'z navbatida, mineral va suniy xomashyoga ajraladi. Mineral xomashyo ishlatilishiga qarab yoqilg'i-energetika xomashyosi (neft, tabiiy gaz, ko'mir, uran, yonuvchi slaneslar), metallurgiya xomashyosi (qora, rangli nodir va asl metallar) kon-kimyo xomashyosi (agronomiya rudalari, barit, kalsiy ftorid, oltingugurt), texnik xomashyo (olmos, grafit, slyuda), qurilish materiallari (sement, keramika va b.)ga bo'linadi. Sun iy xomashyoga sintetik smolalar, kauchuk, plastmassalar, sun’iy charm, sintetik yuvish vositalari, qishloq xo'jalik xomashyosiga o'simlik (donli va texnika ekinlari, yog'och, yowoyi va shifobaxsh o'simliklar) va hayvonot xomashyosi (go'sht, baliq, sut, teri, junlar) kiradi."
        ]
    },
    {
        "word": "Xorijiy Davlatlarning Hukumatlari, Banklari Va Firmalariga Bog Langan Kreditlar ",
        "type": [],
        "definition": [
            "xorijiy davlatlaming hukumatlari, banklari va firmalari mablag'lari hisobidan kreditor mamlakatdan tovarlar, ishlar va xizmatlar sotib olish uchun qaytarilish va tiklanish asosida mablag'lami jalb qilish shakli. "
        ]
    },
    {
        "word": "Xorijiy Nazorat Ostidagi Nomoliyaviy Korporatsiyalar ",
        "type": [],
        "definition": [
            "- davlat idoralari yoki norezident institutsion birliklar tomonidan nazorat qilinmaydigan rezidentlik barcha nomoliyaviy korporatsiyalar va kvazikorporatsiyalar ana shunday korporatsiyalar jumlasiga kiradi. "
        ]
    },
    {
        "word": "Xorijiy Sarmoyalar ",
        "type": [],
        "definition": [
            "xorijiy davlat investor mablag'larini yoki xorijiy tijorat tashkilotlarining mablag'larini jalb qilish ko'rinishida bo'ladi. "
        ]
    },
    {
        "word": "Xosilaviy Qimmatli Qogʻozlar ",
        "type": [],
        "definition": [
            "birlamchi qimmatli qog'ozlarning shu bozorda amal qilishi natijasida hosilbo' lgan ikkilamchi qimmatli qog'ozlardir. Xosilaviy qimmatli qog'ozlar o'z egasiga birlamchi qogozlarni sotib olish va sotish huquqini beradi. Ularning qiymati boshqa qog'ozlar orqali gavdalanadi."
        ]
    },
    {
        "word": "Xrematistika",
        "type": [],
        "definition": [
            " mulk orttirish san’ati, ya’ni foyda va boylikni pul shaklida to'plashga yo'naltirilgan faoliyat. Kapital qo'yish va jamg'arish san’atidir. Amaliyotda kam qo'llaniladi. Aristotel tomonidan kiritilgan. "
        ]
    },
    {
        "word": "Xronologik Yozuv ",
        "type": [],
        "definition": [
            "xo'jalik muomalalarini xronologik tartibda, ya’ni ular sodir bo'lishi sanalari bo'yicha yozish. Xronologik yozuv buxgalteriya hisobi obyektlari to'g'risida zaruriy ko'rsatkichlarni olish imkoniyatlarini bermaydi. Buning uchun tizimli yozuv qo'llaniladi. Xronologik yozuv uchun hisobning memorial- order shaklida qo'llaniladigan registratsiya jurnali tayinlangan. Registratsiya jurnaliga oy boshida yozilgan summa barcha schyotlarning oy bo'yicha debet va kredit aylanmalari jamiga teng bo'lishi kerak. Bunday nazorat tenglik ikkiyoqlama yozuvning ma’nosidan kelib chiqadi. Xronologik yozuv tizimli yozuv bilan birga bir hisob registrida amalga oshirilishi mumkin. "
        ]
    },
    {
        "word": "Xufyona Iqtisodiyot ",
        "type": [],
        "definition": [
            " davlat tomonidan nazorat qilinmaydigan tovar va xizmatlarni ishlab chiqarish, taqsimlash, ayirboshlash va iste’mol qilish, ya’ni soliq to'lamaydigan,qonunlargabo'ysunmaydiganishlab chiqarish va xizmat ko'rsatish. Xufyona iqtisodiyotga qarshi kurash vositalari quyidagilar: erkinbozorni vujudga keltirish, mulkka davlat egaligini va markazlashtirilgan direktiv rejalashtirishni yo'qotish."
        ]
    },
    {
        "word": "Xunarmandchilik",
        "type": [],
        "definition": [
            "turli yo'nalishlarda oddiy mehnat qurollari yordamida o'z mehnatlari bilan mahsulot ishlab chiqarish faoliyati. "
        ]
    },
    {
        "word": "Xususiy",
        "type": [],
        "definition": [
            "l) biror shaxsning yolg'iz o'ziga qarashli, tegishli bo'lgan mulki, shaxsiy mulk; 2) ayrim shaxslar tomonidan yakka tartibda amalga oshiriladigan harakat; 3) muayyan bir narsa yoki mavzuga bag'ishlangan. "
        ]
    },
    {
        "word": "Xususiy Firma ",
        "type": [],
        "definition": [
            " ayrim shaxs yoki oilaga tegishli bo'lgan yakka xususiy mulkka asoslanib, faoliyat ko'rsatuvchi korxona. Bunday korxonalar asosan qishloqxo'jaligi vakichikbiznes doirasidakengishyuritadilar"
        ]
    },
    {
        "word": "Xususiy Jamgʻarmalarning Ijtimoiy Sugʻurta Nafaqasi ",
        "type": [],
        "definition": [
            "- sug'urta korxonalari yoki boshqa turdagi institutsion birliklar, ijtimoiy sug'urta xususiy dasturi boshqaruvchilari tomonidan uy xo'jaliklariga to'lanadigan nafaqa. "
        ]
    },
    {
        "word": "Xususiy Kapital ",
        "type": [],
        "definition": [
            " tadbirkorning eng muhim va hal etuvchi ahamiyatga ega bo'lgan sarmoyasi. "
        ]
    },
    {
        "word": "Xususiy Mehnat Taqsimoti ",
        "type": [],
        "definition": [
            "umumiy mehnat taqsimotining sohalar va tarmoqlar ichidagi taqsimoti. "
        ]
    },
    {
        "word": "Xususiy Mulk ",
        "type": [],
        "definition": [
            "ayrim kishining ishlab chiqarish vositasiga va ishlab chiqarish natijasiga yakka o'zinikidek munosabatda bo'lishligini aks ettiradi. Xususiy mulk ikki xil korinishda yuzaga keladi: a) mehnat bilan erishilgan xususiy mulk; b) mehnatsiz erishilgan xususiy mulk. Mehnat bilan erishilgan xususiy mulk, uning ishlab chiqarish vositasida o‘zi mehnat qilib, tirikchilik o'tkazuvchi yakka dehqonlar, mayda hunarmand va kosiblar mulki. Yollanma ishchilarni ishlatib topilgan boylik xususiy mulkning ikkinchi shaklini tashkil etadi. Xususiy mulk ishlab chiqarish yoki o'z qobiliyatini ishga solishdagi tadbirkorlik, o'z xo'jaligini yuritish, daromadni turli qimmatbaho qog'ozlarga joylashtirish natijasida merosga qolgan mulk va boshqa qonun yo'l qo‘yadigan sohalar asosida yuzaga keladi va ko'payib boradi. "
        ]
    },
    {
        "word": "Xususiy Regressiya Koeffitsienti ",
        "type": [],
        "definition": [
            "muayyan omilning natijaviy belgi variatsiyasiga tasirini omillar o'zaro bog'lanishidan “tozalangan ’ holda o'lchaydi. "
        ]
    },
    {
        "word": "Xususiy Tadbirkorlik ",
        "type": [],
        "definition": [
            "fuqarolar (alohida fuqarolar) tomonidan o'zlarining tavakkalchiliklari va mulkiy javobgarliklari ostida, shaxsiy daromad (foyda) olish maqsadida amaldagi qonunchilik doirasida amalga oshiriladigan tashabbuskor xo'jalik faoliyati dir."
        ]
    },
    {
        "word": "Xususiy Tashkilotlar ",
        "type": [],
        "definition": [
            "demokratik davlatlarda, individuallar va xususiy tashkilotlar mustaqil ish yuritishga harakat qiladi. Masalan, ro'znoma va oynomalar xususiy tarzda boshqariladi. Davlat maktablari bilan xususiy maktablar ham faoliyat ko'rsatadi. Ko'plab korxonalar xususiy tarzda boshqariladi. Britaniya, Shvetsiya va ko'plab davlatlarda (ya’ni demokratik davlatlarda) sanoat va xizmat ko'rsatishning ayrim tarmoqlariga davlatning o'zi egalik qiladi. Totalitar davlatlarda esa hukumatning o'zi aksariyat uyushmalar va tashkilotlarni shakllantiradi va nazorat qiladi. Bu davlatlarda odamlar davlatning ruxsatisiz biror-bir guruhga birlasha ham olmaydilar. "
        ]
    },
    {
        "word": "Xususiylashtirish",
        "type": [],
        "definition": [
            "davlat mulkini xususiy mulkka aylantirish. Xususiylashtirish davlat mulki monopoliyasini tugatish, erkin sohibkorlik tashabbusiga yo'l ochish, bozor iqtisodiyotini rag'batlantirish maqsadida amalga oshiriladi. Xususiylashtirish orqali davlat mulki fuqarolarga berilib, har bir kishi milliy boylikdagi o'zhissasiga egabo'ladi. Xususiylashtirish davlat mulkini investitsiya etishdan, ya’ni yangidan uni hisob-kitob qilib, uning haqiqiy qiymati miqdorini aniqlashdan boshlanadi. Uni o'tkazish uchun maxsus organlar tashkil etiladi. Xususiylashtirish uchun ajratilgan davlat mol-mulkining ro'yxati tuziladi, davlat mulkini sotib olish (berish) shart-sharoiti aniqlanadi. "
        ]
    },
    {
        "word": "Xususiylashtirish Investitsiya Fondlari (Xif) ",
        "type": [],
        "definition": [
            "investitsiya fondlarining bir turi hisoblanadi. Ular aholining keng qatlamini xususiylashtirish jarayoniga jalb etish maqsadida tashkil etiladi."
        ]
    },
    {
        "word": "Xvfning Bosh Maqsadi ",
        "type": [],
        "definition": [
            "xalqaro valyuta tizimi ustidan nazoratni amalga oshirish va barcha a’zo mamlakatlarga (ham rivojlangan boy, ham rivojlanayotgan kambag'al) qisqa muddatli moliyaviy muammolarni hal etishda yordam ko'rsatish. O'zbekiston 1992-yilda XVFga a’zo bo'Igan. "
        ]
    },
    {
        "word": "Xxi Hisobot Tizimi ",
        "type": [],
        "definition": [
            "markazlashgan taqsimotga asoslangan iqtisodiyot hisobot tizimdir."
        ]
    }
]