[
    {
        "word": "Zaxira",
        "type": [],
        "definition": [
            "l) Valyuta zaxirasi - boshqa mamlakatlar Markaziy banklarining xalqaro hisob-kitob uchun mamlakat valyutasida yig'ib va saqlaydigan mablag'lari. 2) Kapital (fond) zaxirasi - korxona, aksionerlik jamiyati va hokazolarning foydadan chegirib qolib tashkil qilinadigan xususiy mablag'lar qismi bo'lib, xo'jalik operatsiyalari faoliyatidagi zararlarni qoplash, asosiy fondlarni to'ldirish va kundalik foyda yetarli bo'lganda dividendlar to'lash uchun foydalaniladi."
        ]
    },
    {
        "word": "Zaxira Fondi",
        "type": [],
        "definition": [
            "joriy yilda kelib tushgan sug'urta mukofotlari hisobidan sug'urta qoplamasini to'lash imkoniyati bo'lmaganda, ushbu sug'urta qoplamasini to' lash uchun foydalaniladigan pul mablag' lari fondi. Ma’lumki, sug'urta hodisalari tufayli ko'rilgan yo'qotishlar va zararlar miqdori har yili har-xil bo'ladi. Ayrim yillari sug'urta hodisalari kam, boshqa yili esa ko'proq bo'lishi mumkin. Agar sug'urta hodisalari soni ko'p bo'lib, ko'rilgan zarar miqdori joriy yilda kelib tushgan sug'urta mukofotlaridan bir necha marta ko'p bo'lsa, ularning farqi zaxira fondi hisobidan qoplanadi."
        ]
    },
    {
        "word": "Zaxira Sigʻimisiz Xarajatlar",
        "type": [],
        "definition": [
            "tijorat, sotish va ma’muriy boshqaruvxarajatlari. Ushbu xarajatlar TMZ bevosita ta’sir qilmaydi va ishlab chiqarish tannarxini kalkulatsiya qilishda qatnashmaydi, ya’ni mahsulotning ishlab chiqarish tannarxiga qo'shilmaydi"
        ]
    },
    {
        "word": "Zaxiraga Ishlab Chiqarish",
        "type": [],
        "definition": [
            "standart mahsulotlar ishlab chiqarib, tayyor mahsulot zaxirasini yaratishga imkon beruvchi jarayon"
        ]
    },
    {
        "word": "Zaxiralarga Boʻlgan Xarajatlar",
        "type": [],
        "definition": [
            "tovar moddiy zaxiralarni sotib olish, saqlash va ularning tabiiy kamayishi bilan bog' liq xaraj at, sarf va zararlarning yig'indisi."
        ]
    },
    {
        "word": "Zaxiralarni Asrash Uchun Sarflangan Xarajatlar",
        "type": [],
        "definition": [
            "tovar moddiy zaxiralarni sotib olish va ularni saqlash bilan bog'liq xarajatlar."
        ]
    },
    {
        "word": "Zaxiralarni Baholash",
        "type": [],
        "definition": [
            "tugallanmagan ishlab chiqarish, ombordagi tayyor mahsulot va TMZ tannarxini hisoblash."
        ]
    },
    {
        "word": "Zahiriddin Muhammad Bobur",
        "type": [],
        "definition": [
            "(1483-1530) - Andijon, Qobul va Hindiston hukmdori, “Boburnoma”, “Mubayyin” asarlarida soliq siyosati, masalan, zakot to'g'risida qimmatli g'oyalari berilgan. Eng muhimi, daromad oshgan sari soliqning kamayib borishining ahamiyati tushuntiriladi. Savdo va ayniqsa tashqi munosabatlarga katta e’tibor bergan."
        ]
    },
    {
        "word": "Zaiflik",
        "type": [],
        "definition": [
            "kompaniya faoliyati uchun zarur bo'lgan nimaningdir yetishmasligi, kompaniya qila olmaydigan qandaydir ish yoki kompaniyani noqulay vaziyatga solib qo'yadigan sharoit."
        ]
    },
    {
        "word": "Zakot",
        "type": [],
        "definition": [
            "(arab. - tozalanish, sadaqa berish) mol-mulk va daromaddan ixtiyoriy ravishda beriladigan xayr-ehson. Zakot - Islom dinining besh asosiy talablaridan biri. Unga ko'ra, har bir musulmon yillik umumiy daromadining qirqdan bir ulushini (ya’ni 2,5%ni) zakot sifatida berishi lozim."
        ]
    },
    {
        "word": "Zamonaviy Axborot Texnologiyalar",
        "type": [],
        "definition": [
            "kompyuter texnikasi, dasturiy va telekommunikatsiya vositalarini qo'llagan holda foydalanuvchining faol ishtirokida amalga oshiriladigan yuqori darajadagi do'stona interfeysli axborot texnologiyasidir. ZARARLAR - fuqarolik huquqida qonunga xilof harakatlar tufayli bir shaxs (yuridik yoki jismoniy) tomonidan ikkinchi shaxsga (yuridik yoki jismoniy) yetkazilgan ziyonning pulda ifodalangan shakli. Zararlar mahsulot, ish, xizmatlami sotishdan, tabiiy ofatlar, debitorlik qarzlarni talab qilib olmasdan voz kechishdan, to'liq amortizatsiya qilinmagan asosiy fondlarga barham berishdan va boshqalardan vujudga kelishi mumkin. Mahsulot, ish va xizmatlaming bahosi ularning to'liq tannarxi dan past bo'lganda ham zararlar paydo bo'ladi."
        ]
    },
    {
        "word": "Zararsizlik Nuqtasi",
        "type": [],
        "definition": [
            "umumiy xarajatlar umumiy daromadga yoki o'rtacha xarajatlar, mahsulot narxiga teng bo'lganda, ishlab chiqarish hajmi agarda bozor narxi zararsizlik nuqtasidan pasaysa, unda korxonalar, tabiiyki, o'z tarmoqlarini tashlab, boshqa tarmoqqa o'tib ketadilar. Bu nuqtada faqat yangi mahsulotni ishlab chiqarishga o'tgan korxonalar faoliyat ko'rsatishlari mumkin bo' ladi yoki korxona tomonidan o'tkazilgan tahlil shu tarmoqda ishlab chiqarilayotgan mahsulotga qisqa muddatda talabning ko'tarilishi natijasida narxning ko'tarilishini tasdiqlasa, korxona o'z faoliyatini davom ettirishi mumkin."
        ]
    },
    {
        "word": "Zararsizlikning Tahlili",
        "type": [],
        "definition": [
            "subyekt faoliyatining zararsizlik nuqtasini aniqlashga yordam beruvchi qisqa muddat ichida olinadigan daromad, xarajatlar va foydalarning o'zaro qaramligiga asoslangan tahlil."
        ]
    },
    {
        "word": "Zaruriy Ish Vaqti",
        "type": [],
        "definition": [
            "sarflangan ish vaqtining bir qismi. Zaruriy ish vaqti davomida ishchi o'zining yashash sharoitini ta’minlash uchun zarur bo'lgan qiymatdagi mehnat mahsulotini yaratadi. Zaruriy ish vaqtining umumiy sarflangan ish vaqtidagi ulushi miqdori ishchilarning mehnat unumdorligi darajasi, mehnatning intensivligi, ish haqi darajalariga bog'liq bo'ladi. Zaruriy ish vaqti ishchi sarf etgan jismoniy va aqliy quwatini qayta tiklash, malakasini oshirish, o'zi va oila a’zolarining hayot kechirishini ta’minlash uchun zarur bo'lgan mablag'ni yaratadi."
        ]
    },
    {
        "word": "Zaruriy Mahsulot",
        "type": [],
        "definition": [
            "zaruriy ish vaqti davomida yaratilgan mahsulotga zaruriy mahsulot deyiladi. U ishchi va xodimlarning oladigan ish haqiga to'g'ri kelishi yoki rivojlangan mamlakatlardagidek aholi qo'liga nafaqalar, imtiyozlar ko'rinishida kelib tushishi mumkin."
        ]
    },
    {
        "word": "Zaruriy Mehnat",
        "type": [],
        "definition": [
            "ishchi va xodimlar tomonidan zaruriy mahsulotni yaratish uchun sarflangan mehnat."
        ]
    },
    {
        "word": "Zaruriy Taklif",
        "type": [],
        "definition": [
            "mavjud talabni to'la qondirish uchun kerak bo'ladigan tovarlar, ularning turlari va hajmi."
        ]
    },
    {
        "word": "Zavod Ichida Zavod",
        "type": [],
        "definition": [
            "ishlab chiqarish alohida liniyalarga bo'linishini tavsiflaydigan konsepsiyadir. Shu bilan birga alohida mustaqil bo'limlar ajratilib, ularning har biri uchun alohida operatsion strategiya ishlab chiqiladi. Bunda, strategiyalar almashishida ehtimoli bo'lgan xarajatlarni kamaytirish maqsadida, har bir bo'lim o'z operatsion strategiyasiga suyangan holda faoliyat yuritadi"
        ]
    },
    {
        "word": "Zayom",
        "type": [],
        "definition": [
            "(olingan yoki berilgan qarz) 1. Davlat tomonidan iqtisodiyotni rivojlantirish, budjetdagi kamomadni to'ldirish yoki boshqa maqsadlarda sotuvga chiqarilgan zayom obligatsiyalari shaklidagi qimmatbaho qog'ozlar. 2. Fuqarolar huquqidagi shunday shartnomaki, bunda bir tomon (zayom beruvchi) boshqa tomon (zayom oluvchi)ga pullar yoki narsalarni xususiy mulkchilikka yoki operativboshqarishga beradi, ikkinchi tomon esa zayom beruvchiga shuncha miqdordagi pulni yoki teng miqdordagi narsani qaytarib berishiga majburiyat oladi."
        ]
    },
    {
        "word": "Zayom Olish Usullari",
        "type": [],
        "definition": [
            "zayom olish usullari oldi-berdi munosabatlarini rasmiylashtiradi va qimmatli qog'oz emmitentini uning egasiga (kreditlarga) belgilangan pul summasini qo'llashni ifoda qiladi."
        ]
    },
    {
        "word": "Zayom Qimmatbaho Qogʻozlar",
        "type": [],
        "definition": [
            "bozor muomalasidagi pul hujjati bo'lib, zayom egasining ushbu hujjatni chiqargan shaxsga nisbatan munosabatini tasdiqlaydi."
        ]
    }
]