[
    {
        "word": "Abbod ibn Tamiym",
        "type": [],
        "definition": [
            "Abbod ibn Tamiym roziyallohu anhu ibn G'aziyyata Ansoriy al-Maziniy hadis ilmida olim va ishonchli tobe'inlardan bo'lganlar. Hadislarni otalari va amakilari Abdulloh ibn Zayd ibn Osimlardan rivoyat qilganlar. Ba'zilar u kishini Rasululloh sollallohu alayhi vasallam bilan ko'rishganlar, deb aytishadi.\r\n    Bu zotdan Abdulloh ibn Abu Bakr ibn Hazm va boshqalar rivoyat qilganlar.\r\n    Abbod ibn Tamiym roziyallohu anhuning amakilari Abdulloh ibn Zayd al-Ansoriydirlar. Bu kishining o'zlari ham, ota-onalari ham, aka-ukalari ham sahobiy bo'lganlar. Ular Bani Mazin ibn Najjor avlodidan bo'lgani uchun ushbu hadisning roviysi nomlariga al-Maziniy nisbati qo'shib zikr qilinar ekan.\r\n    Payg'ambarlik da'vosini qilgan Musaylamatul Kazzob bu kishining akalari Habib ibn Zayd roziyal¬lohu anhuning go'shtlarini qiymalab o'ldirgan ekan. Keyinchalik Abdulloh ibn Zayd roziyallohu anhu Vahshiy bilan birgalikda Musaylamatul Kazzobni o'ldirganlar.\r\n    Abdulloh ibn Zayd al-Maziniy roziyallohu anhudan 48ta hadis rivoyat qilingan ekan. Shulardan 8tasini Imom Buxoriy ham, Imom Muslim ham olgan ekanlar. Bu kishi roziyallohu anhu 63-hijriy sanada Zulhijja oyida Harra nomli joyda shahid bo'lganlar."
        ]
    },
    {
        "word": "Abbos al-Uruxsiy",
        "type": [],
        "definition": [
            "Abbos ibn Abdulloh al-Uruxsiy Bishr ibn Ubayd ad-Dorasiy va Muhammad ibn Ubayddan hadis rivoyat qilganlar. O'zlaridan esa Ibrohim ibn Hamdavayh hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abbos as-Sagʻoniy",
        "type": [],
        "definition": [
            "Abul Fazl Abbos ibn Ja'far as-Sag'oniy shayx edilar. Iso ibn Ahmad al-Asqaloniy, Abdurahmon ibn Ma'ruf va Muhammad ibn Imron ash-Sha'roniydan hadis ilmidan ta'lim olganlar. Hijriy 275 (milodiy 889) yildan keyin vafot etganlar."
        ]
    },
    {
        "word": "Abbos ibn Abdulmuttolib",
        "type": [],
        "definition": [
            "Abbos ibn Abdulmuttolib ibn Hoshim ibn Abdumanof, onalari Nutayla binti Habbob ibn Kulayb. Kunyalari Abu Fazl. Bu kishi Abbosiylar xalifaligining asoschisi, Rasululloh sollallohu alayhi vasallamning amakilari, johiliyat davrida Quraysh qavmining raisi va Masjidul Haromning boshlig'i bo'lganlar. Rasululloh sollallohu alayhi vasallam bilan ansorlar o'rtasida bo'lgan 'Aqaba' bay'atida ishtirok etgan va nutq so'zlagan. 'Hunayn' jangida musulmonlar yengilib turgan paytda ularga to'g'ri yo'lni ko'rsatgan. Rasululloh sollallohu alayhi vasallamga qarindoshlari ichida eng yaqini bo'lgan ulug' sahobalardan edilar.\r\n    Abbos roziyallohu anhu Islomga hijratdan oldin kirdilar, ammo iymonlarini mushriklardan sir tutar, Makkada bo'lgan paytlarida Rasululloh sollallohu alayhi vasallamni mushriklar xabaridan voqif etar edilar. Badr jangida mushriklar tomonida bo'lib, urushga majburan olib chiqilgan edilar. Shuning uchun Rasululloh sollallohu alayhi vasallam sahobalarga: 'Kim amakim Abbosga yo'liqsa, o'ldirmasin', deb aytdilar.\r\n    Rasululloh sollallohu alayhi vasallam amakilarini juda yaxshi ko'rar edilar. Hatto Badr jangi tugagan kuni amakilari asirlikda yotganlari sababli uxlay olmadilar.\r\n    Rasululloh sollallohu alayhi vasallam aytar edilar:\r\n    'Ey insonlar, kim amakim Abbosga ozor bersa, menga ozor beribdi. Bu amakim otamning men uchun qoldirgan kishisidir'.\r\n    Abbos ibn Abdulmuttolib Madinaga hijrat qilish uchun Rasululloh sollallohu alayhi vasallamdan izn so'raganlarida, Rasululloh sollallohu alayhi vasallam: 'Makkadagi maqoming sen uchun yaxshiroqdir', deganlar.\r\n    Bu zot xotinlari Ummu Fazl bilan hijratning 8-yili Ramazon oyida Makkadan Madinaga hijrat qilishdi. Shunda Rasululloh sollallohu alay¬hi vasallam: 'Mening payg'ambarligim oxirgi payg'ambarlik bo'lganidek, sizning hijratingiz oxirgi hijratdir', deb aytdilar.\r\n    Abbos ibn Abdulmuttolib saxiy kishilardan edilar, butun mollarini urushga askarlarni jihozlash uchun sarf qilar edilar. O'z hisoblaridan yetmishta qul ozod qilganlari rivoyatlarda keladi. Rasululloh sollallohu alayhi vasallamning vafotlaridan keyin Abbosning jonu tani, molu dunyosi Islom xizmatida bo'ldi.\r\n    Umar roziyallohu anhuning xalifalik davrlarida suv yo'qligi sababli qahatchilik yetdi. Xalifa bir necha marta duo qilib, suv talab qildi. Lekin yomg'ir yog'madi. Xalifa Umar hazrati Abbosning huzurlariga borib, birga chiqishini so'radi. Hazrati Abbos musulmonlar bilan chiqib, osmonga qo'llarini cho'zib, duo qilganlaridan keyin, Alloh insonlarni bu qahatchilikdan xalos etdi.\r\n    Bu zot hadis rivoyat qiluvchi ulug' sahobalardan edilar. Abbos roziyallohu anhu 35ta hadis rivoyat qilganlar. Bu kishidan Abdulloh ibn Horis, Omir ibn Sa'd, Ahnaf ibn Qays va bosh¬qalar rivoyat qildilar.\r\n    Abbos roziyallohu anhuning o'nta o'g'li bo'lib, qizlari bo'lmagan. Umrlarining oxirida ko'zlari ojiz bo'lib qoladi. U kishi hijratning 32-yili, Rajab oyining 16-kuni 88 yoshlarida Madinada vafot etdilar. Bu hodisa Usmon roziyallohu anhuning qatl qilinishlaridan ikki yil avval sodir bo'ldi. U kishiga Usmon roziyallohu anhu janoza namozini o'qidilar. Abbos roziyallohu anhu 'Jannatul-Baqiy''¬ga dafn etildilar."
        ]
    },
    {
        "word": "Abvo",
        "type": [],
        "definition": [
            "Abvo – Makka bilan Madina o'rtasidagi qadimgi qishloq. U hozir Makkai Mukarramaning Robig' viloyatiga qaraydi."
        ]
    },
    {
        "word": "Abdol",
        "type": [],
        "definition": [
            "Valiylikning muayyan bir darajasiga erishgan guruh. Keng ma'noda avliyolar va shayxlarni ham anglatadi."
        ]
    },
    {
        "word": "Abdon shirkati",
        "type": [],
        "definition": [
            "Bu xildagi shirkatda har kim o'z hissasi bilan ishtirok etadi. Birovning hissasi ko'p, boshqaniki oz bo'lishi mumkin. Birov shirkat ishida mas'ul, boshqasi mas'ul emas bo'lishi ham mumkin. Ko'proq tarqaladigan shirkat ham shu."
        ]
    },
    {
        "word": "Abdulaziz az-Zaymuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Qosim Abdulaziz ibn Abu Nasr az-Zaymuniy al-Buxoriy - Buxoro ahlidan bo'lib, fozil faqihlardan edilar. Bu kishi Abu Amr Muhammad ibn Muhammad ibn Sobir, Abu Sa'id Xalil ibn Ahmad, Abu Homid Ahmad ibn Abdulloh ac-Soig' va boshqalardan ta'lim olganlar. Abdulaziz ibn Muhammad an-Naxshabiy bu kishidan ta'lim olganlar va 'Mu'jam ush-shuyux' ('Shayxlar qomusi') kitoblarida ustozlari haqida zikr qilganlar. Shofe'iy mazhabidagi bu shayxning eshitgan hadislari sahih edi."
        ]
    },
    {
        "word": "Abdulaziz al-Andalusiy",
        "type": [],
        "definition": [
            "Abul Asbag' Abdulaziz ibn Abdulmalik al-Andalusiy al-Hofiz al-Umaviy olim, fozil, Qur'on va hadis hofizi edilar. Ilm talabida ko'p mamlakatda safarda bo'lganlar. Makkai Mukarramada Abu Sa'id Ahmad ibn Muhammad al-A'robiy; Bag'dodda Abu Ali Ismoil ibn Muhammad as-Saffor, Abu Sahl Ahmad ibn Muhammad al-Qatton; Damashqda Abul Hasan Xaysama ibn Sulaymon at-Tarablusiy va Marvda Abu Ali Husayn ibn Muhammad as-Sag'oniydan ta'lim olganlar. O'zlaridan esa Ahmad ibn Abdulaziz al-Makkiy va Abu Abdulloh Muhammad ibn Abdulloh al-Hofiz hadis rivoyat qilganlar. Bu kishi haqlarida Abu Abdulloh al-Hofiz 'Tarix' kitoblarida aytib o'tganlar. Hijriy 328 (milodiy 941) yildan keyin yana hadis ilmi talabida safarga chiqqanlar. Andalus, Misr, Shom, Kufa, Nishopur, Marv muhaddislaridan ta'lim olganlar. Keyin Buxoroga kelib, Ibn Xanabdan, Kushoniyada Ali ibn Muhtoj va Abu Ya'lo an-Nasafiydan va Shosh ulamolaridan ilm o'rganganlar. So'ngra Buxoroga kelib, bu yerni o'zlariga vatan tutganlar. Buxoro ahlini o'z ilmlaridan bahramand qilganlar. Mag'rib zaminning Qurtuba degan joyida tug'ilib, hijriy 365 (milodiy 976) yilning rajab oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Abdulaziz al-Buxoriy al-Forjiy",
        "type": [],
        "definition": [
            "Abu Ash'as Abdulaziz ibn Abul Horis al-Buxoriy al-Forjiy Buxoro ahlidan. Abu Bakr Muhammad ibn Fazl hamda hokim va imom Abu Ahmad Muhammad ibn Ahmad al-Hofizdan ta'lim olganlar. O'zlaridan esa Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz ta'lim olganlar."
        ]
    },
    {
        "word": "Abdulaziz al-Fazliy",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulaziz ibn Usmon al-Fazliy Buxoroda qozi bo'lib, 'al-Qozi as-sayf' ('Qilichdek o'tkir qozi') nomi bilan tanilgandilar. Fozil va saxiy edilar. Qozilik davrlarida xalq hurmatini qozonganlar. Hijriy 515 (milodiy 1122) yilda haj qilganlar. Hijriy 533 (milodiy 1139) yilning rabi'ul avval oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Abdulaziz al-Halvoiy",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulaziz ibn Ahmad al-Halvoiy - Al-Halvoiy (Halvo pishirib sotib, tirikchilik qilib yurganlari uchun 'al-Halvoiy' degan nisbat berilgan) nisbati bilan mashhurdirlar. Bu kishi Buxoro ahlidan bo'lib, o'z zamonalarining hanafiy mazhabi peshvolaridan, shayx, buyuk muhaddis va fatvo sohibi edilar. Laqablari 'Shams ul-aimma ' (Imomlar quyoshi) edi. Qozi Abu Ali Husayn ibn Xizr an-Nasafiydan fiqhdan, Abu Abdulloh al-G'unjor al-Hofiz al-Buxoriy va Abu Sahl Ahmad ibn Muhammad al-Buxoriydan hadis ilmidan ta'lim olganlar. Abu Bakr ibn Muhammad az-Zaranjariy bu kishining oxirgi shogirdlaridandir. Hijriy 449 (milodiy 1058) yili Keshda olamdan o'tganlar. Tobutlari Buxoroga olib kelinib, Kalobodda (Gulobodda) dafn qilinganlar."
        ]
    },
    {
        "word": "Abdulvahhob az-Zibadvoniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulvahhob ibn Abdulvohid az-Zibadvoniy al-Buxoriy fozil va solih shayxlardan edilar. Abu Amr Usmon ibn Ibrohim al-Fazliydan ta'lim olganlar."
        ]
    },
    {
        "word": "Abdulvohid al-Agʻzuniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Abdulvohid ibn Muhammad al-Ag'zuniy - (Hoshid al-Ag'zuniyning bobolari) islomning peshqadam olim imomlaridan, taba'a-tobeinlardan hisoblanadilar. U kishidan Muhammad ibn Salom al-Paykandiy (Imom al-Buxoriyning ustozlari) va Ka'b ibn Sa'id al-Qozi hadis rivoyat qilganlar. Yetuk muhaddis shogirdlar tayyorlaganlar. Vafotlari hijriy 200 (milodiy 816) yilga to'g'ri keladi."
        ]
    },
    {
        "word": "Abdulvohid al-Varkiy ",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulvohid ibn Abdurahmon al-Varkiy imom, faqih, zohid, uzoq umr ko'rgan va serfarzand olimlardan edilar. Imlo ilmini Abu Zar Ammor ibn Muhammad at-Tamimiy, Ismoil ibn Husayn az-Zohid al-Buxoriy va boshqa olimlardan ta'lim olib, ko'p hadislar rivoyat qilganlar. Dunyoning ko'p joyidan bu kishidan ta'lim olish uchun kelardilar. Hijriy 495 (milodiy 1102) yilda 130 yoshda vafot etganlar. Qabrlari Varka qishlog'ida. Qabrlarini ziyorat qilganman."
        ]
    },
    {
        "word": "Abdulvohid an-Navxasiy",
        "type": [],
        "definition": [
            "Abu Ahmad Abdulvohid ibn Rufayd an-Navxasiy ham Buxoro ahlidan bo'lib, Abu Hafs Ahmad ibn Hafs, Musayyab ibn Is'hoq, Ahmad ibn Junayd va boshqalardan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abdulvohid as-Sarminjiniy",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulvohid ibn Muhammad as-Sarminjiniy Sarminjin nohiyasida imom-xatib edilar. Faqih Abu Bakr Ahmad ibn Muslimdan hadis rivoyat qilganlar. O'zlaridan esa Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abdulkarim al-Andaqiy",
        "type": [],
        "definition": [
            "Abul Muzaffar Abdulkarim ibn Abu Hanifa al-Andaqiy imom, fozil, zohid, taqvodor zot bo'lganlar, kamtarinliklari va chiroyli siyratliklari bilan nom chiqarganlar. Shams ul-aimma (imomlar quyoshi) Abu Muhammad Abdulaziz al-Halvoiydan fiqh va hadis ilmlaridan ta'lim olganlar. Hijriy 400 (milodiy 1010) yilda tug'ilib, hijriy 481 (milodiy 1089) yilning sha'bon oyida vafot etganlar."
        ]
    },
    {
        "word": "Abdulkarim al-Buxoriy al-Migʻiy al-Faqih ",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulkarim ibn Muhammad al-Buxoriy al-Mig'iy al-Faqih Buxoro ahlidan. Bu kishi imom, hanafiy mazhabining ulug', taqvodor imomlaridan bo'lib, muftiy ham edilar. O'z zamonalarida Samarqandda bu kishidan fozil, faqih, taqvodor zot yo'q edi. Eshitgan hadislari sahih edi. Abdulloh ibn Muhammad al-Buxoriy, Muhammad ibn Imron al-Buxoriy va Abul Qosim Hakim as-Samarqandiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Sa'd al-Idrisiy hadis rivoyat qilganlar. Hijriy 378 (milodiy 989) yilning jumodul oxir oyida vafot etganlar."
        ]
    },
    {
        "word": "Abdulkarim al-Kalobodiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Sahl Abdulkarim ibn Abdurahmon al-Kalobodiy al-Buxoriy Buxoroning Kalobod mahallasidan. Abu Bakr Ahmad ibn Sa'd az-Zohid va Abu Solih Xalaf ibn Muhammad al-Xayyomdan ta'lim olganlar. Rivoyat qilgan hadislari sahihdir. Bu kishidan ko'p olim ta'lim olgan. Bu zot haqlarida Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz 'Mu'jam ush-shuyux' ('Shayxlar qomusi') kitoblarida zikr qilganlar."
        ]
    },
    {
        "word": "Abdulloh ad-Daxfanduniy",
        "type": [],
        "definition": [
            "Abu Ibrohim Abdulloh ibn Xanja ad-Daxfanduniy - Buxoroning Daxfandun nomli qishlog'idan. Laqablari 'Jamuk' edi. Laqabni bu kishiga onalari berganlar. Abu Huzayfa Is'hoq ibn Bishr, Ahmad ibn Hafs, Muhammad ibn Salom va Abu Ja'far al-Musnadiydan hadis rivoyat qilganlar. U kishidan esa Abu Muhammad Abdulloh ibn Muhammad al-Adib va Muhammad ibn Sobir al-Buxoriy hadis rivoyat qilganlar. Hijriy 273 (milodiy 887) yilda vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh az-Zarriy",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulloh ibn Muhammad az-Zarriy asli raylik bo'lib, Buxoroda yashab, shu yerda vafot etganlar. Ko'p hadis rivoyat qilganlar. Odam ibn Muso al-Xoriy va Abul Abbos Ahmad ibn Ja'far ar-Roziy al-Jamoldan hadis rivoyat qilganlar. O'zlaridan esa Xoja G'unjor, Abu Abdulloh al-Mustag'firiy va Abu Abdulloh al-Hofiz al-Hokim hadis rivoyat qilganlar. Hijriy 374 (milodiy 985) yilning safar oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh al-Bonabiy",
        "type": [],
        "definition": [
            "Abu Tolib Abdulloh ibn Vaki' al-Bonabiy - Buxorodagi Bonab qishlog'ining muhaddis olimlaridan. Bu zot Imom al-Buxoriyning shayxlaridan ta'lim olgan."
        ]
    },
    {
        "word": "Abdulloh al-Budayliy",
        "type": [],
        "definition": [
            "Abu Bakr Abdulloh ibn Muhammad ibn Budayl al-Budayliy – buxorolik fiqhshunos va o'z asrining hanafiy mazhabidagi peshqadam shayxi. Bu kishi yoddan ko'p hadis bilar edilar. Buxoroda Abu Abdurahmon ibn Abu Lays, Marvda Abdulloh ibn Mahmud as-Sa'diy va Rayda Ahmad ibn Ja'far ibn Nasrdan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abu Abdulloh al-Hofiz al-Hokim ta'lim olganlar. Hijriy 343 (milodiy 955) yilda vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh al-Burnamadiy ",
        "type": [],
        "definition": [
            "Abu Ahmad Abdulloh ibn Abdurahmon al-Burnamadiy Ali ibn Nu'mon al-Kabuzanjakatiy bu kishidan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abdulloh al-Buxoriy al-Bofiy ",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulloh ibn Muhammad al-Buxoriy al-Bofiy Asli buxorolik bo'lib, 'al-Bofiy' nomi bilan tanilganlar. Bag'dodda yashaganlar. Shofe'iy mazhabining faqihlaridan. Nahv va sarf ilmi bilimdoni, arab tili va adabiyotni yaxshi bilardilar. Chiroyli so'zlovchi (balig' al-ibora), hozirjavob (hozir al-badiha) edilar. Kitoblar yozar va qiynalmasdan darhol she'rlar to'qirdilar. Bir kuni do'stlari u kishini ko'rish uchun kelganda uylarida yegulik hech narsa bo'lmagan. Shunda unga qarata o'sha zahoti she'r to'qiganlar. Hijriy 398 (milodiy 1008) yilning muharram oyida vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh al-Buxoriy as-Sibadmuniy",
        "type": [],
        "definition": [
            "Faqih Abu Muhammad Abdulloh ibn Muhammad al-Kalobodiy al-Buxoriy as-Sibadmuniy Buxoroning Sibadmun nomli qishlog'idan bo'lib, 'Ustoz' nomi bilan tanilgan edilar. 'Ustoz' – bu kishiga berilgan laqabdir. Ko'p hadis biluvchi va shayx edilar. Xuroson, Iroq, Hijozda bo'lib, u yerdagi mashoyixlardan ta'lim olganlar. Bu kishi buyuk amir Ismoil ibn Ahmad as-Somoniyning 'Dor as-sulton'ida (saroyida) faqih edilar. Saroy ahli bu kishidan ko'p maslahat olardilar. Bergan maslahatlari biror marta xato bo'lmaganligi uchun 'Ustoz' deb tanilganlar. Bu kishidan Ali ibn Muso Alqamiy 'Ahkom al-Qur'on' (Qur'on hukmlari) kitoblarida, Abu Bakr al-Munkadiriy va Abul Abbos ibn Uqda al-Hofiz hadis rivoyat qilganlar. Abdulloh as-Sibadmuniy hijriy 258 (milodiy 873) yilning rabi'ul oxir oyida chorshanba kuni kechasi tavallud topib, hijriy 340 (milodiy 952) yil shavvol oyining beshinchisida juma kuni kechasi Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh al-Vanufaxiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Harra Abdulloh ibn Ofiya al-Vanufaxiy al-Buxoriy Muxtor ibn Sobiq al-Hanzaliydan hadis rivoyat qilganlar. O'zlaridan esa Abul Hasan Ali ibn Hasan al-Kindiy hadis rivoyat qilganlar. Hijriy 280 (milodiy 894) yilda vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh al-Juʼfiy",
        "type": [],
        "definition": [
            "Abu Ja'far Abdulloh ibn Muhammad al-Ju'fiy Buxoro ahlidan bo'lib, 'al-Musnadiy' taxallusi bilan ma'lum va mashhur edilar. Yoshliklaridan qaysi hadisni o'qisalar, uning sanadini so'rab surishtirganlari uchun 'al-Musnadiy' taxallusini olganlar. Bu kishi Buxoroning muhaddis olimlaridan."
        ]
    },
    {
        "word": "Abdulloh al-Kufiniy al-Hokim",
        "type": [],
        "definition": [
            "Imom Abu Muhammad Abdulloh ibn Muhammad al-Kufiniy al-Hokim faqih va fozil edilar. Bu kishidan imom Abu Muhammad Abdurahmon ibn Ahmad al-Karminiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abdulloh al-Mijduniy al-Muazzin",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulloh ibn Muhammad al-Mijduniy al-Muazzin Buxoroning Kalobod (Gulobod) mahallasida yashardilar. Bu kishi Surdun qishlog'ining muazzini deb tanilgan bo'lib, fozil shayx edilar. Abdulloh Sibadmuniyning shogirdlaridan. Bu kishidan Abu Abdulloh ibn Ahmad al-Hofiz al-G'unjor hadis rivoyat qilganlar. Bu kishi haqlarida Abu Komil al-Basiriy 'al-Muzohot val-muzofot' kitoblarida ma'lumot berganlar."
        ]
    },
    {
        "word": "Abdulloh al-Musnadiy al-Juʼfiy",
        "type": [],
        "definition": [
            "Abu Ja'far Abdulloh ibn Muhammad al-Musnadiy al-Ju'fiy Buxoro ahlidan. Bu kishi har bir hadisning sanadini so'rar edilar. Hadislarning sanadini ko'p so'raganlaridan bu kishiga 'al-Musnadiy' deb nisbat berilgan. Ko'plab muhaddislardan hadis rivoyat qilganlar. O'zlaridan esa Imom al-Buxoriy, Abu Zur'a ar-Roziy, Abu Hotam ar-Roziy, Ahmad ibn Sayyor va Muhammad ibn Nasr al-Marvaziy hadis rivoyat qilganlar. Al-Musnadiy hijriy 229 (milodiy 845) yili zulqa'da oyiga 6 kun qolganda, payshanba kuni vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh al-Xayroxariy ",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulloh ibn Fazl al-Xayroxariy Buxoroning Xayroxari nomli qishlog'idan bo'lib, ushbu nisbat bilan mashhurdirlar. Bu kishi Buxoroda muftiy bo'lganlar. Buxorodagi Masjidi Kalon jome' masjidida imom-xatiblik qilganlar. Shayxlarning xizmatlarini bajo etib, ularning duolarini olganlar. Shuning sharofatidan Buxoroning eng ko'zga ko'ringan olimi, muhaddis, fiqh ilmi bo'yicha mudarris, xushxat xattot va imom bo'lganlar."
        ]
    },
    {
        "word": "Abdulloh al-Xorazmiy al-Hazorasbiy",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulloh ibn Muhammad al-Xorazmiy al-Hazorasbiy Xorazm ahlidan bo'lib, Farabrda yashaganlar. Abu Lays Ubayduloh ibn Surayj va Abu Abdulloh ibn Abu Hafsdan hadis rivoyat qilganlar. O'zlaridan esa Abu Nasr Ahmad ibn Sahl al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abdulloh an-Nahliy ",
        "type": [],
        "definition": [
            "Abu Abdurahmon Abdulloh ibn Manih an-Nahliy Buxoro ahlidan bo'lib, otalaridan hamda Abu Abdulloh ibn Abu Hafs, Abu Tohir Mahdiy ibn Ishkob va Sa'id ibn Mas'uddan hadis rivoyat qilganlar. Hijriy 317 (milodiy 930) yilning muharram oyida vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh at-Tahmoniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abdulloh ibn Ubaydulloh ash-Shayboniy at-Tahmoniy al-Buxoriy Buxoro ahlidan bo'lib, katta bobolariga 'at-Tahmoniy' deb nisbat berilgan. Ilm talabida Iroq, Hijoz, Misr, Shom, Jazoir va Xurosonning shaharlariga borganlar. Adolatli, to'g'ri so'z imom bo'lganlar. Ko'p kitob ta'lif qilganlar. Otalaridan hamda Abdulloh ibn Abdurahmon ad-Dorimiy, Ahmad ibn Nasr al-Atakiy, Abu Abdulloh ibn Abu Hafs va Abd ibn Humayd al-Keshiydan hadis rivoyat qilganlar. Bu kishi – 'at-Tasonif al-hison' ('Hasan hadislar tasnifi') kitobining muallifi. O'zlaridan Abu Nasr Ahmad ibn Muhammad al-Bohiliy al-Varroq, Abul Abbos Ja'far ibn Muhammad an-Nasafiy va Abu Amr Muhammad ibn Muhammad ibn Sobir al-Buxoriy hadis rivoyat qilganlar. Hijriy 307 (milodiy 920) yilda jumodul oxir oyiga 8 kun qolganda, juma kuni Samarqandda vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh ash-Sharafdaniy",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulloh ibn Muhammad ash-Sharafdaniy Buxoroning Sharafdan qishlog'idan bo'lib, bu nisbat bilan mashhur edilar. Sahl ibn Mutavakkil, Solih ibn Muhammad va Abu Bakr ibn Huraysdan hadis rivoyat qilganlar. Hijriy 346 (milodiy 958) yilning rabi'ul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh ibn Abbos",
        "type": [],
        "definition": [
            "Abdulloh ibn Abbos - ismlari Abdulloh, otalari Abbos ibn Abdulmuttolib, onalari Ummu fazl Luboba binti Horis. Hijratdan uch yil oldin Quraysh mushriklari Rasululloh sollallohu alayhi vasallam va musulmonlarni Makka tog'larida moddiy va ma'naviy qamalda ushlab turgan bir paytda dunyo¬ga keldilar. Rasululloh sollallohu alayhi vasallam: 'Ey Robbim, Abdulloh ibn Abbosga hikmatni o'rgatgin', deb duo qilganlar. Ibn Abbos ham Rasululloh sollallohu alayhi vasallamning o'zlarining haqlariga ko'p duo qilayotganlarini ko'rgach, ilm uchun tug'ilganlarini angladilar va ilm o'rganishga kirishdilar. Yosh bo'lishlariga qaramay, ko'p oyat va hadislarni yod oldilar.\r\n    Kishilar Rasululloh sollallohu alayhi vasallamning: 'Ibn Abbos ushbu ummatning ilm dengizidir', degan so'zlariga keyinroq shohid bo'ldilar.\r\n    Rasululloh sollallohu alayhi vasallam vafot etganlarida Ibn Abbos o'n uch yoshda edilar. U zot agar hadis yodlagan kishini bilib qolsalar, darhol o'sha odamning uyida paydo bo'lar edilar.\r\nUbaydulloh ibn Abdulloh aytadilar: 'Ibn Abbos insonlardan ko'p xislatlarda o'zib ketdi. Ilm¬da u kishiga yetadigani yo'q edi. Fiqhda doimo u kishining fikriga suyanilar edi. Halimlikda va nasabda hech kim u zotga teng kela olmas edi. Rasululloh sollallohu alayhi vasallamning hadislarini u kishidan yaxshi biladigan yoki xalifalarning qozilik ishlarini u kishidan ko'ra yaxshiroq anglaydigan kishi topilmas edi'.\r\n    Ibn Abbos nafaqat hadis ilmi, balki Qur'on, fiqh, arab she'rlari ta'villaridan ham voqif edilar. U kishining eshiklari doimo ilm istab keluvchilar bilan gavjum bo'lgan.\r\nIbn Abbos 1660ta hadis rivoyat qilib, ko'p hadis rivoyat qiluvchi sahobalarning beshinchisi bo'lganlar.\r\nIbn Abbos hijratning 68-yili 71 yoshlarida vafot etdilar."
        ]
    },
    {
        "word": "Abdulloh ibn Abu Avfo",
        "type": [],
        "definition": [
            "Abdulloh ibn Abu Avfo roziyallohu anhuning kunyalari Abu Muoviyadir. Bu zot Hudaybiya sul¬hi, Rizvon bay'ati, Xaybar g'azoti va bundan boshqa ma'rakalarda ishtirok etdilar.\r\n    Rasululloh sollallohu alayhi vasallam vafot etgunlaricha Madinada yashadilar. U zot sollallohu alayhi vasallamning vafotlaridan so'ng Kufaga ko'chib o'tib, ana shu yerda istiqomat qildilar.\r\n    Bu zotning Rasululloh sollallohu alayhi vasallamdan rivoyat qilgan hadislarini Ismoil ibn Abu Xolid, Abdulmalik ibn Umayr, Saoma ibn Kuhayl, Sha'biy, Abu Is'hoq, Shayboniylar rivoyat qildilar.\r\n    Abdulloh ibn Abu Avfo roziyallohu anhu hijratning 86-yili Kufada vafot topdilar."
        ]
    },
    {
        "word": "Abdulloh ibn Amr",
        "type": [],
        "definition": [
            "Abdulloh ibn Amr ibn Oss taqvo va zuhdlari bilan mashhur sahobalardan edilar. U kishi otalari Amr ibn Ossdan avval Islomga kirdilar. Abdulloh ibn Amr Rasululloh sollallohu alayhi vasallamning suhbatlarida bardavom bo'lib, u zotga nozil bo'layotgan oyatlarni yodlabgina qolmay, yozib ham olar edilar.\r\n    Bir kuni Rasululloh sollallohu alayhi vasallam Abdulloh ibn Amrga: 'Seni kunduzlarni ro'za tutib, kechalarni namoz o'qib va Qur'onni xatm qilib o'tkazishingdan xabarim bor. Umring uza¬yib, yoshing ulg'ayib, bularga toqat qilolmay qolishingdan qo'rqaman. Oyda uch kun ro'za tut, bir marta Qur'onni xatm qil', dedilar. Abdulloh:\r\n    'Ey Rasululloh, bundan ham ko'prog'iga qudratim yetadi', dedi. Rasululloh sollallohu alayhi vasallam:\r\n    'Bo'lmasa, haftada ikki kun ro'za tutib, Qur'onni o'n kun¬¬da bir xatm qil', dedilar. Abdulloh:\r\n    'Bundan ham ziyodasiga qurbim yetadi', dedi.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Unda ro'zadorlarning sayyidi Dovud alayhissalom ro'za tutganidek ro'za tut. U kishi bir kun ro'za tutib, bir kun tutmasdilar. Har uch kunda Qur'onni xatm qil', dedilar.\r\n    Abdulloh ibn Amr yoshlari o'tib qolganiga qaramay bu amallarida bardavom qoldilar.\r\n    Abdulloh ibn Amr Rasululloh sollallohu alay¬hi vasallamdan mingga yaqin hadis rivoyat qilganlar. Bu kishi rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar. Abu Hurayra roziyallohu anhu: 'Rasululloh sollal¬lohu alayhi vasallamdan hadis rivoyat qilishda mendan Abdulloh ibn Amr o'zib ketdi', der edilar.\r\n    Abdulloh ibn Amr hijratning 93-yili vafot etdilar."
        ]
    },
    {
        "word": "Abdulloh ibn as-Sanobihiy",
        "type": [],
        "definition": [
            "Abdulloh ibn as-Sanobihiy ulug' tobe'inlardan edilar.\r\n    Abu Umar aytadilar:\r\n    'Bu kishi Abu Abdulloh as-Sanobihiy bo'lib, asl ismlari Abdurrahmon ibn Usayladir. Bu zot Rasululloh bilan ko'rishmaganlar. Yo'lda Payg'ambarimizning ziyoratlariga ketayotganlarida Rasululloh sollallohu alayhi vasallam vafot etgan edilar'.\r\n    Abdulloh ibn as-Sanobihiy Rasululloh sollallohu alayhi vasallamdan bir necha hadislar rivoyat qildilar. Bu kishi rivoyat qilgan hadislardan ba'zilarini uch 'Sahih' sohiblari o'z kitoblariga kiritganlar."
        ]
    },
    {
        "word": "Abdulloh ibn Busr",
        "type": [],
        "definition": [
            "Abdulloh ibn Busr al-Mozaniy, kunyalari Abu Safvon, ikki qiblaga yuzlanib namoz o'qigan sahobalardan.\r\n    Bu kishining otalari, onalari hamda akalari Atiyya, singillari Samo'lar Rasululloh sollallohu alayhi vasallamning suhbatlarida bo'lishgan. Rasululloh sollallohu alayhi vasallam muborak qo'llarini         Abdulloh ibn Busrning boshlariga qo'yib, umrlari uzoq bo'lishini tilab, duo qilgan edilar. Haqiqatda bu kishi uzoq umr ko'rdilar. Rasululloh sollallohu alayhi vasallamdan hammasi bo'lib 50ta hadis rivoyat qilganlar.\r\n    Bu kishidan Abu Zohiyriyya, Xolid ibn Ma'dan, Solim ibn Omir, Muhammad ibn Abdurrahmon ibn Avf, Hasan ibn Ayyub va boshqalar rivoyat qilganlar.\r\n    Abdulloh ibn Busr roziyallohu anhu hijratning 88-yili, 95 yoshlarida Himsda vafot etdilar. U kishi o'sha yerda vafot topgan oxirgi sahoba edilar."
        ]
    },
    {
        "word": "Abdulloh ibn Buhayna",
        "type": [],
        "definition": [
            "Abdulloh ibn Molik ibn Buhayna, kunyalari Abu Muhammad, Onalari Buhayna binti Horis ibn Muttalib. Otalari Molik ibn Hishom Azdumanda qabilasidan. Bu zot umr bo'yi ro'za tutgan fozil kishilardan edilar. Muttalib Abdumanof qabilasining boshliqlaridan bo'lganlar.\r\n    Abdulloh ibn Buhayna Rasululloh sollallohu alayhi vasallamning suhbatlarida bo'ldilar va ulardan bir nechta hadislar rivoyat qildilar. Madinadan 30 mil uzoqlikda bo'lgan 'Batnu riym' degan joyda istiqomat qildilar."
        ]
    },
    {
        "word": "Abdulloh ibn Jaʼfar",
        "type": [],
        "definition": [
            "Abdulloh ibn Ja'far ibn Abu Tolib ibn Abdulmuttolib ibn Hoshim al-Qurashiy, onalari Asmo binti Umays. Otalari va onalari Habashis¬tonga hijrat qilganlarida Habashiston yerida birinchi Islomda tug'ilgan bola Abdulloh ibn Ja'far bo'ldilar.\r\n    Musulmonlar Madinaga hijrat qilganlarida Abdulloh ham otalari bilan hijrat qildilar. Bu zot Ali bilan Muoviya o'rtalarida bo'lgan Siffiyn jangida Hazrati Ali askarlari ustidan boshliq bo'ldilar. Abdulloh ibn Ja'far halim va saxiy zotlardan bo'lganlari uchun 'saxiylar dengizi' degan nom olgan edilar.\r\n    U kishi Rasululloh sollallohu alayhi vasallamdan ko'p hadislar rivoyat qildilar. Onalari Asmo va amakilari Ali ibn Abu Toliblardan ham rivoyat qildilar.\r\n    Bu zotdan Ismoil, Is'hoq, Muoviya, Muhammad ibn Ali ibn Husayn, Qosim ibn Muhammad, Urva ibn Zubayr va boshqalar rivoyat qilganlar. Bu kishi rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Abdulloh ibn Ja'far hijratning 80-sanasida (milodiy 700 yil) 92 yoshlarida Madinada vafot etdilar. Janoza namozini Madina amiri Molik ibn Marvon o'qidilar."
        ]
    },
    {
        "word": "Abdulloh ibn Zayd",
        "type": [],
        "definition": [
            "Abdulloh ibn Zayd ibn Osim ibn Ka'b Najjoriy al-Ansoriy. Kunyalari Abu Muhammad bo'lib 616-683 milodiy yillarda yashab o'tganlar. Bu zot Badr, Uhud va boshqa hamma g'azotlarda ishtirok etdilar.\r\n    Abdullohning inilari Habib ibn Zaydni Musaylamatul Kazzob qatl etib, a'zolarini burda-burda qilib tashlaganini yuqoriroqda aytib o'tgan edik. Bundan xabar topgan Abdulloh qasos olishni niyat qiladilar. Alloh taolo bu kishini niyatlariga Vahshiy ismli sahoba yordamida muvaffaq qildi. Ular bir vaqtda, bir-birlaridan xabarsiz, biri nayza, biri qilich bilan hujum qilib, Musaylamatul Kazzobni qatl etadilar.\r\n    Bu zot hammasi bo'lib 48ta hadis rivoyat qilganlar. Ularning ichida tahoratga taalluqlilari ko'pchilikni tashkil etgan.\r\n    Abdulloh ibn Zayd hijratning 63-sanasida, 70 yoshga kirib, Yaziyd ibn Muoviya davridagi 'Harra' voqeasida vafot etganlar."
        ]
    },
    {
        "word": "Abdulloh ibn Zamʼa",
        "type": [],
        "definition": [
            "Abdulloh ibn Zam'a ibn Asvad ibn Muttallib ibn Asad ibn Abdul Uzzo ibn Qusay al-Qurashiy al-Asadiy. U kishining onalari Qurayba bintu Abu Umayya ibn Mug'iyra, ya'ni Ummu Salama roziyallohu anho onamizning singillari bo'lgan.\r\n    U kishi Payg'ambarimiz sollallohu alayhi vasallamga yaqin, Qurayshning obro'li shaxslaridan edilar. Bu zot hadislarni Rasululloh sollallohu alayhi vasallam va Ummu Salama onamizdan rivoyat qiladilar.\r\n    Abdulloh ibn Zam'a roziyallohu anhu 'Yavmud Dor' kunida Usmon roziyallohu anhu bilan birga shahid bo'ldilar."
        ]
    },
    {
        "word": "Abdulloh ibn Zubayr",
        "type": [],
        "definition": [
            "Abdulloh ibn Zubayr ibn Avvom Qurayshiy al-Asadiy, kunyalari Abu Bakr. Onalari Asmo binti Abu Bakr.\r\n    Bu zot hijratdan keyin Madinada birinchi tug'ilgan bola edilar. Rasululloh sollallohu alayhi vasallam vafot etganlarida to'qqiz yoshda edilar.\r\n    Hammasi bo'lib 33ta hadis rivoyat qildilar. Bu hadislarni otalaridan, bobolari Abu Bakr Siddiq, xolalari Oisha onamiz, Umar, Usmon, Ali roziyallohu anhumlardan rivoyat qildilar. Usmon roziyallohu anhuning xalifalik davrlarida Afrikani fath etishda ishtirok etdilar.\r\n    Hijratning 64-yili Yaziyd ibn Muoviya vafot etganda bu zotga xalifa bo'lishlari uchun bay'at berildi. Mana shu davrda Misr, Hijoz, Yaman, Xuroson, Iroq, Shomning ba'zi joylariga hukmdor bo'ldilar.\r\n    Hijratning 73-yili Abdulmalik ibn Marvon davrlarida bu zot bilan Hajjoj oralarida shiddatli janglar bo'lib o'tdi. Bu urush Abdulloh ibn Zubayr roziyallohu anhuning o'limlari bilan nihoyasiga yetdi.\r\n    Abdulloh ibn Zubayrning xalifaliklari to'qqiz yil davom etib, shu davr mobaynida birinchi bo'lib dirhamni joriy etdilar. Ushbu dirhamning bir tarafiga 'Muhammadur Rasululloh', ikkinchi tarafiga 'Amrullohi bilvafo val adl' degan yozuvlar bitilgan edi."
        ]
    },
    {
        "word": "Abdulloh ibn Qays",
        "type": [],
        "definition": [
            "Abdulloh ibn Qays ibn Ikrima ibn Muttalib. Bu zot hadislarni Rasululloh sollallohu alayhi vasallam va Oisha onamiz roziyallohu anhodan rivoyat qildilar."
        ]
    },
    {
        "word": "Abdulloh ibn Masʼud",
        "type": [],
        "definition": [
            "Abdulloh ibn Mas'ud ibn G'ofil al-Xuzamiy, kunyalari Abu Abdurahmon. Bu kishi Islomga oltinchi bo'lib kirgan bo'lib, ikki hijrat – Habashiston va Madina hijratlari sohibidirlar. Rasululloh sollallohu alayhi vasallamga xizmat qilgan safdoshlardan, jannatga kirishi bashorat qilingan o'nta sahobaning biridirlar. Badr urushida Abu Jahlni qatl etganlar. Uhud, Xandaq, Rizvon bay'ati, Yarmuk ma'rakasi va bundan boshqa hamma jang¬larda ishtirok etganlar. Makkada birinchi bo'lib Qur'oni Karimni baland ovoz bilan o'qigan, Qur'oni Karimni yod olganlardan biri, taqvodor, chiroyli xulqli, faqih sahobalardan.\r\n    Bu zot hammasi bo'lib Rasululloh sollallohu alayhi vasallamdan 848ta hadis rivoyat qiladilar. U zotdan Abdulloh ibn Umar, Abdulloh ibn Abbos, Abu Muso Ash'ariy, Imron ibn Husoyn, Abu Hurayra, Ibn Zubayr, Jobir, Anas, Abu Sa'iyd, Abu Rofi' va boshqalar rivoyat qilishgan. Tobe'iynlardan Alqama, Abu Voil, Asvad, Masruq, Ubayda, Ibn Hozim, Qays va boshqalar rivoyat qilishgan. U zot to'plagan hadislardan uchta 'Sahih' sohiblari o'z kitoblariga kiritishgan.\r\n    Rasululloh sollallohu alayhi vasallam mar¬hamat qiladilar:\r\n    'Qur'oni Karimni to'rt kishidan olinglar'.\r\n    Shularning biri Abdulloh ibn Mas'uddir.\r\n    Ibn Mas'ud bo'ylari qisqa, a'zolari nozik kishi edilar. Bir kuni sahobalar u kishining a'zolari nozikligini mazax qilishganda, Rasululloh sollallohu alayhi vasallam: 'Allohga qasamki, Ibn Mas'udning a'zolari qiyomat kunining tarozusida Uhud tog'idan ham og'irroqdir', deb marhamat qilganlar.\r\n    U kishi xushbo'y narsalarni yaxshi ko'rib, ko'p iste'mol qilar edilar. Ko'chadan o'tsalar, qo'shnilari bu yerdan Ibn Mas'ud yurganini bilar edi.\r\n    Ibn Mas'ud kasal bo'lib yotganlarida xalifa Usmon ibn Affon roziyallohu anhu ziyoratlariga kelib, u kishidan 'Nimadan shikoyating bor?' deb so'raganlarida 'Gunohlarimdan', deb javob berdilar.\r\n    Xalifa: 'Nima xohlaysan?' deb so'radilar. Shunda u kishi 'Robbimning rahmatini' dedilar.\r\n    Xalifa 'Tabib buyuraymi?' deganlarida 'Meni tabibning O'zi kasal qildi', dedilar. 'Unda hojatingga kerakli biror narsa buyuraymi?' deganlarida 'U narsaga hojatim yo'qdir', dedilar.\r\n    Shunda xalifa 'Qizlaring uchun kerak bo'lib qolar', dedilar. Ibn Mas'ud: 'Qizlarim kambag'al bo'lib qolishidan qo'rqasanmi? Men ularga har kechada 'Voqe'a' surasini o'qishni buyurganman. Chunki men Rasululloh sollallohu alayhi vasallamning: 'Qaysi bir kishi har kechada Voqe'a surasini o'qisa, unga abadiy kambag'allik yetmaydi', deganlarini eshitganman.\r\n    U kishi Rasululloh sollallohu alayhi vasallam vafotlaridan keyin Kufadagi Baytulmolga voliy bo'ldilar. Usmon ibn Affonning xalifalik davrlarida Madinaga keldilar va hijratning 32-yili shu yerda vafot etdilar. Usmon ibn Affon roziyallohu anhu janoza namozini o'qidilar va 'Baqiy'' qabristoniga dafn etildilar."
        ]
    },
    {
        "word": "Abdulloh ibn Mugʻaffal",
        "type": [],
        "definition": [
            "Abdulloh ibn Mug'affal al-Muzaniy roziyallohu anhu Madinada istiqomat qildilar. Umar ibn Xattob xalifalik davrlarida Basraga Islomdan dars berish uchun o'n nafar sahobani yuboradilar, ularning orasida Abdulloh ibn Mug'affal ham bor edilar.\r\n    Bu zot hammasi bo'lib 43ta hadis rivoyat qildilar. Bu kishidan Abdulloh ibn Burayda, Abu Muammar, Abdulvoris, Husaynul Muallimlar rivoyat qilganlar. Bu zot rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Abdulloh ibn Mug'affal roziyallohu anhu hijratning 57-sanasida Basrada vafot etdilar."
        ]
    },
    {
        "word": "Abdulloh ibn Salom",
        "type": [],
        "definition": [
            "Abdulloh ibn Salom ibn Horis Ansoriy al-Xazrajiy, kunyalari Abu Yusuf. Sulolalari Yusuf ibn Ya'qub ibn Is'hoqqa yetib boradi. Bu kishining ismlari johiliyatda Husayn bo'lib, Rasululloh sollallohu alayhi vasallam uni Abdulloh deb o'zgartiradilar.\r\n    Rasululloh sollallohu alayhi vasallam Madinaga borganlarida Abdulloh ibn Salom avvalgilardan bo'lib Islomga kirganlar. Bu zot sha'nlariga Qur'onning Ra'd va Ahqof suralarida oyat nozil bo'lgan.\r\n    Buyuk mufassirlardan imom Ibn Kasir o'z tafsirlarida imom Buxoriy, Muslim va Nasaiylarning imom Molikdan qilgan rivoyatlarini keltirib, Rasululloh sollallohu alayhi vasallamning Abdulloh ibn Salomdan boshqa yer yuzida yurgan biror kishi haqida 'Albatta, u ahli jannatdan', deganlarini eshitmadim', deb aytadilar.\r\n    Abdulloh ibn Salom Rasululloh sollallohu alayhi vasallamdan hammasi bo'lib 25ta hadis rivoyat qilganlar.\r\n    Bu zotdan o'g'illari Yusuf va Muhammad, buyuk sahobalardan Abu Hurayra, Anas ibn Molik, Zirora ibn Avf va tobe'inlardan ham bir nechalari rivoyat qilganlar.\r\n    Abdulloh ibn Salom Umar ibn Xattob bilan birga Baytul Maqdis va Josiyani fath etishda ishtirok etdilar.\r\n    Ali roziyallohu anhu bilan Muoviya ibn Abu Sufyon roziyallohu anhular o'rtasida bo'lgan fitnalarda taxtadan qilich qilib olib, bu fitnalarning barchasidan chetlandilar. Vafot etgunlariga qadar Madinada istiqomat qildilar. Hijratning 43-yili olamdan ko'z yumdilar."
        ]
    },
    {
        "word": "Abdulloh ibn Sarjis",
        "type": [],
        "definition": [
            "Abdulloh ibn Sarjis al-Muzaniy Bani Maxzum qabilasining boshliqlaridandir.\r\n    Imom Buxoriy va Ibn Hibbon aytadilar:\r\n    'Abdulloh ibn Sarjis roziyallohu anhu Rasululloh sollallohu alayhi vasallamning suhbatlarida bo'lganlar va Rasulullohdan ko'p hadislar rivoyat qilganlar'.\r\n    Bu hadislarni Muslim va boshqa imomlarning kitoblaridan topish mumkin.\r\n    Abdulloh ibn Sarjis hadislarni Umar ibn Xattob, Abu Hurayralardan ham rivoyat qilganlar.\r\n    Bu zotdan Qatoda, Osim al-Ahval, Usmon ibn Hakim, Muslim ibn Maryam va boshqalar rivoyat qildilar."
        ]
    },
    {
        "word": "Abdulloh ibn Solih",
        "type": [],
        "definition": [
            "Abdulloh ibn Solih – imom Buxoriyning shayxlaridan biri. Buxoriy bu yerda ushbu hadisni ustozi Abdulloh ibn Solihdan ham eshitganini, faqat u 'va' bog'lovchisi bilan rivoyat qilganini aytib o'tmoqda."
        ]
    },
    {
        "word": "Abdulloh ibn Umar",
        "type": [],
        "definition": [
            "Abdulloh ibn Umar - ismlari Abdulloh, kunyalari Abu Abdurahmon, otalari Umar ibn Xattob, onalari Zaynab binti Maz'undir. Abdulloh ibn Umar hali balog'at yoshiga yetmay, otalari bilan Makkada Islomga kirdilar. Badr va Uhud janglarida qatnashish uchun Rasululloh sollallohu alayhi vasallamdan ruxsat so'raganlarida, yoshlari kichik bo'lganligi sababli ruxsat bermadilar. Lekin Xandaq jangiga chiqqanlar. Ana shu vaqtda Ibn Umarning yoshlari hali o'n beshdan o'tmagan edi. Otalari bilan birga Madiynaga hijrat qildilar. Yoshlari yigirmaga yetganda Makkani fath etishda ishtirok etdilar.\r\n    Abdulloh ibn Umar yoshlik vaqtlaridan taqvodor, iffatli edilar. U kishini Quraysh yoshlari ichida, nafsiga molik kishilardan, deb tanishardi. Kishilar orasida saxiylik va rostgo'ylik bilan ham mashhur edilar. Alloh yo'lida haqdorlar uchun bir kunda yuzta tuyani in'om etganlari rivoyatlarda keladi. Doimo yetim va miskinlar bilan birga ovqatlanib yurar, agar biror ma'raka qiladigan bo'lsalar, unga faqat yetim va kambag'allarni taklif qilar edilar. Albatta, bu saxiyliklari faxr yoki maqtov uchun emas, balki Alloh yo'lida bo'lar edi. Abdulloh ibn Umar zohidlardan edilar. Dunyoga moyil ham bo'lmas va unga ortiqcha harakat ham qilmas edilar, balki undan badanlarini to'sgudek ki-yimni, egilgan bellari to'g'ri bo'lgudek taomni umid qilar edilar, xolos.\r\n    Ibn Umar kechalari ko'p namoz o'qib, doim Qur'on tilovat qilib, Allohni ko'p zikr qilardilar. Agar ogohlantiruvchi, qo'rqituvchi oyat eshitsalar, ko'zlariga yosh yomg'ir kabi quyilib kelardi. Ibn Umar kechasining ko'p qismida namoz o'qib chiqar edilar. Tong saharlarda esa istig'for aytib, yig'lab chiqar edilar.\r\n    Ulug' zotlardan Tovus rahmatullohi alayhi: 'Ibn Umardan ko'ra taqvoli, Ibn Abbosdan ko'ra biluvchiroq kishini ko'rmadim', deydi.\r\n    'Lan tanaalul birro xattaa tunfiquu mimmaa tuhibbun' ('Yaxshi ko'rgan narsalaringizdan infoq qilmaguningizcha yaxshilikka erisha olmaysizlar') oyati karimasi nozil bo'lganida Ibn Umar Rumaysa ismli cho'rilarini Alloh yo'lida ozod qildilar va: 'Allohga qasamki, dunyoda eng yaxshi ko'rgan kishim sensan, ozodsan, ketaver', deb aytdilar.\r\n    Ulug' zotlardan Nofe' aytadilar: 'Agar Ibn Umarga dunyo ishlaridan biror narsa og'ir kelib qolsa, Robbilariga yaqin bo'lar edilar'.\r\n    Jobir ibn Abdulloh roziyallohu anhu aytadilar:\r\n    'Abdulloh ibn Umardan boshqa molu dunyoga moyil bo'lib ketmagan biror kishini ko'rmadik'.\r\n    Kishilar aytishar edi: 'Abdulloh ibn Umarning zohidliklari otalaridan meros edi. Shuningdek, diyn ta'limotlarini ham otalaridek kasb qilgan edilar. Har bir ishda Rasululloh sollallohu alayhi vasallamga va otalariga ergashar edilar. U zotning qalblari behojatlik bilan to'lgan edi. Aqllari oliy darajada, ruhlari esa pok edi. Agar huzurlarida Rasululloh sollallohu alayhi vasallam zikr qilinsalar, u zotga bo'lgan muhabbatlaridan ko'zlari yoshga to'lar edi'.\r\n    Ibn Umarda ulamolarga xos bo'lgan bir xislat bor edi. Agar insonlar biror narsada johillik qilsalar, ularga adovatlarini zohir qilmas yoki javobni uzib qo'ymas edilar. Agar bilmaydigan narsalari to'g'risida so'ralsa, darhol 'Bilmayman', deb aytar edilar.\r\n    Ibn Umar hammasi bo'lib 2630ta hadis to'plab, Abu Hurayra roziyallohu anhudan keyingi o'rinni egalladilar. Ibn Umar hadislarni Abu Bakr Siddiq, Umar ibn Xattob, Usmon ibn Affon, Abdulloh ibn Mas'ud kabi ulug' sahobalardan va Oisha hamda Hafsa onalarimizdan rivoyat qildilar. U zotdan Said ibn Musayyib, Hasan Basriy, Ibn Shihob Zuhriy, Ibn Siyriyn, Nofe', Mujohid, Tovus, Ikrima kabi tobe'iynlar rivoyat qildilar.\r\n    Abdulloh ibn Umar hijratning 73-yili 84yoshlarida Makka shahrida bu foniy dunyodan dorulbaqoga rihlat qildilar."
        ]
    },
    {
        "word": "Abdullohning ayoli Zaynab",
        "type": [],
        "definition": [
            "U kishining ismlari Zaynab binti Muoviya as-Saqafiya bo'lgan. Bu sahobiya mashhur sahobiy Abdulloh ibn Mas'ud roziyallohu anhuning ayoli ekanliklari bilan shuhrat topganlar. Shuning uchun ham ushbu hadisi sharif sanadida 'Abdullohning ayoli Zaynab roziyallohu anhodan rivoyat qilinadi' deyilmoqda.\r\n    Zaynab roziyallohu anho ilmga qiziqqan sahobiyalardan bo'lganlar. Payg'ambarimiz alayhissalomning ilmiy majlislarida faol qatnashganlar. O'zlari ham savollar bilan u zot alayhissalomga murojaat qilib turganlar.\r\n    Ayniqsa, Zaynab roziyallohu anhoning Abdulloh ibn Mas'ud roziyallohu anhuga o'z zakotlarini berish yoki bermasliklari haqidagi savollari juda ham mashhurdir. Bundan u kishi o'z erlaridan ko'ra boy bo'lganliklari ayon bo'ladi.\r\n    Zaynab binti Muoviya as-Saqafiya roziyallohu anho bevosita Payg'ambarimiz alayhissalomning o'zlaridan bir qancha hadislarni rivoyat qilganlar. Shuningdek, u kishi o'z jufti halollari Abdulloh ibn Mas'ud roziyallohu anhudan, buyuk sahobalardan – Umar ibn Xattob va boshqalardan ham rivoyat qiladilar.\r\n    Zaynab binti Muoviya as-Saqafiya roziyallohu anhodan esa Busr ibn Sa'id, Abdulloh ibn Amr ibn al-Horis, o'g'illari Abu Uboda ibn Abdulloh ibn Mas'ud va boshqalar rivoyat qiladilar.\r\n    U kishining hadislarini Imom Buxoriy, Imom Muslim va boshqa muhaddislar o'z kitoblarida keltirganlar."
        ]
    },
    {
        "word": "Abdulmajid ibn Vahb",
        "type": [],
        "definition": [
            "Addaau ibn Xolid ibn Havzata ibn Robiy'a ibn Amr ibn Omir ibn Sa'sa'a al-Omiriy bo'lib, fath yili musulmon bo'lganlar. U kishi oz hadis rivoyat qilgan sahobiylardan. Sahroda yashaganlar."
        ]
    },
    {
        "word": "Abdulmalik as-Siboriy",
        "type": [],
        "definition": [
            "Imom Abu Muhammad Abdulmalik ibn Abdurahmon as-Siboriy Buxoro ahlidan. Abu Abdulloh Muhammad ibn Ahmad al-G'unjor al-Hofizning 'Tarixi Buxoro' kitobini rivoyat qilganlar. Abu Ja'far Muhammad ibn Amr ash-Shu'abiydan ta'lim olganlar. O'zlaridan esa Abul Fazl Bakr ibn Muhammad az-Zaranjariy (Zarangariy) va Abul Fazl Muhammad ibn Ali al-Mutahhariy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abdulxoliq ash-Shikoniy",
        "type": [],
        "definition": [
            "Abu Bakr Abdulxoliq ibn Muhammad ash-Shikoniy qozi Muhammad ibn Abdulxoliqning otasi edilar. Shams ul-aimma nomi bilan tanilgan Abu Muhammad Abdulaziz ibn Ahmad al-Halvoiyning Keshda aytganlarini yozib borardilar. Hijriy 480 (milodiy 1088) yildan oldin Keshda (Shahrisabzda) vafot etganlar."
        ]
    },
    {
        "word": "Abdulhakim al-Usrushaniy",
        "type": [],
        "definition": [
            "Abu Talha Abdulhakim ibn Nasr al-Usrushaniy Usrushana ahlidan. Muhammad ibn Fazl al-Balxiy, Hilol ibn Alo ar-Raqiy, Muhammad ibn Maslama al-Vositiy, Qosim ibn Ibod at-Termiziy, Ubaydulloh ibn G'oz al-Asqaloniy, Ubaydulloh ibn Muhammad al-Barqiy va Abu Zur'a Abdurahmon ibn Amr ad-Dimashqiydan hadis rivoyat qilganlar. O'zlaridan esa Abdulloh ibn Mas'ud ibn Komil as-Samarqandiy, Abdulloh ibn Zohir al-Mug'koniy va Abu Zar Ammor ibn Muhammad at-Tamimiy al-Bag'dodiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abdulhalim al-Adib al-Barroniy",
        "type": [],
        "definition": [
            "Abu Muhammad Abdulhalim al-Adib al-Barroniy qori edilar. Abu Bakr Muhammad al-Barroniyning ukalari. Muhammad va Abdulhalim al-Barroniy – Muhammad ibn Abu Bakr al-Barroniyning o'g'illari."
        ]
    },
    {
        "word": "Abdulhamid ibn Mahmud",
        "type": [],
        "definition": [
            "Abdulhamid ibn Mahmud Mi'laviy al-Basriy hadislarni Anas ibn Molik va Abdulloh ibn Abboslardan rivoyat qildilar. U zotdan o'g'illari Hamza va Sayfilar rivoyat qilganlar.\r\n    Imom Nasaiy 'Abdulhamid ibn Mahmud ishonchli hadis rivoyat qilgan zotlardan edilar', deb aytadilar."
        ]
    },
    {
        "word": "Abdurazzoq al-Faqih al-Farabriy",
        "type": [],
        "definition": [
            "Abu Ubayd Abdurazzoq ibn Abdulvahhob al-Faqih al-Farabriy Abul Fazl Ahmad ibn Ali as-Sulaymoniy al-Paykandiy al-Hofiz va ona tomondan bobolari Abu Mansur Husayn ibn Ali al-Farabriydan ta'lim olganlar. O'zlaridan esa Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy Hofiz ta'lim olganlar."
        ]
    },
    {
        "word": "Abdurahmon al-Ajannasiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Abdurahmon ibn Ahmad al-Ajannasiy muazzin (azon aytuvchi) edilar. Otalaridan va Buxoro mashoyixlaridan ta'lim olganlar. Uzumchilik, bog'dorchilik, daraxt o'tqazish, devor qurish va imorat ishlari bilan shug'ullanganlar. Hadis ilmi bilan mashg'ul bo'lmaganlar. Hijriy 364 (milodiy 975) yilda vafot etganlar."
        ]
    },
    {
        "word": "Abdurahmon al-Assor al-Bandimashiy ",
        "type": [],
        "definition": [
            "Abu Muhammad Abdurahmon ibn Abdurahim al-Assor al-Bandimashiy Qozi va imom edilar. Silm (Tinchlik) ko'chasida yashardilar. Bu kishidan Abu Hafs Umar ibn Muhammad an-Nasafiy hadis rivoyat qilganlar. Hijriy 524 (milodiy 1131) yilning sha'bon oyida vafot etganlar."
        ]
    },
    {
        "word": "Abdurahmon al-Burnamadiy az-Zohid ",
        "type": [],
        "definition": [
            "Abu Muhammad Abdurahmon ibn Muoz al-Burnamadiy az-Zohid Bu kishi zohid, parhezkor, taqvodor bo'lganlar. Uzoq umr ko'rganlar. Yahyo ibn Muoz ar-Roziy, Jibril ibn Sahl as-Samarqandiydan ta'lim olganlar; Sohib ibn Silm az-Zohid al-Balxiyning do'stlaridan bo'lganlar. O'zlaridan esa Abdulloh ibn Mas'ud ibn Komil as-Samarqandiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abdurahmon al-Buxoriy",
        "type": [],
        "definition": [
            "Faqih Abul Fazl Abdurahmon ibn Muhammad ibn Hamdun al-Buxoriy Nishopur ahlidan bo'lib, Buxoroda yashagan olimlardan. Amir Abul Validning a'yonlaridan edilar. Abul Valid bu kishi uchun ilm suhbati va munozaralar tashkil qilardilar. Mabodo Amir Abul Validga biror qiyin masalani yechishga to'g'ri kelib qolsa, darhol Abul Fazlga murojaat etardi. Abul Fazl vafotlaridan oldin rutubat kasaliga chalinib, ko'zlari ojiz va eshitmaydigan bo'ldilar. Uch yilcha shu ahvolda yashab, hijriy 381 (milodiy 992) yilning jumodul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Abdurahmon al-Buxoriy al-Mattiy ",
        "type": [],
        "definition": [
            "Abu Muhammad Abdurahmon ibn Abul Husayn al-Buxoriy al-Mattiy solih shayx bo'lib, eshitgan hadislari sahih edi. Buxoro olimlaridan. Muhammad ibn Sobir al-Buxoriy, Fuzayl ibn Abbos al-Hiraviy va boshqa ulamolardan ta'lim olganlar. Bu kishidan esa Abdulaziz ibn Muhammad an-Naxshabiy ta'lim olganlar. Hijriy 431 (milodiy 1040) yili rajab oyining o'n uchinchisida, shanba kuni vafot etganlar."
        ]
    },
    {
        "word": "Abdurahmon al-Buxoriy at-Tobishiy",
        "type": [],
        "definition": [
            "Abul Fazl Abdurahmon ibn Zarnak al-Buxoriy at-Tobishiy Buxoro ahlidan bo'lib, Abu Bakr ibn Muhammad at-Tobishiyning otalaridir. Muhammad ibn Salom al-Paykandiy, Abu Ja'far Abdulloh al-Musnadiy va Bakr ibn Xalafdan hadis rivoyat qilganlar. Hijriy 257 (milodiy 872) yilning rabi'ul oxir oyiga to'rt kun qolganda, payshanba kechasi vafot etganlar."
        ]
    },
    {
        "word": "Abdurrahmon ibn Abdin al-Qoriy",
        "type": [],
        "definition": [
            "Abdurrahmon ibn Abd roziyallohu anhu Qora ibn Diyshning avlodlaridan edilar. Shuning uchun Qora ibn Diysh al-Madaniyga nisbat berilib, Abdurrahmon ibn Abd al-Qoriy deyiladi. U kishi Rasululloh sollallohu alayhi vasallam hayotlik davrlarida tavallud topdilar. Rasululloh alayhissalomning huzurlariga olib kelinganda hali yosh bola edilar. Bu zot ulug' tobe'inlardan bo'lib, Madina ahlining ulamolaridan bo'lganlar. Umar roziyallohu anhu davrlarida Baytulmolda xizmat qildilar.\r\n    Hadislarni Umar ibn Xattob, Abu Talha, Abu Ayyub, Abu Hurayralardan rivoyat qilganlar.\r\n    Bu zot hijratning 88-yili Madinada vafot etdilar."
        ]
    },
    {
        "word": "Abdurrahmon ibn Avf",
        "type": [],
        "definition": [
            "Abdurrahmon ibn Avf Zuhariy al-Qurashiy, kunyalari Abu Muhammad.\r\n    Abu Bakr roziyallohu anhu vositalarida sakkizinchi bo'lib Islomga kirgan, Habashiston va Madinaga hijrat qilgan, jannatga kirishlariga bashorat berilgan o'nta sahobiylarning biri.\r\n    U kishi Badr, Uhud, Xandaq, Rizvon bay'ati va boshqa bir qancha g'azotlarda ishtirok etgan, Uhud jangida yigirma bir joyidan jarohatlangan, Rasululloh sollallohu alayhi vasallam vositalarida Sa'd ibn Abu Robe' bilan islomiy birodar bo'lgan, badavlat va sahiy sahoba edilar.\r\n    Bu zot ko'p mol sohibi edilar. Bir kunning o'zida o'ttizta qul ozod qilganliklari va bir karvonni Alloh yo'lida ehson etganliklari to'g'risida kitoblarda yozilgan.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Abdurrahmon ibn Avf osmonda ham, yerda ham aminlardandir', deb marhamat qilganlar.\r\n    Abdurrahmon ibn Avf roziyallohu anhu Rasululloh sollallohu alayhi vasallamdan 65ta hadis rivoyat qilganlar. U kishidan Ibn Abbos, Ibn Umar, Jobir, Anas ibn Molik, Jubayr ibn Mut'im, Abu Salama, Mus'ab ibn Umayr, o'g'illari Ibrohim va Xumayd va tobe'¬inlardan bir nechalari rivoyat qilganlar.\r\n    Abdurrahmon ibn Avf hijratning 32-yili Madinada vafot etdilar va Baqi' qabristoniga dafn qilindilar."
        ]
    },
    {
        "word": "Abdurrahmon ibn Kaʼb",
        "type": [],
        "definition": [
            "Abdurrahmon ibn Ka'b ibn Molik ulug' sahobaning o'g'li bo'lib, katta tobe'inlardan edilar. Rasululloh sollallohu alayhi vasallamning hayotlik davrlarida tavallud topdilar. Bu zot hadis ilmining olimi bo'lib, rivoyat qilgan hadislari ishonchli, deb tan olingan.\r\n    Hadislarni otalari Ka'b ibn Molik, Abu Qatoda, Jobir, Oisha, Salama ibn Akva' va boshqalardan rivoyat qilganlar.\r\n    Bu zotdan o'g'illari Ka'b, Abu Umoma ibn Sahl, az-Zuhariy, Sa'd ibn Ibrohim, Abu Omir al-Hijoz va boshqalar rivoyat qildilar.\r\n    Abdurrahmon ibn Ka'b rahmatullohi alayhi Sulaymon ibn Abdulmalikning xalifalik davrida vafot etdilar."
        ]
    },
    {
        "word": "Abdurrahmon ibn Qosim ibn Muhammad ibn Abu Bakr",
        "type": [],
        "definition": [
            "Abdurrahmon ibn Qosim ibn Muhammad ibn Abu Bakr Siddiq al-Qurashiy tobe'inlardan bo'lib, Oisha onamiz hayotlik davrlarida tavallud topdilar. Bu kishi Madina ahlining ulug'laridan bo'lib, faqih, taqvoli, olim kishi edilar.\r\n    Abdurrahmon ibn Qosim ko'p hadislar rivoyat qildilar. Hadis olimlari bu kishi rivoyat qilgan hadislarni ishonchli, deb e'tirof etganlar.\r\n    Abdurrahmon ibn Qosim hadislarni otalaridan, Sa'iyd ibn Musayyib, Solim ibn Abdulloh, Umar roziyallohu anhuning qullari Nofe', Muhammad ibn Ja'far va boshqalardan rivoyat qildilar.\r\n    Bu zotdan Simon ibn Harb, Ubaydulloh ibn Umar, Hishom ibn Urva va boshqalar rivoyat qildilar. Abdurrahmon ibn Qosim hijratning 126-yili Shomda vafot topdilar."
        ]
    },
    {
        "word": "Abdurrahmon ibn Xallod",
        "type": [],
        "definition": [
            "Abdurrahmon ibn Xallod ansoriylardan bo'lib, hadislarini Abdulloh ibn Ummu Maktumdan rivoyat qiladilar. Bu zotdan esa Valid ibn Jami' va boshqalar rivoyat qilganlar.\r\n    Ummu Varaqa roziyallohu anhoning to'liq ismlari Ummu Varaqa binti Abdulloh ibn Horis."
        ]
    },
    {
        "word": "Abdusamad al-Avdaniy Abdulhamid al-Avdaniy",
        "type": [],
        "definition": [
            "Abu Salama Abdusamad al-Avdaniy va Abu Sahl Abdulhamid al-Avdaniy - Dovud al-Avdaniyning o'g'illari. Faqihlardan edilar. Termizda Abul Fazl ibn Abu Hafs at-Termiziydan Imom at-Tahoviyning kitoblaridan ta'lim olganlar. Aka-ukalar faqih Abul Qosim Abdulloh ibn Ahmad an-Nasaviydan 'Musnadu Hasan ibn Sufyon' ('Hasan ibn Sufyonning hadis to'plamlari') kitoblaridan; Marvda Abu Ja'far az-Zajjoj va Abu Ali ibn Hodildan 'Manoqibu Abi Hanifa' ('Abu Hanifaning hayot yo'llari') kitobidan ta'lim olganlar. Ularning otalari Abu Sulaymon Dovud al-Avdaniy shunday deganlar: 'Men Alloh taolodan solih farzandlar tiladim. U menga shunday farzandlar berdi'."
        ]
    },
    {
        "word": "Abdusamad al-Malohimiy al-Buxoriy ",
        "type": [],
        "definition": [
            "Abul Fath Abdusamad ibn Ali al-Malohimiy al-Buxoriy solih shayx edilar. Bobolari Abu Nasr al-Malohimiydan ta'lim olganlar. O'zlaridan esa Abu Muhammad Abdulaziz an-Naxshabiy al-Hofiz ta'lim olganlar."
        ]
    },
    {
        "word": "Abdusamad ash-Shiyoiy",
        "type": [],
        "definition": [
            "Abu Naim Abdusamad ibn Ali ash-Shiyoiy bu nisbat bilan mashhur bo'lganlar. Zohid va faqih bu zot Abu Shuayb Solih ibn Muhammad as-Sijoriy va Abul Qosim Ali ibn Ahmad al-Xuzoiydan ta'lim olganlar."
        ]
    },
    {
        "word": "Aboa",
        "type": [],
        "definition": [
            "Aboa - jundan tikilgan, choponga o'xshash ustki kiyim."
        ]
    },
    {
        "word": "Abrad al-Buxoriy al-Moxiy",
        "type": [],
        "definition": [
            "Abu Muhammad Abrad ibn Xolid ibn Abdurahmon ibn Mox al-Buxoriy al-Moxiy Buxoro ahlidan bo'lib, Mox masjidini* qurgan kishining chevarasidirlar. Iso ibn Muso G'unjordan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari Muhammad ibn Abrad hadis rivoyat qilganlar.\r\n    * - Mox ismli majusiy (otashparast) bir kishi musulmon bo'lib, Buxoroda masjid qurib, unga 'Mox' deb nom qo'ydi . Masjidning eshigi yonida katta mahalla va bozor bor edi. Bu mahalla va bozor 'Mox masjidi darvozasi' deb tanilgan edi."
        ]
    },
    {
        "word": "Abtoh",
        "type": [],
        "definition": [
            "Abtoh – Makka hududiga kirishdagi joy nomi. U Batho yoki Muhassab deb ham ataladi."
        ]
    },
    {
        "word": "Abu Abdulloh al-Xorazmiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh al-Xorazmiy al-Buxoriy asli buxorolik bo'lganlar. Faqih, nahvshunos, ma'rifat ilmini biluvchi, shoir-adib edilar. Buxoroda qozi, so'ngra Tamg'ochxon vazirligida, keyinchalik esa Buxoro rayosatida ishlaganlar. Bu kishi muftiy, mudarris edilar. Ko'p hadislarni bilardilar. Laqablari 'Sharaf ar-ruaso' (Raislarning ulug'i) edi. Ibni Mokulo aytadilar: 'Abu Iso at-Termiziyning 'al-Jome'' hadislarini shu kishidan dars olganman'."
        ]
    },
    {
        "word": "Abu Abdulloh at-Tuskosiy as-Samarqandiy",
        "type": [],
        "definition": [
            "Abu Abdulloh at-Tuskosiy as-Samarqandiy Yahyo ibn Yazid as-Samarqandiydan hadis rivoyat qilganlar. O'zlaridan esa faqih Bakr ibn Muhammad al-Varasniniy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Azza",
        "type": [],
        "definition": [
            "U zotning ismlari Yasar ibn Abdulloh ibn Omir. Bu kishi ko'proq kunyalari bo'yicha – Abu Azza deb tanilganlar.\r\n    Abu Azza roziyallohu anhu Basrada yashadilar. U kishi Rasululloh sollallohu alayhi vasallam bilan suhbatda bo'lib, bir nechta hadis rivoyat qildilar. Abu Azza roziyallohu anhu to'plagan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritishgan."
        ]
    },
    {
        "word": "Abu Ayyub al-Ansoriy",
        "type": [],
        "definition": [
            "Abu Ayyub kunyasi bilan mashhur bo'lgan bu ulug' sahobaning asl ismlari Xolid ibn Zayd ibn Kulayb al-Xazrajiydir.\r\n    U kishi Najjor qabilasidan edilar. Islomga hijratdan oldin kirib, ikkinchi Aqaba bay'atida ishtirok etdilar.\r\n    Abu Ayyub al-Ansoriy roziyallohu anhu Badr, Uhud, Xandaq va boshqa hamma g'azotlarda ishtirok etdilar. Siffiyn hamda Jamal urushlarida Ali roziyallohu anhu bilan birga bo'ldilar.\r\n    Rasululloh sollallohu alayhi vasallam Makkadan Madinaga hijrat qilganlarida ansorlarning har biri Rasululloh sollallohu alayhi vasallamning o'z shaxsiy uylariga tushib, yashashlarini istar edilar. Rasululloh sollallohu alayhi vasallam esa tuyalari tanlagan yerga tushishlarini aytdilar. Shunda tuya to'g'ri borib, Abu Ayyub al-Ansoriy roziyallohu anhuning uyi to'g'risida to'xtadi. O'sha paytda ansorlar ichida Abu Ayyubdan ko'ra baxt¬liroq kishi yo'q edi.\r\n    Bu zot hammasi bo'lib 155ta hadis rivoyat qildilar va bu hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Abu Ayyub al-Ansoriy roziyallohu anhu dushmanlarga qarshi jihodda qatnashishni juda ham yoqtirar edilar. Yaziyd ibn Muoviya bilan Qustantiniya (Istanbul)ni fath etish uchun keta turib, yo'lda kasal bo'lib qoladilar. Yaziyd u kishini qaytarib yubormoqchi bo'lganida unga Allohning 'Infiru xifaf-av va siqala' ('Yengil bo'lsa ham, og'ir bo'lsa ham, qo'zg'alingiz') oyatini keltirib, 'Meni ham o'zinglar bilan olib ketinglar', deb aytadilar. Yaziyd Abu Ayyub al-Ansoriyni o'zi bilan olib ketadi.\r\n     Abu Ayyub al-Ansoriy roziyallohu anhu hijratning 52-sanasida (milodiy 672 sanada) Qustantiniyada vafot etadilar. Abu Ayyub al-Ansoriy roziyallohu anhuning qabrlarini hatto rumliklar ham ziyorat qilar edilar."
        ]
    },
    {
        "word": "Abu Amr Basriy qiroati",
        "type": [],
        "definition": [
            "Imom Zabon ibn Alo' ibn Ammor ibn Uryon Mozaniy Basriy. U kishi hijriy 68 sanada tug'ilib, 154 sanada vafot etgan.\r\n    U kishining ikki roviylari – Duriy va Susiy. Qiroat imomining roviysi uning qiroatini ilmiy ravishda qabul qilib, boshqalarga yetkazishda xizmat qilgan bo'ladi."
        ]
    },
    {
        "word": "Abu Atiyya",
        "type": [],
        "definition": [
            "Molik ibn Omir roziyallohu anhu Abu Atiyya kunyasi bilan mashhur bo'lganlar. Rasululloh sollallohu alayhi vasallam bilan suhbatda bo'lganlari to'g'risida ixtiloflar bor. Ba'zi ulamolar u kishini tobe'inlardan, deyishadi.\r\n    Bu zot rivoyat qilgan hadislarni 'Sunan' sohiblari o'z kitoblariga kiritganlar."
        ]
    },
    {
        "word": "Abu Ahmad al-Kassaviy",
        "type": [],
        "definition": [
            "Abu Ahmad al-Kassaviy (Kassa – Buxorodan to'rt farsax uzoqlikda joylashgan qishloq) bu nisbat bilan mashhur bo'lib, imom Abu Bakr Muhammad ibn Ali al-Qaffol ash-Shoshiydan ta'lim olganlar."
        ]
    },
    {
        "word": "Abu Bakr at-Tarxuniy",
        "type": [],
        "definition": [
            "Abu Bakr ibn Abu Amr at-Tarxuniy Buxoro ahlidan. Abu Ali Solih ibn Muhammad, Homid ibn Sahl va Ibrohim ibn Ma'qaldan hadis rivoyat qilganlar. Hijriy 346 (milodiy 958) yilning muharram oyida vafot etganlar."
        ]
    },
    {
        "word": "Abu Bakr Ahmad",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad faqih, orif, taqvodorlardan edilar. Abu Bakr Ahmad fozil, shoir, nahv, sarf (arab grammatikasi) ilmini yaxshi biluvchi va tasavvuf ilmining peshqadam olimlaridan edilar. Bu kishining karomatlari bor edi. Katta she'riy to'plamlari mavjud. Hijriy 376 (milodiy 987) yilning muharram oyida vafot etganlar."
        ]
    },
    {
        "word": "Abu Bakr Ahmad",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining o'g'illari. 'Tiybatun nashr' kitobini sharh qilgan."
        ]
    },
    {
        "word": "Abu Bakr Ahmad Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining o'g'illari. (780)"
        ]
    },
    {
        "word": "Abu Bakr Muhammad al-Barroniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad al-Barroniy - Buxoroning Barron nomli qishlog'idan bo'lib, 'an-Najib' (Pokiza) nomi bilan tanilgan edilar. Faqih, fozil, solih olimlardan edilar."
        ]
    },
    {
        "word": "Abu Bakr Siddiq roziyallohu anhu",
        "type": [],
        "definition": [
            "Abu Bakr Siddiq roziyallohu anhu Islom olamida mashhur bo'lib, erkaklardan birinchi bo'lib Islomni qabul qilganlar. Islom olamidagi xalifalarning birinchisi va jannatga kirishlari bashorat berilgan o'n nafar jannatiylarning ham birinchisidirlar.\r\n    Islom ummati bu zotni Siddiq (o'ta rostgo'y) deb biladi.\r\n    Isro kechasida Rasululloh sollallohu alayhi vasallam 'Masjid ul-Aqsoga borib keldim', deganlarida mushriklar, hatto ba'zi bir musulmonlar ham bu so'zga ishonmagan edilar. Mushriklar Abu Bakrga kelib:\r\n    'Do'sting shu kecha Masjid ul-Aqsoga borib keldim, deyapti. Shuni ham rost dersan?' deyishdi.\r\n    Shunda Abu Bakr:\r\n    'Men unga bundan uzoqroq joy — osmondan vahiy kelishiga ishondim-ku, bunga ishonmasmidim?!', deb javob berdilar.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Men kimni Islomga chaqirgan bo'lsam, hammalarida bir to'xtash bo'ldi. Faqat Abu Bakrda bunday bo'lmadi. U meni hamma narsada rost dedi', deb marhamat qildilar.\r\n    Rasululloh sollallohu alayhi vasallam vafot etganlarida qanchadan-qancha qabilalar murtad bo'lishdi. Hatto Umar ibn Xattobdek ulug' sahoba ham Rasululloh sollallohu alayhi vasallam vafot etganlarini inkor etib, qilichlarini yalang'ochlab, 'Kimki Payg'ambar o'ldi, desa, uning o'zini o'ldiraman', deb turib oldilar.\r\n    Abu Bakr roziyallohu anhu Rasululloh sollallohu alayhi vasallamning huzurlaridan chiqqach, musulmonlarga qarata shunday xutba qildilar:\r\n    'Kimki Allohga ibodat qilsa, U o'lmas, tirik Zotdir. Muhammad sollallohu alayhi vasallam ham bir rasuldir. Undan oldin ham payg'ambarlar o'tdi. Agar Payg'ambar o'lsa, Islomdan qaytib ketasizlarmi? Kimki orqasiga qaytib ketsa, Allohga hech bir narsada zarar berolmas. Alloh shukr qilgan bandalarini tezda mukofotlar'.\r\n    Abu Bakr roziyallohu anhu hammasi bo'lib 142ta hadis rivoyat qilganlar. Hijratning 13-yilida vafot qilganlar."
        ]
    },
    {
        "word": "Abu Bakra",
        "type": [],
        "definition": [
            "Abu Bakra kunyasi bilan mashhur bo'lgan bu sahobaning ismlari Nufay' ibn Horis as-Saqafiy. Bu kishi Toifda musulmonlar qo'liga asirga tushadilar. Islomga kirganlaridan so'ng Rasululloh sollallohu alayhi vasallam u kishini ozod qilib, 'Abu Bakra' kunyasi bilan chaqiradilar.\r\n    Abu Bakra roziyallohu anhu ulug' sahobalardan bo'lib, Rasululloh sollallohu alayhi vasallamdan 132ta hadis rivoyat qildilar. Bu zot Toifdan Basraga ko'chib o'tib, ana shu yerda istiqomat qildilar. Imron ibn Xusayn 'Abu Bakradan ko'ra fazilatli kishini ko'rmadim', deb aytganlar.\r\n    Bu zot hijratning 52-sanasida Basrada vafot etadilar."
        ]
    },
    {
        "word": "Abu Basra al-Gʻiforiy",
        "type": [],
        "definition": [
            "Asl ismlari Xumayin ibn Basra ibn Vaqqos, kunyalari Abu Basra. Bu zot Abu Hurayraga yo'liqib, ana shu kishidan hadislarni rivoyat qildilar. Abu Basra Hijozda, keyin Misrda istiqomat qildilar. Vafot etgan yillari ma'lum emas."
        ]
    },
    {
        "word": "Abu Voil",
        "type": [],
        "definition": [
            "Abu Voil kunyasi bilan mashhur bo'lgan bu sahobaning ismlari Shaqiq ibn Salamadir.\r\n    Abu Voil roziyallohu anhu Abdulloh ibn Mas'ud roziyallohu anhuning ashoblaridan edilar. Bu zot tafakkuri, yodlash qobiliyati kuchli, Qur'oni Karimni ikki oyda yod olgan, taqvoli, dunyoda zohid bo'lgan sahobalardan edilar. Siffiyn jangida Ali roziyallohu anhu bilan ishtirok etdilar. Rasululloh sollallohu alayhi vasallamdan hamda Abu Bakr, Umar, Usmon, Ali, Sa'd, Ibn Abbos, Ibn Mas'ud, Oisha roziyallohu anhumodan hadislar rivoyat qildilar. Bu kishidan Sha'biy, Mansur ibn Mo''tamir, A'mash va boshqalar rivoyat qilganlar.\r\n     Bu zot hijratning 79-sanasida vafot etganlar."
        ]
    },
    {
        "word": "Abu Voqid al-Laysiy",
        "type": [],
        "definition": [
            "Abu Voqid al-Laysiy kunyasi bilan mashhur bo'lgan bu sahobaning asl ismlari Avf ibn al-Horisdir.\r\n    Bu sahoba Badr, Makka fathi, Yarmuk kunlarida ishtirok etganlar. Rasululloh sollallohu alayhi vasallamdan bir nechta hadislar rivoyat qilganlar. Bu kishidan Ibn Musayyib, Urva ibn Zubayr, Ubaydulloh ibn Abdulloh, Ato ibn Yasorlar rivoyat qilganlar.\r\n    Bu zot hijratning 68-sanasida Makkada 85 yoshlarida vafot etdilar. Jasadlari muhojirlar qabristoni bo'lgan 'Fahha' qabristoniga dafn etilgan."
        ]
    },
    {
        "word": "Abu Gʻolib roziyallohu anhu",
        "type": [],
        "definition": [
            "Abu G'olib kunyasi bilan mashhur bo'lgan bu zotning ismlari Nofe' Bohiliy al-Basriydir.\r\n    Hadislarni Anas ibn Molik, A'lo ibn Ziyod al-Adaviylardan rivoyat qildilar.\r\n    Bu zotdan Hammom ibn Yahyo, Abu Sahbon, Abdurrahmon ismli o'g'illari hamda Abdulvoris ibn Sa'iyd va boshqalar rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Dardo",
        "type": [],
        "definition": [
            "Uvaymir ibn Molik ibn Qays Ansoriy al-Xazrajiy. Bu zotning kunyalari Abu Dardo bo'lib, Uhud va boshqa g'azotlarda ishtirok etganlar. Shijoatlari va ibodatlari bilan mashhur bo'lganlar. Abu Dardo roziyallohu anhu ummatning hakim va pahlavonlaridan, Rasululloh sollallohu alayhi vasallam davrlarida Qur'on jamlovchilarning biri edilar. Muhojir Salmon Forsiy bilan Alloh yo'lida birodar bo'lganlar. Usmon ibn Affon roziyallohu anhu xalifalik davrlarida Shom shahri qozisi va Falastin faqihlaridan bo'lgan mashhur sahobalardan edilar.\r\n    Hammasi bo'lib, 179ta hadis rivoyat qildilar va bu hadislarni Oisha onamiz va Zayd ibn Sobitlardan eshitdilar. Bu zotdan o'g'illari Bilol, xotinlari Ummu Dardolar rivoyat qilganlar. Abu Dardo roziyallohu anhu to'plagan hadislardan uchta 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Ulug' zotlardan Masruq aytadilar: 'Rasululloh sollallohu alayhi vasallamning ilmlarini olti kishi huzuridan topdim, shularning biri Abu Dardodir'.\r\n    U zot hijratning 32-sanasida Damashqda vafot etdilar."
        ]
    },
    {
        "word": "Abu Jaʼd az-Zomriy",
        "type": [],
        "definition": [
            "Bu sahoba Abu Ja'd az-Zomriy kunyasi bilan mashhur bo'lganlar. U kishining asl ismlari Amr ibn Bakr edi. Bu zot Makkani fath etish va Tabuk g'azotlarida ishtirok etdilar.\r\n    Jamal voqeasida esa Oisha roziyallohu anho onamiz bilan qatnashib, mana shu urushda vafot etdilar.\r\n    Hadislarni Salmon Forsiydan rivoyat qildilar. Bu kishidan Ubayda ibn Sufyon al-Hazramiy va boshqalar rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Jaʼfar Muhammad al-Qozi al-Barkadiy",
        "type": [],
        "definition": [
            "Abu Ja'far Muhammad ibn Ahmad al-Qozi al-Barkadiy Barkad qishlog'idan. Buxoroda qozilik qilganlar. Otalari Ahmad ibn Musodan hamda Sa'id ibn Ayyub va Abu Ibrohim Is'hoq ibn Abdullohdan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Ahmad ibn Sa'd az-Zohid hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Juhaym",
        "type": [],
        "definition": [
            "Abu Juhaym kunyasi bilan mashhur bo'lgan bu sahobaning ismlari Abdulloh ibn Juhaym ibn Horis as-Samma al-Ansoriydir.\r\n    Bu zot sahoba Ubay ibn Ka'bning singillarining o'g'illaridir. Rasululloh sollallohu alayhi vasallamdan bir nechta hadislar rivoyat qilganlar.\r\n     Bu kishidan Bashir ibn Said al-Hazramiy, Muslim ibn Said, Ibn Abbosning qullari Umayr, Maymuna onamizning qullari Abdulloh ibn Yasorlar rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Juhayfa",
        "type": [],
        "definition": [
            "Abu Juhayfa kunyasi bilan mashhur bo'lgan bu sahobaning ismlari Abdulloh ibn Muslim ibn Janoda as-Suvoiydir. Rasululloh sollallohu alayhi vasallam vafot etganlarida bu zot hali balog'at yoshiga yetmagan edilar. Abu Juhayfa Kufada istiqomat qildilar. Ana shu yerdagi xazinaga boshliq bo'ldilar. U kishi hazrati Alining qo'riqchilaridan edilar. Ali roziyallohu anhu bu zotni 'Vahbul xayr' deb ataganlar.\r\n    Abu Juhayfa roziyallohu anhu Rasululloh sollallohu alayhi vasallamdan ko'p hadislar rivoyat qildilar. Bu zotdan o'g'illari Avn, Abu Is'hoq Sa'biy, Ismoil ibn Abu Xolid, Ali ibn Arqam va boshqalar rivoyat qilganlar. Uchta 'Sahih' sohiblari bu zot to'plagan hadislardan o'z kitoblariga kiritganlar.\r\n    Abu Juhayfa hijratning 63-sanasida, Bashr ibn Marvon Iroqda voliy bo'lgan paytda vafot etdilar. U kishi Kufada eng oxirgi vafot etgan sahoba edilar."
        ]
    },
    {
        "word": "Abu Zarr Gʻiforiy",
        "type": [],
        "definition": [
            "Abu Zarr G'iforiy - bu sahobiyning ismlari Jundub ibn Junoda G'iforiy, kunyalari Abu Zarr. Islomga eng avval kirgan sahobalarning beshinchisi. Bu zotga Handaq jangidan keyin Madinaga hijrat qilish nasib etdi. U kishi Rasululloh sollallohu alayhi vasallamga bay'at bergan sahobalardan edilar. Abu Zarr ertangi kunga yemak saqlamaydigan zohid zotlardan edi.\r\n    Bu zot hammasi bo'lib 281ta hadis rivoyat qildilar. Bu hadislarni Umar ibn Xattob, Abdulloh ibn Abbos, Abdulloh ibn Umar va boshqalardan rivoyat qildilar. Bu zotdan Ahnaf ibn Qays, Abdurrahmon ibn G'anam, Ato' va boshqalar rivoyat qilganlar. Abu Zarr roziyallohu anhu Usmon roziyallohu anhuning xalifalik davrlarida, 32-hijriy sanada Rabazada vafot etdilar."
        ]
    },
    {
        "word": "Abu Iso Muhammad ibn Iso at-Termiziy",
        "type": [],
        "definition": [
            "Abu Iso Muhammad ibn Iso at-Termiziy – zehnlari o'tkir, yetuk muhaddis, hadis ilmining imomi bo'lib, har bir hadis yoki so'zni dalil bilan isbotlab berishlari odamlar og'zidan tushmas edi. Bu zot Imom al-Buxoriyning shogirdlaridan. Imom al-Buxoriydan, u kishining shayxlari Qutayba ibn Sa'id al-Bag'loniy, Ali ibn Hajar al-Marvaziy, Hannod ibn Surriy al-Kufiy, Abu Kurayb Muhammad ibn Alo al-Kufiy, Muhammad ibn Bashshor al-Basriy, Muhammad ibn Muso al-Basriy, Abdulloh ibn Abdurahmon ad-Dorimiy as-Samarqandiydan hamda Iroq va Hijozning boshqa mashoyixlaridan ta'lim olganlar. O'zlaridan esa Muhammad ibn Sahl al-G'azzol, Bakr ibn Muhammad ad-Dehqon, Abu Nazr ar-Rushdiy, Hammod ibn Shojar an-Nasafiy, Abul Abbos al-Mahbubiy al-Marvaziy va Haysam ibn Kulayb ash-Shoshiy hadis rivoyat qilganlar. Hijriy 270 (milodiy 884) yili Termizdan olti farsax uzoqlikdagi Bug' qishlog'ida vafot etganlar."
        ]
    },
    {
        "word": "Abu Isʼhoq",
        "type": [],
        "definition": [
            "Abu Is'hoq – Sa'd ibn Abu Vaqqosning kunyasi."
        ]
    },
    {
        "word": "Abu Isʼhoq al-Malohimiy",
        "type": [],
        "definition": [
            "Abu Is'hoq ibn Muhammad al-Malohimiy Buxoro ahlidan bo'lib, Umar ibn Muhammad ibn Bujayr va Is'hoq ibn Ahmad ibn Xalafdan hadis rivoyat qilganlar. Hijriy 362 (milodiy 974) yilning safar oyida vafot etganlar."
        ]
    },
    {
        "word": "Abu Isʼhoq roziyallohu anhu",
        "type": [],
        "definition": [
            "Abu Is'hoq kunyasi bilan mashhur bo'lgan bu tobe'inning ismlari Amr ibn Abdullohdir.\r\n    Abu Is'hoq xalifa Usmon roziyallohu anhu vafot etganlaridan ikki yil oldin tavallud topdilar.\r\n    Ulamolar 'Abu Is'hoqdan rivoyat qilingan hadislarda shubha yo'q' deyishar edi.\r\n    Bu zot taqvoli va hadis ilmida olim edilar.\r\n    Bu kishi hadislarni Ali roziyallohu anhu, Mug'iyra ibn Shu'ba, Sulaymon ibn Surd, Zayd ibn Arqam, Baro ibn Ozib, Jobir ibn Samura, Horisa ibn Vahb, Adiy ibn Hotim, Abdul ibn Yaziydlardan rivoyat qildilar.\r\n    Bu zotdan o'g'illari Yunus, nevaralari Isroil va Yusuf va yana bir qancha kishilar rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Kabsha al-Anmoriy",
        "type": [],
        "definition": [
            "Asl ismlari Sa'iyd ibn Amr bo'lib, sahobalardan edilar. Shomda istiqomat qilganlar. Hadislarni Abu Bakr roziyalohu anhudan rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Qatoda roziyallohu anhu ",
        "type": [],
        "definition": [
            "Abu Qatoda kunyasi bilan mashhur bo'lgan bu sahobaning asl ismlari Horis ibn Rabiy' Ansoriy al-Xazrajiydir.\r\n    U kishi Islomda Rasululloh sollallohu alayhi vasallamning chavandozlaridan edi. Badr jangida ishtirok etganliklari to'g'risida ixtiloflar bor. Lekin Uhud va boshqa g'azotlarda ishtirok etganlar. Bu zot g'azotlarning birida yuzlaridan jarohatlanadilar. Rasululloh sollallohu alayhi vasallam buni ko'rib, muborak qo'llari bilan jarohat joylarini silab qo'yadilar. Shundan keyin Abu Qatoda roziyallohu anhu biror marta urilmaydilar ham, jarohatlanmaydilar ham.\r\n    Hazrati Alining xalifalik davrlarida Makkada voliy bo'ldilar. Siffiyn urushida Ali roziyallohu anhu bilan ishtirok etdilar."
        ]
    },
    {
        "word": "Abu Qatoda roziyallohu anhu",
        "type": [],
        "definition": [
            "Abu Qatoda kunyasi bilan mashhur bo'lgan bu sahobaning asl ismlari Horis ibn Rabiy' Ansoriy al-Xazrajiydir.\r\n    U kishi Islomda Rasululloh sollallohu alayhi vasallamning chavandozlaridan edi. Badr jangida ishtirok etganliklari to'g'risida ixtiloflar bor. Lekin Uhud va boshqa g'azotlarda ishtirok etganlar. Bu zot g'azotlarning birida yuzlaridan jarohatlanadilar. Rasululloh sollallohu alayhi vasallam buni ko'rib, muborak qo'llari bilan jarohat joylarini silab qo'yadilar. Shundan keyin Abu Qatoda roziyallohu anhu biror marta urilmaydilar ham, jarohatlanmaydilar ham.\r\n    Hazrati Alining xalifalik davrlarida Makkada voliy bo'ldilar. Siffiyn urushida Ali roziyallohu anhu bilan ishtirok etdilar."
        ]
    },
    {
        "word": "Abu Qiloba",
        "type": [],
        "definition": [
            "Abu Qiloba – roviylardan biri, Amr ibn Salima – hadisni rivoyat qilgan yosh sahoba."
        ]
    },
    {
        "word": "Abu Qiloba roziyallohu anhu",
        "type": [],
        "definition": [
            "Abdulloh ibn Zayd ibn Amr al-Jurmiy hukm chiqaruvchi qozi, olim va taqvodor kishi edilar.\r\n    Abu Qiloba Basrada yashadilar. U kishini bu yerga qozi qilamiz, deyishganda Shomga qochib ketdilar. Ishonchli muhaddislardan edilar.\r\n    Hadislarini Sobit ibn Zahhok, Samura ibn Jundub, Zaynab binti Ummu Salama, Anas ibn Molik, Ibn Abbos, Ibn Umar va bir nechta tobe'inlardan rivoyat qildilar.\r\n    Abu Qiloba hijratning 104-yili vafot etdilar."
        ]
    },
    {
        "word": "Abu Masʼud al-Badriy",
        "type": [],
        "definition": [
            "Abu Mas'ud kunyasi bilan mashhur bu sahobaning ismlari Uqba ibn Amr al-Badriydir. U kishi Madinadan Rasululloh sollallohu alayhi vasallamga bay'at qilish uchun kelgan, ikkinchi Aqoba bay'atida ishtirok etgan, Badr, Uhud va boshqa g'azotlarda qatnashgan ulug' sahobalardan biri bo'lganlar. Bu zot Ali roziyallohu anhuning eng yaqin kishilaridan edilar. Ali roziyallohu anhu Siffiyn jangiga ketayotganlarida bu kishini Kufaga amir qilib qoldirganlar.\r\n     Abu Mas'ud al-Badriy hammasi bo'lib, 102ta hadis rivoyat qilganlar. Bu kishidan Abdulloh ibn Yaziyd, Abu Voil, Alqama, Masruq va boshqalar rivoyat qildilar. Abu Mas'ud al-Badriy hijratning 40-sanasida Kufada vafot etdilar."
        ]
    },
    {
        "word": "Abu Molik al-Ashʼariy",
        "type": [],
        "definition": [
            "Ka'b ibn Osim al-Ash'ariy, kunyalari Abu Molik. U kishi safina, ya'ni kema ashoblaridan bo'lib, Yamandan kemada kelib, musulmon bo'lgan zotlardandir. Bu zot Misr va Shomda istiqomat qilganlar. Rasululloh sollallohu alayhi vasallamning hadislaridan bir nechtasini rivoyat qildilar. U kishidan Ummu Dardo, Abdurrahmon ibn G'anam, Xolid ibn Abu Maryam, Madina ahlidan hadis chiqaruvchi bir nechta kishilar rivoyat qilganlar. Bu zot to'plagan hadislardan ayrimlarini mashhur 'Sahih' sohiblaridan uchtasi o'z kitoblariga kiritganlar."
        ]
    },
    {
        "word": "Abu Muso",
        "type": [],
        "definition": [
            "U kishining to'liq ismlari Abdulloh ibn Qays ibn Solim ibn Hazor ibn Harbdir. Onalari Toyyiba binti Vahb, kunyalari Abu Muso bo'lib, o'zlari Bani Ash'ar qabilasidan.\r\n    Bu zot Yamanda tavallud topdilar. Makkada Islom zohir bo'lgan paytda, hijratdan avval musulmon bo'lganlar.\r\n    Rasululloh sollallohu alayhi vasallam tomonlaridan Yaman sohilidagi Zubayd, Adan shaharlariga boshliq etib tayinlanganlar. Yaman ahliga Qur'onni o'rgatish uchun yuborilganlar.\r\n    Umar ibn Xattob roziyallohu anhuning xalifalik davrlarida bu kishi Basraga, Usmon ibn Affon roziyallohu anhuning xalifalik davrlarida esa Kufaga voliy etib tayinlangan edilar.\r\n    Birinchi marta Yamandan Makkaga, ikkinchi marta Makkadan Habashistonga, uchinchi marta Madinadan Habashistonga hijrat qilganliklari uchun bu zot uch hijrat sohibi deb ataladilar.\r\n    Hofiz Sijjistoniy aytadilar: 'Abu Muso Ash'ariyda Nabiyning sahobalarida yo'q bo'lgan fazilat bor edi. U zot pok qalbli, salomat niyatli, ko'p ro'za tutuvchi, kechalarini tahajjud namozi bilan bedor o'tkazuvchi ulug' sahobalardan edilar'.\r\n    Rasululloh sollallohu alayhi vasallam Abu Muso Ash'ariyni chavandoz pahlavonlarning say¬yidi deb ataganlar.\r\n    U zot 355ta hadis rivoyat qildilar. Hijratning 44 yili 63 yoshlarida Kufada vafot etdilar."
        ]
    },
    {
        "word": "Abu Muhammad al-Haramiy al-Paykandiy",
        "type": [],
        "definition": [
            "Buxorolik Abu Muhammad al-Haramiy al-Paykandiy - Al-Haramiy (Alloh taolo harom qilgan narsalarni harom deb bilganlari uchun berilgan nisbat) nisbati bilan mashhurdirlar. Balxda yashaganlar. Muhammad ibn Salom al-Paykandiy, Hasan ibn Umar, Qutayba ibn Sa'id, Ibrohim ibn Munzir va Xanash ibn Harb al-Paykandiydan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Muhammad al-Yuxashuniy",
        "type": [],
        "definition": [
            "Abu Muhammad ibn Ham al-Yuxashuniy Imom al-Buxoriyning 'al-Jome' as-sahih' ('Ishonchli to'plam') kitoblarini Muhammad ibn Yusuf al-Farabriydan rivoyat qilganlar. Hijriy 381 (milodiy 992) yilda vafot etganlar."
        ]
    },
    {
        "word": "Abu Muhammad ash-Shuʼaybiy",
        "type": [],
        "definition": [
            "Abu Muhammad ibn Shayba ibn Muhammad ash-Shu'aybiy taqvodor, parhezkor va solih kishilardan edilar. Bir guruh mashoyixdan hadisdan ta'lim olganlar. Hijriy 395 (milodiy 1006) yilning muharram oyida vafot etganlar. Abu Abdulloh al-Hofiz al-Hokim 'Tarix' kitoblarida u kishi haqlarida to'xtalganlar."
        ]
    },
    {
        "word": "Abu Nasr Muhammad al-Paykandiy",
        "type": [],
        "definition": [
            "Abu Nasr Muhammad ibn Abu Abdulloh al-Paykandiy - Muhammad ibn Salom al-Paykandiyning avlodlaridan bo'lib, Abul Fazl Ahmad ibn Ali as-Sulaymoniydan ta'lim olganlar. O'zlaridan esa Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Abu Nasr Muhammad ibn Abu Usoma al-Barroniy",
        "type": [],
        "definition": [
            "Adib Abu Nasr Muhammad ibn Abu Usoma al-Barroniy ham Barron qishlog'idan. Abu Zarr al-Bag'dodiy va Abul Hasan Ahmad ibn Muhammad al-Huriy (al-Huroniy)dan ta'lim olganlar. O'zlaridan esa Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy ta'lim olganlar."
        ]
    },
    {
        "word": "Abu Rofeʼ",
        "type": [],
        "definition": [
            "U kishining ismlari Aslam, kunyalari Abu Rofe' bo'lib, ismlaridan g'olib kelgan. Abu Rofe' qibtiylardan, Rasululloh sollallohu alayhi vasallamga amakilari Abbos tomonidan hadya qilingan qullardan edilar.\r\n    Bu zot Uhud, Xandaq va boshqa janglarda ishtirok etdilar. Badr jangi kuni Makkada bo'lganliklari sababli bu urushda ishtirok eta olmadilar.\r\n    Bu zot to'plagan hadislardan uchta 'Sahih' sohiblari o'z kitoblariga kiritishgan. Hazrati Alining xalifalik davrlarida vafot etganlar."
        ]
    },
    {
        "word": "Abu Rofiʼ Alo ibn Mansur al-Barsaxiy",
        "type": [],
        "definition": [
            "Abu Bakr Mansur al-Barsaxiyning o'g'illari."
        ]
    },
    {
        "word": "Abu Salama ibn Abdurrahmon",
        "type": [],
        "definition": [
            "Abdulloh ibn Abdurrahmon ibn Avf Zuhriy al-Madaniy. Abu Salama kunyasi bilan tanilganlar.\r\n    Hadislarni otalari Abdurrahmon ibn Avf, Usmon ibn Affon, Talha ibn Ubaydulloh, Uboda ibn Somit, Usoma ibn Zayd, Hasson ibn Sobit, Abdulloh ibn Salom, Savbon, Nofe', Abu Hurayra, Oisha va Ummu Salama onalarimiz, Muoviya, Muayqib, Amr ibn Oss, Ibn Abbos, Ibn Umar, Abu Sa'iyd al-Xudriy, Anas ibn Molik va yana bir necha sahoba va tobe'inlardan rivoyat qiladilar.\r\n    Bu kishidan o'g'illari Umar va boshqalar rivoyat qilganlar.\r\n    Abu Salama hijratning 94-yili 72 yoshlarida vafot etdilar."
        ]
    },
    {
        "word": "Abu Samh",
        "type": [],
        "definition": [
            "Abu Samh roziyallohu anhuning ismlari Iyad bo'lib, Rasululloh sollallohu alayhi vasallamning xizmatlarini qilar edilar."
        ]
    },
    {
        "word": "Abu Saʼid al-Kotib al-Aloiy",
        "type": [],
        "definition": [
            "Abu Sa'id al-Kotib al-Aloiy Buxoro hokimiga 'sohib al-xarita' (xarita boshlig'i) edilar. Bag'dod mashoyixlaridan hadis ilmidan ta'lim olganlar."
        ]
    },
    {
        "word": "Abu Saʼiyd al-Maqburiy",
        "type": [],
        "definition": [
            "Abu Sa'iyd al-Muqburiy kunyasi bilan mash¬hur bo'lgan bu kishining ismlari Kayson ibn Mavlodir. Maqobirda tug'ilib, o'sha yerda o'sib, ulg'aydi. Hadislarni Umar ibn Xattob, Abu Hurayra, Abu Sa'iyd al-Xudriylardan rivoyat qildilar. Bu zot Valid ibn Abdulmalikning xalifalik davrida Madinada vafot etdilar."
        ]
    },
    {
        "word": "Abu Saʼiyd ibn Abu Fazola",
        "type": [],
        "definition": [
            "Abu Sa'iyd ibn Abu Fazola Ansoriy al-Horisiy sahobalardan edilar. Rasululloh sollallohu alayhi vasallamdan hadislar rivoyat qilganlar. Bu kishidan esa Zayyod ibn Miyno rivoyat qildilar."
        ]
    },
    {
        "word": "Abu Saʼiyd Xudriy",
        "type": [],
        "definition": [
            "Abu Sa'iyd roziyallohu anhuning ismlari Sa'iyd ibn Molik ibn Sinon, kunyalari Abu Sa'iyd Ansoriy Xudriy, kunyalari ismlaridan g'olib kelgan. Rasululloh sollallohu alayhi vasallam bilan o'n ikkita jangda ishtirok etganlar. Alloh yo'lida malomatchining malomatidan qo'rqmaslikka Rasululloh sollallohu alayhi vasallamga bay'at bergan besh sahobaning biri, Xandaq urushida avvalgilardan bo'lib ishtirok etgan ulug' sahobalardan. Yoshlari o'n uchga yetganda otalari Rasululloh sollallohu alayhi vasallamdan u kishining Uhud jangida ishtirok etishiga izn so'raganlarida, yoshlari kichkina bo'lgani sababli izn bermadilar.\r\n    Abu Sa'iyd Xudriy 1170ta hadis to'plab, ko'p hadis rivoyat qiluvchi sahobalar o'rtasida yettinchi o'rinni egalladilar. U kishi otalari Molik ibn Sinon, tog'alari Qatoda ibn Nu'mon, Abu Bakr, Umar, Usmon, Ali, Zayd ibn Sobit, Abu Muso Ash'ariydan rivoyat qilganlar.\r\n    Abu Sa'iyd Xudriy to'plagan hadislardan Imom Buxoriy 16 ta, Imom Muslim esa 52 ta hadisni o'z 'Sahih' kitoblariga kiritdilar.\r\n    Abu Sa'iyd Xudriydan rivoyat qilgan zotlar o'g'illari Abdurahmon, Abdulloh ibn Umar, Abdulloh ibn Abbos, Abu Tufayl, Abu Salama, Nofe', Ikrima, tobe'iynlardan Sa'iyd ibn Musayyib, Ubaydulloh ibn Abdulloh ibn Utba, Toriq, Ibn Shihob va boshqalardir. Agar kishilar u zotdan eshitgan hadislarini yozib berishni so'rashsa, 'Hadisni Qur'onga o'xshatib yozmanglar, lekin buni biz saqlagandek muhofaza etinglar', deb aytar edilar. U zot dunyoda zohid, ibodatgo'y, olim, olgan ilmiga amal qiluvchi zotlardan edilar.\r\n    Bir kuni Abu Sa'iyd Xudriy o'g'illari Abdurahmonning qo'lidan ushlab, 'Baqiy'' degan joyga olib borib: 'Ey o'g'ilcham, agar vafot etsam, shu yerga ko'mgin, marsiya yozib, orqamdan yig'lama, orqamdan o't yoqib yurma, men sababli biror kishiga ozor bermagin', deb vasiyat qildilar. Hijratning 74-yili, jum'a kunida bu foniy dunyodan dorulbaqoga rihlat qildilar va shu kuni 'Baqiy''ga dafn etildilar."
        ]
    },
    {
        "word": "Abu Sohba roziyallohu anhu",
        "type": [],
        "definition": [
            "Abu Sohbaning to'liq ismi Suhayb Abu Sohba Bakriy al-Basriy. U kishi Ibn Abbosning qullaridan biri edilar. Hadislarni xojalari Ibn Abbos, Ibn Mas'ud, Ali ibn Abu Toliblardan rivoyat qildilar."
        ]
    },
    {
        "word": "Abu Soʻsoʻa roziyallohu anhu",
        "type": [],
        "definition": [
            "Abdulloh ibn Abdurrahmon ibn Abu So'so'a Moziniy al-Ansoriy ishonchli hadis to'plovchi tobe'inlardan bo'lganlar. Otalari ulug' sahobalardan edilar. U kishi hadislarni otalaridan, Abu Sa'iyd al-Xudriy, Ato ibn Yasor, Umar ibn Abdul¬aziz, Soib ibn Hammodlardan rivoyat qildilar.\r\n    Bu zot Abu Ja'farning xalifalik davrlarida vafot etdilar."
        ]
    },
    {
        "word": "Abu turob",
        "type": [],
        "definition": [
            "'Abu Turob' – lug'atda 'tuproqning otasi' ma'nosida. Kunya sanalmagan bu kabi iboralar arablarda ko'pincha laqab yoki erkalash ma'nosida ham ishlatiladi. Bu yerda Abu Turob degani 'Tuproqvoy' ma'nosiga yaqin."
        ]
    },
    {
        "word": "Abu Umayr ibn Anas",
        "type": [],
        "definition": [
            "Abdulloh ibn Anas ibn Molik al-Ansoriy, Anas ibn Molikning to'ng'ich o'g'illari bo'lib, Abu Umayr kunyasi bilan mashhur bo'lganlar.\r\n    Hadislarini Rasululloh sollallohu alayhi vasallamning sahobalaridan, xususan, ansoriylardan rivoyat qiladilar."
        ]
    },
    {
        "word": "Abu Umoma al-Bohiliy",
        "type": [],
        "definition": [
            "Abu Umoma al-Bohiliy roziyallohu anhuning asl ismlari Suday ibn Ajlondir. Bu zot Rasululloh sollallohu alayhi vasallamdan 250ta hadis rivoyat qilganlar. U kishi rivoyat qilgan hadislarning ko'pchiligini shomliklar huzuridan topish mumkin.\r\n    Abu Umoma avval Misrda yashaydilar, keyin Shomga ko'chib o'tadilar. Hijratning 86-sanasida o'sha yerda vafot etadilar. Bu zot Shomda eng oxirgi vafot etgan sahoba edilar."
        ]
    },
    {
        "word": "Abu Usayd roziyallohu anhu",
        "type": [],
        "definition": [
            "Abu Usayd kunyasi bilan mashhur bo'lgan bu sahoba Abdulloh ibn Sobit al-Ansoriydirlar.\r\n    U kishi Rasululloh sollallohu alayhi vasallamning xizmatkorlaridan bo'lganlar.\r\n     Rasululloh sollallohu alayhi vasallamdan bir nechta hadislar rivoyat qildilar. Bu zot rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar."
        ]
    },
    {
        "word": "Abu Usmon",
        "type": [],
        "definition": [
            "Abu Usmon – roviylardan birining ismi."
        ]
    },
    {
        "word": "Abu Hayyon",
        "type": [],
        "definition": [
            "Abu Hayyon – ushbu hadis roviylaridan biri. Hadisni undan rivoyat qilgan roviylar shu joyini qisqartirib aytishgan ekan. 'Sahihul Buxoriy'ning 4-juzidagi 3358-raqam ostida o'tgan hadis mazmuniga ishora qilinmoqda."
        ]
    },
    {
        "word": "Abu Hamza",
        "type": [],
        "definition": [
            "Abu Hamza – Anas roziyallohu anhuning kunyasi."
        ]
    },
    {
        "word": "Abu Homid al-Muaddib at-Turnovadiy",
        "type": [],
        "definition": [
            "Abu Homid ibn Iso al-Muaddib at-Turnovadiy Turnovad qishlog'idan bo'lib, adib va shoir edilar."
        ]
    },
    {
        "word": "Abu Horun al-Abdiy",
        "type": [],
        "definition": [
            "Abu Horun al-Abdiy kunyasi bilan mashhur bo'lgan bu tobe'inning asl ismlari Imora ibn Juvayndir. Bu zot hadislarni Abu Sa'iyd al-Xudriy, Abdulloh ibn Umarlardan rivoyat qildilar.\r\n    Bu zotdan Abdulloh ibn Avn, Abdulloh ibn Shuzab as-Savriy, Hamadan va boshqalar rivoyat qilganlar.\r\n    Abu Horun al-Abdiy hijratning 234-sanasida vafot etdilar."
        ]
    },
    {
        "word": "Abu Humayd Soʻidiy",
        "type": [],
        "definition": [
            "Abu Humayd So'idiy kunyasi bilan mash¬hur bo'lgan bu sahobaning ismlari Munzir ibn Sa'd ibn Molikdir. Bu zot Madina ahlidan edilar.\r\n    Rasululloh sollallohu alayhi vasallamdan bir nechta hadislar rivoyat qildilar.\r\n    Bu kishidan Jobir ibn Abdulloh, Urva ibn Zubayr, Abbos ibn Sahl, Muhammad ibn Amr ibn Ato, Xoja ibn Zayd ibn Sobitlar rivoyat qilganlar. Humayd So'idiy Muoviyaning xalifalik davrida vafot etdilar."
        ]
    },
    {
        "word": "Abu Hurayra",
        "type": [],
        "definition": [
            "Abu Hurayra Yamanning Davs qabilasidan edilar. Islomdan oldingi ismlari Abdushshams ibn Soxr edi. Islomga kirganlaridan so'ng Rasululloh sollallohu alayhi vasallam u kishining ismlarini Abdurrahmon deb o'zgartirdilar. Doimo mushukchalari bilan yurganliklari sababli Rasululloh sollallohu alayhi vasallam tomonlaridan Abu Hurayra deb kunyalanganlar. (Hurayra – arab tilida mushukcha degani).\r\n    Abu Hurayra roziyallohu anhu hijratning yettinchi, 'Xaybar' sanasida Islomni qabul qilgan paytlarida o'ttiz yoshda edilar. U kishi Xaybardan qaytayotgan Rasululloh sollallohu alayhi vasallam bilan birga Madinaga keladilar. Abu Hurayra roziyallohu anhu Ashobus Suffa – Rasulullohning masjidlaridagi suffada yashab, u kishidan hadis eshitish bilan mashg'ul bo'lgan sahobalarning biri edilar. Shu sababli Islomga kech kirganlariga qaramay, sahobalar orasida eng ko'p hadis rivoyat qilgan kishi hisoblanadilar. U kishi 5374ta hadis rivoyat qilganlar va bu hadislar Taqiy ibn Muhammadning musnadlarida keltirilgan.\r\n    Abu Hurayra keng yelkali, qoramtir rangli, ikki oldingi tishlarining orasi ochiq, yumshoq tabiat, hazilkash kishi edilar. Yosh bolalarni ko'rsalar, ularni kuldirib, bozordagi kishilarni qissalar aytib, ko'nglini xushlantirib yurar, lekin o'zlari yolg'iz qolsalar, tunlarni ibodat bilan bedor o'tkazadigan kishi edilar.\r\n    Abu Hurayra ko'p vaqtlarini Rasululloh sollallohu alayhi vasallamning suhbatlarida o'tkazar edilar. Biror hadisni eshita olmay qolishdan qo'rqib, ko'p paytlarida ochlikdan bukchayib qolar edilar.\r\n    Abu Hurayra sahobalarning ichida eng zehni o'tkiri edilar. Bu haqda Imom Buxoriy, Muslim va Termiziylar u kishining o'zidan rivoyat qiladilar:\r\n    'Ey Rasululloh, sizdan ko'p narsani eshitamanu yodlab qololmayman', dedim. U kishi:\r\n    'Ridoyingni yerga yoz', dedilar. Ridoyimni yozdim. Menga ko'p hadis aytdilar. Aytgan hadislaridan biror narsani esimdan chiqarmadim', deydilar.\r\n    Tolha ibn Ubaydulloh: 'Abu Hurayraning Rasulullohdan biz eshitmaganimizni ham eshitganlariga hech shak yo'q', deydilar.\r\n    Ibn Umar: 'Abu Hurayra hadisni mendan ko'ra yaxshi biladilar', deydilar.\r\n    Ubay ibn Ka'b: 'Abu Hurayra Rasulullohdan boshqa kishi so'ray olmaydigan narsalarni so'rashga jur'at etardi', deydilar.\r\n    Bir kishi Zayd ibn Sobitdan bir masalani so'rab kelganda, u kishi: 'Abu Hurayraga bor. Bir kuni men, Abu Hurayra va falonchi masjidda Allohning zikri va duo bilan mashg'ul edik. Shu payt Rasululloh sollallohu alayhi vasallam oldimizga chiqib o'tirdilar va:\r\n    'Nimani duo qilayotgan bo'lsangiz, shunda davom eting', dedilar. Men va hamrohim duo qildik, Rasululloh 'Omiyn', deb turdilar. Abu Hurayra:\r\n    'Allohim, Sendan ikki hamrohim so'raganlarini va esdan chiqmaydigan ilmni so'rayman', dedilar. Rasululloh sollallohu alayhi vasallam 'Omiyn' dedilar.\r\n    'Biz ham esdan chiqmaydigan ilm so'raymiz, ey Rasululloh', dedik. Rasululloh sollallohu alayhi vasallam:\r\n    'Buni sizlardan oldin davslik g'ulom (Abu Hurayra) so'radi', dedilar.\r\n    Marvon ibn Hakamning voliysi va kotiblari Solim Abu Za'za'a rivoyat qiladilar: 'Marvon ibn Hakam Abu Hurayrani chaqirib, u kishidan hadis so'ray boshladilar. Men hadislarni yozib oldim. Bir yil o'tgach, yana Abu Hurayrani chaqirgan Marvon u kishidan men yozib olgan hadislarni so'radilar. Abu Hurayra biron bir harfni yoki so'zni ortiqcha yoki noqis, oldin yoki ke¬yin aytmadilar'.\r\n    Abu Hurayradan hadis rivoyat qilganlarning soni sakkiz yuz kishidan ortadi. Jumladan, Abu Bakr, Umar, Usmon, Fazl ibn Abbos, Ubay ibn Ka'b, Usoma ibn Zayd, Oisha, Ibn Umar, Ibn Abbos, Jobir ibn Abdulloh, Anas ibn Molik; tobe'iynlardan: Sa'iyd ibn al-Musayyib, Ibn Siyrin, Abdulloh ibn Sa'laba, Urva ibn az-Zubayr, Salmon ibn Yasir, Irok ibn Molik, Solim ibn Abdulloh ibn Amra, Ato' ibn Abu Rubboh, Ato' ibn Yasar va boshqalar.\r\n    Abu Hurayra og'ir kasal bo'lib qolganlarida u kishini ko'rgani Marvon ibn Hakam keladilar. Marvon Abu Hurayraga:\r\n    'Alloh sizga shifo bersin', deganlarida Abu Hurayra:\r\n    'Allohim, Senga yo'liqishimni sevdim, Sen ham Senga yo'liqishimni sev', dedilar.\r\n    Marvon ibn Hakam Abu Hurayraning huzurlaridan chiqib, bozorning o'rtasiga yetmaslaridan Abu Hurayraning jonlari uzildi.\r\n    Abu Hurayra 57-hijriy sanada vafot etdilar. Janozalarini Valiyd ibn Uqba ibn Abu Sufyon o'qidilar."
        ]
    },
    {
        "word": "Abu Yusuf",
        "type": [],
        "definition": [
            "Ya'qub ibn Ibrohim ibn Habib al-Ansoriy"
        ]
    },
    {
        "word": "Abul Asvad roziyallohu anhu",
        "type": [],
        "definition": [
            "Abul Asvad kunyasi bilan mashhur bu tobe'inning ismlari Zolim ibn Amrdir. Bu zot tili o'tkir, zakovatli, fahmi kuchli, dono kishi bo'lganlar.\r\n    Abul Asvad Rasululloh sollallohu alayhi vasallam davrlarida Islomga kirganlar-u, lekin Rasululloh sollallohu alayhi vasallam bilan ko'rishmaganlar.\r\n    Ali roziyallohu anhu bilan Jamal voqeasida ishtirok etdilar. Ibn Abbos agar Basradan chiqib ketadigan bo'lsalar, o'rinlariga Abul Asvadni boshliq qilib ketar, bu ishga xalifa Ali roziyallohu anhu ham iqror bo'lar edilar.\r\n    Abul Asvad hijratning 85-yili Basrada vafot etdilar."
        ]
    },
    {
        "word": "Abul Qosim ash-Shuʼaybiy",
        "type": [],
        "definition": [
            "Abul Qosim ash-Shu'aybiy Buxoro ahlidan. Abu Komil al-Basiriy aytadilar: 'Men Abul Qosim ash-Shu'aybiydan 'al-Faraj ba'd ash-shiddah' ('Qiyinchilikdan keyingi yengillik') kitobidan ta'lim olganman. U kishining uch o'g'li bo'lib, uchovlari ham faqih edilar. Ular bizdan hadisdan ta'lim olganlar'."
        ]
    },
    {
        "word": "Abul Hayyaj roziyallohu anhu",
        "type": [],
        "definition": [
            "Abul Hayyaj kunyasi bilan mashhur bo'lgan bu sahobaning ismlari Habbon ibn Husayn Asadiy al-Kufiydir.\r\n    Bu zot hadis ilmida ishonchli deb tan olingan tobe'inlardan bo'lib, Ammor roziyallohu anhuning kotibi edilar.\r\n    Hadislarni Ali va Ammor roziyallohu anhulardan rivoyat qildilar.\r\n    Bu zotdan ikki o'g'illari Jarir va Mansur, Abu Voil, Sha'biylar rivoyat qilganlar."
        ]
    },
    {
        "word": "Abulbaqo Ismoil ibn Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining o'g'illari"
        ]
    },
    {
        "word": "Abulfazl Isʼhoq ibn Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining o'g'illari."
        ]
    },
    {
        "word": "Abul-Fath Muhammad ibn Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining o'g'illari. (777-814)."
        ]
    },
    {
        "word": "Abulfido Ismoil ibn Kasir ",
        "type": [],
        "definition": [
            "Mashhur mufassir. Imom Muhammad ibn Jazariy rahmatullohi alayhining ustozlari."
        ]
    },
    {
        "word": "Abulxayr Muhammad ibn Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining o'g'illari. (t. 789)"
        ]
    },
    {
        "word": "Avvaabiyn namozi",
        "type": [],
        "definition": [
            "Bu namoz Shom namozidan keyin o'qiladi va olti rak'at bo'ladi. Avval to'rt, keyin ikki rak'at yoki ikki rak'atdan qilib o'qiladi."
        ]
    },
    {
        "word": "Avdana",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan. Peshku tumanidagi Avdona qishlog'i. Xatfar daryosi bo'yida joylashgan."
        ]
    },
    {
        "word": "Avliyo",
        "type": [],
        "definition": [
            "valiy so'zining ko'pligi, Xudoga yaqin odam. Allohning zoti va sifatlarini yaxshi bilgan, uning buyurganlarini bajarib, gunoh ishlardan o'zini saqlovchi, dunyo lazzati va shahvoniy ishlardan yuz o'giruvchi kishi."
        ]
    },
    {
        "word": "Avlod ",
        "type": [],
        "definition": [
            "bolalar, o'g'illar, sulola, zurriyod, shajara, bola-chaqa."
        ]
    },
    {
        "word": "Avoliy",
        "type": [],
        "definition": [
            "Avoliy – Madinadan sharq tomonga ikki mildan sakkiz milgacha bo'lgan masofadagi joylar va kichik qishloqlarning nomi."
        ]
    },
    {
        "word": "Avom",
        "type": [],
        "definition": [
            "oddiy xalq, savodsiz."
        ]
    },
    {
        "word": "Avrat",
        "type": [],
        "definition": [
            "'Avrat' so'zi lug'atda 'nuqson', 'ayb' ma'nolarini bildiradi. Shariatda, berkitilishi vojib va unga nazar solish harom bo'lgan narsa avratdir."
        ]
    },
    {
        "word": "Avs ibn Avs",
        "type": [],
        "definition": [
            "Avs ibn Avs as-Saqafiy Rasululloh sollallohu alayhi vasallam huzurlariga Saqif qabilasi nomidan elchi bo'lib kelganlarida Rasululloh sollallohu alayhi vasallam bu zotga namoz va tahoratni o'rgatganlar. Shuning uchun ham Avs ibn Avs roziyallohu anhu Rasululloh sollallohu alayhi vasallamdan namoz va tahoratga oid hadislar rivoyat qilganlar.\r\n    Avs ibn Avs roziyallohu anhu rivoyat qilgan hadislarning bizgacha yetib kelishiga Abu al-Ash'as, San'oniy, Abu Asmo' ar-Rahabiy, Uboda ibn Nasaiy, Abdulmalik ibn Mug'iralar katta hissa qo'shganlar.\r\n    Bu zot hijratning 59-yili Shomda vafot etdilar."
        ]
    },
    {
        "word": "Avf ibn Molik",
        "type": [],
        "definition": [
            "Avf ibn Molik Ashja'iy al-G'atafoniy, kunyalari Abu Abdurrohman. Haybar g'azotida birinchilardan bo'lib Rasululloh sollallohu alayhi vasallam bilan ishtirok etganlar. Makka fath etilgan kuni Ashja' qabilasi nomidan bayroq ko'targanlar. Muhojir Abu Dardo bilan birodar bo'lgan. Hums, Shom, Damashqda istiqomat qilganlar. Avf ibn Molik Islom uchun g'ayratli bo'lgan sahobalardan edilar.\r\n    Hammasi bo'lib, Rasululloh sollallohu alayhi vasallamdan 67ta hadis rivoyat qilganlar. U kishidan Abu Ayyub al-Ansoriy, Abu Hurayra, Miqdom ibn Ma'diyakrib, tobe'inlardan Abu Muslim Xuvloniy, Muslim ibn Qurza, Shaddod ibn Abu Ammor, Roshid ibn Sa'd, Yaziyd ibn Asomm, Solim ibn Omir, Abu Burdata ibn Abu Muso, Shurayx ibn Ubayda va boshqalar rivoyat qilganlar. Uchta 'Sahih' sohiblari bu kishi rivoyat qilgan hadislardan o'z kitoblariga kiritganlar.\r\n     Bu zot hijratning 73-sanasida Damashqda vafot etadilar."
        ]
    },
    {
        "word": "Agʻzun",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan. Kogon tumanidagi Ozg'un qishlog'i."
        ]
    },
    {
        "word": "Adab",
        "type": [],
        "definition": [
            "'Adab' so'zi (ko'pligi 'odob') 'ma'daba' o'zagidan olingan bo'lib, odamlarni yaxshilikka, ma'naviy ziyofatga chaqirishni anglatadi va maqtovga sazovor xulq atvorlarga, ish amallarga nisbatan qo'llaniladi. Axloq qalbdagi sifat bo'lib, 'odob' ana shu go'zal axloqlarning namoyon bo'lishidir."
        ]
    },
    {
        "word": "Adabul qoziy",
        "type": [],
        "definition": [
            "Sodrush Shahiydonning kitobi"
        ]
    },
    {
        "word": "Adad",
        "type": [],
        "definition": [
            "son, sanoq, hisob."
        ]
    },
    {
        "word": "Ad-Deboj al Muzahhab",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu asari 'Muxtasarun fiy usulil hadis' deb ham ataladi. Muallif o'zining bu asarini Tiybiyning 'Al-Xulosa fiy usulil hadis' nomli kitobidan va o'zining Mishkotga bitgan 'Al-Koshif an haqoiqis sunan' degan hoshiyasidan qisqartirib olgan. Bu kitob ham chop etilgan."
        ]
    },
    {
        "word": "Ad-durratul maʼniyya fiy qiroatil aimma as-salasa al mardiyya ",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Adib",
        "type": [],
        "definition": [
            "tarbiyachi, muallim; adabiy asarlar yozish bilan shug'ullanuvchi, adabiyotchi."
        ]
    },
    {
        "word": "Adiy ibn Hotim",
        "type": [],
        "definition": [
            "Adiy ibn Hotim ibn Abdulloh ibn Sa'd ibn Xashraj at-Toiy, kunyalari Abu Vahb. Adiy ibn Hotim o'zining saxovatliligi bilan mashhur bo'lgan Hotim at-Toiyning o'g'lidir. U Rasululloh sollallohu alayhi vasallamning Toy qabilasiga qilgan safarlarida Suriyaga qochgan edi.\r\n    Toy qabilasidan asirga tushganlar orasida uning kichik singlisi Saffona ham bor edi. Rasululloh sollallohu alayhi vasallam barcha asirlarga, xususan, Adiyning singlisiga otasining shuhrati va qavmining unga bo'lgan sevgi va hurmati yuzasidan juda ham yaxshi muomala qildilar. Saffona teridan qilingan alohida chodirda saqlandi, butun ehtiyojlari qondirildi, istagan paytida eng yaxshi shartlar bilan mamlakatiga ketishiga ham izn berildi. Bunday muomalalardan mamnun bo'lgan Saffona musulmonlikni qabul qildi. So'ngra akasining huzuriga borib, uni Rasululloh sollallohu alayhi vasallam bilan yarashishi uchun jo'natdi. Bu hodisa hijratning 9-yili bo'lib o'tdi.\r\n    Adiy ibn Hotimning o'zlari shunday hikoya qiladilar:\r\n    'Men Madinaga ilk bor kirib kelganimda musulmonlar xursandlik bilan kutib oldilar. 'Adiy keldi! Adiy keldi!' deb, sevinchlarini izhor qildilar. Holbuki, men hali nasroniy diynida edim'.\r\n    Rasululloh sollallohu alayhi vasallam ham Adiyni yaxshi qarshiladilar. Uylariga olib kelib, yagona po'staklarini uning ostiga solib berib, o'zlari yerga o'tirdilar. Bularning hammasi Adiyga juda qattiq ta'sir qilib, qalbida hidoyat¬ga yo'l ochdi. Adiy ibn Hotim Rasululloh alayhissalom bilan bo'lgan ilk muloqotlaridayoq Islomni qabul qildi. U oqil va ehsongo'y sahobalardan bo'lib, johiliyatda ham, Islomda ham Toy qabilasining raislaridan bo'ganlar.\r\n    Diyndan qaytganlar bilan bo'lgan 'Ridda' urushida Adiy roziyallohu anhu katta jonbozliklar ko'rsatdilar.\r\n    U kishi Iroqni fath etishda ham ishtirok etdilar. So'ng Kufaga ko'chib o'tdilar. Ali ibn Abu Tolib roziyallohu anhu bilan birga Jamal, Siffiyn, Nahavon urushlarida ishtirok etdilar. Siffiyn urushida Adiy ibn Hotim roziyallohu anhuning ko'zlariga yara chiqib, betob bo'lgan edilar.\r\n    Hammasi bo'lib, Rasululloh sollallohu alayhi vasallamdan 66ta hadis rivoyat qildilar. Adiy ibn Hotim 120 yoshlarida, hijratning 68-yili Kufada vafot etdilar."
        ]
    },
    {
        "word": "Adiyat surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 11 oyatdan iborat.\r\n    Ushbu surai karimaning nomi ham o'zining birinchi oyatidagi birinchi so'zdan olingan. 'Adiyat' so'zi 'chopuvchilar' degan ma'noni bildiradi. Ushbu surada esa 'adiyat'dan mujohidlarning Alloh taoloning yo'lidagi jihodda chopuvchi otlari ko'zda tutilgan. Alloh subhanahu va taolo ushbu surai karimada mujohidlar mingan otlarning turli sifatlari ila qasam ichib, inson o'z Robbi ne'matining qadriga yetmasligini ta'kidlaydi. Shu bilan birga, u yaxshilik, molu dunyoni xush ko'rishi ham alohida ta'kidlanadi.\r\n    Va, nihoyat, oxiratda hamma narsa ayon bo'lishi bayon qilinadi."
        ]
    },
    {
        "word": "Adl",
        "type": [],
        "definition": [
            "adolatli, to'g'ri, to'g'rilik; shayxni axloqiy baholash tushunchasi; gunoh va muruvvatsizlik qilmaydigan (inson)."
        ]
    },
    {
        "word": "Ado ",
        "type": [],
        "definition": [
            "Qilinishi lozim bo'lgan narsani shariatda belgilangan vaqtda qilishni 'ado' deyiladi."
        ]
    },
    {
        "word": "Ajal",
        "type": [],
        "definition": [
            "belgilangan vaqt, muhlat, umrning poyoni."
        ]
    },
    {
        "word": "Ajam",
        "type": [],
        "definition": [
            "arab xalqlari va mamlakatlaridan boshqalar; begona, chet kishi. Arablardan boshqa Sharq xalqlarining umumiy nomi."
        ]
    },
    {
        "word": "Ajbuz-zanab",
        "type": [],
        "definition": [
            "'Ajbuz-zanab' – umurtqaning eng so'nggi pog'onasida, dumg'azada joylashgan, sedanadek keladigan urug'. U insonning urug'i hisoblanadi."
        ]
    },
    {
        "word": "Ajva",
        "type": [],
        "definition": [
            "Ajva – xurmoning bir turi. Madina xurmolarining eng yaxshi navlaridan bo'lib, sifati va foydaliligi bilan boshqa navlardan ajralib turadi."
        ]
    },
    {
        "word": "Ajdod",
        "type": [],
        "definition": [
            "bobolar, bobokalonlar, ota-bobolar."
        ]
    },
    {
        "word": "Ajr",
        "type": [],
        "definition": [
            "to'lanadigan haq, mukofot, savob. Yaxshilikka yarasha beriladigan turli mavom va martabalar, nozu ne'matlar."
        ]
    },
    {
        "word": "Aziz al-Karminiy",
        "type": [],
        "definition": [
            "Abul Faraj Aziz ibn Abdulloh al-Karminiy Shofe'iy mazhabining yirik faqihlaridan bo'lib, bu kishining tavsiflari Buxoro va Karmanada mashhur edi."
        ]
    },
    {
        "word": "Azl",
        "type": [],
        "definition": [
            "Azl – homilaning oldini olish maqsadida erkakning urug'ni bachadondan tashqariga to'kishi."
        ]
    },
    {
        "word": "Azob",
        "type": [],
        "definition": [
            "qiynoq, gunoh uchun belgilangan jazo."
        ]
    },
    {
        "word": "Azozil",
        "type": [],
        "definition": [
            "iblis, shayton."
        ]
    },
    {
        "word": "Azon",
        "type": [],
        "definition": [
            "'Azon' lug'atda 'bildirish' ma'nosini anglatadi. Shariatda esa, farz namozning vaqtini maxsus qavl ila bildirishga 'azon' deyiladi. Azon aytish hijriy birinchi sanadan boshlangan. Avval boshda musulmonlar masjidda to'planishar, namoz vaqtini kutib o'tirishar, vaqt bo'lganda esa, namoz o'qir edilar."
        ]
    },
    {
        "word": "Azrakyon ",
        "type": [],
        "definition": [
            "buxorolik majusiy tijoratchining ismi bo'lib, u kishi tijorat maqsadida Buxorodan Singa (Xitoyga), undan keyin Basraga borganlar. Ali ibn Abu Tolib raziyallohu anhuning qo'llarida musulmon bo'lganlar."
        ]
    },
    {
        "word": "Azroil",
        "type": [],
        "definition": [
            "jon oluvchi farishtaning nomi; o'lim farishtasi."
        ]
    },
    {
        "word": "Azududdin Abdurrohman ibn Rukniddin ¬Abdulgʻaffor Bakriy Shabongariy Iyjiy",
        "type": [],
        "definition": [
            "Azududdin Iyjiy nomi bilan mashhur bo'lgan bu alloma Sherozga qarashli Iyj degan joyda tug'ilib o'sgan. U kishi qozi Bayzoviyning shogirdlari bilan birga bo'lgan. Ayniqsa, Bayzoviyning bosh shogirdlaridan bo'lmish Zayniddin Hangiy rahmatullohi alayhidan ko'p narslarni o'rgangan. Ko'proq Sultoniyada yashagan. Azududdin Iyjiy rahmatullohi alayhi uzoq vaqt Samarqandda yashab, ustozlik qilgan, ko'plab shogirdlarni tarbiyalab yetishtirgan. Jumladan, Allomai Taftazoniy rahmatullohi alayhiga ham ustoz bo'lgan.\r\n     Shayx Azududdin Iyjiy rahmatullohi alayhi o'z vaqtining keng tarqalgan ilmlarida peshqadam bo'lgan, ko'plab kitoblar ta'lif qilgan."
        ]
    },
    {
        "word": "Aimma",
        "type": [],
        "definition": [
            "imomlar, peshvolar, rahnamolar, raislar, rahbarlar."
        ]
    },
    {
        "word": "Ayla",
        "type": [],
        "definition": [
            "Ayla – Madina bilan Misr o'rtasida, Shom yo'lida, Qulzum (Qizil dengiz) sohilida joylashgan shahar."
        ]
    },
    {
        "word": "Ayyub alayhissalom",
        "type": [],
        "definition": [
            "Ana shunday murakkab bir davrda Alloh taolo Banu Isroilga Ayyub alayhissalomni nabiy qilib yubordi. U zotning mol-mulklari, ahli ayollari ko'p edi. Alloh taolo Ayyub alayhissalomdan ularning barchasini olib qo'yib, boshlariga turli musibatlarni soldi va badanlariga ham dard berib sinadi. Ayyub alayhissalomdan barcha yuz o'girdi, faqatgina jufti halollari – ayollari har qanday vaziyatda ham u zot alayhissalom bilan birga bo'ldi.\r\n    Ayyub alayhissalom Suriyaning shimoliy o'lkalarida bir joydan ikkinchisiga ko'chib yurib, kishilarni Alloh taoloning ibodatiga da'vat qildilar.\r\n    Ayyub alayhissalom Is'hoq alayhissalomning avlodidirlar.\r\n    Qur'oni Karimda ham, sunnati mutohharada ham Ayyub alayhissalomning o'zlariga yetgan musibatga sabr qilganlaridan boshqa hayotlari, qavmlari yoki da'vatlari haqida ma'lumotlar kelgan emas. Shuning uchun biz u zotning zikrlari kelgan oyati karimalarni o'rganish ila kifoyalanamiz.\r\n    'Biz senga xuddi Nuh va undan keyingi nabiylarga vahiy yuborganimizdek vahiy yubordik. Biz Ibrohim, Ismoil, Is'hoq, Ya'qub va uning avlodlari, Iyso, Ayyub, Yunus, Horun va Sulaymonga vahiy yubordik. Dovudga esa Zaburni berdik' (Niso surasi, 163-oyat).\r\n    Demak, hamma payg'ambarlarga vahiy yuborayotgan, ularni bandalar ichidan tanlab olayotgan Zot bitta – Alloh. Mazkur payg'ambarlarga vahiy yuborgan o'sha Zot ularning qatorida Ayyub alayhissalomga ham vahiy yuborib, u zotni ham O'ziga payg'ambar qilib oldi.\r\n    Ayyub alayhissalom Alloh taoloning solih bandasi, tanlab olgan payg'ambaridirlar. Boshqa payg'ambarlar qatori, Alloh taolo u zotni ham sinovga solgan. O'zining oxirgi payg'ambari Muhammad sollallohu alayhi vasallamga va u zotning ummatlariga ibrat, tasalli bo'lishi uchun o'sha sinov haqida xabar berilmoqda. Bu sinov mol-dunyo, ahli ayol va salomatlik borasida bo'lgan. Ayyub alayhissalom bu sinovlarning hammasiga go'zal sabr qilib, biror lahza ham Allohdan uzilmadilar. U Zotga bo'lgan ishonchlari susaymay, roziligini tilab turdilar.\r\n    Shayton esa mashaqqatli sinov lahzalarida Ayyub alayhissalom bilan birga qolgan barcha muxlis kishilarni vasvasa qilar edi. O'sha muxlislar ichida u zotning xotinlari ham bor edi. U ayolga ham turli tomondan vasvasa qilinardi. Unga: 'Agar Alloh Ayyubni yaxshi ko'rganida, uni bunday baloga giriftor etmas edi', deyilardi. Bu gaplar Ayyub alayhissalomga ham yetib keldi. Xotinlari mazkur gaplardan ba'zilarini aytganida, u zot imkon topganlarida ayollarini urishga qasam ichdilar.\r\n    'O'shanda u Robbiga nido qilib: 'Albatta, meni shayton mashaqqat va azob ila tutdi', dedi' (Sod surasi, 41-oyat).\r\n    Ayyub alayhissalom hamma narsa Alloh taolodan bo'lishini yaxshi bilsalar ham, ko'ngilsiz narsani odob yuzasidan shaytonga nisbat berdilar. Shuningdek, bu shikoyat bilan muxlis kishilarini shayton vasvasaga solayotganiga, bundan o'zlari ham ozorlanayotganlariga ishora qildilar.\r\n    Alloh taolo u zotning bu iltijolariga, yolvorishlariga munosib javob berdi:\r\n    'Oyog'ing ila tepgin! Bu cho'miladigan va ichiladigan sovuq (suv)' (42-oyat).\r\n    Ya'ni 'Oyog'ing bilan yerni tepgin', dedi. Ayyub alayhissalom Allohning amriga itoat etib, oyoqlari bilan yerni tepgan edilar, u yerdan suv chiqdi.\r\n    Demak, shu suvga cho'milgan odam shifo topadi. Undan ichilsa, ichki dardlarga davo bo'ladi. Shunday bo'ldi ham.\r\n    Ayyub alayhissalom mazkur suvda cho'milib, undan ichib shifo topganlaridan so'ng Alloh taolo u zotga ahli oilalarini qaytarib berdi. Ular bilan birga yana o'shancha ham berdi. Bu ishlar qanday amalga oshganini O'zi biladi. O'lib ketganlarini tiriltirganmi, qochib ketganlarini qaytarganmi yoki butunlay yangitdan berganmi – bu tomoni Alloh taoloning O'zigagina ma'lum.\r\n    Shunday qilib Ayyub alayhissalom butunlay sog'ayib ketdilar, ahli oilalari ham ikki barobar bo'lib qaytdi. Endi uchinchi narsa qoldi: imkon topganida eng og'ir paytlarda ixlos bilan yonida turgan vafodor xotinlarini urishga qasam ichib qo'ygan edilar, o'sha qasamga amal qilish. Bu mushkul ish edi. Shunday vafodor va muxlisa ayolni, og'ir va mashaqqatli lahzalarda yelkadosh bo'lgan, balo-ofatlarni birga totgan yo'ldoshni mushkul ariganidan keyin yuz tayoq urish kerak.\r\n    Darhaqiqat, bu og'ir muammo edi. Lekin Alloh taolo O'z rahmati ila bu muammoni ham hal etdi. Alloh taolo Ayyub alayhissalomga dedi:\r\n    'Qo'lingga bir dastani ol-da, u bilan ur. Qasamingni buzma'. Biz uni sabrli topdik. U naqadar yaxshi banda! Albatta, u sertavbadir' (44-oyat).\r\n    Alloh taolo Ayyub alayhissalomga qasamlarini qanday ado etishni o'rgatmoqda hamda u zotga O'zi tomonidan bunchalik fazlu karam ko'rsatilishining sababini bayon qilmoqda:\r\n    'Qo'lingga bir dastani ol-da, u bilan ur. Qasamingni buzma'.\r\n    'Ey Ayyub, necha marta urishni aytgan bo'lsang, o'shancha novdani bir dasta qilib ol-da, u bilan xotiningni ur. Shunda qasamingni ado etgan bo'lasan, qasaming buzilmaydi.\r\n    Bunchalik fazlu karam ko'rsatilishining sababi:\r\n    'Biz uni sabrli topdik'.\r\n    'Sinov kelganda, Ayyub go'zal tarzda sabr qildi. Bizga bo'lgan ishonchi susaymadi. Bizning roziligimizni topishdan bir lahza ham umidini uzmadi'.\r\n    'U qanday ham yaxshi banda!'\r\n    Ayyub nihoyatda yaxshi bandadir.\r\n    'Albatta, u sertavbadir'.\r\n    Har bir narsada Alloh taoloning O'zigagina qaytadi.\r\n    Tarixchilarning ta'kidlashlaricha, Ayyub alayhissalomning farzandlaridan biri Zulkifl alayhissalomdirlar."
        ]
    },
    {
        "word": "Aqaba",
        "type": [],
        "definition": [
            "Hajda birinchi hayit kuni shaytonga tosh otiladigan joy. Otiladigan toshlarning soni yetti dona bo'ladi. Tosh otadigan vaqt hayitning birinchi kuni bomdoddan keyin kiradi, Quyosh chiqib, to zavol vaqti kirguncha otsa, yaxshi bo'ladi, Quyosh botguncha otsa ham ruxsat. Lekin kechasi otsa, makruh bo'ladi."
        ]
    },
    {
        "word": "Aqiyda",
        "type": [],
        "definition": [
            "'Aqiyda' so'zi arabcha 'aqada' fe'lidan olingan bo'lib, bir narsani ikkinchisiga mahkam bog'lash ma'nosini anglatadi. Bu so'zning jami (ko'plik shakli) 'aqoid' bo'ladi. Islom aqiydasi musulmon insonni ma'lum bir narsalar bilan mahkam bog'lab turadigan e'tiqodlar majmuasidir.\r\n    Aslida biror narsaga e'tiqod qilish uchun uni hech qanday shubha qoldirmaydigan darajada yaxshi bilish kerak. Buning uchun avvalo o'sha narsani idrok qilish kerak. Keyin esa o'sha hissiy idrok ilmiy ma'rifatga aylanishi lozim. So'ngra zamon o'tishi, boshqa dalillarning sobit bo'lishi ila o'sha ilmimiz tasdiqlanadi va unga bo'lgan ishonchimiz kuchli bo'ladi. Mazkur ilmga bo'lgan ishonch ongimizda mustahkam ravishda qaror topganidan so'ng, u bizning aqlimizga va qiladigan ishlarimizga o'z ta'sirini o'tkazadigan bo'ladi.\r\n    Qachonki ma'lum bir ilm bizning fikrimizga aylanib, his-tuyg'ularimizni yo'llaydigan va harakatlarimizni boshqaradigan holga yetganda, aqiydaga aylangan bo'ladi. Demak, aqiyda ilmga asoslangan bo'lishi lozim."
        ]
    },
    {
        "word": "Aqiyqa",
        "type": [],
        "definition": [
            "farzand tug'ilgani shukronasiga beriladigan ziyofat. Uni chaqaloq 7, 14 yoki 21 kunlik bo'lganda qilish yaxshi. Bunga imkoni bo'lmaganlar xohlagan vaqtda bajarsalar ham bo'laveradi. Uning hukmi sunnat."
        ]
    },
    {
        "word": "Aqit",
        "type": [],
        "definition": [
            "Aqit – sutni quritib tayyorlanadigan yegulik."
        ]
    },
    {
        "word": "Aqoid ilmi va unga bogʻliq masalalar",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining qalamlariga mansub 'Aqoid ilmi va unga bog'liq masalalar' deb nomlangan kitoblari.\r\n    Ushbu kitobda aqiyda ilmiga bog'liq dolzabr mavzular keng yoritilgan. Shuningdek aqoid ilmining ko'zga ko'ringan imomlari va ularning bu sohada qilgan xizmatlari xaqida ma'lumotlar keltirilgandir."
        ]
    },
    {
        "word": "Aqro",
        "type": [],
        "definition": [
            "'Aqro' (yoki 'halqo') – bu ibora arablarda koyish ma'nosida ishlatiladigan so'zlardandir. 'Aqro' – 'bo'g'izidan so'yilgur' degani, 'halqo' esa ikki xil ma'noni bildiradi: birinchisi 'sochi qirilgur', ikkinchisi 'bo'g'izidan bo'g'ilgur'. Ammo bu ibora arablarda asl mazmunida, ya'ni duoibad sifatida aytilmay, oddiy koyish ma'nosida ishlatiladigan bo'lib ketgan. Bu o'zbek tilidagi 'tushmagur', 'o'lmagur' degan so'zlarga to'g'ri keladi."
        ]
    },
    {
        "word": "Al avvaliyya fiy ahadisil avvaliyya",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al algʻoz al Jazariyya",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al arbaʼuna hadisan",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari"
        ]
    },
    {
        "word": "Al bayan fiy xotti Usman",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al Javharoh fin-nahv",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari."
        ]
    },
    {
        "word": "Al ijla vat taʼzim fiy maqomi Ibrohim",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al Isoba fi lavazim al kitaba",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari."
        ]
    },
    {
        "word": "Al ihtida ila maʼrifatil vaqf val ibtida",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al Iʼlam fi ahkamil idgʻom",
        "type": [],
        "definition": [
            "Ahmad al-Muqriyning 'Urjuza'siga sharh. Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al iʼtirodul mubdiy li vahm",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari."
        ]
    },
    {
        "word": "Al qosd al Ahmad fiy rijal musnad Ahmad",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al masʼad al Ahmad fiy xotm musnad Ahmad",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al musnad al Ahmad fiy ma taʼallaq bimusnad Ahmad",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al Muhib Muhamad ibn Ahmad Hoyim",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Al favaid al mujammaʼah fiy zavaidil kutub al arbaʼah",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al hidaya fiy ilmir rivaya",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al hisn al hasin min kalam sayyidil mursalin ",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al ʼaqd as-samin fiy algʻozil Qurʼan al mubin ",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al-ajviba li asilatil-Iskandari min muluki Tabriz",
        "type": [],
        "definition": [
            "'Tabriz podshohlaridan Iskandarning savollariga javoblar'.\r\n    Avvallari dindorligi yaxshi darajada bo'lgan podshohlar o'zlarida paydo bo'lgan savollarni ulamolarga yo'llab, javob va fatvolar olib turishgan. O'shalardan biri Tabrizning podshohi bo'lgan Iskandar ismli kishi Sayyid Sharif Jurjoniy rahmatullohi alayhiga bir necha savollar bilan murojaat qilgan. U zot ularga javob bergan. Shu bilan birga, boshqalar ham foydalansin degan niyatda mazkur savol-javoblar qog'ozga tushirilib, risola shakliga keltirilgan."
        ]
    },
    {
        "word": "Alayhir rahma ",
        "type": [],
        "definition": [
            "u kishiga rahmat bo'lsin. Avliyolar nomi tilga olinganda aytiladigan ibora."
        ]
    },
    {
        "word": "Alayhissalom ",
        "type": [],
        "definition": [
            "u kishiga salomlar bo'lsin. Payg'ambarlar nomi tilgan olinganda aytiladigan ibora."
        ]
    },
    {
        "word": "Alaq",
        "type": [],
        "definition": [
            "Alaq – laxta qon; zuluk."
        ]
    },
    {
        "word": "Al-Aqoid al-Azudiya",
        "type": [],
        "definition": [
            "Shayx Azududdin Iyjiy rahmatullohi alayhining kitobi. Aqiyda ilmiga oid bu kitob. Ushbu kitob Azududdin Iyjiy rahmatullohi alayhi yozgan oxirgi kitobidir."
        ]
    },
    {
        "word": "Alam",
        "type": [],
        "definition": [
            "alomat, belgi, bayroq. Dard, qayg'u, g'am, kulfat, falokat, musibat."
        ]
    },
    {
        "word": "Alambardor",
        "type": [],
        "definition": [
            "bayroqdor, yalavbardor; din ilmlarining peshvosi, ergashishga haqli zot."
        ]
    },
    {
        "word": "Al-Vishoh",
        "type": [],
        "definition": [
            "Sodrush shariy'a Ubaydulloh ibn Mas'ud al-Buxoriyning kitobi"
        ]
    },
    {
        "word": "Al-Juʼfiy",
        "type": [],
        "definition": [
            "Payg'ambar alayhissalom zamonlarida Ju'fiy ibn Sa'd al-Ashira qabilasi bo'lgan. Bu shu qabilaga berilgan nisbat."
        ]
    },
    {
        "word": "Ali al-Ajannasiy ",
        "type": [],
        "definition": [
            "Faqih Abul Husayn Ali ibn Ahmad al-Ajannasiy pokiza, ilmda mumtoz, taqvodor va fozil inson edilar. Shayx Abu Bakr al-Avdaniydan fiqh ilmidan ta'lim olganlar. Hadis ilmidan unchalik ko'p xabardor bo'lmaganlar. Hijriy 395 (milodiy 1006) yilning zulhijja oyida vafot etganlar."
        ]
    },
    {
        "word": "Ali al-Bamijkatiy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Husayn al-Bamijkatiy Bamijkat qishlog'idan. Bu kishi shoir, adib va shu qishloqning imom-xatibi edilar. Xoja G'unjor va Abu Abdulloh Muhammad ibn Ahmad al-Buxoriyning ustozlaridirlar. Hijriy 386 (milodiy 997) yilning Ramazon hayiti kechasi vafot etganlar."
        ]
    },
    {
        "word": "Ali al-Binkatiy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Yusuf al-Binkatiy Bu kishi faqih, solih, qori va hoji edilar. Makkai Mukarramada Abu Muhammad Abdulxoliq ibn Muhammad az-Zubaydiy al-Muqridan ta'lim olganlar. O'zlaridan esa Abu Hafs Umar ibn Muhammad an-Nasafiy ta'lim olganlar."
        ]
    },
    {
        "word": "Ali al-Bobidastoniy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Hasan al-Bobidastoniy Bu kishi fozil, to'g'ri so'z, ishonchli muhaddis, Shofe'iy mazhabi faqihqi, ilm va hadisga qiziquvchilardan edilar. Muhammad ibn Solih al-Karobisiy, faqih Bakr ibn Ahmad al-Jayyidiy as-Samarqandiy, Ibrohim ibn Hamdavayh as-Samarqandiy va Zohir ibn Abdulloh al-Mug'koniydan hadis rivoyat qilganlar. O'zlaridan esa Abu Sa'd al-Idrisiy ta'lim olganlar va aytadilar: 'Bobi dastonda imlo majlislarida uzoq muddatdan beri qatnashaman. Hijriy 368 (milodiy 979) yilning safar oyida Samarqandda vafot etdilar. Janozalarini faqih Abdulkarim ibn Muhammad o'qidilar'."
        ]
    },
    {
        "word": "Ali al-Vasiy al-Xorazmiy",
        "type": [],
        "definition": [
            "Ali ibn Ahmad al-Vasiy al-Xorazmiy Xorazm ahlidan bo'lib, amir Abu Nasr Ahmad ibn Ismoil as-Somoniyning mansabdor kishilarni tayinlaydigan vakili edilar. Xorazmda Is'hoq ibn Ibrohim al-Hofiz, Ya'qub ibn Jarroh, Abdulloh ibn Abdulvahhob al-Ahnafiy, Abu Ali Husayn ibn Tohir al-Abivardiydan hadis rivoyat qilganlar. Hijriy 310 (milodiy 923) yilning shavvol oyida vafot etganlar."
        ]
    },
    {
        "word": "Ali al-Gʻashidiy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Tolib al-G'ashidiy Buxoro ahlidan. 'Ar-Radd ala ahl al-havo' ('Kibru havo ahliga raddiya') kitobining muallifi. Abu Abdulloh ibn Hoshim, Muhammad ibn Zav va Yahyo ibn Badr al-Qurashiydan hadis rivoyat qilganlar. Hijriy 320 (milodiy 933) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ali al-Ismoiliy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Ahmad al-Ismoiliy al-Buxoriy - Abu Bakr Ahmad ibn Muhammad al-Ismoiliyning o'g'illari. Buxoroda qozi edilar. Ilk ta'limni otalaridan, keyinchalik esa Abu Bakr Muhammad ibn Ahmad, Abu Bakr Muhammad ibn Abdulloh ar-Roziy, Abu Bakr Ahmad ibn Sa'd az-Zohid va Abu Solih Xalaf ibn Muhammad al-Xayyomdan olganlar. Har hafta juma kuni hovlilarida imlo majlisi o'tkazar edilar. O'zlaridan Abu Zarr Muhammad ibn Ja'far al-Xatib hadis rivoyat qilganlar. Hijriy 401 (milodiy 1011) yilning sha'bon oyida vafot etganlar. Abu Abdulloh al-Hofiz al-Hokim 'Tarix' kitoblarida aytadilar: 'Abul Hasan al-Ismoiliy al-Buxoriyning otalari Movarounnahrda o'z asrining shayxi, raisi va hijriy 390 (milodiy 1001) yildan keyin esa hokimi edilar. Oqil va fozil edilar. Buxoro olimlaridan ta'lim olganlar. Hijriy 395 (milodiy 1006) yilda haj qilganlar'.\r\n    Ismoiliy degan firqa ham bor. Bu botil firqadir. Ular o'zlarini Muhammad ibn Ismoil ibn Ja'far as-Sodiqqa nisbat berishadi."
        ]
    },
    {
        "word": "Ali al-Karminiy",
        "type": [],
        "definition": [
            "Adib Abu Turob Ali ibn Tohir al-Karminiy o'z zamonalarining tengi yo'q tilshunosi va nihoyatda zehni o'tkir olimi edilar."
        ]
    },
    {
        "word": "Ali al-Karobisiy al-Banjxiniy -",
        "type": [],
        "definition": [
            "Ali ibn Muhammad al-Karobisiy al-Banjxiniy muhaddis va faqih olimlardan edilar. Hijriy 360 (milodiy 972) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ali al-Quhanduziy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Hasan al-Quhanduziy Buxoroning 'Quhanduz'idan bo'lib, muazzin edilar. Abu Zakariyo Yahyo ibn Ismoil, Abu Zayd Imron ibn Farinom, Sahl ibn Mutavakkil va Qays ibn Unayfdan hadis rivoyat qilganlar. Hijriy 346 (milodiy 958) yilning jumodul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Ali al-Marogʻiy",
        "type": [],
        "definition": [
            "Abul Qosim Ali ibn Ahmad al-Marog'iy Buxoroda yashagan olimlardan. Ota-bobolari Marog'adan (Ozarbayjondagi shahar), o'zlari esa Balxdan. Bu kishi ishonchli muhaddislardan bo'lib, ko'p hadis bilar edilar. Otalaridan, Haysam ibn Kulayb ash-Shoshiydan va boshqa muhaddislardan hadis ilmidan ta'lim olganlar. Haysam ibn Kulayb ash-Shoshiyning 'Musnad', Qutabiyning 'G'arib al-hadis' ('G'arib hadislar'), Abu Iso at-Termiziyning 'Shamoil an-nabaviyya' ('Payg'ambarning alohida fazilatlari') va 'Sunan at-Termiziy' kitoblaridan Balxda, Buxoroda, Nasafda va Samarqandda ta'lim berganlar. Abul Qosim al-Marog'iy hijriy 326 (milodiy 939) yilning rajab oyida Balxda tug'ilib, hijriy 411 (milodiy 1021) yil safar oyining yigirma sakkizinchisida, payshanba kuni Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Ali al-Mugʻkoniy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Iso al-Mug'koniy buxorolik olimlardan. Bu kishidan Abul Abbos al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 412 (milodiy 1022) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ali al-Xanbojiy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Ahmad al-Xanbojiy Buxoro olimlaridan. Buxoroning ko'p olimidan ta'lim olib shogirdlar chiqarganlar."
        ]
    },
    {
        "word": "Ali al-Yazdodiy ",
        "type": [],
        "definition": [
            "Abul Qosim Ali ibn Muhammad al-Yazdodiy Buxoro ahlidan bo'lib, keyinchalik Samarqandga chiqib ketganlar. Aka-uka Abu Ubayd Qosim va Abdulloh Husayn al-Mahomiliy hamda Abu Bakr Abdulloh ibn Muhammad an-Nishopuriydan hadis rivoyat qilganlar. Hijriy 386 (milodiy 997) yilda Samarqandda vafot etganlar."
        ]
    },
    {
        "word": "Ali as-Sardariy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Husayn al-Hokim as-Sardariy Buxoro ahlidan bo'lib, Nasafda bir necha muddat qozi edilar. Abul Abbos Muhammad ibn Abdurahmon ad-Dag'uliy, Bakr ibn Munir, Abul Abbos Mahmud ibn Absar, Muhammad ibn Abu Sahl ar-Rabotiy va Ubayd ibn Muhammad ad-Donojdan ta'lim olganlar. Hijriy 297 (milodiy 910) yilda tug'ilib, hijriy 370 (milodiy 981) yilning rabi'ul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Ali as-Siyoziy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Husayn as-Siyoziy shu qishloqdan bo'lib, 'Ali at-Tavil' (Ali novcha) nomi bilan tanilgan edilar. Musayyib ibn Is'hoq va Aslam ibn as-Sanadiydan hadis ilmidan ta'lim olganlar. U kishidan esa Ahmad ibn Abdulvohid al-Buxoriy, Abu Ahmad Humayd ibn Muso al-Buxoriy as-Siyoziy va Habib Kufiy hadis rivoyat qilganlar. Habib Kufiy Qutayba ibn Muslim bilan birga g'oziy sifatida Buxoroga kelganlar."
        ]
    },
    {
        "word": "Ali as-Sunniy al-Karobisiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Muhammad as-Sunniy al-Karobisiy al-Buxoriy Buxoro ahlidan bo'lib, Ubaydulloh ibn Vosil va Muhammad ibn Iso at-Tarsusiydan hadis ilmidan ta'lim olganlar."
        ]
    },
    {
        "word": "Ali as-Sufrodaniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Mahdiy as-Sufrodaniy al-Buxoriy Sufrodan qishlog'idan bo'lib, Abu Ahmad Munib ibn Nasr al-Buxoriydan hadis rivoyat qilganlar. O'zlaridan esa Abu Hafs Abdon ibn Yusuf al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ali at-Tabariy ar-Ruyoniy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Ahmad at-Tabariy ar-Ruyoniy asli Tabaristonning Ruyon shahridan bo'lib, Buxoroda yashaganlar. Bu kishi imom, fozil va Shofe'iy mazhabining faqihi edilar. Mazkur mazhabda mumtoz bu zot Imom Abul Qosim al-Furoniy va Abu Sahl Ahmad ibn Ali al-Abivardiydan fiqh ilmidan ta'lim olganlar. O'zlaridan esa Abu Amr Usmon ibn Ali al-Paykandiy ta'lim olganlar. Hijriy 483 (milodiy 1091) yilning ramazon oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Ali at-Tagʻomiy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Ibrohim at-Tag'omiy - Buxoroning Tag'omo qishlog'idan bo'lib, 'sohib al-avqof' (vaqflar egasi) edilar. Sahl ibn Bishr, Muhammad ibn Dinor, Solih ibn Muhammad al-Hofiz, Muso ibn Aflah va Yahyo ibn Badrdan hadis rivoyat qilganlar. Hijriy 349 (milodiy 961) yilning shavvol oyida vafot etganlar."
        ]
    },
    {
        "word": "Ali at-Tarikotiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Qosim Ali ibn Ahmad at-Tarikotiy al-Buxoriy Buxoro ahlidan. Saroyda tarikotni, ya'ni merosni taqsimlab beruvchi bo'lganlar. Shuning uchun 'Tarikotiy' deb nisbat berilgan. Hijriy 409 (milodiy 1019) yili Balxda vafot etganlar."
        ]
    },
    {
        "word": "Ali at-Tarsusiy as-Sufiy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Abdulloh at-Tarsusiy as-Sufiy Buxoroda yashaganlar. Ja'far ibn Muhammad al-Xaladiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdurahmon as-Sulamiy va Abu Abdulloh al-G'unjor al-Hofiz hadis rivoyat qilganlar. Hijriy 382 (milodiy 993) yili Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Ali ash-Shargʻiy",
        "type": [],
        "definition": [
            "Abul Hasan Ali ibn Hasan ash-Sharg'iy Buxoroning Sharg' nomli qishlog'idan bo'lib, Muhammad ibn Abdulloh al-Bamijkatiy, Sahl ibn Xalaf, Sahl ibn Mutavakkil va Ali ibn Abdulaziz al-Bag'aviydan hadis rivoyat qilganlar. Misr va Shom mashoyixlari bu kishidan hadis yozib olardilar. Hijriy 323 (milodiy 936) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ali ibn Abu Tolib",
        "type": [],
        "definition": [
            "Ali ibn Abu Tolib ibn Abdulmuttolib ibn Hoshim al-Qurayshiy xulafoi roshidinning to'rtinchisi, Rasululloh sollallohu alayhi vasallamning amakilarining o'g'illaridir. Onalari – Fotima binti Asad ibn Hoshim ibn Abdumanof. Kunyalari Abul Hasan. Hazrati Ali milodiy 600-yilda Makkai Mukarramada tavallud topdilar. Biror marta ham butlarga sig'inmaganliklari va johiliyat iflosliklari bilan xulqlanmaganliklari sababli 'Karramallohu vajhahu' (Alloh uning yuzini mukarram qilsin) deb sifatlanadilar.\r\n    Hazrati Ali yoshlik paytlarida doimo Rasululloh sollallohu alayhi vasallam bilan birga bo'lib, birga ovqatlanar edilar. Bunga sabab shuki, Rasululloh sollallohu alayhi vasallamning amakilari Abu Tolibning farzandlari ko'p edi. Shunda Rasululloh sollallohu alayhi vasallam amakilari Abbosga qarata 'Ey amaki, akangiz Abu Tolibning bolalari ko'p. Ko'rib turganimizdek, hozir rizqda, yashashda ko'p qiyinchiliklar bo'lib turibdi. Abu Tolibning huzuriga borib, bolalaridan keladigan tashvishini bir oz yengillataylik', deb aytdilar. Shunda ular borib, Abbos Ja'farni, Rasululloh sollallohu alayhi vasallam esa Alini oldilar. Mana shundan keyin Ali Rasululloh bilan birga yashay boshladilar.\r\n    Hazrati Ali Rasululloh nabiy qilib yuborilganlaridan keyin yosh bolalardan birinchi bo'lib iymon keltirib, Islomni qabul qilganlar. Ana shu vaqtda yoshlari hali sakkizdan o'tmagan edi. Anas ibn Molik aytadilar: 'Dushanba kuni nubuvvat kelgan, seshanba kuni Ali Islomga kirgan'.\r\n    Ali ibn Abu Tolib hamma janglarda ishtirok etdilar, faqat Tabuk jangida Rasululloh sollallohu alayhi vasallam bu zotni ahli baytlariga boshliq qilib ketganliklari sababli ishtirok eta olmadilar.\r\n    Ali shijoatli, so'zda fasohatli, ilmli, axloqli, sabrli, adolatli, hilmli, iffatli, taqvodor, dunyoda zohid, tavozu'li va musulmon yigitlar orasida Rasululloh sollallohu alayhi vasallamga eng yaqin kishi edilar. Shuning uchun Rasululloh sollallohu alayhi vasallam: 'Men ilmning shahri bo'lsam, Ali uning eshigidir', deb aytdilar.\r\n    Ali karramallohu vajhahu arablar orasida shijoatli, botir pahlavonlardan edilar. Badr jangida mushriklar boshlig'i bo'lgan Valid ibn Utbani yer tishlatdilar. Uhud jangi kuni bayroq ko'targan sahoba Mus'ab ibn Umayr o'ldirilganda, Rasululloh sollallohu alayhi vasallam bayroqni hazrati Aliga topshirdilar. U kishi Xaybarni fath etishda ham juda ko'p jonbozliklar ko'rsatganlar. O'shanda yoshlari hali yigirmadan o'tmagan edi.\r\n    Bir kuni Rasululloh sollallohu alayhi vasallam: 'Ertaga jangda bayroqni bir kishiga beraman, Alloh va Rasuli uni yaxshi ko'radi va u ham Alloh va Rasulini yaxshi ko'radi', deb aytdilar. Ertasiga hamma sahobalar o'sha kishi o'zlari bo'lishini umid qilishganda, Rasululloh sollallohu alayhi vasallam hazrati Alini so'rab qoldilar. Sahobalar Alining ko'zlari og'riyotgani haqida xabar berishdi. Rasululloh u kishining huzurlariga borganlarida haqiqatda ko'zlari og'rigan edi. Shunda Rasululloh sollallohu alayhi vasallam muborak qo'llarini Alining ko'zlariga tekkizib, duo qildilar va ko'zlari shifo topdi.\r\n    Ko'p sahobalar Alining Rasululloh sollallohu alayhi vasallamning huzurlaridagi maqomlarida bo'lishni orzu qilishar edi. Alloh Rasululloh bilan Alining maqomlarini xuddi Muso alayhissalom bilan Horun manzilidek qildi. Ali karramallohu vajhahuning nihoyatda chiroyli bir so'zlari borki, u bizlarga o'rnak bo'larlidir: 'Mening qo'rqadigan narsam havoi nafsga tobe' bo'lish va uzun orzular qilishdir. Havoi nafsga tobe' bo'lish haqdan qaytaradi. Uzun orzular esa oxiratni esdan chiqartiradi. Ogoh bo'linglar, bu dunyo orqada qolib ketadi. Oxirat esa oldingizga chiqib, kutib oladi. Sizlar oxiratning bolasi bo'linglar, dunyoning bolasi bo'lib qolmanglar. Bu kunda amal boru hisob yo'qdir, ertaga esa hisob boru amal yo'qdir'.\r\n    Ali karramallohu vajhahu hijratning ikkinchi yilida Rasululloh sollallohu alayhi vasallamning qizlari Fotima onamizga uylandilar. Hazrati Ali Fotima onamizdan va boshqa xotinlaridan hammasi bo'lib, o'n to'rt o'g'il, o'n to'qqizta qiz farzand ko'rdilar.\r\n    Ali ibn Abu Tolib roziyallohu anhu 586ta hadis rivoyat qilganlar. U zotdan ko'p kishilar, jumladan, o'g'illari Hasan, Husayn, Muhammad, Umar hamda Abdulloh ibn Mas'ud, Ibn Umar, Abdulloh ibn Ja'far, Abdulloh ibn Zubayr, Abu Muso Ash'ariy, Abu Said Xudriy, Abu Rofi', Suhayb, Zayd ibn Arqam, Jobir ibn Abdulloh, Abu Hurayra, Jobir ibn Samura, Baro ibn Ozib, Jarir ibn Abdulloh va boshqalar hadis rivoyat qilganlar. Tobe'iynlardan Sa'iyd ibn Musay¬yib, Qays ibn Hozim, Alqama ibn Qays, Abu Asvad Jauliy, Ahnaf ibn Qays, Shurayh ibn Honiy va boshqalar rivoyat qilishdi.\r\n    Mo'minlarning amiri Ali ibn Abu Tolib masjidda imom bo'lib turganlarida xavorijlarning odami bo'lgan Abdurahmon ibn Muljam tomonidan qilich bilan urilib, shahid bo'ldilar. Bu hodisa hijratning 40-yili, Ramazon oyining 23-kuni, jum'a kunida sodir bo'ldi. Bu paytda u zot 63 yoshda edilar."
        ]
    },
    {
        "word": "Ali ibn Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining o'g'illari."
        ]
    },
    {
        "word": "Al-Ibona",
        "type": [],
        "definition": [
            "Abulhasan Ali ibn Ismoil al-Ash'ariy rahmatullohi alayhi o'zlarining kitoblari. Bu kitobda Ahli sunna va jamoaning mazhabi imom Ahmad ibn Hanbalning qavllari asosida bayon etilgan hamda mo''taziliy va jahmiylarga raddiyalar qilingan."
        ]
    },
    {
        "word": "Aliy ibn Abdulloh Madaniy",
        "type": [],
        "definition": [
            "Aliy ibn Abdulloh Madaniy – imom Buxoriyning ustozlaridan biri."
        ]
    },
    {
        "word": "Al-Lamaʼ",
        "type": [],
        "definition": [
            "Imom Abulhasan Ali ibn Ismoil al-Ash'ariy rahmatullohi alayhi o'zining bu kitobida avvalgi uch kitobidagidan boshqacha yo'l tutib, aqliy dalilga ham e'timod qiladi. Shunday qilib, u kishi bu kitobda salaf ulamolar yo'lidan emas, keyingi, ta'vil yo'lini tutganlar izidan boradi."
        ]
    },
    {
        "word": "Al-Lamʼa fiy ragʻoyibi yavmil Jumʼa",
        "type": [],
        "definition": [
            "Ibn Abus Sayf al-Yamaniyning kitobi"
        ]
    },
    {
        "word": "Alloma",
        "type": [],
        "definition": [
            "eng bilag'on olim, ilm-fanning bir yoki bir necha sohasini mukammal egallagan."
        ]
    },
    {
        "word": "Alloma Abu Abdulloh Muhammad ibn Soigʻ",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Misrlik ulamo."
        ]
    },
    {
        "word": "Alloma Abu Muhammad Abdulvahhob ibn Sallor",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Damashqlik ulamo"
        ]
    },
    {
        "word": "Alloma Saʼduddin Masʼud ibn Umar ibn Abdulloh Taftazoniy",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining to'liq ismi Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniydir.\r\n     Allomai Taftazoniy rahmatullohi alayhining hayotini sinchiklab o'rgangan olimlarning ta'kidlashlaricha, u kishi hijriy 722, milodiy 1322 yili safar oyida, Movarounnahrning mashhur shaharlaridan bo'lmish Niso shahriga qarashli Taftazon qishlog'ida dunyoga kelgan. Shaharning arabcha Niso, ya'ni ayollar deb atalishiga sabab shuki, fotihlar Xuroson va Movarounnahrni fath etishganida mazkur shaharning erkaklari qochib ketib, unda faqat ayollar qolishgan ekan. Musulmonlar shaharda erkak zotini topa olmay, uni tashlab o'tib ketishgan ekan. Shu sababli u Niso, ya'ni ayollar shahri deb atalgan ekan. U hozirgi Turkmaniston yerlarida joylashgan shahardir. Bu yerdan Imom Nasoiydan tashqari Abu Ahmad Homid Zinjaviy al-Azdiy kabi katta olimlar ham chiqqan.\r\n    Allomai Taftazoniy rahmatullohi alayhi kichikligidan o'z qishlog'i Taftazonni tark qilib, ilm olish uchun Niso shahriga ravona bo'ldi. U yerda xat qoidalarini, imloni, dastlabki diniy ilmlarni o'rgandi va Qur'oni Karimni yod oldi.\r\n    So'ngra o'spirin Allomai Taftazoniy rahmatullohi alayhi o'sha vaqtda mashhur bo'lgan yuqori saviyadagi imlardan bahramand bo'lish niyatida yer yuzining sayqali, turli ilmlarning markazi bo'lgan Samarqand tomon yuzlandi. U yerda o'sha vaqtning mashhur allomalaridan bo'lgan Azududdin Iyjiy rahmatullohi alayhiga shogird tushdi. O'sha vaqtning peshqadam tolibi ilmlari Samarqandning masjidlaridan birida mana shu olimning qo'lida tahsil olar edilar. Ular o'z ustozlaridan Arastuning qiyoslarini, Ibn Sinoning falsafiy asarlarini, Forobiyning kitoblarini taxsil olar, Aflotunga o'xshash o'zlariga to'g'ri kelmagan fikr egalariga raddiyalar qilishni o'rganar edilar.\r\n    Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhi ham shavqu zavq bilan, ilmga bo'lgan cheksiz himmat bilan ulug' olim Azududdin Iyjiyning shogirdlari qatoriga qo'shildi.\r\n    Azududdin Iyjiyning darslari mantiq, kalom, bayon, badiy', usul kabi oliymaqom va qiyin ilmlardan yuqori saviyada o'tar edi. Yangi shogird Taftazoniyning bu ilmlardan hali xabari yo'q edi. Shuning uchun u sheriklari ichida bilimsizroq, zehni past, aqli sust va qalbi mog'or bo'lib ko'rinar edi. Ammo shunga qaramay, u hammadan ko'ra ko'p harakat qilardi. Sheriklaridan ortda qolganligi Sa'duddinning ilmga bo'lgan himmatini pastlata olmas, u tinmay harakat qilar, ilmdan boshqa narsalarga ahamiyat bermas edi.\r\n    Allomai Taftazoniy rahmatullohi alayhi hijriy 742 sanada Samarqanddan Urganchga ko'chib o'tdi.\r\n    Allomai Taftazoniy rahmatullohi alayhining shuhrati Urganchga o'zidan oldin yetib kelgan edi. Shuning uchun u kishining kelganini eshitgan tolibi ilmlar u zotga shogird bo'lishga shoshildilar. Allomai Taftazoniy rahmatullohi alayhi Urganchda tolibi ilmlarga dars berish bilan birga, ko'plab kitoblar yozishni ham yo'lga qo'ydi. Xususan, o'zining mashhur kitoblaridan biri bo'lmish 'Al-Mutovval 'alat talxiys'ni yozib bitirdi.\r\n    Allomai Taftazoniy rahmatullohi alayhi hijriy 748 yilda Urganchdan Hirotga ko'chib o'tdi. O'sha paytda Hirot ham mashhur va katta shaharlardan biri hisoblanardi.\r\n    Allomai Taftazoniy rahmatullohi alayhi Hirotga kirib kelishi bilan Urganchda yozib bitirgan va o'zi bilan Hirotga olib kelgan 'Al-Mutovval 'alat talxiys' nomli ulkan kitobini shaharning amiri Mu'iziddin Abulhasanga sovg'a qildi.\r\n    Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhi Hirotda to'rt yil yashaganiga qaramay, bu shaharda birorta ham kitob yozmagan. U kishining hayotini o'rgangan olimlar bu g'alati holatning sababini anglay olmay, hanuz ajablanishadi, hayron bo'lishadi.\r\n    So'ngra Allomai Taftazoniy rahmatullohi alayhi Jom nomli shaharchada paydo bo'ldi. Bu joyda bir muddat yashadi va o'zining mantiq ilmiga oid 'Sharhush shamsiya' nomli kitobini hijriy 752 yilda nihoyasiga yetkazdi.\r\n    Hijriy 756 sanada Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhi G'ijduvonga kelib, o'sha yerda yashay boshladi. U zot G'ijduvonda o'zining 'Al-Muxtasar 'alat talxiys' nomli kitobini tugalladi. Allomai Taftazoniy rahmatullohi alayhi G'ijduvonda ikki yil yashadi.\r\n    So'ngra Turkiston shaharlaridan biri bo'lmish Gulistonga ko'chib o'tgan Allomai Taftazoniy rahmatullohi alayhi u yerda 'At-Talviyh 'ala tavziyhi g'avomizit tanqiyh' nomli asarini yozib bitirdi. U kishi bu yerda bir yil yashadi.\r\n    Keyin hijriy 759 yili yana Hirotga qaytib keldi. Bu safar Sa'duddin Taftazoniy rahmatullohi alayhi bu shaharda o'zining 'Fatavoi hanafiya' nomli kitobini yozishga kirishdi.\r\n    Shundan so'ng Taftazoniy rahmatullohi alayhi Hirotni tark qilib, yana Urganchga ko'chib keldi. Bu safar ushbu shaharda o'z odatidan tashqari, ko'proq yashab qoldi. O'n yilcha davom etgan bu muddat Allomai Taftazoniy rahmatullohi alayhining hayotidagi eng sermahsul yillardan bo'ldi. Hijriy 768 yili alloma o'zining eng mashhur kitoblaridan biri 'Sharhu Aqoidi Nasafiya' kitobini, hijriy 774 yili esa 'Al-Irshod fin nahv' kitobini ta'lif qildi.\r\n    Amir Temur Xorazmga kelganida Malik Muhammad Saraxsiy ibn Malik Mu'iziddin Husayn Kurt o'z jiyani Pirmuhammad G'iyosiddin Piralidan Amir Temurdan Allomai Taftazoniy rahmatullohi alayhini Saraxsga taklif qilishni so'rashni iltimos qildi. Amir Temur Allomai Taftazoniy rahmatullohi alayhining ilmdagi fazlini bilib, u zotni Samarqandga taklif qilishni afzal ko'rdi. Avvaliga Allomai Taftazoniy rahmatullohi alayhi Amir Temurning taklifiga javob bermay turdi, so'ng Hijozga safar qilish niyati borligini aytib, uzr aytmoqchi ham bo'ldi. Ammo Amir Temur ikkinchi bor taklif yuborganidan keyin Samarqandga ravona bo'ldi.\r\n    Amir Temur Allomai Taftazoniy rahmatullohi alayhiga alohida ehtirom ko'rsatdi. U kishi Samarqandda yashab turganida o'zining eng ulkan va dunyoga dong'i ketgan 'Maqosid' nomli kitobini yozdi. Bu kitobning yozilish tarixi hijriy 784, milodiy 1383 yilga to'g'ri keladi.\r\n    Hijriy 785 yili Allomai Taftazoniy rahmatullohi alayhi Samarqanddan Saraxsga ko'chib o'tib, u yerda 'Talxiysul Jome'' nomli kitob yoza boshladi. U kishi Saraxsning ta'lim jarayoni rahbariga ham aylandi, ammo u yerda uzoq tura olmadi. Tezda yana Samarqandga qaytdi. Samarqandning totli suvlari, go'zal bog'u bo'stonlari, shirin mevalari va qulay sharoitlari allomani o'ziga chorlagan bo'lsa ajab emas. Biroq, bundan ham ko'ra Allomai Taftazoniy rahmatullohi alayhini Samarqandning ilmiy muhiti, turli ulamolari, dars halqalari, ilm madrasalari, madaniy va ma'rifiy sharoitlari o'ziga tortgani turgan gap.\r\n     Amir Temur Ko'ragoniy Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhini juda ham hurmat qilar edi. Fikrimizning dalili sifatida mashhur olim va tarixchi Ibn Arabshohning quyidagi hikoyasini keltiramiz:\r\n    'Amir Temur o'ta ahamiyatli va foydali ishlaridan biri bo'yicha chopar yubordi. Choparga: 'Agar yo'lda otga hojat tushib qolsa, kimni ko'rsang ham otini ol, agar o'g'lim Shohruh bo'lsa ham', dedi. Chopar u amr qilgan tarafga tezlab jo'nadi. Yo'lda Alloma Taftazoniyga duch keldi. U dam olish uchun bir joyga tushgan, otlari chodirining oldiga bog'langan ekan. Chopar o'sha otlardan birini oldi. Alloma Sa'duddin Taftazoniy chodirdan chiqib, uni ushlab oldi. Otni chopardan qaytarib oldi va uni rosa kaltakladi.\r\n    Chopar Amir Temurning oldiga qaytib borganida bo'lgan gapni unga aytdi. Shunda Amir Temur qattiq g'azablandi. Ammo bir ozdan so'ng: 'Agar uning o'rnida o'g'lim bo'lganida, uni qatl qilardim. Lekin qaysi joyga borsam, kitoblari u yerga mening qilichimdan oldin kirib borgan odamni qanday qilib qatl qilaman', dedi'.\r\n    791 hijriy sanada Amir Temurning huzurida va No''monuddin Xorazmiyning hakamligida Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhi bilan Sayyid Sharif Jurjoniy orasida mashhur munozara bo'lib o'tdi. Ko'pchilik ulamolarning kitoblarida zikr qilingan bu munozaraning mavzusi Allomai Zamaxshariyning 'Kashshof' tafsirida Baqara surasidagi Alloh taoloning 'Ana o'shalar Robblaridan bo'lgan hidoyat uzradirlar va ana o'shalar, o'shalargina zafar topuvchilardir' (5-oyat) degan qavlidagi taba'iy va tamsiliy istioraning jamlanishi haqida edi.\r\n    Hijriy 791 yilning avvalida boshlangan bu munozara g'oyatda mashhur bo'lib, u haqda ko'plab ilmiy bahslar yozilgan. Amir Temur Sayyid Sharif Jurjoniyning g'olib bo'lishi tarafdori bo'lib, bu fikrni quvvatlash uchun: 'Agar ikkisini barobar deb faraz qilsak ham Jurjoniyning nasabi sharaflidir', degan edi.\r\n     Ushbu ilmiy munozaradan keyin ko'p o'tmay, hijriy 791, milodiy 1389 yili Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhi bu -dunyodan ko'z yumdi. U kishining jasadlari Samarqanddan Saraxsga olib borib dafn etildi."
        ]
    },
    {
        "word": "Alloh",
        "type": [],
        "definition": [
            "o'zbek tilida Tangri, fors-tojik tilida Xudo deyiladi. Alloh lafzi deyarli barcha tillarda qo'llaniladi."
        ]
    },
    {
        "word": "Allohu Akbar",
        "type": [],
        "definition": [
            "Alloh ulug'dir. Alloh har bir narsadan buyukdir. U zot o'ziga nisbat berilgan nomunosib narsalardan ulug'dir."
        ]
    },
    {
        "word": "Al-Mavoqif",
        "type": [],
        "definition": [
            "Shayx Abdurrohman Ahmad Abdulg'affor Azududdin al-Iyjiy rahmatullohi alayhining kitobi. Bu kitob ilmi kalomga oid eng mashhur kitoblardan biri hisoblanadi. 'Al-Mavoqif'ni bir necha olimlar sharh qilganlar."
        ]
    },
    {
        "word": "Al-Maqosid fiy ilmil kalom",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi metafizika va kalom ilmi haqidagi muxtasar asar bo'lib, muallif uni Samarqandda hijriy 784 yilning zulqa'da oyida tugatgan."
        ]
    },
    {
        "word": "Al-Miftoh",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining kitobi. Bu kitob shofe'iy mazhabidagi furu'ul fiqh kitobidir."
        ]
    },
    {
        "word": "Al-Muqaddimotul Arbaʼa",
        "type": [],
        "definition": [
            "Sodrush shariy'a Ubaydulloh ibn Mas'ud al-Buxoriyning kitobi"
        ]
    },
    {
        "word": "Al-muqoddima fi ma ʼala qoriil Qurʼani an yaʼlama",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat bo'yicha kitoblari."
        ]
    },
    {
        "word": "Al-Muhiyt ",
        "type": [],
        "definition": [
            "Roziyiddin Saraxsiy kitobi"
        ]
    },
    {
        "word": "Al-Olim val Mutaallim",
        "type": [],
        "definition": [
            "Imom Abu Hanifa rahmatullohi alayhining yozgan risolasi."
        ]
    },
    {
        "word": "Alouddin Ali Qujhisoriy",
        "type": [],
        "definition": [
            "Bu kishi o'z davrining katta olimlaridan, jumladan, Allomai Taftazoniy rahmatullohi alayhi va Sayyid Sharif Jurjoniy rahmatullohi alayhidan dars olgan. Keyinroq Rum yurtiga safar qilib, o'sha yerdagi madrasalardan birida dars bergan. Bir necha kitoblar ta'lif qilgan. Jumladan, Allomai Taftazoniy rahmatullohi alayhining 'Sharhul Miftoh' nomli kitobiga hoshiya yozgan."
        ]
    },
    {
        "word": "Alouddin Buxoriy ",
        "type": [],
        "definition": [
            "(h. 779-841). Allomai Taftazoniy rahmatullohi alayhining bu shogirdining to'liq ismi – Alouddin Muhammad ibn Muhammad ibn Muhammad ibn Muhammad Buxoriy Hanafiydir. U kishi ajam yurtida tug'ilgan, Buxoroda o'sib ulg'aygan va otasi hamda amakisidan fiqh ilmini o'rgangan.\r\n    Alouddin Buxoriy rahmatullohi alayhi Allomai Taftazoniy rahmatullohi alayhidan adabiyot va aqliyotga oid ilmlarni o'rgangan. Ko'p yurtlarga safar qilgan, uzoq vaqt Qohira va Damashqda istiqomat qilgan. U kishining shogirdlari ko'p bo'lgan. Ma'oniy va Bayon ilmlarini juda yaxshi bilgan. O'zining Allomai Taftazoniy rahmatullohi alayhining shogirdi ekani bilan faxrlanib yurgan. Zohid va taqvodor odam bo'lgan, zamonasining ko'zga ko'ringan olimlaridan biriga aylangan.\r\n     Alouddin Buxoriy rahmatullohi alayhi 'Ar-raddu 'alal vujudiya', 'Fozihatul mulhidiyn va Nosihatul muvahiddin' kabi kitoblarni yozgan. U kishi Damashqda vafot etgan."
        ]
    },
    {
        "word": "Alouddin Rumiy",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining shogirdi. Bu olimning to'liq ismi Alouddin Abulhasan Aliy ibn Muslihiddin Muso ibn Ibrohim Rumiy Hanafiydir. U zot turli ilmlarda peshqadam bo'lgan. Allomai Taftazoniy rahmatullohi alayhiga shogird bo'lgani kabi, Sayyid Sharif Jurjoniyga ham shogird bo'lgan. Ularning hammasi Samarqandda birga yashab, ilmiy faoliyat olib borganlar.\r\n    Alouddin Rumiy rahmatullohi alayhi Allomai Taftazoniy rahmatullohi alayhi va Sayyid Sharif Jurjoniyning Amir Temur huzurida olib borgan munozaralarida hozir bo'lgan. Ularni yodlab olib, keyin odamlarga aytib yurgan."
        ]
    },
    {
        "word": "Al-Favoidul-Gʻiyosiya",
        "type": [],
        "definition": [
            "Shayx Azududdin Iyjiy rahmatullohi alayhining kitobi. Balog'at va fasohatga oid bu kitobni Azududdin Iyjiy rahmatullohi alayhi 'Miftohul ulum' kitobining uchinchi qismidan muxtasar qilgan."
        ]
    },
    {
        "word": "Al-Fiqhul Akbar",
        "type": [],
        "definition": [
            "Imom Abu Hanifa rahmatullohi alayhining yozgan risolasi"
        ]
    },
    {
        "word": "Alfiyatun fil muammo va algʻoz",
        "type": [],
        "definition": [
            "Muammo va topishmoqlar haqidagi alfiya. Bu kitobning 'Alfiya' deb atalishi ming baytdan iborat bo'lgani uchundir. Avvallari turli ilmlarda alfiyalar yozish odati bo'lgan. Misol uchun, Ibn Molik rahmatullohi alayhi nahv ilmi bo'yicha yozgan alfiya juda ham mashhurdir. Bu ilmni mukammal egallashni qasd qilganlar mazkur kitobni yaxshilab sharhi bilan o'qishgan va yodlashgan.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi ham muammo va topishmoqsimon lafzlarning bayonida ming baytdan iborat kitob yozganlar. Ulamolarning ta'kidlashlaricha, bu xildagi asarlarni yozish fors adabiyotidagi uslublardan biri bo'lgan. Sayyid Sharif Jurjoniy rahmatullohi alayhi ham o'zining bu kitobini fors tilida yozgan."
        ]
    },
    {
        "word": "Al-Xabboz",
        "type": [],
        "definition": [
            "Novvoy"
        ]
    },
    {
        "word": "Alhamdulillah ",
        "type": [],
        "definition": [
            "Allohga shukur."
        ]
    },
    {
        "word": "Al-yavm",
        "type": [],
        "definition": [
            "Arab tilida 'al-yavm' so'zi bizning tilimizdagi 'kun' ma'nosini ifoda qiladi va tong otgandan quyosh botguncha bo'lgan muddatni bildiradi. Lekin shu bilan birga, jumlada o'zi bilan keladigan iboralarning ma'nosiga qo'shilganda turli muddatlarni ifoda qilishi bor."
        ]
    },
    {
        "word": "Al-yasaʼ alayhissalom",
        "type": [],
        "definition": [
            "Qur'oni Karimda bu payg'ambar alayhissalomning ismlari An'om surasida bir marta, Sod surasida bir marta zikr qilingan.\r\n    '...va Ismoil, Al-Yasa', Yunus va Lutni ham. Barchalarini butun olamlardan afzal qildik' (An'om surasi, 86-oyat).\r\n    Alloh taolo O'z payg'ambarlaridan katta guruhini zikr qilish davomida Ismoil, Al-Yasa', Yunus va Lut alayhissalomlarni zikr etgan. Bularning alohida ajralib turadigan sifatlari Allohning O'ziga ayon.\r\n    Ammo 'Barchalarini butun olamlardan afzal qildik' deyilishidan ular olamdagi eng afzal zotlar ekani ma'lum bo'lmoqda.\r\n    Sod surasidagi Al-Yasa' alayhissalom haqlaridagi oyat yuqorida o'tdi. Biroq u zot to'g'risida Qur'oni Karim va hadisi shariflarda boshqa ma'lumot yo'q.\r\n    Al-Yasa' alayhissalom Ilyos alayhissalomning amakilari Axtubning o'g'li bo'lganlar. U zotning nasablari Yusuf alayhissalomda tutashadi.\r\n    Al-Yasa' alayhissalom Banu Isroilning payg'ambarlaridan bo'lib, Ilyos alayhissalomning shariatlariga da'vat qilganlar. U zotning davrlarida gunoh ishlar va zulm nihoyatda kuchaygan. Ana shunday og'ir bir sharoitda Al-Yasa' alayhissalom Shomning Ba'labakka shahrida payg'ambarlik qilganlar va ana shu zaminda vafot etganlar."
        ]
    },
    {
        "word": "Amal",
        "type": [],
        "definition": [
            "ish, faoliyat, harakat."
        ]
    },
    {
        "word": "Amdiza",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Amin",
        "type": [],
        "definition": [
            "ishonchli, halol, to'g'riso'z."
        ]
    },
    {
        "word": "Amir",
        "type": [],
        "definition": [
            "farmon beruvchi, boshliq, hukmdor, peshvo, rais, bek."
        ]
    },
    {
        "word": "Amir al-moʻminin ",
        "type": [],
        "definition": [
            "mo'minlar amiri; arab xalifaligi davridagi xalifalarning unvoni."
        ]
    },
    {
        "word": "Ammo baʼd",
        "type": [],
        "definition": [
            "shundan keyin; demak; darhaqiqat; xullas; gapning indallosi; inchunin."
        ]
    },
    {
        "word": "Ammor ibn Yosir",
        "type": [],
        "definition": [
            "Ammor ibn Yosir ibn Omir ash-Shomiy, kunya¬lari Abu Yaqzon. Islomni birinchilardan bo'lib, oilalari bilan qabul qilishgan. Makka tog'larida mushriklar bu kishini va oilasini azoblayotgan paytda Rasululloh sollallohu alayhi vasallam:\r\n    'Ey Yosir oilasi, sabr qilinglar. Albatta, sizlarga va'da berilgan joy jannatdir', deb duo qilganlar.\r\n    Ammor roziyallohu anhuning ota-onasi mana shu azoblar ostida vafot qilishdi. Onalari Islomdagi birinchi shahid maqomiga musharraf bo'ldilar.\r\n    Ammor ibn Yosir bu azoblardan tillariga kufr kalimasini olganlarida musulmonlar 'Ammor kufr so'zini aytdi' degan xabar tarqatishadi.\r\n    Shunda Payg'ambar alayhissalom:\r\n    'Ammor boshidan oyog'igacha iymon bilan to'ldirilgandir', deb marhamat qiladilar. Keyin musulmonlarning bu so'zlarini rad qilgan holda Qur'ondagi Nahl surasining 106-oyati nozil bo'ladi.\r\n    Ammor ibn Yosir musulmonlar bilan hijrat qilib, Badr, Uhud, Xandaq va boshqa hamma janglarda avvalgi safda turib, ishtirok etdilar. U kishi Islomdagi birinchi masjid bo'lmish Qubo masjidining qurilishida ham ishtirok etgan sohibiylardan biri edilar.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Kimki Ammorga tajovuz qilsa, Alloh unga tajovuz qiladi. Kimki Ammorga g'azab qilsa, Alloh unga g'azab qiladi', deb aytganlar.\r\n     Ammor hammasi bo'lib 62ta hadis rivoyat qildilar. Rasululloh sollallohu alayhi vasallam: 'Ammorni tug'yonga tushgan bir firqa o'ldiradi', deb bashorat qilgan edilar. Darhaqiqat, bu zot Siffiyn urushida Ali roziyallohu anhu bilan qatnashib, shu jangda shahid bo'ldilar."
        ]
    },
    {
        "word": "Ammor rahmatullohi alayh",
        "type": [],
        "definition": [
            "Ammor ibn Abu Ammorning kunyalari Abu Abdulloh. Bu zot tobe'inlardan edilar. Rivoyat qilgan hadislari ishonchli deb tan olinadi.\r\n    Hadislarni Ibn Abbos, Abu Hurayra, Abu Sa'iyd al-Xudriy, Abu Qatoda, Abdulloh ibn Navfal, Jobir ibn Abdullohlardan rivoyat qilganlar.\r\n    Bu zotdan Ato ibn Abu Raboh, Nofe', Ali ibn Zayd, Shu'ba, Muammar, Yunus ibn Ubayd, Xolid al-Xuzo'iy va boshqalar rivoyat qilganlar.\r\n    Bu zot Xolid ibn Abdullohning voliylik paytida vafot etdilar."
        ]
    },
    {
        "word": "Amoliy kitoblar",
        "type": [],
        "definition": [
            "'Amoliy' imloning jam'idir. Bunda, mujtahid o'tirganda uning atrofiga shogirdlari qog'oz-qalamlarini olib o'tiradi. So'ng, olim ilmda Alloh unga bildirgan narsani yoddan gapiradi. Shogirdlar uni yozib boradi. Keyin, yozgan narsalarini jamlab kitob qiladilar. Ana o'shani 'imlo' yoki 'amoliy' deb ataydilar. O'tgan fuqaho, muhaddis va arab tili olimlarining shundoq odati bor edi"
        ]
    },
    {
        "word": "Amr al-Margʻabuniy",
        "type": [],
        "definition": [
            "Abu Hafs Amr ibn Mug'ira al-Marg'abuniy Buxoroning Marg'abun nomli qishlog'idan. Musayyab ibn Is'hoq va Buhayr ibn Nazrdan hadis rivoyat qilganlar. Hijriy 273 (milodiy 887) yilda Bamijkat qishlog'ida hadisdan ta'lim berganlar. Bu kishidan esa Abu Is'hoq Ibrohim ibn Nuh al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Amr as-Sakaniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Hasan Amr ibn Is'hoq as-Sakaniy al-Buxoriy o'z asrining shayxi va muhaddis olimi edilar. Buxoroda Abu Ali Solih ibn Muhammad al-Bag'dodiy, Sahl ibn Shozavayh al-Hofiz, Marvda Mahmud ibn Yahyo al-Mirmohoniy, Abdulloh ibn Mahmud as-Sa'diy, Bag'dodda Abdulloh ibn Abu Dovud as-Sijistoniy, Abdulloh ibn Muhammad al-Bag'aviy va Kufada Abdulloh ibn Zaydon al-Bujaliydan ta'lim olganlar. Abu Abdulloh al-Hofiz al-Hokim u kishidan ta'lim olganlar va u kishi haqlarida 'Tarixi Nishopur' kitoblarida shunday deganlar: 'Hijriy 341 (milodiy 953) yili Nishopurga keldilar. Shu sanada u kishi bilan birga haj qildik. Ilm olish va ta'lim berishda nihoyatda muruvvatli edilar. Hijriy 344 (milodiy 956) yilda vafot etdilar'."
        ]
    },
    {
        "word": "Amr ibn Abasa",
        "type": [],
        "definition": [
            "Amr ibn Abasa ibn Omir ibn Homid as-Samiy, kunyalari Abu Nujayh. Islomga birinchi bo'lib kirganlardan hisoblanadilar. Amr Islomga kirgan kunlarini shunday bayon qiladilar: 'Qalbimga nimagadir 'Butlarga ibodat qilish botil' degan fikr keldi. Bir odamga bu fikrimni aytsam, u menga: 'Ey Amr, sen o'ylagan narsani Makkada bir odam gapirayotgan emish', deb qoldi. Bu gapdan keyin Makkaga bordim. U odam haqida so'ragan edim, menga:\r\n    'Kechqurun Ka'bani tavof qilgani keladi, kunduzi bekinib yuradi', deyishdi. Ka'ba yonida uxlayotganimda kimningdir 'Laa ilaaha illallohu' degan so'zidan uyg'onib ketdim. U odamga borib:\r\n    'Kimsan?' dedim.\r\n    U kishi menga:\r\n    'Allohning Rasuliman', dedilar.\r\n    'Alloh seni nima bilan yubordi?' deb so'radim.\r\n    U:\r\n    'Allohga shirk keltirmasdan, Unga ibodat qilishga, o'zaro qon to'kmaslikka, qarindosh-urug'lar orasida bordi-keldini tiklashga', deb javob berdilar.\r\n    U kishiga:\r\n    'Hozir siz bilan kim bor?' desam,\r\n    'Bir hur va bir qul bor', dedilar.\r\n    'Qo'lingizni bering, sizga bay'at qilaman', deb, Islomga kirdim.\r\n    'Hozir to'rtta musulmon ekanmiz. Siz bilan turaymi?' dedim.\r\n    'Yo'q qavmingga qayt, agar mening boshqa joyga ko'chganimning xabarini eshitsang, kelgin', dedilar.\r\n    Men qavmimga qaytib, u yerda ko'p vaqt turdim. Keyin menga bir odam 'Muhammad Makkadan Yasribga ko'chdi', deb qoldi. Yasrib tomon yo'l oldim.\r\n    Rasululloh sollallohu alayhi vasallamning huzurlariga kirib:\r\n    'Meni taniyapsizmi?' dedim.\r\n    'Ha, sen menga Makkada bay'at qilgan eding', dedilar. Keyin bilsam, orada Badr, Uhud, Handaq janglari o'tib ketgan ekan'.\r\n    Amr ibn Abasa Madinaga kelib, shu yerda turdilar. So'ng Shomga ko'chib o'tdilar.\r\n    Bu zot Rasululloh sollallohu alayhi vasallamdan bir nechta hadislar rivoyat qildilar. Ulardan esa Abdulloh ibn Mas'ud, Abu Umoma al-Bohiliy, Sahl ibn Sa'd, tobe'inlardan Abu Idris Huvloniy, Salim ibn Omir, Kasiyr ibn Murra va boshqalar rivoyat qilganlar."
        ]
    },
    {
        "word": "Amr ibn Oss",
        "type": [],
        "definition": [
            "Amr ibn Oss ibn Voil Suhamiy al-Qurashiy, kunyalari Abu Abdulloh (milodiy 574-663 yillarda yashab o'tganlar) Xaybar yilida Islomga kirdilar.\r\n    Bu zot Xolid ibn Valid va Usmon ibn Talhalar bilan birgalikda Madinaga hijrat qiladilar va Islomga kirganlari haqida xabar berib, Rasululloh sollallohu alayhi vasallamga bay'at qiladilar. So'ngra Allohdan gunohlarini kechirishini so'raydilar. Shunda Rasululloh sollallohu alayhi vasallam:\r\n    'Islom va hijrat oldingi gunohlarni o'chiradi', deya marhamat qiladilar.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Amr ibn Oss Quraysh qabilasining solih kishilaridan', deganlar.\r\n    Amr ibn Oss arablarning pahlavonlaridan edilar.\r\n    Bu zot hammasi bo'lib 39 ta hadis rivoyat qildilar. Amr ibn Oss roziyallohu anhudan, Abu Usmon an-Nahdiy, Qobisa ibn Zuvib, o'g'illari Abdulloh va boshqalar rivoyat qilganlar.\r\n    Avval Rasululloh sollallohu alayhi vasallam bu zotni Zotus Salosilga, so'ngra Ummonga boshliq qildilar. Keyinchalik Shom, Misr va Falas¬tinda bir necha yil amir bo'lib turdilar.\r\n    Amr ibn Oss roziyallohu anhu vafot etishlaridan oldin ko'p yig'ladilar. O'g'illari:\r\n    'Nega yig'layapsiz, o'limdan qo'rqyapsizmi?' deb so'raganlarida, u zot:\r\n    'O'limdan keyin nima bo'lishimdan qo'rqyapman', dedilar. Shunda o'g'illari:\r\n    'Qo'rqmang, otajon, hayotingiz yaxshilik bilan o'tdi. Islomga kirdingiz, doim Rasululloh sollallohu alayhi vasallamning yonlarida bo'ldingiz. Shom va Misrni fath etdingiz', dedilar.\r\n    Shunda Amr ibn Oss aytdilar:\r\n    'Mening hayotim uch qismga bo'linadi. Oldiniga kofir edim, agar shunday holatda o'lganimda, odamlar 'Xudoga shukr, bundan qutuldik', deyishar edi. So'ngra Islomni qabul qilib, musulmon bo'ldim. Agar shunday holatda o'lganimda, jannatga tushishim aniq bo'lar edi. Bulardan keyin amir bo'lib, boyliklar va hashamatli uy-joylarga ega bo'ldim. Ular mening foydamga bo'ldimi yoki zararimgami, shu to'g'rida bilmasdan armondaman'.\r\n    Amr ibn Oss roziyallohu anhu hijratning 43-sanasida Fitr iydi kuni Misrda vafot etdilar. Janozalarini o'g'illari Abdulloh o'qidilar va ana shu yerdagi Miqto qabristoniga dafn etildilar."
        ]
    },
    {
        "word": "Amr ibn Salama",
        "type": [],
        "definition": [
            "Amr ibn Salama ibn Nufay' al-Jarmiy, kunyalari Abu Burayd.\r\n    Payg'ambarimiz sollallohu alayhi vasallamning davrlarida Qur'onni ko'p yodlaganlari uchun qavmlariga imom bo'ldilar. Ana shu vaqtda 7 yoshda edilar. Chunki bu kishi qavmlari nomidan Rasululloh sollallohu alayhi vasallam huzurlariga elchi bo'lib kelganlarida u zot sollallohu alayhi vasallam: 'Qorilaringiz imom bo'lsin', deb aytgan edilar.\r\n    'Jarm' – qabilaning nomi. Amr ibn Salama roziyallohu anhu ana shu qabilaga mansub bo'lganlar. O'sha qabila yashaydigan makonda suvli joy bor edi. O'tgan-ketgan barcha musofirlar o'sha yerda to'xtab, dam olishar, suv ichib, ulovlarini sug'orar edilar. Shu jumladan, u yerda musulmonlar ham to'xtar, namoz o'qir, Qur'on tilovat qilar edilar. Atrofda o'ynab yurgan yosh bola – Amr ibn Salama ulardan eshitgan narsalarni yodlab olgan edi.\r\n    Jarm qabilasi Payg'ambarimiz sollallohu alayhi vasallamning xabarlarini eshitib, u zotning huzurlariga vakil guruh yubordi. O'sha guruh ichida Amr ibn Salama roziyallohu anhu ham bor edilar. Payg'ambarimiz sollallohu alayhi vasallam bilan uchrashuvdan keyin u kishi o'z qavmiga imom bo'lib qoldilar."
        ]
    },
    {
        "word": "Amr ibn Saʼiyd",
        "type": [],
        "definition": [
            "Amr ibn Sa'iyd ibn Oss al-Qurashiy. Akalaridan sal keyinroq Islomni qabul qilib, Habashiston va Madinaga hijrat qildilar.\r\n    Amr ibn Sa'iyd ham, akalari ham Rasululloh sollallohu alayhi vasallam bilan Makkani fath etishda, Hunayn, Toif, Tabuk g'azotlarida ishtirok etadilar. Rasululloh sollallohu alayhi vasallam bu kishini Xaybar mevalariga mudir qilib tayin¬laydilar.\r\n    Amr ibn Sa'iyd hazrati Abu Bakrning xalifalik davrlaridagi Ajnodin hodisasida shahid bo'lganlar."
        ]
    },
    {
        "word": "Amri maʼruf",
        "type": [],
        "definition": [
            "yaxshi ishlarga buyurish, haq yo'lga chorlash."
        ]
    },
    {
        "word": "Amrimahol ",
        "type": [],
        "definition": [
            "imkonsiz ish"
        ]
    },
    {
        "word": "Anaza",
        "type": [],
        "definition": [
            "Anaza – uchiga temir qoplangan, sutra vazifasini o'tovchi tayoq (hassa)."
        ]
    },
    {
        "word": "Anas roziyallohu anhu",
        "type": [],
        "definition": [
            "Anas ibn Molik ibn Nazr Ansoriy Xazrajiy Najjoriyning kunyalari Abu Hamza bo'lib, onalari Ummu Sulaym binti Milhondir. Yoshlari o'nga yetganda onalari u kishini Rasululloh sollallohu alayhi vasallamning xizmatlariga berdilar. O'sha kundan boshlab, u zot Rasululloh sollallohu alayhi vasallamning huzurlarida bo'ldilar. Rasululloh sollallohu alayhi vasallamning Anas ibn Molikka muomalalari xo'jayinning xizmatchisiga qilgan muomalasidek bo'lmay, otaning bolasiga muomalasidek muloyim edi.\r\n    Anas ibn Molik roziyallohu anhuning o'zlari aytadilar: 'Rasululloh sollallohu alayhi vasallam biror qilgan ishimni nimaga bunday qilding yoki buyurgan ishimni nega qilmading, deb so'ramas edilar. Balki 'Allohning xohlagani bo'ladi, xohlamagani bo'lmaydi', der edilar'.\r\n    Sayyor ibn Robiy'adan rivoyat qilinadi: 'Anas ibn Molik aytdi: 'Bir kuni onam bilan birga Rasululloh sollallohu alayhi vasallam huzurlariga bordik. Onam Rasululloh sollallohu alayhi vasallamga: 'Xodimingizning haqqiga duo qiling', deganlarida Rasululloh sollallohu alayhi vasallam: 'Allohim, buning molu dunyosini ko'p qilib, umrini uzoq qilgin va gunohlarni mag'firat aylagin', dedilar'.\r\n    Abu Hurayra roziyallohu anhu: 'Anas ibn Molikdan boshqa Rasululloh sollallohu alayhi vasallamning namozlariga o'xshash namoz o'qiydigan biror bir kishini ko'rmadim', deydilar.\r\n    Sumoma ibn Abdulloh: 'Anas ibn Molik namozda qiyomni uzoq qilar edi, hatto oyoqlaridan qon chiqib ketardi', deydilar.\r\n    Abu Bakr Siddiq roziyallohu anhu Anasni Bahraynga yuborish haqida hazrati Umar ibn Xattob roziyallohu anhudan maslahat so'raganlarida hazrati Umar Anasning taqvosini va uzoq vaqt Rasululloh sollallohu alayhi vasallam bilan birga yashaganini e'tiborga olib, 'U oqil yigitlardan edi', deb maqtaganlar.\r\n    Bu zot Rasululloh sollallohu alayhi vasallam bilan birga Badr jangidan boshqa barcha jang¬larda ishtirok etganlar. Badr jangida yoshlari kichkina bo'lganligi sababli qatnasha olmaganlar.\r\n    Anas ibn Molik hammasi bo'lib, 2286ta hadis rivoyat qilib, Abu Hurayra va Ibn Umarlardan keyingi o'rinlarni egalladilar. Bu zotdan Ibn Siyriyn, Sobit al-Bunoniy, Qatoda, Hasan Basriy, Zuhriy va boshqalar rivoyat qilishgan.\r\n    Anas roziyallohu anhu hayotlarining oxirida Basraga ko'chib o'tdilar va o'sha yerda hijratning 93-yilida vafot etdilar. U zotni Muhammad ibn Siyrin yuvib, Qatoda ibn Mudrik janozalarini o'qidilar. Anas ibn Molikda Rasululloh sollallohu alayhi vasallamdan qolgan hassacha bo'lib, o'zlarining vasiyatlariga binoan, vafotlaridan keyin u kishi bilan birga ko'mildi."
        ]
    },
    {
        "word": "Anbar",
        "type": [],
        "definition": [
            "Anbar – xushbo'ylikning bir turi. Hanafiy mazhabida anbardan zakot berilmaydi."
        ]
    },
    {
        "word": "Anbarduvon",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan. Vobkent tumanidagi Avarduvon qishlog'i."
        ]
    },
    {
        "word": "Anbiyo ",
        "type": [],
        "definition": [
            "nabiy so'zining ko'pligi, payg'ambarlar."
        ]
    },
    {
        "word": "Anbijoniya",
        "type": [],
        "definition": [
            "Anbijoniya – Anbijon degan joydan keltiriladigan naqshsiz qalin en kiyim."
        ]
    },
    {
        "word": "Andaq",
        "type": [],
        "definition": [
            "Buxorodan o'n farsax uzoqlikdagi qishloq. Navoiy viloyati Qiziltepa tumani Toshrabot QFYga qarashli Xo'ja Hasan Andoqtepa qishlog'i."
        ]
    },
    {
        "word": "Anjofirin",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan. Vobkent tumanidagi Anjirbog' qishlog'i."
        ]
    },
    {
        "word": "Anjuj ",
        "type": [],
        "definition": [
            "Anjuj (alanjuj yoki yalanjuj ham deyiladi) – uvdning boshqa nomi. Uvd – isiriqqa o'xshash, tutatiladigan xushbo'y cho'p."
        ]
    },
    {
        "word": "Anisun",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "An-nashr fil qiroat al ʼashr",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "An-Niʼamis savobigʻ fiy sharhi kalimin navobigʻ ",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi imom Zamaxshariy rahmatullohi alayhining kitobiga yozilgan sharhdir. Bu kitob chop qilingan."
        ]
    },
    {
        "word": "An-nos ",
        "type": [],
        "definition": [
            "insonlar, odamlar, kishilar, fuqarolar."
        ]
    },
    {
        "word": "Ansor",
        "type": [],
        "definition": [
            "yordamchilar, safdoshlar. Muhammad alayhissalomning sahobiylari. Makkadan 622 yil Madinaga hijrat qilib borgan muhojirlarga yordam bergan madinalik musulmonlar jamoasi."
        ]
    },
    {
        "word": "Anʼom surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 165 oyatdan iborat.\r\n    'An'om' so'zi 'chorva mollari' degan ma'noni anglatadi. Surai karimaning oxirida an'omning zikri va hukmi kelgani uchun ham u shu nomni olgan. Bu sura eng uzun makkiy suralardan hisoblanadi. Rivoyatlarda kelishicha, 165 oyati karimaning hammasi Nabiy sollallohu alayhi vasallamga Makkai Mukarramada bir kechada, bir yo'la nozil bo'lgan. Boshqa suralarga o'xshab bo'lak-bo'lak bo'lib tushmagan. Payg'ambarimiz sollallohu alayhi vasallam uni darhol yodlab olganlar va mirzalarini chaqirib, imlo qilib turib, yozdirib qo'yganlar.\r\n    Asmo binti Yaziyd roziyallohu anhodan qilingan rivoyatda:\r\n    An'om surasi Payg'ambar sollallohu alayhi vasallamga bir yo'la nozil bo'ldi. Men Rasululloh sollallohu alayhi vasallamning tuyalarining jilovidan ushlab turar edim. Suraning og'irligidan tuyaning suyaklari sinib ketay dedi', – deyiladi.\r\n    Imom Tobaroniy hazrati Abdulloh ibn Abbos roziyallohu anhudan qilgan rivoyatda:\r\n    An'om surasi Makkada, kechasi, bir yo'la nozil bo'ldi. Atrofda yetmish ming farishta tasbeh aytib turdilar', – deyiladi.\r\n    Shu dalillarning o'ziyoq bu surai karimaning maqomi nechog'li balandligini va unda kelgan masalalar naqadar ahamiyatli ekanini ko'rsatadi.\r\n    Bu surai karimaning mavzusi o'n uch yil davomida Makkada muolaja qilingan bosh masala – aqiyda masalasidan iboratdir. Ya'ni Allohning yagona ilohligini, ibodatga sazovorligini, Olamlarning Tarbiyachisi, Roziqi va Hokimi ekanini insonlarning yagona aqiydasiga aylantirishdan iboratdir. Chunki inson hayotidagi hamma ishlar aqiyda asosida isloh qilinmasa, natija bo'lmaydi. Faqat sof va mustahkam aqiyda asosida olib borilgan ishgina muvaffaqiyatli chiqishi mumkin. Aqiydasiz iqtisod ham, siyosat ham, axloq-odob ham, ijtimoiy adolat ham va boshqa narsalar ham muvaffaqiyatga erisha olmaydi. Shu boisdan Islom dinining birinchi davri – Qur'oni Karimning o'n uch yillik davri shu muhim masalaga bag'ishlangan. Ushbu surai karimada banda Allohga nisbatan qanday aqiydada bo'lishi kerak, banda nima qilsa, haqiqiy – to'g'ri yo'lda yurgan hisoblanadi – shular haqida bayon qilingan.\r\n    Suraning avvalida turli but va sanamlarga sig'inayotgan mushriklarning amallari botil ekani bayon qilinib, Allohning yagonaligiga dalillar keltiriladi. Bu oyat-alomatlarni inkor qiluvchilarning holi ne kechgani misollar bilan isbot etilib, Allohning haqiqiy iloh ekani ta'riflanadi. Insoniyatga ushbu haqiqatni bayon etish sharafi Nabiy sollallohu alayhi vasallamga yuklatiladi. Surada u zotga 'Ayt!' deb, takror-takror xitob etiladi. Ushbu xitob bir oyati karimada to'rt marta qaytarilgan o'rinlar ham bor. Umuman, 'Ayt!' amri surai karimada qirq to'rt marta takrorlangan. Shuningdek, Alloh taoloning ta'rifotida 'U' lafzi ko'p qo'llanilgan.\r\n    Suraning davomida mushriklar inkor etayotgan bu Kitobni (ya'ni Qur'onni) ahli kitoblar yaxshi bilishi, o'z navbatida, shirk katta zulm ekani va mushriklarning qiyomatdagi ahvollari zikr qilinadi.\r\n    So'ngra Nabiy sollallohu alayhi vasallamga mushriklarning amallaridan ranjimaslik ta'kidlanib, tasalli beriladi va o'tgan payg'ambarlardan o'rnak olishga chaqiriladi.\r\n    Suraning so'ngida hayvonlar va ekinlar, halol va harom haqida so'z boradi."
        ]
    },
    {
        "word": "Arafa",
        "type": [],
        "definition": [
            "bilmoq, tanimoq, tushunmoq, ma'rifat hosil qilmoq. Qurbon hayitidan oldingi kun. Hijriy-qamariy yil bo'yicha zulhijja oyining (12-oy) to'qqizinchi kuni."
        ]
    },
    {
        "word": "Arafot",
        "type": [],
        "definition": [
            "Makka shahridan 20 km narida joylashgan, uzunligi 11-12 km va kengligi 6,5 km bo'lgan vodiy. Hojilar arafa kuni ushbu vodiyga borib, quyosh botgunga qadar ibodat bilan mashg'ul bo'lishadi. U yerda bo'lish hajning uch farzidan biridir."
        ]
    },
    {
        "word": "Arbaʼiyn fil hadis",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining kitobi. Kitobning nomidan ham ko'rinib turibdiki, allomai Taftazoniy rahmatullohi alayhi unga Rasululloh sollallohu alayhi vasallamning bir mavzudagi qirqta hadislarini jamlagan."
        ]
    },
    {
        "word": "Arbun savdosi",
        "type": [],
        "definition": [
            "Bunda bir narsani sotib olishga ahdlashgan shaxs sotuvchiga uning bahosidan bir oz beradi. Agar savdo yurishib ketsa, mazkur bay'boshi bahodan bir bo'lakka aylanadi. Agar xaridor aynib qolsa, mazkur mablag' undan sotuvchiga hadya bo'ladi. Bu savdoni jumhur 'botil', hanafiylar 'fosid savdo' deydilar. Hozirgi ulamolar Islom fiqhi akademiyasining hijriy 1414-sanada, Burunayda bo'lib o'tgan yig'ilishida bu savdoni joiz degan qarorni chiqarganlar."
        ]
    },
    {
        "word": "Arvoh",
        "type": [],
        "definition": [
            "Ruhlar"
        ]
    },
    {
        "word": "Arj",
        "type": [],
        "definition": [
            "Arj – Makka bilan Madina orasida joylashgan qishloq nomi."
        ]
    },
    {
        "word": "Arz",
        "type": [],
        "definition": [
            "Arz – qiyomat kuni bandalarning nomai a'mollari taqdim etiladigan, namoyon qilinadigan holat."
        ]
    },
    {
        "word": "Aris qudugʻi",
        "type": [],
        "definition": [
            "Aris qudug'i – Madinai Munavvaradagi Qubo masjidi yaqinida joylashgan quduq va shu quduq o'rnashgan bog'. Arablarda bog'larni ulardagi quduq nomi bilan atash odati bo'lgan."
        ]
    },
    {
        "word": "Arisiyyun",
        "type": [],
        "definition": [
            "Bu so'z haqida tarixchi va tilshunos olimlar ko'p bahs yuritishgan. Alloma Abulhasan Nadaviy hazratlari bu so'z masihiylarning aqiydasida tavhid masalasini oldinga surgan Ariyus ismli mashhur din peshvosining nomi ila atalgan mazhab deb ta'kidlaganlar."
        ]
    },
    {
        "word": "Arok",
        "type": [],
        "definition": [
            "Arok – ildizidan novdalaridan misvok tayyorlanadigan butasimon daraxt turi. Arokning mevasi 'bariyr' yoki kabas deb ataladi."
        ]
    },
    {
        "word": "Aroya",
        "type": [],
        "definition": [
            "'Aroya'–'oriyat' 'vaqtincha foydalanish' ma'nosini bildiradi. Voqe'likda esa, boy odam kambag'alga: 'Ushbu daraxtning bu yilgi mevasidan foydalanaver', deydi. Kambag'al o'ziga 'oriyat'ga–vaqtincha foydalanishga–berilgan daraxt oldiga kelib-ketaverishi boy uchun noqulaylik tug'dirib qolib, 'Sening shu daraxtingdan chiqadigan mevani hoziroq berib qo'yay', deb u bilan kelishadi. Ana o'sha savdo istisno tariqasida joiz. Chunki, ikki holatda ham kambag'al foyda ko'radi. Ayniqsa, tayyor meva berilganda aniq foyda muddatdan oldin yuzaga chiqadi"
        ]
    },
    {
        "word": "Ar-Radd ʼala zandaqati Ibn Arabiy",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi Muhiddin ibn Arabiyning 'Fususul hikam' degan kitobiga raddiyadir."
        ]
    },
    {
        "word": "Ar-Raddu Ala siyaril Avzoʻiy",
        "type": [],
        "definition": [
            "Bu juda ham puxta kitob bo'lib, unda Abu Yusuf rahmatullohi alayhi Avzo'iyning urush holatida musulmonlar bilan boshqalar orasidagi aloqalar va jihodga taalluqli narsalar borasidagi ixtiloflarini bayon qilgan. Unda iroqliklarning fikrlariga yon bosilgan"
        ]
    },
    {
        "word": "Ar-risala al bayaniyya fiy haqqi abavayin-Nabiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari."
        ]
    },
    {
        "word": "Ar-Rohman surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 78 oyatdan iborat\r\n    Ko'pchilik mutaxassislar bu surai karimaning Madinada nozil bo'lganini ta'kidlasalar-da, Makkada nozil bo'lgan, deyuvchilar ham oz emas. Ma'lumki, Qur'oni Karim oyatlarining makkiy va madaniy ekanini bilishning o'z qoidalari bor. Ana shu qoida va belgilar nuqtai nazaridan qaraydigan bo'lsak, Ar-Rohman surasi makkiy ekani g'olib bo'ladi.\r\n    Bu surai karimaning nomi uning birinchi oyatidan olingan bo'lib, 'Ar-Rohman' Allohning sifatlaridan biridir. Bu muborak so'zning ma'nosi haqida tafsirimizning avvalida batafsil bayonot berilgan.\r\n    Imom Bayhaqiy hazrati Ali karramallohu vajhahudan qilgan rivoyatda Nabiy alayhissalom: 'Har bir narsaning kelini bor, Qur'onning kelini Ar-Rohman surasidir', – deganlar. Chunki bu surai karima xuddi kelinlar o'z bezaklari ila boshqalardan farqlanib turgandek, o'ziga xos uslubi bilan boshqa suralardan ajralib turadi.\r\n    Makkiy suralarning asosiy mavzusi bo'lgan aqiyda asoslari masalasi bu suraning ham mavzusidir. Surada ham jinlarga, ham insonlarga xitob qilinadi.\r\n    Suraning avvalida Alloh taoloning ochiq-oydin ne'matlari, jumladan, Qur'onning ta'limi, bayon qilish qobiliyati, quyosh, oy, yulduz va boshqalar zikr qilinadi.\r\n    Bandalar ushbu ne'matlarga shukr keltirishlari lozimligi asosiy maqsadlardan biridir.\r\n    So'ngra qiyomat kunining tayyorgarligi insonga ham, jinlarga ham lozimligi uqtiriladi, u Kunning dahshatlari sifatlanadi.\r\n    Va, nihoyat, sura Alloh taoloni ulug'lovchi oyatlar bilan tugaydi."
        ]
    },
    {
        "word": "Arfud",
        "type": [],
        "definition": [
            "Karma yaqinidagi qishloqlaridan. Tavovis qishlog'ining islomdan ilgarigi nomi."
        ]
    },
    {
        "word": "Arshin",
        "type": [],
        "definition": [
            "Arshin' deganimizda o'rtacha odamning panjasi uchidan tirsagigacha bo'lgan uzunlik tushuniladi. Bu 61,2 sm bo'lgan. Demak, eni va bo'yi 6 metru 12 sm.dan bo'lgan hovuzning suvi, Hanafiy mazhabi bo'yicha, najas narsa tushsa, nopok bo'lmaydigan eng oz suv hisoblanar ekan."
        ]
    },
    {
        "word": "Asaba",
        "type": [],
        "definition": [
            "so'zi lug'atda 'yaqin turgan', 'yopishgan' degan ma'noni anglatadi. Kishi boshini mahkam bog'lab olishiga ishlatgan bog'ichga ham shu so'z ishlatiladi. Shu ma'noda kishining yaqin erkak qarindoshlari ham 'asaba' deyiladi. Chunki, unga nisbatan biror xavf-xatar tug'ilganda o'sha qarindoshlar kelib uning atrofini o'rab olib himoya qiladilar. Undan dushmanni daf' qiladilar. O'zlarining hayotlarini xavf ostiga qo'yadilar. Shuningdek, moliyaviy to'lovlarga ojiz bo'lib qolsa ham, o'shalar to'laydilar. Shuning uchun ham, ular merosga haqli bo'lganlar."
        ]
    },
    {
        "word": "Asb",
        "type": [],
        "definition": [
            "Asb – Yamanda tayyorlangan, iplari oldin bo'yalib, so'ng to'qilgan ustki kiyim."
        ]
    },
    {
        "word": "Asbagʻ",
        "type": [],
        "definition": [
            "Asbag' ‒ qush turi. Odatda u zaif, kuchsiz bo'ladi."
        ]
    },
    {
        "word": "Aslam",
        "type": [],
        "definition": [
            "Aslam – Banu Xuzo'aga mansub qabila."
        ]
    },
    {
        "word": "Asnal matolib fiy manaqibi Aliy ibn Abi Tolib",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari."
        ]
    },
    {
        "word": "Asr namozi",
        "type": [],
        "definition": [
            "Har bir narsaning soyasi o'ziga ikki barobar bo'lgandan to quyosh botguncha o'qiladigan namoz."
        ]
    },
    {
        "word": "Asr surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 3 oyatdan iborat.\r\n    Ushbu surai karimaga ham uning birinchi oyati nom bo'lib qolgan. 'Asr' kalimasi 'zamon', 'yuz yil', 'umr', 'Asr namozi', 'Asr namozining vaqti' kabi ma'nolarni anglatadi. Alloh taolo ushbu surani asr bilan qasam ichib boshlab, asrning ahamiyatli narsa ekaniga e'tiborni jalb qiladi.\r\n    Bu sura qisqa bo'lishiga qaramay, o'zida juda ko'p ma'nolarni jamlagan. Imom Shofe'iy rahmatullohi alayhi: 'Agar shu suradan boshqa sura nozil bo'lmaganda ham, odamlarga kifoya qilardi', – degan ekanlar.\r\n    Nabiy sollallohu alayhi vasallamning sahobalaridan ikki kishi uchrashib qolsalar, 'Val-asri' surasini bir-birlariga o'qib bermasdan tarqalmas ekanlar.\r\n    Bu sura bashariyat hayotiga Islom iroda qilgan yo'l-yo'riqni o'z ichiga olgan. 'Val-asri' surasining bir oyati musulmon ummatining sifatini, haqiqatini va vazifasini bayon qiladi. Bu esa, o'z navbatida, Qur'onning mo''jizasidir."
        ]
    },
    {
        "word": "Assalomu alaykum",
        "type": [],
        "definition": [
            "sizga tinchlik, salomatlik tilayman. Musulmonlar o'zaro uchrashganda ishlatiladigan salomlashuv iborasi."
        ]
    },
    {
        "word": "Ashob",
        "type": [],
        "definition": [
            "sahobalar, do'stlar, o'rtoqlar, sheriklar, saboqdoshlar; shogirdlar. Egalari: Ashobi kahf – g'or egalari."
        ]
    },
    {
        "word": "Ashobi suffa",
        "type": [],
        "definition": [
            "'Ashobi suffa' sahobai kiromlardan bir guruhiga berilgan nom bo'lib, ularning turar joylari bo'lmaganligidan Payg'ambar sollallohu alayhi vasallamning masjidlari ortidagi suffada yashab, ko'proq Masjidi Nabaviyga kelgan xayr-ehsonlardan kun ko'rar edilar.\r\n     Hozirgi kunda ham o'sha suffa isloh qilingan holda saqlanib qolgan. Payg'ambarimiz sollallohu alayhi vasallam ashobi suffalarni ehtirom qilar, ko'ngillarini ko'tarar, ko'pincha ular bilan birga o'tirar edilar."
        ]
    },
    {
        "word": "Ashobi tarjih",
        "type": [],
        "definition": [
            "Hanafiy faqihlari to'rtinchi tabaqasi"
        ]
    },
    {
        "word": "Ashoblarimiz",
        "type": [],
        "definition": [
            "Imom Abu Hanifa rahmatullohi alayhi, Abu Yusuf va Muhammad ibn Hasan Shayboniy"
        ]
    },
    {
        "word": "Atan",
        "type": [],
        "definition": [
            "Atan – suv atrofida tuya cho'ktirish uchun ajratilgan joy. Tuya bir marta sug'orilgach, atanga olib borib cho'ktirilgan, birpas dam olgach, yana sug'orilgan."
        ]
    },
    {
        "word": "Atiyya al-Quraziy",
        "type": [],
        "definition": [
            "Atiyya al-Quraziy Rasululloh sollallohu alayhi vasallamni ko'rganlar va u zotdan hadis eshitganlar. Bu sahoba Kufada istiqomat qilganlar. Nasablari esa noaniqdir.\r\n    Bu zot rivoyat qilgan hadislarni Mujohid va Abdulmalik ibn Umayrlar rivoyat qilganlar."
        ]
    },
    {
        "word": "Atiq as-Saʼdoniy",
        "type": [],
        "definition": [
            "Abu Mansur Atiq ibn Ahmad as-Sa'doniy Buxoro ahlidan bo'lib, bu kishidan Abu Solih Nazr ibn Muso al-Adib hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ato ",
        "type": [],
        "definition": [
            "Ato – Rasululloh sollallohu alayhi vasallamning huzurlarida jamlangan o'lja, sadaqa, hadya va boshqa narsalar."
        ]
    },
    {
        "word": "At-tavdih fiy sharhil masobih ",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "At-tavjihat fiy usulil qiroat",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "At-Tavziyh",
        "type": [],
        "definition": [
            "Sodrush shariy'a Ubaydulloh ibn Mas'ud al-Buxoriyning kitobi"
        ]
    },
    {
        "word": "At-Tavziyh fiy halli gʻavomiz at-Tanqiyh",
        "type": [],
        "definition": [
            "Sodrush shariy'a Ubaydulloh ibn Mas'ud al-Buxoriy o'zining 'At-Tanqiyh' nomli kitobiga yozgan sharhi"
        ]
    },
    {
        "word": "At-tajun-nadiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari."
        ]
    },
    {
        "word": "At-takrim fil umroti minat-tanʼim",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari."
        ]
    },
    {
        "word": "At-taqyid fil xulfi baynash-Shatibiyya vat-tajrid",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "At-Talviyh fiy kashfi haqoiqit tanqiyh",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi shayx Sodrushshariy'a Ubaydulloh ibn Mas'ud Buxoriyning 'Tanqiyhul usul' kitobiga bitilgan sharhdir. Allomai Taftazoniy rahmatullohi alayhi o'zining bu kitobini Gulistonda, hijriy 758, milodiy 1357 yili zulqa'da oyining yigirma to'qqizinchi kunida yozib tugatgan. Bu kitob ko'p marta chop qilingan juda mashhur kitoblardan hisoblanadi."
        ]
    },
    {
        "word": "At-tamhid fiy ilmit-tajvid",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tajvid bo'yicha kitoblari."
        ]
    },
    {
        "word": "At-taʼrif bil mavlidish-sharif",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari."
        ]
    },
    {
        "word": "At-tizkar fiy rivayati Aban ibn Ziyad al Atto",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Atf",
        "type": [],
        "definition": [
            "Bog'lovchi"
        ]
    },
    {
        "word": "Afv",
        "type": [],
        "definition": [
            "Zakot bobida 'afv' deganda bir nisob bilan ikkinchisi orasidagi mol anglanadi. Misol uchun, qo'y qirqtaga yetganidan to bir yuz yigirmataga yetgunicha bir dona qo'yni zakotga beriladi. Qirqta qo'ydan ham bir dona qo'y, bir yuz o'n to'qqizta qo'ydan ham bir dona qo'y zakotga beriladi."
        ]
    },
    {
        "word": "Aflah ash-Shayboniy az-Zabagʻduvoniy",
        "type": [],
        "definition": [
            "Abu Muhammad Aflah ibn Bisom ash-Shayboniy az-Zabag'duvoniy - Buxoroning Zabag'duvon nomli qishlog'idan. Ko'p xayrli ishlar qilardilar. Duolari ijobat bo'luvchilardan edilar. Sa'id ibn Mansur va Muhammad ibn Salom al-Paykandiydan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Minjob hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Afraxsh ",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan bo'lib, Buxorodan to'rt farsax uzoqlikda joylashgan. Jondor tumanidagi Varaxsha qishlog'i."
        ]
    },
    {
        "word": "Affaakun",
        "type": [],
        "definition": [
            "'Affaakun' – kazzob."
        ]
    },
    {
        "word": "Afshavon",
        "type": [],
        "definition": [
            "Peshku tumanidagi Afshona qishlog'i. Buxorodan to'rt farsax uzoqlikda."
        ]
    },
    {
        "word": "Axbor",
        "type": [],
        "definition": [
            "xabarning ko'pligi, xabarlar. Hadis olimlarining istilohida axbor so'zi hadis so'zining sinonimi shaklida qo'llaniladi."
        ]
    },
    {
        "word": "Axloqu Azududdin",
        "type": [],
        "definition": [
            "Shayx Azududdin Iyjiy rahmatullohi alayhining kitobi. Axloq borasidagi ko'plab kitoblardan muxtasar qilingan bu kitob to'rt maqoladan iborat. Azududdin Iyjiy rahmatullohi alayhining ba'zi shogirdlari bu kitobni sharh ham qilishgan."
        ]
    },
    {
        "word": "Ahad",
        "type": [],
        "definition": [
            "Ahad – yagona."
        ]
    },
    {
        "word": "Ahasin al minan",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari."
        ]
    },
    {
        "word": "Ahbor",
        "type": [],
        "definition": [
            "Ahbor' (birligi 'habr') – yahudiy olimi."
        ]
    },
    {
        "word": "Ahzob surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 73 oyatdan iborat.\r\n    'Ahzob' so'zi 'hizb'ning ko'pligi bo'lib, 'guruhlar' yoki 'firqalar' degan ma'noni anglatadi. Dushmanlar barcha guruh va firqalari ila Islomga qarshi kurashganlari uchun 'Ahzob' nomi bilan tarixga kirgan urush haqida hikoya qiluvchi oyatlari borligi sababli, ushbu sura 'Ahzob' deb atalib qolgan.\r\n    Ahzob surasi ham o'ziga xos uslubga ega. Unda Badr urushidan to Hudaybiya sulhigacha bo'lgan davrdagi musulmon jamoasi hayotining turli jihatlari, Islom jamiyatining johiliy e'tiqod va tasavvurlardan poklanish jarayoni haqida hikoya qilinadi. Shariatning yangi hukmlarini joriy etish haqida so'z boradi. Shu bilan birga, ushbu surada Islomni va musulmonlarni yer yuzidan yo'q qilib tashlashga bel bog'lagan kofir guruhlarga qarshi kurash ham tasvirlanadi.\r\n    Ahzob surasida asosan musulmonlar jamiyatini barpo etish uchun zarur bo'lgan ko'rsatmalarga va ijtimoiy odob-axloq masalalariga jiddiy e'tibor berilgan. Masalan, to'y-marosimlarda lozim bo'ladigan odob-axloq, ayollarning hijobi, ochiq-sochiq holda yurish mumkin emasligi va o'zlarini qanday tutishlari lozimligi masalasi bahs etilgan. Shuningdek, Payg'ambar sollallohu alayhi vasallam bilan qay tarzda muomala qilish lozimligi ham ko'rsatilgan. Boshqa yana bir qancha ijtimoiy odob-axloq haqida so'z yuritilgan. Ahzob surasida johiliyat qonunlari va urf-odatlaridan bo'lmish zihor, farzand asrab olish, meros, asrab olgan bolasining xotiniga uylanish kabi masalalarga Islom nuqtai nazaridan qanday yondashish kerakligi bayon etiladi. Nabiy sollallohu alayhi vasallamning ko'p xotinli bo'lishlarining hikmatlariga ham to'xtab o'tiladi. Nabiy sollallohu alayhi vasallamga salovot aytish, shar'iy hijob, to'y-marosimlarga chaqirish kabi masalalar yuzasidan shariatning hukmi bayon qilinadi.\r\n    Shuningdek, musulmonlarning tashqi olam bilan, boshqa jamiyatlar bilan o'rnatadigan aloqalari ham tilga olinadi. Bu jihat, ayniqsa, Ahzob va Banu Qurayza urushlarini tasvirlash va muolaja etish jarayonida ko'zga tashlanadi.\r\n    Ahzob surasi Nabiy sollallohu alayhi vasallamni Allohga taqvo qilishga, kofir va munofiqlarga itoat etmaslikka buyurish bilan boshlanadi. U zoti bobarakot o'zlariga kelgan vahiyga ergashishlari va Allohga tavakkul qilishlari lozimligi uqtiriladi.\r\n    So'ngra johiliy urf-odatlarning botil jihatlari ochib tashlanadi. Aqlli, ziyrak odamning ikkita qalbi bo'ladi, degan tasavvurning va boshqa johiliy odatlarning botilligi aytib o'tiladi.\r\n    Johiliy arablarda 'zihor' deb nomlangan hukm bor edi. Unga ko'ra, kim o'z xotiniga 'Sen men uchun onamning orqasi kabisan', desa, unga xotini xuddi onasidek bo'lib qoladi, deb hisoblanardi.\r\n    Surada o'sha hukm botil etiladi. Shuningdek, farzand asrab olish bo'yicha ular joriy etgan hukmlar ham bekor qilinadi.\r\n    Surada Nabiy sollallohu alayhi vasallamning Islom ummatiga hammadan afzal valiy ekanliklari, u zotning zavjai mutohharalari mo'minlar uchun ma'naviy ona sanalishlari haqidagi oyatlar ham bor.\r\n    Shuningdek, bu surada meros haqidagi noto'g'ri tushunchalar ham tuzatiladi.\r\n    Mo'minlarga hujum qilgan dushmanlarni Alloh taolo O'z ne'mati ila daf etgani haqida so'z ketadi. Ahzob va Banu Qurayza urushlari jonli qilib tasvirlanadi. Urush vaqtida mo'minlar o'zlarini qanday tutganlari-yu, munofiqlar qanday tutganlari ajoyib bir uslubda hikoya qilinadi.\r\n    Keyin esa Nabiy sollallohu alayhi vasallam bilan u kishining pokiza zavjalari – jufti halollari orasida bo'lib o'tgan ba'zi bir holatlar bayon etiladi.\r\n    Xususan, maishat masalasida kenglik talab qilgan onalarimizga nisbatan bo'lgan muomala ochiq-ravshan keladi.\r\n    So'ngra hazrati Zaynab binti Jahshning Zayd ibn Horisa roziyallohu anhuga turmushga chiqishlari va ular orasida bo'lib o'tgan hodisalar haqida so'z ketadi.\r\n    Ularning oralariga taloq tushishi ham aytiladi. Keyin Allohning amri bilan Nabiy sollallohu alayhi vasallam o'zlari asrab olgan Zaydning taloq qilgan ayoliga uylanishlari haqidagi oyatlar keladi. Bu ish Rasululloh uchun og'ir kechgani, u zot turli mulohazalarga borganlari ham zikr etiladi. Shu munosabat bilan Rasululloh sollallohu alayhi vasallamning, umuman, mo'minlar huzuridagi maqomlari bayon qilinadi.\r\n    Bulardan keyin taloq masalasi keladi. Nabiy sollallohu alayhi vasallam kimlarga uylanishlari mumkin-u, kimlarga mumkin emasligi zikr qilinadi.\r\n    Nabiy sollallohu alayhi vasallamning xotinlari, qizlari va mo'mina ayollar o'zlarini qanday tutishlari lozimligi ham bayon etiladi.\r\n    Nihoyat, surai karima Alloh subhanahu va taolo tomonidan insonga osmonlaru yer va tog'lar ham ko'tara olmagan ulkan omonat yuklatilganligi haqidagi oyatlar bilan tamomlanadi."
        ]
    },
    {
        "word": "Ahkom",
        "type": [],
        "definition": [
            "Shariati islomiyada bandalar bajarishi, bajarmasligi shart qilingan va ixtiyoriy hukmlar."
        ]
    },
    {
        "word": "Ahqof surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 35 oyatdan iborat.\r\n    Bu surai karimaning nomi uning o'zidagi 21-oyatdan olingandir. 'Ahqof' so'zi Od qabilasi yashab o'tgan diyorlarning nomi bo'lib, lug'aviy jihatdan 'qum tepaliklar' degan ma'noni anglatadi.\r\n    Ahqof surasi boshqa makkiy suralar kabi aqiyda masalasini muolaja qiladi. Bu surada Allohning yagonaligiga, vahiy va payg'ambarlik, o'lgandan so'ng qayta tirilish hamda hisob-kitob bo'lishi haqligi masalalariga alohida ahamiyat beriladi.\r\n    Bu surada Hud alayhissalom payg'ambar qilib yuborilgan Od qavmi qissasi keltiriladi. Ular o'z payg'ambarlarini yolg'onchiga chiqarib, sarkashlik qilganlaridan so'ng, Alloh taoloning azobiga duchor bo'lganliklari hikoya qilinadi.\r\n    Sura ko'zga ko'rinib turgan borliq Allohning ulug'ligiga, qudratiga dalil ekaniga ishora qilish bilan boshlanadi.\r\n    Undan so'ng mushriklar sig'inayotgan soxta xudolar fosh qilinib, ular hech narsani eshita olmasliklari, duoni ham qabul qila olmasliklari, ularga e'tiqod qilayotganlar katta xato qilayotganlari bayon etiladi.\r\n    Keyin esa Makka mushriklarining Muhammad alayhissalomning ummiy (o'qish-yozishni o'rganmagan odam) ekanliklarini yaxshi bilsalar ham, 'Qur'onni uning o'zi to'qiyapti, u yolg'onchi, xudoning nomidan gapirmoqchi', deb Qur'onga qarshi chiqqanlari, vahiy va payg'ambarlikka nisbatan zid munosabatlari bayon qilinadi.\r\n    Shu asnoda ikki xil inson toifasi haqida so'z yuritiladi.\r\n    Birinchisi – avval boshdan Allohga iymon keltirib, ibodatlarini bajargan, to'g'ri insoniy yo'lda o'sgan, iymon yo'li ham, nasab yo'li ham risoladagidek bo'lib, o'z Robbining va ota-onasining haqlarini ado etgan va shular bois, jannatga sazovor bo'lib, haqqini tanigan, hidoyatdagi mo'min inson.\r\n    Ikkinchisi esa – to'g'ri yo'ldan ozib, insoniylik tabiatini buzib, iymon yo'li o'rniga kufrni ixtiyor qilgan, Alloh taoloning va ota-onasining haqqini unutgan dinsiz insondir. Albatta, uning jazosi jahannam bo'lajak.\r\n    Shu orada qiyomatning dahshatli manzaralaridan biri – kofir va jinoyatchi qavmlarning xoru zor bo'lish manzarasi ham keltiriladi. Allohga iymon keltirmay, qiyomatga ishonmay, oxiratni unutib yurganlarning oqibati nima bo'lishi tasvirlanadi.\r\n    So'ngra Xud alayhissalomning kibrga, tug'yonga ketgan qavmlari qanday halokatga uchraganligi bayon qilinadi. Bu qavm Qur'onni inkor qilayotgan Makka ahlidan ko'ra jismonan baquvvat, ulkan gavdali, qadamidan yer titraydigan bo'lishiga va boshqa ko'pgina ustunliklariga qaramasdan, Alloh taolo ularni arzimagan sabab bilan halok qildi. Boshqalar ham kuch-quvvatiga ishonib, katta ketmasin, degan tanbeh uchun keltirilgan bu qissadan ibrat olishga da'vat qilinadi.\r\n    Kofir qavmlar insonliklariga or keltirib, Yaratganning chaqirig'iga quloq osmay, iymondan, Islomdan, xayr-barakadan yuz o'girib yurgan bir paytda, bir guruh jinlar kelib, Qur'onga quloq osib, iymonga kelganlari, undan ta'sirlanib, tezda o'z qavmlarini iymonga chaqirib, ularga mag'firat va rahmat bashoratini yetkazishga shoshilishlari ham surada o'ziga xos uslubda bayon etiladi.\r\n    Xotimada esa Alloh taolo O'z habibi Muhammad alayhissalomni sabrga chaqirib, kofirlarga tezroq azob kelishiga oshiqmaslikka buyuradi. Chunki ularni kutib turgan narsa shundoq ham juda yaqindir."
        ]
    },
    {
        "word": "Ahli ahd",
        "type": [],
        "definition": [
            "Ahli ahd – musulmonlar bilan tinchlik bitimi tuzgan g'ayrimusulmon yurt (dorul-ahd) aholisi, ittifoqdoshlar."
        ]
    },
    {
        "word": "Ahli bayt",
        "type": [],
        "definition": [
            "xonadon ahli, Payg'ambarlar oilasi. Sunniylar bu tushunchaga muhammad alayhissalomga yaqin bo'lgan odamlarni ham kiritadilar. Shialar Fotima, Ali, Hasan, Husayn va ularning avlodlari bilangina chegaralaydilar."
        ]
    },
    {
        "word": "Ahli kitob",
        "type": [],
        "definition": [
            "kitob ahli, mazmunan o'z diniy kitobiga ega bo'lgan xalqlar. Islom aqidasiga ko'ra, musulmonlardan oldin ilohiy kitobga (Tavrot, Zabur, Injil) ega bo'lgan ummatlar. Ahli kitobga xristianlik (nasroniylar) va yahudiylikka e'tiqod qiluvchilar kiritilgan."
        ]
    },
    {
        "word": "Ahli sunna va jamoa",
        "type": [],
        "definition": [
            "Aqiyda mazhabi"
        ]
    },
    {
        "word": "Ahli havo",
        "type": [],
        "definition": [
            "'Ahli havo' deganda havoyi nafslari gapiga kirib aqiyda bo'yicha Ahli sunna va jamoatga xilof qilgan firqalar tushuniladi"
        ]
    },
    {
        "word": "Ahli harb",
        "type": [],
        "definition": [
            "Ahli harb – musulmonlar bilan tinchlik bitimi tuzmagan, urush holatidagi g'ayrimusulmon yurt (dorul-harb) aholisi."
        ]
    },
    {
        "word": "Ahliy vaqf",
        "type": [],
        "definition": [
            "Unda vaqf qiluvchi, o'zi vaqf qilgan narsadan o'zining ahli, qarindoshlari foyda olishlarini shart qiladi."
        ]
    },
    {
        "word": "Ahmad az-Zandaniy",
        "type": [],
        "definition": [
            "Abu Sodiq Ahmad ibn Husayn az-Zandaniy - Buxoroning Zandana nomli qishlog'ining imom-xatibi bo'lganlar. Buxoroning ko'pgina olimlaridan ilm o'rganib, yozib olganlar. Hijriy 493 (milodiy 1101) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Avdaniy",
        "type": [],
        "definition": [
            "Abu Mansur Ahmad ibn Muhammad al-Avdaniy - Dovud al-Avdaniyning o'g'illari. Avdana qishlog'ining peshqadam olimlaridan. Abdurahmon ibn Solih al-Misriy, Yahyo ibn Muhammad al-Lu'luiy, Muso ibn Quraysh at-Tamimiy va Sufyon ibn Abdulhakimdan hadis ilmidan ta'lim olganlar. O'zlaridan esa yuqorida nomlari eslatilgan Dovud ibn Muhammad al-Avdaniy hadis rivoyat qilganlar. Hijriy 303 (milodiy 916) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Ajannasiy",
        "type": [],
        "definition": [
            "Abul Hasan Ahmad ibn Abdurahmon al-Ajannasiy bobolari Abul Husayndan va Abu Ya'lodan fiqh ilmini o'rganganlar va ulardan hadislar yozib olganlar. Keyin Nishopurga borib, Abul Abbos Muhammad ibn Ya'qub al-Asamdan ta'lim olganlar. Nishopurda yigitlik chog'larida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Ajannasiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Muhammad Ahmad ibn Muhammad al-Ajannasiy al-Buxoriy Buxoro ahlidan bo'lib, nasablari Payg'ambar alayhissalomning bobolari Ma'ad ibn Adnonga borib taqaladi. U zot Iroqqa safar qilib, Basra va Hijoz ulamolaridan ta'lim olganlar. Bu kishi – Abu Ya'lo Abdulmu'min ibn Xalaf an-Nasafiyning tog'alari. Hijriy 290 (milodiy 904) yilning sha'bon oyida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Anbarduvoniy ",
        "type": [],
        "definition": [
            "Abu Komil Ahmad ibn Muhammad al-Anbarduvoniy - Anbarduvon qishlog'idan bo'lib, 'Al-Basiriy' laqabi bilan tanilganlar. Abul Hasan al-Buzjoniyning nevarasi edilar. Abu Komil al-Basiriy Shofe'iy mazhabida bo'lib, ko'p hadis bilardilar va shu bilan shug'ullanardilar. Kitoblar tasnif qilganlar. Zehnlari o'tkir, taqvodor edilar. Buxorolik bo'lganlari uchun Buxoro ahlini yaxshi tanirdilar. Bu kishi 'al-Muzohot val-muzofot fil-asmoi val-ansob' ('Ismlar va nasablarga izoh va qo'shimchalar') kitobini jamlaganlar. Hijriy 449 (milodiy 1058) yilning boshida vabo kasalidan vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Arbinjaniy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Muhammad al-Arbinjaniy otalaridan hadis rivoyat qilganlar. U kishidan esa Abu Bakr Muhammad ibn Ahmad, Abul Abbos Idris al-Arbinjaniy hadis rivoyat qilganlar. Hijriy 369 (milodiy 980) yil rabi'ul oxir oyining oxirida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Arfudiy",
        "type": [],
        "definition": [
            "Abu Ahmad Ahmad ibn Muhammad al-Arfudiy shu qishloqdan bo'lib, fozil shayx edilar. Hijriy 310 (milodiy 923) yilda ilm talabida Samarqandning Xushufag'n qishlog'ida borib, Abu Hafs al-Bujayriydan Imom al-Buxoriyning 'at-Tarix al-avsat' ('O'rta tarix') kitoblarini ta'lim olganlar. Taxminan hijriy 380 (milodiy 991) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Afraxshiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Muhammad al-Afraxshiy al-Buxoriy Buxoro ahlidan bo'lib, olimlarning peshvosi va raislaridan edilar. Faraxsh qishlog'idan. Ismoiliy nisbati bilan tanilgan edilar. Buni yuqorida zikr qilganman. Muhammad ibn Yusuf ibn Osim, Muhammad ibn Sobir ibn Kotib al-Buxoriy, Muhammad ibn Yusuf al-Farabriy, Sa'id ibn Ibrohim ibn Ma'qal va Ahmad ibn Xoliddan ta'lim olganlar. O'zlaridan esa Abul Abbos Ja'far ibn Muhammad al-Mustag'firiy ta'lim olganlar. Hijriy 301 (milodiy 914) yilda tug'ilib, hijriy 384 (milodiy 995) yilning ramazon oyida 84 yoshda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Afshavoniy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Ibrohim al-Afshavoniy - Afshavon qishlog'idan bo'lib, ushbu nisbat bilan mashhur edilar. Ibn Dinorning Anas raziyallohu anhudan rivoyat qilgan hadis to'plamlarini Abu Bakr Muhammad ibn Yusuf al-G'ijduvoniydan ta'lim olganlar. Abu Komil al-Basiriy bu kishidan hadis ilmidan ta'lim olganlar."
        ]
    },
    {
        "word": "Ahmad al-Barqoniy al-Xorazmiy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Muhammad al-Barqoniy al-Xorazmiy faqih, adib, shoir va hadislarni mukammal biluvchi edilar. Bu kishi juda taqvodor, parhezkor, fahm-farosatli, Qur'oni karimni yoddan biladigan, fiqh ilmidan boxabar, arab tilini yaxshi biladigan va ko'p hadis biluvchi muhaddis olimdan edilar. Ko'pgina muhaddis ulamolardan ta'lim olganlar. Bag'dodda Abul Hasan ad-Doraqutniy, Jurjonda Abu Bakr al-Ismoiliy shular jumlasidan. Imom al-Buxoriyning 'Sahih ul-Buxoriy' va Imom Muslimning 'Sahih ul-Muslim' kitoblarini tasnif qilganlar. Ilmga juda chanqoq edilar. Abu Bakr al-Xatib al-Hofiz 'Tarixi Bag'dod' ('Bag'dod tarixi') kitoblarida yozadilar: 'Bir kuni Abu Bakr Ahmad al-Barqoniy bir faqih olimga: 'Meni duo qil, ey faqih! Alloh qalbimdan hadisga bo'lgan muhabbatni olib tashlasin. Chunki bu muhabbat mening ustimdan g'alaba qilayapti. Kechayu kunduz men o'sha muhabbat bilan', – dedi. Bu kishi hijriy 336 (milodiy 948) yilda tug'ilib, hijriy 425 (milodiy 1035) yili rajab oyining birinchi kunida Bag'dodda vafot etganlar. 'al-Jome'' qabristonida dafn qilinganlar."
        ]
    },
    {
        "word": "Ahmad al-Baskoyiriy",
        "type": [],
        "definition": [
            "Abu Mushahhar Ahmad ibn Ali al-Baskoyiriy Baskoyir qishlog'idan bo'lib, fozil, olim, nahvu sarf ilmlarida va adabiyotda tengi yo'q edilar. Xuroson, Iroq va Hijozdagi shayxlardan ta'lim olib, ularning tahsinlariga sazovor bo'lganlar."
        ]
    },
    {
        "word": "Ahmad al-Bastiy ad-Dehqon ",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Muhammad al-Bastiy ad-Dehqon Samarqand ahlidan bo'lib, bo'ylari past edi. Dehqonchilik bilan shug'ullanardilar. 'Ibn Abu Sa'id' nomi bilan tanilgan edilar. Muhammad ibn Ja'far al-Kabuzanjakatiy bu kishidan ta'lim olganlar. Eshitgan hadislari sahih edi."
        ]
    },
    {
        "word": "Ahmad al-Bonabiy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Sahl al-Bonabiy - Buxorodagi Bonab qishlog'ining muhaddis olimlaridan. Bu zot Imom al-Buxoriyning shayxlaridan ta'lim olgan."
        ]
    },
    {
        "word": "Ahmad al-Bonabiy at-Tarxuniy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Sahl al-Bonabiy at-Tarxuniy Buxoroning Ponab qishlog'idan. Abu Tayyib Julvon ibn Samura al-Ponabiy va Husayn ibn Yahyo al-Buxoriydan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad al-Bujayriy",
        "type": [],
        "definition": [
            "Abul Abbos Ahmad ibn Muhammad al-Bujayriy bobolarining 'al-Jome' as-sahih' ('Ishonchli to'plam') kitoblarini rivoyat qilganlar. Hasan ibn Sohib ash-Shoshiy va Ahmad ibn Muhammad as-Samarqandiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdulloh Muhammad al-G'unjor al-Hofiz va Abul Abbos al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 372 (milodiy 983) yilning rabi'ul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Bursoniy",
        "type": [],
        "definition": [
            "Ahmad ibn Xalaf al-Bursoniy Ahmad ibn Muhammad ibn Shohavayh al-Balxiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdulloh Muhammad ibn Fazl al-Adaviy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Abdulloh al-Buxoriy Buxoro faqihlaridan. Bag'dodda yashab, fiqh ilmi bilan shug'ullanar edilar. Vafotlariga qadar fatvo sohibi bo'lganlar. Bag'doddagi 'Mansur' jome'ida dars berardilar. Hijriy 449 (milodiy 1058) yilning rajab oyida vafot etib, 'Bob al-harb' qabristonida dafn qilinganlar."
        ]
    },
    {
        "word": "Ahmad al-Varqudiy al-Karminiy ",
        "type": [],
        "definition": [
            "Abu Ahmad Ahmad ibn Muhammad al-Varqudiy al-Karminiy Imom al-Buxoriyning 'Sahih ul-Buxoriy'larini Abu Abdulloh Muhammad ibn Yusuf al-Farabriydan rivoyat qilganlar. Karmanada bu kitobdan ta'lim berganlar. Bu kishidan Abu Nasr Ahmad ibn Abu Bakr al-Xatib al-Xudimankaniy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad al-Gʻadoniy",
        "type": [],
        "definition": [
            "Ahmad ibn Is'hoq al-G'adoniy Buxoroning G'adon qishlog'idan. Abu Komil al-Basiriy aytadilar: 'Biz bilan birga shayximizdan hadislar yozib olardilar'."
        ]
    },
    {
        "word": "Ahmad al-Gʻijduvoniy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Yusuf al-G'ijduvoniy - Buxoroning G'ijduvon nomli qishlog'idan bo'lib, 'as-Siyrat' (Xislat) nomi bilan tanilgan edilar. Bobolari Abu Bakr al-G'ijduvoniydan, bu kishi Haysam ibn Ahmad al-Basriydan, al-Basriy Ibn Dinordan, bu kishi sahoba Anas ibn Molik, raziyallohu anhudan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad al-Jallobiy ",
        "type": [],
        "definition": [
            "Abu Sa'id Ahmad ibn Ali al-Jallobiyning otalari jallob bo'lganlar. Bu kishi Xorazmning Hazorasp yaqinidagi Sovkon qishlog'idan. Shayx, faqih, fozil va solih kishilardan edilar. Keyinchalik Xiva shahrida yashaganlar. Men u kishini Xivada uchratdim. U zot: Men 'Kitob ul-odob al-muzofatu ilas-sunan' ('Sunnatga asoslangan odob kitobi') nomli asarni shayx al-quzzot (qozilar shayxi) Abu Ali Ismoil ibn Ahmad al-Bayhaqiydan dars oldim. U kishidan Xivada uch hadis yozib oldim', – dedilar. Hijriy 471 (milodiy 1079) yilda tavallud topganlar."
        ]
    },
    {
        "word": "Ahmad al-Jandiy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Fazl al-Jandiy - Jand qishlog'i imomlaridan. Tafsir va hadis ilmida, ma'rifat ilmida peshqadam edilar. Abu Bakr ibn Abu Is'hoq al-Kalobodiyning suhbatdoshlaridan"
        ]
    },
    {
        "word": "Ahmad al-Jojaniy",
        "type": [],
        "definition": [
            "Faqih Abu Nasr Ahmad ibn Muhammad al-Jojaniy Jojan qishlog'idan. Bu kishi Buxoroning 'Darb al-hadid' ('Temir darvoza') mahallasida yashab, Imom Abu Bakr ibn Fazl madrasasida dars berganlar. Buxoro, Hijoz va Iroq muhaddislaridan hadislar yozib olganlar. Faqih Tohir al-Huraysiy bu kishidan ta'lim olganlar."
        ]
    },
    {
        "word": "Ahmad al-Juvoliqiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ismat Ahmad ibn Muhammad al-Juvoliqiy al-Buxoriy Buxoro ahlidan bo'lib, bu nisbat bilan mashhur edilar. Hijriy 372 (milodiy 983) yilning rabi'ul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Isbiskatiy",
        "type": [],
        "definition": [
            "Abu Homid Ahmad ibn Homid al-Isbiskatiy Fath ibn Muhammad al-Javhariydan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Ibrohim at-Tuziy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad al-Ismoiliy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Muhammad al-Ismoiliy Buxoro ahlidan bo'lib, faqih olim va o'z asrining shayxi edilar. Abu Naim Abdulmalik ibn Muhammad al-Astrobodiy, Muhammad ibn Yusuflardan ta'lim olganlar. Abu Bakr al-Ismoiliy hijriy 301 (milodiy 914) yilda tavallud topib, hijriy 384 (milodiy 995) yilning ramazon oyida vafot etganlar. Qabrlari Xuroson yo'lidagi qabristonda. Men uni ziyorat qilganman. Ismoiliy imomlar Buxoroda taniqlidirlar"
        ]
    },
    {
        "word": "Ahmad al-Kalobodiy al-Hofiz",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Muhammad al-Kalobodiy al-Hofiz Buxoroning ma'lum, mashhur va buyuk muhaddis olimlaridan bo'lib, yuz mingdan ko'proq hadisni yoddan bilar edilar. Abu Muhammad Abdulloh ibn Muhammad al-Ustoz, Abu Ya'lo Abdulmu'min ibn Xalaf an-Nasafiy, Abu Sa'id Haysam ibn Kulayb ash-Shoshiy, Ali ibn Muhtoj al-Kushoniy va boshqa olimlardan ta'lim olganlar. Abu Sa'id Xalil ibn Ahmad as-Sijziydan bitta hadis rivoyat qilganlar. Al-Kalobodiy haqlarida Abu Abdulloh al-Hofiz 'Tarix' kitoblarida quyidagicha aytganlar: 'Abu Nasr al-Kalobodiy kotib, yuz mingdan ko'proq hadisni yoddan biluvchi, fahm-farosatli va ma'rifatli olimlardan edilar. Imom al-Buxoriyning 'al-Jome' as-sahih' kitoblarini bilardilar. Abul Hasan ad-Doraqutniy ham u kishining fahmlariga, ma'rifatlariga tan bergan edilar. Abu Nasr al-Kalobodiy hijriy 360 (milodiy 972) yilda tavallud topib, hijriy 398 (milodiy 1008) yil jumodul oxir oyining yigirma uchinchisida shanba kuni vafot etganlar'.\r\n    * - Abul Qosim Ali ibn Abu Nasr al-Kalobodiy – bu kishining o'g'illari."
        ]
    },
    {
        "word": "Ahmad al-Karminiy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Zav al-Karminiy Karmana ahlidan bo'lib, Ismoil ibn Maslama va uning ukalari Abdulloh ibn Maslama, Hakam ibn Muborak va Makkiy ibn Ibrohimdan hadis rivoyat qilganlar. Ahmad ibn Zav hijriy 265 (milodiy 879) yil rajab oyining o'n beshinchisida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Qassoriy al-Xorazmiy",
        "type": [],
        "definition": [
            "Abu Tohir Ahmad ibn Muhammad al-Qassoriy al-Xorazmiy xorazmlik bo'lib, Bag'dodda yashaganlar. G'aznada xalifa tomonidan tayinlangan elchi bo'lganlar. Abul Qosim Ismoil ibn Hasan as-Sarsariydan 'as-Sarsariyot' nomli mashhur hadis kitobidan ta'lim olganlar. O'zlaridan esa Abul Qosim as-Samarqandiy, Abdulvahob al-Hofiz al-Bag'dodiy, Muflih ibn Ahmad al-Varroq al-Bag'dodiy va Abdulxoliq ibn Badan al-Bag'dodiy hadis rivoyat qilganlar. Hijriy 395 (milodiy 1006) yilda tavallud topganlar. Hijriy 474 (milodiy 1082) yil zulhijja oyining o'n ikkinchisida, shanba kuni vafot etib, 'Ma'ruf Karxiy' qabristonida dafn qilinganlar. Bu qabriston 'Bob ad-dayr' deb ham nomlanadi."
        ]
    },
    {
        "word": "Ahmad al-Mahmudiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Muhammad Ahmad ibn Muhammad al-Mahmudiy al-Buxoriy Buxoro ahlidan. Abu Mansur Muhammad ibn Hasan al-Muqri as-Sug'diydan hadis rivoyat qilganlar. Hijriy 374 (milodiy 985) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Maʼruf al-Maʼrufiy",
        "type": [],
        "definition": [
            "Abu Muhammad Ahmad ibn Muhammad al-Ma'ruf al-Ma'rufiy Buxoro ahlidan bo'lib, vaqf egasi edilar. Abu Sa'id Haysam ibn Kulayb ash-Shoshiy va Abu Ali Husayn ibn Ismoil al-Forisiydan hadis rivoyat qilganlar. Hijriy 384 (milodiy 995) yilning rajab oyida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Mostiniy",
        "type": [],
        "definition": [
            "Abu Homid Ahmad ibn Muhammad al-Mostiniy Buxoro olimlaridan. Abu Zarr Muhammad ibn Yusuf al-Qozi va Abu Bakr al-Osimiydan hadis rivoyat qilganlar. Hijriy 364 (milodiy 975) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Moxiy",
        "type": [],
        "definition": [
            "Qori Abu Amr Ahmad ibn Muhammad al-Moxiy Xalaf ibn Muhammad al-Xayyomdan hadis rivoyat qilganlar. Abu Komil al-Basiriy aytadilar: 'Men Qur'oni karimni o'qishni 'Darb al-hadid' (Temir darvoza) masjidida Abu Amr Ahmad al-Moxiydan o'rgandim'."
        ]
    },
    {
        "word": "Ahmad al-Muazzin al-Buxoriy al-Hozimiy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Muhammad al-Muazzin al-Buxoriy al-Hozimiy buxorolik olimlardan bo'lib, bu nisbat bilan mashhurdirlar. Bu kishi Bag'dodga borib, u yerda hadisi sharifdan dars olganlar. O'zlaridan esa Abu Abdulloh al-G'unjor al-Hofiz hadis rivoyat qilganlar. Al-Hozimiy Buxoroning mashoyixlaridan. Vazir Abu Ali al-Bal'amiyning maslahatchilaridan edilar. Hijriy 289 (milodiy 903) yilda tug'ilganlar. Hijriy 372 (milodiy 983) yilda haj safari niyatida Nishopurga kelganlar va odamlar u zotdan 'Ilmi usul'ni yozib olganlar. Hijriy 373 (milodiy 984) yili Nishopur yo'lida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Muzaniy",
        "type": [],
        "definition": [
            "Abu Muhammad Ahmad ibn Abdulloh al-Muzaniy asli hirotlik bo'lib, Buxoroda yashab, shu yerda vafot etganlar. Abdurahmon ibn Mug'affal al-Muzaniyning avlodlaridan bo'lib, Buxoroda 'Shayx al-jalil' (Ulug' shayx) der edilar. Bu kishi Xurosonda o'z asrining iftixori, ilmda tengsiz olimi, nur yuzli va sultonlarning avliyosi edilar. Hirot, Nishopur, Marv, Jurjon, Bag'dod, Kufa, Basra, Makka, Misr va Shomda bo'lib, u yerlardagi muhaddislardan hadislar rivoyat qilganlar. Uch yil Misrda yashab, keyin haj qilganlar. Makkai Mukarramada imom-xatib edilar. Abu Bakr Muhammad ibn Ali al-Qaffol ash-Shoshiyning suhbatdoshlari bo'lib, ilmda u kishi bilan munozara qilardilar. Vatanlariga muhabbat, vatan sog'inchi bu kishini kasal qildi. Vatanlarini sog'inib ko'p yig'lar edilar. Hijriy 356 (milodiy 968) yilning ramazon oyida Buxoroda vafot etganlar. Vazir Abu Ya'lo al-Bal'amiy tomonidan tobutlari Hirotga olib borilib, shu yerda dafn qilinganlar."
        ]
    },
    {
        "word": "Ahmad al-Muqri al-Hazzo al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Amr Ahmad ibn Muhammad al-Muqri al-Hazzo al-Buxoriy Buxoro ahlidan. Muhammad ibn Yusuf al-Farabriy, Abu Bakr Ahmad ibn Abdulvohid va Abu Sa'id Bakr ibn Munirdan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdulloh G'unjor al-Hofiz hadis rivoyat qilganlar. Hijriy 360 (milodiy 972) yilning jumodul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Murzibiniy",
        "type": [],
        "definition": [
            "Abu Hafs Ahmad ibn Fazl al-Murzibiniy Buxoroning Murzibin nomli qishlog'idan bo'lib, laqablari 'Habbob' (Ko'za sotuvchi) edi. Ilm talabida Hijozga borganlar. Fuzayl ibn Iyoz, Sufyon ibn Uyayna va Iso ibn Muso G'unjordan hadis rivoyat qilganlar. O'zlaridan esa Abu Sufyon Mahbub ibn Ya'qub al-Buxoriy hadis rivoyat qilganlar. Hijriy 243 (milodiy 858) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Paykandiy",
        "type": [],
        "definition": [
            "Abu Ahmad ibn Yusuf al-Paykandiy hadis ilmining ishonchli muhaddislaridan bo'lib, bular Imom al-Buxoriyga, ya'ni Muhammad ibn Ismoil al-Buxoriyga ta'lim bergan muhaddis ustozlardan."
        ]
    },
    {
        "word": "Ahmad al-Paykandiy an-Najohiy",
        "type": [],
        "definition": [
            "Abu Muhammad Ahmad ibn Muhammad al-Paykandiy an-Najohiy. Imom al-Buxoriyning do'stlari va shogirdlaridan. Bu kishidan Ali ibn Hajar as-Sa'diy, Ali ibn Xushrum al-Marvaziy va Is'hoq ibn Mansur al-Kavsaj al-Marvaziy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad al-Paykandiy at-Torobiy",
        "type": [],
        "definition": [
            "Abu Rajo Ahmad ibn Ya'qub al-Paykandiy at-Torobiy Paykand ahlidan bo'lib, Torob qishlog'ida yashaganlar. Lays ibn Sa'd va Abdulloh ibn Luhay'adan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad al-Farabriy",
        "type": [],
        "definition": [
            "Abu Muhammad Ahmad ibn Abdulloh al-Farabriy Imom al-Buxoriyning 'al-Jome' as-sahih' kitoblarini bobolaridan rivoyat qilganlar. O'zlaridan esa G'unjor al-Hofiz al-Buxoriy hadis rivoyat qilganlar. Hijriy 371 (milodiy 982) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Fasaviy al-Forisiy",
        "type": [],
        "definition": [
            "Abul Husayn Ahmad ibn Muhammad al-Fasaviy al-Forisiy Eronning Faso (yoki Baso) shahridan bo'lib, Buxoroda yashaganlar. Abu Bakr Muhammad ibn Ali ibn Ismoil al-Qaffol ash-Shoshiy, Abu Bakr Muhammad ibn Abdulloh ar-Roziy va Abu Bakr Ahmad ibn Sa'd az-Zohiddan ta'lim olganlar. Hijriy 340 (milodiy 952) yilning zulhijja oyida tavallud topib, hijriy 420 (milodiy 1030) yilning rabi'ul avval oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Xiviy as-Sufiy",
        "type": [],
        "definition": [
            "Abul Jannob Ahmad ibn Umar al-Xiviy as-Sufiy Xorazmda yashardilar. Xivada so'fi va shayx edilar. Ishonchli muhaddis va ahli sunna bu zot haj ham qilganlar. Makkai mukarramada Muborak ibn Tabboxdan, Iskandariyada Abu Tohir as-Salafiy al-Hofizdan, Hamadonda Abul Fazl Muhammad ibn Bunaymon al-Hamadoniydan hamda Isfahon va Nishopur ulamolaridan ta'lim olganlar. O'zlaridan esa Ahmad al-Andalusiy va Abdulaziz ibn Hilola al-Andalusiy ta'lim olishgan."
        ]
    },
    {
        "word": "Ahmad al-Xorazmiy al-Habobiy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Ibrohim al-Xorazmiy al-Habobiy Xorazm ahlidan bo'lib, Abu Abdulloh ibn Ubay al-Qozidan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Ahmad ibn Muhammad al-Barqoniy al-Hofiz hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad al-Xumxisariy ",
        "type": [],
        "definition": [
            "Abu Sahl Ahmad ibn Muhammad al-Xumxisariy - Buxoroning Xumxisar nomli qishlog'idan bo'lib, fiqhshunos edilar. Bu kishi Buxoroning 'Rev darvoza' mahallasida yashaganlar. Abu Komil al-Basiriy al-Hofiz bu kishidan ta'lim olganlar va ustozlari haqida 'al-Muzohot' kitoblarida qayd etganlar."
        ]
    },
    {
        "word": "Ahmad al-Xunbuniy ",
        "type": [],
        "definition": [
            "Abu Rajo Ahmad ibn Dovud al-Xunbuniy - Buxoroning Xunbun nomli qishlog'idan. Xoja G'unjor aytadilar: 'U kishi Yuqori Xunbundan'. Abu Bakr Muhammad ibn Ibrohim al-Kalobodiy bu kishidan ta'lim olganlar."
        ]
    },
    {
        "word": "Ahmad al-Hofiz al-Momoiy",
        "type": [],
        "definition": [
            "Abu Homid Ahmad ibn Muhammad al-Hofiz al-Momoiy asli isfahonlik bo'lib, Buxoroda yashab, shu yerda vafot etganlar. Bu kishi yuz mingdan ortiq hadisni yoddan bilar edilar va hadis ilmiga nihoyatda ko'p qiziqardilar. Hadislarni jamlab, tasnif qilganlar. 'Al-Muxtalif val-mu'talif fil-asmo' ('Ismlarda ixtilofli va ixtilofsiz masalalar haqida') kitobini ta'lif qilganlar hamda Xoja G'unjorning 'Tarixi Buxoro' kitoblariga qo'shimchalar kiritganlar. Bu zot ko'p muhaddis olimdan ta'lim olib, hadislar ham rivoyat qilganlar. Bu kishi hijriy 436 (milodiy 1045) yili sha'bon oyining beshinchi kuni Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad al-Yuxashuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Qozi Abu Nasr Ahmad ibn Muhammad al-Yuxashuniy al-Buxoriy Kufada qozi edilar. Faqih, fozil, olim bu zot Makka, Bag'dod olimlaridan ta'lim olganlar. Abdulaziz ibn Muhammad an-Naxshabiy shu kishining shogirdlaridan. Hijriy 438 (milodiy 1047) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad an-Navxasiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ahmad Ahmad ibn Abdulvohid an-Navxasiy al-Buxoriy Buxoro ahlidan bo'lib, bu nisbat bilan mashhur edilar. Kuniyalari 'Abu Bakr' edi. 'Abu Ahmad' deb ham chaqirilardilar. Abu Lays Ubaydulloh ibn Shurayh al-Buxoriy va Abu Abdulloh ibn Hafs al-Kabirdan hadis rivoyat qilganlar. Hijriy 311 (milodiy 924) yilning Hayit kuni vafot etganlar."
        ]
    },
    {
        "word": "Ahmad an-Narshaxiy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Muhammad an-Narshaxiy Bu kishi fozil, olim edilar. Abu Komil al-Basiriyning otalari bu kishidan ta'lim olganlar."
        ]
    },
    {
        "word": "Ahmad an-Nasafiy az-Zirriy",
        "type": [],
        "definition": [
            "Abul Favoris Ahmad ibn Muhammad an-Nasafiy az-Zirriy – Zirr ibn Abdullohning avlodlari. Ibrohim ibn Ma'qal an-Nasafiy, Muhammad ibn Ibrohim al-Busanjiydan ta'lim olganlar. Hijriy 366 (milodiy 977) yili Nasafda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad an-Nuriy ",
        "type": [],
        "definition": [
            "Abu Muqotil Ahmad ibn Muhammad an-Nuriy Buxoro shayxlaridan bo'lib, Abu Homid Ahmad ibn Ichoq al-Hiraviydan ta'lim olganlar. Buxoroda imlo majlisining rahbari edilar. Bu kishidan Abul Abbos al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 417 (milodiy 1027) yilning rajab oyida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad ar-Rigʻdamuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Abdurahmon ar-Rig'damuniy al-Buxoriy - Buxoroning Rig'damun nomli qishlog'idan bo'lib, 'al-Qozi al-jamol' (Chiroyli qozi) nomi bilan tanilgandilar. Imom, fozil, oqil va saxiy kishilardan edilar. Bo'sh vaqtlarida Buxoroga kelib, ulamolardan ta'lim olardilar. Otalari Abdurahmon ibn Is'hoq ar-Rig'damuniydan va Ahmad ibn Abdulloh al-Xayroxariydan ta'lim olganlar. Hijriy 414 (milodiy 1024) yilning shavvol oyida tavallud topib, hijriy 493 (milodiy 1101) yilning ramazon oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad ar-Rudboriy",
        "type": [],
        "definition": [
            "Abu Homid Ahmad ibn Hamza ar-Rudboriy Samarqandda yashaganlar. Otalari Hamza ibn Muhammad at-Tuzijiydan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abu Hafs Umar ibn Ahmad an-Nasafiy va Abu Bakr Muhammad ibn Muhammad az-Zuhriy hadis rivoyat qilganlar. Hijriy 526 (milodiy 1133) yil ramazon oyining o'n ikkinchisida, Amudaryo bo'yida joylashgan Termiz yaqinidagi Botkarqal'ada vafot etganlar."
        ]
    },
    {
        "word": "Ahmad as-Sarrom al-Vobkaniy",
        "type": [],
        "definition": [
            "Abu Homid Ahmad ibn Mahmud as-Sarrom al-Vobkaniy Abu Abdulloh ibn Abu Hafs al-Kabirdan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad as-Sikichkatiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Hafs Ahmad ibn Hotam as-Sikichkatiy al-Buxoriy - Buxoroning Sikichkat qishlog'idan bo'lib, Muhammad ibn Hotam al-Marvaziy, Abu Abdulloh ibn Abu Hafs, Muhammad ibn Aslam as-Samarqandiy va Muhammad ibn Ubbod as-Samarqandiy, Yahyo ibn Suhayl, Asbot ibn Yasa'dan hadis rivoyat qilganlar. Yoddan ko'p hadis bilganlar va hadislarni mohirlik bilan yozib olganlar. O'zlaridan Abu Nasr Ahmad ibn Ahmad ibn Abdurahmon al-Bohiliy va Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar. Hijriy 315 (milodiy 928) yilning sha'bon oyida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad as-Sovkoniy",
        "type": [],
        "definition": [
            "Abu Sa'id Ahmad ibn Ali as-Sovkoniy fozil, imom, chiroyli siyratli, kamtarin edilar. Xivada yashaganlar. Abu Ali Ismoil ibn Ahmad al-Bayhaqiydan ilm o'rganganlar. Xivada u kishidan ba'zi masalalardan ta'lim olganman. U kishi hijriy 471 (milodiy 1079) yil rabi'ul avval oyining o'ninchisida Sovkon qishlog'ida tavallud topganlar."
        ]
    },
    {
        "word": "Ahmad as-Somoniy",
        "type": [],
        "definition": [
            "Ismoil as-Somoniyning otalari amir Ahmad ibn Asad as-Somoniy Sufyon ibn Uyayna, Ismoil ibn Ulayya, Yazid ibn Horun va Mansur ibn Ammordan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari amir Ismoil Somoniy hadis rivoyat qilganlar. Hijriy 250 (milodiy 865) yilning shavvol oyida Farg'onada vafot etganlar."
        ]
    },
    {
        "word": "Ahmad as-Sulaymoniy al-Paykandiy",
        "type": [],
        "definition": [
            "Abul Fazl Ahmad ibn Ali as-Sulaymoniy al-Paykandiy ko'p hadisni yoddan biluvchi edilar. Ilm talabida Iroq, Shom va Misrda bo'lib, to'rt yuzdan ortiq kichik hajmli kitob yozganlar. Har hafta bir kitob bitib, juma kuni Buxorodagi Masjidi Kalon jome' masjidiga olib kelib, u yerda hozir bo'lgan kishilarga o'qib berganlar. Hijriy 412 (milodiy 1022) yilda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad as-Sunniy ad-Dinuriy",
        "type": [],
        "definition": [
            "Ali ibn Ahmad ibn Muhammad as-Sunniy ad-Dinuriy qozi Abdurahmon ibn Hasan al-Hamadoniy, Abduljavod ibn Muhammad ad-Diynuriy va Homid ibn Abdulloh al-Hamadoniydan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Ahmad ibn Ali al-Yazdiy hadis rivoyat qilganlar. Hijriy 394 (milodiy 1005) yili juma kuni Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad as-Surmoriy az-Zohid",
        "type": [],
        "definition": [
            "Mashhur imom Abu Is'hoq Ahmad ibn Is'hoq as-Surmoriy az-Zohid Buxoroning Surmoro qishlog'idan bo'lib, shijoatlilikda o'z zamonalarining tengi yo'q olimi edilar. Bu kishi haqlarida yozilgan qissalar nihoyatda keng tarqalgan. Usmon ibn Umar, Abdulloh ibn Muso, Amr ibn Osim, Ya'lo ibn Ubayd va Abu Naim Fazl ibn Dikkindan ta'lim olganlar. O'zlaridan esa Imom al-Buxoriy, Muhammad ibn Ismoil al-Maydoniy, Ubaydulloh ibn Vosil va o'g'illari Abu Safvon Is'hoq ibn Ahmad as-Surmoriy hadis rivoyat qilganlar. Abu Is'hoq Ahmad as-Surmoriyning shijoatlari to'g'risida 'Tarixi Buxoro' kitobida uch varaq naql bor. Hijriy 242 (milodiy 857) yilning rabi'ul oxir oyida vafot etganlar."
        ]
    },
    {
        "word": "Ahmad at-Tavovisiy",
        "type": [],
        "definition": [
            "Abu Bakr Ahmad ibn Muhammad at-Tavovisiy faqih, fozil, parhezkor, taqvodor, zohid, ishonchli muhaddis va solih bandalardan edilar. Bu kishi haqlarida Abu Sa'd al-Idrisiy 'Kitob al-ikmol' ('Mukammal kitob') kitoblarida zikr qilganlar. Muhammad ibn Nasr al-Marvaziy, Abdulloh ibn Shiravayh an-Nishopuriy va Muhammad ibn Fazl al-Balxiydan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Nasr al-Qoyid ash-Shoshiy va Abu Sa'd al-Idrisiyning tog'alari Ahmad ibn Abdulloh ibn Idris hadis rivoyat qilganlar. Hijriy 344 (milodiy 956) yili Samarqandda hammomda vafot etganlar."
        ]
    },
    {
        "word": "Ahmad at-Termiziy al-Andarobiy",
        "type": [],
        "definition": [
            "Abu Zar Ahmad ibn Abdulloh at-Termiziy al-Andarobiy Termiz ahlidan. Balxning Andarob shahrida qozi bo'lganlar. Shuning uchun bu kishiga 'al-Andarobiy' deb nisbat berilgan. Ilm talabida Iroqda bo'lib, u yerda Muhammad ibn Bashshor, Muhammad ibn Musanno, Amr ibn Ali as-Sayrafiy, Nasr ibn Ali al-Jahzamiy va Ziyod ibn Yahyo al-Hisoniydan ta'lim olganlar. Buxoro va Nasaf muhaddislaridan hadis ilmini o'rganganlar. O'zlaridan esa Abu Ali Ahmad ibn Ibrohim as-Sayravoniy, Abul Husayn Muhammad ibn Tolib, Abu Bakr Muhammad ibn Zakariyo as-Sufyoniy va Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad ash-Shayshaqiy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Uhayd ash-Shayshaqiy Bu kishi Abu Abdulloh Muhammad ibn Ali al-Hakim at-Termiziyning 'an-Navodir' ('Nodir rivoyatlar') kitobini rivoyat qilganlar."
        ]
    },
    {
        "word": "Ahmad Bakr al-Xudimankaniy",
        "type": [],
        "definition": [
            "Abu Nasr Ahmad ibn Abu Bakr al-Xudimankaniy - Buxorodagi Xudimankan nomli qishloqning nisbati bilan mashhur bo'lib, shu qishloqda imom-xatib edilar. Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz 'Mu'jam ush-shuyux' ('Shayxlar qomusi') kitoblarida aytganlar: 'Abu Ahmad Ahmad ibn Muhammad al-Varqudiy Imom al-Buxoriyning 'Sahih ul-Buxoriy' to'plamlarini shu kitobning oxirgi roviysi al-Farabriydan ta'lim olganlar. Al-Xudimankaniy mazkur asarni al-Varqudiydan ta'lim olganlar'."
        ]
    },
    {
        "word": "Ahmad Vosil al-Buxoriy az-Zayniy",
        "type": [],
        "definition": [
            "Ahmad Vosil ibn Abdushukur al-Buxoriy az-Zayniy - Buxoro ahlidan bo'lib, Ubaydulloh ibn Vosilning otalaridirlar. Sufyon ibn Uyayna, Yahyo ibn Salim, Abdulloh ibn Vahb, Umar ibn Horun al-Balxiy va Samarqand qozisi Is'hoq ibn Ibrohimdan hadis rivoyat qilganlar. O'zlari va otalari Muhammad ibn Salom al-Paykandiydan ta'lim olganlar. Imom al-Buxoriy zamonlarida yashaganlar. Nihoyatda shijoatli va qo'rqmas edilar. Turklar bilan urushda Xukanja degan joyda shahid bo'lganlar. Xukanja Paykand va Farabr oralig'ida joylashgan. Ahmad Vosil az-Zayniy hijriy 201 (milodiy 817) yilda tavallud topib, hijriy 272 (milodiy 886) yilning shavvol oyida Xukanja urushida shahid bo'lganlar."
        ]
    },
    {
        "word": "Ahmad ibn Abdulvahhob Quvsiy",
        "type": [],
        "definition": [
            "Bu zot asli misrlik bo'lgan, ammo ko'p o'lkalarga, jumladan, Movarounnahr diyorlariga ham safar qilgan. Allomai Taftazoniy rahmatullohi alayhi u kishiga mazkur safarlari davomida shogird bo'lgan."
        ]
    },
    {
        "word": "Ahmas",
        "type": [],
        "definition": [
            "'Ahmas' (ko'pligi 'hums') – lug'atda 'diniy udumlarga qattiq berilgan' degan ma'noni bildiradi. Quraysh qabilasi arablar ichida diniy rahnamo o'laroq, turli diniy urf-odatlarni chiqarib, ularga mahkam turganlari uchun shu laqabni olgan. Keyinroq bu laqab diniy amallarga qattiq berilgan boshqalarga ham ishlatiladigan bo'lgan."
        ]
    },
    {
        "word": "Ahror",
        "type": [],
        "definition": [
            "hur so'zining ko'pligi. “Ozod” ma'nosini anglatadi."
        ]
    },
    {
        "word": "Ahsan taloq",
        "type": [],
        "definition": [
            "Ayol hayzdan pok bo'lgandan keyin, u bilan yaqinlik qilmay turib bir taloq qo'yib, iddasi chiqquncha kutish ahsan taloq bo'ladi."
        ]
    },
    {
        "word": "Ashara",
        "type": [],
        "definition": [
            "Arabcha o'n"
        ]
    },
    {
        "word": "Asharut tavorix",
        "type": [],
        "definition": [
            "Shayx Azududdin Iyjiy rahmatullohi alayhining kitobi. Bu xaloyiqning yaratilishidan boshlangan muxtasar tarix kitobidir."
        ]
    },
    {
        "word": "Ashuro",
        "type": [],
        "definition": [
            "zulhijja oyining o'n kunligi. Haj mavsumi kunlari."
        ]
    },
    {
        "word": "Ashhadu allaa ilaaha Illalloh",
        "type": [],
        "definition": [
            "Allohdan o'zga hech ilohu ma'bud yo'q, deb guvohlik beraman."
        ]
    },
    {
        "word": "Ashhadu anna Muhammadan Rasululloh",
        "type": [],
        "definition": [
            "Muhammad, Allohning Rasuli ekanligiga guvohlik beraman."
        ]
    },
    {
        "word": "Ashhurul hurum",
        "type": [],
        "definition": [
            "urush qilish harom qilingan oylar: muharram, rajab, zulqa'da va zulhijja."
        ]
    },
    {
        "word": "Ash-Shams al Karimiy Hanafiy",
        "type": [],
        "definition": [
            "(h. 773-861). Ash-Shams al Karimiy Hanafiy Xorazmda tug'ilgan, Buxoroda o'sgan va Samarqandda yashagan. Buxoroda Qur'oni Karimni yodlagan, nahv ilmini Mavlono Abdurrohmandan o'rgangan. Allomai Taftazoniy rahmatullohi alayhining darslarida hozir bo'lgan. Keyin Samarqandga ko'chib borgan va Nur Xorazmiydan Ma'oniy va Bayon ilmlarini o'rgangan. So'ngra Sayyid Sharif Jurjoniyni lozim tutgan.\r\n    Ash-Shams al Karimiy Hanafiy Qohiraga kelib, Allomai Taftazoniy rahmatullohi alayhining kitoblaridan dars bergan."
        ]
    },
    {
        "word": "Ash-Sharh al-Mutovval",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining kitobi. Bu kitob shayx Jaloluddin Muhammad ibn Abdurrohman Qazviniyning 'Al-Miftoh fil ma'oniy val bayan' nomli kitobiga sharhdir. Allomai Taftazoniy rahmatullohi alayhi uni 748 hijriy yili safar oyida yozib bitirgan.\r\n    Allomai Taftazoniy rahmatullohi alayhi keyinroq xuddi shu kitobni ikkinchi marta muxtasar qilib sharhlagan. Uni G'ijduvonda hijriy 752 yili yozib tugatgan. Ikki sharh ham mashhur bo'lgan va juda ko'p martalab chop etilgan."
        ]
    },
    {
        "word": "Ash-Shurut val-Mahozir ",
        "type": [],
        "definition": [
            "Sodrush shariy'a Ubaydulloh ibn Mas'ud al-Buxoriyning kitobi"
        ]
    },
    {
        "word": "Ashʼariya",
        "type": [],
        "definition": [
            "moturidiya kabi aqidaviy yo'nalish. Uning asoschisi – Abul Hasan Ali ibn Ismoil (873–935)."
        ]
    },
    {
        "word": "Aʼyon",
        "type": [],
        "definition": [
            "yuqori mansabli, baland martabali kishilar; amaldorlar."
        ]
    },
    {
        "word": "Aʼlaa surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 19 oyatdan iborat.\r\n    Ushbu surai karimaning nomi uning birinchi oyatidagi 'A'laa' so'zidan olingan. 'A'laa' so'zi arab tilida 'oliy qadar', 'eng yuqori' degan ma'noda bo'lib, bu Alloh subhanahu va taoloning sifati oliyalaridan biridir.\r\n    A'laa surasi makkiy suralardan bo'lib, Alloh taoloning zoti oliysi va ba'zi sifatlarini, Uning qudrati va vahdoniyatiga dalillarni, vahiyni, Qur'onning yaxshilarga manfaat beradigan mav'iza ekanini va shunga o'xshash masalalarni muolaja qiladi.\r\n    Bu surai karima eng avval nozil bo'lgan suralardan biridir. Vahiy dastlab nozil bo'layotgan paytlarda Nabiy alayhissalom Qur'oni Karim oyatlarini unutib qo'yishdan xavfda edilar. Shuning uchun Alloh taolo O'z mahbubiga oyatlarni unuttirmaslikni O'z zimmasiga olganini bildiradi va bunday xavfni unutishga da'vat qiladi.\r\n    A'laa surasida Alloh taoloning yagonaligi haqida so'z yuritiladi. Nabiy alayhissalomga haqiqat yo'li ko'rsatiladi. Alloh taoloning ko'rsatmasiga amal qilmaganlarning oqibati nima bo'ladi-yu, amal qilganlarning ahvoli nechuk bo'ladi, bayon qilinadi.\r\n    A'laa surasi Alloh subhanahu va taoloni poklash, U Zotning Xoliqligiga, qudratiga va vahdoniyatiga dalolat qiluvchi ba'zi ishlarini zikr qilish bilan boshlanadi.\r\n    So'ngra vahiy va Qur'on haqida so'z yuritilib, Muhammad sollallohu alayhi vasallamga bu ulug' Kitobni unuttirmaslik va yodlashni oson qilishga va'da beriladi.\r\n    Undan keyin ushbu Qur'on ila odamlarga eslatma qilish qoidalari, ushbu eslatmani qabul qilgan mo'minlar bundan ulkan foyda olishlari ta'kidlanadi.\r\n    Nihoyat, surai karimaning xotimasida kim o'z nafsini gunoh va yomonliklardan poklasa, yutuqqa erishishi haqida so'z yuritiladi."
        ]
    },
    {
        "word": "Aʼlam",
        "type": [],
        "definition": [
            "bilag'on, eng olim, diniy amaldor."
        ]
    },
    {
        "word": "Aʼmo",
        "type": [],
        "definition": [
            "Ko'zi ko'rmaydigan kishi."
        ]
    },
    {
        "word": "Aʼmol",
        "type": [],
        "definition": [
            "amallar, ishlar, ibodatlar, vazifalar, insonning qilgan yoki qiladigan ishlari."
        ]
    },
    {
        "word": "Aʼrobiy",
        "type": [],
        "definition": [
            "Payg'ambarimiz (s.a.v.) zamonlaridagi sahroda o'sgan, ta'lim-tarbiya ko'rmagan odam."
        ]
    }
]