[
    {
        "word": "Badan va mol aralashgan ibodat",
        "type": [],
        "definition": [
            "Haj shunday ibodatdir. chunki, Bu ibodatda inson mashaqqat ila safar qiladi va ibodatlarni jon koyitib, harakat qilib bajaradi. Ayni chog'da pul-mol ham sarflaydi."
        ]
    },
    {
        "word": "Badana",
        "type": [],
        "definition": [
            "Badana – qurbonlikka atalgan tuya (hanafiy mazhabida badana deganda qurbonlikka atalgan qoramol ham tushuniladi). Bu so'zning lug'aviy ma'nosi 'semiz', 'jussador'dir. Arablar semirgan, yetilgan tuya va mollarni so'yib hadiy qilganlari uchun bu qurbonliklarini 'badana' deb nomlashgan. Ammo qurbonlikka atalgan qo'y-echkilar badana deyilmaydi."
        ]
    },
    {
        "word": "Badixun",
        "type": [],
        "definition": [
            "Buxorodan to'rt farsax uzoqlikdagi qishloq. Mug'kon qishlog'i yaqinida joylashgan. Qadimda bu qishloq muhaddislar bilan tanilgan. Hozir hanafiy mazhabi olimlari bilan mashhurdir. Men Surmoro qishlog'idan – Ahmad ibn Is'hoq as-Surmoriy ziyoratlaridan qaytayotganimda bu qishloqda bo'lganman."
        ]
    },
    {
        "word": "Bayon ilmi",
        "type": [],
        "definition": [
            "bir ma'noni turli tarkiblarga chuqur va kengroq ma'no olish uchun turli lafzlar bilan keltirishni o'rganadigan ilm."
        ]
    },
    {
        "word": "Baydara",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Baydo",
        "type": [],
        "definition": [
            "Madina bilan Xaybar oralig'idagi joyning nomi"
        ]
    },
    {
        "word": "Bayyina surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 8 oyatdan iborat.\r\n    Ushbu surai karimaning nomi ham o'zining birinchi oyati oxirida kelgan 'bayyina' so'zidan olingandir.\r\n    'Bayyina' so'zi lug'atda 'bayon qiluvchi', 'ochiq-oydin hujjat' va 'dalil' degan ma'nolarni bildiradi. Haqni sobit qilish uchun keltiriladigan ashyoviy dalil bayyinadir. Ushbu suradagi 'bayyina' Muhammad sollallohu alayhi vasallamning payg'ambarliklaridir.\r\n    Nabiy sollallohu alayhi vasallamga Qur'on nozil bo'lishidan avval olamni fisq-fasod qoplagan, hamma diyonatlar botil, bid'at, xurofotga to'lgan edi. Ahli kitob ham, mushriklar ham barobariga aqiydasi buzuq kishilarga aylangan edilar.\r\n    Yahudiylar mushrik arablarga 'Bizning muqaddas kitobimizda aytilishicha, yaqinda Alloh arablardan bir Payg'ambar yuboradi, u haq bilan hukm qiladi, adolat o'rnatadi, biz unga ergashib, sizlarning ustingizdan g'alaba qilamiz', – deyishardi. Mushriklar bo'lsa, 'Unday bo'lsa, Sizdan ko'ra biz unga yaqinroq bo'lamiz', – deb yangi Payg'ambar kelishini orziqib kutardilar.\r\n    Alloh taolo Muhammad sollallohu alayhi vasallamni payg'ambar qilib yuborganida esa barchalari u zotga qarshi chiqdilar. Kufr qalblarini ko'r qildi va iymon yo'lini to'sdi.\r\n    Ushbu surai karima mazkur haqiqatni bayon qilib keldi.\r\n    Bayyina surasi makkiy suralardan bo'lib, u 'Lamyakun surasi ham deyiladi. Bu surai karima:\r\n    – Ahli kitoblarning Muhammad sollallohu alayhi vasallamning payg'ambarliklariga nisbatan munosabatlarini;\r\n    – Alloh taologa ixlos ila ibodat qilish masalasini;\r\n    – Oxiratda kofiru mushriklar va mo'minlarning oqibati qanday bo'lishi masalasini bayon qiladi.\r\n    Surai karima ahli kitoblar – yahudiy va nasorolarning Rasululloh sollallohu alayhi vasallamning da'vatlariga bo'lgan munosabatlarini bayon qilish ila boshlanadi.\r\n    So'ngra iymonning muhim unsurlaridan biri bo'lgan amal – Alloh taologa ixlos ila ibodat qilish masalasi muolaja qilinadi.\r\n    Suraning oxirida esa ahli kitob va mushriklar odamlarning yomonlari ekani hamda ularning jahannamga kirishlari bayon etiladi.\r\n    Shuningdek, mo'min-musulmonlarning odamlarning yaxshisi ekanliklari va ular jannatdan joy olishlari muqarrar ekani ta'kidlanadi."
        ]
    },
    {
        "word": "Baykand",
        "type": [],
        "definition": [
            "(Paykand) Movarounnahr shaharlaridan bo'lib, Amudaryo va Buxoro oralig'ida joylashgan. Buxorodan bir manzil uzoqlikdagi chiroyli va katta shahar. Bu yerdan ko'p olim yetishib chiqqan."
        ]
    },
    {
        "word": "Bayruhoo",
        "type": [],
        "definition": [
            "'Bayruhoo' Abu Tolha roziyallohu anhuning bog'larining nomidir."
        ]
    },
    {
        "word": "Baytning hatimi",
        "type": [],
        "definition": [
            "Baytning hatimi – Ka'baning tarnov tomonida odamning belicha ko'tarilgan yarim aylana shaklidagi joy. Aslida Ibrohim alayhissalom qurganlarida Ka'ba o'sha yerdan bo'lgan. Bu joy 'Hatim', 'Hijr' yoki 'Hijri Ismoil' ham deyiladi. Bu devorning ichki tarafi Ka'ba binosining ichiga kiradi. Chunki Ibrohim va Ismoil alayhimassalom qurgan Ka'ba shu shaklda bo'lgan. Keyinroq, Rasululloh sollallohu alayhi vasallam o'ttiz beshga kirganlarida qurayshliklar Ka'bani qayta tiklashganda, uni faqat halol mol bilan qurishga intilganlari sababli, mablag' yetmay, mazkur hudud Ka'ba binosining tashqarisida qolib ketgan va uni maxsus devor bilan o'rab qo'yishgan. 'Hijri Ismoil' mana shu devordir."
        ]
    },
    {
        "word": "Baytul maqdis",
        "type": [],
        "definition": [
            "muqaddas uy. Quddus shahrida qadimdan mavjud bo'lgan, musulmonlar, xristianlar va yahudiylarda muqaddas hisoblangan ibodatxonalar. Shu munosabat bilan Quddus shahrining o'zi ham baytul Maqdis deb nom olgan."
        ]
    },
    {
        "word": "Baytulloh",
        "type": [],
        "definition": [
            "Allohning uyi; masjid; ka'batulloh; Masjidi haram, Makka shahridagi Ka'ba binosi."
        ]
    },
    {
        "word": "Baytul-maʼmur",
        "type": [],
        "definition": [
            "Baytul-ma'mur – 'Obod uy', osmon ahlining qiblasi. U osmonda, yerdagi Ka'baning qoq tepasida joylashgan."
        ]
    },
    {
        "word": "Bayʼ",
        "type": [],
        "definition": [
            "Bay' o'zaro bir narsani almashtirishni anglatadi. Shariatda esa, bir molni ikkinchi bir mol muqobiliga iyjob va qabul ila olishga 'bay'' deb aytiladi."
        ]
    },
    {
        "word": "Bayʼat",
        "type": [],
        "definition": [
            "kishilarning Rasululloh sollallohu alayhi vasallamga itoat haqida bergan va'dalari."
        ]
    },
    {
        "word": "Bakibun",
        "type": [],
        "definition": [
            "('Bakiyut' yoki 'Bakyun' deb ham aytiladi) – Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Bakr az-Zaranjariy",
        "type": [],
        "definition": [
            "Abul Fazl Bakr ibn Muhammad az-Zaranjariy - Buxoroning Zaranjariy nomli qishlog'idan. Bu kishi fozil imom bo'lib, Abu Hanifa mazhabining fiqhiy masalalarini yoddan bilar edilar. Fatvo berishda Abu Hanifaning dalil va isbotlariga tayanardilar. Uzoq umr ko'rganlar. Hadis ilmidan ko'p ta'lim berganlar va ko'p shogird ham tarbiyalaganlar. Ko'p ustozdan ta'lim olganlar. Jumladan, shams ul-aimma (imomlar quyoshi) Abdulaziz ibn Muhammad al-Halvoiy, Abu Sahl Ahmad ibn Ali al-Abivardiy, Abu Hafs Umar ibn Mansur al-Hofiz, Ahmad ibn Muhammad al-Bujaliy al-Hofiz, Maymun ibn Ali al-Maymuniy, Muhammad ibn Sulaymon al-Koxushtuvoniy va Ahmad ibn Abdulloh al-Xayroxariy bu kishining ustozlaridirlar. U kishidan Kosonda Abu Hafs Umar ibn Muhammad al-Farg'oniy, Balxda Abu Ja'far Ahmad ibn Muhammad al-Halimiy, Samarqandda Abul Fazl Muhammad ibn Ali az-Zamiy va Buxoroda Abu Muhammad Abdulhalim ibn Muhammad al-Barroniy hadis rivoyat qilganlar. Hijriy 427 (milodiy 1037) yilda tug'ilib, hijriy 512 (milodiy 1119) yil rabi'ul avval oyining o'n to'qqizinchisida, payshanba kuni ertalab Buxoroda olamdan o'tganlar. Kalobod qabristonida dafn etilganlar."
        ]
    },
    {
        "word": "Bakr al-Iskoraniy as-Sugʻdiy",
        "type": [],
        "definition": [
            "Bakr ibn Hanzala al-Iskoraniy as-Sug'diy Shuayb ibn Lays al-Kog'aziy, Abd ibn Sahl az-Zohid as-Samarqandiy, Yahyo ibn Badr al-Qurashiy, Abu Hafs Amr ibn Aslam al-Buxoriydan hadis rivoyat qilganlar. Hijriy 370 (milodiy 981) yildan keyin vafot etganlar."
        ]
    },
    {
        "word": "Bakr as-Sobotiy al-Usrushaniy -",
        "type": [],
        "definition": [
            "Abul Hasan Bakr ibn Ahmad as-Sobotiy al-Usrushaniy faqih edilar. Samarqandda Fath ibn Ubayd as-Samarqandiydan hadis yozib olganlar. O'zlaridan esa Abu Zar Ammor ibn Muhammad at-Tamimiy al-Bag'dodiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Bakr ash-Shiravoniy",
        "type": [],
        "definition": [
            "Abul Qosim Bakr ibn Amr ash-Shiravoniy Buxoro ahlidan. Zakariyo ibn Yahyo al-Marvaziy, Muhammad ibn Iso al-Madoiniy va Is'hoq ibn Muhammad ibn Sabboh al-Jarjaroiydan hadis rivoyat qilganlar. Hijriy 314 (milodiy 927) yilning ramazon oyida vafot etganlar."
        ]
    },
    {
        "word": "Baqara surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 286 oyatdan iborat.\r\n    \r\n    Baqara so'zi 'sigir' degan ma'noni anglatadi. Surai karimada Alloh taolo Banu Isroilga sigir so'yishga farmon bergani haqidagi qissa ham o'rin olgan bo'lib, suraning nomi shundan olingandir.\r\n    Bu sura Muhammad alayhissalom Makkai Mukarramadan Madinai Munavvaraga hijrat qilganlaridan keyin nozil bo'lgan birinchi suradir.\r\n    Albatta, boshqa suralar kabi, bu sura ham birdaniga, ya'ni oyatlari ketma-ket nozil bo'lmagan, balki turli holatlarda, turli vaqtlarda nozil bo'lgan. Orada boshqa suralarning ham oyatlari nozil bo'lib turgan. Qachon biror oyat yoki bir necha oyat nozil bo'lsa, Nabiy alayhissalomning o'zlari o'sha tushgan oyatlarning o'rni qaysi suraning qaysi oyatidan keyin, qaysi oyatidan oldin ekanini ham aytib berganlar.\r\n    Ushbu surai karima bir necha mavzularni muolaja qiladi. Lekin hamma mavzular ham bir masala atrofida jamlanadi. U ham bo'lsa, yahudiylarning Islomga bo'lgan munosabatlari, Nabiy alayhissalomga va yangi Islom jamoasiga qilgan qarshiliklari masalasidir. Shuningdek, yahudiy va munofiqlarning hamda mushriklarning Islomga qarshi olib borgan dushmanliklari, buning muqobilida yosh Islom jamiyatining shakllanishi, yer yuzida Allohning xalifasi bo'lish uchun tayyorlanish jarayonlari hikoya qilinadi.\r\n    Madinai Munavvarada nozil bo'lgan boshqa suralar kabi, Baqara surasi ham musulmonlar o'z ijtimoiy hayotlarida muhtoj bo'lib turgan qonun-qoida va tuzumlarni muolaja qiladi.\r\n    Bu sura ko'plab shariat hukmlarini, aqiyda, ibodat, muomala, axloq, oila, taloq, idda, ro'za, qasos kabi masalalarni o'z ichiga olgan.\r\n    Suraning avvalida mo'minlar, kofirlar va munofiqlarning sifatlari haqida so'z ketadi. Iymon, kufr va nifoqning haqiqati bayon qilinadi. Saodat ahli bilan badbaxtlar solishtiriladi. So'ngra insonning yaratilishi, Odam alayhissalomning xalq etilishi va o'sha vaqtda bo'lib o'tgan ishlarning qissasi keladi.\r\n    Surai karimada ahli kitoblar, xususan, yahudiylar (Banu Isroil) haqida batafsil so'z ketadi. Chunki ular Madinai Munavvarada musulmonlar bilan birga yashar edilar. Shuning uchun ham Qur'oni Karim musulmonlarni yahudiylarning makr-hiylalari, xiyonatlari, aldamchiliklari va buzuq tabiatlaridan xabardor qiladi. Ularning Islom uchun xatarli va zararli ekanlarini tushuntiradi. Suraning uchdan biridan ko'prog'i shu masalaga oiddir.\r\n    Musulmonlar o'z jamiyatlarini endigina qura boshlaganlari uchun, surada ularga ilohiy hayot tarzi o'rgatilgan. Ibodat va muomala masalalari, jumladan, ro'za, haj va umra, Allohning yo'lida jihod qilish, oila, taloq, bola emizish, idda, musulmonlarga mushrika ayollarga uylanish haromligi va boshqa masalalar bayon qilingan.\r\n    Surai karimada yana riboxo'rlikka – sudxo'rlikka katta e'tibor berilgan bo'lib, uning haromligi va oqibati yomonligi ta'kidlangan. So'ngra qiyomat kunining dahshatlari zikr qilinadi. Va nihoyat, suraning oxirida mo'minlarni tavba qilishga, doimo Allohga tazarruda bo'lishga chaqiriq keladi.\r\n    Imom Ahmad keltirgan rivoyatda Abu Umoma quyidagilarni aytadilar:\r\n    'Rasululloh sollallohu alayhi vasallamning 'Qur'onni qiroat qilinglar, u qiyomat kuni o'z ahliga shafoatchidir, ikki nur sochuvchini – Baqara va Oli Imronni o'qing, ular qiyomat kuni boshga soya soluvchi bulut bo'lib keladilar. Baqarani o'qinglar, uni olish barakadir, uni tark qilish hasratdir. Sehrgarlar unga qodir bo'la olmaydilar', – deganlarini eshitdim'.\r\n    Imom Termiziy Abu Hurayra roziyallohu anhudan rivoyat qilgan hadisda Nabiy alayhissalom:\r\n    'Uylaringizni qabrga aylantirmanglar. Surai Baqara o'qilgan uyga shayton kirmaydi', – deganlar.\r\n    Imom Ibn Hibbon Sahl ibn Sa'd roziyallohu anhudan rivoyat qiladi:\r\n    'Nabiy alayhissalom: 'Har narsaning sanomi – ko'zga ko'ringan joyi bo'ladi. Baqara surasi Qur'onning sanomidir. Kim o'z uyida kechasi uni o'qisa, o'sha uyga uch kecha shayton kirmaydi. Kim uni kunduzi o'qisa, uch kun shayton kirmaydi', – deganlar'.\r\n    Imom Dorimiy rivoyat qiladilarki, Abdulloh ibn Abbos roziyallohu anhu:\r\n    'Kim surai Baqaradan o'n oyatni – avvalidan to'rt oyat, 'Oyatul Kursi' va undan keyingi ikki oyat va oxiridan uch oyatni kechasi o'qisa, o'sha uyga shu kechasi shayton kirmaydi', – deganlar.\r\n    Imom Nasaiy Abu Hurayra roziyallohu anhudan rivoyat qiladilar:\r\n    'Nabiy alayhissalom bir joyga ko'p sonli kishilarni yuborishdan avval ularga Qur'on o'qitib ko'rdilar. Ulardan har biri Qur'onni qancha bilsa, shuni o'qidi. Ularning ichida eng yosh yigitning oldiga kelib:\r\n    – Ey Falonchi, sen Qur'ondan qancha bilasan? – dedilar. U:\r\n    – Falon, falon suralarni va Baqara surasini bilaman, – dedi. U zoti bobarakot:\r\n    – Baqara surasini bilasanmi? – deb so'radilar. Yigit:\r\n    – Ha, – dedi. Nabiy alayhissalom:\r\n    – Boraver, sen ularga amirsan, – dedilar...'\r\n    Imom Buxoriy rivoyat qiladilar:\r\n    'Usayd ibn Huzayr roziyallohu anhu kechasi Baqara surasini o'qiyotgan edi. Yaqinida oti bog'log'liq turar edi. Birdan ot tipirchilab qoldi. Qiroatdan to'xtagan edi, ot ham to'xtadi. Yana o'qigan edi, ot ham tipirchiladi. O'g'li Yahyo yaqinida uxlab yotardi. Ot bosib olmasin deb, borib, uni qo'liga oldi va boshini osmonga ko'tardi. Tong otgandan so'ng hodisani Nabiy alayhissalomga so'zlab berdi. U kishi:\r\n    – O'qi, ey Ibn Huzayr, – dedilar. U bo'lsa:\r\n    – Ey Allohning Rasuli, Yahyoni bosib olmasin deb qo'rqdim, uning yaqinida edi. Boshimni ko'tarib, uning oldiga bordim. Osmonga qarasam, bulutga o'xshash narsa, ichida chiroqqa o'xshagan narsalar ham bor. Ularni ko'rmay deb, chiqib ketdim, – dedi. Nabiy alayhissalom:\r\n    – U nimaligini bilasanmi? – dedilar. U:\r\n    – Yo'q, – dedi. U zoti bobarakot:\r\n    – Ular sening ovozingga kelgan farishtalar. Agar tong otguncha o'qiyverganingda, odamlar ularga nazar solsa bo'lardi. Ular berkinmas edilar, – dedilar'.\r\n    Abu Ubayd rivoyat qilishlaricha:\r\n    'Bir odam namozda Baqara va Oli Imron suralarini o'qidi. Namozini tugatganidan keyin hazrati Ka'b roziyallohu anhu unga:\r\n    – Baqara bilan Oli Imronni o'qidingmi? – dedilar. U:\r\n    – Ha, – dedi. Shunda u kishi:\r\n    – Mening jonim tasarrufida bo'lgan Zot bilan qasamki, bu ikkovida u bilan duo qilsa mustajob bo'ladigan Allohning ismi bor, – dedi. Haligi odam:\r\n    – Menga o'rgatib qo'ying, – dedi. Hazrati Ka'b:\r\n     – Yo'q, o'rgatmayman, senga uning xabarini aytsam, o'zingni ham, meni ham halok qiladigan duo qilib qo'ymagin, – dedilar'."
        ]
    },
    {
        "word": "Baqiʼ",
        "type": [],
        "definition": [
            "Baqi' – oldin daraxtzor bo'lib, daraxtlari kesilgach, ularning to'nka va ildizlari qolgan keng maydon"
        ]
    },
    {
        "word": "Balad surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 20 oyatdan iborat.\r\n    Ushbu surai karimaning ham birinchi oyatidagi so'z unga nom bo'lib qolgan. 'Balad' so'zi 'yurt', 'o'lka', 'shahar' degan ma'nolarni anglatadi. Ushbu oyatdagi 'Balad'dan murod esa Makkai Mukarrama shahridir.\r\n    Bundan avvalgi surada boylikni yaxshi ko'rganlar, merosni haromdan ko'plab yeganlar, miskinlarga taom berishga qiziqmaganlar tanqid qilindi. Bu surada esa boylik egalarining qul ozod qilish, ochlik kunlarida taom berish kabi xislatlari zikr qilinadi. Shuningdek, nafs xotirjamligi nima bilan hosil bo'lishi ham aytiladi.\r\n    Bu surada juda qisqa so'zlar ila oxirat hayotining borligi, Alloh taolo insonga ikki yo'l – saodat yo'li va baxtsizlik yo'lini ko'rsatib qo'yganligi, inson ulardan xohlaganini tanlab, o'sha yo'ldan yurishi, oqibatda esa qilganiga yarasha mukofot yoki jazo olishi aytiladi.\r\n    Boy kishilarda iymon bo'lmasa, hovliqib ketishlari, dunyoda menga kuchi yetadigan hech kim yo'q, men u qildim, men bu qildim, deb maqtanishlari eslatiladi. Aslida esa boy odam beva-bechora, kambag'al-miskin, yetim-yesirlarga yordam berishi lozimligi uqtiriladi.\r\n    Shunday qilib, Alloh taolo musulmonlarni insonparvarlik, mehr-shafqat, birodarlik va boshqa yuksak insoniy fazilatlar ruhida tarbiyalab boradi.\r\n    Boshqa makkiy suralar qatori, Balad surasining maqsadi ham iymon-e'tiqodni sobit qilish bo'lib, unda asosan oxiratdagi hisob-kitob va jazo-mukofot masalasi va shuningdek, yaxshilar bilan yomonlarning orasini ajratish masalasi muolaja qilinadi.\r\n    Surai karimaning boshida Baladul Harom – Makkai Mukarrama bilan, Nabiy sollallohu alayhi vasallam yashab turgan shahar bilan qasam ichilib, Volid (Odam Ato) va uning avlodlari ila qasam ichilib, inson bu dunyoda mashaqqat tortishi muqarrar ekani ta'kidlanadi.\r\n    So'ngra ba'zi bir kishilar o'zlari kofir va osiy bo'lib turib, molu mulklarini noto'g'ri yo'lda sarflab turib ham, ana o'sha sarf-xarajatlari o'zidan azobni qaytarishini noto'g'ri da'vo qilishlari va ular aslida nima qilishlari kerakligi bayon qilinadi.\r\n    Suraning xotimasida esa oxiratda mo'minlarning holi qanday bo'ladi-yu, kofirlarning holi qanday bo'ladi, qisqacha vasf qilinadi."
        ]
    },
    {
        "word": "Balda",
        "type": [],
        "definition": [
            "Balda – Makkai Mukarramaning nomlaridan biri."
        ]
    },
    {
        "word": "Baldah",
        "type": [],
        "definition": [
            "Baldah – Makkai Mukarrama yaqinidagi vodiyning nomi."
        ]
    },
    {
        "word": "Balogʻat",
        "type": [],
        "definition": [
            "voyaga yetish, bo'yiga yetish; yetuklik; bolig'lik. 1. Balog'atga yetgan bola shariat qonun-qoidalari oldida mas'ul, amallarni bajarishga mukallaf hisoblanadi. 2. Arab tili xususiyatlariga oid fan. 3. Notiqlik, so'zamollik mahorati, san'ati. Fasohatli so'zlash ilmi."
        ]
    },
    {
        "word": "Balʼam",
        "type": [],
        "definition": [
            "– Rum shaharlaridan biri."
        ]
    },
    {
        "word": "Bamijkat",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Banda",
        "type": [],
        "definition": [
            "qul, itoatkor. Alloh yaratgan, taqdiri Uning qo'lida bo'lgan kishi; Allohning quli."
        ]
    },
    {
        "word": "Bandargoh",
        "type": [],
        "definition": [
            "port (kemalar to'xtash joyi)."
        ]
    },
    {
        "word": "Bani",
        "type": [],
        "definition": [
            "avlod, bolalar; qabila, qavm, urug'-aymog'."
        ]
    },
    {
        "word": "Bani isroil",
        "type": [],
        "definition": [
            "yahudiylar; Isroil farzandlari."
        ]
    },
    {
        "word": "Bani muxoz",
        "type": [],
        "definition": [
            "bir yoshli erkak tuya"
        ]
    },
    {
        "word": "Banu zurayq",
        "type": [],
        "definition": [
            "Madina yaqinidagi joy nomi. Hadislarda Saniyya bilan Banu Zurayq masjidining orasi bir mil, deyilgan."
        ]
    },
    {
        "word": "Banu nazir",
        "type": [],
        "definition": [
            "Banu Nazir – Madinada istiqomat qilgan yahudiy qabilalaridan biri."
        ]
    },
    {
        "word": "Barid",
        "type": [],
        "definition": [
            "'Barid' masofa birligi bo'lib, lug'atda 'pochta' ma'nosini bildiradi. Ilgari vaqtda Islom o'lkalarida pochta ishlari ot ila yurib amalga oshirilgan. Shaharlar orasidagi pochtaxonalar ma'lum masofaga qurilgan. Bir barid bilan ikkinchisining orasi to'rt farsax, ya'ni 22176 metr bo'lgan. Har pochtaxona–baridda xodimlar otlarini boqib, shay bo'lib turganlar, avvalgi baridning xodimlari uzoqdan ko'rinishi bilan yo'lga tayyor bo'lib otni minib turganlar. Ular kelib pochtani topshirishi bilan bular ot choptirib olg'a bosganlar. Birinchi va ikkinchi pochtaxona orasidagi masofa esa, o'sha vaqtning taomiliga ko'ra, 'barid' deb aytilgan."
        ]
    },
    {
        "word": "Barkad",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Baroat",
        "type": [],
        "definition": [
            "'Baroat' so'zi ora ochiqlik, shartnomani bekor qilish ma'nosini anglatadi. Bu yerda Rasululloh sollallohu alayhi vasallam bilan mushriklar o'rtasida tuzilgan ahdning bekor qilinishi hakida nozil bo'lgan Tavba surasining avvalgi oyatlari nazarda tutilgan. Hazrati Aliy Nabiy alayhissalomning ko'rsatmalariga binoan ushbu oyatlarni o'qib, e'lon qilganlar. Tavba surasining yana bir nomi ham Baroatdir."
        ]
    },
    {
        "word": "Barfashx",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Basba",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Baskoyir",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Baskos",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Batho",
        "type": [],
        "definition": [
            "Batho – vodiydagi mayda toshli keng o'zan, suv yo'li. Zulhulayfadagi ma'lum joy ham Batho deb ataladi."
        ]
    },
    {
        "word": "Bashshor al-Amdiziy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bishr Bashshor ibn Abdulloh al-Amdiziy al-Buxoriy - Afshavon qishlog'idan bo'lib, Muhammad ibn Fuzayl, Vaki' ibn Jarroh va Iso ibn Muso al-G'unjordan hadis rivoyat qilganlar. O'zlaridan esa Sahl ibn Shozavayh hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Behuda qasam",
        "type": [],
        "definition": [
            "'Behuda qasam' deb o'ylamay-netmay, til o'rganib qolganidan ichiladigan qasamga ham aytiladi. Ayniqsa, arablarda qasam lafzi oson chiqadi. So'z orasida ham, vallohi, billaahi, tallohi, deb yuborishaveradi. Bunda qasam ichish niyati umuman bo'lmasa ham, til o'rganib qolgan bo'ladi. Turkiy xalqlarda har narsaga, 'xudo ursin' deyaverish ham shunga o'xshaydi."
        ]
    },
    {
        "word": "Bidʼat",
        "type": [],
        "definition": [
            "yangilik kiritmoq, yangitdan yaratmoq, noma'qul yangilik; din aqidalariga xilof yangilik. Qur'on va Sunnatga xilof ravishda paydo bo'lgan har bir odat yomon bid'atdir. Payg'ambarimizdan keyin islom dinida yangidan paydo qilingan ishlar, odatlar."
        ]
    },
    {
        "word": "Bidʼatchi",
        "type": [],
        "definition": [
            "Rasululloh sollallohu alayhi vasallamdan ma'ruf bo'lgan e'tiqodga sarkashlik emas, shubha tufayli xilof qilgan kishi."
        ]
    },
    {
        "word": "Bidʼiy taloq",
        "type": [],
        "definition": [
            "Sunniy taloqqa xilof taloqni 'bid'iy taloq' deyiladi. 'Bid'iy' 'bid'atga muvofiq' degani bo'lib sunnatga xilof ma'nosini anglatadi. Bid'iy taloq qilgan odamning talog'i tushadi. Ammo, o'zi katta gunoh qilgan bo'ladi."
        ]
    },
    {
        "word": "Bizoʻa",
        "type": [],
        "definition": [
            "'Bizo'a' ishchining tekinga ishlab berishidir."
        ]
    },
    {
        "word": "Binti",
        "type": [],
        "definition": [
            "qizi. Masalan: Binti Umar – Umarning qizi, Amina binti Vali – Amina Vali qizi."
        ]
    },
    {
        "word": "Binti labun",
        "type": [],
        "definition": [
            "ikki yoshli urg'ochi tuya"
        ]
    },
    {
        "word": "Binti muxoz",
        "type": [],
        "definition": [
            "bir yoshli urg'ochi tuya"
        ]
    },
    {
        "word": "Birzavn",
        "type": [],
        "definition": [
            "'Birzavn' (ko'plikda 'baroziinu', urg'ochisi 'birzavnatun') – ajam oti. Aytishlaricha, bunday otlar arab yurtlariga Rum mamlakatlaridan keltirilgan. Bu otlarning arab otlaridan farqi shuki, ularning gavda tuzilishi yirik, oyog'i baquvvat, tuyoqlari katta, tog'u tosh, daralarda yurishga chidamli bo'lgan"
        ]
    },
    {
        "word": "Bismillahir Rohmanir Rohiym",
        "type": [],
        "definition": [
            "mehribon va rahmli alloh nomi bilan (boshlayman)."
        ]
    },
    {
        "word": "Biforin",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Bishr ar-Rivdiy",
        "type": [],
        "definition": [
            "Abu Sa'id Bishr ibn Ilyos ar-Rivdiy - Buxoroning Rivda nomli qishlog'idan. Homid ibn Shubayb al-Azdiy, Tayyib ibn Muqotil va boshqa muhaddislardan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Bobshiy",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan. Buxoro tumanidagi Podshohi qishlog'i."
        ]
    },
    {
        "word": "Bogʻiy",
        "type": [],
        "definition": [
            "Bog'iy – lug'atda 'tajovuzkor', istilohda 'odil imomga itoatsizlik qilib, Islom davlatiga qurol ko'tarib, qarshi chiqqan shaxs'."
        ]
    },
    {
        "word": "Bozaq",
        "type": [],
        "definition": [
            "Bozaq – uzum sharbatini pishirib tayyorlanadigan ichimlik."
        ]
    },
    {
        "word": "Boida arablar",
        "type": [],
        "definition": [
            "Yo'q bo'lib ketgan arab qavmlari Od, Samud, Tasm, Jadis, Imloq, Umaym, Birinchi Jurhum, Hazur, Vabor, Abil, Josim, Hazramavt, Ashobi rass*, ahli Madyan kabi qabilalardir.\r\n    * Ashobi rass, ya'ni Quduq egalari – Shuayb alayhissalomning halokatga uchragan itoatsiz qavmi."
        ]
    },
    {
        "word": "Boin taloq",
        "type": [],
        "definition": [
            "Bu xildagi taloq ikkiga bo'linadi: A) Kichik boin. B) Katta boin. Kichik boin taloq aqdi nikohdan keyin jinsiy yaqinlik qilmay turib, kinoya lafzlariga shiddat, qattiq, katta kabi vasflarni(sifatlarni) qo'shib qilingan, xotin tomonidan berilgan mol evaziga qilingan, qozi tomonidan iylo va erdagi nafaqa bermaslikdan boshqa ayb, kelishmovchilik kabi sabablarga ko'ra qilingan bir yoki ikki taloqdir. Shuningdek, idda chiqqanidan keyin raj'iy taloq ham boin taloqqa aylanib qoladi. Boin taloqdan keyin eru xotin ajrashgan hisoblanadi. Shuning uchun, boin taloq qilgan er o'sha xotin bilan birga turmasligi, begona kabi muomala qilishi kerak bo'ladi. Bu taloq bir yoki ikki dona bo'lsa, erning uch taloq haqqi bir yoki ikki adadga qisqaradi. Kichik boin taloqdan keyin er yoki xotin vafot etsa bir-biridan meros ola bilmaydilar. Chunki, oralaridagi nikoh uzilgan bo'ladi. Katta boin taloq uch taloqdir. Bu taloqdan keyin nikoh mulki tugaydi, xotin erga muvaqqat harom bo'ladi. Ularning orasida iddadan boshqa hech narsa qolmaydi. Xotin iddasi chiqqanidan keyin boshqa erga sahih nikoh ila tegib, ular to'laqonli er-xotin bo'lib yashab, ikkinchi er vafot etib yoki taloq qilib, ayolning iddasi chiqqanidan so'ng yana birinchi erga halol bo'ladi. Xohlasa, yangidan nikohlanishlari mumkin."
        ]
    },
    {
        "word": "Boqiy",
        "type": [],
        "definition": [
            "abadiy; cheksiz; poyoni yo'q; umrboqiy; bitmas-tugunmas; mangu."
        ]
    },
    {
        "word": "Boqiya arablar",
        "type": [],
        "definition": [
            "Boqiya arablar hozirgi kungacha qolgan arab qavmlari bo'lib, ular ham sulola jihatidan ikki qismga bo'linadi:\r\n    – qahtoniy arablar;\r\n    – adnoniy arablar.\r\n    Qahtoniy arablarning asl vatanlari Arabiston yarimorolining janubidagi Yaman o'lkasidir. Ular Saba' ibn Yashjub ibn Ya'rub ibn Qahtondan tarqalgan va o'ndan ortiq qabilalarga bo'linib, ulardan ikkitasi – Himyar ibn Saba' (himyariylar) bilan Kahlon ibn Saba' (kahloniylar) mashhur bo'lishgan. Shuning uchun ular 'saba'iylar' ham deyiladi.\r\n    Adnoniy arablarning asl vatanlari Makkai mukarramadir. Adnon Ismoil alayhissalomning avlodlari bo'lib, adnoniy arablar o'z nasablari tarixini Adnongacha aniq yodda saqlaganlar. Adnon Rasululloh sollallohu alayhi vasallamning yigirma birinchi bobolari hisoblanadi."
        ]
    },
    {
        "word": "Bomdod namozi",
        "type": [],
        "definition": [
            "Tongda yorug'lik pastdan yuqoriga ko'tarilishidan to yorug'likning ufq bo'ylab ko'ndalangiga tarqalishigacha o'qiladigan namoz."
        ]
    },
    {
        "word": "Boriz",
        "type": [],
        "definition": [
            "'Boriz' so'zining ma'nosi haqida ulamolar bir necha xil fikr aytganlar. Ba'zilari: 'Bu so'z 'tepalik, tog'lik joy' degan ma'noni bildiradi, ya'ni u yerda yashovchi kurdlar nazarda tutilgan', degan bo'lsa, boshqalari bu yerda daylamliklar, yana birlari esa forslar deb taxmin qilishgan."
        ]
    },
    {
        "word": "Botil",
        "type": [],
        "definition": [
            "yolg'on, soxta; befoyda, bekor; soxta, asossiz; foydasiz, haqiqatga muvofiq bo'lmagan ishlar."
        ]
    },
    {
        "word": "Botil savdo",
        "type": [],
        "definition": [
            "Rukni yoki mahalliga xalal yetgan savdo yoki asli va vasfi shar'iy bo'lmagan savdo botil savdodir. Boshqacha aytganda, savdo qiluvchi savdo qilishga layoqatsiz bo'lsa yoki savdo moli savdoga loyiq bo'lmasa, savdo botil bo'ladi. Bunday savdo, agar sirtdan savdoga o'xshab ko'rinsa ham, savdo bo'la olmaydi va aslo mulkni ifoda qila olmaydi. Misol uchun, voyaga yetmagan yosh bola yoki jinni odamning savdosi yoki mol hisoblanmaydigan o'limtikning go'shti, tutamlik mol bo'lmagan cho'chqa go'shti va aroqqa o'xshash narsalar savdosi botil savdo bo'ladi."
        ]
    },
    {
        "word": "Botil savdoning turlari",
        "type": [],
        "definition": [
            "1. Yo'q narsani sotish\r\n2. Qo'liga tutqazish mumkin bo'lmagan narsani sotish (Misol uchun, egasining qo'lidan qochib ketgan qushni sotib bo'lmaydi)\r\n3. Faflat savdosi (Bunda xaridorni g'aflatda qoldirish uchun turli uslublar ishlatish bo'ladi)\r\n4. Najas va najas aralashgan narsalarni sotish (Hanafiy mazhabi bo'yicha, aroq, cho'chqa, o'limtik va qonni sotib bo'lmaydi)\r\n5. Arbun (bay'boshi) savdosi\r\n6. Suv savdosi (savdoga qo'yilayotgan narsa sotuvchining mulki bo'lishi lozim. Shuning uchun, birovning mulki bo'lmagan suv, havo va tuproq kabi narsalarni sotib bo'lmaydi)\r\n7. Aroq tayyorlovchiga uzum sotish\r\n8. Bir yo'la ikki savdoni qo'shib yuborish yoki bir savdoga ikki shart qo'yish (Ikki savdoni qo'shib yuborishning ikki xil ko'rinishi bor. Birinchisi, 'Bu narsani naqdga ming so'mga, nasiyaga bir ming ikki yuz so'mga sotaman', deyish. Ikkinchisi, 'Mashinangni menga sotsang, uyimni senga sotaman', deyish)\r\n9. Narxni ma'lum vaqtda bo'lib-bo'lib to'lash sharti bilan qilingan savdo ( Sotuvchi 'Bu narsani naqdga ming so'm, bo'lib to'lashga ming ikki yuz so'mga sotdim' deganda, xaridor 'Qabul qildim', desa, savdo botil bo'ladi. Ammo, 'Bu narsani naqdga ming so'mga, bo'lib to'lashga ming ikki yuz so'mga sotaman' deganda, xaridor 'Bo'lib to'lashga ming ikki yuz so'mga oldim', desa, savdo to'g'ri bo'ladi. Bu kabi savdoning to'g'riligiga barcha mazhablar ittifoq qilishgan)\r\n10. Bir narsaning bo'laklarini yoki sifatini sotish ( ' Bir narsaning bo'lagi' deganda, 'Mana bu qo'yning dumbasini sotdim' kabi savdo tushuniladi. 'Bir narsaning sifatini sotish' deganda, yoqut deb sotilgan narsa shisha chiqib qolishi kabi narsalar anglanadi. Bu kabi savdolar botildir.)\r\n11. Birovning mulkidagi narsani sotib olgan shaxs o'sha narsani o'z qo'liga olmay turib sotishi (Hanafiy mazhabi bo'yicha, ko'char mulkni sotib olgan odam uni qabz qilmasdan – o'zi qabul qilib olmasdan turib sotishi mumkin emas. Chunki, hali mol uning qo'liga sog'-salomat keladimi, yo'qmi, ma'lum emas"
        ]
    },
    {
        "word": "Boʻa",
        "type": [],
        "definition": [
            "'bo'a' - moddiy, ma'naviy va jismoniy jihatdan nikohga qodirlik ma'nosini anglatadi."
        ]
    },
    {
        "word": "Buvayra",
        "type": [],
        "definition": [
            "Buvayra – Banu Nazir qabilasiga qarashli xurmozorning nomi."
        ]
    },
    {
        "word": "Buvot",
        "type": [],
        "definition": [
            "Buvot – Madinadan taxminan 80-90 km uzoqlikdagi, Makka-Shom yo'lidagi tog' va uning vodiysining nomi. Bu yerdagi tog'lar bir-biriga tutash bo'lib, ularni 'Abvot' ham deyishadi."
        ]
    },
    {
        "word": "Bunduqa",
        "type": [],
        "definition": [
            "'Bunduqa' loy yoki boshqa narsadan dumaloq qilib qilib yasalgan, o'q o'rniga otiladigan og'ir narsa."
        ]
    },
    {
        "word": "Burgʻu",
        "type": [],
        "definition": [
            "Burg'u – ichi shox shaklida kengayib boruvchi puflab chalinadigan asbob."
        ]
    },
    {
        "word": "Burda",
        "type": [],
        "definition": [
            "Burda – asosan paxtadan tayyorlangan matodan tikilgan ustki kiyim. Ko'pincha barida hoshiyasi ham bo'ladi. Hibara – Yamandan keltiriladigan paxtalik yoki zaytun poyasidan to'qiladigan ustki kiyim, ko'proq zangori rangda bo'ladi. Yaman burdasi xibara deb ataladi"
        ]
    },
    {
        "word": "Burnus",
        "type": [],
        "definition": [
            "Burnus – qalpoqli ustki kiyim, kapyushon."
        ]
    },
    {
        "word": "Buruj surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 22 oyatdan iborat.\r\n    Ushbu surai karimaning ismi uning birinchi oyatidagi 'zaatil buruji' so'zidan olingan. 'Buruj' 'burj' so'zining ko'pligi, ya'ni 'burjlar' degani bo'lib, lug'atda 'ko'tarilish', 'zohir bo'lish' degan ma'nolarni anglatadi. Iste'molda esa bir turkum yulduzlarga nisbatan ham 'burj' so'zi ishlatiladi.\r\n    Buruj surasi ham boshqa makkiy suralarga o'xshab, Islom aqiydasi haqiqatlarini muolaja qiladi.\r\n    Bu sura dushmanlar Payg'ambar sollallohu alayhi vasallamni va musulmonlarni dindan qaytarish maqsadida qattiq azobga duchor qilganlarida nozil bo'lgan. Bu surada Alloh taolo mo'minlarning dushmanlarini ogohlantirib, oqibatlari yomon bo'lishini eslatadi.\r\n    Mo'minlarni esa sabrga chaqiradi. Ulardan avval o'tgan dindorlar ham ko'p azob-uqubatlarga duchor bo'lganliklarini aytadi.\r\n    'Ashabul uxdud' qissasini o'rnak uchun keltiradi.\r\n    Kofirlar Fir'avn yoki Samud qavmi kabi kuchli, askarlari ko'p bo'lsa ham, mag'lubiyatga uchrashini eslatadi.\r\n    Oxiratda mo'minlar jannatda, ularning dushmanlari do'zaxda bo'ladi.\r\n    Buruj surasi burjlar egasi bo'lmish osmon ila, va'da qilingan kun – qiyomat ila va guvohlik beruvchilar hamda guvohlik berilganlar ila qasam ichish bilan boshlanadi.\r\n    Keyin esa uxdud egalarining qissasi va ularga nisbatan qilingan tahdid zikr qilinadi.\r\n    So'ngra Alloh taolo O'zining mo'min bandalariga ozor berganlardan o'ch olishga qodir ekani bayon etiladi. Shuningdek, Fir'avn va uning lashkari qissasi keltiriladi.\r\n    Nihoyat, Qur'oni Karimni vasf qilish ila surai karimaga xotima yasaladi."
        ]
    },
    {
        "word": "Busr",
        "type": [],
        "definition": [
            "Busr – xurmo navlaridan biri. Uning mevasini yorib, suvga solib, achitib xamr tayyorlangan. Bunday xamrni 'fazix' deb atashgan. Fazix – xamr turlaridan biri bo'lib, o't tekkizmay qilingan. U gohida g'o'r xurmodan, gohida quruq xurmodan, gohida ikkisining aralashmasidan qilingan."
        ]
    },
    {
        "word": "Busra binti Safvon",
        "type": [],
        "definition": [
            "Busra binti Safvon ibn Navfal ibn Asad ibn Abdul Uzzo ibn Qusay ibn Kilob al-Qurashiya al-Asadiyya.\r\n    Salama binti Umayya ibn Uvqis as-Sulaymiyya¬ning onalari. U Varaqa ibn Navfalning akasining qizi.\r\n    Busra Mug'iyra ibn Abu Osga turmushga chiqib, Muoviya va Oisha degan farzandlar ko'rdi. Oisha Abdul Malik ibn Marvon ibn Hakamning onalari edi.\r\n    Busra Ummu Kulsum binti Uqba ibn Abu Muayiddan rivoyat qilganlar. U kishidan esa Marvon ibn Hakam, Sa'iyd ibn Musayyib va boshqalar rivoyat qilganlar."
        ]
    },
    {
        "word": "But",
        "type": [],
        "definition": [
            "sanam; haykal; ikona."
        ]
    },
    {
        "word": "Boʻtana",
        "type": [],
        "definition": [
            "Bo'tana – xira, loyqasimon narsa."
        ]
    },
    {
        "word": "Buthon",
        "type": [],
        "definition": [
            "Buthon – Madinadagi vodiylardan birining nomi."
        ]
    },
    {
        "word": "Buxoro",
        "type": [],
        "definition": [
            "Movarounnahrning ma'lum va mashhur shaharlaridan. Bu yerdan juda ko'p mumtoz, ta'rif va tavsifi tilni ojiz qoldiradigan olim, fozil, mufassir, muhaddis va faqihlar yetishib chiqqanlar."
        ]
    }
]