[
    {
        "word": "En kiyim ",
        "type": [],
        "definition": [
            "En kiyim – tikilmagan, choyshabsimon oddiy mato"
        ]
    },
    {
        "word": "Ehrom",
        "type": [],
        "definition": [
            "'Ehrom' arabcha so'z bo'lib, lug'atda 'harom qilmoq' ma'nosini anglatadi, chunki, hajda ehromga kirgan odam o'ziga ehromdan oldin halol bo'lgan ba'zi ish va narsalarni harom qilgan bo'ladi. Misol uchun, boshqa vaqtlarda o'ziga xushbo'y narsalarni sepishi halol edi, ehromga kirgach, Bu narsa harom bo'lib qoladi."
        ]
    },
    {
        "word": "Ehson",
        "type": [],
        "definition": [
            "astoydillik, vijdonlilik, samimiylik, riyokorlikning ziddi."
        ]
    },
    {
        "word": "Ehsor ",
        "type": [],
        "definition": [
            "Hoji yoki umrachining dushman yoki kasallik yoxud boshqa sababga ko'ra ibodatni ado eta olmay qolishiga 'ehsor' deyiladi."
        ]
    },
    {
        "word": "Ehtibo ",
        "type": [],
        "definition": [
            "'Ehtibo' – orqani yerga qo'yib, ikki tizzani ko'tarib, bel bilan boldirni qo'shib, kiyimga o'rab o'tirish bo'lib, mato o'rnida insonning o'z qo'li bo'lishi ham mumkin, ya'ni orqani yerga qo'yib, ikki tizzasini quchoqlab o'tirish ham 'ehtibo' deyiladi."
        ]
    },
    {
        "word": "Ehtikor ",
        "type": [],
        "definition": [
            "'Ehtikor' (monopoliya) so'zi lug'tda 'ushlab turish ma'nosini bildiradi. Shariatda esa, sotib olingan narsani sotmay narxni oshirish uchun qasdan ushlab turishga 'ehtikor' deb aytiladi. Ulamolarimiz xalq ommasining ehtiyoji ko'proq tushadigan narsalar, xususan, oziq-ovqatning ehtikoriga alohida, boshqa narsalarning ehtikoriga alohida munosabat bildirganlar. Birinchisini 'mutlaqo mumkin emas', desalar, ikkinchisini 'qimmatchilik vaqtida mumkin emas', deganlar."
        ]
    },
    {
        "word": "Ehtilom ",
        "type": [],
        "definition": [
            "Uyg'ongan kishi maniy yoki maziyni ko'rishi. 'Ehtilom' degani 'uyquda jinsiy yaqinlikni ko'rmoq', 'uyquda bulg'anmoq', deganidir."
        ]
    },
    {
        "word": "Eʼlous Sunan ",
        "type": [],
        "definition": [
            "pokistonlik alloma Zafar Ahmad Usmoniyning ustozlari ulug' olim faziylatli shayx Ashraf Ali Tohanaviyning ko'rsatmalari ila yigirma yil davomida yozgan yigirma bir jildli kitobi."
        ]
    },
    {
        "word": "Eʼtikof ",
        "type": [],
        "definition": [
            "'E'tikof' lug'atda 'ushlab qolish', 'turib qolish' va 'lozim tutish' ma'nolarini ifoda qiladi. Shariatda esa 'Ro'zadorning jamoat masjidida e'tikof niyati ila qolishidir'."
        ]
    },
    {
        "word": "Eʼtiqod ",
        "type": [],
        "definition": [
            "ishonch, ishonish; ko'ngilda tasdiqlash; imon, dildan e'tirof etish, qalbda tasdiqlash; ixlos."
        ]
    }
]