[
    {
        "word": "Fadak ",
        "type": [],
        "definition": [
            "Fadak – Xaybar yaqinidagi qadimiy qishloq. Fadak hozirda Saudiya Arabistonining Hoil mintaqasiga qaraydi. U bilan Madinaning orasi 280 km."
        ]
    },
    {
        "word": "Fadakcha toʻqim",
        "type": [],
        "definition": [
            "Fadakcha to'qim – Fadakdan keltirilgan, o'sha yerda tikilgan to'qim. Fadak Madinadan 2-3 marhala (88-132 km) uzoqlikda joylashgan"
        ]
    },
    {
        "word": "Fadoilul Qurʼan",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari"
        ]
    },
    {
        "word": "Fajr surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 30 oyatdan iborat.\r\n    Ushbu surai karimaning birinchi oyati o'ziga nom qilib olingan.\r\n    Bu sura Makka mushriklari musulmonlarni azoblab, dinga qarshilik qilib, Alloh taoloning aytganiga yurmay turgan bir paytda nozil bo'lgan. Alloh taolo suraning avvalida bir necha narsalar bilan qasam ichib, so'ngra qiyomat kuni albatta bo'lishini va unda har bir kishi bu dunyoda qilganiga yarasha mukofot yoki jazo olishini aytadi. Makka mushriklariga ulardan avval ham Od, Samud, Fir'avn qavmlariga o'xshashlar o'tib, osiylik qilganlari uchun oxir-oqibatda azobga duchor bo'lganlarini, vaqti kelganda ularning kuch-quvvatlari, mol-mulklari hech qanday foyda bermaganligini eslatadi.\r\n    Shu bilan birga, qadr-qiymatni, umuman, hamma narsani molu mulk bilan o'lchash ham xato ekani aytiladi. Mol-mulk insonga sinov uchun berilishi yoki berilmay qolishi ta'kidlanadi.\r\n    Qiyomatda hamma o'z qilmishiga yarasha mukofot yoki jazo olishi muqarrardir.\r\n    Mazkur ma'nolarning surada kelish tartibi quyidagicha:\r\n    Suraning boshida fajr, o'n kecha, juftu toq narsalar va yurgan tun bilan qasam ichiladi.\r\n    So'ngra Od, Samud va Fir'avn qissalari o'ziga xos uslubda va suraning siyoqiga mos ravishda eslatilib, ularning oqibatidan o'rnak olishga chaqiriladi.\r\n    Keyin esa Alloh taolo insonga uni sinash uchun ne'mat bersa, u o'zini qanday tutishi bayon qilinadi.\r\n    Suraning oxirida esa qiyomat kunining dahshatlari, undagi ba'zi voqealar, u kunda kofir insonning holi nima bo'ladi-yu, mo'min insonning holi nima bo'ladi – qisqa iboralar ila vasf qilinadi."
        ]
    },
    {
        "word": "Fazilat ",
        "type": [],
        "definition": [
            "Fazilat – boshqalardan afzal bo'lish. Ba'zilar 'fazila' so'zini jannatdagi bir maqom ham deyishgan."
        ]
    },
    {
        "word": "Fazix ",
        "type": [],
        "definition": [
            "Fazix – xamr turlaridan biri. U busr degan navli xurmo mevasini yorib, ichiga suv quyib, achitib tayyorlangan."
        ]
    },
    {
        "word": "Fazl ",
        "type": [],
        "definition": [
            "fazilat, daraja, yaxshilik"
        ]
    },
    {
        "word": "Fazl al-Barokadiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Abbos Fazl ibn Muhammad al-Barokadiy al-Buxoriy - Buxoroning Barokad qishlog'idan. Buhayr ibn Nazr, Muhammad ibn Sahl as-Samarqandiy va Ali ibn Ishoq al-Hanzaliydan hadis rivoyat qilganlar. O'zlaridan esa Abul Husayn Mansur ibn Solih ibn Hoshid ad-Dehqon hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Fazl as-Sulaymoniy al-Paykandiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Fazl ibn Abul Fazl as-Sulaymoniy al-Paykandiy - Abul Fazl Ahmad ibn Ali as-Sulaymoniy al-Hofiz al-Paykandiyning o'g'li. Paykand ahlidan. Bu kishi haqlarida Abul Abbos al-Mustag'firiy 'Tarixi Nasaf' kitoblarida aytadilar: 'Hijriy 405 (milodiy 1015) yilning ramazon oyida Nasafga keldilar. U kishi mendan hadis yozib oldilar va men ham u kishidan ikki hadis va bir hikoya yozib oldim'. Hijriy 413 (milodiy 1023) yilning rajab oyida Paykandda vafot etganlar."
        ]
    },
    {
        "word": "Fazl as-Sutikaniy",
        "type": [],
        "definition": [
            "Abu Zahhok Fazl ibn Hison as-Sutikaniy Buxoro ahlidan. Abu Hafs Ahmad ibn Hafs al-Kabir al-Buxoriy, Muhammad ibn Salom, Abdulloh ibn Noboj, Bujayr ibn Nazr va boshqalardan hadis rivoyat qilganlar. O'zlaridan esa Abu Ali Hasan ibn Shohavayh al-Hazzo hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Fazl ibn Abbos",
        "type": [],
        "definition": [
            "Fazl ibn Abbos ibn Abdulmuttalib Hoshimiy al-Qurashiy, kunyalari Abu Abdulloh bo'lib, pahlavon va botir sahobalardan biri edilar. Otalari Rasululloh sollallohu alayhi vasallamning amakilari Abbos, onalari Ummu Fazl Luboba binti Horis bo'lganlar.\r\n    Rasululloh sollallohu alayhi vasallam bilan birga Fath, Hunayn janglarida ishtirok etdilar.\r\n    Hajjatul Vado' kuni Rasululloh sollallohu alayhi vasallamning ortlariga mingashganlari uchun sahobalar u kishiga 'mingashuvchi' deb laqab qo'yishdi.\r\n    Hammasi bo'lib, Rasululloh sollallohu alayhi vasallamdan 24ta hadis rivoyat qildilar.\r\n    Bu kishidan inilari Abdulloh va Qusam, Ummu Fazlning qullari Umayr, Abu Muabbad, Abu Hurayra, Sulaymon ibn Yasor, Sha'biy, Ato ibn Raboh va boshqalar rivoyat qildilar. Bu zot to'plagan hadislarni uch 'Sahih' sohiblari o'z kitob¬lariga kiritganlar.\r\n    Fazl ibn Abbos Rasululloh sollallohu alayhi vasallamning vafotlaridan keyin mujohid bo'lgan holda Shomga qarab yo'l oldilar. Hijratning 13-yili Falastinda 'Ajnadiy' jangida shahid bo'ldilar."
        ]
    },
    {
        "word": "Fazlu Hiro",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari."
        ]
    },
    {
        "word": "Fay ",
        "type": [],
        "definition": [
            "Fay – jangsiz qo'lga kiritilgan o'lja."
        ]
    },
    {
        "word": "Fayz ",
        "type": [],
        "definition": [
            "Baraka"
        ]
    },
    {
        "word": "Faqih",
        "type": [],
        "definition": [
            "Shariat hukmlarini daqiq joylarigacha tushunuvchi olim"
        ]
    },
    {
        "word": "Falaq surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 5 oyatdan iborat.\r\n    Ushbu surai karimaga o'zining birinchi oyatidagi 'falaq' so'zi nom bo'lib qolgan. 'Falaq' so'zi lug'atda 'yorish' degan ma'noni bildiradi. Bu surada 'falaq' so'zi 'subh', ya'ni 'tong' ma'nosida kelgan. Tong kechani yorib boshlangani uchun shu nom bilan ham ataladi.\r\n    Bu surai karimada Alloh taolo Muhammad sollallohu alayhi vasallamni va musulmonlarni barcha yomonliklar, xavf-xatarlardan O'zidan (Allohdan) panoh tilashga undaydi. Alloh taolo ularga O'z himoyasini e'lon qiladi va xuddi 'Mening himoyamga marhamat, tinch-omon joyga marhamat', degandek bo'ladi."
        ]
    },
    {
        "word": "Fallos ",
        "type": [],
        "definition": [
            "arabcha so'z bo'lib, mayda tanga (chaqa) bilan savdo qiluvchi degan ma'noni anglatadi."
        ]
    },
    {
        "word": "Falsafatut tavhid av ashraful maqosid",
        "type": [],
        "definition": [
            "Ahmad Ibn Muhammad ibn Muhammad al-Valaliy al-Miknosiyning kitoblari"
        ]
    },
    {
        "word": "Faraq ",
        "type": [],
        "definition": [
            "8,250 litr. Og'irligi = 6,528 kg.(Misdan yasalgan idish bo'lib, ichiga 2 makkuk = 3 so' = 6 qist = 8 mann = 12 mudd = 12 katta hovuch miqdori = 16 iroqiy ratl sig'adi).\r\n    Faraq – o'n olti ratl (olti yarim litrdan ko'proq) suv sig'adigan mis idish"
        ]
    },
    {
        "word": "Farat ",
        "type": [],
        "definition": [
            "'Farat' deb lashkardan oldin borib, ularning kelishiga dam oladigan joy tayyorlab turuvchiga aytiladi."
        ]
    },
    {
        "word": "Faraxsh ",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan bo'lib, Buxorodan to'rt farsax uzoqlikda joylashgan. Jondor tumanidagi Varaxsha qishlog'i."
        ]
    },
    {
        "word": "Faraʼ ",
        "type": [],
        "definition": [
            "Fara' – tuyaning birinchi bolasi bo'lib, johiliyatda uni olihalarga atab so'yishar edi. Johiliyat arablari yana rajab oyining o'ninchi kuni ham ibodat ma'nosida tuya so'yishar va ularini 'atira' deb atashardi."
        ]
    },
    {
        "word": "Fard ",
        "type": [],
        "definition": [
            "yakka, yolg'iz"
        ]
    },
    {
        "word": "Farz ",
        "type": [],
        "definition": [
            "Shariat jazm ila, shubhasiz va qat'iy dalil bilan talab qilgan ish farzdir"
        ]
    },
    {
        "word": "Farinom al-Barfashxiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Hotam Farinom ibn Jamohir al-Barfashxiy al-Buxoriy - Buxoroning Barfashx nomli qishlog'idan bo'lib, Abdulloh as-Sibadmuniy al-Ustozning shayxlaridan edilar."
        ]
    },
    {
        "word": "Farruj",
        "type": [],
        "definition": [
            "'Farruj' – oldi ochiq yaktakka o'xshash kiyim. Nabiy sollallohu alayhi vasallamga turli o'lka va diyorlardan kiyimlar hadya qilingan. Uncha ko'p bo'lmasa ham shunga o'xshash ba'zi hadyalar bo'lgan. Misr, Yaman va habashistondan hadya qilingan kiyimlarni kiyganlari ma'lum."
        ]
    },
    {
        "word": "Farsax ",
        "type": [],
        "definition": [
            "O'lchov birligi - 5544 metr."
        ]
    },
    {
        "word": "Farʼiy hukmlar",
        "type": [],
        "definition": [
            "lug'atda asliyni teskarisi, ya'ni shoxobcha, kichik ahamiyatli, desak ham bo'ladi. Shariatda esa, ibodat va muomalotlarni o'z ichiga oluvchi hukmlar far'iy hukmlardir."
        ]
    },
    {
        "word": "Fasih ",
        "type": [],
        "definition": [
            "ochiq-oydin, ravshan, aniq, burro."
        ]
    },
    {
        "word": "Fatavoi hanafiya",
        "type": [],
        "definition": [
            "Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhi bu kitobni Hirotda hijriy 759 yilda yozishga kirishgan. U kishi Hirotda o'zi chiqargan fatvolarni jamlab, ushbu kitobga joylagan."
        ]
    },
    {
        "word": "Fataxa ",
        "type": [],
        "definition": [
            "'Fataxa' – qo'l yoki oyoqqa taqiladigan ko'zsiz uzuk."
        ]
    },
    {
        "word": "Fatvo ",
        "type": [],
        "definition": [
            "tushuntirish, izoh, hukm; diniy ulamolar tomonidan shariat masalalariga tegishli chiqarilgan qaror."
        ]
    },
    {
        "word": "Fatxa",
        "type": [],
        "definition": [
            "Fatxa – ko'zsiz tilla yoki kumush uzuk. 'Fataxa' ham deyiladi."
        ]
    },
    {
        "word": "Fath surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 29 oyatdan iborat.\r\n    Bu surai karima hijratning oltinchi yili Nabiy alayhissalom Hudaybiya sulhidan qaytib kelayotgan paytlari, Makkai Mukarrama bilan Madinai Munavvara orasidagi yo'lda, kechasi nozil bo'lgan. Ushbu muborak sura bevosita Hudaybiya sulhiga bag'ishlangan. Shuning uchun bu sulhning tarixini, bo'lib o'tgan voqealarini, haqiqiy voqe'ligini yaxshi bilib olsak, sura oyatlarini ham yanada yaxshiroq tushunishimizga yordam beradi.\r\n    Ma'lumki, Makkai Mukarrama, Baytulloh Islomdan avval ham barcha arablarning e'tiborini o'ziga tortgan, e'zoziga sazovor bo'lgan shahar va ibodat dargohi edi. Ibrohim alayhissalom davrlaridan buyon har yili u yerda haj qilar edilar. Hamma u yerni hurmat qilar, ulug'lar, u yerga kirgan har bir inson omonda bo'lar, unga hech kim tegmas edi. Hattoki o'zining eng katta dushmanini u yerda uchratib qolgan kishi ham unga qarshi qo'l ko'tarmas edi. Hamma Baytullohning ishqida yashar, uni bir bor tavof qilishni umrining gultoji deb bilardi.\r\n    Ammo Nabiy alayhissalomning hijratlaridan so'ng musulmonlar bunday baxtdan mahrum bo'lib qoldilar. Quraysh arablari musulmonlarning Baytullohni ziyorat qilishlariga to'sqinlik qilar, ularga tavof uchun ruxsat berishmas edi.\r\n    Tarixda misli ko'rilmagan jur'at edi bu. Chunki o'sha paytgacha hech kim hech kimni Allohning Uyidan to'smagan edi. Birorta inson uchun to'silmagan bu yo'l musulmonlar uchun to'sib qo'yildi. Yolg'iz ular bu ulkan baxtdan mahrum qilindilar. Albatta, musulmonlar bu adolatsizlikdan qattiq iztirobga tushar, dardu alam chekar edilar. Ular Makkai Mukarramani sog'inib, Ka'batullohga ishtiyoqlari ortib, firoq alamida yashardilar... Shu zaylda olti yil o'tdi.\r\n    Bir kuni sahobai kiromlar to'planib o'tirgan edilar, huzurlariga Rasululloh alayhissolatu vassalom keldilar va ularga tushlarida hammalari sochlarini oldirgan holda, eminlikda, qo'rqinchsiz Masjidul Haromga kirib borayotganlarini ko'rganlarini aytdilar. Hamma bu bashoratdan xursand bo'ldi.\r\n    Hijratning oltinchi yili zulqa'da oyining boshida umrani niyat qilib, safarga chiqdilar. Nabiy alayhissalom Madina ahli va atrofdagi a'robiy qabilalarning ham birga chiqishlarini so'radilar. Ko'pchilik bo'lib borishni yaxshi deb topdilar, chunki Qurayshga ishonib bo'lmas, ular Nabiy alayhissalomning yo'llarini to'sishlari yoki qarshi urush ochishlari ham mumkin edi. Ahli Madina Muhammad alayhissalomning so'rovlariga javob berib, birgalikda Makka yo'lini tutdilar. Ammo atrofdagi a'robiy qabilalar 'Baribir qurayshiylar musulmonlarni tor-mor qilib, qirib tashlaydi', degan fikrga borib, safarga chiqmadilar.\r\n    Shunday qilib, Nabiy alayhissalom bilan birga muhojir va ansoriy musulmonlar, madinalik arablar – hammasi bo'lib, bir ming to'rt yuz kishi umraga chiqdi. Niyat sof ekanini, urush emas, umraga – ibodatga ketayotganlarini elu yurtga bildirish uchun ehrom bog'lab, qurbonlikka so'yadigan hayvonlarini ham oldilariga solib oldilar.\r\n    Shu alfozda Asafon deb atalgan joyga yetganlarida, Bishr ibn Sufyon Ka'biy ismli kishi yo'liqdi va: 'Ey Allohning Rasuli, Quraysh sizning yo'lga otlanganingizni eshitib, yoshu qari – hammasi yo'lbars terilarini kiyib, Zu Tuvo degan joyda sizni Makkaga abadiy kiritmaslikka Allohga qasam ichmoqdalar. Xolid ibn Validni otliqlarga bosh qilib, Quro'ul G'omiym degan joyga yuborishdi', – dedi.\r\n    Nabiy alayhissalom: 'Qurib ketsin o'sha Quraysh! Urush ularning boshini yeydi. Men bilan boshqa arablarni tek qo'yishsa bo'lmasmidi?! Agar ular menga g'olib kelishsa, Qurayshning orzusi ro'yobga chiqardi. Agar Alloh meni g'olib qilsa, hammalari Islomga kirishardi. Bunday qilishmasa, kuchliroq bo'lib olib, urushga kirishardi. Quraysh nimani o'ylayapti o'zi?! Allohga qasamki, din yo'lida Alloh uni ustun qilguncha jihod qilaman yoki halok bo'laman, – dedilar. So'ngra: – Menga ularga eltadigan boshqa yo'lni ko'rsatadigan odam bormi?' – deb so'radilar.\r\n    Aslam qabilasiga mansub bir kishi: 'Men, ey Allohning Rasuli', dedi va tepaliklar orasidagi notekis, toshlari ko'p yo'lga boshladi. U yo'ldan chiqqanlaridan so'ng, vodiyga tutash tekis yo'lga duch keldilar. Avvalgi yo'lni yoqtirmay turgan Nabiy alayhissalom odamlarga: 'Nastag'firulloha va natubi ilayhi' ('Allohga istig'for aytamiz va Unga tavba qilamiz'), deb aytinglar, – dedilar. Odamlar aytishdi. Rasululloh alayhissalom: – Bu Banu Isroilga arz qilingan 'hutti' edi, ammo aytmadilar', – dedilar.\r\n    Nabiy alayhissalom odamlarga: 'O'ng tomondan Hamash orqali Makkaning pastki tarafidagi Hudaybiya pastligi tomonga yuringlar', – dedilar. Odamlar o'sha yo'ldan yurishdi. Musulmonlar izidan ko'tarilgan changni ko'rgan Quraysh otliqlari yo'llarini o'zgartirib, o'z qabiladoshlari huzuriga ot choptirib, qaytdilar. Nabiy alayhissalom yo'lni to'g'rilab, olg'a yurishni boshlagan edilar, tuyalari cho'k tushib, yurmay, yotib oldi. Odamlar 'Tuya yotib oldi', degan gap tarqatishdi. Rasululloh alayhissalom:\r\n    – Yotib olgani yo'q, uning bunday odati yo'q edi, lekin uni Makkada filni tutgan narsa tutib qoldi, Quraysh bugun mendan silai rahm haqida nimani so'rasa, beraman, – dedilar. So'ngra tuyalarini boshqa tarafga burib, niqtagan edilar, sakrab turib, yurib ketdi. Yurib borib, Hudaybiyaning chetiga tushdilar. Odamlarga: – Tushib, joylashinglar, – dedilar. Ular:\r\n    – Ey Allohning Rasuli, hech qayerda suv yo'q-ku, qanday qilib joylashamiz? – dedilar. Shunda u zot sahobalardan birlariga o'qdonlaridan bir kamon o'qini chiqarib berdilar. U kishi o'qni ko'lmak suv to'planadigan joylardan biriga sanchib qo'ygan edi, suv otilib chiqa boshladi.\r\n    Rasululloh alayhissalom joylashib-o'rnashib bo'lganlaridan so'ng, Badiyl ibn Varqo Xuzo'iy o'zining bir necha qabiladoshlari hamrohligida keldi. Nabiy alayhissalom bilan so'zlashib:\r\n    – Nima uchun keldinglar? – deb so'radi. Rasuli Akram sollallohu alayhi vasallam urush uchun kelmaganliklarini, Baytullohning ziyoratiga, uni ulug'lab kelganliklarini ta'kidladilar. Elchilar Quraysh huzuriga qaytib bordilar. Va: – Ey qurayshiylar, sizlar Muhammad xususida shoshilyapsizlar, u urush uchun kelgani yo'q, Baytullohning ziyoratiga kelgan, – dedilar. Quraysh esa elchilarini tuhmat qilib, haydashdi. So'ng:\r\n    – Agar urushni xohlamay kelgan bo'lsa ham, Allohga qasamki, u bizni bosib o'tib, (Makkaga) kirmaydi, arablar ichida gapga qolishni xohlamaymiz, – deyishdi.\r\n    Keyin Maqriz ibn Hafsni yuborishdi. Nabiy alayhissalom uni ko'rishlari bilan: 'Bu yolg'onchi odam', – dedilar. U Rasulullohning huzurlariga kelib, so'zlashdi, unga ham Badiyl ibn Varqoga aytgan gaplarini aytdilar. Maqriz Quraysh huzuriga qaytib borib, xabarni yetkazdi.\r\n    So'ngra Hulays ibn Alqamani yuborishdi. Payg'ambar alayhissalom uni ko'rishlari bilan: 'Bu ibodat qiladigan qavmdan ekan, qurbonlikka keltirilgan hayvonlarni unga qarab haydanglar, ko'rib qo'ysin', – dedilar. Hayvonlar ko'p kutib yotganidan junlari to'kila boshlagan edi. Hulays bo'yniga belgi osilgan, qurbonlikka atalgan hayvonlarning vodiyni to'ldirib, o'zi tomon oqib kela boshlaganini ko'rgach, Nabiy alayhissalomga yetib bormasdanoq, orqasiga qaytdi va ko'rganlarini ularga aytdi. Qurayshliklar unga:\r\n    – O'tir, sen sahroliksan, biliming yo'q, – deyishdi. Shunda Hulaysning jahli chiqdi va:\r\n    – Ey Quraysh odamlari, Allohga qasamki, sizlar bilan bunga ittifoq tuzmagan edik, ahdlashmagan edik. Baytullohni ulug'lab kelgan odamning ham yo'li to'siladimi? Allohga qasamki, yoki Muhammadning yo'lini ochib qo'yasizlar, yoki qavmim bilan sizlarga qarshi urush ochaman! – dedi. Ular:\r\n    – Jim bo'l! Bizdan nari tur, o'zimiz nima xohlasak, shuni qilamiz, – deyishdi.\r\n    So'ngra Rasululloh alayhissolatu vassalomning huzurlariga Urva ibn Ma'sud Saqafiyni yuborishdi. U jo'nashdan oldin:\r\n    – Ey Quraysh odamlari, ko'rib turibmanki, kimni Muhammadning oldiga yuborsangiz, qaytib kelganidan keyin unga yomon so'zlarni aytib, qo'pol muomala qilyapsizlar. Meni yaxshi bilasizlar, sizlar ota bo'lsangiz, men bolangizman. Tashvishingizni eshitib, o'zimga ergashganlarni to'plab keldim, – dedi. Ular:\r\n    – To'g'ri aytasan, senga tuhmat qiladigan joyimiz yo'q, – deyishdi. Keyin u yerdan chiqib, Nabiy alayhissalomning oldilariga keldi va: – Ey Muhammad! Turli-tuman odamlarni to'plab, o'zingning tuxumingni sindirgani olib keldingmi?! Quraysh ham yoshu qarisiga yo'lbars terisini kiydirib, olib chiqibdi. Allohga qasamki, anavilar ertaga seni tashlab, qochib qolishadimi, deb turibman, – dedi. Hazrati Abu Bakr Nabiy alayhissalomning orqalarida o'tirgan edilar. Urvani bo'ralab so'kdilar va:\r\n    – Biz uni tashlab, qochar ekanmizmi?! – dedilar. Urva:\r\n    – Bu kim, ey Muhammad? – dedi. Rasululloh:\r\n    – Abu Quhofaning o'g'li, – dedilar. So'ngra unga ham avvalgilarga aytganlarini aytib, urush uchun kelmaganliklarini bildirdilar. Urva Rasulullohning huzurlarida u zotga sahobalar qanday munosabatda bo'layotganlarini ko'rdi. Tahorat qilsalar, suvni yerga tushirmasdan, ilib olishardi. Sochlaridan biror tola tushsa ham, talashib ketishar edi. Bas, u Qurayshning huzuriga qaytib borib:\r\n    – Ey Quraysh odamlari, Kisroni o'z mulkida ko'rdim, Qaysarni ham o'z mulkida ko'rdim, Najoshiyni ham o'z mulkida ko'rdim. Lekin, qasamki, hech bir podshohni o'z qavmida Muhammadni sahobalarining ichida ko'rganimdek ko'rmaganman. Menimcha, ular uni hech narsaga almashmaydilar. Bilganingizni qiling, – dedi.\r\n    Nabiy alayhissalom ham o'z navbatlarida Xirosh ibn Umayya Xuzo'iyni Sa'lab nomli tuyaga mindirib, Makkaga – Quraysh huzuriga elchi qilib yubordilar. Lekin qurayshliklar tuyani so'yishdi. Elchini ham o'ldirmoqchi bo'lishgan edi, habashistonliklar qutqarib qolishdi. So'ng uni Nabiy alayhissalomning huzurlariga qaytarib yuborishdi.\r\n    Qurayshliklar qirq-ellik kishini Rasulullohning odamlari turgan joyga yuborib, birorta sahobaga yomonlik qilishga buyurdilar. Hech kim ig'voga uchmadi. Ularni tutib, olib kelishgan edi, Rasululloh alayhissolatu vassalom qo'yib yubordilar.\r\n    So'ng Umar ibn Xattob roziyallohu anhuni chaqirib, kelishlarining sabablari haqidagi xabarni Quraysh boshliqlariga yetkazishni topshirmoqchi edilar, u kishi:\r\n    'Ey Allohning Rasuli, men Qurayshdan qo'rqaman, Makkada meni himoya qiladigan hech kim yo'q, Qurayshga bo'lgan adovatim, qattiqqo'lligim hammaga ayon. Mendan ko'ra Usmon ibn Affon borsa, yaxshi bo'lardi', – dedilar.\r\n    Nabiy alayhissalom hazrati Usmonni chaqirib, Abu Sufyon va Qurayshning boshqa boshliqlariga borib, urush uchun kelmaganliklarini, balki Baytullohni hurmatlab, uni ziyorat qilish uchun kelganliklarining xabarini yetkazishni topshirdilar.\r\n    Makkaga kiraverishlarida hazrati Usmonni Abon ibn Sa'iyd kutib oldi va u kishiga homiy ekanini e'lon qildi. Hazrati Usmon borib, Abu Sufyon va Qurayshning boshqa boshliqlariga Rasululloh alayhissalomning gaplarini yetkazdilar. U kishi gapni tugatib bo'lganlaridan so'ng:\r\n    – Agar Baytullohni tavof qilmoqchi bo'lsang, qilib ol, – deyishdi. Hazrati Usmon:\r\n    – Rasululloh tavof qilmay turib, men hech ham tavof qilmayman, – dedilar. Qurayshliklar u kishini tutib qolishdi. Nabiy alayhissalomga va musulmonlarga 'Usmon o'ldirilibdi' degan gap yetib bordi.\r\n    Bu xabar Rasululloh alayhissalomga yetganda, 'Bu qavm bilan oxiri to'qnashar ekanmiz-da', – dedilar va kishilarni bay'atga chaqirdilar. Hamma sahobalar daraxt ostida turib, qo'llarini Rasuli Akramning qo'llariga qo'yib, o'limga ham tayyor ekanliklari haqida bay'at qildilar. Bu bay'at 'Rizvon', ya'ni 'Rozilik bay'ati' nomi ila mashhur bo'ldi. Chunki Alloh taolo o'sha daraxt ostida Payg'ambarga kim bay'at qilgan bo'lsa, hammasidan rozi ekanini e'lon qildi.\r\n    Faqat bir kishi – Jadd ibn Qaysgina bay'atda qatnashmadi. Ammo kishilarning g'azabidan qo'rqib, tuyasining ortida yashirinib turdi. Hazrati Usmon uchun Nabiy alayhissalomning o'zlari bir qo'llarini ikkinchisiga qo'yib, bay'at qildilar. Keyin esa hazrati Usmonning o'ldirilganligi bekor gap ekanining xabari keldi.\r\n    So'ngra Quraysh Nabiy alayhissalomning huzurlariga Suhayl ibn Amrni yubordi, unga: 'Sen borib, Muhammad bilan sulh tuz, sulhda bu yil bizning ustimizga (Makkaga) kirmay, qaytib ketishi albatta (yozilgan) bo'lsin, yana, arablar bizning ustimizga kuch ishlatib kirdi, deb gapirishmasin', – dedilar.\r\n    Nabiy alayhissalom Suhayl ibn Amrning kelayotganini ko'rganlarida: 'Alloh ishimizni yengillashtiradiganga o'xshaydi, – dedilar ('Suhayl' so'zi lug'aviy jihatdan 'oson', 'yengil' degan ma'nolarni anglatadi). Yana: – Ular bu odamni yuborishlaridan, sulh tuzishmoqchi shekilli', – dedilar. Suhayl Rasuli Akramning huzurlariga kelib, uzoq gaplashdi, ular tortishdilar va oxiri sulh tuzildi.\r\n    Ish oxiriga yetib, faqat sulhni yozishgina qolganda, Umar ibn Xattob o'rinlaridan sakrab turdilar va Abu Bakrning oldiga kelib:\r\n    – U kishi Rasululloh emasmilar?! – dedilar. Abu Bakr:\r\n    – Albatta, Rasulullohlar! – dedilar. Umar:\r\n    – Biz musulmonmizmi?! – dedilar. Abu Bakr:\r\n    – Albatta, – dedilar. Umar:\r\n    – Ular mushrikmi?! – dedilar. Abu Bakr:\r\n    – Albatta, – dedilar. Umar:\r\n    – Unda nima uchun dinimizni pastkashlikka almashtiramiz?! – dedilar. Abu Bakr:\r\n    – Ey Umar, u kishi, albatta, Allohning Rasulidirlar, – dedilar. Umar:\r\n    – Men ham shahodat keltiraman, u kishi, albatta, Allohning Rasulidirlar, – dedilar. So'ngra hazrati Umar Rasuli Akram alayhissolatu vasalomning oldilariga bordilar va:\r\n    – Ey Allohning Rasuli, siz Allohning Rasulimisiz?! – dedilar. U kishi:\r\n    – Albatta, – dedilar. Umar:\r\n    – Biz musulmonmizmi?! – dedilar. Ul zot:\r\n    – Albatta, – dedilar. Umar:\r\n    – Ular mushriklarmi?! – dedilar. Ul zot alayhissalom:\r\n    – Albatta, – dedilar. Umar:\r\n    – Unda nima uchun dinimizni pastkashlikka almashtiramiz?! – dedilar. Rasuli Akram alayhissalom:\r\n    – Men Allohning bandasi va elchisiman, Uning buyrug'iga hech-hech xilof qilmayman va U ham meni aslo zoye qilmaydi, – dedilar.\r\n    Keyinchalik hazrati Umar: 'O'sha paytda, bu qilganim yaxshi bo'lsa kerak, deb shunday qilgan edim. Keyin aytgan gaplarimdan qo'rqib, tinmay, sadaqa qilib, ro'za tutib, namoz o'qib, qul ozod qilib yurdim', – der edilar.\r\n    Sulhni yozish uchun Nabiy alayhissalom hazrati Ali ibn Abu Tolibni chaqirdilar va:\r\n    – 'Bismillahir Rohmanir Rohiym', deb yoz, – dedilar. Suhayl:\r\n    – Men bunaqa gapni bilmayman, 'Bismikaallohumma' deb yoz, – dedi. Rasululloh alayhissalom:\r\n    – 'Bismikaallohumma' deb yoz, – dedilar. Hazrati Ali yozdilar. So'ngra u zot:\r\n    – Yoz: 'Bu Allohning Rasuli Muhammad va Suhayl ibn Amr tuzgan sulh...' Shunda Suhayl:\r\n    – Agar seni Allohning Rasuli deb shahodat berganimda, sen bilan urushmas edim. Shuning uchun ismingni va otangning ismini yozdir, – dedi. Nabiy alayhissalom:\r\n    – Yoz: 'Bu Muhammad ibn Abdulloh va Suhayl ibn Amr tuzgan sulh...' – dedilar. Shu tariqa ular quyidagilarga kelishdilar:\r\n    1. O'n yilgacha urush bo'lmaydi. Odamlar omonda bo'lib, bir-birlariga yomonlik qilishdan tiyiladilar.\r\n    2. Kimki Qurayshdan Muhammadning oldiga kelsa, uni qaytarib beradi.\r\n    3. Kimki Muhammadning oldidan Qurayshga kelsa, qaytarib berilmaydi.\r\n    4. Kim Muhammad bilan ahdnoma tuzib, sherik bo'lsa, bo'laveradi.\r\n    5. Kim Quraysh bilan ahdnoma tuzib, sherik bo'lsa, bo'laveradi.\r\n    6. Bu yil Muhammad va sahobalari Makkaga kirmay, qaytib ketadilar.\r\n    7. Kelasi yili kelib, qilichlarini qinida saqlagan holda kiradilar, uch kun turadilar, bu vaqtda mushriklar Makkadan chiqib turishadi.\r\n    Ushbularni yozib turishganida, Suhayl ibn Amrning musulmon bo'lgan o'g'li Abu Jandal kishanlarini sudrab, qochib kelib qoldi. Suhayl o'g'li Abu Jandalni ko'rib, oldiga bordi-da, yuziga tarsaki tushirib, yoqasidan sudradi. So'ngra:\r\n    – Ey Muhammad, mana bu sulhni tuzib bo'lganimizdan keyin keldi, – dedi. Nabiy alayhissalom:\r\n    – To'g'ri aytding, – dedilar.\r\n    Suhayl Abu Jandalni yoqasidan bo'g'ib, sudrab, Qurayshga qaytarib olib keta boshladi. Shunda Abu Jandal bor ovozi bilan:\r\n    – Hoy musulmonlar! Mushriklarga qaytarilamanmi?! O'z dinimda fitnaga uchraymanmi?! – deb baqira boshladi. Bu esa sahobalarning dardiga dard, alamiga alam qo'shdi. Chunki sahobalar Nabiy alayhissalomning ko'rgan tushlaridan bashorat olib, Makkani albatta fath etishlariga hech shubha qilmay, kelgan edilar. Sulh tuzilib, qaytib ketish haqida gap chiqqanda esa ularni og'ir qayg'u bosdi, go'yoki, o'zlarini halokatga uchragan bilan barobar his qilishayotgan edi. Shunda Rasululloh alayhissalom:\r\n    – Ey Abu Jandal, sabr qil, savob olasan. Albatta, Alloh senga va senga o'xshash zaiflarga kenglik beradi. Biz qavm bilan sulh tuzdik. Ularga Allohning nomi ila ahd berdik va ular ham ahd berdilar. Biz ularga bergan ahdimizga xiyonat qilmaymiz, – dedilar.\r\n    Hazrati Umar ibn Xattob o'rinlaridan sakrab turdilar va Abu Jandalning yaqiniga borib, yonida yurib turib:\r\n    – Ey Abu Jandal, sabr qil, baribir ular mushriklar, ularning qoni itning qoni bilan barobar, – derdilar va qilichlarining sopini uning qo'liga yaqinlashtirar edilar.\r\n    Keyinchalik hazrati Umar: 'Qilichni olib, otasini solarmikan, degan edim', – deganlar. Lekin Abu Jandal unday qilmadi. Sulhga amal qilindi.\r\n    Sulh matni yozib bo'lingach, Nabiy alayhissalom sahobalarga:\r\n    – Endi turib, qurbonlikni so'yib, sochlaringizni oldiringlar, – dedilar. Biror kishi qimir etmadi. Rasuli Akram alayhissolatu vassallom haligi buyruqni uch marta takrorladilar. Hech kim qimirlab ham qo'ymadi. Shunda Nabiy alayhissalom fig'onlari falakka chiqib, chodirlariga, Ummu Salama onamizning oldilariga kirdilar va: – Bu qavm halok bo'ladi, bulardan oldin o'tganlar ham o'z payg'ambarlariga bo'ysunmay, halok bo'lishgan edi, – dedilar. Odamlarning sarkashliklarini, adashayotganliklarini gapirib berdilar. Ummu Salama onamiz u zotni ochiq chehra, muloyimlik bilan kutib olgan edilar. So'zlarini xotirjamlik bilan tingladilar va:\r\n    – Ey Allohning Rasuli, o'zingiz bilasiz, sahobalaringiz Makkai Mukarramani nihoyatda sevadilar, ko'pdan buyon ziyorat qila olishgani yo'q. Hozir hammalari ziyorat eta olishlariga to'la ishonib turgan edilar, Ka'bani tavof qilmasdan, qaytish ular uchun juda ham og'ir. Agar siz ko'zlagan ishingizni qilishingiz zarur bo'lsa, chiqing-da, ulardan birortasiga bir og'iz ham so'z aytmasdan, atagan tuyangizni so'ying, so'ngra sartaroshingizni chaqiring, sochingizni olsin, hammasi joyiga tushadi, – dedilar.\r\n    Rasuli Akram alayhissolatu vassalom atagan tuyalarini o'z qo'llari bilan so'ydilar. So'ngra sartaroshlarini chaqirdilar, sochlarini oldi. Buni ko'rgan sahobai kiromlar ham birin-ketin turib, qurbonliklarini so'yib, bir-birlarining sochlarini ola boshladilar.\r\n    Keyin Rasululloh alayhissalom ortlariga qaytib yura boshladilar, hamma qaytdi. Quro'ul G'omiym nomli joyga yetganlarida, bir oz to'xtadilar, odamlar u zotning atroflariga shoshib kela boshladilar, ko'pchilik to'planib bo'lganidan so'ng ulovlari ustida o'tirgan hollarida 'Inna fatahna laka fathan mubiynan...' deb, Fath surasining avvalini o'qidilar. Shunda sahobalardan biri:\r\n    – Ey Allohning Rasuli, bu fathmi? – deb so'radi. Payg'ambarimiz Muhammad alayhissalom:\r\n    – Ha, mening nafsim qo'lida bo'lgan Zot ila qasamki, albatta, bu fathdir, – dedilar.\r\n    Imom Buxoriy va boshqa muhaddislarimiz rivoyat qilgan hadislardan birida hazrati Umar roziyallohu anhu aytadilar:\r\n    'Safarlardan birida Nabiy alayhissalomdan bir narsani uch marta so'radim, u kishi javob bermadilar, shunda men o'zimcha, 'Onang o'lsin, Umar, surbetlik qilding, bir narsani Rasulullohdan uch marta so'rading, senga javob bermadilar', dedim-da, ulovimni minib, niqtab, ilgari yurib ketdim. Men haqimda oyat nozil bo'lib qolmasaydi, deb qo'rqib borar edim. Birdan bir kishi:\r\n    – Ey Umar! – deb chaqirib qoldi. Men haqimda biror oyat nozil bo'lganga o'xshaydi, deb orqamga qaytdim. Borsam, Rasuli Akram sollallohu alayhi vasallam:\r\n    – Bugun menga bir sura nozil bo'ldiki, u men uchun dunyo va undagi barcha narsalardan ko'ra suyukliroqdir, – deb, 'Inna fatahna laka fathan mubiynan…'ni o'qib berdilar.\r\n    Bundan avval kelgan Muhammad surasi nozil bo'lganidan keyin uch yil muddat o'tib, Fath surasi nozil bo'ldi. Ikki surani birin-ketin o'qib, oradagi farq qanchalik ekanini bilib olish mumkin.\r\n    Fath surasi madaniy suralardan bo'lgani uchun boshqa madaniy suralar kabi, shariat hukmlari, munofiqlar va boshqa o'ziga xos mavzularni o'z ichiga olgan. Surada Allohning yo'lida kurashish, Allohning yordami doimo payg'ambarlarga bo'lishi, munofiqlarning ikkiyuzlamachiligi, xoinligi, mo'minlarning yaxshi sifatlari zikr qilinadi.\r\n    Avvallari mushriklar Payg'ambarimizga va musulmonlarga qarshi murosasiz, shafqatsiz urush olib borar edilar. Ammo Hudaybiya sulhidan so'ng ular Islom davlatini so'zsiz tan oldilar. Musulmonlar erkinlik bilan xohlagan taraflariga borib, kishilarni o'z dinlariga da'vat qilish huquqiga ega bo'ldilar. Alloh taolo Hudaybiya sulhini 'Fath' deb hisobladi. Haqiqatan ham, u ulkan fath edi. Bu surada Alloh taolo O'zining mahbub Payg'ambari Muhammad alayhissalomning ikki dunyoda ko'zlarini quvonchga to'ldiradigan narsani berdi. U zotning avvalu oxir, qilgan-qilmagan barcha gunohlarini kechirganini e'lon qildi.\r\n    G'alaba, nusratning haqiqiysi Alloh tomonidan bo'ladi. Bu surada Alloh mo'minlarning qalblariga tinchlikni solib qo'yganining xabarini berdi. Shu bilan birga, ularni hech narsadan qo'rqmasdan, Allohning yo'lida kurashishga chaqirdi.\r\n    Kofirlar bilan mo'minlar orasida beqaror bo'lib yashovchi munofiqlarning, agar mo'minlarga nusrat yor bo'lsa, 'Sizlar bilan birga edik', deyishlari, kofirlar g'olib kelishsa, 'Aslida siz bilan edik, musulmonlarning yo'lini to'sishda bizning ham hissamiz bor', deya munofiqlik qilishlari ham shu surada keltirilgan.\r\n    Munofiqlar, aslida, qo'rqoq shaxslar bo'lib, har narsadan cho'chiyveradilar. Ular Nabiy alayhissalom bilan Makkaga borishdan ham bosh tortishdi. Ularning hammasi qirilib ketadi, deb gap tarqatishdi. Alloh ularning gumonlarini o'zlariga qaytardi. Nabiy alayhissalom va sahobalar Allohning nusrati ila muzaffar bo'lib, fathga erishgan hollarida Madinaga qaytdilar. Shunda munofiqlar bormaganlariga afsus-nadomat e'lon qilishgan edi, Alloh ularga yana boshqa urushda qatnashish imkoni borligini bildirib, Fath surasida oyatlar nozil qildi.\r\n    Mo'minlar Allohga bergan ahdu paymonlariga sodiq qolgan edilar, Alloh taolo ularning bu sadoqatlarini munosib taqdirladi. Rasuli Akram alayhissalom bilan Hudaybiyaga bir ming to'rt yuz kishi faqat qinga solingan qilich bilan chiqishdi. Lekin vaqti kelib, dushman xavf solib, urush ehtimoli kuchayganida, jangga otlanishga da'vat qilinganlarida, hammalari begona yurtda, noqulay holatda, qurollari kam bo'lishiga qaramay, Alloh yo'lida jon fido qilishga tayyor ekanliklarini bildirib, Rasululloh alayhissalomga bay'at qildilar. Shunda Alloh taolo ularni yomonlikdan saqlab qoldi, O'zining ulardan roziligini e'lon qildi hamda musulmonlarga g'alabani yor qildi.\r\n    Bu surada Alloh taoloning O'z bandalariga qanchalik lutf etishi qayta-qayta namoyon bo'ladi. Mushriklar Makkai Mukarramaga ibodatga – umrani ado etishga kelgan Rasuli Akram sollallohu alayhi vasallam va sahobai kiromlarning yo'llarini to'sdilar. Holbuki, Ka'ba Allohniki edi, o'shangacha hech kimning yo'li to'silmagandi. Makka mushriklari Baytullohning ziyoratiga ehrom kiyib kelgan sof niyatli kishilarning yo'lini to'sdilar. Agar Makkaning ichida zaifhol kishilar bo'lmaganida, Alloh taolo musulmonlarga mushriklar bilan urush qilishga ruxsat berar edi va sarkash Makka mushriklarini ularning qo'li bilan azoblar edi. Ammo haligi zaifhol kishilarga rahm qilib, bunga izn bermaganini ham Alloh taolo ushbu surada eslatib o'tadi. Payg'ambarning tushlari – vahiy. Muhammad alayhissalom tushlarida Makkai Mukarramaga umra qilib borganlarini ko'rib, sahobalarni umraga chorladilar, barchalari safarga otlandilar. Surada ana o'sha tush o'ngidan kelib, kelasi yili hammalari umra qilishlari ham bayon qilinadi.\r\n    Fath surasida ulug' insonlar – sahobai kiromlarning sifatlari keltiriladi. Ular bir-birlariga nihoyatda rahmdil, dushmanlarga nisbatan esa shiddatlidirlar, ulardan mutlaqo qo'rqmaydilar. Surada sahobalarning sifatlari Tavrotda ham, buzilmagan Injilda ham keltirilganligi zikr etiladi. Bu ulug' insonlarning qilgan ibodatlari ta'sirini ularning yuzlaridan ham bilib olsa bo'ladi.\r\n    Suraning oxirida Alloh taolo iymon keltirgan va solih amallar qilganlarga mag'firat va buyuk ajru savoblarni va'da qiladi."
        ]
    },
    {
        "word": "Fatha ",
        "type": [],
        "definition": [
            "arab harflarining tepasiga qo'yiladigan harakat. “A” tovushi bilan o'qiladi"
        ]
    },
    {
        "word": "Fathu bobil inoya lii sharhi kitobin-niqoya",
        "type": [],
        "definition": [
            "Mullo Ali Qori rahmatullohi alayhining 'Muxtasari Viqoya'ga qilgan katta sharhlari. Keyinroq bu kitobni qisqartirib 'Ixtisori rivoya ala Muxtasari Viqoya' deb ataganlar."
        ]
    },
    {
        "word": "Fehrist ",
        "type": [],
        "definition": [
            "Ibn Nadimning kitoblari"
        ]
    },
    {
        "word": "Fidya ",
        "type": [],
        "definition": [
            "'Fidya'ning lug'aviy ma'nosi, 'fido qilish' bo'lib, shariat hukmiga ko'ra, ma'lum bir narsaning o'rniga mol sarflash 'fidya berish' deyiladi."
        ]
    },
    {
        "word": "Fiqh",
        "type": [],
        "definition": [
            "Lug'atda daqiq fahmni, ya'ni bir narsani nozik joylarigacha tushunishni anglatadi. Shariat istilohida esa, shar'iy dalillardan far'iy hukmlarni chiqarishga 'fiqh' deb ataladi."
        ]
    },
    {
        "word": "Fiqhiy yoʻnalishlar va kitoblar",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining 'Fiqhiy yo'nalishlar va kitoblar' nomli kitoblari. Ushbu kitobdan fiqhiy mazxablar, fuqaholar va ularning asarlari xaqida batafsil ma'lumotlarga ega bo'lasiz. Shuningdek xozir faoliyat ko'rsatayotgan xalqaro fiqx akademiyalari xaqida xam so'z yuritiladi."
        ]
    },
    {
        "word": "Fiqhiy mazhab sohiblari",
        "type": [],
        "definition": [
            "Molikiy mazhab asoschisi, imom Abu Abdulloh Molik ibn Anas ibn Molik ibn Abi Omir al-Asbahiy. Shofe'iy mazhab asoschisi, Imom Shofe'iy Muhammad ibn Idris. Hanbaliy mazhab asoschisi, Imom Ahmad ibn Hanbal. Hanifiy mazhab asoschisi, Abu Hanifa No''mon ibn Sobit ibn Zutiy (Imomi A'zam)."
        ]
    },
    {
        "word": "Fiqhiy mazhablar",
        "type": [],
        "definition": [
            "1) Hanafiy mazhabi; 2) Shofe'iy mazhabi; 3) Molikiy mazhabi; 4) Hanbaliy mazhabi;"
        ]
    },
    {
        "word": "Fil yili ",
        "type": [],
        "definition": [
            "Habashiston Yamanni bosib olgach, Habashiston podshohi Yamanga Abrahani hokim etib tayinladi. Abraha barcha habashistonliklar qatori nasroniy dinida edi. U Yaman poytaxti San'o shahrida juda dabdabali, serhasham cherkov qurdirib, unga 'Qullays' deb nom berdi. Arablarni Ka'badan burib, cherkovida haj qildirmoqchi bo'ldi. Barcha urinishlari puchga chiqqanidan so'ng, kuch ishlatish yo'li bilan niyatiga erishmoqchi bo'ldi.\r\n    Abraha Ka'bani buzib tashlab, hammani o'z cherkoviga burishni maqsad qildi. Shu maqsadda katta lashkar to'pladi. Urushga kerak bo'ladigan barcha narsalarni oldi. Arablarning qalbiga dahshat solish uchun fillarni ham olib, Makkaga qarab yurish qildi. Yo'lda hech qanday qarshilikka uchramay, Toif shahri tarafdan Makkaga yaqinlashib, askarlari bilan Makkadan 4-5 km uzoqlikdagi Mug'ammas degan joyga kelib tushdi.\r\n    So'ng Makkaga odam yuborib, u yerning ulug'ini olib kelishga buyurdi. U borib, Banu Hoshim urug'i rahbari Abdulmuttalibni yetaklab keldi. Abdulmuttalib gavdali, xushbichim, sersavlat va viqorli odam edi.\r\n    Abraha uni ko'rganda qoyil qoldi, taxtidan tushib, peshvoz chiqdi. U bilan birga gilam ustida o'tirdi va tarjimonga: 'Undan so'ra, menda nima hojati bor ekan?' dedi.\r\n    'Askarlaring mening ikki yuzta tuyamni haydab ketishibdi, shularni qaytarib bersang', dedi Abdulmuttalib.\r\n    Abraha tarjimonga: 'Unga ayt! Kelganingda seni ko'rib, qoyil qolgan edim. So'zingni eshitib, hafsalam pir bo'ldi. Sening va ota-bobolaringning dini bo'lgan Ka'bani buzgani kelib turibman-u, sen uni so'ramay, tuyalaringni so'rayapsan', dedi.\r\n    'Men tuyaning egasiman, Ka'baning o'z egasi bor, uni himoya qilib oladi', dedi Abdulmuttalib.\r\n    'Mendan himoya qilolmaydi', dedi Abraha.\r\n    Bunga javoban 'Bilganingni qilaver', dedi Abdulmuttalib.\r\n    Unga tuyalarini qaytarib berishdi. Abdulmuttalib Makkaga qaytib, odamlarni toqqa chiqib ketishga buyurdi. O'zi bir necha kishi bilan Ka'baga bordi va halqasini ushlab turib, yolvorib duo qildi. So'ng ular ham toqqa chiqib ketishdi.\r\n    Abraha askaru fillarini to'plab, Ka'bani buzishga yurmoqchi bo'ldi. Lekin Mino bilan Muzdalifa o'rtasidagi Muhassir* vodiysida katta fil yotib olib, hech o'rnidan turmadi. Boshqa tarafga burishsa, tezlab yurar, lekin Makka tarafga burishsa, yana yotib olardi.\r\n    Shu payt Allohning irodasi bilan Qizil dengiz tarafidan to'p-to'p, qaldirg'ochsimon va chug'urchuqsimon qushlar uchib kelib, dushmanlar ustiga no'xatday, moshday, yasmiqday sopol toshchalarni yog'dira boshladi. Qo'shindagilar bir-birini bosib-yanchib qocha boshlashdi. Toshlar kimga tegsa, joyida o'laverdi. Lashkarning asosiy qismi qirilib ketdi. Toshchalar ularni xuddi qurt-qumursqalar chaynab tashlagan somon kabi ilma-teshik qilib yubordi. Abrahaning jasadi uzilib-uzilib tusha boshladi. Uni ko'tarib, San'ogacha olib borishdi va o'sha yerda uning ham joni uzildi. Ta'kidlash lozimki, toshlar ularning hammasiga ham tegmagan. Salomat qolganlari yurtlariga qaytib ketishgan. Ba'zilarining ko'zlari ko'r bo'lib, Makkada tilanchilik qilib yurishgani rivoyat qilinadi.\r\n    Abdulloh ibn Abbos roziyallohu anhuning Ummu Honi' roziyallohu anhonikida ushbu toshchalarning bir qafiz (33 litr) sig'imli idishga solib qo'yilganini ko'rganlari rivoyat qilingan. Toshchalar aqiqning yo'l-yo'l, taram-taram bir turi kabi qizg'ish bo'lgani aytiladi.\r\n    Ushbu olamshumul voqea milodiy 571 yilning fevral oyi oxiri – mart oyi boshlarida, ya'ni qish fasli tugab, bahorning boshlanishida bo'lib o'tgan.\r\n    Bu vaqtda Payg'ambarimiz Muhammad sollallohu alayhi vasallam hali tug'ilmagan, onalari u zotga homilador edilar.\r\n    Ushbu Fil hodisasi arablar nazdida juda katta ahamiyatga molik bo'ldi. Ular tarixni ana shu yildan boshlab belgilay boshlashdi. Mana shu yili Rasululloh sollallohu alayhi vasallam dunyoga keldilar.\r\n    Shu o'rinda eslab o'tish lozimki, Baytul maqdis tarixida ham ikki marta bosqinchilik yuz bergan. Banu Isroilning qiblasi bo'lgan bu muqaddas uyga butparast mushriklar ikki marta (mil. avv. 587 yil zolim podshoh Buxtanassor II qo'shini va milodiy 70 yili esa rumliklar) bosqin uyushtirib, ikkisida ham Baytul maqdisni ishg'ol qilishgan. Holbuki, bu Bayt aholisi o'sha paytda ahli kitob edilar.\r\n    Habash nasroniylari Ka'bani istilo qila olishmadi. Holbuki, ular ahli kitob, Ka'baning aholisi esa mushrik edi. Keyinchalik Makka ahlidan Payg'ambarimiz Muhammad sollallohu alayhi vasallamga payg'ambarlik kelganida bu ishning siri ochildi!\r\n    * Hozirda ushbu hududga 'Muhassir vodiysi' deb yozib qo'yilgan. Hojilar hayit kuni tong otganida Muzdalifadan Minoga qaytayotib, bu yerdan tezroq yurib o'tishlari sunnatdir."
        ]
    },
    {
        "word": "Fil surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 5 oyatdan iborat.\r\n    Fil surasi mashhur Fil voqeasi haqida so'z yuritadi. Bu qissani hamma yaxshi bilardi, hatto arablar o'z tarixlarini ham ushbu hodisa bo'lib o'tgan yil bilan belgilashardi.\r\n    Qissaning muxtasari quyidagicha: Habashiston (Efiopiya) Yamanni bosib olgandan so'ng, Habashiston podshosi Yamanga Abriha Ashram ismli shaxsni hokim etib tayinladi. Abriha barcha habashistonliklar qatori, nasroniy dinida edi. U Yaman poytaxti San'o shahrida juda dabdabali, serhasham cherkov qurdirib, unga 'Qaliys' deb nom berdi. Arablarni Ka'badan burib, o'z cherkoviga haj qildirmoqchi bo'ldi. Barcha urinishlari puchga chiqqandan so'ng, o'z niyatiga kuch ishlatish yo'li bilan erishmoqchi bo'ldi. Ka'bani buzib tashlab, hammani o'z cherkoviga burishni qasd qildi. Shu maqsadda katta askar to'pladi, urushga kerak bo'ladigan barcha narsalarni oldi, arablarning qalbiga dahshat solish uchun ko'plab fillarni ham oldiga solib, Makkaga qarab yurdi. Yo'lda hech qanday qarshilikka uchramay, Toif shahri tarafdan Makkaga yaqinlashib, askari bilan Mig'las degan joyga kelib tushdi. So'ngra Makkaga odam yuborib, u yerning ulug'ini olib kelishga buyurdi. U borib, Quraysh qabilasi rahbari, ulug'i Abdulmuttolibni yetaklab keldi. Abdulmuttolib gavdali, xushbichim, sersavlat, viqorli odam edi.\r\n    Abriha uni ko'rib, qoyil qoldi va taxtidan tushib, unga peshvoz chiqdi. U bilan birga gilam ustida o'tirdi va tarjimonga:\r\n    – So'ragin-chi, menda nima hojati bor ekan? – dedi. Abdulmuttolib:\r\n    – Askarlar mening ikki yuzta tuyamni haydab ketishibdi, shularni qaytarib bersang, – dedi. Abriha tarjimonga:\r\n    – Unga ayt! Kelganingda seni ko'rib, qoyil qolgan edim. So'zingni eshitib, hafsalam pir bo'ldi, sening va ota-bobolaringning dini bo'lgan Ka'bani buzgani kelib turibman-u, sen uni so'ramay, o'zingning ikki yuzta tuyangni so'rayapsan, – dedi. Abdulmuttolib:\r\n    – Men tuyaning egasiman, Ka'baning ham o'z egasi bor, himoya qilib oladi, – dedi. Abriha:\r\n    – Mendan himoya qilolmas, – dedi. Abdulmuttolib:\r\n    – Bilganingni qilaver, – dedi. Unga tuyalarini qaytarib berishdi. Abdulmuttolib Makkaga qaytib, odamlarni toqqa chiqib ketishga buyurdi. O'zi bir necha kishi bilan Ka'baga bordi va uning halqasini ushlab turib, iltijo ila duo qildi. So'ngra ular ham toqqa chiqib ketishdi.\r\n    Abriha askaru fillarini to'plab, Ka'bani buzish uchun yurmoqchi bo'ldi. Lekin fillar yotib olib, hech o'rinlaridan turishmadi. Boshqa tarafga burishsa, fillar tezlab bordi, lekin yana Makka tarafga burishsa, yotib olaverishdi. Shu payt Alloh taoloning irodasi bilan to'p-to'p qushlar uchib kelib, dushmanlar ustidan tosh tashlay boshladi. U toshlar kimga tegsa, o'sha joyida o'laverdi. Askar qirildi. Abrihaning jasadi uzilib-uzilib tusha boshladi. Uni ko'tarib, San'ogacha olib borishdi va u o'sha yerda vafot etdi.\r\n    Alloh taolo bu surada barchaga O'z qudratini va mo''jizasini eslatmoqda. Kimki Allohga, Uning diniga qarshi chiqsa, oqibati ana shunday ayanchli bo'lishini ta'kidlamoqda."
        ]
    },
    {
        "word": "Firqa ",
        "type": [],
        "definition": [
            "maxsus fikrga ega bo'lgan kishilarning tashkiliy guruhi."
        ]
    },
    {
        "word": "Fisq ",
        "type": [],
        "definition": [
            "buzuqlik, axloqsizlik, fahsh; axloqiy buzuqlik; birovning orqasidan yomonlab tarqatilgan uydirma; g'iybat, ig'vo; to'g'ri yo'ldan adashish."
        ]
    },
    {
        "word": "Fitr sadaqasi",
        "type": [],
        "definition": [
            "Fitr sadaqasi va Fitr zakoti bir-birining o'rniga hamda sadaqa va zakot so'zlari bir-birining o'rniga ishlatilaveradi. Hanafiy mazhabida sadaqai fitr vojib hisoblanadi. U sadaqa Ramazondan fitr(og'iz ochiqligi)ga chiqish munosabati ila berilgani uchun ham 'fitr sadaqasi' nomini olgan."
        ]
    },
    {
        "word": "Fitrat ",
        "type": [],
        "definition": [
            "Fitrat – sof insoniy tabiat, ya'ni islomiy tabiat"
        ]
    },
    {
        "word": "Fitrat sunnatlari",
        "type": [],
        "definition": [
            "'Fitrat sunnatlari' deganda, Alloh taolo yuborgan haqiyqiy, sof diynlarda barcha Rasul, Nabiylar va ularning ummatlariga amr qilingan ishlar ma'nosi bilinadi."
        ]
    },
    {
        "word": "Fojir ",
        "type": [],
        "definition": [
            "fohish, uyatsiz; betavfiq, gunohkor, buzuqi, buzg'unchi; yolg'onchi, ayyor, firibgar, makkor"
        ]
    },
    {
        "word": "Fojirlarcha ",
        "type": [],
        "definition": [
            "Fojirlarcha ‒ yolg'on qasamxo'rlik bilan"
        ]
    },
    {
        "word": "Fozil ",
        "type": [],
        "definition": [
            "Fazilatli"
        ]
    },
    {
        "word": "Foiq ar-Rumiy al-Andalusiy al-Xossa",
        "type": [],
        "definition": [
            "Amir Abul Hasan Foiq ibn Abdulloh ar-Rumiy al-Andalusiy al-Xossa Xuroson amiri Abu Solih Mansur ibn Nuhning xos kishilaridan bo'lganlari uchun 'al-Xossa' deb atalganlar. Buxoro olimlaridan. Xurosonning qirqdan ortiq shaharlarida voliy vazifasida ishlaganlar. Ilm ahlini hurmatlardilar, o'zlari ham ilmga qiziqardilar. Xayrli ishlar qilganlar. Bu kishining uylarida muhaddislar va olimlar yig'ilar, o'zlari ham ularning so'zlarini eshitar edilar. Buxoroda Abu Bakr Muhammad ibn Ahmaddan va Marv, Kufa, Makka muhaddislaridan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abu Abdulloh Muhammad ibn Abdulloh al-Bayyi' va Muhammad ibn Ahmad G'unjor al-Buxoriy hadis rivoyat qilganlar. Hijriy 389 (milodiy 1000) yil ramazon oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Fokiha",
        "type": [],
        "definition": [
            "Arablarda taomdan keyin ko'ngil yozish uchun tanovul qilinadigan mevalarni 'fokiha' deyiladi. Ba'zi ulamolar: shaftoli, anjir, behi va nok ham fokiha, deganlar."
        ]
    },
    {
        "word": "Fosid ",
        "type": [],
        "definition": [
            "Buzuq"
        ]
    },
    {
        "word": "Fosid savdo",
        "type": [],
        "definition": [
            "Asli shar'iy, sifati noshar'iy bo'lgan savdo fosiddir. Boshqacha qilib aytganda, fosid savdo savdo qilishga loyiq shaxs tomonidan, savdo moli bo'lishga loyiq narsa ustida qilinadi. Ammo, unga noshar'iy ish yoki sifat aralashgan bo'ladi. Misol uchun, keyinchalik nizoga sabab bo'ladigan darajadagi noaniq narsaning savdosi. 'Uylarimdan yoki mashinalarimdan birini sotdim' deb savdo qilish shunga kiradi. Shuningdek, bir savdoda ikki savdoni bitirish. 'Men uyimni senga sotaman, sen mashinangni menga sotasan' deganga o'xshash. Fosid savdoda sotuvchining izni bilan xaridor molni qo'lga olganidan keyin mulk sobit bo'ladi."
        ]
    },
    {
        "word": "Fosid savdoning turlari",
        "type": [],
        "definition": [
            "Fosid savdoning turlari: 1. Noaniq narsa savdosi. Hanafiy mazhabi bo'yicha, agar savdo moli yoki uning narxida sotuvchi va xaridor orasida nizoga sabab bo'ladigan darajada ko'p noaniqlik bo'lsa, savdo fosid bo'ladi. Ko'p noaniqlikka misol, 'Qo'radagi qo'ylardan birini falon so'mga sotdim', deyish. Agar noaniqlik nizoga sabab bo'lmaydigan darajada oz bo'lsa, savdo fosid bo'lmaydi. Oz noaniqlikka misol, 'bir qop unni falon so'mga sotdim', demoq. Savdodagi ko'p noaniqlik to'rt narsada bo'ladi: 1. Sotiladigan narsadagi noaniqlik. Bu noaniqlik xaridor uchun molning uning jinsida, turida va miqdorida bo'lishi mumkin. 2. Narxdagi noaniqlik. Masalan, 'Mana bu otni qo'radagi qo'ylardan elliktasiga sotdim', deyshlik. Shuningdek, 'Mana bu kiyimni qiymatiga sotdim', demoqlik. Chunki, uning qiymati noaniq va keyin nizo chiqishiga sabab bo'lishi mumkin. 'Falonchi qaysi narxni aytsa, shunga sotdim' qabilidagi savdo ham fosid bo'ladi. Chunki, falonchi qaysi narxni aytishini birov bilmaydi. 'Mana buni bir qop bug'doy yoki bir qop arpaga sotdim', desa ham, savdo fosid bo'ladi. Chunki, narx ma'lum emas. 3. Muddatdagi noaniqlik. 'U narsani narxini bir yoki ikki oyda berish sharti ila sotdim', desa, savdo fosid bo'ladi. Shuningdek, 'falonchi hajdan kelganda', 'uzish, terish yoki o'rish mavsumi kelishi sharti bilan' deganda ham, muddat aniq bo'lmagani uchun, savdo fosid bo'ladi. Agar avval noaniq muddatga savdolashib, keyin o'sha vaqt kelmay turib aniq vaqtga ittifoq qilinsa, savdo to'g'ri bo'ladi.\r\n2. Shartga bog'langan va kelajak vaqtga izofa qilingan savdo. Agar, vaqtiki, qachonki kabi shart iboralari ila kelajakda bo'lishi mumkin ishga bog'langan savdo ham fosid savdo bo'ladi. Misol uchun, 'Agar falonchi menga hovlisini sotsa, men ham senga hovlimni sotdim', deyishlik. Bunda savdoni bog'langan shart vujudga kelishi ham mumkin, kelmasligi ham mumkin. Ana shu noaniqlik uchun savdo fosid bo'ladi. Kelajak vaqtga izofa qilingan savdoga 'Kelasi oyning boshidan falon narsani senga sotdim' deyishlik misol bo'ladi. Mazkur ikki xil savdo ham Hanafiy mazhabiida fosid hisoblanadi. Boshqa mazhablar esa, ularni 'botil' deyishadi. 3. Foyib yoki ko'rinmaydigan narsaning savdosi. Hanafiy mazhabi bo'yicha, savdo paytida boshqa yerda bo'lgan mulkni yoki ko'z bilan ko'rib bo'lmaydigan narsani og'zaki tarzda sifatlash asosida savdo qilsa, bo'ladi. Faqat, ko'rgandan keyin xaridorning ixtiyori o'zida bo'ladi. U mazkur molni yoqsa, oladi, yoqmasa, qaytaradi.\r\nDora Qutniy Abu Hurayra Ibn Abu Shaybadan, Bayxaqiy Makhuldan rivoyat qiladilar: Rasululloh sollallohu alayhi vasallam: 'Kim bir narsani ko'rmay turib sotib olsa, u o'sha narsani ko'rganida ixtiyori o'zida bo'ladi', – dedilar'. Xuddi shu asosda faqat iste'mol qilish paytida ochiladigan, saqlangan oziq-ovqat, dori-darmon, suyuqliklar va gazlarning savdosi durust bo'ladi. Shuningdek, yer ostida turgan sabzi, piyoz, turp kabi narsalarning savdosi ham.\r\n4. Harom narxga savdo qilish. Sotib olinayotgan narsaning narxiga aroq, cho'chqa yoki shunga o'xshash harom narsa beriladigan bo'lsa, Hanafiy mazhabi bo'yicha, savdo fosid bo'ladi. Boshqa mazhablarda bu kabi savdo botil hisoblanadi.\r\n5. Nasiyaga sotib, naqdga qaytarib sotib olish. Bir kishi o'n ming so'mga muhtoj. Boy odamdan qarz so'rasa, uning qarzi hasan bergisi kelmadi. Ochiq ravishda ribo so'rashga jur'at qilmadi. Hiyla o'ylab topdi. O'sha qarz so'rovchiga ma'lum bir molni nasiyaga o'n ikki mingga sotdi. Biroz vaqtdan keyin xuddi o'sha molni undan naqdga o'n ming so'mga qaytarib sotib oldi. Qarz so'rayotgan odam o'n ming so'mni qo'liga oldi. Mol egasi ikki ming so'm foyda ko'rdi. Bu qabildagi savdoni Abu Hanifa rahmatullohi alayhi: 'Fosid bo'ladi', deganlar.\r\n6. Aroq tayyorlovchiga uzum sotish. Imom Abu Hanifa va Shofe'iy bu savdoni 'makruh' deganlar. Chunki, u ayni shu uzumdan aroq tayyorlaydimi, yo'qmi, ma'lum emas. Molikiy va Hanbaliy: 'Aroq tayyorlovchiga uzum sotish savdosi botil', deganlar.\r\n7. Bir yo'la ikki savdoni qo'shib yuborish yoki bir savdoga ikki shart qo'yish. Ikki savdoni qo'shib yuborishning ikki xil ko'rinishi bor. Birinchisi, 'Bu narsani naqdga ming so'mga, nasiyaga bir ming ikki yuz so'mga sotaman', deyish. Ikkinchisi, 'Mashinangni menga sotsang, uyimni senga sotaman', deyish.\r\nAbu Hurayra roziyallohu anhudan rivoyat qilinadi: 'Nabiy sollallohu alayhi vasallam: 'Kim bir savdoda ikki savdoni qilsa, unga ikkisidan kami yoki ribo', – dedilar'. Abu Dovud va Termiziy rivoyat qilishgan. Bir savdoda ikki savdo qilish ikki xil bo'ladi: 1. Bir molni ikki xil narx bilan sotadi. Misol uchun, 'Ushbu kiyimni naqdga olsang, o'n so'mga, nasiyaga olsang, o'n besh so'mga sotaman', deydi. 2. Ikki xil molni bir xil narx bilan sotadi. Misol uchun 'Ushbu ikki kiyimdan birini senga bunchaga sotdim', deydi. Bu holatlarda ikki narsadan biri tayin bo'lmagani uchun, savdo noto'g'ri bo'ladi. Agar sotuvchining chaqirig'idan keyin xaridor birini tanlasa, savdo yuradi. Bu holatlarda noaniqlik bo'lgani uchun, savdo fosid bo'ladi. Ammo, xaridor ikkisidan birini tanlab, aniqlik kiritib, qabul qilsa, savdo to'g'ri bo'ladi.\r\n8. Narxni ma'lum vaqtda bo'lib-bo'lib to'lash sharti bilan qilingan savdo. Sotuvchi 'Bu narsani naqdga ming so'm, bo'lib to'lashga ming ikki yuz so'mga sotdim' deganda, xaridor 'Qabul qildim', desa, savdo botil bo'ladi. Ammo, 'Bu narsani naqdga ming so'mga, bo'lib to'lashga ming ikki yuz so'mga sotaman' deganda, xaridor 'Bo'lib to'lashga ming ikki yuz so'mga oldim', desa, savdo to'g'ri bo'ladi. Bu kabi savdoning to'g'riligiga barcha mazhablar ittifoq qilishgan. Narxni bo'lib to'lash sharti ila qilingan savdo bilan riboning orasida bir oz o'xshashlik bo'lsa ham, farq katta. Chunki, riboda bir taraf bergan narsaning o'zi ma'lum muddat o'tgach ziyoda qilib qaytariladi. Masalan, bir kilo bug'doyni naqd berib turib, bir muddatdan keyin bir yarim kilo qilib oladi. Yoki ming so'mni qarzga berib turib, ma'lum muddatdan keyin uni ming ikki yuz qilib oladi. Narxni bo'lib-bo'lib to'lashda esa, savdo molining narxi hozir ming so'm bo'lsa, bir yildan keyin ming ikki yuz bo'ladi, degandek gap. Bu yerda sotuvchi puli yetmay turgan xaridorga yengillik yaratib bermoqda. Qo'liga savdo molini tutqazmoqda. Albatta, hozirning o'zida qo'lga tutqaziladigan mol keyin beriladiganidan afzal va qiymatliroqdir.\r\n9. Bir narsaning bo'laklarini yoki sifatini sotish. ' Bir narsaning bo'lagi' deganda, 'Mana bu qo'yning dumbasini sotdim' kabi savdo tushuniladi. 'Bir narsaning sifatini sotish' deganda, yoqut deb sotilgan narsa shisha chiqib qolishi kabi narsalar anglanadi. Bu kabi savdolar botildir.\r\n10. Birovning mulkidagi narsani sotib olgan shaxs o'sha narsani o'z qo'liga olmay turib sotishi. Hanafiy mazhabi bo'yicha, ko'char mulkni sotib olgan odam uni qabz qilmasdan – o'zi qabul qilib olmasdan turib sotishi mumkin emas. Chunki, hali mol uning qo'liga sog'-salomat keladimi, yo'qmi, ma'lum emas."
        ]
    },
    {
        "word": "Fosiq",
        "type": [],
        "definition": [
            "Ilmli bo'lsa ham, shariat ahkomlarini buzishni o'ziga odat qilib olgan odam."
        ]
    },
    {
        "word": "Fotima bint Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qizlari"
        ]
    },
    {
        "word": "Fotir surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 45 oyatdan iborat.\r\n    'Fotir' so'zi surai karimada Alloh taoloning sifati bo'lib kelgan. Bu so'z 'yo'qdan bor qiluvchi', 'ilk yaratuvchi', 'ajoyib ijodkor' degan ma'nolarni anglatadi. Alloh taoloning ushbu suraga nom bo'lib qolgan 'Fotir' sifati surai sharifa oyatlarida zikr qilingan va o'z ifodasini topgandir.\r\n    Ushbu surai karimaning ikkinchi nomi 'Malaaika'dir. Bu so'zning ma'nosi 'farishtalar' deganidir. 'Malaaika' so'zi ham xuddi 'Fotir' so'zi kabi, ushbu suraning birinchi oyatida zikr qilingan.\r\n    Boshqa makkiy suralar kabi, bu surada ham Alloh taoloning biru borligi, har bir ishga qodirligi va fotirligi haqida so'z ketadi. Shuningdek, aqiydaning boshqa bosh masalalari, payg'ambarlikning haqligi, shirkning botilligi bayon qilinadi. Inson va jamiyatni turli botil urf-odat va razolatlardan poklash, Islom hukmlarini, odob-axloqlarini joriy qilish haqida so'z yuritiladi.\r\n    Suraning avvalida Alloh taoloning Fotir – ajoyib Xoliq ekani, koinotni, farishtalar va insonlaru jinlarni yo'qdan bor qilib yaratgani, qiyomatda esa ularni yana qayta vujudga keltirishi xususida gapiriladi. Shu bilan birga, atrofni o'rab turgan borliqqa e'tibor qaratiladi. O'lib yotgan yerning qanday tirilishi, undan ekin-tikinlar, meva-chevalar chiqishi, kechayu kunduzning bir-biri bilan almashib turishi, insonning yaratilishi kabi jarayonlar haqida bahs yuritiladi.\r\n    Keyin mo'min inson bilan kofir o'rtasida qanchalik farq borligi uqdiriladi. Ular zulmat va nurga qiyoslanadi. Sel va jazirama issiqqa o'xshatiladi.\r\n    Alloh taoloning cheksiz qudratiga, fotirligiga, xoliqligiga dalil o'laroq, mevalarning turli-tumanligiga, shuningdek, odamlar, hayvonlar va chorvalarning xilma-xil bo'lishiga ishora qilinadi. Ayni chog'da, tog'u toshlarning shakllari ham har xilligi aytib o'tiladi. Ularning har biri Alloh taoloning biru borligiga, ulug' va qudratli ekaniga dalil ekani bayon etiladi.\r\n    So'ngra ummati Muhammadiya haqida, bu ummat eng sharafli dinning merosxo'ri va ilohiy kitoblarning mag'zini qamrab olgan so'nggi samoviy Kitob sohibi ekani haqida so'z yuritiladi.\r\n    Sura oxirida esa mushriklarning turli narsalarga sig'inishlari qattiq tanqid qilinadi."
        ]
    },
    {
        "word": "Fotiha surasi",
        "type": [],
        "definition": [
            "Qur'oni Karimning birinchi surasi. Makkada nozil bo'lgan, 7 oyatdan iborat. Bu suraning bir necha nomi bo'lib, ulardan biri 'Fotiha', ya'ni 'ochuvchi' deganidir. Chunki Qur'oni karim ushbu sura ila ochiladi."
        ]
    },
    {
        "word": "Fotihatul kitob",
        "type": [],
        "definition": [
            "Fotihatul Kitob – Fotiha surasining nomlaridan biri bo'lib, 'Qur'on ochqichi' degan ma'noni anglatadi."
        ]
    },
    {
        "word": "Fotihatul-kitob",
        "type": [],
        "definition": [
            "'Fotihatul-kitob' – Fotiha surasining nomlaridan biri, aniqrog'i, uning to'liq nomi bo'lib, 'Kitobni, ya'ni Qur'onni ochuvchi' degan ma'noni anglatadi. Qur'oni Karim ushbu sura bilan boshlangani uchun shu nomni olgan."
        ]
    },
    {
        "word": "Fuzuliy",
        "type": [],
        "definition": [
            "Birovning iznisiz uni boshqa shaxsga nikohlab qo'ygan kishini 'fuzuliy' deyiladi. Bunday paytda o'zidan so'ralmay nikoh qilingan odam rozi bo'lsa, nikoh joriy bo'ladi. Agar u rozi bo'lmasa, nikoh joriy bo'lmaydi."
        ]
    },
    {
        "word": "Fuqqoʻ ",
        "type": [],
        "definition": [
            "Fuqqo' – arpa yoki tuyilgan mayizdan tayyorlanadigan ichimlik."
        ]
    },
    {
        "word": "Furqon surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 77 oyatdan iborat.\r\n    Surai karimaga uning birinchi oyatida kelgan 'furqon' so'zi nom qilib olingan. 'Furqon' so'zi lug'atda 'ajratuvchi', 'farqlovchi' degan ma'nolarni anglatadi. Shuningdek, u Qur'oni Karimning ismlaridan biri sanaladi. Chunki Qur'on haq bilan botilni, hidoyat bilan zalolatni, to'g'ri bilan noto'g'rini farqlovchi, ajratuvchidir.\r\n    Ma'lumki, Payg'ambarimiz Muhammad sollallohu alayhi vasallam payg'ambarliklarining ilk davrida – Islom da'vatining avvalida kofir va mushriklarning qattiq tazyiqiga uchraganlar, ko'plab ozor chekkanlar, turli ig'voyu bo'htonlar eshitganlar. Ul zotning o'zlariga, u kishiga nozil bo'layotgan Qur'onga, Islom diniga, qolaversa, Alloh taologa nisbatan ham behisob kamsituvchi gaplar, har xil masxaraomuz takliflar aytilgan. Tabiiyki, bunday holatlar hadeb takrorlanaverganidan keyin jonga tegishi mumkin, shuning uchun Alloh taolo doimo Payg'ambar sollallohu alayhi vasallamga tasalli berib, ularga e'tibor bermaslikka chaqirib kelgan.\r\n    Ushbu Furqon surasida avvalidan oxirigacha Nabiy sollallohu alayhi vasallamning mushriklar bilan bo'layotgan qarama-qarshiliklarida u zotni qo'llash, u zotga tasalli berish, qalblarini tinchlantirish kabi jihatlarga ahamiyat beriladi.\r\n    Furqon surasi bandasiga Qur'oni Karimni nozil qilgan Alloh taologa hamdlar aytish, Uni ulug'lash bilan boshlanadi. U Zot osmonlaru yerdagi narsalarning egasi ekani, bolasi ham, sherigi ham yo'qligi, har bir narsani o'lchov bilan yaratganligi ta'kidlanadi. Shunga ham qaramasdan, mushriklarning Allohni qo'yib, o'zlariga soxta xudolar tutgani eslatiladi. Ularning Qur'oni Karimga ta'na toshlari otib, unga nisbatan turli bo'lmag'ur gaplar aytgani bildiriladi va o'sha gaplardan misollar keltiriladi. Ular gohida Qur'onni 'o'tganlarning afsonalari', deydilar, gohida 'boshqalar yordamida Muhammad o'zi to'qib olgan narsa', deydilar. Boshqa bir gal esa 'Qur'on sehrdir', deydilar. Alloh taolo ularning bu mantiqsiz da'volariga birma-bir ishonchli va qoniqarli raddiyalar beradi.\r\n    Alloh taoloning Qur'on haqida mushriklarning gap-so'zlarini oyat qilib nozil qilishining o'zi katta gap. Bu hol U Zotning har bir narsadan xabardor ekanini bildirishi bilan birga, Nabiy sollallohu alayhi vasallam uchun va u kishiga ergashgan oz sonli musulmonlar uchun katta ma'naviy madad hamdir.\r\n    Keyin mushriklarning payg'ambarlik haqidagi diydiyolari keltiriladi. Ular 'Payg'ambar insonlardan emas, malakdan bo'lishi kerak' yoki bo'lmasa, 'Payg'ambar boy-badavlat, kazo-kazolardan bo'lishi kerak' kabi gaplarni aytishar edi. Alloh taolo ularning bu da'volariga ham raddiyalar beradi.\r\n    So'ngra qiyomat va uning manzaralari eslatilib, kofir va mushriklar qo'rqitiladi. Nabiy sollallohu alayhi vasallamga esa tasalli beriladi, oldingi o'tgan barcha payg'ambarlar ham u kishi sollallohu alayhi vasallamga o'xshash odamlar bo'lgani aytiladi.\r\n    Mushriklarning mantiqsiz gaplarini muolaja qila borib, ularning 'Bizga farishtalar tushirilsa yoki Robbimizni ko'rsak edi' degan gaplari ham bahs etiladi. Unda farishtalar tushadigan kun qiyomat kuni bo'lishi bayon qilinadi. Shuningdek, mushriklarning 'Qur'on bir jumla shaklida, to'p holatda tushsa edi' degan gaplari ham muhokama etiladi. Yana qiyomatning ko'rinishlari, unda bo'ladigan hodisalar bayon qilinadi. O'tgan ummatlar va ularning oqibatlari nima bo'lgani, xususan, Muso, Nuh, Od, Samud, Lut qavmlari tilga olinadi.\r\n    Furqon surasida borliqdagi tabiiy jarayonlar, insonning suvdan yaratilishi kabi, Alloh taoloning qudrati cheksiz ekaniga dalolat qiluvchi oyatlar ham keltirilgan. Ammo bulardan o'rnak olmagan odamlarning Alloh taologa shirk keltirishlari eslatib o'tilgan.\r\n    Surai karimaning oxirida Rohman sifatli Allohning haqiqiy bandalarining sifatlari sanab o'tilgan."
        ]
    },
    {
        "word": "Fussilat surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 54 oyatdan iborat.\r\n    Bu surai karimaga o'zidagi uchinchi oyatning 'Kitaabun fussilat ayatuhu' jumlasidagi 'fussilat' so'zi nom qilib olingan. 'Fussilat' so'zi 'mufassal bayon qilingan' degan ma'noni anglatadi. Bu ma'no Qur'oni Karim oyatlariga berilgan ilohiy vasfdir. Darhaqiqat, Alloh taolo Qur'oni Karimning bu surasi oyatlarida O'zining Biru Borligiga, cheksiz qudratiga, ulug'ligiga, yaratuvchiligiga hujjat va dalillarni batafsil bayon qilgandir.\r\n    Surada Alloh taoloning vahdoniyati, olamlarni yaratishi, payg'ambarlik, qayta tirilish va jazolashu, mukofotlash haqida ham so'z ketadi.\r\n    Fussilat surasining boshida Qur'oni Karimning Rohmanu Rohiym bo'lgan Zot tomonidan nozil qilinganligi, arabiy tilda ekani va boshqa vasflariga e'tibor tortiladi.\r\n    Shu bilan birga, mushriklarning bu Kitobga nisbatan munosabatlari ham ko'rsatiladi.\r\n    Keyin vahiy, payg'ambarlik va payg'ambarning kimligi haqida so'z ketadi.\r\n    Osmonu yerning yaratilish qissasi, Od va Samud qavmlarining qissalari zikr etiladi. Ular qanchalik kuch-qudratga ega qavmlar bo'lishlariga qaramay, kufrlari tufayli halokatga uchraganlari hikoya qilinadi. Ularning oxiratda tortadigan azoblari eslatib o'tiladi.\r\n    Jinoyatchi qavmlar haqidagi oyatlardan keyin Allohning dini va Uning shariatida sobitqadam mo'min zotlar, ularni Alloh taolo izzat-ikromlar ila mukofotlashi haqida so'z ketadi.\r\n    Keyin esa kecha va kunduz, quyosh va oy, ibodat qiluvchi farishtalar, itoatkor yer kabi borliqdagi Alloh taoloning Biru Borligiga, cheksiz qudratiga, mudabbirligiga va boshqa barkamol sifatlariga belgi-alomat bo'lgan narsalar bayon etiladi. Shuningdek, o'sha oyat va belgilarni inkor qiluvchilar borasida gap boradi.\r\n    Qur'oni Karim haqida ham mavzuga mos oyatlar keladi. Ibrat olish uchun Muso alayhissalomga nozil qilingan kitob va qavmlarining unga munosabati esga olinadi.\r\n    So'ngra qiyomat va uni bilish Alloh taoloning yagona O'ziga xos ekani aytiladi. Kofirlarning qiyomat kuni savolga tutilishlari, insonning o'zgaruvchanligi, qiyin holga tushganda asliga qaytib, omonlik paytida yana o'zlariga zulm qilib, kufr yo'liga o'tishlari tavsiflanadi.\r\n    Suraning oxirida Alloh taolo oxiri zamonda odamlarga borliqning ba'zi sirlarini kashf qilib berishi haqida va'da keladi.\r\n    Fussilat surasi 'Ha mim' bilan boshlanuvchi yettita suraning ikkinchisidir. Ular 'Ha mimlar' deb ham ataladi.\r\n    Ulug' sahobiylardan Abdulloh ibn Mas'ud roziyallohu anhu 'Ha mim' oilasi Qur'onning debochasidir', – deganlar.\r\n    'Islom ummatining ilm dengizi' va 'Qur'on tarjimoni' nomlarini olgan buyuk sahobiy Abdulloh ibn Abbos roziyallohu anhu esa 'Har bir narsaning yuragi bordir. Qur'onning yuragi 'Ha mim' oilasidir', – deganlar.\r\n    Darhaqiqat, ushbu suralarda tavhidga juda kuchli dalillar bor. Ular tezda inson qalbini egallab oladi."
        ]
    }
]