[
    {
        "word": "Gʻabiitun ",
        "type": [],
        "definition": [
            "G'abiitun' – havdaj ostidan qo'yiladigan egarsifat moslama, qo'm"
        ]
    },
    {
        "word": "Gʻazot",
        "type": [],
        "definition": [
            "jang, urush, ma'raka."
        ]
    },
    {
        "word": "Gʻayb ",
        "type": [],
        "definition": [
            "yo'qlik, barcha ko'rinmas narsalar, kelajak, g'oiblik, inson sezgi a'zolari bilan his eta olmaydigan, bilish imkonlari bilan idrok eta olmaydigan hodisalar"
        ]
    },
    {
        "word": "Gʻayridin ",
        "type": [],
        "definition": [
            "boshqa dinga e'tiqod qiluvchi, boshqa dindagi kishi"
        ]
    },
    {
        "word": "Gʻani",
        "type": [],
        "definition": [
            "boy, badavlat"
        ]
    },
    {
        "word": "Gʻarib ",
        "type": [],
        "definition": [
            "begona, bechora (sanadning bitta tabaqasida bo'lsa ham bir kishi yolg'iz rivoyat qilgan hadis)"
        ]
    },
    {
        "word": "Gʻaroyib ",
        "type": [],
        "definition": [
            "g'arib hadislar; ajoyib, qiziqarli"
        ]
    },
    {
        "word": "Gʻasb",
        "type": [],
        "definition": [
            "'Fasb' so'zi lug'atda bir narsani zulm ila kuch ishlatib tortib olishga aytiladi. Shar'iy istilohda esa: Arzigulik va muhtaram molni egasining ruxsatisiz uning qo'lidan ochiq-oydin tortib olishga g'asb deyiladi. Fasbning haromligiga bir qancha dalillar bor."
        ]
    },
    {
        "word": "Gʻiido ",
        "type": [],
        "definition": [
            "'G'iido' – noqis qilindi."
        ]
    },
    {
        "word": "Gʻiybat ",
        "type": [],
        "definition": [
            "kishi bo'lmagan vaqtida uni yomonlik bilan eslashlik"
        ]
    },
    {
        "word": "Gʻifor ",
        "type": [],
        "definition": [
            "G'ifor – Kinona tarkibidagi qabilalardan biri."
        ]
    },
    {
        "word": "Gʻoziy ",
        "type": [],
        "definition": [
            "jangchi; askar, harbiy yurish ishtirokchisi"
        ]
    },
    {
        "word": "Gʻoila ",
        "type": [],
        "definition": [
            "G'oila – zino, o'g'rilik va qochib ketish\r\n    Imom Buxoriy o'z rivoyatlarida 'g'oila' degan g'arib iboraning ma'nosini ham sharh qilib qo'ygan ekanlar."
        ]
    },
    {
        "word": "Gʻolib as-Surmoriy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ahmad G'olib ibn Shu'ba as-Surmoriy al-Buxoriy Buxoroning Surmoro qishlog'i ahlidan bo'lib, juda ko'p olimdan, jumladan, Abdulloh ibn Muso, Abu Naim Fazl ibn Dikkin, Qubaysa ibn Uqba, Hibbon ibn Ag'lab, Orim ibn Fazl, Umar ibn Avn va boshqa ko'p ustozdan ta'lim olganlar. O'zlaridan esa Abu Kasir Sayf ibn Nasr hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Gʻofilotlar ",
        "type": [],
        "definition": [
            "G'ofilotlar – g'ofila, bexabar ayollar. Iymonli, iffatli ayollarning fahshga qo'l urish uyoqda tursin, bunday narsalardan hatto xabari ham bo'lmagani, bu kabi razolatlarni xayoliga ham keltirmaganlari tufayli Qur'oni Karim ularni mubolag'a bilan 'g'ofila' deb atagan"
        ]
    },
    {
        "word": "Gʻofir surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 85 oyatdan iborat.\r\n    'G'ofir' so'zi 'kechiruvchi', 'gunohlarni mag'firat qiluvchi' degan ma'nolarni anglatadi. 'G'ofir' Alloh taoloning go'zal ismlaridan biri bo'lib, suraning avvalida ushbu ism zikr qilingani uchun unga nom bo'lib qolgan.\r\n    Bu surai karima Mo'min surasi deb ham ataladi. Bu nom uning yigirma sakkizinchi oyatidagi 'Fir'avn ahlidan bo'lgan mo'min kishi...' jumlasidan olingandir.\r\n    Surai karimaning asosiy mavzusi iymon bilan kufr, haq bilan botil orasidagi kurashni vasf etishdan iboratdir. Unda haq yo'lidagi da'vatga qarshi turgan unsurlar fosh qilinadi. Tug'yonga ketganlarning oqibati ko'rsatiladi.\r\n    G'ofir surasining avvalida Alloh taoloning barkamol sifatlari, Uning qudratiga dalolat qiluvchi oyat-belgilar bayon etiladi. Keyin esa kofirlarning bu oyat-belgilarga qarshi tortishuvlari, bahslari haqida xabar beriladi.\r\n    So'ngra o'tgan qavmlardan kufr yo'lini tutganlari qanday halokatlarga uchraganlari hikoya qilinadi.\r\n    Dahshatli va qo'rqinchli bir holatda Arshni ko'tarib turuvchilarning qanday iltijo qilishi so'zlanadi.\r\n    Shuningdek, qiyomat kunidagi turli manzaralar, u Kunning dahshatlari ham tasvirlanadi. Hisob-kitob uchun Robbul olaminning huzurida xaloyiqning qo'rqib turishlari, hamma-hammaning amaliga yarasha jazo yoki mukofot berilishi vasf qilinadi.\r\n    Keyin iymon va tug'yon qissasi boshlanadi. Bu qissada Muso alayhissalom iymonning timsoli sifatida, Fir'avn esa tug'yonning timsoli sifatida tasvirlanadi.\r\n    Shuningdek, surada borliqdagi Alloh taoloning cheksiz qudratiga dalolat qiluvchi ba'zi mavjudotlar ham zikr etiladi. Mo'min bilan kofir orasidagi farqqa misol keltiriladi.\r\n    Nihoyat, G'ofir surasining so'ngida kofirlar va tug'yonga ketganlarning oqibati nima bo'lishi bayon qilinadi."
        ]
    },
    {
        "word": "Gʻoshiya surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 26 oyatdan iborat.\r\n    Ushbu surai karimaning nomi ham o'zining birinchi oyatidagi so'zdan olingan. 'G'oshiya' – 'o'rab, bosib oluvchi' degan ma'noni anglatadi. Qiyomat kuni shu nom bilan ham nomlanadi. Chunki u Kun o'z dahshati ila hamma narsani o'rab, bosib oladi.\r\n    G'oshiya surasi makkiy suralardan bo'lib, uning muolaja qilgan mavzusi asosan ikkiga bo'linadi. Suraning birinchi bo'lagi qiyomat kuni, uning ahvollari va dahshatlarini, u kunda kofirga bo'ladigan azob-uqubatlarni va mo'minga bo'ladigan izzat-ikromlarni bayon qiladi.\r\n    G'oshiya surasining ikkinchi yarmi esa Alloh taoloning vahdoniyati va cheksiz qudratiga turli dalillar keltirib, tuyaga, osmonga, tog'larga va yerga ibrat ko'zi bilan nazar solishga chaqiradi.\r\n    Bu sura Islomning avvalida, Payg'ambar sollallohu alayhi vasallam ommaviy da'vatni boshlab, Makka mushriklari buni inkor qilgan paytlarda nozil bo'lgan.\r\n    Avval boshda Payg'ambar sollallohu alayhi vasallam kishilarni yagona Allohga va u dunyoda ham hayot borligiga ishontirishga urindilar. Qiyomat kuni xaloyiq ikkiga bo'linadi, bir guruh ahli jannat, ikkinchisi esa ahli do'zax. Agar kimdir bunga ishonmasa, o'ziga har kuni uchrab turadigan ba'zi narsalarga nazar solsin. Misol uchun, tuyaga, uning maxsus tuzilishiga, chidamliligiga, osmonga, yerga, tog'larga nazar solsin. Bularning hammasi o'z-o'zidan bo'lib qolganiga ishonmaydi-yu, osmonu yer, tog'u dengizlarning Yaratuvchisi haqida nega fikr yuritmaydi? Ha, bu narsalarning va butun dunyoning Yaratuvchisi bor, u ham bo'lsa, qudratli Alloh taolodir. Mana shu narsalarni yaratgan Alloh taolo qiyomat kuni ularni qaytadan yig'ib olishga qodirdir.\r\n    'Ey Payg'ambar, – deydi Alloh, – dushmanlar ishonmasa, sen ularni majbur qilmaysan, sening vazifang yetkazib qo'yish, xolos. Hisob-kitobni Men O'zim vaqti kelganda qilib olaman'."
        ]
    },
    {
        "word": "Gʻoyatul maharoh fiz-ziyada ʼalal ʼasharoh",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Gʻoyatun-nihaya fiy asmai rijalil qiroat",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari"
        ]
    },
    {
        "word": "Gʻundar ",
        "type": [],
        "definition": [
            "mashhur muhaddisning ismi bo'lib, 'Sahih ul-Buxoriy' kitobining muallifi Muhammad ibn Ismoil al-Buxoriy shu kishidan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Gʻusl ",
        "type": [],
        "definition": [
            "'G'usl' so'zi lug'atda biror narsaning ustidan suv oqizishni anglatadi. Shariatda esa, Alloh taologa qurbat niyatida badanning hammasiga suv oqizishga 'g'usl' deb aytiladi."
        ]
    }
]