[
    {
        "word": "Habbatun fi shaʼrotin",
        "type": [],
        "definition": [
            "'Habbatun fi sha'rotin' iborasi 'bir boshoqda bir don' deganidir. Bu hech qanday ma'no bildirmaydigan ibora bo'lib, Banu Isroil bu bilan Allohning buyrug'ini mazax qilmoqchi bo'lishgan."
        ]
    },
    {
        "word": "Havdaj",
        "type": [],
        "definition": [
            "Havdaj – ayollarni ko'tarib olib yurishga mo'ljallangan, savatga o'xshash moslama, ayollar taxtiravoni. U ko'proq tuyaning ustiga ortilgan."
        ]
    },
    {
        "word": "Havzi kavsar",
        "type": [],
        "definition": [
            "jannatdagi suvlari tiniq va shirin chashma."
        ]
    },
    {
        "word": "Havola ",
        "type": [],
        "definition": [
            "'Havola' deb narsani bir joydan boshqa joyga naql qilishga aytiladi. Shar'iy istilohda esa: 'Havola' qarzni boshqaga isbot qilish va undan so'ng naql qiluvchi zimmasida qarz qolmasligidir. Bir kishi boshqasidan qarz. Qarzdor: 'Mening qarzimni falonchi to'laydi', deb boshqaga o'tkazadi. Mazkur shaxs qarzni to'lashni bo'yniga oladi. Shundan so'ng asl qarzdor zimmasida hech narsa qolmaydi. Havolaning shariatga kiritilishiga Sunnat va Ijmo'dan dalillar bor."
        ]
    },
    {
        "word": "Havoriy ",
        "type": [],
        "definition": [
            "Havoriy – xos yordamchi."
        ]
    },
    {
        "word": "Havsala ",
        "type": [],
        "definition": [
            "Havsala – kufalik bir kishining ismi. Bu kishi Qutayba ibn Muslim bilan birga g'oziy sifatida Buxoroga kelgan. Keyinchalik Buxoroda qolib, shu yerda oilali bo'lgan. O'g'illari Abul Asad Ahmad ibn Ibrohim Havsala al-Kufiy al-Havsaliy Abu Ali Solih ibn Muhammad al-Bag'dodiy, Ibrohim ibn Ma'qal an-Nasafiy va Homid ibn Sahldan hadis rivoyat qilganlar. Hijriy 354 (milodiy 966) yilning zulqa'da oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Hadas ",
        "type": [],
        "definition": [
            "Hadas – tahoratsizlik, tahoratni ketkazuvchi sabab."
        ]
    },
    {
        "word": "Hadd ",
        "type": [],
        "definition": [
            "'Hadd' so'zi lug'atda 'ikki narsa orasidagi to'siq–chegara' ma'nosini anglatadi. Shariat istilohida esa aybdor uchun shariat bo'yicha belgilangan jazoga 'hadd' deyiladi."
        ]
    },
    {
        "word": "Haddod ",
        "type": [],
        "definition": [
            "arabcha so'z bo'lib, temirchi degan ma'noni anglatadi."
        ]
    },
    {
        "word": "Hadid surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 29 oyatdan iborat.\r\n    Bu surai karimaning nomi o'zidagi 'Va temirni tushirdik – unda katta kuch-quvvat va odamlar uchun manfaatlar bor' degan oyatdan olingandir. Temir arab tilida 'hadid' deyiladi.\r\n    Hadid surasi shariat hukmlari bilan birga, mo'minlar jamiyatini tarbiyalashga, sof aqiyda asosida musulmon shaxsni voyaga yetkazishga e'tibor beradi.\r\n    Suraning uchta asosiy mavzusi bordir:\r\n    1. Borliqning barchasi Allohniki: uni U Zotning O'zi yaratgan va O'zi qanday xohlasa, shunday tasarruf qiladi.\r\n    2. Allohning dini yo'lida mol va jonni fido qilish; haqiqiy mo'min bilan munofiq o'rtasida farq bo'lishi.\r\n    3. Bu dunyo hoyi-havasining aldamchi ekani, mo'min kishi oxiratni obod qilish uchun Allohning roziligini topishga harakat qilmog'i lozimligi.\r\n    Suraning avvalida Allohning ulug'ligi, Unga borliqdagi barcha narsa – inson, hayvon, daraxt va boshqalar tasbeh aytishi haqida so'z ketadi.\r\n    Alloh taoloning go'zal sifatlari, muqaddas ismlari eslatiladi.\r\n    So'ngra mo'minlar din yo'lida, Allohning roziligi uchun molu jonni sarflashga da'vat qilinadilar. Mo'minlar, mol-dunyo Allohniki, insonning qo'liga u omonat sifatida qo'yilgan, deb e'tiqod qilishlari lozimligi uqtiriladi. Hamda mo'minlardan molu pul sarflab, Allohning roziligini topishdan, haqiqiy komil iymonga erishishdan ularni nima to'sayotgani so'raladi.\r\n    Undan so'ng mo'minlar bilan munofiqlar taqqoslab ko'riladi. Mo'minlarning yo'llarini oldilarida va o'ng taraflarida nur yoritib ketishi, munofiqlar esa qorong'i zulmatda qolib, yo'l topa olmasliklari uqtiriladi.\r\n    Keyingi oyatlar dunyo bilan oxiratning haqiqatini juda noziklik bilan tasvirlaydi. Dunyo tezda quriydigan xashakka o'xshatiladi. Oxirat esa boqiylik, abadiylik diyori bo'lib, inson Allohning roziligiga erishishga urinishi lozim ekani ta'kidlanadi.\r\n    Shuningdek, surada payg'ambarlarni yuborishdan maqsad Allohga da'vat qilish, haqiqat va adolat o'rnatish ekani ta'kidlanadi.\r\n    Suraning oxirida payg'ambarlarga iymon keltirishga va Allohga taqvo qilishga da'vat qilinadi"
        ]
    },
    {
        "word": "Hadiy ",
        "type": [],
        "definition": [
            "'Hadiy' Makka miskinlariga qilinadigan sadaqadir"
        ]
    },
    {
        "word": "Hadis ",
        "type": [],
        "definition": [
            "Avvalo, shuni aytib o'tish joizki, 'hadis' va 'sunnat' so'zlari doimo bir-birining o'rnida ishlatilib kelgan. Ammo diqqat bilan qaralsa, hadis xosroq, sunnat umumiyroq ma'no kasb etishini ko'rish mumkin.\r\n    'Hadis' so'zining asl kelib chiqishi 'yangi hodisa', 'yangilik' degan ma'nodan olingan. Har bir aytilgan gap-so'z yangi hodisa bo'lgani uchun arablarda so'zni 'hadis' deyishgan.\r\n    Istilohda esa 'Hadis Nabiy sollallohu alayhi vasallamga nisbat berilgan so'z, fe'l, taqrir va xilqat – tana tuzilishi yoki xulqdagi sifat hamda siyrat – tarjimai hollardir'.\r\n    Buyuk muhaddis hofiz Ibn Hajar aytadi: 'Rasululloh sollallohu alayhi vasallamning o'zlari ham, u zotdan sodir bo'lgan barcha holatlar ham yangi paydo bo'lgan, ya'ni ularning ibtidosi bordir. Alloh taolo va U Zotning hamma ism va sifatlari esa qadim, ya'ni azaliydir. Shuning uchun 'hadis' so'zi azaliy bo'lmagan Rasululloh sollallohu alayhi vasallamdan sodir bo'lgan holatlarga qo'llanilgan'.\r\n    Shuningdek, sahobiy yoki tobe'inga nisbat berilgan so'z yoki fe'lga ham 'hadis' deyilaveradi. Gohida 'xabar', 'asar', 'rivoyat' va 'sunnat' so'zlari ham hadis ma'nosida, ya'ni Nabiy sollallohu alayhi vasallamning so'z, fe'l va sifatlariga nisbatan ham ishlatiladi. Demak, 'sunnat', 'asar', 'xabar' va 'rivoyat' lafzlari istilohiy ma'no jihatidan hadis so'zining ma'nodoshi sifatida ham keladi. Lekin ayrim ulamolar ushbu so'zlar ayrim jihatlarda bir-biridan biroz farq qilishini aytishgan.\r\n    'Xabar' o'tmish ma'lumotlarga dalolat qiluvchi so'z sifatida, 'asar' kimdandir iz bo'lib qolgan fe'l yo so'z ma'nosida bu maydonga kirgan. 'Rivoyat' esa biror kishining bevosita o'zi ko'rgan yoki eshitgan narsasini aniq naql qilib berishini anglatishi e'tiboridan hadis ma'nosini bildiradi. Zero, hadislar bevosita ko'rish va eshitish orqali naql qilingan. Shundan ma'lum bo'ladiki, islomiy ilmlarda, xususan hadis sohasida 'rivoyat' deganda afsonaviy yoki noaniq gaplarni emas, balki ilmiy ravishda asoslangan, qaysidir darajada o'z tasdig'ini topgan ma'lumotlar nazarda tutiladi.\r\n    'Sunnat' aslida 'odat', 'tariqat – ma'naviy yo'l' ma'nolarini anglatadi. 'Falonchining sunnati' degani uning hayot yo'li deganidir. Shundan kelib chiqib, 'Payg'ambar sollallohu alayhi vasallamning sunnatlari' deganda u zotning tariqatlari, yo'llari tushuniladi.\r\n    Hadis ilmi bilan shug'ullanuvchi olim 'muhaddis' deyiladi. Muhaddislar asosan hadisning Payg'ambarimiz sollallohu alayhi vasallamdan qaysi yo'llar bilan, kimlar orqali rivoyat qilinib, o'zlarigacha yetib kelganini aniqlaydigan olimlardir. Ular bu ulkan mas'uliyatli ishni amalga oshirishda juda aniq va ishonchli yo'llarni tanlashgan. Mazkur uslub va ilmiy yo'llar insoniyat tarixida umuminsoniy (gumanitar) ilmlarga asos bo'lgan."
        ]
    },
    {
        "word": "Hadis illatlari",
        "type": [],
        "definition": [
            "hadisni sahihlikdan man qiluvchi sabablar."
        ]
    },
    {
        "word": "Hadyi",
        "type": [],
        "definition": [
            "'Hadyi' 'hadya' so'zining jami bo'lib, haj yoki umraga chiqqan odam o'zi bilan birga qurbonlik qilish uchun olib chiqqan qo'y, echki, mol yoki tuyadan iborat hayvonga aytiladi. O'sha paytda Baytulloh ziyoratiga chiqqan odam bu hayvonlar qurbonlikka atalganini bildirish uchun bo'yniga xurmoning po'stlog'idan alomat–belgi ham osib qo'yar ekanlar. Buni ko'rgan odamlar u hayvonda tegmas, yo'qolib qolsa ham, Haramga borguncha yuraverar ekan."
        ]
    },
    {
        "word": "Haj ",
        "type": [],
        "definition": [
            "'Haj' so'zi lug'atda 'ulug' narsani qasd qilish'ga ishlatiladi. Islom shariatida: Haj – maxsus makonda, maxsus amallar bilan maxsus ibodatni ado etishdir. Maxsus zamon. Haj faqat maxsus vaqtda ado qilinadi. Xususan, uning bosh rukni Arafotda turish Zulhijja oyining to'qqizinchi kuni bo'lishi shart. Boshqa vaqtda har qancha tursa ham haj hisoblanmaydi. Maxsus makon. Haj ibodatini ado etish uchun Alloh taolo tomonidan iroda qilingan makonlar: Masjidul Harom, Arafot, Muzdalifa, Mino kabi joylar maxsus makondir. Boshqa joylarda bu ibodatlarni ado etish mumkin emas. Maxsus amallar. Bunda ehrom, Ka'bani aylanib tavof qilish, Safo va Marva orasida sa'yi qilish, Arafotda turish, Muzdalifada tunash, shaytonga tosh otish kabi amallar ko'zda tutilgan."
        ]
    },
    {
        "word": "Haj va umra bobidagi jinoyat",
        "type": [],
        "definition": [
            "'Haj va Umra bobidagi jinoyat' deb ehrom va hapam man' qilgan ishlarni qilishga aytiladi."
        ]
    },
    {
        "word": "Haj oylari",
        "type": [],
        "definition": [
            "Haj oylari Shavvol, Zulqa'da va Zulhijjaning o'n kunidan iborat."
        ]
    },
    {
        "word": "Haj surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 78 oyatdan iborat.\r\n    Ushbu surai karima ham o'zga madaniy suralar kabi shariat hukmlari haqida so'z yuritadi. Shu bilan birga, unda makkiy suralarga xos xususiyatlar ham yaqqol ko'zga tashlanadi. Iymon, tavhid, tahdid, ogohlantirish, qayta tirilish, mukofot va jazo masalalari muolaja qilinadi.\r\n    Surai karima Ibrohim alayhissalom Baytullohni qurib bo'lib, hajga da'vat qilganlarining xabarini bergani uchun ham 'Haj' deb atalgan. Ayni chog'da, unda haj ibodatiga oid masalalar ham bayon qilinadi.\r\n    Bu sura Nabiy sollallohu alayhi vasallam Makkai Mukarramadan Madinai Munavvaraga hijrat qilganlaridan keyin joriy etilgan shar'iy hukmlar haqida so'z yuritadi. Jumladan, iymon-e'tiqodni, dinu diyonatni himoya qilib, dushmanlar bilan urushish, Allohning yo'lida jihodga chiqish kabi masalalarga to'xtaladi.\r\n    Haj surasining avvalida qiyomat qoim bo'lishidan oldin ro'y beradigan qattiq zilzila qalblarni larzaga solishi, aqllarni boshdan uchirishi, insonning xayolini parishon qilishi, hatto emizikli ayollar bolalarini ham unutib yuborishlari, homiladorlar homilasini tashlab qo'yishi va boshqa holatlar ajoyib uslubda tasvirlanadi.\r\n    So'ngra qayta tirilish, savol-javob, jazo va mukofot haqida so'z ketadi. Kim yaxshilik qilgan bo'lsa, yaxshilikka erishishi, yomonlik qilgan bo'lsa, yomonlikka yetishishi bayon etiladi.\r\n    Shuningdek, surada qiyomat manzaralari ham chiziladi. Yaxshi kishilarning jannati na'imdagi, yomon kishilarning esa do'zaxi jahiymdagi holatlari vasf etiladi.\r\n    Undan keyin urushga izn berilishining hikmatlari bayon qilinadi. Zulm va tug'yon tufayli vayronaga aylangan shahar-qishloqlar haqida so'z boradi. Sabr qilganlarning oqibati go'zal bo'lishi uqtiriladi.\r\n    Suraning oxirida esa mushriklarning but-sanamlarga ibodat qilishlari noto'g'ri ekani, ular hammasi to'planib, bitta pashsha ham yarata olmasliklari ta'kidlanadi. Va, nihoyat, mo'minlarga nido yo'llanib, Robblariga ibodat qilishga, Allohning yo'lida jihodga chiqishga, aqiyda yo'lida kurashishga chaqiriladi."
        ]
    },
    {
        "word": "Hajar ",
        "type": [],
        "definition": [
            "Hajar – Madinaga yaqin shaharlardan biri. U yerdagi xumlar haqida tinglovchilarda yetarli tasavvur bo'lgani uchun mazkur daraxt mevalari ularga tashbeh qilingan."
        ]
    },
    {
        "word": "Hajr ",
        "type": [],
        "definition": [
            "'Hajr' so'zi 'man' qilish' ma'nosini anglatadi. 'Muxtasari Viqoya'da hajr quyidagicha ta'rif qilingan: 'Hajr' qavl(gap)ning o'tishini man' qilishdir. Boshqa ba'zi hanafiylarning ta'rifida 'Hajr maxsus narsalardan man' qilishdir'. Hajrning sababi kichiklik, jinnilik va qullikdir. Ular hajrni buzib amal qilsalar, to'lab beradilar. 'Hajr' lug'atda yana 'qotirish' ma'nosini ham anglatadi. Buni hozirgi kunda ajnabiy istilohdan tarjima qilib 'muzlatish' deb atalmoqda. Hajr holatlaridan biri, yetimning yoshi kichik bo'lsa unga hajr joriy qilinadi. Chunki, kichkina bolalar o'ziga merosga qolgan mollarni mustaqil tasarruf qila olmaydilar, hayotni bilmaslik oqibatida molni noto'g'ri sarf qilib, undan ajralib qolishi mumkin."
        ]
    },
    {
        "word": "Hajrul-yamoma",
        "type": [],
        "definition": [
            "Hajrul-Yamoma – Saudiyaning hozirgi poytaxti Riyoz o'rnida joylashgan qadimiy shaharning nomi. U Vodil-quroda joylashgan. U yerda qadimiy arab qabilalari, jumladan, Samud qavmining bir qismi istiqomat qilgan. Hozirda ham bu joylarni 'Madoinu Solih' deb atashadi."
        ]
    },
    {
        "word": "Hajun ",
        "type": [],
        "definition": [
            "Hajun – Baytullohdan taxminan bir yarim mil (2,772 km) uzoqlikdagi tepalik."
        ]
    },
    {
        "word": "Hazar ",
        "type": [],
        "definition": [
            "Safarning ziddi hazardir. 'Hazar' degani safarmas holat, hozir turgan holat, deganidir"
        ]
    },
    {
        "word": "Haydar al-Buxoriy al-Junaydiy",
        "type": [],
        "definition": [
            "Abu Muhammad Haydar ibn Muhammad al-Buxoriy al-Junaydiy Buxoro ahlidan bo'lib, mashhur olimlardan. Hotam ibn Ahmad as-Sayrafiy al-Buxoriy va Abu Muhammad Abdurahmon ar-Roziydan hadis rivoyat qilganlar. Bu kishidan esa Abu Sa'd al-Idrisiy al-Hofiz hadis rivoyat qilganlar va shunday deganlar: 'Hijriy 357 (milodiy 969) yili Buxoroda va hijriy 360 (milodiy 972) yili Samarqandda biz u kishidan hadis yozib olganmiz'."
        ]
    },
    {
        "word": "Haydar Rumiy",
        "type": [],
        "definition": [
            "(h. 780-854). Bu zotning to'liq ismi – Haydar ibn Ahmad ibn Ibrohim Abulhasan Rumiy Hanafiy. Sherozda tug'ilgan. Otasidan va boshqa ustozlardan dars olgan. Allomai Taftazoniy rahmatullohi alayhi va Sayyid Sharif Jurjoniy rahmatullohi alayhiga shogird tushgan. Qohirada yashagan va o'sha yerda vafot etgan."
        ]
    },
    {
        "word": "Haydar Sheroziy",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining shogirdi. Bu zotning to'liq ismi Burhonuddin Haydar ibn Muhammad ibn Ibrohim Sheroziy bo'lib, Sherozdagi madrasada mudarris bo'lgan. Haydar Sheroziy rahmatullohi alayhi ko'plab kitoblar yozgan. Jumladan, u kishining quyidagi asarlarini eslab o'tishimiz mumkin:\r\n    1. 'Iyzoh fiy sharhi Iyzohil Ma'oniy'.\r\n    2. 'Hoshiyatun 'alal Kashshof'.\r\n    3. 'Sharhi Faroizi Sirojiya'.\r\n    4. 'Sharhul Mavoqif'."
        ]
    },
    {
        "word": "Hayz ",
        "type": [],
        "definition": [
            "'Hayz' lug'atda 'oqish' ma'nosini bildiradi. Shariatda esa, balog'atga yetgan ayol jinsining rahmi ichidan tug'ishsiz, bemorliksiz muayyan muddatda chiqadigan qon hayzdir. Odatda, hayzning rangi qoramtir, o'zi haroratli va og'riq ila keladigan bo'lib, hidi noxush bo'ladi."
        ]
    },
    {
        "word": "Hayit ",
        "type": [],
        "definition": [
            "Bayram"
        ]
    },
    {
        "word": "Hays ",
        "type": [],
        "definition": [
            "Hays – qurigan xurmo, yog' va tolqon aralashmasidan tayyorlanadigan taom."
        ]
    },
    {
        "word": "Hayya alal falah",
        "type": [],
        "definition": [
            "Najotga kelinglar, shoshilinglar."
        ]
    },
    {
        "word": "Hayya alas solah",
        "type": [],
        "definition": [
            "Namozga kelinglar, shoshilinglar"
        ]
    },
    {
        "word": "Hakam ibn Hazan al-Kulafiy",
        "type": [],
        "definition": [
            "Hakam ibn Hazan al-Kulafiy Tamim qabilasidan bo'lganlar.\r\n    Rasululloh sollallohu alayhi vasallamning huzurlariga kelganlarida u zot bu kishini mehmon qilganlar. Rasululloh sollallohu alayhi vasallamning suhbatlarida bo'lib, bir nechta hadislar rivoyat qilganlar."
        ]
    },
    {
        "word": "Hakim az-Zaymuniy",
        "type": [],
        "definition": [
            "Abu Muhammad Hakim ibn Muhammad az-Zaymuniy - Buxoroning Zaymun nomli qishlog'i ahlidan bo'lib, Shofe'iy mazhabining mashhur faqihlaridan edilar. Hijriy 375 (milodiy 986) yili Marvda Imom Abu Abdulloh al-Xizriydan fiqh ilmidan ta'lim olganlar. Kalom ilmidan esa ustoz Abu Ishoq Ibrohim ibn Muhammad al-Isfaroiniydan ta'lim olganlar. Hijriy 416 (milodiy 1026) yilning rabi'ul avval oyida Buxoroda vafot etib, xonaqoh ro'parasidagi 'Ra'su sikka as-suffa'da (Sufa ko'chasining boshida) dafn qilinganlar. Qabrlari taniqli va tabarruk. Hakim az-Zaymuniy haqlarida Abu Komil al-Basiriy 'Muzofot' kitoblarida shunday deganlar: 'Abu Muhammad Hakim ibn Muhammad az-Zaymuniy 'Imomu ahl al-hadis' (muhaddislar imomi) va mening shayxim edilar. Kalom ilmida (Ash'ariy ta'limoti) tengi yo'q olim bo'lib, shu fandan dars berardilar'."
        ]
    },
    {
        "word": "Hakim al-Xunaliqiy ad-Darbandiy",
        "type": [],
        "definition": [
            "Hakim ibn Ibrohim al-Xunaliqiy ad-Darbandiy faqih, fozil, g'amxo'r olimlardan edilar. Bag'dodda Imom Abu Homid al-G'azzoliy bilan maslakdosh bo'lganlar. Ko'p hadis bilardilar va hadislarni o'z qo'llari bilan ko'chirardilar. Xattot ham bo'lganlar. Buxoroda yashaganlar. Hijriy 538 (milodiy 1144) yil shavvol oyining o'n ikkinchisida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Hakim ar-Romaniy",
        "type": [],
        "definition": [
            "Abu Ahmad Hakim ibn Luqmon - ar-Romaniy Buxoroning Romaniy nomli qishlog'idan bo'lib, Abu Abdulloh ibn Abu Hafs al-Buxoriy va Fath ibn Abu Ulvon al-Buxoriydan hadis rivoyat qilganlar. O'zlaridan esa Abul Hasan Ali ibn Hasan al-Qozi hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Haqiyqiy najosat",
        "type": [],
        "definition": [
            "Lug'atda: qon, siydik kabi ayni iflos narsadir. Shariatda: namozni man' qiladigan ifloslik haqiyqiy najosatdir."
        ]
    },
    {
        "word": "Haqqo surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 52 oyatdan iborat.\r\n    Bu surai karima o'zining birinchi so'zini o'ziga nom qilib olgan. 'Al-haqqo' so'zi lug'atda 'haqiqatda bo'luvchi' degan ma'noni bildirib, qiyomat kunining nomlaridan biridir.\r\n    Bu surai karima boshqa suralar kabi aqiyda va iymonning sobit bo'lishiga qaratilgan bo'lib, unda qiyomat va uning dahshatlari, oxirat shiddatlari, Od, Samud, Lut, Fir'avn va Nuh qavmlariga o'xshash buzg'unchi, dinga qarshi bo'lgan qavmlarning oqibati nima bo'lgani haqida zikr qilinadi.\r\n    Shuningdek, Alloh subhanahu va taolo bu surada baxtiyorlar va badbaxtlar haqida ham xabar qiladi.\r\n    Ushbu suraning nozil bo'lishidan asosiy maqsad Qur'oni Karim ilohiy kalom ekanining haqligini va Nabiy alayhissalom adashganlar tomonidan qilinayotgan tuhmatlardan pok ekanlarini isbot qilishdir.\r\n    Sura qiyomat kuni dahshatlari va uni yolg'onga chiqarganlarning o'sha paytdagi ahvoli qanday kechishining vasfi bilan boshlanadi. So'ngra dudga (qiyomat surnayiga) puflanganda, olamning xarob bo'lishi, tog'larning parchalanishi, osmonlarning yorilishi kabi fojialar zikr qilinadi.\r\n    Undan keyin o'sha qo'rqinchli Kunda (qiyomatda) kim baxtiyoru kim badbaxt bo'lishi, baxtiyorlarga amal kitoblari (ya'ni bu dunyoda qilgan ishlari yozilgan nomai a'mollari) o'ng qo'llaridan berilib, hurmat va ulug' ne'matlarga erishishlari, kofirlarning amal kitoblari esa cHar taraflaridan berilib, xoru zor bo'lishlari vasf qilinadi.\r\n    Nabiy alayhissalom Qur'oni Karimning oyatlari qanday nozil bo'lgan bo'lsa, shunday, omonat bilan yetkazishlarining hujjat-burhoni zikr qilinadi.\r\n    Va, nihoyat, surai karima Qur'oni Karimni ulug'lash, u mo'minlar uchun rahmat va kofirlar uchun hasrat kitobi ekanini ta'kidlash bilan tamom bo'ladi."
        ]
    },
    {
        "word": "Halqa ",
        "type": [],
        "definition": [
            "ilm majlisi."
        ]
    },
    {
        "word": "Halol ",
        "type": [],
        "definition": [
            "ruxsat berilgan, erkin, bog'lanmagan; qonuniy, ijozat berilgan; haromning ziddi; Alloh yoki payg'ambar alayhissalom tomonlaridan mumkinligi belgilangan amal yoki narsalar"
        ]
    },
    {
        "word": "Hamd ",
        "type": [],
        "definition": [
            "maqtov, sano."
        ]
    },
    {
        "word": "Hamd al-Buxoriy al-Birmasiy",
        "type": [],
        "definition": [
            "Abu Muhammad Hamd ibn Amr al-Buxoriy al-Birmasiy Birmas qishlog'idan bo'lib, Muhammad ibn Ibrohim al-Buxoriydan hadis rivoyat qilganlar. Al-Birmasiydan esa Ibrohim ibn Nuh ibn Siddiq al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Hamdon al-Kafsisavoniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Fazl Hamdon ibn Yahyo al-Kafsisavoniy al-Buxoriy Buxoroning Kafsisavon nomli qishlog'idan. Humayd ibn Qutayba, Bujayr ibn Nazr va Muhammad ibn Solimdan hadis rivoyat qilganlar. O'zlaridan Muhammad ibn Zabyon hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Hamza Kufiy qiroati",
        "type": [],
        "definition": [
            "Imom Hamza ibn Habib ibn Ammora ibn Ismoil ¬Zayyot Taymiy. U kishi hijriy 80 yilda tug'ilib, 156 sanada vafot etgan.\r\n     U kishining ikki roviylari – Xalaf va Xallod."
        ]
    },
    {
        "word": "Hammod as-Saffor",
        "type": [],
        "definition": [
            "Abul Mahomid Hammod ibn Ibrohim as-Saffor adabiyot va usul ilmlarini yaxshi bilardilar. Buxorodagi Masjidi Kalon jome' masjidida imom edilar. Juma kunlari kishilarga shu masjidda o'z risolalarini o'qib berardilar. Otalaridan va Abu Ali Ismoil ibn Ahmad al-Bayhaqiydan hadis ilmidan ta'lim olganlar."
        ]
    },
    {
        "word": "Hammod ibn Zayd",
        "type": [],
        "definition": [
            "Hammod ibn Zayd ibn Dirham Azdiy al-Jahzamiy, kunyalari Abu Ismoil al-Basriy. Bu zotning ko'zlari ojiz edi.\r\n    Abdurrahmon ibn Mahdiy:\r\n    'Basra ahli orasida Hammoddan ko'ra sunnatni va hadisni biluvchiroq kishini ko'rmadim', deb aytadilar.\r\n    Abdurrahmon ibn Mahdiy yana:\r\n    'Hammod yashagan zamonda to'rtta imom bor edi. Kufada Sufyon as-Savriy, Hijozda Molik, Shomda Avzoiy, Basrada esa Hammod ibn Zayd edilar', deb aytadilar.\r\n    Bu zot hadislarni Sobit al-Banoniy, Osim al-Axvaliy, Abu Jamra az-Zab'iy, Amr ibn Dinor va yana bir qancha tobe'inlardan rivoyat qildilar.\r\n    Bu zot hijratning 179-sanasida vafot etdilar."
        ]
    },
    {
        "word": "Hamnishin",
        "type": [],
        "definition": [
            "suhbatdosh, hamsuhbat."
        ]
    },
    {
        "word": "Hanafiy mazhabidagi birinchi darajadagi kitoblar",
        "type": [],
        "definition": [
            "Bu darajadagi kitoblarni 'Usul' deb ataladi. Mazkur darajadagi kitoblarni 'Zohirur rivoya' deb ham ataladi. Ular imom Abu Hanifa, Abu Yusuf va Muhammadning qavllarini o'z ichiga olgan bo'lib, imom Muhammad tomonidan ta'liyf qilingan. Ular quyidagi kitoblar: 1. 'Kitobul asl'. Bu kitobning ikkinchi nomi 'Mabsut'. 2. 'Kitobuz-ziyodot'. 3. 'Kitobul Jome'us-Sag'ir'. 4. 'Kitobul Jome'ul Kabir'. 5. 'Kitobus-Siyaris-Sag'ir'. 6. 'Kitobus-Siyaril Kabir'."
        ]
    },
    {
        "word": "Hanafiy mazhabidagi ikkinchi darajadagi kitoblar",
        "type": [],
        "definition": [
            "Bu darajadagi kitoblarni 'Navodir' deb ataladi. Ular mazhabning katta imomlaridan rivoyat qilingan bo'lib, mazkur olti kitobga kirmay qolgan masalalardir. Navodir kitoblarga imom Muhammadning o'sha mash-hur olti kitobidan boshqa 'Kasaniyot', 'Horuniyot', 'Jurjoniyot', 'Ruqayyot' kitoblari va Hasan ibn Ziyodning kitoblariga o'xshash kitoblar kiradi. Mashhur olim Ibn Obidiyn bu haqda quyidagilarni yozadi: 'O'shandoq kitoblar jumlasiga Abu Yusufning 'Amoliy' kitoblari kiradi. 'Amoliy' imloning jam'idir. Bunda, mujtahid o'tirganda uning atrofiga shogirdlari qog'oz-qalamlarini olib o'tiradi. So'ng, olim ilmda Alloh unga bildirgan narsani yoddan gapiradi. Shogirdlar uni yozib boradi. Keyin, yozgan narsalarini jamlab kitob qiladilar. Ana o'shani 'imlo' yoki 'amoliy' deb ataydilar. O'tgan fuqaho, muhaddis va arab tili olimlarining shundoq odati bor edi'. Bu darajadagi kitoblar avvalgi darajadagi kitoblardan past hisoblanadi. Agar bir masala usulda va navodirda kelgan bo'lsa, usuldagisi olinadi."
        ]
    },
    {
        "word": "Hanafiy mazhabidagi uchinchi darajadagi kitoblar ",
        "type": [],
        "definition": [
            "Fatvolar va voqe'alar kitoblari. Bunda keyin kelgan mujtahidlar mazhabning avvalgi mujtahidlaridan rivoyat kelmagan masalalarda o'zlaridan savol so'ralganda bergan javoblari yig'ilgan bo'ladi."
        ]
    },
    {
        "word": "Hanafiy faqihlari beshinchi tabaqasi",
        "type": [],
        "definition": [
            "Taqlidchi faqihlardan tarjih sohiblari tabaqasi. Bu tabaqadagi ulamolar bir hukmning ikkinchisidan ustun ekanini aniqlashadi. Ularga hanafiy ulamolardan Abul Hasan al-Karxiy, Burhoniddin Marg'inoniy va boshqalar kiradi"
        ]
    },
    {
        "word": "Hanafiy faqihlari birinchi tabaqasi",
        "type": [],
        "definition": [
            "Bu tabaqaga shariat miqyosida ijtihod qilgan ulkan imomlar, mazhabboshi faqihlar va ularning darajasidagi zotlar kiradilar. To'rt mazhab boshlig'i bo'lgan imomlarimiz mana shu birinchi tabaqaga kiradilar. Ular fiqh-ning asl qoidalarini ishlab chiqadilar, shar'iy dalillardan far'iy hukmlarni chiqaradilar. Ular hech kimga taqlid qilmaydilar. Bu tabaqa ijtihodning eng oliy tabaqasidir."
        ]
    },
    {
        "word": "Hanafiy faqihlari yettinchi tabaqasi",
        "type": [],
        "definition": [
            "Semizdan oriqni, ho'ldan quruqni, o'ngdan chapni ajrata olmaydigan taqlidchilar tabaqasi. Bularga mutlaqo yaqinlashmaslik zarur."
        ]
    },
    {
        "word": "Hanafiy faqihlari ikkinchi tabaqasi",
        "type": [],
        "definition": [
            "Mazhab mujtahidlari tabaqasi. Birinchi tabaqa sohiblarining shogirdlaridan bu tabaqa faqihlari chiqqan. Misol uchun, Abu Hanifaning shogirdlari Abu Yusuf va Muhammad ibn Hasan Shayboniy ikkinchi tabaqaga kiradilar. Bu tabaqadagi faqihlar shar'iy dalillardan o'z ustozlari ishlab chiqqan qoidalar asosida shar'iy hukmlarni chiqaradilar. Ular asosiy qoidalarga tegmagan holda ba'zi far'iy hukmlarda ustozlariga xilof qilishlari mumkin. Agar asl qoidalarda xilof qilsa, mazhabdan chiqqan bo'ladi."
        ]
    },
    {
        "word": "Hanafiy faqihlari oltinchi tabaqasi",
        "type": [],
        "definition": [
            "Kuchli va o'ta kuchli, mazhabda bor va zaif, zohir rivoyat va nodir rivoyat orasidagi farqni biladigan ulamolar tabaqasi. 'Kanz', 'Muxtor', 'Majma'' va 'Viqoya' kabi kitoblarning mualliflari xuddi mana shu tabaqadagi faqihlar hisoblanadilar. Ular ham o'z kitoblarida nomaqbul gaplar va zaif rivoyatlarni naql qilmaydilar."
        ]
    },
    {
        "word": "Hanafiy faqihlari toʻrtinchi tabaqasi",
        "type": [],
        "definition": [
            "Bu tabaqadagi faqihlar ijtihod darajasiga yetmagan bo'ladilar. Ularga faqihlarimizdan Roziy misol bo'la oladi. Ularni 'ashobi tarjih' deb ataladi. Ular o'zlari ijtihod qila olmasalar ham, usulni yaxshi o'zlashtirganlari va hukmni qayerdan olishni bilganlari uchun ikki tomonga burib yuborish mumkin bo'lgan gaplarning qay biri to'g'ri ekanini aniqlaydilar va shunga o'xshash kichikroq ishlarni qiladilar."
        ]
    },
    {
        "word": "Hanafiy faqihlari uchinchi tabaqasi",
        "type": [],
        "definition": [
            "Mazhabboshi imomdan rivoyat qilinmagan masalalarda ijtihod qiladigan faqihlar tabaqasi. Bu tabaqadagi mujtahidlarga Hanafiy mazhabida Xassof, Tohoviy, Shamsul Aimma al-Halvoniy, Shamsul Aimma as-Saraxsiy, Faxrul Islom al-Bazdaviy, Faxriddin Qozixon va boshqalar kiradi. Bu tabaqadagi faqihlar shayxlarga asl¬larda ham, far'larda ham xilof qila olmaydilar. Ular o'z shayxlari ishlab chiqqan qoidalar asosida mazkur shayx¬lardan bir rivoyat qolmagan masalalarda hukmlar chiqaradilar. Bu tabaqa ijtihod tabaqalarining eng pasti hisoblanadi"
        ]
    },
    {
        "word": "Hanzala ",
        "type": [],
        "definition": [
            "Hanzala – qovoqsimonlar sinfiga, tarvuzsimonlar oilasiga mansub, ta'mi achchiq poliz ekini va uning mevasi; ruschada kolotsint."
        ]
    },
    {
        "word": "Hanif ",
        "type": [],
        "definition": [
            "chinakam e'tiqod qiluvchi, taqvodor."
        ]
    },
    {
        "word": "Haniflik ",
        "type": [],
        "definition": [
            "Haniflik – Ibrohim alayhissalomning dini. 'Hanif' so'zi aslida 'qing'ir qadam bosadigan', 'maymoq' degani bo'lib, Ibrohim alayhissalom o'z qavmining shirk dinidan yuz o'girgani uchun u kishini shunday deb nomlashgan edi. Keyin Alloh taolo bu sifatni nohaqlikdan haq tomon yurish mazmunida Ibrohim alayhissalom uchun maqtov qilib berdi va u kishi e'tiqod hamda amal qilgan tavhid dini shu nom bilan ataladigan bo'lib qoldi."
        ]
    },
    {
        "word": "Hantam ",
        "type": [],
        "definition": [
            "Hantam – loy, jun va qon aralashmasidan yasaladigan xum."
        ]
    },
    {
        "word": "Hanut ",
        "type": [],
        "definition": [
            "Hanut – faqat mayyit uchun ishlatiladigan ma'lum xushbo'ylik."
        ]
    },
    {
        "word": "Haram ",
        "type": [],
        "definition": [
            "U yerda har xil yomonliklar, qon to'kishlar, urush qilish, ov ovlash, maysalarni yulish, daraxtlarni sindirish kesish kabi ishlar harom qilingandir. Bu o'rinda faqat Ka'bai Muazzama binosi yoki Ka'ba atrofidagi Masjidul Haromgina ko'zda tutilmaydi. Balki Makkai Mukarrama atrofidagi belgilangan muayyan mintaqa ham nazarda tutiladi. Hozirgi kunda o'sha chegaradan musulmon bo'lmaganlar kirmasligi yozib qo'yilgan va taftish ham bor. O'sha mintaqa 'Haram' deyiladi va u yerda ayrim ishlar harom hisoblanadi."
        ]
    },
    {
        "word": "Haramayn ",
        "type": [],
        "definition": [
            "ikki haram (Ka'ba va Payg'ambarimiz sollallohu alayhi vasallamning masjidlari)"
        ]
    },
    {
        "word": "Harom ",
        "type": [],
        "definition": [
            "Shariat tark qilishni shubhasiz qat'iy dalilga suyanib jazm ila talab qilgan narsa haromdir."
        ]
    },
    {
        "word": "Harom roʻza",
        "type": [],
        "definition": [
            "Bu turdagi ro'zani hanafiylar: makruhi tahrimiy ham deydilar. Bunday ro'zalar bir necha xildir: 1. Ayol kishining erining iznisiz yoki roziligini bilmay turib nafl ro'za tutishi. 2. Shak kuni ro'za tutish. 3. Ro'za hayiti kuni, Qurbon hayiti kuni va undan keyingi uch kunning ro'zasini tutish. 4. Hayzli va nifosli ayolning ro'za tutishi. 5. Ro'za tutsa halok bo'lishini bilib turib ro'za tutgan odamning ro'zasi."
        ]
    },
    {
        "word": "Harra ",
        "type": [],
        "definition": [
            "'Harra' so'zi qotib qolgan lavadan hosil bo'lgan qora toshli joyni anglatadi."
        ]
    },
    {
        "word": "Haruriy ",
        "type": [],
        "definition": [
            "iroqning Haruro degan joyiga nisbat berilgan. Ular xavorijlar ham deyiladi."
        ]
    },
    {
        "word": "Haruriylar ",
        "type": [],
        "definition": [
            "Haruriylar – xavorijlar. Ular musulmonlar ommasidan ajrab, ilk bor Kufaga qarashli Haruriya degan qishloqda to'planishgani uchun haruriylar ham deyiladi."
        ]
    },
    {
        "word": "Haruriya ",
        "type": [],
        "definition": [
            "Xavorijlardan bo'lib, Kufa yaqinidagi Haruro degan joyda turganlar. Ular gunohkor mo'min do'zaxda abadiy qoladi, gunohi kabira qilgan mo'min esa kofirdir, deydilar."
        ]
    },
    {
        "word": "Harsho ",
        "type": [],
        "definition": [
            "Harsho – Tihoma yurtidagi tog' nomi bo'lib, u Madina bilan Shom orasida joylashgan. Shuningdek, uning vodiysida joylashgan Juhfaga yaqin qishloq ham shu nom bilan atalgan."
        ]
    },
    {
        "word": "Hasad ",
        "type": [],
        "definition": [
            "Ko'rolmaslik"
        ]
    },
    {
        "word": "Hasan al-Andaqiy",
        "type": [],
        "definition": [
            "Abu Muhammad Hasan ibn Husayn al-Andaqiy - Abdulkarim al-Andaqiyning nabiralari. O'z davrlarining tariqat, tasavvuf ilmi mashoyixlaridan edilar. Bu kishi umrlarini muridlar tarbiyalash bilan o'tkazdilar. Muhammad alayhissalomning sunnati-saniyalariga, odoblariga olimu omil edilar. Insonlarni Allohga ibodat qilishga, ibodat va riyozatni lozim tutishga da'vat etardilar. Yusuf ibn Ayyub al-Hamadoniyning xos va sevimli muridlaridan bo'lib, u zot bilan Xorazm, so'ngra Bag'dodga birga borganlar. Birinchi marta u kishini Marvda 'Shayx' xonaqohida, keyinchalik Buxoroda ko'rdim va u zotdan ko'p rivoyat yozib oldim. Hasan al-Andaqiy meni nihoyatda hurmatlardilar. Men u kishidan shayx Yusuf al-Hamadoniy rivoyat qilgan hadislardan ta'lim oldim. Hijriy 460 (milodiy 1069) yilda tug'ilib, hijriy 552 (milodiy 1158) yil ramazon oyining 27-tunida (Laylatul-qadr kechasi)da vafot etganlar"
        ]
    },
    {
        "word": "Hasan al-Attobiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdurahmon Hasan ibn Usmon al-Attobiy al-Buxoriy - Ubayda ibn Bilol al-Ammiy va Muhammad ibn Fazldan hadis rivoyat qilganlar. O'zlaridan esa Hafs ibn Dovud ar-Rabi'iy hadis rivoyat qilganlar.\r\n    Bag'dodning g'arbiy tomonida 'al-Attobin' degan mahalla bor. Biroq Hasan al-Attobiy bunga daxldor emaslar."
        ]
    },
    {
        "word": "Hasan al-Bordiziy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ali Hasan ibn Zahhok al-Bordiziy al-Buxoriy - Buxoroning Bordiza qishlog'ining nisbati bilan mashhurdirlar. Ali ibn Nazr at-Tavovisiydan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Yusuf va Abu Bakr Sahl ibn Usmon as-Sulamiy hadis rivoyat qilganlar. Hijriy 326 (milodiy 939) yilning sha'bon oyida vafot etganlar."
        ]
    },
    {
        "word": "Hasan al-Buxoriy az-Zohiriy",
        "type": [],
        "definition": [
            "Abu Ali Hasan ibn Ya'qub al-Buxoriy az-Zohiriy Buxoro ahlidan. Katta bobolarining ismi Zohir bo'lganligi uchun bu kishiga ushbu nisbat berilgan. Abu Zarr Ammor ibn Muxlid al-Bag'dodiy, Abu Bakr Ahmad ibn Muhammad va Abu Ishoq Ibrohim ibn Muhammad ar-Roziydan ta'lim olganlar. O'zlaridan esa Buxoroda Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz ta'lim olganlar. Hijriy 449 yoki 459 (milodiy 1058 yoki 1068) yilda vafot etganlar."
        ]
    },
    {
        "word": "Hasan al-Muazzin al-Labbod al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ali Hasan ibn Husayn al-Muazzin al-Labbod al-Buxoriy Yungdan bosib tayyorlanadigan kigiz sotib, kun kechirganlari uchun Labbod nisbati berilgan. Ali ibn Hakam al-Marvaziy va Muhammad ibn Muqotil al-Marvaziydan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Ahmad as-Sa'doniy va Muhammad ibn Sobir al-Buxoriy hadis rivoyat qilganlar. Hijriy 271 (milodiy 885) yilda vafot etganlar."
        ]
    },
    {
        "word": "Hasan al-Mustamliy al-Yashkuriy",
        "type": [],
        "definition": [
            "Hasan ibn Abdulmalik al-Ansoriy al-Mustamliy al-Yashkuriy Buxoro ahlining Bani Yashkur qabilasidan edilar. Imom al-Buxoriy shayxlarining mustamliysisi (kotibi) edi. Al-Mustamliy Buxoro shayxlaridan bo'lib, o'z zamonalarida qutb edilar. Buxoroda Ahmad ibn Abdulloh al-Muzaniy, Xalaf ibn Muhammad al-Xayyom al-Buxoriy va Bag'dod ulamolaridan ta'lim olganlar. Ko'p shogirdlar chiqarganlar. Hijriy 393 (milodiy 1004) yilning rabi'ul oxir oyida namozdan oldin Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Hasan an-Nuriy",
        "type": [],
        "definition": [
            "Qozi Abu Ali Hasan ibn Ali an-Nuriy Abu Muhammad Abdusamad ibn Ibrohim al-Hanzaliydan hadis rivoyat qilganlar. O'zlaridan esa Abu Hafs Umar ibn Muhammad an-Nasafiy hadis rivoyat qilganlar va aytadilar: 'Hasan an-Nuriy hijriy 451 (milodiy 1060) yilning safar oyida tavallud topib, Nurda hijriy 518 (milodiy 1125) yilning jumodul avval oyida vafot etganlar'."
        ]
    },
    {
        "word": "Hasan as-Sabiʼiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ali Hasan ibn Usmon as-Sabi'iy al-Buxoriy Ifriqiyada (Afrika) tug'ilib, Iroqda o'sganlar. O'zlaridan nevaralari Abu Zakariyo Yahyo ibn Ismoil ibn Hasan va Ya'qub ibn Ibrohim hadis rivoyat qilganlar. Hijriy 229 (milodiy 845) yili Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Hasan as-Samarqandiy al-Andoqiy",
        "type": [],
        "definition": [
            "Abu Ali Hasan ibn Ali as-Samarqandiy al-Andoqiy Samarqandning Andoq qishlog'idan. 'Ibn Abul Hasan al-Andoqiy' nomi bilan tanilgan edilar."
        ]
    },
    {
        "word": "Hasan at-Todiziy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ali Hasan ibn Zahhok at-Todiziy al-Buxoriy Buxoro ahlidan. Ujayf ibn Odam al-Buxoriy, Abu Abdulloh ibn Abu Hafs al-Buxoriy va Asbot ibn Yasa'dan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Muhammad ibn Husayn al-Muqri hadis rivoyat qilganlar. Hijriy 326 (milodiy 939) yilning sha'bon oyida vafot etganlar."
        ]
    },
    {
        "word": "Hasan ibn Ali roziyallohu anhu",
        "type": [],
        "definition": [
            "Hasan ibn Ali ibn Abu Tolib Hoshimiy al-Qurashiy, kunyalari Abu Muhammad. U kishining onalari olamdagi ayollarning sayyidasi, Rasululloh sollallohu alayhi vasallamning qizlari Fotimai Zahrodirlar.\r\n    Rasululloh sollallohu alayhi vasallamning nabiralari va bu dunyodagi rayhonlari, xulafoi roshidinlarning beshinchisi va oxirgisi, o'n ikki imomning ikkinchisi, jannatdagi yoshlarning sayyidi, fasohatli so'z ustasi, yaxshilikni xush ko'ruvchi, oqil, halim, oliyjanob insonlardan edi.\r\n    Hasan ibn Ali roziyallohu anhu hijratning uchinchi yili Madinada tavallud topdilar. Rasululloh sollallohu alayhi vasallam bu kishini juda ham yaxshi ko'rar edilar.\r\n    Baro ibn Ozib:\r\n    'Rasululloh sollallohu alayhi vasallam kichik Hasanni tizzalariga qo'yib olib:\r\n    'Ey Alloh, bu Hasanni yaxshi ko'raman, sen ham uni yaxshi ko'r', deb duo qilar edilar'.\r\n    Hijratning 40-yili otalari Ali o'ldirilgach, Iroq ahli Hasanga bay'at berdilar. Hasan bilan bo'lgan kishilar Muoviya bilan jang qilishni maslahat qildilar. Muoviya bu xabarni eshitib, askarlarini urush holatiga tayyorladi. Askarlar 'Maskan' degan joyda to'qnashganlarida Hasan bu urushda musulmonlarning qoni ko'p to'kilajagini ko'rib, Muoviyani sulhga chaqirdilar. Oradan olti oy o'tgach, hijratning 41-yili xalifaliklarini Muoviyaga topshirdilar. Fitnalar barham topib, musulmonlar so'zi jam bo'lganligi uchun bu yilni 'Omul jamoa' yili deb nomlashdi.\r\n    Haqiqatda, mana shu yerda Rasululloh sollallohu alayhi vasallamning mo''jizalari zohir bo'ldi. Chunki Rasululloh sollallohu alayhi vasallam:\r\n    'Bu nabiram Hasan sababli Alloh musulmonlar orasidagi jamoatni isloh qiladi', deb marhamat qilgan edilar.\r\n    Imom Hasan Rasululloh sollallohu alayhi vasallamdan bir nechta hadislar rivoyat qildilar.\r\n    Shuningdek, u kishi otalari Alidan, inilari Husaynlardan ham rivoyat qilganlar.\r\n    Bu zotdan Oisha, Sha'biy, Suvayd ibn Hafla, Shaqiq ibn Salama, Hubayra ibn Yarim, Musay¬yib ibn Najoba, Muoviya ibn Xudayj, Ishoq ibn Bashshar, Muhammad ibn Siriyn va boshqalar rivoyat qilganlar.\r\n    Bu kishi rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n     Hasan ibn Ali hijratning 50-yili vafot etdilar va Baqiy' qabristoniga dafn etildilar"
        ]
    },
    {
        "word": "Hasba kechasi",
        "type": [],
        "definition": [
            "Hasba kechasi – Muhassabda tunaladigan kecha. Muhassab – Makka bilan Mino orasidagi vodiyning nomi bo'lib, hojilar haj amallarini tugatib, Minodan qaytishda o'sha yerda tunab qolishadi."
        ]
    },
    {
        "word": "Hasbiyalloh ",
        "type": [],
        "definition": [
            "'Hasbiyalloh' iborasi 'Kifoyachim Allohning O'zi' degan ma'noni ifodalaydi."
        ]
    },
    {
        "word": "Hatiym ",
        "type": [],
        "definition": [
            "Ka'bai Muazzama yonida poydevopga o'xshatib ko'tapilib qo'yilgan joy"
        ]
    },
    {
        "word": "Hafs al-Buxoriy al-Kirmoniy",
        "type": [],
        "definition": [
            "Abu Amr Hafs ibn Amr al-Buxoriy al-Kirmoniy yoki Karmoniy Buxoroning Kirmoniya qishlog'i ahlidan. Haj qilib Bag'dodga borib, Shujo ibn Majo al-Kushoniydan hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Hafs al-Gʻuzashfardariy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Umar Hafs ibn Umar al-G'uzashfardariy al-Buxoriy - Buxoroning G'uzashfardar qishlog'idan bo'lib, Abu Sulaymon Muhammad ibn Mansur al-Balxiy va Sulaymon ibn Dovud al-Hiraviydan hadis rivoyat qilganlar. O'zlaridan esa Balxda Abu Hafs Ahmad ibn Qosim al-Buxoriy hadis rivoyat qilganlar. Hijriy 324 (milodiy 937) yilning safar oyida vafot etganlar"
        ]
    },
    {
        "word": "Hafs al-Paykandiy al-Fagʻishtiy",
        "type": [],
        "definition": [
            "Abu Umar Hafs ibn Mansur ibn Fag'isht al-Paykandiy al-Fag'ishtiy Buxoro ahlidan. Abdulloh ibn Muborak, Abu Ismat Nuh ibn Jome'dan ta'lim olganlar. O'zlaridan esa Muhammad ibn Salom al-Paykandiy hadis rivoyat qilganlar. Muhammad ibn Salom aytadilar: 'Ma raaytu rajulan onasa vara'an minhu' (Undan parhezkor do'st kishini ko'rmaganman). Al-Fag'ishtiylar uch aka-uka bo'lganlar: Hafs, Havozan va G'olib"
        ]
    },
    {
        "word": "Hashafa",
        "type": [],
        "definition": [
            "Hashafa – g'o'r holida shoxida qoqi bo'lib qolgan sifatsiz xurmo."
        ]
    },
    {
        "word": "Hashiyatul iydohi fil maʼaniy val bayan li Jalaliddin al Qozviniy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari"
        ]
    },
    {
        "word": "Hashr surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 24 oyatdan iborat.\r\n    Eng avval 'hashr' so'zining lug'aviy ma'nosiga to'xtalsak. 'Hashr' – 'ko'chirish', 'yashab turgan joyini tark ettirib, ikkinchi bir shaharga chiqarish' kabi ma'nolarni anglatadi. Bu suraning bevosita tafsiriga o'tishdan avval o'sha paytdagi Madina shahridagi ahvolga bir nazar tashlamog'imiz lozimdir.\r\n    Islom din sifatida joriy etila boshlagan dastlabki paytda yahudiylar Yasrib (Madinai Munavvaraning eski nomi) shahrida, shuningdek, Xaybar, Fidik va boshqa shaharlarda istiqomat qilardilar. Payg'ambarimiz Muhammad alayhissalom Makkadan hijrat qilib, Yasribga kelganlaridan so'ng ular bilan qo'shni bo'lib yashay boshladilar. O'sha paytda yahudiylar uch toifa edilar: Banu Qaynuqo', Banu Nazir va Banu Qurayza. Hashr surasi mana shu uch toifadan biri – Banu Nazir qabilasining Yasribdan chiqarilishi qissasini hikoya qiladi.\r\n    Banu Nazir qabilasi Nabiy alayhissalom bilan urushmaslik, bir-biriga ozor bermaslik va Payg'ambarimizning dushmanlariga yordam bermaslikka ahdlashib, u zot bilan shartnoma tuzadi.\r\n    Rasululloh Badr urushida g'olib kelgach, ular: 'Tavrotda sifati kelgan Payg'ambar shu bo'ladi, uning bayrog'i hech qachon past bo'lmaydi', deb yurdilar. Ammo musulmonlar Uhud urushida mag'lub bo'lganlaridan so'ng, Rasululloh bilan qilingan ahdnomani buzdilar. Ularning yo'lboshchisi Ka'b ibn Ashraf qirqta otliq bilan Makkaga bordi va Quraysh qabilasini Muhammad alayhissalomga qarshi kurashga ko'ndirdi. Farishta Jabroil alayhissalom bu xabarni tezda Muhammad alayhissalomga yetkazdi. Buning ustiga, Ka'b ibn Ashraf Nabiy alayhissalomni qattiq hajv qildi. Shunda ul zoti bobarakotning iznlari bilan Muhammad ibn Salama Ka'bni o'ldirdi. Bu voqeadan so'ng Banu Nazir qabilasi yanada junbushga keldi. Ular Rasulullohga ochiq-oydin xiyonat qilish yo'liga o'tib oldilar.\r\n    Voqea quyidagicha sodir bo'lgandi:\r\n    Nabiy alayhissalomning sahobalaridan birlari Amr ibn Umayya Zomriy yanglishib, Banu Omir qabilasidan ikki kishini o'ldirib qo'yadi. Rasululloh kelishilgan ahdnomaga binoan, o'ldirilgan kishilarning xunini to'lashda yordam so'rab, Banu Nazir qabilasiga boradilar. Ular yashaydigan uylardan birining devori tagida o'tiradilar. Yahudiylar tomdan kelib, Nabiy alayhissalomning ustilariga katta bir xarsang toshni tashlab, o'ldirmoqchi bo'ladilar. Shunda Jabroil alayhissalom Rasulullohga bu fitnaning xabarini yetkazadi va u kishi birdan o'rinlaridan turib, Madinaga qarab jo'naydilar. Sahobalar esa ul zotdan bir oz keyin qaytadilar.\r\n    Yahudiylarning bu jinoyatkorona harakatidan so'ng Rasululloh ularga qarshi urush ochishga qaror qiladilar. Urushga tayyorgarlik ko'rishga buyuradilar.\r\n    Musulmonlar yetib kelishganda, Banu Nazir o'z qo'rg'onlari ichiga berkinib olgan edi. Nabiy alayhissalom ulardan qo'rg'onlarini tashlab, o'n kun muddat ichida Yasribdan chiqib ketishni talab qiladilar. Yahudiylar o'zlarining kuchsiz ekanliklarini sezib, Nabiy alayhissalomning hukmlariga bo'ysunishdan o'zga chora topolmaydilar. Lekin Banu Avf qabilasiga mansub bir guruh munofiqlar ularga: 'Sobit turinglar, biz sizni yolg'iz qo'ymaymiz. Agar sizga qarshi urush bo'ladigan bo'lsa, biz sizlar bilan birgamiz. Agar sizlar Yasribdan quvib chiqariladigan bo'lsangiz, birga chiqamiz', – deb xabar beradilar.\r\n    Banu Nazir qabilasi joylashgan qo'rg'onlar juda ham mustahkam bo'lib, uni qisqa muddatda ishg'ol qilish amri mahol edi. Shuning uchun ham Nabiy alayhissalom ularning xurmolarini kesib, qo'rg'on atrofiga yig'ishga va o't qo'yishga buyuradilar. Yahudiylar olov o'rtasida qoladilar. Endi ular uchun faqat ikki yo'l bor edi: yo Nabiy alayhissalomning talablariga ko'nish, yoki qo'rg'ondan chiqib, urushish. Ular birinchi yo'lni tanlaydilar. O'n kunlik qamaldan so'ng Banu nazirliklar Payg'ambar alyhissalomdan gunohlarini kechishlarini hamda ko'chib ketishga izn berishlarini so'raydilar. Har bir kishi qurol-yarog'dan tashqari, mol-mulkidan bir tuyadan yuk oladigan bo'ladi. So'ng Yasribni tark etib, Xaybarga, ba'zilari esa Shomga jo'nab ketadilar.\r\n    Hashr surasi yahudiylarning xiyonati avj olgan shunday bir paytda nozil bo'lgan.\r\n    Suraning bosh mavzusi – Banu Nazir qabilasining holatini bayon etish. Shuning uchun ham sahobalardan Abdulloh ibn Abbos roziyallohu anhu bu surani 'BanuNazir surasi deb ham ataganlar.\r\n    Surai karima Allohni poklab va ulug'lab yod etish bilan boshlanadi. Borliqdagi barcha narsalar – inson, hayvon, nabotot, boringki, barcha mavjudot Allohni ulug'laydi.\r\n    So'ngra sura mustahkam qo'rg'onlari bilan faxrlanib, 'Bizga hech kim qo'l tekkiza olmaydi', deb yurgan yahudiylarning o'zlari kutmagan ishlar bo'lib, ko'chirilishlaridan hikoya qiladi. Surada kofirlar bilan bo'lgan urushlarda qo'lga olingan o'ljalarni qanday taqsimlashning ham bayoni keladi. Bu o'ljalarni miskin, bechoralarga berish qat'iy ta'kidlanadi.\r\n    Nabiy alayhissalomning sahobalari – muhojirlar va ansoriylar haqida ham bir necha oyatlar keladi.\r\n    Ayni chog'da, yahudiylar bilan til biriktirgan xoin-munofiqlar haqida ham oyatlar bor.\r\n    Surai karimada Haq subhanahu va taolo mo'minlarga qo'rqinchli oxirat kunini eslatib, u Kunda nasl-nasab ham, mol-dunyo, bola-chaqa ham hech qanday foyda bermasligini, yana takror bo'lsa-da, ta'kidlaydi. Suraning so'ngida Alloh taoloning oliymaqom sifatlariyu, go'zal ismlari zikr qilinadi."
        ]
    },
    {
        "word": "Hiba ",
        "type": [],
        "definition": [
            "'Hiba' manfaat beradigan narsani birovga yetkazishdir. Hanafiy fuqaholar istilohida esa: Hiba muayyan molni birovga evazsiz mulk qilib berishdir. Bundan vaqtinchaliq foydalanib turish uchun yoki ijaraga berilgan narsalar hiba bo'lmasligi bilinadi. Shariatda hiba mandub amal hisoblanadi."
        ]
    },
    {
        "word": "Hibara ",
        "type": [],
        "definition": [
            "'Hibara' – Yamanning mashhur kiyimi."
        ]
    },
    {
        "word": "Hidayatul baroroh fiy tatmimatil ʼasharoh",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Hidoya",
        "type": [],
        "definition": [
            "Burhoniddin Marg'inoniyning kitobi"
        ]
    },
    {
        "word": "Hidoyat ",
        "type": [],
        "definition": [
            "chin e'tiqod yo'lidan yurish; Allohning o'z bandalari uchun ko'rsatgan eng to'g'ri yo'li."
        ]
    },
    {
        "word": "Hijr ",
        "type": [],
        "definition": [
            "Hijr – Ka'baning tarnovi tomonda yarim aylana shaklida past devor bilan o'rab qo'yilgan joy. Aslida Ibrohim alayhissalom qurganlarida Ka'ba o'sha yerdan bo'lgan. Bu joy 'Hatim' yoki 'Hijri Ismoil' ham deyiladi."
        ]
    },
    {
        "word": "Hijr surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 99 oyatdan iborat.\r\n    Surai karimaga nom bo'lib qolgan 'Hijr' so'zi undagi qissalarning birida Samud qavmi yashagan vodiyning ismi sifatida zikr qilingan.\r\n    Surai karima Makkai Mukarramada Yusuf surasidan keyin nozil bo'lgan. Bu paytda Islom da'vati og'ir kunlarni boshidan kechirayotgan edi. Bir yilning ichida Payg'ambarimiz Muhammad sollallohu alayhi vasallamga eng yaxshi yordamchi bo'lmish ikki shaxs – amakilari Abu Tolib va Xadiyja onamiz vafot etgan, o'sha sana 'mahzunlik yili' deb e'lon qilingan edi. Bundan foydalangan mushriklar Nabiy sollallohu alayhi vasallamga, musulmonlarga va Islomga qarshi hamlasini nihoyatda kuchaytirgan payt edi. Musulmonlar bosh ko'tarolmay, qadam bosa olmay qolganlaridan, dinlari va diyonatlarini saqlash maqsadida ona yurtlari – aziz Makkani tashlab, hijrat qilishga majbur bo'ldilar. Ha, Hijr surasi ana shunday shiddatli, shafqatsiz bir paytda – xafagarchilik yili bilan hijrat yili orasida nozil bo'ldi. Shuning uchun ham o'sha qiyin payt bu suraning oyatlari nihoyasida o'z aksini topdi.\r\n    Mushriklarning ozorlari avjiga chiqqan, Muhammad sollallohu alayhi vasallam va sahobai kiromlar og'ir kunlarni boshlaridan kechirar edilar. Islom da'vati deyarli qotib qolgan, joyidan qimirlamas edi. Shu sababli bu surada o'tgan payg'ambarlar va ummatlar tarixida yuz bergan xuddi shunga o'xshash holatlarning qissalari keltiriladi. Bu avvalo, Payg'ambar Muhammad sollallohu alayhi vasallam va sahobalarga tasalli bo'lsa, ikkinchi tomondan mushriklarga tahdid va eslatma edi.\r\n    Hijr surasida asosan Islomni inkor etuvchilarning tabiati va ularning inkorlari sabablari haqida so'z ketadi. Oqibatlari nima bo'lgani gapiriladi.\r\n    Surai karimaning avvalida kufr ahlini ogohlantiruvchi oyatlar keladi. Ulardan keyin kofirlar tomonidan Payg'ambar sollallohu alayhi vasallamga ozor berilishi, u kishiga tuhmat va noma'qul taklif qilishlari, Allohning Qur'onni muhofaza etish haqidagi va'dasi va avval o'tganlarda ham shunga o'xshash holat bo'lganligini eslatuvchi tasallisi keladi. Borliqdagi ba'zi ko'rinishlar: osmon va uning burjlari, yer va undagi tog'lar, nabotot, shamollar, suv kabi narsalar esga olinadi. Undan keyin Odam Ato va shayton qissasi keltiriladi. So'ngra Ibrohim, Lut, Shu'ayb va Solih alayhissalomlarning qissalari o'ziga xos uslub ila bayon etiladi.\r\n    Nihoyada esa osmonlaru yerni yaratishdagi haqiqat, qiyomatning albatta bo'lishi, shuning uchun boshqa narsalarga e'tibor bermay, Allohdan qolmaslik zarurligi haqida so'z ketadi."
        ]
    },
    {
        "word": "Hijrat",
        "type": [],
        "definition": [
            "ko'chib o'tish, safar qilish. Musulmonlarning Makka fathiga qadar Makkadan Madina va Habashistonga qilgan safarlari."
        ]
    },
    {
        "word": "Hijriy yil",
        "type": [],
        "definition": [
            "Muhammad alayhissalomning Makkadan Madinaga hijrat qilishlari (ko'chishlari)dan hisoblana boshlangan va 622 milodiy yilning 16 iyulidan amalga kiritilgan sana (yil) nomi. Hijriy yil xalifa Umar ibn Xattob roziyallohu anhu tomonidan 17\/638 yilda joriy etilgan."
        ]
    },
    {
        "word": "Hizqil (Hizqiyol) alayhissalom",
        "type": [],
        "definition": [
            "Yusha' ibn Nun alayhissalomdan keyin Banu Isroilning ishini Hizqil alayhissalom davom ettirdilar. Ammo u kishining faoliyatlari uzoq davom etmadi. Hizqil alayhissalomdan keyin Banu Isroil ko'plab firqalarga bo'linib ketdi va ularning ahvoli yomonlashdi. Bu qavm yer yuzida fisqu fasod bilan mashg'ul bo'lishdi, nabiylarini qatl etishdi. Shu sababli Alloh subhanahu va taolo ularning ustidan dushmanlarini g'olib qildi, ular qatl qilgan nabiylar o'rniga tug'yonga ketgan jabbor podshohlarni yubordi. Natijada ular Banu Isroilning qonini zulm ila to'kishdi, beayov azoblashdi. Banu Isroilga G'azo va Asqalon ahli ham g'olib kelib, ulardan muqaddas tobutni tortib olishdi.\r\n     Shu davrdan boshlab Banu Isroildan nubuvvat kesildi, ularning davlati parchalanib ketdi. Ish shu holda davom etib, oradan taqriban to'rt yuz yil o'tdi. Keyin Alloh taolo ularga Shamvil* alayhissalomni nabiy qilib yubordi.\r\n    * Arab tilida yana Ashmuvil, ibroniyda Shamuel, lotin tilida Samuel, ruschada Samuil deb ataladi."
        ]
    },
    {
        "word": "Hiyna",
        "type": [],
        "definition": [
            "'Hiyna' so'zi Qur'onda soat, qirq yil va olti oy ma'nosida ishlatilgan. Hanafiy mazhabi 'Ishlarning yaxshisi o'rtachasidir' degan qavlga binoan o'rtachasi, olti oyni olgan. 'Hiyna' so'zi 'olti oy' ma'nosini anglatishiga dalil Qur'oni Karimning 'Ibrohim' surasidagi quyidagi oyatdir: 'Robbi izni ila har doim mevalarini berib turadir' (25-oyat). Biz 'hiyna'ni 'har doim' deb tarjima qilganmiz. 'Zamon' so'zi ham hiyna kabidir."
        ]
    },
    {
        "word": "Hiyra ",
        "type": [],
        "definition": [
            "Hiyra – Furot daryosi yaqinidagi shahar."
        ]
    },
    {
        "word": "Hiqqa ",
        "type": [],
        "definition": [
            "uch yoshli urg'ochi tuya"
        ]
    },
    {
        "word": "Hil",
        "type": [],
        "definition": [
            "'Hil' deganda miyqot bilan haramning orasidagi yerlar tushuniladi."
        ]
    },
    {
        "word": "Hill ",
        "type": [],
        "definition": [
            "Hill – Haram hududidan tashqari joylar. Haram hududida ma'lum ishlar harom qilingani uchun u yer 'haram' deyilgan bo'lsa, uning tashqarisida mazkur harom qilingan ishlar halol bo'lgani uchun u yerlar 'hill', ya'ni 'halol' degan nomni olgan."
        ]
    },
    {
        "word": "Hilob ",
        "type": [],
        "definition": [
            "Hilob – bitta tuyaning suti sig'adigan hajmdagi idish."
        ]
    },
    {
        "word": "Himyar ",
        "type": [],
        "definition": [
            "Himyar – Yamandagi qadimiy o'lka. Busro – Shomdagi shahar. Makka bilan Himyarning orasi ham, Makka bilan Busroning orasi ham taxminan 1200 1300 kilometr keladi."
        ]
    },
    {
        "word": "Hisomuddin ibn Ali ibn Muhammad Abiyavardiy",
        "type": [],
        "definition": [
            "Bu olim otasiga o'xshab xatiblik ham qilgan. Shuning uchun ikkovlari ham Xatibiy deb nomlanadi. Hisomuddin ibn Ali ibn Muhammad Abiyavardiy Allomai Taftazoniy rahmatullohi alayhini uzoq vaqt o'ziga ustoz deb bilib, u kishining etagini tutgan, u zot bilan birga yurgan. U kishi bir qancha kitoblar yozgan, jumladan, mantiq va hikmat bobida Omuriyning 'Sharhi Matolu'ul anvor' kitobiga hoshiya va 'Rabi'ul jinon fil Ma'oniy va bayan' kitoblarini ta'lif qilgan."
        ]
    },
    {
        "word": "Hissiy moneʼlik",
        "type": [],
        "definition": [
            "'Hissiy mone'lik' deganda, er bemorligi tufayli vaqtincha jinsiy aloqaga yaramay turgani ko'zda tutiladi. Shuningdek, ayolning farjida to'siq bo'lib, jinsiy aloqaga mone' bo'lishi ham hissiy mone'likka kiradi."
        ]
    },
    {
        "word": "Hittotun ",
        "type": [],
        "definition": [
            "'Hittotun' kalimasi 'kechib yubor', 'mag'firat qil', degan ma'nolarni bildiradi."
        ]
    },
    {
        "word": "Hifz ",
        "type": [],
        "definition": [
            "xotira, aql-zakovat, eslash, yodda saqlash."
        ]
    },
    {
        "word": "Hishom ibn Urva",
        "type": [],
        "definition": [
            "Hishom ibn Urvaning kunyalari Abu Munzir. Bu zot tobe'inlardan bo'lib, hijratning 61-yili Madinada tavallud topdilar. Ibn Umar, Sahl ibn Sa'd, Jobir, Anas ibn Molik kabi sahobalar bilan ko'rishganlar.\r\n    Hishom ibn Urva hadis olimlaridan bo'lib, hadis to'plash uchun Kufa, Bag'dod kabi shaharlarga safar qilganlar.\r\n    Hadislarini otalaridan, amakilari Abdulloh ibn Zubayrdan, shuningdek, Avf ibn Horis, Abu Salama, Vahb ibn Kasonlardan rivoyat qilganlar.\r\n    Bu zotdan Ayub Sijistoniy, Ibn Ishoq, Yunus ibn Yaziyd, Muhammad ibn Ja'far, Yahyo ibn Abdulloh va boshqalar rivoyat qildilar.\r\n    Hishom ibn Urva 400dan ziyod hadis rivoyat qildilar. Hijratning 146-yili Bag'dodda vafot etdilar."
        ]
    },
    {
        "word": "Hojati asliya",
        "type": [],
        "definition": [
            "insondan halokatni fe'lan qaytaradigan, yeb-ichib, kiyishga ketadigan nafaqa, yashash joyi, urush anjomlari yoki halokatni farazan qaytaradigan narsalar: qarz, hunar asboblari, uy anjomlari, minishga ulov, ilm kitoblari (johillik–halokat) kabi narsalardir."
        ]
    },
    {
        "word": "Hojib az-Zohid al-Vazviniy",
        "type": [],
        "definition": [
            "Abu Muhammad Hojib az-Zohid al-Vazviniy Iso ibn Muso al-G'unjor, Ka'b ibn Sa'id va boshqalardan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari Idris ibn Hojib al-Vazviniy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Hokim ",
        "type": [],
        "definition": [
            "hal qiluvchi, hakam."
        ]
    },
    {
        "word": "Homa ",
        "type": [],
        "definition": [
            "'Homa' so'zi tunda uchib yuradigan qushni bildiradi. 'Homa yo'q', degani o'sha qush baxtsizlik keltiradi, deb e'tiqod qilish yo'q, deganidir. Shuningdek, johiliyat davri arablarida 'Bir inson o'ldirilsa yu, qasosi olinmasa, uning ruhi qush bo'lib kezib, o'chi olinmaguncha: 'Menga suv beringlar, menga suv beringlar', deb yuradi. O'chi olingach, uchib ketadi', degan e'tiqod bo'lgan. Ana shuni 'homa' deb atashgan. Islom bunday e'tiqodni ham inkor qilgan."
        ]
    },
    {
        "word": "Homid al-Foriziy",
        "type": [],
        "definition": [
            "Abu Bakr Homid ibn Ubaydulloh al-Foriziy Amakilari Muhammad ibn Qutayba va Abu Sukayn Zakariyo ibn Yahyodan hadis rivoyat qilganlar. O'zlaridan esa Abu Ali Muhammad ibn Mahmud al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Horis an-Naqqol",
        "type": [],
        "definition": [
            "Abu Umar Horis ibn Surayj an-Naqqol asli xorazmlik bo'lib, Bag'dodda yashaganlar. Imom Shofeiyning 'ar-Risola' kitoblarini Abdurahmon ibn Mahdiy (Alloh rahmat qilsin)ga naql qilganlari uchun ushbu nisbat bilan mashhur bo'lganlar. Mu'tamir ibn Sulaymon va Iroq ulamolaridan ta'lim olganlar. O'zlaridan esa Abu Abdulloh Ahmad ibn Hasan as-Sufiy, Abul Qosim al-Bag'aviy va Hasan ibn Sufyon ta'lim olganlar. Hijriy 230 (milodiy 846) yili Bag'dodda vafot etganlar."
        ]
    },
    {
        "word": "Horis as-Sudoiy",
        "type": [],
        "definition": [
            "Ziyod ibn al-Horis as-Sudoiy roziyallohu anhu Rasululloh sollallohu alayhi vasallamga bay'at qilgan ulug' sahobiylardandir.\r\n    Rasululloh sollallohu alayhi vasallam bu kishining qavmlariga askar jo'natmoqchi bo'lganlarida Ziyod ul zotdan qavmlarini yana bir bor Islomga chaqirishni so'raydilar. Ziyod ibn al-Horis as-Sudoiy roziyallohu anhu qavmlariga borib, ularni Islomga da'vat qiladilar. So'ngra Rasululloh sollallohu alayhi vasallamning huzurlariga qavmining Islom diynini qabul qilganini aytib keladilar. Shundan so'ng Rasululloh sollallohu alayhi vasallam: 'Qavming gapingni qaytarmas ekan', deb, Ziyod ibn al-Horis as-Sudoiy roziyallohu anhuni ularga boshliq qilib tayinlaydilar.\r\n    U kishi Rasululloh sollallohu alayhi vasallamdan ko'plab hadislar rivoyat qildilar. Bu zotdan Ziyod ibn Na'iym al-Hazramiy, Abdul¬g'affor ibn Maysara, o'g'illari Rofe' va boshqalar rivoyat qilganlar."
        ]
    },
    {
        "word": "Horun al-Buxoriy al-Muabbir",
        "type": [],
        "definition": [
            "Ibrohim ibn Horun ibn Mahlab al-Buxoriy al-Muabbir – ta'birshunos. Nasr ibn Muhammad al-Qalonasiydan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Horun al-Hofiz",
        "type": [],
        "definition": [
            "Abu Muso Horun ibn Ahmad al-Hofiz Buxoro ahlidan bo'lib, 'al-Xarodiniy' nomi bilan tanilgan edilar. Muhammad ibn Ayyub ar-Roziy, Ibrohim ibn Yusuf va Ahmad ibn Umardan hadis rivoyat qilganlar. Hijriy 343 (milodiy 955) yilning rabi'ul avval oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Horun ash-Sharafdaniy",
        "type": [],
        "definition": [
            "Abu Imron Horun ibn Ash'as ash-Sharafdaniy Sharafdan qishlog'ida yashar edilar. Bani Hoshimning mavlolari Abu Sa'iddan va Abdulloh ibn Valid al-Abdiydan hadis rivoyat qilganlar. O'zlaridan esa Fazl ibn Muhammad al-Bayhaqiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Horuniyot",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Hotam al-Marvaziy al-Gʻijduvoniy",
        "type": [],
        "definition": [
            "Abu Sa'id Hotam ibn Nasr al-Marvaziy al-G'ijduvoniyning otalari marvlik bo'lib, o'zlari G'ijduvonda yashaganlar. Abu Naim Fazl ibn Dikkin, Ahmad ibn Hafs va Imom al-Buxoriyning ustozlari Muhammad ibn Salom al-Paykandiydan hadis rivoyat qilganlar. O'zlaridan esa Ibrohim ibn Horun ibn Muhlab hadis rivoyat qilganlar. Hijriy 264 (milodiy 878) yilning ramazon oyida vafot etganlar."
        ]
    },
    {
        "word": "Hotam al-Ushmiyuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Hotam ibn Qudayd al-Ushmiyuniy al-Buxoriy Ushmiyun qishlog'idan. U kishidan Imom Muhammad ibn Ismoil al-Buxoriy va Ubaydulloh ibn Vosil al-Buxoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Hotam ar-Razmonoxiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Sa'id Hotam ibn Muhammad ar-Razmonoxiy al-Buxoriy - Buxoroning Razmonox nomli qishlog'idan. Abu Muhammad Abdulloh ibn Muhammad al-Hiraviy, Xalaf ibn Omir, Sahl ibn Mutavakkildan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Hofiz ",
        "type": [],
        "definition": [
            "300 mingdan ziyod hadislarni yod olgan va ularning roviylarini bilgan shaxs."
        ]
    },
    {
        "word": "Hoshid al-Agʻzuniy",
        "type": [],
        "definition": [
            "Abu Abdurahmon Hoshid ibn Abdulloh al-Ag'zuniy - Ag'zun qishlog'idan bo'lib, Abdulloh ibn Muso, Abu Naim Fazl ibn Muso va Talha ibn G'anomdan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Ahmad ibn Abdulvohid al-Buxoriy hadis rivoyat qilganlar. Hijriy 250 (milodiy 865) yilda vafot etganlar."
        ]
    },
    {
        "word": "Hoshiya ",
        "type": [],
        "definition": [
            "kitoblarning yon tarafiga yozilgan sharhlar, qo'shimcha va izohlar."
        ]
    },
    {
        "word": "Hoshiyatun alal Kashshof",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu asari tafsirga oid bo'lib, alloma Zamaxshariy rahmatullohi alayhining mashhur 'Kashshof' tafsirining Fotiha surasi va Baqara surasining 'Albatta, Alloh chivin va undan ustunroq narsalarni misol qilib keltirishdan uyalmas...' oyatigacha yozilgan hoshiyadan iborat."
        ]
    },
    {
        "word": "Hoshiyatun alat Talviyh",
        "type": [],
        "definition": [
            "Bu asar Sodrushshariy'a Ubaydulloh ibn Mas'ud Buxoriy rahmatullohi alayhining usulul fiqh ilmi bo'yicha bitgan 'Tanqiyhul usul' kitobiga Allomai Taftazoniy rahmatullohi alayhi bitgan 'At-Talviyh 'alaa tavziyhi g'avomizit tanqiyh' nomli asariga Sayyid Sharif Jurjoniy rahmatullohi alayhi tomonidan yozilgan hoshiyadan iboratdir."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa Anvorut tanzil lil Bayzoviy",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu kitobi tafsir ilmiga oid bo'lib, u Qozi Bayzoviy rahmatullohi alayhining mashhur 'Anvorut tanziyl va asrorul ta'viyl' nomli mashhur tafsiriga yozilgan hoshiyadan iboratdir."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa Lavomiʼul asror sharhi Matoliʼul anvor",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Bu kitob Sirojuddin Armoviyning mantiq bo'yicha yozgan 'Matoli'ul anvor' kitobiga Qutbuddin Roziy tomonidan yozilgan sharhga yozilgan hoshiyadan iboratdir.\r\n    Bu kitob hozirda chop qilingan."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa tashyidil qavoid sharhi tajriydil aqoid lil Asfihoniy",
        "type": [],
        "definition": [
            "Bu kitob aqoid ilmiga oid bo'lib, Sayyid Sharif Jurjoniy rahmatullohi alayhi uni mashhur olim Nasriddin Tusiy rahmatullohi alayhining 'Tajriydul aqoid' nomli kitobiga shayx Shamsuddin Asfihoniy rahmatullohi alayhi yozgan sharhga hoshiya tarzida yozgan."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa sharhi Muxtasaril Muntahiy",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining asari. Bu kitob shayx Azudiddin Iyjiyning usulul fiqh ilmi bo'yicha Ibn Hojibning 'Muxtasar'iga yozgan sharhining hoshiyasidir. Bu kitob ham chop qilingan."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa sharhi Hidoyatul hikmati",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Bu kitob Muhammad ibn Muborakshoh rahmatullohi alayhining Asiyriddin Abhuriyning mantiq borasidagi kitobiga yozgan sharhiga bitilgan hoshiyadan iboratdir."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa sharhi Hikmatul ayni",
        "type": [],
        "definition": [
            "'Hikmatul ayn' kitobi shayx Nasriddin Tusiyning shogirdi bo'lmish alloma Najmuddin Abulhasan Ali ibn Muhammad Kotibiy Qazviniyning mantiq ilmiga oid kitobidir. Bu kitobga mavlono Shamsiddin Muhammad ibn Muborakshoh Burhoniy sharh yozgan. Sayyid Sharif Jurjoniy rahmatullohi alayhi mazkur sharhga hoshiya yozgan. Bu kitob hozirgi zamonda bir necha marta chop qilingan."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa sharhil Viqoya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu asari hanafiy fiqhiga oid bo'lib, unda Sodrush-shariy'aning 'Viqoyatur-rivoya fiy masoilil Hidoya' nomli kitobining sharhiga hoshiya bitilgandir."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa sharhil Kofiya",
        "type": [],
        "definition": [
            "Bu kitob nahv ilmiga oid bo'lib, Ibn Hojibning mashhur 'Kofiya' asarining Roziyuddin Astrobodiy tomonidan qilingan sharhiga Sayyid Sharif Jurjoniy rahmatullohi alayhi yozgan hoshiyadir. Bu kitob ham chop qilingan."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa sharhil Mutovval",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu kitobi ma'oniy va bayon ilmiga oid bo'lib, Xatib Qazviniyning 'Talxiys' nomli kitobiga Allomai Taftazoniy rahmatullohi alayhi yozgan 'Mutovval' nomli sharhning hoshiyasidir. Bu kitob ham chop qilingan."
        ]
    },
    {
        "word": "Hoshiyatun ʼalaa sharhish Shamsiya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Bu asar mantiq ilmiga oid bo'lib, Najmiddin Kotibiy Qazviniyning 'Shamsiya' nomli kitobiga shayx Qutbiddin Roziy yozgan 'Tahriri qavoidil mantiqiyya' nomli sharhiga yozilgan hoshiyadir. Bu kitob ham chop qilingan."
        ]
    },
    {
        "word": "Hoshiyatun ʼalal Mishkot",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu asari mashhur 'Mishkotul Masobiyh' kitobiga shayx Tibbiy yozgan hoshiyaning talxiysidan iboratdir. 'Mishkotul Masobiyh' kitobi Movarounnahr va Xuroson diyorlarida qadimdan hadis ilmi bo'yicha darslik kitobi bo'lgan va bo'lib kelmoqda."
        ]
    },
    {
        "word": "Hubla ",
        "type": [],
        "definition": [
            "Hubla – butasimon dukkakli daraxt, akas (akatsiya) daraxtining bir turi. Samura ham deyiladi."
        ]
    },
    {
        "word": "Hud alayhissalom",
        "type": [],
        "definition": [
            "Hud alayhissalomning nasablari Nuh alayhissalomga borib taqaladi. Hud alayhissalomning qavmlari u zotning katta bobolari Od nomi bilan ataladi.\r\n    Od qavmi boida – yo'q bo'lib ketgan, eng qadimgi arablardan hisoblanadi.\r\n    Od qavmi o'zining sarkashligi bilan mashhurdir. Shuning uchun ham ularning o'z payg'ambarlari Hud alayhissalom bilan bo'lib o'tgan qissalari 'Od qavmi qissasi' deyiladi. Od qavmi ham ikkiga bo'linadi: birinchi Od va ikkinchi Od. Hud qavmi birinchi Oddir.\r\n    Bu qavm Arabiston yarimorolining janubida, Yaman bilan Umon oralig'idagi Hazramavtning shimolida, ko'chib yuruvchi qumliklarda, Ahqof nomli joyda yashab o'tishgan. Ular baland bo'yli, keng yag'rinli kishilar bo'lib, haybatli chodirlarda yashashgan. Shuning uchun ham Od qavmi o'z zamonasidagi 'eng quvvatli kishilar' deb talqin qilinadi.\r\n    Ular doimo: 'Qani, bizdan ham kuchli odamlar bormi?' deb maqtanib yurishardi. Ularning gavdalari katta bo'lsa-da, aqllari qisqa edi, doimo but-sanamlarga sig'inib, ularni himoya qilish uchun urushib yurishardi.\r\n    Alloh taolo ularni hidoyatga boshlash uchun o'zlaridan bo'lgan Hud alayhissalomni payg'ambar qilib tanladi.\r\n    Hud alayhissalom ham, xuddi Nuh alayhissalom kabi, qavmiga Allohga ibodat qilish zarurligini, Allohdan o'zga ibodatga loyiq zot yo'qligini tushuntirdilar. Shuningdek, ularni taqvoga, Allohdan qo'rqishga chaqirdilar. Zero, ularga payg'ambar yuborgan Zot yagona, ularga ko'rsatma bergan Zot birdir. Xo'sh, Hud alayhissalomning qavmi nima qildi?\r\n    Bu zolim qavm Allohning payg'ambariga 'Sen esipastsan. Sen yolg'onchisan', dedi. O'z qavmidan bunday qabih tuhmatni eshitgan Hud alayhissalom aytdi:\r\n    'Ey qavmim, menda esipastlik yo'q. Lekin men olamlarning Robbidan rasuldirman. Sizlarga Robbimning risolatlarini yetkazaman va men sizlarga ishonchli nasihatgo'yman. O'zingizdan bo'lgan bir kishiga sizlarni ogohlantirish uchun Robbingizdan eslatma kelganidan ajablandingizmi?! Sizlarni Nuh qavmidan keyin xalifa qilganini va xilqatingizda kuch-quvvatni ziyoda qilganini eslang. Allohning ne'matlarini eslang. Shoyadki, zafar topsangiz' (A'rof surasi, 67–69-oyatlar).\r\n    Hud alayhissalom johil qavmga haqiqatni bosiqlik bilan, sodda qilib bayon etishga o'tdilar. Ular da'vo qilganlaridek esipast emasliklarini, olamlarning Robbi tomonidan payg'ambar etib yuborilganlarini hamda payg'ambarlik maqsadlarini bayon etdilar.\r\n    'Ey qavmim, menda esipastlik yo'q. Lekin men olamlarning Robbidan rasuldirman. Sizlarga Robbimning risolatlarini yetkazaman va men sizlarga ishonchli nasihatgo'yman'.\r\n    So'ng ularni payg'ambar o'zlarining oralaridan tanlangani uchun ajablanmaslikka chaqirdilar.\r\n    'O'zingizdan bo'lgan bir kishiga sizlarni ogohlantirish uchun Robbingizdan eslatma kelganidan ajablandingizmi?!'\r\n    Keyin esa Alloh tomonidan ularga berilgan imtiyozlarni eslatdilar:\r\n    'Sizlarni Nuh qavmidan keyin xalifa qilganini va xilqatingizda kuch-quvvatni ziyoda qilganini eslang'.\r\n    Alloh taolo Nuh qavmini og'ir gunohlari tufayli yer yuzidan yo'q qilib tashlagan edi. Xuddi shu osiy qavmdan so'ng sizlarni yer yuzida o'zining xalifasi qilib tanladi. Bu ulug' ne'mat. Bunga faqat shukr qilish lozim edi.\r\n    'Allohning ne'matlarini eslang. Shoyadki, zafar topsangiz'.\r\n    Alloh taoloning sizga bergan ne'matlari juda ko'p. Ularning sanog'iga yetib bo'lmaydi. Buning fahmiga yetish, tushunishga da'vat – ne'mat beruvchi Zotga, ya'ni Allohga shukr qilishga chorlovdir. Shukr qiluvchi bo'ling, shoyadki, najot topsangiz'.\r\n    Ammo Od qavmi ham jaholatida qattiq turib oldi.\r\n    'Ular: 'Bizga yolg'iz Allohning O'ziga ibodat qilishimiz va ota-bobolarimiz ibodat qilgan narsalarni tark etishimiz uchun keldingmi?! Agar rostgo'ylardan bo'lsang, bizga va'da qilayotgan narsangni keltir!' dedilar' (70-oyat).\r\n    Ular shu inkorlari bilan o'zlarining esipast kimsalar ekanlarini oshkor qilishdi. Hech qanday dalilsiz ota-bobolari qilgan amalni Allohdan kelgan amrdan ustun qo'yishdi.\r\n    Ularning jaholatlari shu darajada ediki, o'sha botil narsani deb har qanday azob-uqubatga tayyor ekanlarini bildirishdi va agar iymon keltirmasalar, Allohning iqobiga uchrashlari muqarrarligini ta'kidlab turgan Hud alayhissalomga:\r\n    'Agar rostgo'ylardan bo'lsang, bizga va'da qilayotgan narsangni keltir!' dedilar'.\r\n    Endi ortiqcha gapga o'rin qolmadi. Hud alayhissalom qat'iy qilib:\r\n    'Batahqiq, ustingizga Robbingiz tomonidan kirlik va g'azab voqe bo'lgan. Alloh ular haqida hech qanday hujjat tushirmagan, o'zingiz va ota-bobolaringiz nomlab olgan ismlar haqida men bilan tortishasizlarmi?! Kutinglar! Men ham sizlar bilan kutib turaman', dedi' (71-oyat).\r\n    Hud alayhissalom qavmini yo'lga solish maqsadida turli choralar ko'rib borish jarayonida ularga Alloh taolo bergan ne'matlarni ham eslatdilar:\r\n    'Ey qavmim! Har tepalikka bir belgi bino qilib, behuda o'yin qilaverasizmi? Xuddi mangu turadigandek 'masna'lar' tutasiz' (Shuaro surasi, 128–129-oyatlar).\r\n    Ushbu oyatdagi 'masna'lar' so'zi hozirgi arab tilida zavod-fabrikalar ma'nosida ishlatilmoqda. Albatta, qadimda hozirgidek inshootlar bo'lmagan. Shuning uchun ham qadimgi tafsirlarimizda bu so'zga baland qasrlar, suv omborlari, baland qo'rg'onlar ma'nosi berilgan.\r\n    Asrdosh tafsirchilarimiz esa 'Od qavmi ulkan qasrlar qurish, tog'larni o'yib ishlash va boshqa faxr uchun ko'taradigan binolarida foydalanadigan asbob-uskunalarni ishlab chiqaradigan ishxonalarga ega edi. 'Masna'lar'dan murod o'shalar', deydilar. Birinchi oyatda qurilishlarga doir ochiq-oydin ma'no bor. Shuning uchun ushbu ikkinchi tafsir asosliroq bo'lib chiqadi.\r\n    Od qavmi jismoniy jihatdan yetuk, baland qomatli, juda baquvvat va sog'lom odamlar bo'lishgan. Shuningdek, Alloh taolo ularga o'tkir zehn ham bergandi, hamma ularga havas qilardi. Ammo ular mazkur ne'matlarni to'g'ri yo'lda ishlatishmadi. G'ururga ketib, hovliqishdi va 'Bizdan kuchliroq kim bor?!' deb maqtanishdi. Besh kunlik dunyo matohiga berilishdi. Ular hashamat, faxr va bir-birlaridan o'zish uchun bekordan-bekorga ulkan qasrlar, turli kerakli-keraksiz inshootlar bino qilishdi. Shunday ishlarga berilib ketib, Alloh taoloni unutishdi va turli yomonliklarga qo'l urishdi. Jumladan, moddiy kuch-quvvatlari ila boshqalarga zulm o'tkazishdi.\r\n    Hud alayhissalom ularni tavba qilishga chaqirib ko'rdilar, ammo bu ish ham foyda bermadi. Bu haqda Hud surasida quyidagi bayonlar keladi. Hud alayhissalom:\r\n    'Ey qavmim, Robbingizga istig'for ayting, so'ngra Unga tavba qiling, shunda U ustingizga yomg'irni mo'l-ko'l qilib yuboradi va quvvatingizga quvvat ziyoda qiladi. Jinoyatchi bo'lgan holingizda yuz o'girib ketmang', dedilar (52-oyat).\r\n    Oyatda istig'for aytib, tavba qilsalar, quvvatlariga quvvat qo'shilishi va'da qilinmoqda.\r\n    Hud alayhissalomning bu da'vatlariga Od qavmi sarkashlik qilib, qo'pollik bilan salbiy javob berdi:\r\n    'Ey Hud, bizga ochiq-oydin hujjat keltirmading. Biz sening gaping uchun olihalarimizni tark qiluvchi emasmiz va biz senga iymon keltiruvchi ham emasmiz. Biz faqat 'Seni ba'zi olihalarimiz yomonlik ila uribdi' deymiz, xolos'.\r\n    U aytdiki: 'Men Allohni guvoh qilaman va siz ham guvoh bo'¬lingki, men siz shirk keltirayotgan Undan o'zga narsalarga aloqador emasman. Hammangiz menga qarshi hiyla qiling-da, menga muhlat bermay qo'yavering' (53–55-oyatlar).\r\n    Hud alayhissalom mo''jiza keltirmaganga o'xshaydilar, shuning uchun ham Od qavmi ta'na qilib:\r\n    'Ey Hud, bizga ochiq-oydin hujjat keltirmading'.\r\n    'Shu tufayli biz sening payg'ambar ekaningga ishonmaymiz va aytgan so'zlaringni qabul qilmaymiz', demoqda.\r\n    'Biz sening gaping uchun olihalarimizni tark qiluvchi emasmiz' va sening Xudoyingga sig'inuvchi emasmiz'\r\n    'va biz senga iymon keltiruvchi ham emasmiz'.\r\n    'Qilayotgan ishingga, aytayotgan gapingga qarab, sen haqingda bir fikrga keldik. U ham bo'lsa:\r\n    'Biz faqat 'Seni ba'zi olihalarimiz yomonlik ila uribdi' deymiz, xolos', deyishdi.\r\n    Ya'ni 'Jinni bo'libsan' degan so'zni boshqacharoq qilib aytishdi. Ulardagi ruhiy va ma'naviy buzuqlik shu darajaga borib yetgan ekan. O'zlariga payg'ambar bo'lib kelgan zotni jinniga chiqarib: 'Alahsirab, har xil gaplarni gapiryapti', deyishmoqda.\r\n    Holbuki, Hud alayhissalomning gaplarida hech alahsirash alomati, jinnilik belgisi yo'q edi. U zotning har bir so'zlari purhikmat, oliy ma'nolarni, o'sha qavmni baxt-saodatga yetaklaydigan ko'rsatmalarni o'z ichiga olgan edi.\r\n    U qavm bunday gaplarni aytib turganida Hud alayhissalomning ham qattiqroq gapirishdan, ularni ojiz qoldirishga urinishdan o'zga choralari qolmadi:\r\n    'Men Allohni guvoh qilaman'.\r\n    'Mening payg'ambarligimga Allohning O'zi guvoh. Agar yolg'onchi bo'lsam, meni jazolaydi. Siz gunohkor bo'lsangiz, unda sizni jazolaydi. Lekin hozir orani ochiq qilib olaylik, men sizlarga bir haqiqatni aytib qo'yay:\r\n    '...va siz ham guvoh bo'lingki, men siz shirk keltirayotgan Undan o'zga narsalarga aloqador emasman. Hammangiz menga qarshi hiyla qiling-da, menga muhlat bermay qo'yavering'.\r\n    Bu ham iymoni komil insonning Alloh taologa ishonch bilan aytgan gaplaridir. O'zlari yolg'iz bo'la turib, qarshilaridagi dushmanga – quvvati, shiddati bilan dong taratgan butun boshli bir xalqqa bu gaplarni aytish oson emas.Ammo Hud alayhissalom o'zlarining haq yo'lda ekanlarini butun vujudi bilan anglab yetgan payg'ambar edilar. Allohning xohishisiz u zotga hech kim hech narsa qila olmasligini yaxshi bilar edilar.\r\n    Hud alayhissalom yana so'zlarida davom etdilar:\r\n    'Men mening Robbim va sizning ham Robbingiz bo'lmish Allohga tavakkul qildim. Har bir o'rmalaydigan narsaning peshonasi Uning changalidadir. Albatta, Robbim to'g'ri yo'ldadir' (56-oyat).\r\n    Shuning uchun ham: 'Men mening Robbim va sizning ham Robbingiz bo'lmish Allohga tavakkul qildim'.\r\n    Faqat Ungagina suyandim. Undan o'zga tavakkul qilinadigan zot yo'q.\r\n    'Har bir o'rmalaydigan narsaning peshonasi Uning changalidadir'.\r\n    'Ana shuning uchun ham men sizdan emas, o'sha qudratli, g'olib va qahhor Alloh taolodan qo'rqaman va Ungagina suyanaman'.\r\n    'Robbim to'g'ri yo'ldadir'.\r\n    'Men Robbimning yo'liga yurganman va Uning yordami ila maqsadga yetishimda shubha yo'qdir. Sizdan zarracha qo'rqmasligimning boisi ham shunda'.\r\n    'Agar yuz o'girib ketsangiz, men sizlarga nima ila yuborilgan bo'lsam, uni sizlarga yetkazdim. Robbim o'rningizga sizdan boshqa qavmni keltiradi va siz Unga hech bir zarar yetkaza olmassiz. Robbim har bir narsani muhofaza qiluvchidir' (57-oyat).\r\n    Ya'ni 'Agar siz mendan yuz o'girib ketmoqchi bo'lsangiz, bemalol ketavering, mening qo'rqadigan joyim yo'q'.\r\n    '...men sizlarga nima ila yuborilgan bo'lsam, uni sizlarga yetkazdim'.\r\n    'Alloh taolo O'z payg'ambari sifatida menga nimani topshirgan bo'lsa, o'shani bajardim. Vazifamni ado etdim. Endi U Zotning O'zi siz bilan hisob-kitob qilib oladi. Agar xohlasa,\r\n    'Robbim o'rningizga sizdan boshqa qavmni keltiradi'.\r\n    'Siz kufringiz, beboshligingiz ila azobga haqli bo'ldingiz. Shuning uchun U sizni xohlagan vaqtida halok qilib, yo'qotib tashlab, o'rningizga O'ziga iymon keltiradigan, taqvo qiladigan bir qavmni keltirishi hech gap emas. Agar shunday qilsa,\r\n    '...siz Unga hech bir zarar yetkaza olmassiz'.\r\n    'Qo'lingizdan hech narsa kelmaydi, chunki siz ojiz bir bandasiz'.\r\n    'Robbim har bir narsani muhofaza qilguvchidir', dedi.\r\n    'Siz Undan qochib qutula olmaysiz. Biz mo'minlarni va dinni Alloh taoloning O'zi himoya qilib oladi'.\r\n    Endi munozara ishi tugab, belgilangan vaqt keldi.\r\n    'Amrimiz kelgan paytda Hudga va u bilan birga iymon keltirganlarga O'z rahmatimiz ila najot berdik va ularni qattiq azobdan qutqardik' (58-oyat).\r\n    'Va'da qilingan azobni yuborib, Od qavmini halok qilishga amrimiz kelganida Hud alayhissalom va u bilan birga iymon keltirgan mo'minlarni istisno tariqasida bu azobdan qutqarib qoldik. Qutqarganda ham qattiq azobdan qutqardik.\r\n    Ammo o'sha azob kofirlarni qattiq tutdi. U qanday bo'lganini Ahqof surasidagi quyidagi oyatlar bayon qiladi:\r\n    'Uning (azobning) vodiylari tomon bulut bo'lib kelayotganini ko'rganlarida: 'Bu bulut bizga yomg'ir yog'dirur', deyishdi. Yo'q! Bu o'zingiz oshiqqan narsa – alamli azobi bor shamoldir' (24-oyat).\r\n    Rivoyatlarda kelishicha, Od qavmi qattiq issiqqa duchor bo'lgan. Yomg'ir yog'may, qurg'oqchilik va issiqning ta'siridan havo lov-lov qizdirgan.\r\n    Imom Ahmad ibn Hanbal rivoyat qilgan uzun hadisda jumladan, bunday deyiladi:\r\n    '...Od qavmi qurg'oqchilikka uchraganida Qayl ismli odamni vakil qilib yuborishibdi. U Muoviya ibn Bakrning oldiga borib, huzurida bir oy mehmon bo'libdi. Aroq ichib, ikki joriyadan qo'shiqlar eshitibdi. Bir oy o'tgach, Muhra tog'iga chiqib, duo qilibdi: 'Allohim! O'zing bilasan, men bir kasalni davolagani kelganim yo'q yoki bir asirni ozod qilgani ham kelganim yo'q. Allohim! Od qavmini O'zing serob qiladigan narsa ila serob qilgin'.\r\n    Shunda uning tepasidan bir qancha qora bulutlar o'ta boshlabdi va ulardan 'Tanlab ol!' degan ovoz chiqibdi. U bir qora bulutga ishora qilibdi. Shunda 'O'shani ol!' degan nido kelibdi'.\r\n    Oyatdagi 'vodiylari tomon', ya'ni Od qabilasining vodiylari tomon ko'ndalang bo'lgan narsa ana shu azob bulutidir. Albatta, bu holni ko'rgan qavm 'Endi qurg'oqchilikdan qutular ekanmiz', deb xursand bo'ldi va: 'Bu bulut bizga yomg'ir yog'dirur', deyishdi.\r\n    Lekin ilohiy rad javobi boshqa xabarni keltirdi: 'Yo'q!'\r\n    'Siz aytgandek emas. O'zingiz Hud payg'ambarga 'Agar rostgo'ylardan bo'lsang, bizga va'da qilayotgan narsangni keltir', deb shoshilib, orziqib so'ragan edingiz'.\r\n    'Bu o'zingiz oshiqqan narsa – alamli azobi bor shamoldir'.\r\n    'Bu siz aytayotgandek, yomg'ir yog'diradigan bulut emas. Bu o'zingiz orziqib so'ragan narsangiz – azobdir. Bu – azobni, alamli azobni o'z ichiga olgan bo'rondir', deyildi.\r\n    Ushbu bo'ronning vasfi va oqibati kelasi oyatda bayon qilinadi:\r\n    'Robbining amri ila har bir narsani yakson qilur. Maskanlaridan boshqa narsa ko'rinmaydigan holga aylandi. Jinoyatchi qavmlarni shunday jazolarmiz' (25-oyat).\r\n    Od qavmiga yuborilgan shamol alohida azob shamoli bo'lib, u Allohning amri ila nimaga tegsa, vayron-halok qilishi kerak edi.\r\n    Shu bilan birga, Payg'ambarimiz sollallohu alayhi vasallamdan qilingan rivoyatda aytilishicha, shunday bo'lgani bilan, bu bo'ron bor-yo'g'i bir uzukning teshigiday joydan chiqqan, xolos.\r\n    Darhaqiqat, shamol Od qavmini halok qildi. U o'tgan joylarda uy-maskanlardan boshqa hech narsa qolmadi. Qavmning hammasi halok bo'lib ketdi.\r\n    Alloh taolo Od qavmini ana shunday tarzda halok qilgach, Hud alayhissalom Hazramavtda o'z hayotlarini davom ettirdilar. U zot vafot etganlarida Hazramavtning Tarim nomli shahri yaqiniga dafn etildilar.\r\n    Alloh taoloning boida arablarga yuborgan ikkinchi payg'ambari Solih alayhissalomdir"
        ]
    },
    {
        "word": "Hud surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 123 oyatdan iborat.\r\n    Ichida Hud qavmi qissasi ham kelgani uchun ushbu sura shu nom bilan atalgan. Ulamolarimizning ta'kidlashlaricha, bu surai karima Qur'oni Karimda o'zidan oldin turgan Yunus surasidan keyin nozil bo'lgan. Bir vaqtda nozil bo'lganlari uchun ushbu ikki suraning yo'nalishlari ham bir-biriga yaqin. Ushbu suralar Islom da'vati uchun eng og'ir paytlarda nozil bo'lgan. Bu vaqt Payg'ambar sollallohu alayhi vasallamga va musulmonlarga homiy bo'lib turgan Abu Tolib va Xadiyja onamiz vafot etib, mushriklarning tazyiqlari eng uchiga chiqqan paytlar edi.\r\n    Islom tarixida 'mahzunlik yili' degan nom ila mashhur davr. Abu Tolib va Xadiyja onamizning vafotlarini o'zlariga qulay fursat bilib, mushriklar zulmni yana ham kuchaytirdilar.\r\n    Isro hodisasi ro'y berib, bu hodisa g'ayriodatiy bo'lganidan, ba'zi iymoni zaiflar murtad bo'lib, dindan chiqqan, kofirlar esa mo'minlarni masxara qilib, kulgan payt.\r\n    Islom da'vati umuman to'xtab qolgan, Makka va uning atrofidan hech kim Islomga kirmay qo'ygan mahallar.\r\n    Oz sonli musulmonlar nihoyatda qiyin ahvolda qolgan, kofirlar esa, yana bir oz harakat qilsak, Islomni yo'q qilib yuboramiz, deb turgan nozik palla.\r\n    Ana shunday hassos davrda nozil bo'lgan bu surai karimada o'sha davrga xos mavzular o'z aksini topgandir. Surai karimaning avvalida Qur'oni Karim va uning xususiyatlari haqida so'z ketadi. Aqiyda masalasida bahs yuritiladi. Kishilar Alloh taologa bo'ysungan hollarida yashamoqlari zarurligi o'ziga xos uslub bilan uqtiriladi.\r\n    Undan keyin tarixga murojaat qilinadi. O'tgan ummatlarning qissalari batafsil bayon qilinadi. Bu borada Nuh alayhissalom qissalari, shuningdek, Hud, Solih, Shu'ayb alayhimussalomning qissalari ham keltiriladi.\r\n    So'ngra o'sha zikr qilingan mavzularga xulosa yasalib, bularning hammasi ibrat uchun ekani aytiladi.\r\n    Nihoyatda qiyin davrda nozil bo'lgani, nihoyatda sarkash qavmning noma'qul kirdikorlarini muolaja qilgani uchun ham bu suradagi bahs qattiq va murosasiz uslubda kechadi. Qalblarni larzaga soluvchi, tahdidga to'la iboralar bu surai karimada aynan murosasiz uslub yetakchi ekanini ko'rsatadi. Alloh taolo qalbi qattiq qavmga ularning o'ziga yarasha muomala qiladi. Shuning uchun ham bu surai karimani o'qigan va o'rgangan odamga u o'ziga xos tarzda shiddatli ta'sir etadi.\r\n    Nabiy sollallohu alayhi vasallam Hud surasini o'zlarining muborak sochlarini oqartirgan suralar qatoriga qo'shganlar.\r\n    Hofiz Abu Ya'lo Ikrima roziyallohu anhudan qilgan rivoyatda quyidagilar aytiladi:\r\n    'Abu Bakr roziyallohu anhu Rasululloh sollallohu alayhi vasallamdan:\r\n    – Sochingizni nima oqartirdi? – deb so'raganlarida, u zot sollallohu alayhi vasallam:\r\n    – Sochimni Hud, Voqi'a, 'Amma yatasaa'alun' va 'Izash-shamsu kuvvirot' suralari oqartirdi, – degan ekanlar'."
        ]
    },
    {
        "word": "Hudaybiya sulhi",
        "type": [],
        "definition": [
            "Hudaybiya degan joyda musulmonlar va Makka mushriklari o'rtasida sulh tuzilgan. Bu sulh tarixda 'Hudaybiya sulhi' nomi bilan mashhur."
        ]
    },
    {
        "word": "Hujjat",
        "type": [],
        "definition": [
            "barcha hadislarni bilgan alloma"
        ]
    },
    {
        "word": "Hujurot surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 18 oyatdan iborat.\r\n    'Hujurot' – 'hujralar' deganidir. Suraning ichidagi '...seni hujralar ortidan chaqirayotganlar...' oyatidan olingan ushbu so'z suraga ism bo'lib qolgan. Hujurot surasi o'n sakkiz oyatdan iborat bo'lishiga qaramay, uning ichida o'n sakkiz ming olamga tatigulik ma'nolar bor. Zero, ushbu sura shariat va aqiydaga oid ulkan haqiqatlarni o'z ichiga olgan. Bu surai karimani ulamolarimiz 'Odob va axloq surasi' deb ham ataydilar. Chunki Hujurot surasida mo'min kishining Alloh subhanahu va taologa nisbatan odobi, Nabiy alayhissalomga nisbatan odobi, o'ziga nisbatan va boshqalarga nisbatan odobi bayon qilingan. Surai karima avvalidan oxirigacha odob masalasini atroflicha muolaja qiladi.\r\n    Birinchi oyatdayoq Alloh va Rasuldan, Qur'on va Sunnatdan avval o'zicha fikr yoki hukm aytmaslik odobiga amr bo'ladi.\r\n    Keyin Payg'ambar alayhissolatu vassalomning huzurlarida ovozni baland ko'tarmaslik odobi, Rasuli Akram alayhissalom bilan doimo kamoli odob ila muomala qilish masalasi, fosiq odam keltirgan xabarni tekshirib ko'rish, shoshma-shosharlik bilan unga ishonib, bir ish qilib qo'ymaslik va keyin nadomat chekib yurmaslik, Nabiy alayhissalomga o'z fikrini majbur qilib o'tkazmaslik, mo'min-musulmonlarning orasini isloh qilish, haddidan oshib, zulmkor bo'lganlarni, urush qilib bo'lsa ham, zulmdan qaytarish, isloh qilish jarayonida adolatli bo'lish, doimo mo'min-musulmonlarning do'st-birodarligi yo'lida harakat qilish, iymon ahlini masxaralashdan, yaxshi kishilardan badgumon bo'lishdan tiyilish, kishilarga laqab qo'yib, kamsitishdan, josuslik qilishdan saqlanish, xususan, botil ahllari foydasiga ahli xayrlar ketidan josuslik qilishni tark etish, g'iybatchilikni tashlash, iymon ahlini ayblashdan, hasabu nasab, millatchilik asosidagi o'zaro faxrlanishdan voz kechish, Islom va iymonni minnat qilishni tark etish kabi zarur masalalar muolaja qilinadi."
        ]
    },
    {
        "word": "Huzayl ibn Shurahbil",
        "type": [],
        "definition": [
            "Huzayl ibn Shurahbil al-Avadiy al-Kufiy. U kishi Arqam ibn Shurahbilning inisi bo'lganlar. Hadislarni akalari Arqam ibn Shurahbiyldan, buyuk sahobalar –Usmon, Ali, Tolha, Sa'd, Ibn Mas'ud, Abu Zarr, Sa'd ibn Uboda, Qays ibn Sa'd, Ibn Umar Hamadoniy, Masruq roziyallohu anhumdan rivoyat qildilar.\r\n    Bu zot Jamojim voqeasidan keyin vafot etdilar."
        ]
    },
    {
        "word": "Hukmiy najosat",
        "type": [],
        "definition": [
            "Bu, a'zolarga oriz ma'naviy holat bo'lib, namozni man' qiladi. Uning kichik betoharatligi toharat qilish bilan, katta betoharatligi g'usl bilan ketadi. Haqiyqiy najosat: yengil, og'ir, quruq, ho'l, ko'rinadigan va ko'rinmaydigan turlarga bo'linadi. Namozxon uchun badan, kiyim va makondan najosatni ketkazish vojibdir."
        ]
    },
    {
        "word": "Hulla ",
        "type": [],
        "definition": [
            "Hulla – boshqa xalqlarda bir xil matodan tikilgan pidjak va shimdan iborat kiyimlar to'plamini 'kostyum' deyilgani kabi arablarda rido va izordan (ustki va pastki libosdan) iborat kiyim 'hulla' deyilgan."
        ]
    },
    {
        "word": "Humaza surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 9 oyatdan iborat.\r\n    Suraning birinchi oyatidagi 'humaza' so'zi unga nom bo'lib qolgan. 'Humaza' so'zi 'g'iybat ila odamlarning obro'sini ko'p to'kuvchi' degan ma'noni anglatadi.\r\n    Bu surai karima boylik ba'zi odamlarni tug'yonga olib kelishi, o'zgalarni pisand qilmay qo'yishlari, balki ularni kamsitib, masxara qilishlari haqida so'z yuritadi. Boylikka o'ch odam hamma narsani pul bilan o'lchaydigan bo'lib qoladi. Hatto pulim meni dunyoda abadiy qoldiradi, degan e'tiqodga ham olib keladi. Lekin buning oqibati yaxshi bo'lmaydi.\r\n    Unday sifatga ega kishilar oxiratda chilparchin qiluvchi do'zaxga tushadilar, u yerda qattiq qizdiruvchi, qalbgacha kuydirib boruvchi o'tda yonib, azob chekadilar. U o't ularni o'rab olib, hech chiqishga yo'l qo'ymaydi."
        ]
    },
    {
        "word": "Humayd al-Varroq al-Farmankiy",
        "type": [],
        "definition": [
            "Abu Muhammad Humayd ibn Farva al-Varroq al-Farmankiy Buxoro ahlidan bo'lib, Abu Huzayfa Ishoq ibn Bishrning qo'lyozmalarini ko'chiruvchi edilar. Abdulloh ibn Muborak, Xorija ibn Mus'ab, Sufyon ibn Uyayna va Fuzayl ibn Iyozdan hadis rivoyat qilganlar. O'zlaridan esa Abu Ma'shar Hamdavayh ibn Xattob hadis rivoyat qilganlar.\r\n    O'g'illari Abu Abdulloh Muhammad ibn Humayd al-Farmandiydir."
        ]
    },
    {
        "word": "Humom al-Vardoniy",
        "type": [],
        "definition": [
            "Abu Sa'd Humom ibn Idris al-Vardoniy otalaridan hadis rivoyat qilganlar. O'zlaridan esa Sahl ibn Shozavayh al-Bohiliy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Humron roziyallohu anhu",
        "type": [],
        "definition": [
            "U kishining to'liq ismlari Humron ibn Xolid ibn Amrdir. Ayni Tamr nomli joyda Xolid ibn Valid roziyallohu anhuga asir tushgan. Xolid ibn Valid roziyallohu anhu Humronning hushyor va aql-farosatliligini ko'rib, hazrati Usmon ibn Affon roziyallohu anhuga berganlar. U kishi uni qullikdan ozod qilib, o'zlariga kotib va qo'riqchi qilib olganlar.\r\n     Humron roziyallohu anhu Hajjojning davrida Nisoburga voliy bo'lganlar. U kishi 75 hijriy sanada vafot etganlar."
        ]
    },
    {
        "word": "Husayn al-Adib as-Sufrodaniy",
        "type": [],
        "definition": [
            "Abu Ali Husayn ibn Jamil al-Adib as-Sufrodaniy - Buxoroning Sufrodan nomli qishlog'idan bo'lib, Abu Amr Qays ibn Anif, Husayn ibn Homid at-Tavovisiy va Solih ibn Muhammad al-Bag'dodiydan hadis rivoyat qilganlar. Hijriy 346 (milodiy 958) yilda vafot etganlar"
        ]
    },
    {
        "word": "Husayn al-Bardaiy",
        "type": [],
        "definition": [
            "Abu Ali Husayn ibn Ali al-Bardaiy Samarqandda yashab, shu yerda ulg'ayganlar. Hadis hofizi edilar. Ilm talabida Iroq va Xurosonda bo'lganlar. Ulug' muhaddislardan ta'lim olganlar. O'zlaridan Abul Abbos Ja'far ibn Muhammad al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 349 (milodiy 961) yilda tavallud topib, hijriy 406 (milodiy 1016) yilning ramazon oyida Samarqandda vafot etganlar."
        ]
    },
    {
        "word": "Husayn al-Bonabiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Husayn ibn Muhammad al-Bonabiy - Buxorodagi Bonab qishlog'ining muhaddis olimlaridan. Bu zot Imom al-Buxoriyning shayxlaridan ta'lim olgan"
        ]
    },
    {
        "word": "Husayn al-Faqih al-Kassiy",
        "type": [],
        "definition": [
            "Abu Ali Husayn ibn Foris al-Faqih al-Kassiy Buxoroning Kassa nomli qishlog'idan bo'lib, faqih olimlardan edilar. Ahmad ibn Sahl al-Buxoriy, Abu Bakr Muhammad ibn Abdulloh ar-Roziy, Abu Solih Xalaf ibn Muhammad al-Xayyom va boshqa faqihlardan ta'lim olganlar. Hijriy 396 (milodiy 1006) yilning zulqa'da oyida vafot etganlar."
        ]
    },
    {
        "word": "Husayn al-Farabriy",
        "type": [],
        "definition": [
            "Abu Ali Husayn ibn Yusuf al-Farabriy Abu Iso Muhammad ibn Iso at-Termiziy al-Hofizdan hadis rivoyat qilganlar. O'zlaridan Abu Ahmad ibn Adiy al-Jurjoniy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Husayn al-Farabriy",
        "type": [],
        "definition": [
            "Abu Mansur Husayn ibn Ali al-Farabriy Abu Ali Husayn ibn Ismoil al-Forisiy va Abul Fazl as-Sulamiydan hadis rivoyat qilganlar. Hijriy 397 (milodiy 1007) yilning ramazon oyida vafot etganlar."
        ]
    },
    {
        "word": "Husayn al-Fasaviy",
        "type": [],
        "definition": [
            "Abul Abbos Husayn ibn Hasan al-Fasaviy asli Eronning Faso (yoki Baso) shahridan bo'lib, vafotlariga qadar Buxoroda yashaganlar. Abu Ammor Husayn ibn Hurays al-Xuzoiy, Muhammad ibn Rofiy, Ahmad ibn Hafs as-Sulamiy va Muhammad ibn Yahyo az-Zuhliydan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar. Hijriy 318 (milodiy 931) yilning ramazon oyida vafot etganlar."
        ]
    },
    {
        "word": "Husayn al-Halimiy al-Jurjoniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Husayn ibn Hasan al-Halimiy al-Faqih ash-Shofe'iy al-Jurjoniy hijriy 338 (milodiy 950) yili Jurjonda tug'ilganlar. Buxoroga kelib, Abu Bakr Muhammad ibn Ahmad, Abu Ahmad Bakr ibn Muhammad as-Sayrafiy va Abu Abdulloh Muhammad ibn Ali al-Jabbahoniydan hadis yozib olganlar. Abu Bakr al-Avdaniydan fiqh ilmidan ta'lim olganlar. Movarounnahrning buyuk, odobli va ibratli imomi bo'lganlar. Bu kishi 'at-Tasonif al-hison' ('Hasan hadislar tasnifi') kitobining muallifidirlar. Bu kishi haqlarida Abu Abdulloh al-Hofiz al-Hokim 'Tarixi Nishopur' kitoblarida ma'lumot berganlar. Hijriy 403 (milodiy 1013) yilning jumodul avval yoki rabi'ul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Husayn ibn al-Horis",
        "type": [],
        "definition": [
            "Husayn ibn al-Horis Kufiy al-Jadaliy, kunya¬lari Abul Qosim.\r\n    Hadislarni Ibn Umar, Abdurrahmon ibn Zayd, Nu'mon ibn Bashir, Horis ibn Xotiblardan rivoyat qildilar.\r\n    Bu kishidan Abu Molik al-Amjaiy, Zakariyo ibn Abu Zoida va boshqalar rivoyat qilganlar.\r\n    Ibn Hibbon: 'Husayn ibn al-Horis ishonchli hadis rivoyat qiluvchi tobe'inlardan edi', deb aytadilar."
        ]
    },
    {
        "word": "Huffoz ",
        "type": [],
        "definition": [
            "Son-sanoqsiz hadislarni yoddan biluvchi"
        ]
    }
]