[
    {
        "word": "Iblis ",
        "type": [],
        "definition": [
            "shayton, azozil"
        ]
    },
    {
        "word": "Ibn Abu Hadrad",
        "type": [],
        "definition": [
            "Ibn Abu Hadradning ism¬lari Abdulloh ibn Abu Salama ibn Umayr al-Aslamiy bo'lib, u kishi Xudaybiya va undan keyingi g'azotlarda ishtirok etganlar. Turli tomonlarga bir necha bor vazifa bilan yuborilgan jangchilar guruhiga amir bo'lganlar. Yetmish ikkinchi hijriy sanada vafot etganlar."
        ]
    },
    {
        "word": "Ibn Vaʼla as-Sabaiy",
        "type": [],
        "definition": [
            "Ibn Va'la kunyasi bilan mashhur bo'lgan bu zotning ismlari Abdurrahmon ibn Va'la as-Sabaiydir. Bu zot misrlik bo'lib, Misrni fath etishda ishtirok etganlar. Hadislarni Abdulloh ibn Abbos, Abdulloh ibn Umarlardan rivoyat qiladilar.\r\n    Bu zotdan Zayd ibn Aslam, Yahyo ibn Sa'd, Abu Xayr al-Yazniy, Ja'far ibn Robi'a, Qa'qa' ibn Hakim va boshqalar rivoyat qilganlar."
        ]
    },
    {
        "word": "Ibn Kasir Makkiy qiroati",
        "type": [],
        "definition": [
            "Imom Abdulloh ibn Umar ibn Abdulloh ibn Zozon ibn Feruz ibn Hurmuz ibn Kasir Makkiy. Imom Ibn Kasir hijriy 45 sanada tug'ilib, 120 sanada vafot qilgan.\r\n    U kishining ikki roviylari – Bazziy va Qunbul"
        ]
    },
    {
        "word": "Ibn Omir Shomiy qiroati",
        "type": [],
        "definition": [
            "Imom Abdulloh ibn Omir ibn Yazid ibn Tamim ibn Rabi'a Yahsubiy. U kishi hijriy 8 yilda tavallud topib, 118 sanada vafot etgan.\r\n    U kishining ikki roviylari – Hishom va Ibn Zakvon"
        ]
    },
    {
        "word": "Ibn sabiyl",
        "type": [],
        "definition": [
            "Yurtidan tashqariga chiqib, o'z yurtidan aloqasi uzilib qolgan kishi 'ibn sabiyl' bo'ladi."
        ]
    },
    {
        "word": "Ibod al-Bamijkatiy",
        "type": [],
        "definition": [
            "Abu Jamil Ibod ibn Hishom al-Bamijkatiy asli shomlik bo'lib, Bamijkat qishlog'ida yashaganlar. Bamijkat qishlog'i masjidida muazzin (azon aytuvchi) edilar. Hijriy 279 (milodiy 893) yil ramazon oyining yakshanba kuni Bamijkat qishlog'ida vafot etganlar. Janozalarida ko'p kishi hozir bo'lgan. Ularning sanog'ini Allohning o'zigina bilar edi"
        ]
    },
    {
        "word": "Ibodat",
        "type": [],
        "definition": [
            "Allohga sig'inish, topinish va unga qulluq qilish, bandalik qilish. Allohga yaqinlik hosil qilish uchun qilinadigan barcha xayrli amallar"
        ]
    },
    {
        "word": "Ibrohim az-Zandaniy al-Karobisiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim az-Zandaniy al-Karobisiy - Buxoroning Zandana nomli qishlog'idan bo'lib, Horun al-Astrobodiy va Abul Horis al-Xattobiydan hadis ilmidan ta'lim olganlar"
        ]
    },
    {
        "word": "Ibrohim az-Zohid ar-Reviy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Ahmad az-Zohid ar-Reviy – Buxorodan. Uylari Rev darvozaga yaqin bo'lgan. Abu Abdulloh Muhammad ibn Muso ar-Roziy, Muhammad ibn Abdulloh ar-Roziy, Ahmad ibn Sa'd az-Zohid va Abu Solih Xalaf ibn Muhammad al-Xayyomdan ta'lim olganlar. O'zlaridan esa Abul Abbos Ja'far ibn Muhammad al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 417 (milodiy 1027) yilning zulqa'da oyida Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim alayhissalom",
        "type": [],
        "definition": [
            "Vaqti-soati yetganda, Alloh taolo ularga Ibrohim alayhissalomni payg'ambar qilib yubordi. U kishi Ur shahrining qavmidan edilar.\r\n    Ibrohim alayhissalomning otalarining ismi Ozar bo'lib, nasablari Nuh alayhissalomning o'g'illari Somga borib taqaladi.\r\n    Ibrohim alayhissalomning kunyalari Abu Ziyfon bo'lgan, bu 'Mehmondo'st' degan ma'noni anglatadi. Ibrohim alayhissalomning uylariga tashrif buyurgan mehmonlar bilan bo'lgan qissalari Qur'oni Karimdagi eng mashhur qissalardan ekani ma'lum.\r\n    Ibrohim alayhissalom, bir rivoyatga ko'ra, Bobilda tavallud topganlar. Ma'lumki, Bobil hozirgi Iroq davlati hududiga qarashli bo'lgan. U zot alayhissalom tavallud topganlarida otalari yetmish besh yoshda bo'lgan ekan. Ibrohim alayhissalom o'rtancha farzand bo'lganlar.\r\n    Ibrohim alayhissalom ilohiy ta'limotlardan uzoqlashgan, ma'naviy qadriyatlar izdan chiqqan bir jamiyatda o'sdilar. O'sha vaqtda Bobilga Namrud ismli zolim podshoh hukmdorlik qilar edi. U yerning odamlari mol-dunyo va aysh-ishratga nihoyatda berilgan, shu bilan birga, shirk e'tiqodida bo'lib, but-sanamlarga sig'inishardi. Qavmning e'tiqodi buzuqligidan foydalangan podshoh o'zini xudo deb e'lon qilgan edi.\r\n    Ibrohim alayhissalom o'z qavmlari – Iroq kaldoniylari orasida o'sib-ulg'aydilar. Alloh taolo u zotning qalblarini hidoyat nuri ila munavvar qilgan edi. Shu bois o'sib-ulg'ayganlari sari Ibrohim alayhissalomning bu noma'qulchiliklarga nisbatan noroziliklari ham kuchayib bordi. Aqlini tanigach, otasining ham, qavmi va boshqa yaqinlarining ham toshdan, yog'ochdan o'zlari yo'nib-o'yib ishlab olgan but-sanamlarga sig'inayotganlariga guvoh bo'ldilar.\r\n    Ibrohim alayhissalom sof qalbi va ongi ila bu ish noto'g'ri ekani, jonsiz tosh yoki quruq yog'och odamlar tomonidan biroz ishlov berilgani bilan xudoga aylanib qolmasligini tushunib yetdilar. O'zi jonsiz bo'lgan narsa o'zgalarga qanday qilib jon ato qila olsin?! O'zi aqlsiz narsa qanday qilib o'zgalarga aql bera olsin?! O'zidan zararni qaytara olmaydigan narsa qanday qilib o'zgalardan zararni daf etsin?!\r\n    Vaqti-soati yetgach, Alloh taolo Ibrohim alayhissalomni payg'ambarlikka tanlab oldi. Uzoq tayyorgarliklardan so'ng u kishi shirkka qarshi kurashga qat'iy bel bog'ladilar. Bu ishni u zot avval o'z oilalaridan boshladilar.\r\n    Ibrohim alayhissalom birinchi navbatda mushrik otalarini shirkni tark etishga da'vat qildilar.\r\n    'Ibrohimning o'z otasi Ozarga: 'Sanamlarni xudolar qilib olasanmi? Men seni va sening qavmingni, albatta, ochiq-oydin adashuvda ko'rmoqdaman', deganini esla' (An'om surasi, 74-oyat).\r\n    Ota e'tiroz bildirdi, orada munozaralar bo'ldi. Ibrohim alayhissalom otalariga qilgan da'vatlari foyda bermagach, otalariga qo'shib qavmlariga ham xitob qila boshladilar.\r\n    O'tgan ummatlar orasida Alloh taologa shirk keltirishda g'oyat nom taratgan qavmlardan biri Ibrohim alayhissalomning qavmlari edi. Ular nafaqat but-sanamlarga, balki yulduz, oy, quyosh kabi jismlarga ham sig'inishardi. Ibrohim alayhissalom ularni bu narsalarga emas, ularni yaratgan Xoliqqa – Alloh taoloning O'ziga iymon keltirib, ibodat qilishga da'vat etdilar.\r\n    Podshoh bilan munozara\r\n    Albatta, bo'lib o'tayotgan bu gap-so'zlar o'sha vaqtda xudolik da'vosini qilgan podshohga yetib borgan bo'lishi kerak. Shuning uchun ham u Ibrohim alayhissalomni munozaraga chorladi. Ana shu mashhur munozara Baqara surasida quyidagicha vasf qilinadi:\r\n    'Alloh podshohlik berib qo'ygani sababidan Ibrohim bilan Robbi haqida tortishgan kimsani bilmadingmi? Ibrohim: 'Robbim tiriltiradi va o'ldiradi', dedi. U: 'Men tiriltiraman va o'ldiraman', dedi. Ibrohim: 'Alloh quyoshni mashriqdan chiqarur, sen uni mag'ribdan chiqargin-chi', dedi. Bas, kufr keltirgan lol qoldi. Alloh zolim qavmlarni hidoyat qilmas' (258-oyat).\r\n    Butlar haqidagi tortishuvlarning biridan so'ng Ibrohim alayhissalom butlarni parchalab tashlash niyatlarini amalga oshirishga qaror qildilar. U zot nobakor qavmning dodini berish, butlarning qo'lidan hech vaqo kelmasligini amalda isbot qilish maqsadida boshqacha yo'l tutdilar.\r\n    Tafsirchi ulamolarimizning keltirishlaricha, Ibrohim alayhissalomning qavmida ma'lum va mashhur bayramlar bo'lgan. Ular bayramlarda o'yin-kulgi va kayfu safoga chiqishar, chiqishdan oldin esa soxta xudolarining huzuriga turli meva-chevalar qoldirib ketishardi. Dilxushlik va kayfu safolardan so'ng kelib, o'sha yeguliklarni muborak taom sifatida qaytarib olishardi.\r\n    Qavmining to'g'ri yo'lga yurishidan umidi uzilgach, Ibrohim alayhissalom bir reja tuzib, ana shunday bayram kunini kutdilar. U zot qavmidan ko'rgan nobakorlik, sarkashliklar oqibatida yuraklari juda siqilgan, huzur-halovatlarini yo'qotgan, qavmlari uchun qayg'urib, qiyin ahvolga tushib qolgan edilar.\r\n    Bayramga otlanib chiqqan qavm a'zolari Ibrohim alayhissalomning huzurlariga kelib, u zotning o'zlari bilan bayramga chiqishlarini so'rashdi. Shunda 'yulduzlarga bir nazar soldi...' (Soffot surasi, 88-oyat).\r\n    Haligi odamlarga javob berishdan oldin xuddi ibodatxonadagi boshqa odamlar kabi osmonga o'ziga xos bir nazar soldilar. U zotning bu holatlari suhbatdoshlarida 'U osmondagi yulduzlardan biror narsani bilib oldi, shekilli' degan gumon paydo qilishi mumkin edi.\r\n    '...va 'Men bemorman', dedi' (Soffot surasi, 89-oyat).\r\n    Bu bilan yuraklari siqilaverib, mushkul ahvolga tushib qolganlarini, qavmlariga kuyaverib, qalblari dardga to'lganini bildirdilar. Shoshilib turgan odamlar bu gapdan keyin darhol Ibrohim alayhissalomni qoldirib, yo'llarida davom etishdi. Ular ketishganidan so'ng Ibrohim alayhissalom oldi taomga to'la soxta ilohlar bilan ibodatxonada yolg'iz o'zlari qoldilar.\r\n    Ibrohim alayhissalom hamma butlarni parcha-parcha qilib tashladilar. Eng katta butga esa tegmasdan, butun qoldirdilar. Bundan xabar topgan mushriklar manzaraga tezroq guvoh bo'lish uchun bir-birlarini turtishib-surishib, shosha-pisha Ibrohim alayhissalomning oldilariga yetib kelishdi.\r\n    Ular ilohlarini sindirgan kishining adabini berib qo'yishga qaror qilishdi. Biroq bu jazo chorasi ommaning ko'z o'ngida bo'lishi ma'qul ko'rildi. Shoyadki, boshqalar ko'rib, ibrat olib, 'Bundan buyon hech kim ilohlarimizga qo'l tekkizmasa', deb o'ylashdi. Nihoyat Ibrohim alayhissalomni odamlar huzurida so'roq qila boshlashdi. Unga: 'Xudolarimizni parcha-parcha qilib tashlagan senmisan?' deyishdi. Ibrohim alayhissalom: 'Yo'q, bu ishni o'sha ilohlaringizning kattasi qildi, hamma kichik ilohlarni sindirib tashlab, o'zi qoldi. Agar menga ishonmasanglar, (o'sha but-sanaminglar) gapiradigan bo'lsa, ularning o'zlaridan so'rab ko'ringlar', dedilar.\r\n    Ibrohim alayhissalomning bu gaplari mushrik qavmga ta'sir qildi.\r\n    'So'ngra yana boshlari aylanib: 'Batahqiq, bularning gapira olmasligini bilar eding!' dedilar' (Anbiyo surasi, 65-oyat).\r\n    Jinoyatchi mushrik qavm bir-birlariga: 'Ibrohimni jazolash uchun katta gulxan yoqadigan joy quringlar. Unga olov yoqib, Ibrohimni o'sha gulxanga otinglar', deyishdi. Xullas, mushriklar katta gulxan yoqib, Ibrohim alayhissalomni o'sha gulxanga otishdi.\r\n    Olov Alloh taoloning amri bilan Ibrohim alayhissalomga salqin va salomatlik bo'ldi, u zotga hech qanday ozor yoki zarar yetmadi.\r\n    Alloh taoloning yo'lida yurish haqidagi da'vatlar, tushuntirishlar va bahslar otaga ham, qavmga ham kor qilmadi. Ular bu va'z-nasihat va da'vatlardan foyda olish o'rniga zulmga zo'r berishdi. Ezgulik da'vatchisiga turli yomonliklar qilishdi. Uni ham o'zlarining botil yo'llariga yurgizmoqchi bo'lishdi. Oxir-oqibat uni jismonan yo'q qilishga urinishdi, chunki uning tirik yurishi o'sha nobakor qavm uchun katta tahlika edi. Oddiy xalq uning orqasidan ketib qolishidan qo'rqishardi.\r\n    Shomga ko'chib o'tishlari\r\n    Shuncha qilingan jiddu jahdlardan so'ng ham Ibrohim alayhissalomga u zotning jufti halollari Sora onamiz va akalari Horonning o'g'li Lutdan boshqa hech kim iymon keltirmadi. Ana shunda Ibrohim alayhissalom: 'Albatta, men Robbimga boruvchiman. U meni hidoyat qilur' (Soffot surasi, 99-oyat), deb dinu diyonat uchun hijratga ketishni afzal ko'rdilar.\r\n    U zot sof niyatlarini tushunmagan nobakor qavmdan, eski odatlarni tark etishni xohlamayotgan zolimlardan voz kechishni xohladilar. Faqat Alloh taolo bilan qolishni, O'zidangina yordam so'rab, faqat Alloh taolo buyurganidek yashashni ixtiyor qildilar. Shuning uchun ham ishonch bilan 'U meni hidoyat qilur', dedilar.\r\n    'Alloh taolo O'zi meni to'g'ri yo'lga hidoyat qiladi. Ikki dunyo saodatiga eltuvchi yo'lga boshlaydi'.\r\n    Qatoda roziyallohu anhuning aytishlaricha, Ibrohim alayhissalom insonlardan birinchi bo'lib (Bibi Sora bilan) Shom yerlariga ko'chib o'tgan zotdirlar. Shunday qilib hijrat amalga oshdi. Bir holatdan ikkinchi holatga ajrab chiqildi.\r\n    Shu paytgacha Ibrohim alayhissalom farzand ko'rmagan edilar. Hijrat yolg'izligida Alloh taolodan farzand so'radilar.\r\n    'Robbim, menga solihlardan ato et'. Unga bir halim o'g'ilning xushxabarini berdik' (Soffot surasi, 100–101-oyatlar).\r\n    Yoshi bir joyga borib qolgan, begona yurtlarda muhojir bo'lib yurgan befarzand odam uchun bu juda buyuk xushxabar edi. Uzoq davom etgan befarzandlikdan keyin farzandli bo'lish naqadar baxt! Uzoq davom etgan bu befarzandlikdan so'ng ayniqsa o'g'illik bo'lish qanchalik baxt! U o'g'ilning halim bo'lishi yanada ulug' baxt! Ana shu farzand Ismoil edi!\r\n    Ammo o'sha halim o'g'il dunyoga kelgungacha hali oldinda anchagina voqealar bor edi.\r\n    Abu Hurayra roziyallohu anhudan rivoyat qilinadi:\r\n    'Nabiy sollallohu alayhi vasallam shunday dedilar:\r\n    'Nabiy Ibrohim alayhissalom uchta yolg'ondan boshqa hech yolg'on gapirmagan. Ikkitasi Allohning zotida (Kitobida) 'Men bemorman', degan gapi va 'Yo'q, buni manavi, ularning kattasi qildi', degan gapi. Bittasi Sora haqida. U kishi bir jabborning (zolim podshohning) yeriga bordi. U zot bilan Sora ham bor edi. U (Sora) odamlarning go'zali edi. U zot unga: 'Mana bu jabbor sening xotinim ekaningni bilsa, sen(ga yetishish) uchun menga kuch ishlatadi. (Shuning uchun) agar sendan so'rab qolsa, mening singlim ekaningni aytgin. Sen mening Islomdagi singlimsan. Men yer yuzida men va sendan boshqa musulmon borligini bilmayman', dedi.\r\n    Ular uning yeriga kirganlarida uni jabborning ahlidan ba'zilari ko'rib qolib, uning oldiga borib: 'Sening yeringga bir ayol keldi. U sendan o'zgaga munosib emas', deyishdi.\r\n    U odam yubordi. Uni olib kelishdi.\r\n    Ibrohim alayhissalom namozga turdi.\r\n    (Sora) uning (zolim podshohning) oldiga kirganida o'zini tuta olmay, qo'lini unga uzatgan edi, ko'li qattiq tirishib qoldi. Shunda unga: 'Allohga duo qil. Qo'limni qo'yib yuborsin. Senga zarar yetkazmayman', dedi. U uning aytganini qildi, lekin jabbor yana yomonlikka qaytdi. Qo'li avvalgidan ham qattiqroq tirishib qoldi. Unga yana avvalgi gapini qaytardi. U uning aytganini qildi, lekin jabbor yana yomonlikka qaytdi. Qo'li avvalgi ikkisidan ham qattiqroq tirishib qoldi. Shunda unga: 'Allohga duo qil. Qo'limni qo'yib yuborsin. Allohga qasam, senga zarar yetkazmayman', dedi. U uning aytganini qilgan edi, qo'li bo'shadi. Uni olib kelgan odamni chaqirib: 'Sen menga odam emas, shaytonni olib kelibsan! Uni mening yerimdan chiqarib yubor! Unga Hojarni ham ber!' dedi.\r\n    U jo'nab ketdi. Ibrohim alayhissalom uni ko'rib, namozini tugatdi va: 'Nima gap?!' dedi.\r\n    'Yaxshilik! Alloh fojirning qo'lini tiydi! Xizmatchi ham berdi', dedi'.\r\n    Abu Hurayra: 'Ana o'sha sizning onangiz bo'ladi, ey osmon suvi farzandlari!' dedi'.\r\n    Buxoriy va Muslim rivoyat qilishgan.\r\n    Ushbu hadisi sharifdagi 'jabbor'dan murod zolim podshoh, 'jabborning yeri'dan murod Misrdir. Ibrohim alayhissalom Sora onamiz bilan Misrga hijrat qilgan vaqtlarida u yerda bir zolim odam podshohlik qilar edi.\r\n    Rasululloh sollallohu alayhi vasallamning 'Nabiy Ibrohim alayhissalom uchta yolg'ondan boshqa hech yolg'on gapirmagan. Ikkitasi Allohning zotida (Kitobida) 'Men bemorman', degan gapi va 'Yo'q, buni manavi, ularning kattasi qildi', degan gapi. Bittasi Sora haqida' degan gaplaridan zinhor-bazinhor 'Ibrohim alayhissalom umrlarida uch marta yolg'on gapirgan ekanlar' degan fikr kelib chiqmasligi kerak. Bu yerdagi 'yolg'on'dan sirtidan yolg'on bo'lib ko'ringan, aslida boshqa tarafga burib yuborsa bo'ladigan gaplar ko'zda tutilgan.\r\n    Qissaning davomi shuki, Sora onamiz zolim podshoh o'zlariga sovg'a qilgan Hojar ismli ayolni erlari Ibrohim alayhissalomga sovg'a qildilar. Ehtimol, o'zlari befarzand bo'lganlari uchun erlarining boshqa ayol bilan ham turmush qilib ko'rishini o'ylagan bo'lsalar, ajab emas.\r\n    Hojar onamiz homilador bo'lib, Ismoilni dunyoga keltirdilar. O'sha vaqtda Ibrohim alayhissalom 86 yoshda edilar.\r\n    Alloh taolo iroda qilgan hikmatga binoan Sora onamizning rashklari qo'zidi. Oxiri borib Hojar onamizni go'daklari bilan boshqa bir joyga olib borib qo'yishga kelishildi.\r\n    Zurriyotni giyohsiz vodiyga joylashtirish\r\n    Ibrohim alayhissalom juda uzoq yo'l yurgandan so'ng hozirgi Ka'bai muazzamaning o'rniga Hojar onamiz bilan go'dak Ismoilni qoldirib, ortlariga qaytdilar. Ma'lum bir joyga yetib, u zot ona-bolani ko'radigan, ular esa u zotni ko'rmaydigan joyda turib, Alloh taologa iltijo ila quyidagi duoni qildilar:\r\n    'Robbimiz, haqiqatda men o'z zurriyotimni Baytul haroming yoniga, giyohsiz vodiyga joylashtirdim. Robbimiz, namozni to'kis ado etishlari uchun. O'zing odamlardan ba'zilarining qalblarini ularga talpinadigan qilgin va ularni mevalardan rizqlantirgin. Shoyad, shukr qilsalar' (Ibrohim surasi, 37-oyat).\r\n    Alloh taolo Ibrohim alayhissalomning bu duolarini qabul etdi. Mazkur yurtni, Harami sharifni omonlik yurti qilib qo'ydi. Uning omonligiga tahdid soladiganlarni halokatga giriftor qildi. U yerdagilar Allohga ibodatni to'g'ri qilib, namozni to'kis ado etganlarida, omonlikka qo'shib to'qchilikni ham berdi. Musulmon bo'lgan odamlar qalbini o'sha tomonga talpinib turadigan qildi. Yerlarida hech narsa o'smasligiga qaramay, u joyning aholisini turli mevalar bilan rizqlantirib qo'ydi.\r\n    Ibrohim alayhissalom har zamonda kelib, oilalaridan xabar olib turdilar. Ismoil ham o'sib-ulg'ayib bordi.\r\n    Keyin nima bo'lganini Soffot surasining quyidagi oyatlaridan bilib olamiz.\r\n    Qurbonlik qilish\r\n    'Bas, (bola) uning o'zi bilan birga yuradigan bo'lganida: 'Ey o'g'ilcham, men tushimda seni so'yayotganimni ko'ryapman, bir o'ylab ko'r, nima deysan?' dedi. U: 'Ey otajon, senga amr etilgan ishni bajar, inshaalloh, meni sabr qiluvchilardan ekanimni ko'rursan', dedi' (102-oyat).\r\n    Ibrohim alayhissalom qurbonlik uchun bolasini so'yishga tayyorligini bildirdi. Uni yotqizib, bo'yniga pichoq tiradi. Ammo Allohning irodasi Ismoilning qonini to'kish bo'lmagani uchun pichoq o'tmadi. Shunda Alloh taolo Ismoil alayhissalomning o'rniga jannatdan katta bir qo'chqorni so'yish uchun yubordi. Ibrohim alayhissalom o'sha qo'chqorni qurbonlikka so'ydilar. Bu ishlar Minoda – hozirda hojilar qurbonlik so'yadigan joyda bo'lib o'tdi.\r\n    Baytullohning qurilishi\r\n    Alloh taolo Ibrohim alayhissalomga va u zotning solih amalli zurriyotlariga imomlik, rahbarlikni va'da qildi. Ushbu imomlikning ko'rinishlaridan biri – Baytullohni qurish va unga tegishli ishlar bo'ldi.\r\n    Imom Buxoriy Abdulloh ibn Abbos roziyallohu anhudan rivoyat qilgan uzun qissada, jumladan, quyidagi iboralar ham bor:\r\n    'Ibrohim: 'Ey Ismoil, Alloh menga bir ish buyurdi', dedi.\r\n    Ismoil: 'Robbingiz buyurgan ishni ado eting', dedi.\r\n    (Ibrohim) 'Sen yordam berasanmi?' dedi.\r\n    (Ismoil) 'Yordam beraman', dedi.\r\n    'Alloh menga mana shu yerga uy qurishni buyurdi', deb kichik tepalik va uning atrofini ko'rsatdi. Ana o'shanda Baytullohning poydevorini ko'tara boshladilar. O'g'il tosh tashir, ota qurar edi'.\r\n    Hajning boshlanishi\r\n    Alloh taolo Ibrohim alayhissalomga faqat Baytullohni qurish sharafinigina bermadi. Balki uni qurishdan asosiy maqsad bo'lgan haj ibodatini yo'lga qo'yishdek buyuk baxtni ham aynan o'sha zotga nasib etdi.\r\n    Demak, Baytullohni qurish ishi Alloh taoloning bevosita ko'rsatmalari asosida bo'lgan.\r\n    Ibrohim alayhissalomning Alloh taolo tomonidan mukofotlanishlari yuqorida zikr etilgan narsalar bilan cheklanib qolmadi. Alloh taolo u zotga yana bir o'g'il ko'rishlari, uning ismi Is'hoq bo'lishi, u ham solihlardan, payg'ambarlardan bo'lishining xushxabarini berdi.\r\n    Ibrohim alayhissalom ajallari yetib, bu dunyoni tark etdilar. Necha yil yashaganlari aniq emas, ammo 200 yildan kam. Oila a'zolari u zotni Makfila nomli g'orga, zavjalari Sora onamizning yonlariga dafn qildilar. U joy hozirda Falastinning Xalil shahridadir"
        ]
    },
    {
        "word": "Ibrohim al-Bobshiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Muhammad al-Bobshiy - Bobshiy qishlog'ining nisbati bilan mashhur bo'lib, Ahmad ibn Is'hoq as-Surmoriy, Nasr ibn Husayn va Muhammad ibn Muhlab al-Azdiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar. Hijriy 303 (milodiy 916) yilda vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim al-Buxoriy al-Bobiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Muhammad al-Buxoriy al-Bobiy - Buxoroning Boba qishlog'idan. Bu kishi Nasr ibn Husayn al-Buxoriydan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom al-Buxoriy hadis rivoyat qilganlar. Uch marta hajda bo'lganlar. Hijriy 548 (milodiy 1154) yilning ramazon oyida vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim al-Gʻashidiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Muhammad al-G'ashidiy - Buxoroning G'ashid nomli qishlog'idan. Laqablari – 'Shom'. Buxoro ahlidan bo'lib, Marv va Buxoro ulamolaridan ta'lim olganlar. Abu Ya'qub Isroil ibn Samad, Abu Suhayl Sahl ibn Bishr al-Kindiy, Ali ibn Husayn al-Paykandiy, Abdulaziz ibn Hotam al-Marvaziy va Fazl ibn Ahmad al-Omuliydan hadis ilmidan ta'lim olganlar. Hijriy 346 (milodiy 958) yilda vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim al-Marobitiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Abu Bakr al-Marobitiy al-Buxoriy Buxoro ahlidan bo'lib, Makkiy ibn Ibrohim va Shaddod ibn Hakimdan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdurahmon Abdulloh ibn Ubaydulloh al-Buxoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Ibrohim al-Mostiniy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Ahmad al-Mostiniy hijriy 307 (milodiy 920) yilda Nasafda hukumat tepasida edilar. Ko'p muhaddis olimdan ta'lim olganlar. Abu Ya'lo Abdulmu'min ibn Xalaf an-Nasafiy, Abul Fazl Muhammad ibn Mahmud an-Nasafiydan hadis ilmidan ta'lim olganlar. Umrlarining oxirida ko'zlari ojiz bo'lib qolgan. Hijriy 384 (milodiy 995) yilda vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim al-Mustamliy al-Buxoriy at-Tabib",
        "type": [],
        "definition": [
            "Abu Tohir Ibrohim ibn Ahmad al-Mustamliy al-Buxoriy at-Tabib ham Buxoro shayxlaridandilar. Imom al-Buxoriy shayxlarining mustamliysisi (kotibi) edi. Tabobat ilmi bilan ham shug'ullanardilar. Otalari Abu Amr Muhammad ibn Sobir al-Buxoriydan va Abu Ahmad Muhammad ibn Hasan al-Buxoriydan ta'lim olganlar. U kishidan esa Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Ibrohim al-Fagʻitusiniy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Horun al-Fag'itusiniy Buxoro ahlidan. Abu Ibrohim al-Jo'yboriy, Ibrohim ibn Quraysh as-Sabbog' va Asbot ibn Yasa' va boshqalardan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom va Abu Yusuf Ya'qub ibn Amr al-Fag'itusiniy hadis rivoyat qilganlar. Hijriy 303 (milodiy 916) yilda vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim al-Fagʻondiziy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Nuh al-Fag'ondiziy Buxoro ahlidan bo'lib, (Fag'ondiza – Buxoro qishloqlaridan) bu nisbat bilan mashhur edilar. Otalari Nuh ibn Sudayf va Muhammad ibn Abdulloh al-Muqridan hadis rivoyat qilganlar. O'zlaridan Abul Husayn al-Azdiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ibrohim al-Xabboz ar-Roziy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Muhammad al-Xabboz ar-Roziy Ray ahlidan bo'lib, Buxoroda yashagan olimlardan. Bu kishidan Abu Abdulloh Muhammad ibn Abdulloh al-Hofiz, Abu Sa'd Abdurahmon ibn Muhammad al-Astrobodiy va Abu Abdulloh Muhammad ibn Ahmad al-G'unjor al-Hofiz al-Buxoriy ta'lim olganlar"
        ]
    },
    {
        "word": "Ibrohim al-Xizriy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Muhammad al-Xizriy – Buxoro ahlining ishonchli muhaddisi va olimi. Abu Sa'id Haysam ibn Kulayb ash-Shoshiy, Abul Fazl Muhammad ibn Ahmad as-Sulamiy, Abu Muhammad Abdulloh ibn Muhammad al-Horisiy va Abu Abdulloh al-Azhariydan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abu Komil al-Basiriy va Abu Bakr Muhammad ibn Ali al-Ja'fariy hadis rivoyat qilganlar. Taxminan hijriy 400 (milodiy 1010) yilda vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim al-Xorazmiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Bemor al-Xorazmiy Xorazmda qozi bo'lganlar. Nihoyatda adolatli, ko'p hadis biluvchi va taniqli shoir edilar. Balxda Ali ibn Musodan hadis ilmidan ta'lim olganlar. Osim al-Ahvaldan esa hadis rivoyat qilganlar. Bu kishi rivoyat qilgan hadislarga hujjat-dalil kerak emas edi."
        ]
    },
    {
        "word": "Ibrohim al-Xudobodiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Hamza al-Xudobodiy - Bu kishi imom, fozil, solih, taqvodor va ilmiga amal qiluvchi olimlardan edilar. Ilm talabida hijriy 500 (milodiy 1107) yilda Hijoz, Basra, Makka va Madina shaharlarida bo'lganlar. Keyinchalik o'g'illari Abul Makorim Hamza bilan Madinada yashaganlar. Hijriy 501 (milodiy 1108) yili Madinai Munavvarada vafot etganlar.\r\n    O'g'illari Abul Makorim Hamza Xurosonga qaytib, Movarounnahrda bo'lib, yana Xurosonga borganlar. Xurosonda shayx Ibrohim ibn Ahmad al-Marvaziydan fiqh ilmidan ta'lim olganlar. Buxoroda Abul Qosim Ali ibn Ahmad al-Kalobodiy, Abu Bakr Muhammad ibn Hasan as-Susqoniy va Abu Ali Tohir ibn Ahmad al-Ismoiliydan, Marvda Abul Fazl Muhammad ibn Ahmad al-Mohiyoniy va Abu Ya'qub Yusuf ibn Ayyub al-Hamadoniydan ta'lim olganlar. Abul Makorim juda axloqli, chiroyli siyratli, doimo ibodat va Qur'on tilovati bilan mashg'ul edilar. Hijriy 486 (milodiy 1094) yili Buxoroda tavallud topganlar."
        ]
    },
    {
        "word": "Ibrohim ar-Rivartuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Muhammad ar-Rivartuniy al-Buxoriy - Buxoroning Rivartun nomli qishlog'idan bo'lib, 'Diboj al-vajh' (Harir yuzli) nomi bilan tanilgan edilar. Ilm talabida Xuroson, Iroqda bo'lib, qaytib kelgach, faqih Abu Ali Zohir ibn Ahmad as-Saraxsiy, Abul Qosim Ubaydulloh ibn Muhammad al-Mutavassiy va boshqa ulamolardan hadis ilmidan ta'lim olganlar. Bu kishidan esa Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz va Abu Amr Usmon ibn Ibrohim al-Fazliy ta'lim olganlar"
        ]
    },
    {
        "word": "Ibrohim ar-Romushiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Is'hoq ar-Romushiy - Buxoroning Romush nomli qishlog'idan bo'lib, Muhammad ibn Muhammad ibn Sobir al-Buxoriy va Muhammad ibn Muhammad ibn Hasan al-Buxoriydan hadis rivoyat qilganlar. O'zlaridan esa Abdulaziz ibn Muhammad an-Naxshabiy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Ibrohim as-Saffor al-Moxakiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Is'hoq as-Saffor al-Moxakiy Buxoro ahlidan. Abu Ibrohim Is'hoq ibn Abdulloh al-Jo'yboriydan hadis rivoyat qilganlar. U kishidan esa Abu Solih Xalaf ibn Muhammad al-Xayyom al-Buxoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Ibrohim as-Simajuriy",
        "type": [],
        "definition": [
            "Otalari Ibrohim ibn Imron as-Simajuriy fozil amirlardan bo'lib, Abu Bakr Muhammad ibn Is'hoq va Muhammad ibn Hurays al-Buxoriydan ta'lim olganlar. Bu kishi adolatli amir, adib va olim edilar. Xurosondan Raygacha, Turk shaharlarigacha binolar qurdirganlar. Buxoroda hukmdorlik qilganlar. Shuningdek, Marv, Nishopur va Hirotda ham hukmdor bo'lganlar. Hijriy 336 (milodiy 948) yilning shavvol oyida vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim as-Sutifagʻniy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Ujayf al-Muallim as-Sutifag'niy Buxoroning Sutifag'na qishlog'idan bo'lib, Abu Tohir Asbot ibn Yasa, Ya'qub ibn Muabbid va Muhammad ibn Abdulloh al-Bamijkatiy al-Muqridan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom al-Buxoriy hadis rivoyat qilganlar. Hijriy 315 (milodiy 928) yilning ramazon oyida vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim ash-Shikoniy",
        "type": [],
        "definition": [
            "Abu Ichoq Ibrohim ibn Salim ash-Shikoniy faqih va fozil imom edilar. Imom Abu Bakr Muhammad ibn Fazldan fiqh ilmidan ta'lim olganlar. Abu Abdulloh ar-Roziy, Abu Muhammad Ahmad ibn Abdulloh al-Muzaniy va Ahmad ibn Sahl al-Buxoriydan hadis yozib olganlar. Buxoroda Abu Bakr Muhammad ibn Fazlning imlo majlisi peshvolaridan edilar. Umar ibn Muhammad ibn Ahmad an-Nasafiy aytadilar: 'Ibrohim ash-Shikoniy Buxoroda imlo aytar edilar. Hijriy 423 (milodiy 1033) yildan keyin vafot etdilar'"
        ]
    },
    {
        "word": "Ibrohim ash-Shovajiy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ibrohim ibn Ujayf ash-Shovajiy Buxoro ahlidan. Abu Tohir Asbot ibn Yasa', Ya'qub ibn Ma'bad va Muhammad ibn Abdulloh al-Bamijkatiy al-Muqridan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar. Hijriy 315 (milodiy 928) yilning ramazon oyida vafot etganlar"
        ]
    },
    {
        "word": "Ibrohim surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 52 oyatdan iborat.\r\n    Ushbu surai karimada Ibrohim alayhissalom qissalari keladi, u zotning muborak ismlari zikr qilinadi. Ana shu ism suraga nom bo'lib qolgan. Shuningdek, bu sura Makkai Mukarramada hazrati Muhammad sollallohu alayhi vasallam va u zotga iymon keltirgan oz sonli musulmonlar payg'ambarlar otasi bo'lmish Ibrohim alayhissalom boshlaridan o'tkazgan qiyinchiliklarga o'xshash holatlarga yo'liqqan bir paytda nozil bo'lgan.\r\n    Bu surai karima ham, Makkada nozil bo'lgan boshqa suralarga o'xshab, aqiyda, vahiy, payg'ambarlik, tavhid, qayta tirilish, hisob-kitob va jazoyu mukofot masalalarini o'z ichiga oladi. Albatta, ushbu masalalarni boshqa suralardan farqli o'laroq, o'ziga xos uslub va tariqa ila muolaja qiladi.\r\n    Unda ikkita masalaga alohida e'tibor beriladi.\r\n    Birinchisi: dinlarning va payg'ambarlarning asli birligi, ular chaqirgan chaqiriqning birligi.\r\n    Ikkinchisi: Allohning bashariyatga bergan ne'mati, o'sha ne'matning shukr ila ziyoda bo'lishi. Odamlarning ko'plari shukr qilmasliklari.\r\n    Surai karima payg'ambarlarning vazifasini bayon qilish bilan boshlanadi. Keyin esa Muso alayhissalomning ham barcha payg'ambarlarga o'xshab, o'sha vazifani ado etish uchun payg'ambar qilib yuborilganlari zikr etiladi. So'ngra boshqa payg'ambarlarning ham da'vat qilish, odamlarga tushuntirish uchun kelganlari bayon qilinadi. Ammo qavmlari buni tushunmay, e'tiroz qilishlari, ularning inson ekanliklaridan shubhaga tushishlari esga olinadi. Ortidan payg'ambarlarning raddiyalari keltiriladi.\r\n    Ushbu surai karimaning oyatlari nozil bo'layotgan paytda Payg'ambarimiz hazrati Muhammad sollallohu alayhi vasallam ham ana shu masalalarga duch kelib turgan edilar. Kofir va mushriklar u kishining oddiy inson ekanliklariga, odatdan tashqari mo''jizalar keltirmayotganlariga e'tiroz bildirayotgan edilar.\r\n    Shuningdek, surada qanday qilib payg'ambarlar qavmlarini Allohning izni ila zulmatlardan nurga olib chiqqanlari aytiladi.\r\n    Ibrohim surasida Allohning payg'ambarlari va mo'min bandalariga bergan va'dasi, bu dunyoda nusrat topish va ustun bo'lish, oxiratda oliy maqomlarga erishish qay tarzda yuzaga chiqishi ham zikr qilinadi. Turli misollar keltiriladi.\r\n    So'ngra Alloh taoloning bandalariga bergan ne'matlari va Unga shukr etish lozimligi esga olinadi. Shu bilan birga, noshukr bo'lmaslik uqtiriladi.\r\n    Surada Ibrohim alayhissalomga berilgan ne'mat, ya'ni Makkai Mukarramaga u kishining zurriyoti joylanishi ta'kidlanadi hamda u zotning qilgan duolari zikr etiladi.\r\n    Keyin esa Alloh taolo bandalarining ishlaridan g'ofil emasligi, bir payt kelib, hisob-kitob bo'lishi aytiladi. Zolimlarning oldin payg'ambarning gapiga kirmay, keyin afsus qilishlari, ammo endi afsuslari yordam bermasligi qayd etiladi. Jinoyatchilarning qanday jazolanishlari bayon qilinadi.\r\n    Nihoyada esa suraning avvalidagi masalaga qaytiladi, ya'ni payg'ambarlik va vahiy masalasining haq ekani yana bir bor ta'kidlanadi."
        ]
    },
    {
        "word": "Ibtidoiy",
        "type": [],
        "definition": [
            "boshlang'ich, ilk"
        ]
    },
    {
        "word": "Igʻloq",
        "type": [],
        "definition": [
            "'Ig'loq' so'zi lug'atda 'berkitish', 'yopib qo'yish' ma'nosini anglatadi. Ulamolarimiz ushbu hadisdagi ig'loqdan nima ko'zlangani haqida turlicha fikrga borganlar."
        ]
    },
    {
        "word": "Idda",
        "type": [],
        "definition": [
            "Taloq qilingan yoki eri vafot etgan ayolning, boshqa birovga nikohlanishidan oldin ma'lum muddat kutishi"
        ]
    },
    {
        "word": "Idova",
        "type": [],
        "definition": [
            "Idova – teridan qilingan obdasta"
        ]
    },
    {
        "word": "Idris alayhissalom",
        "type": [],
        "definition": [
            "Idris alayhissalom Alloh taoloning payg'ambarlaridan Odam va Shis alayhissalomlardan keyingi – uchinchisi va Qur'oni Karimda zikr qilingan payg'ambarlar ichida Odam Atodan keyingisidir.\r\n    Alloh taolo u zot haqlarida Maryam surasida marhamat qilib aytadi:\r\n    '...va Kitobda Idrisni esla. U siddiq va nabiy bo'lgan edi. Uni oliy maqomga ko'tardik' (56–57-oyatlar).\r\n    Shuningdek, Anbiyo surasida:\r\n    '...va Ismoil, Idris va Zulkiflni (esla). Ularning har biri sabr qiluvchilardandir. Ularni O'z rahmatimizga kiritdik. Albatta, ular solihlardandir', deydi (85–86-oyatlar).\r\n    Qur'oni Karimda Idris alayhissalom haqlarida bundan boshqa ma'lumot yo'q.\r\n    Tarixchilarning ta'kidlashlaricha, Idris alayhissalomning otalarining ismi Yorid bo'lib, nasablari Shis alayhissalomga to'rt avlod orqali yetib boradi.\r\n    Mashhur tarixchilarimizdan Ibn Is'hoq rahmatullohi alayhning ta'kidlashicha, Idris alayhissalom qalam bilan yozuv yozgan birinchi odamdir.\r\n    Ulamolarning rojih (kuchli) gaplariga qaraganda, Idris alayhissalom Bobilda tavallud topganlar.\r\n    Alloh taolo u zotga payg'ambarlikni berganidan keyin kishilarni Odam va Shis alayhissalomlarning shariatlariga da'vat qilganlar. Biroq u zotning da'vatlarini ozchilik qabul qilib, ko'pchilik rad etgan. Shunda u zot o'zlariga ergashganlar bilan Bobilni tark etib, hijratga chiqqanlar. U kishi o'z hijratlari uchun Misrni tanlaganlar va u yerda yashagan paytlarida odamlarni Allohning diniga da'vat qilganlar.\r\n    Idris alayhissalom birinchi bo'lib madaniy ishlarni yo'lga qo'yganlar. Odamlarga madaniyatga oid ishlarni, qonun-qoidalarni o'rgatganlar. U zotning davrlarida 188 ta shahar qurilgan ekan.\r\n    Idris alayhissalomning yer yuzidagi istiqomatlari sakson ikki yil bo'lgan. So'ng Alloh taolo u zotni 'oliy maqom'ga ko'targan.\r\n    Idris alayhissalom yerdagi umrlarining oxirigacha Allohning shariati bilan hukm qilishda bardavom bo'ldilar. Albatta, yer yuziga payg'ambarlarni yuborishdan ko'zlangan maqsad ham Allohning shariati davom etishi edi. Shunday qilib odamlar ko'payib bordi va bir o'lkadan boshqa o'lkalarga hijrat qilish holatlari yuz berdi."
        ]
    },
    {
        "word": "Idris al-Vardoniy",
        "type": [],
        "definition": [
            "Abu Ahmad Idris ibn Abdulaziz al-Vardoniy Buxoroning Vardona qishlog'idan. Iso ibn Muso al-G'unjor va Abu Muqotil Hafs ibn Salomdan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari Abu Sa'd Humom ibn Idris al-Vardoniy va Sahl ibn Shozavayh al-Bohiliy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Idtiboʻ",
        "type": [],
        "definition": [
            "Tavofni boshlashdan oldin o'ng elkani ochish lozim. Bunda pido o'ng qo'ltiqdan o'tkaziladi. Buni 'idtibo'' deyiladi."
        ]
    },
    {
        "word": "Ijara",
        "type": [],
        "definition": [
            "'Ijara' so'zi lug'atda 'evaz' va 'savob' ma'nosini anglatadi. Qilingan narsaga beriladigan mukofotning 'ajr' deb atalishi ham shundan. Shariat istilohida esa: Ma'lum nafni shunga o'xshash ma'lum zimmadagi yoki ayni evazga sotish ijaradir"
        ]
    },
    {
        "word": "Ijmoʻ",
        "type": [],
        "definition": [
            "bir davrning ijtixod ahli bo'lgan ulamolarining bir ovozdan biror masalani qabul qilishlaridir,"
        ]
    },
    {
        "word": "Ijozat xati",
        "type": [],
        "definition": [
            "ruxsat, guvohlik xati. Murid yoki darveshga shayx tomonidan topshiriladigan malaka irshodi"
        ]
    },
    {
        "word": "Ijtihod",
        "type": [],
        "definition": [
            "g'ayrat qilish, intilish; faqih tomonidan shar'iy hukmni hosil qilish uchun barcha bilim va toqatini ishga solish. Islomda yangi paydo bo'lgan muammolarni hal etishning o'ziga xos usuli"
        ]
    },
    {
        "word": "Izni om",
        "type": [],
        "definition": [
            "'Izni om' degani jome' masjidning eshiklarini ochib qo'yib, xohlagan odamning kirishiga umumiy izn berilishidir. Jum'a o'qimoqchi bo'lganlarni biror shaxs man' qilmasligidir."
        ]
    },
    {
        "word": "Izor ",
        "type": [],
        "definition": [
            "haj yoki umrani niyat qilgan erkak kishi kindigidan pastiga bog'lab oladigan tikilmaydigan ehrom kiyimi."
        ]
    },
    {
        "word": "Izxir",
        "type": [],
        "definition": [
            "Izxir – Makkada o'sadigan mashhur xushbo'y o'simlik"
        ]
    },
    {
        "word": "Iyas ibn Abdulloh",
        "type": [],
        "definition": [
            "Iyas ibn Abdulloh ibn Abi Zubob ad-Davsiy Makkada istiqomat qildilar.\r\n    Rasululloh sollallohu alayhi vasallamdan mashhur 'Allohning cho'rilarini urmanglar' deb boshlanuvchi hadisni rivoyat qilganlar"
        ]
    },
    {
        "word": "Iyd ",
        "type": [],
        "definition": [
            "'Iyd' so'zi 'qaytish' ma'nosini bildiradi. Bayramlar qayta-qayta kelgani uchun 'iyd' deb nomlangan. Eng muhimi, ikki iyd kunlari Alloh taoloning ko'plab xayru barakasi mo'min-musulmonlarga qayta-qayta keladi. Hanafiy mazhabida iyd namozlari 'vojib', deyilgan. Bu namozni Hanbaliy mazhabi 'farzi kifoya', Molikiy va Shofe'iy mazhablari 'sunnat', deydilar."
        ]
    },
    {
        "word": "Iydi Qurbon",
        "type": [],
        "definition": [
            "'Iydi Qurbon' esa, haj ibodatlarining tamom bo'lgani munosabati ila va Allohning yo'lida har qanday qurbon berishga tayyorlikni izhor qilish uchun shariatga kiritilgan bayramdir."
        ]
    },
    {
        "word": "Iydi Fitr",
        "type": [],
        "definition": [
            "'Iydi Fitr' ramazon ro'zasining tamom bo'lgani munosabati ila xursandchilik va shukrni izhor qilish uchun shariatga kiritilgan bayramdir."
        ]
    },
    {
        "word": "Iyjob ",
        "type": [],
        "definition": [
            "'Iyjob' aqdi nikohda ishtirok etadigan ikki tomonning biridan shu masalada avval sodir bo'ladigan narsa, 'qabul' esa ikkinchi o'rinda sodir bo'lgan narsadir. Misol uchun, bir erkak, ayol kishiga: 'Menga xotin bo'lishga rozimisan?' desa, mana shu so'rashi 'iyjob' bo'ladi. Ayol unga: 'Roziman', deb javob bersa, mana shu javobi 'qabul' bo'ladi."
        ]
    },
    {
        "word": "Iylo",
        "type": [],
        "definition": [
            "'Iylo' lug'atda 'qasam ichish' ma'nosini anglatadi. Shariatda esa, erning xotiniga to'rt oy yoki undan ko'p muddat jinsiy yaqinlik qilmaslikka qasam ichishiga aytiladi"
        ]
    },
    {
        "word": "Iymon",
        "type": [],
        "definition": [
            "'Iymon'ning ma'nosi tasdiq etish, ishonishdir. Payg'ambarimiz Muhammad alayhissalomga Alloh taolo tomonidan yetkazilgan barcha narsalarni dil bilan tasdiqlab, ularga til bilan iqror bo'lish 'iymon' deyiladi.\r\n    Iymon bunday izhor qilinadi:\r\n    'Ashhadu allaa ilaaha illallohu va ashhadu anna Muhammadan 'abduhu va rosuluh' (ya'ni 'Guvohlik beramanki, Alloh taolodan o'zga iloh yo'qdir va guvohlik beramanki, Muhammad alayhissalom Uning bandasi va Rasulidir).\r\n    Kim bu kalimani tili bilan aytib, dili bilan uning ma'nosini tasdiq va qabul qilsa, ya'ni Alloh taolo yagona sig'iniladigan Zotdir, Undan o'zga sig'inishga loyiq hech mavjudot yo'q, Muhammad alayhissalom Alloh taoloning bandasi va rasulidir, Muhammad alayhissalom Alloh taolo tomonidan yetkazgan barcha narsa haq-rostdir, deb qalbi bilan tasdiq va qabul qilsa hamda tili bilan shunga iqror bo'lsagina iymonli sanaladi. Ibodat va solih amallarning qabul bo'lishi uchun iymon shartdir.\r\n    Shu o'rinda Islom va iymonning asl mohiyatini bayon etuvchi bir mashhur hadisi sharif bilan tanishib o'tish foydadan xoli bo'lmas edi.\r\n    Umar ibn Xattob roziyallohu anhudan rivoyat qilinadi:\r\n    'Bir kuni Rasululloh sollallohu alayhi vasallamning huzurlarida edik. Birdan oldimizda oppoq kiyimli, sochlari qop-qora odam paydo bo'ldi. Unda safarning asari ko'rinmas edi. Uni birortamiz tanimas ham edik. U kelib Rasululloh sollallohu alayhi vasallamning to'g'rilariga o'tirdi. Ikki tizzasini u zotning ikki tizzalariga tiradi. Ikki kaftini sonlari ustiga qo'ydi va: 'Ey Muhammad, menga Islom haqida xabar ber', dedi.\r\n    Rasululloh sollallohu alayhi vasallam: 'Islom: 'Laa ilaha illallohu Muhammadur Rasululloh' deb shahodat keltirmog'ing, namozini to'kis ado qilmog'ing, zakot bermog'ing, Ramazon ro'zasini tutmog'ing, agar yo'lga qodir bo'lsang, Baytni haj qilmog'ing', dedilar.\r\n    'To'g'ri aytding', dedi u. Biz undan ajablandik. O'zi so'raydi, o'zi tasdiqlaydi. 'Menga iymon haqida xabar ber', dedi.\r\n    U zot sollallohu alayhi vasallam: 'Allohga, Uning farishtalariga, kitoblariga, payg'ambarlariga va oxirat kuniga iymon keltirmog'ing, yaxshiyu yomon qadarga iymon keltirmog'ing', dedilar.\r\n    'To'g'ri aytding', deb tasdiqladi va: 'Menga ehson haqida xabar ber', dedi.\r\n    U zot sollallohu alayhi vasallam: 'Allohga xuddi Uni ko'rib turganingdek, agar sen Uni ko'rmasang, U seni ko'rib turgandek ibodat qilmog'ing', dedilar.\r\n    'Menga (qiyomat) soatidan xabar ber', dedi.\r\n    U zot sollallohu alayhi vasallam: 'So'raluvchi bu haqda so'rovchidan bilimliroq emas', dedilar.\r\n    'Uning alomatlaridan xabar ber', dedi.\r\n    U zot sollallohu alayhi vasallam: 'Cho'ri o'z xojasini tug'mog'ligi, yalangoyoq, yalan¬g'och, kambag'al cho'ponlarning bino qurishda bir-birlaridan o'zishga urinishlarini ko'rmog'ing', dedilar.\r\n    So'ngra u qaytib ketdi. Shunda men birmuncha vaqt (o'sha yerdan) g'oyib bo'ldim. Keyinroq u zot sollallohu alayhi vasallam menga: 'Ey Umar, so'rovchi kimligini bildingmi?' dedilar. 'Alloh va Uning Rasuli biluvchiroq', dedim. U zot sollallohu alayhi vasallam: 'Albatta, u Jabroildir. Sizlarga dinlari¬ngizdan ta'lim bergani kelibdi', dedilar'.\r\n    Yana bir rivoyatda shunday deyilgan:\r\n    'U Allohdan boshqa hech kim bilmaydigan besh narsaning ichidadir', dedilar va Payg'ambar sollallohu alayhi vasallam: 'Albatta, Allohning huzurida (qiyomat) soati ilmi bor' oyatini tilovat qildilar. So'ngra u qaytib ketdi. U zot sollallohu alayhi vasallam: 'Uni qaytaringlar', dedilar. Odamlar hech narsani ko'rmadilar. Shunda u zot sollallohu alayhi vasallam: 'Bu Jabroildir. Odamlarga dinlarini o'rgatgani kelibdi', dedilar'.\r\n    Anas ibn Molik roziyallohu anhudan rivoyat qilinadi:\r\n    'Nabiy sollallohu alayhi vasallam: 'Uch narsa borki, ular kimda bo'lsa, iymon halovatini topadi; Alloh va Uning Rasuli uning uchun ikkovlaridan o'zga hamma narsadan mahbub bo'lishi, bir kishiga faqat Alloh uchungina muhabbat qo'yishi va kufrga qaytishni xuddi olovga tashlanishni yomon ko'rgandek yomon ko'rishi', dedilar'\r\n    Imom Buxoriy, Muslim, Termiziy, Nasoiy rivoyat qilishgan"
        ]
    },
    {
        "word": "Iyso alayhissalom",
        "type": [],
        "definition": [
            "U zotning ismlari Iyso, laqablari Masih, kunyalari Ibn Maryamdir. Iyso alayhissalom haqlaridagi hech bir so'z Maryam bint Imronsiz o'tmaydi. Maryam Iyso alayhissalomning onalaridir.\r\n    '...va farjini pok saqlagan Imron qizi Maryamni (misol keltirdi). Bas, Biz unga O'z ruhimizdan pufladik va u Robbining so'zlarini hamda kitoblarini tasdiq qildi va itoatkorlardan bo'ldi' (Tahrim surasi, 12-oyat).\r\n    Maryam bint Imron Alloh taologa sof e'tiqodda bo'lganlar va o'zlarini ham pok tutganlar. Alloh taolo Jabroil farishta orqali o'sha pok tanaga O'z ruhidan 'puflash' bilan Iyso alayhissalomni ato qilgan. U kishi Allohning so'zlariga va kitoblariga iymon keltirganlar hamda itoatkor qavmlardan bo'lganlar.\r\n    Maryamning otalari Imron katta obro' egasi va Banu Isroilning ulug' ulamolaridan, ayni paytda befarzand ham edilar. Shuning uchun xotinlari 'Farzand tug'sam, Baytul maqdisning xizmatiga beraman', deb nazr qilib qo'ygan edi. Bu haqda Oli Imron surasida kelgan oyatlardan bilib olamiz:\r\n    'Imronning xotini: 'Robbim! Men qornimdagini O'zingga xolis nazr qildim. Mendan qabul et. Albatta, Sen eshituvchisan, biluvchisan', deganini esla!' (35-oyat)\r\n    O'sha vaqtlarda ibodatxonalarga faqat o'g'il bolalar nazr qilinardi. Imronning xotini ham homiladorlik vaqtida 'O'g'il tug'sam kerak', degan umid bilan o'z homilasini avvaldan Alloh taologa nazr qilgan edi. Vaqti-soati yetib, u qiz tug'di.\r\n    'Uni (Maryamni) tuqqan chog'ida: 'Robbim, men buni qiz tug'dim-ku! – Holbuki, Alloh u nima tuqqanini yaxshi biladi. – O'g'il qizdek emas. Va men unga Maryam deb ism qo'ydim va albatta, men Sendan unga va uning zurriyotiga quvilgan shaytondan panoh tilarman', dedi' (36-oyat).\r\n    Lekin Imronning xotiniga ko'ra ibodatxona xizmatida qiz bola o'g'il bolachalik bo'la olmaydi. Shuning uchun u: 'O'g'il qizdek emas', dedi.\r\n    Keyin onalik mehri jo'shib, gapining davomida:\r\n    'Va men unga Maryam deb ism qo'ydim va albatta, men Sendan unga va uning zurriyotiga quvilgan shaytondan panoh tilarman', deb duo qildi.\r\n    Musaffo onalik qalbi o'z zurriyotiga kamol, tinchlik-omonlik va yaxshilik tilaydi.\r\n    'Bas, uni Robbi juda yaxshi qabul qilib, nihoyatda go'zal o'stirdi va Zakariyoni unga kafil qildi. Zakariyo har qachon uning oldiga – mehrobga kirganida, uning huzurida rizq ko'rdi. 'Ey Maryam, senga bu qayerdan?' dedi. 'Bu Allohning huzuridan. Albatta, Alloh xohlagan kishisiga behisob rizq berur', dedi' (37-oyat).\r\n    Shunday qilib Maryam alohida e'tibor ostida o'sa bordi. Alloh taoloning O'zi unga inoyat ko'rsatib turdi.\r\n    Yuqorida zikr qilganimizdek, Horun alayhissalomning zurriyotidan bo'lgan, yahudiylarning 'Haykal' deb nomlangan asosiy ibodatxonasining boshlig'i Zakariyo alayhissalom Maryamning kafili sifatida uning oziq-ovqatidan, rizqidan doimo xabardor bo'lib turdi. Zakariyo alayhissalom ibodatxona mehrobida ibodat bilan mashg'ul bo'lib turgan Maryamning oldiga qachon kirsa, uning huzurida rizq turar edi.\r\n    Albatta, juda ham kichiklik chog'ida otasi Imrondan ajrab, yetim qolgan Maryamni kafillikka olish Zakariyo alayhissalom uchun o'z-o'zidan bo'lmagan. Buning uchun ancha talashib-tortishishlar bo'lib o'tgan. Ana o'sha hodisalar quyidagicha bayon qilinadi:\r\n    'Bu g'ayb xabarlaridan bo'lib, uni senga vahiy qilmoqdamiz. Maryamni qay birlari kafillikka olishga qalamlarini tashlashayotganlarida oldilarida emasding, tortishayotganlarida ham oldilarida emasding' (44-oyat).\r\n    Maryamning onalarining ismi Hanna edi. U kishi Maryamni tuqqanidan so'ng va'dasiga vafo qildi. Yangi yo'rgaklangan chaqaloqni yahudiylarning ibodatxonasiga olib kelib, u yerdagi xodimlarga berdi va: 'Bu nazr qilingan qizni olinglar', dedi. Shunda ular talashib ketishdi, chunki qizcha o'zlarining boshliqlari va ustozlari bo'lmish hazrati Imronning qizi edi-da!\r\n    Bir narsa ustida bir necha kishi talashsa, yana hamma u narsaga teng haqdor bo'lsa, odatda qur'a tashlanadi. Maryamga kafillikni talashganlar ham shunday vaziyatga tushib qolishdi. Shunda ular o'rtasida 'qalam tashlash' bo'lib o'tdi. Shunda hammaning qalami oqib ketib, Zakariyo alayhissalomning qalamlari oqmay, turib qoldi. Buni alomat deb tushunib, Maryamni u zot o'z kafolatlariga olishga rozi bo'ldilar.\r\n    Shunday qilib Maryam Zakariyo alayhissalomning kafolatlarida Baytul maqdisda yashay boshladi. Zakariyo alayhissalom Maryamning oddiy qiz emasligini bildilar. Undan rizqi qayerdan kelayotganini so'radilar. Rizqning Allohdan ekanini ham bildilar.\r\n    Odatda qiz bola o'zidan-o'zi, yo'q joydan homilador bo'lib qolmaydi. Lekin Alloh taolo Maryamga uning homilador bo'lib, Allohning kalimasi tufayli Iyso ibn Maryam degan farzand ko'rishini farishtalar orqali bildirdi:\r\n    'O'shanda farishtalar dedilar: 'Ey Maryam! Albatta, Alloh senga O'zidan bo'lgan 'kalima'ning xushxabarini bermoqdaki, uning ismi Masih Iyso ibn Maryam, dunyoyu oxiratda obro'li va muqarrablardandir. U beshikda ham, navqironligida ham odamlarga gapiradi va u solihlardandir' (45–46-oyat).\r\n    Maryam – ota-onadan tug'ilib, odamlar ichida o'sgan bir qiz. Uning insoniy tushunchasi bo'yicha, erkak bilan birga bo'lmagan qiz bolaning farzand ko'rishi aqlga to'g'ri kelmaydi. Farishtalar esa unga bir o'g'il ko'rishining xabarini berib turishibdi. Shuning uchun\r\n    'U dedi: 'Robbim, menda qayoqdan bola bo'lsin?! Axir menga bashar qo'l tekkizmagan bo'lsa?!' (47-oyat)\r\n    Shunda unga qisqa va tushunarli javob keldi. Bu javob odamlarni o'zining tor aqliy muhitidan chiqib, Allohga taalluqli oddiy haqiqatni anglashga undaydi.\r\n    'Ana shunday. Alloh xohlaganini yaratadi. Biror ishni hukm qilsa, unga: 'Bo'l!' deydi, xolos, bas, u bo'ladir' (47-oyat).\r\n    Jumladan, pok, bashar qo'li tegmagan qizga ham 'Tug'!' desa, tug'averadi.\r\n    Bu qisqa savol-javobdan keyin Maryamga xushxabar olib kelgan farishtalar tug'ilajak bolaning sifatlarini aytishda davom etadilar:\r\n    '...va unga kitobni, hikmatni, Tavrot va Injilni o'rgatadi' (48-oyat).\r\n    Ulamolarimiz: 'Bu oyati karimadagi 'kitobni' so'zi 'yozishni' yoki 'ilohiy kitobni' degan ma'nolardan birini anglatadi', deganlar.\r\n    Tavrot Muso alayhissalomga nozil qilingan ilohiy kitobdir. U Iyso alayhissalomga ham kitob bo'lishini Allohning O'zi aytib turibdi. Tavrot Iyso alayhissalomga kelgan dinning asosini tashkil etadi. Injil esa Tavrotni to'ldirib kelgan.\r\n    Nasroniylar da'vo qilganlaridek, Iyso alayhissalom xudo emas, xuddi boshqalar kabi bandadirlar. Shuningdek, u zot payg'ambar bo'lib kelgan Banu Isroil ham Allohning bandalaridir. Modomiki Robb va banda mavjud bo'lar ekan, bu hol bandaning Robbga ibodatini taqozo etadi. Ushbu aytilganlarga to'liq amal qilgandagina to'g'ri yo'lda yurilgan bo'ladi, baxt-saodatga erishiladi.\r\n    Ana shu gaplardan keyin Maryam yolg'iz qolishni, xayol surishni istab qoldi. Keyin nima bo'lganini Maryam surasidagi quyidagi oyati karimalardan bilib olamiz:\r\n    'Kitobda Maryamni esla. U o'z ahlidan sharqiy makonga ajrab chiqqanda va ular bilan o'zi orasida to'siq olganida, unga O'z ruhimizni yubordik. U unga bus-butun odam bo'lib ko'rindi' (16–17-oyatlar).\r\n    Baytul maqdisda yashayotgan pokiza, bokira, taqvodor Maryam ismli qiz qavmidan ajralib, shaharning sharqiy tomoniga chiqdi. Xullas, o'sha yerga chiqib, qavmidan to'silib oldi. Qavmidan hech kim Maryamni ko'rmaydigan bo'ldi. U xoli va yolg'iz qoldi. Shunda farishta Jabroil alayhissalom Maryamga asl holida ko'rinmay, to'la-to'kis odam siymosida namoyon bo'ldi, chunki o'z suratida ko'rinsa, Maryam butkul dahshatga tushishi mumkin edi.\r\n    Maryam Jabroilni ko'rishi bilan hushyor tortdi. Uni erkak kishi suratida xilvat joyda ko'rishi bilanoq o'z iffati haqida qayg'urdi va unga Allohni eslatdi:\r\n    'Men Rohmandan sendan panoh berishini so'rayman. Agar taqvodor bo'lsang…' (18-oyat) menga yaqinlashma', dedi.\r\n    Taqvodor odam Alloh taolo eslatilganda har qanday yovuzlikdan qaytadi. Maryamning huzuriga Alloh tomonidan elchi bo'lib kelgan Jabroil alayhissalom unga:\r\n    'Men senga bir pok o'g'il hadya etish uchun Robbingning elchisiman, xolos', dedi' (19-oyat).\r\n    Bu odatdan tashqari g'aroyib hol edi. Shu bois Maryam qattiq hayratga tushdi.\r\n    Maryamning holati oddiy insoniy voqelikning ko'rinishi edi. 'Menga biror erkak tegmagan bo'lsa, ya'ni tan mahramim bo'lmasa yoki boshqalar bilan noshar'iy aloqada bo'lgan buzuqi ayol bo'lmasam, qayerdan bola bo'lishi mumkin?!' dedi.\r\n    Jabroil alayhissalom: 'Shunday, Robbing iroda qilsa, bashar tegmasa va buzuqi bo'lmasang ham, farzand bo'laveradi', dedi.\r\n    'Ana shunday. Robbing aytdi: 'Bu Men uchun osondir' (21-oyat).\r\n    Ya'ni 'Hech kimsaning qo'li tegmagan, buzuqlik qilmagan pok va bokira qiz bolaga farzand ato etish Men uchun hech ham mushkul emas', dedi.\r\n    'Uni odamlarga belgi qilishimiz uchun hamda Bizdan rahmat bo'lishi uchun' (21-oyat).\r\n    Ya'ni 'Biz senga bu farzandni odamlarga Allohning qudratiga, xoliqligiga va mudabbirligiga belgi bo'lishi uchun ato qilmoqdamiz'.\r\n    Farishta Jabroil alayhissalom Maryamning yoqasidan pufladi va u Iyso alayhissalomga homilador bo'ldi.\r\n    Oradan ma'lum vaqt o'tdi. Homilador bo'lib qolganidan hijolat bo'lib, odamlar ko'zidan qochib yurgan bokira Maryamni to'lg'oq tutdi. Uyat, andisha va xijolatchiliklarga to'lg'oq alami ham qo'shildi. Boz ustiga, tajribasiz yosh qiz o'zi yolg'iz edi. To'lg'oq azobi zo'raygach, xurmo tanasini mahkam tutdi va chiday olmay:\r\n    'Qaniydi, bundan oldin o'lgan va butunlay unutilib ketgan bo'lsam', dedi' (23-oyat).\r\n    Ibodatxonada voyaga yetgan, pokligi va taqvosi bilan mashhur bo'lgan bokira qiz uchun ersiz bola tug'ish dahshat edi.\r\n    Shu payt kutilmagan hodisa ro'y berdi. Xijolatdan o'limiga rozi bo'lib turgan Maryamga chaqaloq Iyso alayhissalom\r\n    'Uning ostidan nido qildi: 'Mahzun bo'lma, batahqiq, Robbing ostingdan oqar suv qildi. Xurmo tanasini o'zingga tort, senga yangi xurmo tushiradi' (24–25-oyatlar).\r\n    So'ng Iyso alayhissalom onalariga qilgan nidolarini davom ettirdilar:\r\n    'Yegin, ichgin, ko'zing quvonsin. Biror odamni ko'rar bo'lsang, 'Men Rohmanga ro'za nazr qildim. Bugun inson zotiga zinhor gapirmasman', degin' (26-oyat).\r\n    Ya'ni 'Xurmodan ye, suvdan ich va farzandingga boqib quvon. Seni bu g'aroyib holda ko'rgan odamlar turli savollar berishi mumkin. Sen ularga og'iz ocha ko'rma. Ishora bilan 'Men Rohman sifatli Allohga ro'za nazr qildim, ibodatdaman. Bugun inson zotiga zinhor gapirmayman', de. Maryamga bunday ish tutish tavsiyasining yashirin hikmati bo'lib, bu hikmat voqea rivojida namoyon bo'ladi.\r\n    Maryam chaqaloqni ko'tarib, qavmining huzuriga olib bordi. Odamlar bu holni ko'rib, hayratga tushishdi. Darhol Maryamni tergab, dashnom bera boshlashdi.\r\n    Maryam har qancha urinib, ularga haqiqatni tushuntirsa ham, ular 'O'zini oqlayapti' deb gumon qilishlari aniq edi. Shuning uchun o'zi bir og'iz ham gapirmasdan, 'Bundan so'ranglar' degandek, go'dakka ishora qildi. Shunda odamlar avvalgidan ham hayratda qolib:\r\n    'Beshikdagi yosh bola ila qanday gaplashamiz?!' dedilar' (29-oyat).\r\n    Beshikda yotgan Iyso alayhissalomning tillaridan yosh bolaning emas, 'ulul azm' ('sabot-matonatli') payg'ambarning so'zlari yangradi:\r\n    'Albatta, men Allohning bandasiman. U menga kitob berdi va meni nabiy qildi. Meni qayerda bo'lsam ham, muborak qildi. Modomiki hayot ekanman, namoz va zakotni ado etmoqni tavsiya qildi. Meni volidamga mehribon qildi, lekin dimog'dor, badbaxt qilmadi. Menga tug'ilgan kunimda ham, o'ladigan kunimda ham va qayta tiriladigan kunimda ham salom bordir' (30–33-oyatlar).\r\n    Bu ilohiy haqiqatlar hozirgacha yanglish bo'lib kelayotgan e'tiqod, tasavvur va tushunchalarni to'g'rilaydi. Iyso alayhissalomning ta'limoti, u zot haqlaridagi botil g'oyalarni muolaja qiladi.\r\n    Iyso alayhissalom Falastinning Nosira (Nazaret) degan shahrida yashab, odamlarni Allohning ibodatiga chaqira boshladilar. Alloh taolo u zotga Injil kitobini nozil qildi. Iyso alayhissalom kim uchrasa, o'sha odamga va'z qilar edilar. Alloh taolo u zotga bemorlarning shifosiga sabab bo'lish, tug'ma ko'rlarning ko'zini ochish, peslarni tuzatish, o'likni tiriltirish kabi juda ko'p mo''jizalarni bergan edi.\r\n    Havoriylar (xos shogirdlari) u zotning da'vatlarida birga bo'lishdi. Iyso alayhissalom havoriylardan bir guruhini Shomning boshqa diyorlariga da'vat uchun yubordilar.\r\n    Banu Isroil Iyso alayhissalomni qatl qilish uchun o'zaro yashirin ish olib bordi. U zotni Falastinning rumlik hukmdori Pontiy Pilatga topshirishdi. U Iyso alayhissalomni osib o'ldirmoqchi bo'ldi. Lekin Alloh u zotga najot berdi: boshqa odamni u zotga o'xshatib qo'ydi va Iyso alayhissalomni O'z huzuriga ko'tardi. Hodisa quyidagicha jarayon etdi:\r\n    'Alloh taolo Iyso ibn Maryamni ochiq-oydin alomatlar va hidoyat ila payg'ambar qilib yuborganida yahudiylar u zotga berilgan payg'ambarlik va mo''jizalarga hasad qilishdi. U zot ko'r bo'lib tug'ilganlarni va peslarni davolar, Allohning izni ila o'likni tiriltirar, loydan qushning shaklini yasab, unga puflasalar, Allohning izni bilan qushga jon kirib, uchib ketar edi. Alloh u zotni shunga o'xshash ko'plab mo''jizalar bilan qo'llab-quvvatlagan edi. Yahudiylar esa qarshilik qildilar va imkoni boricha u zotga ozor berishga o'tdilar. Hatto Allohning payg'ambari Iyso alayhissalom ular bor joyda turmaslikka, ko'pincha onalari bilan birga safarda yurishga majbur bo'ldilar.\r\n    Yahudiylar bu bilan kifoyalanib qolmay, u zotni o'sha davrdagi Damashqning podshohiga chaqdilar. Podshoh yulduzlarga sig'inadigan mushriklar toifasidan bo'lib, uning millatiga 'yunon' deb nom berilgan edi. Yahudiylar unga: 'Baytul maqdisda bir odam chiqib, kishilarni fitnaga solmoqda, adashtirib, fuqarolarni podshohga qarshi qo'ymoqda', deb xabar yetkazishdi. Podshoh bundan g'azablandi. Baytul maqdisdagi noibiga mazkur odamdan ehtiyot bo'lish, uni osib, boshiga tikan qo'yish, uning 'zarari'dan odamlarni saqlash farmonini berdi. Maktub Baytul maqdisning voliysiga yetib kelganida, u farmonni bajarishga otlandi. Bir toifa yahudiylar bilan Iyso alayhissalom turgan joyga bordi. U zot o'zlariga yaqin kishilar bilan birga edilar. Ularning soni o'n ikkita edi.\r\n    Bu voqea juma kunidan shanbaga o'tar kechasi sodir bo'ldi. Yahudiylar ularni qamalga olishdi: yo g'arazgo'ylar bostirib kirishadi, yoki o'zlari ularning oldiga chiqishlari kerak. Bundan boshqa iloj qolmaganini anglab yetgan Iyso alayhissalom sheriklariga: 'Qay biringizga mening suratim o'tsa, o'sha odam jannatda men bilan birga bo'ladi', dedilar.\r\n    Bir yosh yigit bu ishga tayyorligini bildirdi. Uni xiyol yosh sanadilar. Yuqoridagi gapni ikkinchi, uchinchi bor takrorladilar. Har safar faqat haligi yigit o'zining tayyorligini bildirdi. Iyso alayhissalom: 'Sen o'shasan!' dedilar. Alloh taolo u yigitni Iyso alayhissalomning suratiga kiritdi.\r\n    Tomning shiftidan bir tuynuk ochildi. Iyso alayhissalomni mudroq bosdi. Shu holda osmonga ko'tarildilar. U zot ko'tarilganlaridan keyin sheriklari tashqariga chiqishdi. Yahudiylar qorong'ida haligi yigitni Iyso deb o'ylab, tutib osishdi va boshiga tikan qo'yishdi'. Ba'zi rivoyatlarda Iyso alayhissalomning suratiga kirgan va qatl etilgan shaxs havoriylardan sanalgan Yahuzo (Yahudo) Isxaryutiy* bo'lgani, u xiyonat qilib, Iyso alayhissalomning berkingan joylarini yahudiylarga ko'rsatib bergani keltiriladi.Ammo ishga bu bilan nuqta qo'yilmadi. Asosiy ixtiloflar aynan ushbu voqeadan so'ng boshlandi.\r\n    Ta'kidlanganidek, hodisa qorong'i kechada, to's-to'polon ichida bo'lib o'tdi. Ko'p narsalar noaniq qoldi. Shu bois\r\n    'U haqda ixtilofga tushganlar uning o'limidan shakdadirlar' (Niso surasi, 157-oyat).\r\n    Avvalo hodisada ishtirok etganlarning o'zlari ixtilofga tushib: 'Agar o'ldirilgan Iyso bo'lsa, birga yurgan o'sha odami qani? Agar o'ldirilgan shaxs Iyso bilan birga yurgan odam bo'lsa, unda Iyso qani?' deyishdi. Lekin 'Biz Iysoni o'ldirdik', deb maqtanib yuraverishdi.\r\n    Nasorolarning ba'zilari bu gapga ishonishdi, ba'zilari esa: 'Iyso o'lganidan keyin ko'mildi. Ammo uch kundan keyin yana tirildi', deyishdi. Lekin hammalarining gaplari ham asossiz gaplardir.\r\n    Rim imperatorlari, Banu Isroil Iyso alayhissalomga ergashganlarni qattiq azob-uqubatga solishdi. Ularning ahvoli juda ham tang bo'ldi.\r\n    Milodiy 64 yilda Rim imperatori Neron (mil. 54–68 yillarda hukmronlik qilgan) Iyso alayhissalomga ergashganlarni Rimga o't qo'yishda ayblab, ularga ozor berishni haddan ziyod oshirib yubordi.\r\n    Iyso alayhissalomning odamlaridan bir qismi Hijoz va uning atroflariga hijrat qilib qochib ketishdi. Keyinchalik asta-sekin nasroniy dini tarqalib, hatto Rim imperiyasining rasmiy diniga aylandi.\r\n    * Ruschada Iuda 'Iskariot' deyiladi."
        ]
    },
    {
        "word": "Ikki rukn ",
        "type": [],
        "definition": [
            "Ikki rukn – Rukn deb Ka'baning tashqi burchaklariga aytiladi. 'Ikki rukn' deganda Ka'baning Hijr tarafidagi ruknlari nazarda tutiladi. Ular Yamaniy rukn va Hajarul asvadning (Qora toshning) muqobilidagi ruknlardir. Rasululloh sallallohu alayhi vasallam Yamaniy rukn va Hajarul asvadni istilom qilardilar, ammo Hijr tarafidagi ruknlarni istilom qilmasdilar"
        ]
    },
    {
        "word": "Ikki shahar",
        "type": [],
        "definition": [
            "Ikki shahar – Iroqdagi Kufa va Basra. Ikkalasiga ham xalifa Umar ibn Xattob roziyallohu anhuning davrida asos solingan"
        ]
    },
    {
        "word": "Ikki yamaniy rukn",
        "type": [],
        "definition": [
            "'Ikki yamaniy rukn' deganda Ka'baning Yaman tarafidagi burchagi bilan Hajarul asvad o'rnatilgan burchagi nazarda tutilgan"
        ]
    },
    {
        "word": "Ikrima roziyallohu anhu",
        "type": [],
        "definition": [
            "Ikrima ibn Abu Jahl Maxzumiy al-Qurayshiy, kunyalari Abu Usmon.\r\n    Ikrima va bu kishining otalari Abu Jahl Rasululloh sollallohu alayhi vasallamning ashaddiy dushmanlaridan edi. Ikrima Makka fath etilganidan bir oz keyin Islomga kirdilar va islomlari chiroyli bo'ldi.\r\n    Haj yilida Rasululloh bu kishini Havazon ahlidan sadaqalarni yig'ish uchun mas'ul etgan edilar.\r\n    Abu Bakr roziyallohu anhuning xalifalik davr¬larida mansablarning birida o'ltirdilar. Ridda (ya'ni, diyndan qaytganlar) bilan bo'lgan urushda katta o'rnak ko'rsatdilar. Mana shu jangda xalifa bu kishini askarlar ustiga boshliq qilib tayinladi. Bu zot johiliyatda va Islomda Qurayshning shijoatli kishilaridan edilar.\r\n    Ikrima Islomga kelgan kunlari musulmonlar uni:\r\n    'Sen Allohning dushmani bo'lgan Abu Jahlning o'g'lisan', deb haqorat qilishganida Ikrima bu to'g'rida Rasululloh sollallohu alayhi vasallamga shikoyat qildilar. Shunda Rasululloh sollallohu alayhi vasallam sahobalarga:\r\n    'Ikrimaning otasini so'kmanglar, chunki o'liklarni so'ksalaringiz, tiriklarga ozor bergan bo'lasizlar', dedilar. Ikrimaning hurmatidan Abu Jahlni so'kishdan va uni Ikrima ibn Abu Jahl deb atashdan sahobalarni qaytardilar.\r\n     Bu zot hijratning 13-sanasida (milodiy 634yilda) Yamruk g'azotida shahid bo'ldilar."
        ]
    },
    {
        "word": "Ikroh",
        "type": [],
        "definition": [
            "birovni o'zi yoqtirmagan ishga majburlashni anglatadi. Shar'iy istilohda esa: 'Majburlash' birovning boshqaga voqe' qilgan amali bo'lib, u bilan o'sha odamning shar'iy taklifni bajarishga salohiyati bo'la turib, roziligini yo'qqa chiqarish va ixtiyorini buzishdir. Birov boshqa bir kishini qamab qo'yib yoki ura turib 'falon ishni qilasan' desa, roziligini yo'qqa chiqargan bo'ladi."
        ]
    },
    {
        "word": "Iqdul laaliy fil ahadis al musalsala al -ʼavaliy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari"
        ]
    },
    {
        "word": "Iqob ",
        "type": [],
        "definition": [
            "azob, jazo"
        ]
    },
    {
        "word": "Iqola ",
        "type": [],
        "definition": [
            "'Iqola' so'zi arabcha bo'lib, lug'atda 'bo'shatish' ma'nosini bildiradi. Shar'iy istilohda esa: Iqola ikki sharnomachining haqlarida shartnomani buzishdir. Iqola nikoh aqdidan boshqa barcha aqdlarda joriydir. Ammo savdo aqdini buzishda ko'proq ishlatiladi. Bunda sotuvchi va xaridor savdo tamom bo'lganidan keyin uni buzishga kelishadilar. Iqolaning rukni iyjob va qabuldir. Iqola savdoda ishtirok etuvchilardan birining 'Men savdoni buzdim' deyishi va ikkinchisining 'Rozi bo'ldim yoki qabul qildim', deyishi bilan bo'ladi. Iqola mandubdir"
        ]
    },
    {
        "word": "Iqoma",
        "type": [],
        "definition": [
            "Iqoma masjidga yoki jamoat namoziga yig'ilib turganlarga farz namoz o'qish boshlanayotganini bildirish vazifasini o'taydi. Yolg'iz o'qiyotgan kishi ham iqoma aytsa, yaxshi"
        ]
    },
    {
        "word": "Iqoma vatani",
        "type": [],
        "definition": [
            "Iqoma vatani–vaqtinchalik yashash makoni. Unda musofirning ahli bo'lmaydi, hamda u bu yerda o'n besh kun va undan ko'p yashashni niyat qilgan bo'ladi"
        ]
    },
    {
        "word": "Iqomat",
        "type": [],
        "definition": [
            "farz namozlaridan oldin aytiladigan takbir"
        ]
    },
    {
        "word": "Iqror",
        "type": [],
        "definition": [
            "Arab tilida 'iqror' so'zi 'qaror topish', 'sobit bo'lish', 'sokinlik' ma'nolarini bildiradi. Iqror orqali iqror qiluvchining ko'ngli qaror topadi, sokin va sobit bo'ladi. Shar'iy istilohda esa: Iqror o'zida birovning haqqi borligi to'g'risida xabar berishdir. Iqror shariatda hukm chiqarish borasida hujjat hisoblanadi. Bunga Qur'on, Sunnat va Ijmo'dan dalil bor"
        ]
    },
    {
        "word": "Iqtido",
        "type": [],
        "definition": [
            "Ergashish"
        ]
    },
    {
        "word": "Ilal ",
        "type": [],
        "definition": [
            "hadisga zarar yetkazuvchi sabablar"
        ]
    },
    {
        "word": "Ilyos alayhissalom",
        "type": [],
        "definition": [
            "U zotning nasablari Horun alayhissalomga tutashadi.\r\n    Soffot surasida Ilyos alayhissalom haqlarida quyidagi oyatlar kelgan:\r\n    'Albatta, Ilyos ham rasullardandir' (123-oyat).\r\n    Ilyos alayhissalom Banu Isroilning payg'ambarlaridan biridirlar. U zot Horun alayhissalomning naslidan bo'lib, Ilyos ibn Yosin deb atalganlar. Ilyos alayhissalom Shom o'lkasi, aniqrog'i, hozirgi Livan davlatidagi Ba'labakka shahrida yashab, o'sha yerdagi Ba'l nomli sanamga ibodat qiluvchi bir qavmga yuborilganlar va o'sha yerda vafot etganlar.\r\n    'O'shanda u qavmiga dedi: 'Taqvo qilmaysizmi?! Ba'lga ibodat qilib, yaratuvchilarning eng yaxshisini tark etasizmi? Robbingizni va avvalgi ota-bobolaringizning Robbi – Allohni-ya?!' (124–126-oyatlar)\r\n    Alloh taolo tomonidan payg'ambar qilib yuborilgan Ilyos alayhissalom ham boshqa payg'ambarlar kabi qavmlarini to'g'ri yo'lga, Allohning ibodatiga da'vat etdilar.\r\n    'O'shanda u qavmiga dedi: 'Taqvo qilmaysizmi?!'\r\n    Ilyos alayhissalom qavmlarini taqvodor bo'lishga chaqirdilar. Shuningdek, qavmlarining Allohga shirk keltirib, sanamga sig'inishlarini inkor etdilar:\r\n    'Ba'lga ibodat qilib, yaratuvchilarning eng yaxshisini tark etasizmi? Robbingizni va avvalgi ota-bobolaringizning Robbi – Allohni-ya?!'\r\n    Ularni Allohning ibodatini tark etmaslikka, Unga shirk keltirmaslikka chaqirdilar. Lekin qavmlari bu chaqiriqlarga quloq osmadi.\r\n    'Bas, uni yolg'onchiga chiqardilar. Endi albatta ular (azobga) hozir qilinuvchilardir' (127-oyat).\r\n    Qavm Ilyos alayhissalomni yolg'onchi qildi. U zotga iymon keltirmadi, u zotning aytganlariga yurmadi, taqvo qilmadi. Ba'lga ibodat qilishda davom etdi. Alloh taoloning ibodatini tark qildi. Shuning uchun\r\n    'Endi albatta ular (azobga) hozir qilinuvchilardir'.\r\n    Albatta, do'zax azobini totish uchun hozir qilinajaklar.\r\n    'Allohning tanlangan bandalarigina mustasno' (128-oyat).\r\n    Ular jannatda mukofotlarini olishga hozir bo'ladilar.\r\n    '...va keyingilar ichida uning uchun (olqishlar) qoldirdik' (129-oyat).\r\n    Dunyo turguncha keladigan avlodlar Ilyosni maqtab, olqishlab o'tadigan qilib qo'ydik:\r\n    'Ilyos(iyn)ga* salom bo'lsin'. Biz yaxshilik qiluvchilarni ana shunday mukofotlarmiz, chunki u mo'min bandalarimizdandir' (130–132-oyatlar).\r\n    'Shuning uchun iymon taqozosi bilan Bizning yo'limizda jiddu jahd qildi va mazkur oliy maqomlarga erishdi'.\r\n    Shu yerda Ilyos alayhissalomning qissalari tamom bo'ladi.\r\n    Alloh taolo An'om surasidagi bir qancha payg'ambarlarning zikri asnosida kelgan oyatlardan birida:\r\n    '...va Zakariyo, Yahyo, Iyso va Ilyosni ham. Hammalari solihlardandir' (85-oyat) deb Ilyos alayhissalomni ham zikr qilgan.\r\n    Ushbu oyati karimada zikr qilingan payg'ambarlar – Zakariyo, Yahyo, Iyso va Ilyos alayhissalomlar zuhdu taqvo bilan mashhur bo'lganlar. Shuning uchun ham ular oyati karimada 'Hammalari solihlardandir' iborasi ila vasf qilinayotirlar.\r\n    Zotan, hamma payg'ambarlar ahli solihlardandir. Ushbu to'rt payg'ambar ahli solihlikda alohida martabaga erishganlar.\r\n    \r\n    * Bu so'z haqida ba'zi ‎ulamolarimiz: 'Ilyos so'zi 'fosila' (oyatlarning oxirini bir-biriga ‎o'xshatish) uchun ushbu shaklda keltirilgan', desalar, boshqalari ‎‎'Ilyosiyn – Ilyosning jami, ya'ni Ilyos va unga ergashgan mo'minlarga ‎salom bo'lsin degani' deb tafsir qiladilar.‎"
        ]
    },
    {
        "word": "Ilyos al-Buxoriy al-Mudyonkatiy",
        "type": [],
        "definition": [
            "Abul Xizr Ilyos ibn Hafs al-Buxoriy al-Mudyonkatiy Ilm talabida Iroqda bo'lganlar. Abu Muhammad Horis ibn Abu Usoma at-Tamimiy va Abu Ismoil Muhammad ibn Ismoil at-Termiziydan ta'lim olganlar. O'zlaridan esa Ahmad ibn Xolid ibn Xalil al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Illat ",
        "type": [],
        "definition": [
            "nuqson, kamchilik, ayb"
        ]
    },
    {
        "word": "Ilm ",
        "type": [],
        "definition": [
            "Ilm' so'zi lug'atda bir narsani voqelikdagidek idrok etishni bildiradi.\r\n    Shar'iy istilohda esa ma'naviy ishlarda narsalarni teskarisi yo'q darajada aniq bilish sifatiga 'ilm' deyiladi"
        ]
    },
    {
        "word": "Ilhom",
        "type": [],
        "definition": [
            "ko'ngilga solish; Alloh tomonidan solihlar qalbida paydo etilgan fikr"
        ]
    },
    {
        "word": "Imdod",
        "type": [],
        "definition": [
            "Imdod – yordam, madad so'rab qichqirish"
        ]
    },
    {
        "word": "Imlo",
        "type": [],
        "definition": [
            "Imlo – bir kishi aytib turgan narsani ikkinchi kishining yozishi"
        ]
    },
    {
        "word": "Imom ",
        "type": [],
        "definition": [
            "'Imom' so'zi lug'atda 'ergashiladigan shaxs' ma'nosini bildiradi. Shar'iy istilohda esa o'rniga qarab turli ma'nolarda ishlatiladi. Bu o'rinda musulmonlarning diniy va siyosiy rahbarlari ko'zda tutilgan. Islom davlati xalifalarini ham imom deb nomlashgan. Ilm va tafakkur bobida yuksak maqomga erishgan allomalar, mazhabboshilar, muhaddislarga ham 'imom' unvoni berilgan, masalan: Imom Buxoriy, Imom Muslim, Imom A'zam, Imom G'azzoliy kabi."
        ]
    },
    {
        "word": "Imom Abu Dovud",
        "type": [],
        "definition": [
            "Abu Dovud Sulaymon ibn Ash'as ibn Is'hoq al-Azdiy as-Sijistoniy hujjat bilan hukm qiluvchi, huffozlarning sayyidi, hadislarni tahlil etuvchi 'Kitobi Sahih' deb tan olingan olti muhaddisning biridirlar. Nisbatlari Basra qishloqlarining biri bo'lgan Sijistongadir.\r\n    Bu zot hijratning 202 yili Basrada tavallud topdilar. Hadislarni to'plashda Iroq, Xuroson, Shom, Misr, Arabiston jazirasi kabi yurtlardagi ulamolar huzurida bo'lib chiqdilar. 221 hijriy sanada Kufaga safar qildilar va ana shu yerdagi kishilardan ham hadislarni eshitib, rivoyat qildilar.\r\n    Ulamolar bu zotda bo'lgan sifatlarni ko'p zikr qilishadi. Amr ibn Ali Bohiliy: 'Imom Abu Dovud duosi ijobat bo'luvchi kishilardan edilar', deb aytadilar. Muhammad ibn Sa'd Zuhariy: 'Bu zot obid, taqvoli, fozil, solih, pok kishilardan edilar', deb aytadilar. Abu Hotim ar-Roziy: 'Bu zotdek tazarru'li va bu kishidek hujjati ishonchli kishini ko'rmaganman', deganlar.\r\n    So'fiylarning imomi bo'lmish Sahl ibn Abdulloh bir kuni Imom Abu Dovudning ziyoratlariga kelib: 'Ey Abu Dovud, mening sizda bir hojatim bor', dedilar. Shunda Abu Dovud: 'Ne hojating bor?' deb so'raganlarida, Sahl ibn Abdulloh: 'Agar ruxsat bersangiz, Rasululloh sollallohu alayhi vasallamdan hadislar rivoyat qilgan tilingizni bir o'psam', dedilar. Abu Dovud rozi bo'lib, tillarini chiqardilar va bu zot o'pib oldilar.\r\n    Abu Dovudning 'Sunan' kitoblari to'g'risida ulamolar g'oyatda maqtovli fikrlar bildirganlar. Zakariyo Soniy aytadilar: 'Kitobulloh Islomning asli, 'Sunani Abu Dovud' Islomning ahdidir'. Ulug' zotlardan Xattobiy: 'Bu kitob ikkita sahih kitobdan ko'ra faqihroq va hadis ilmida buning singari kitob tasnif etilmagan', deb aytadilar.\r\n    Imom Abu Dovud hammasi bo'lib 50000 hadis rivoyat qildilar va shundan 4800ta sahih hadisni 'Sunan' kitoblariga kiritganlar. Imom Abu Dovudning 'Sunan' kitoblariga ko'plab sharh va muxtasarlar yozildi.\r\n    Bu zot hadislarni Muslim ibn Ibrohim, Sulaymon ibn Harb, Abu Umar Havziy, Abu Valid Tayolisiy, Abu Muammar al-Muaqqad, Abdulloh ibn Maslama al-Qa'nabiy, Ahmad ibn Hanbal, Usmon ibn Shayba, Amr ibn Avn, Hishom ibn Ammor Dimashqiy, Rabiy' ibn Nofi' Halabiy, Ahmad ibn Solih Misriy va boshqa bir necha kishilardan eshitdilar.\r\n    Imom Abu Dovuddan Termiziy, Nasaiy, o'g'illari Abdulloh, Ahmad ibn Muhammad ibn Horun, Ali ibn Husayn ibn Abd, Muhammad ibn Muhammad Davriy, Ismoil ibn Muhammad Saffor, Ahmad ibn Salmon Najjor va boshqa bir necha kishilar rivoyat qilganlar.\r\n    Imom Abu Dovud hijratning 275 yili, shavvol oyining 16-kunida Basrada vafot etdilar"
        ]
    },
    {
        "word": "Imom Abu Mansur Moturidiy",
        "type": [],
        "definition": [
            "Imom Abu Mansur Muhammad ibn Muhammad ibn Mahmud Moturidiy Samarqandda tug'ilib o'sib, ta'lim olib, ijod qilib, hijriy 333 sanada shu yerning o'zida vafot etgan.\r\n    U kishi hanafiy mazhabida bo'lib, Imomi A'zamning shogirdlari imom Muhammad ibn Hasan rahmatullohi alayhining ikki vosita ila shogirdlari bo'lgan. Ya'ni u kishining ustozlari imom Muhammadning shogirdlari bo'lgan.\r\n    Imom Abu Mansur Moturidiy rahmatullohi alayhi fuqaholar va muhaddislarning yo'lidan yurganlar va boshqalarni ham shunga dalolat qilganlar. U kishi juda ham mashhur bo'lib, Movarounnahrda barcha unga murojaat qilgan. Ular u kishidan fiqh, usulul fiqh va boshqa diniy ilmlardan dars olganlar.\r\n    Imom Abu Mansur Moturidiy rahmatullohi alayhi usul bo'yicha 'Kitobul jadal'ni va fiqh bobida 'Ma'oxizush-shariy'a'ni ta'lif qilganidan keyin shuhrati yana ham oshib ketdi. Shundan keyin ilmi kalomda shuhrat qozonib, Xuroson ahli ushlagan mazhab sohibiga aylandi. Imom Abu Mansur Moturidiy rahmatullohi alayhining aqiydadagi mazhabi Abulhasan Ash'ariyning mazhabiga teng bo'ldi.\r\n    Imom Abu Mansur Moturidiy rahmatullohi alayhi o'zining 'Ta'vilotu ahlis-sunna' nomli tafsirida mo''tazila, xavorij, rofiza, karromiy, jahmiy, mushabbiha, munajjim, folbin va boshqalarning fikrlarini munoqasha qilgan va hammalariga raddiya bergan. U kishi Ahli sunna val jamoaning mazhabini qo'llab-quvvatlagan.\r\n     Sa'duddin Taftazoniy, imom Tahoviy, imom Umar Nasafiy, Faxrul Islom Bazdaviy, Ibn Humom va boshqa ulamolar aqoid ilmining moturidiya yo'nalishida ko'zga ko'ringan ulamolardan bo'ldilar."
        ]
    },
    {
        "word": "Imom Abulhasan Ashʼariy",
        "type": [],
        "definition": [
            "Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhining nasablari ulug' sahobiy Abu Muso Ash'ariy roziyallohu anhuga borib taqaladi. U kishi Bag'dodda yashab, hijriy 336 sanada o'sha yerda vafot etganlar.\r\n    Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi dastlab mo''taziliylarning boshlig'i Abu Ali Jiboiydan dars olgan va kezi kelib o'zi ham mo''taziliylarga bosh bo'lgan. Keyin tavba qilib, mo'z'taziliylarga qarshi bo'lgan. Ularning ayblarini fosh qilgan va Ahli sunna val jamoaning imomi bo'lishga erishgan.\r\n    Imom Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi Ahli sunna val jamoa aqiydasi bo'yicha bir nechta kitoblar yozgan. Ulardan ba'zilarini eslab o'taylik.\r\n    1. 'Maqolatul Islomiyyin'.\r\n    Imom Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi o'zlarining bu kitoblarida Ahli sunna val jamoaning aqiydasini bayon qilib bergan.\r\n    2. 'Al Ibona'.\r\n    Imom Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi bu kitobda Ahli sunna val jamoaning mazhabini imom Ahmad ibn Hanbalning qavllari asosida bayon qilib, mo''taziliy va jahmiylarga raddiyalar qilgan.\r\n    3. 'Risolatun ila ahlis-sag'r'.\r\n    Imom Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi mo''taziliylarga ma'lum bir masalalarda raddiya beradi va o'zining imom Ahmad mazhabida ekanini bayon qiladi.\r\n    Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi o'zining mazkur uch kitobida oyat va hadislarni ta'vil qilish yo'liga o'tmaydi. Salaf ulamolari, xususan, imom Ahmad ibn Hanbal rahmatullohi alayhining yo'llarini tutadi.\r\n    4. 'Al Lama''.\r\n    Imom Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi o'zining bu kitobida avvalgi uch kitobidagidan boshqacha yo'l tutib, aqliy dalilga ham e'timod qiladi. Shunday qilib, u kishi bu kitobda salaf ulamolari yo'lidan emas, keyingi, ta'vil yo'lini tutganlar izidan boradi.\r\n    Imom Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhining hayotlari va mazhablarini chuqur o'rgangan ulamolardan shayx Muhammad Abu Zahra rahmatullohi alayhi quyidagi xulosalarni qiladilar:\r\n    'Qur'oni Karim va hadisi sharifda kelgan aqiydalarni olgan va tushuntirishning barcha uslublarini qo'llagan.\r\n    Tashbihga oid oyatlarning zohirini – sirtqi ma'nosini olgan. Ammo tashbihga o'tmagan. U Alloh taoloning bandalarning yuziga o'xshamagan yuzi va U Zotning maxluqotlarning qo'liga o'xshamagan qo'li borligiga e'tiqod qilgan.\r\n    Aqoidga ohod hadislardan hujjat keltirgan.\r\n    Ahli havoning barchasidan, mo''taziliylardan chetda bo'lgan.\r\n    Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhining mazhabi o'rtacha va mo''tadil mazhabdir. U kishi aqiydalarga dalil keltirishda ham naqldan, ham aqldan istifoda qilgan. Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi Alloh taoloning, Uning rasullarining va oxirat kunining Qur'oni Karim hamda hadisi sharifda kelgan vasflarini sobit qiladi. Aqliy va mantiqiy dalillarni hujjat qilib keltiradi.\r\n    Shuningdek, u kishi falsafiy masalalardan ham foydalangan, chunki Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhi mo''taziliylar, faylasuflar, qarmatiylar, botiniylar, rofiziylar va boshqalarga raddiyalar qilgan. Bu ishda esa ularni qanoatlantirish va ziddilariga dalil keltirish lozimdir'.\r\n    Imom Abulhasan Ali ibn Ismoil Ash'ariy rahmatullohi alayhining ishini davom ettiruvchilar ko'p bo'ldi. Ibn Asokir, Abu Is'hoq Isfiroyiniy, Abu Bakr Qaffol, Hofiz Jurjoniy, Abu Muhammad Tobariy, Doroniy, Abu Bakr Boqilloniy, Abulqosim Qushayriy, Imomul Haramayni, Abu Homid G'azzoliy, Faxrul Islom Shoshiy, Faxriddin Roziy shular jumlasidandir"
        ]
    },
    {
        "word": "Imom Ahmad ibn Hanbal",
        "type": [],
        "definition": [
            "Ahmad ibn Hanbal ibn Hilol ibn Asad Idris ibn Abdulloh ibn Hayyon ibn Abdulloh al-Bag'dodiy hadis va fiqh olimi va Hanbaliy mazhabining asoschisidirlar.\r\n    Nasablari Ibrohim alayhissalomgacha borib, Rasululloh sollallohu alayhi vasallamning nasablariga Adnonda qo'shiladi. Ahmad ibn Hanbalning ota-onalari asli Turkmanistonning Marv shahridan bo'lib, keyinroq Bag'dodga ko'chib kelishadi va Ahmad ibn Hanbal hijratning 164 yili Bag'dodda dunyoga keladilar.\r\n    Bu zotning yoshlik paytlarida otalari vafot etadilar. Ulg'aygach, avvaliga qozixonada Abu Yusufdan qozilikni o'rgandilar. Keyinchalik hadis eshitishni xush ko'rib, hadis jamlashga kirishdilar. Birinchi hadisni hijratning 179 yili eshitib, yozishni boshlaganlar.\r\n    Ahmad ibn Hanbal hijratning 189 yili yigirma besh yoshlarida Yamandagi ustozlari Abdurrazzoq huzuriga safar qiladilar. Do'stlari Yahyo ibn Mu'iyn, Is'hoq ibn Rahovayhlar bilan birga, bu ustozlaridan dars oladilar. Keyinchalik Makka, Madina, Shom, Yaman, Kufa, Basra kabi joylarga hadis to'plash uchun safar qiladilar.\r\n    Ibrohim al-Harbiy aytadilar: 'Alloh taolo avvalgiyu oxirgilarning ilmini Ahmad ibn Hanbalda jamlagan, deb o'ylayman'. Ali ibn al-Madiniy aytadilar: 'Alloh bu diynni ikki kishi bilan quvvatladi. Ularning uchinchisi yo'qdir. Birinchi bor odamlar diyndan qaytayotgan kuni Abu Bakr Siddiq bilan diynni quvvatladi. Ikkinchi bor fitna kunida Ahmad ibn Hanbal bilan quvvatladi'. Yana u kishi: 'Rasululloh sollallohu alayhi vasallamdan keyin Islom ishi bilan Ahmad ibn Hanbaldan tashqari, hech kim shug'ullanmadi', dedilar. U zotdan: 'Abu Bakr Siddiq ham-a?' deb so'ralganda: 'Abu Bakr Siddiq ham', deb aytdilar. 'Chunki Abu Bakr bilan u kishini quvvatlab turgan a'yonlari va askarlari bo'lgan, Ahmad ibn Hanbalning a'yonlari ham, askarlari ham bo'lmagan edi', dedilar.\r\n    Ahmad ibn Hanbal insonlarga eng to'g'ri yo'l— Islom diyni ekanligini tushuntirib, ko'p da'vat qildilar. Shundan keyin qanchadan-qancha odamlar shu kishi sababli Islom diynini qabul qildilar. Zarxoniy aytadilar: 'Ahmad ibn Hanbal 220000dan ziyoda yahudiy, nasroniy, majusiy diyniga mansub bo'lgan kishilarning Islom diyniga kirishiga sababchi bo'ldilar. Ahmad ibn Hanbalni nafaqat Islom ahllari, balki boshqa diynga mansub kishilar ham bilishardi. Bir kuni majusiy diyniga mansub ikki kishi tortishib qoladi. Shunda ular Xuroson qozisi huzuriga borishadi. Qozi Islom diyni bo'yicha hukm chiqarib, ulardan birining haqligini isbot qiladi. Shunda 'ziyoniga hukm qilingan' odam: 'Agar Ahmad ibn Hanbalning mazhabiga asoslanib hukm chiqargan bo'lsang, roziman', deb aytadi.\r\n    Har bir ilm olimi Ahmad ibn Hanbalni o'zining ustozi deb bilib, hurmat qilar edi. Qur'on olimlari Ahmad ibn Hanbalning Qur'on ahkomlarini yaxshi bilishlari, qiroatlari yoqimli, ovozlari shirinligini tan olishar edi. Hadis olimlari Ahmad ibn Hanbalni hadis olimi, uni yodlab, sahih va zaif hadislarga ajratuvchi deb bilishar va u kishidan hadis eshitishga shoshilar edilar. Bunga o'sha paytdagi muhaddislardan Buxoriy, Muslim, Abu Dovud kabi ulug' zotlarning u kishiga shogird bo'lishgani katta dalildir. Fiqh olimlari esa, biror bir hukm chiqarishga shoshilmasdan, Ahmad ibn Hanbalning fatvolariga qarab hukm chiqarar edilar. Bu zotning bir nechta ustozlari bo'lib, Hoshim ibn Bashir, Shofe'iy, Bashir ibn al-Mufazzal, Ismoil ibn Ali, Sufyon ibn Uyayna va boshqalar shular jumlasidandir. Abu Bakr al-Marvaziy, Shohin ibn as-Samido', Abu Dovud, Buxoriy, Muslim, Abu Ali Husayn, Abu Bakr Ahmad va boshqalar u zotning shogirdlari hisoblanadi.\r\n    Ahmad ibn Hanbal 40000dan ziyod hadisni o'z ichiga olgan 'Musnad' kitobidan tashqari, 'Kitobuz-zuhd', 'Al-Ma'rifa vat-ta'lim', 'Al-jarh vat-ta'dil' va boshqalarni tasnif etganlar.\r\n    O'sha paytda ba'zi bir fuqaholar, ayniqsa podshoh huzuridagi olimlar Qur'oni Karimni 'maxluq', ya'ni Qur'on boshqa narsalar kabi, Allohning yaratgan bir maxluqi, deb atashadi. Ahmad ibn Hanbal bu noto'g'ri tushunchaning Islomga zid ekanligini isbotlab bersalar ham ular so'zlaridan qaytmaydilar. Balki kimki ularga qarshi chiqsa, uni azoblayveradilar. Ana shu azoblanganlar orasida Ahmad ibn Hanbal ham bor edilar. Avvaliga u zotni urib, keyin qamoqqa olishadi. Ahmad ibn Hanbal shuncha azoblashsa ham so'zlaridan qaytmaydilar. U kishining sharofatlari tufayli Islom ummati bu noto'g'ri tushunchadan saqlanib qoldi. Alloh u kishidan rozi bo'lsin.\r\n    Imom Ahmad ibn Hanbal hijratning 241 yili Bag'dod shahrida vafot etdilar"
        ]
    },
    {
        "word": "Imom Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad Abu Hasan Ismoil ibn Ibrohim ibn Mug'iyra ibn Ahnaf Yazdabih al-Buxoriy hijratning 194 yili Shavvol oyining 13-si, jum'a kunida Buxoroda tavallud topdilar. U kishi yetim bo'lib o'sdilar. 9 yoshga yetganda Qur'oni Karimni to'laligicha yod oldilar. Hadis eshitishni xush ko'rardilar, voyaga yetgunga qadar o'n mingdan ziyod hadisni yod bilar edilar.\r\n    Homid ibn Ismoil aytadilar: 'Buxoriy bilan dars olardim. Biz har bir hadisni yozib borardik. Buxoriy esa yozmas edilar. Biz undan 'Nega yozmaysiz?', deb so'rasak, u kishi: 'Qani, yozgan narsalaringni ko'rsatinglar-chi', dedilar. Biz ko'rsatganimizda, biz yozgan hadislarni va unga yana 15000 hadis ziyoda qilib, yoddan aytib berdilar'.\r\n    Imom Buxoriyning ko'zlari yoshlik paytlarida ojiz bo'lib, ko'rmay qoladi. Bir kuni onalari Ibrohim payg'ambarni tush ko'radilar. U kishi: 'Ey ayol, Alloh taolo ko'p duoing sababli o'g'lingga ko'zini qaytarib beradi', deydilar. Bir necha kundan so'ng Imom Buxoriyning ko'zlari yana ko'ra boshlaydi.\r\n    Imom 18 yoshga to'lganlarida onalari va akalari bilan haj qilish uchun Makkai Mukarramaga keladilar. Haj amallarini bajarib bo'lgach, onalari va akalarini Buxoroga jo'natib, o'zlari hadis jamlash uchun shu yerda qoladilar.\r\n    Imom Buxoriydan: 'Nega bu ishga qo'l urdingiz?' deb, so'rashganida, shunday javob bergan ekanlar: 'Bir kuni Rasulullohni tush ko'rdim, qo'limda yelpig'ich, u kishini yelpir edim. Bu tushimni ba'zi ta'bir aytuvchilarga aytsam: 'Sen Rasulullohdan yolg'onlarni yelpib turasan', deyishdi'.\r\n    Imom Makkadagi Abdulloh ibn Yazid al-Muqriy ismli kishidan dars oladi. So'ng Xuroson, Bag'dod, Hijoz, Basra, Kufa, Shom, Misr kabi joylardagi kishilardan hadis to'playdilar. Imom Buxoriy 600000 hadis to'plab, shundan 100000 sahih, 200000 zaif hadisni yodlaydilar. Bu hadislarni to'plashda 90000dan ziyod kishining huzurida bo'lib chiqadilar.\r\n    Murajja ibn Rajaa' aytadilar: 'Imom Buxoriy Allohning yerda yuruvchi mo''jizasi edi'.\r\n    Muhammad ibn Yusuf aytadilar: 'Bir kuni Rasulullohni tush ko'ribman. U kishi: 'Qayerga ketyapsan?' deb so'radilar. Men 'Muhammad ibn Ismoilning huzuriga', deb javob bersam: 'Unday bo'lsa, mendan salom aytib qo'y', dedilar.\r\n    Imom Ahmad ibn Hanbal aytadilar: 'Hadis yodlash to'rt kishida tamom bo'ldi: Abu Zar'ata ar-Roziy, Ismoil al-Buxoriy, Imom Dorimiy, Hasan ibn Shujja al-Balhiy'.\r\n    Imom Buxoriyning ustozlaridan biri Abdulloh ibn Xolid Omiriy: 'Buxoriyning ko'kragidagi tuki bo'lishga rozi edim', deganlar.\r\n    Al-Firyabiy aytadilar: 'Bir kuni Buxoriyni tush ko'rdim. U kishi Rasulullohning orqalaridan yurar edilar. Buxoriy Rasulullohning oyoq izlariga oyog'ini qo'yar edilar'.\r\n    Hadis olimlaridan bo'lmish Muslim har qachon Buxoriyning huzurlariga kirsalar: 'Ey hadislar tabibi! Ey hadis ulamolarining sayyidi! Ijozat bersangiz, oyog'ingizni o'psam', der ekanlar.\r\n    Buxoriy o'zlarining 'Jome' Sahih' kitoblarini 16 yilda yozib tugatadilar. 'Qachonki mana shu kitobimga biror hadis kiritsam, g'usl qilib, ikki rakat namoz o'qirdim', deb aytadilar. Ulamolar bu kitobni Qur'ondan keyingi eng sahih kitob deb bilishar edi.\r\n    Muhammad ibn Yusuf aytadilar: 'Rasulullohni tush ko'ribman, menga: 'Qachongacha fiqh o'qiysan? Mening kitobimni o'qisang bo'lmaydimi?' dedilar. Men: 'Sizning kitobingiz qaysi?', deb so'raganimda: 'Muhammad ibn Ismoilning kitoblari mening kitobimdir', dedilar.\r\n    O'sha paytdagi ulamolardan bo'lmish Hokim ismli kishi aytadilar: 'Bu dunyo ostin-ustun qilib yuborilsa ham, Buxoriy kabi hadis biluvchi va uni yodlovchi odam topilmaydi'.\r\n    Imom Buxoriyning 'Sahih' kitoblariga 82 ta sharh yozilgan. Shulardan eng mashhurlari Asqaloniyning 'Fathul-Boriy', al-Karamiyning 'Kavkabud-Daroriy', Qastaloniyning 'Irshodus-Soriy', Imom Suyutiyning 'At-Tavshih', Badruddin al-Ayniyning 'Umdatul-Qoriy', Muhammad Anvar Kashmiriyning 'Fayzul-Boriy' kitoblaridir.\r\n    Imom Buxoriy 'Al-Jome' as-Sahih'dan tashqari yana bir qancha kitoblarning muallifi hamdirlar.\r\n    'Adabul-mufrad', 'Birrul-volidayni', 'Tarixul-kabir', 'Musnadul-kabir', 'Kitobu asmoi sahoba', 'Tafsirul-kabir', 'Xolqu af'oli ibod', 'Sulosiyatul Buxoriy', 'Hadisun-Nabaviy', 'Tarixus-sag'ir', 'Zuafous-sag'ir' va boshqa kitoblar shular jumlasidandir.\r\n    Imom Buxoriyning ustozlari ko'p bo'lgan, u kishi Ali ibn al-Madiniy, Ahmad ibn Hanbal, Is'hoq ibn Rohavayh, Abu Abdulloh Muhammad ibn Ja'far al-Musnadiy, Muhammad ibn Salom va boshqalardan dars olganlar. Imom Buxoriy bundan tashqari Hamad ibn Shokir, Ibrohim ibn Munzir, Tohir ibn Muhammad, Abu Talha Mansur, Muslim, Termiziy, Nasaiy, Abu Bakr ibn Is'hoq, Abu Fazl Ahmad ibn Salma, Abu Bakr ibn Abud Dunyo, Husayn ibn Muhammad al-Qabboniy, Sahl ibn Shadivayh al-Buxoriy va boshqa shogirdlarga ustozlik qilganlar.\r\n    Imom Buxoriy ko'p shaharlarda umr kechiradilar. Keyinchalik o'z ona yurtlarini sog'inib, Buxoroga qaytib keladilar. Imom Buxoriyni Buxoro ahli juda yaxshi kutib oladi, bu yerga kelgan kunlari boshlaridan oltin sochishadi.\r\n    Agar Imom Buxoriy masjidda hadis aytib, dars beradigan bo'lsalar, masjid to'lib-toshar, odamlar soni 10 ming, ba'zan 20 mingdan oshib ketar edi. Har zamonda bo'lgani kabi malomatchilar, hasadgo'ylar, g'iybatchilar o'sha vaqtdagi Buxoro amiri Xolid ibn Ahmadning huzuriga kelib: 'Buxoriy xalqni o'ziga og'dirib oldi, tezroq bir chora ko'rmasangiz, xalq sizdan yuz o'giradi', deb aytishadi. Xolid bu ishda o'z yaqinlariga maslahat soladi. Ular: 'Buxoriy juda mashhur odam, unga yomonlik qilinsa, xalq qo'zg'olon ko'taradi, yaxshisi, uni xalqdan ajratib olish kerak', deb maslahat beradilar. Xolid Imom Buxoriyga odam yuborib, saroyga kelib, amir va amaldorlarning farzandlariga dars berishni taklif etadi. Buxoriy bundan bosh tortadilar. Xolid yana elchi yuborib, kitoblari bilan tezda Amir huzuriga kelishini buyuradi. Buxoriy esa: 'Ilmga kelinadi, ilm hech qachon bormaydi', deb javob beradilar. Bu gaplarga chiday olmagan amir Buxoriyga bu yerdan tezlik bilan chiqib ketishini buyuradi. Buxoriy amirning ziyoniga duo qilib, Samarqandga qarab yo'l oladilar. Samarqanddan ikki chaqirim naridagi Xartang qishlog'iga kelib, qarindoshlarinikiga tushadilar. Bu yerda uch kun turadilar. Ana shu kuni tungi namozni o'qib bo'lgach: 'Ey Robbim! Yer keng bo'lishiga qaramay, menga tor bo'lib ketdi. Meni o'z huzuringga chaqirgin', deb duo qiladilar.\r\n    Folib ibn Jabroil aytadilar: 'Samarqand ahli Buxoriyning huzurlariga kelib, ana shu yerda yashashlarini iltimos qilishdi. Buxoriy bunga rozi bo'lib, safarga otlandilar. Endi otlari tomon to'rt-besh qadam bosganlarida birdan holdan toyib, yiqiladigan darajaga kelib qoldilar. Imomni uyga olib kirishdi va u kishi ko'p o'tmay, vafot etdilar. Ertasiga janozalari o'qilib, qabrga qo'yildilar. Qabrlaridan bir qancha kun xushbo'y mushk hidi taralib turdi. Imom Buxoriyning vafotlari haqidagi xabar o'sha paytdagi xalifa Ibn Tohirga yetib bordi. Xalifa amir Xolid ibn Ahmadning yuziga qora surtib, uni eshakka teskari o'tkazib, sazoyi qilishga, so'ng cho'lga qo'yib yuborishga amr qildi. Cho'lda uni yirtqich hayvonlar yeb ketdi. Alloh taolo johil amirni shu dunyoning o'zidayoq jazolab qo'yaqoldi'.\r\n    Abdulvohid ibn Odam at-Tavovisiy aytadilar: 'Bir kuni Rasulullohni tushimda ko'rdim. U kishi bilan bir jamoa ashoblari ham bor edi. Rasululloh go'yo kimnidir kutayotgandek, bir tarafga qarab turar edilar. U kishiga salom berdim: 'Kimni kutib turibsiz, ey Rasululloh?' desam, Rasululloh sollallohu alayhi vasallam: 'Muhammad ibn Ismoil al-Buxoriyni', deb javob berdilar. Men ikki-uch kundan keyin Buxoriyning vafot etganlarini eshitib qoldim. So'rab-surishtirsam, Rasulullohni tush ko'rgan kunim vafot etgan ekanlar'.\r\n    Yahyo ibn Ja'far aytadilar: 'Agar Buxoriyning umrlarini uzaytirishga qodir bo'lganimda, jonimni berib bo'lsa ham, asrab qolgan bo'lar edim'.\r\n     Imom Buxoriy hijratning 256 yili, Shavvol oyining boshlarida Fitr hayiti kechasida vafot etdilar. Bu zot 13 kun kam 62 yil umr kechirdilar."
        ]
    },
    {
        "word": "Imom Dorimiy",
        "type": [],
        "definition": [
            "Hofizul-kabir Abu Muhammad Abdulloh ibn Abdurrahmon ibn Fazl ibn Bahrom ibn Abdussamad Tamimiy Samarqandiy ad-Dorimiy 182 hijriy sanada Samarqand shahrida dunyoga keldilar. U zotning bobolari asli arab bo'lib, fath sababli Xurosonga ko'chib kelgan va shu yerni vatan qilib qolganlar.\r\n    Muhammad ibn Ibrohim ibn Mansur Sheroziy aytadilar: 'Imom Dorimiy aqlda, fahmda, fazlda, diynda yetuk edilar. U zotning yodlash zehnlari, halimliklari, bosiqliklari, tirishqoqliklari, dunyoda zohidliklari, ibodatlari zarbulmasal qilingandir'.\r\n    Zohirul Xatib Samarqandiy aytadilar: 'Men Ahmad ibn Hanbalning huzurlarida bo'lganimda u kishiga Imom Dorimiyni zikr qilishdi. Shunda u zot: 'Dorimiy sayyidlardan edilar. Kufr keltir, deyilganda ham, dunyo va boyliklar ro'para qilinganda ham qabul qilmaganlar', deb aytdilar.\r\n    Shurayh ibn Yunus shunday deganlar: 'Bag'dodiyning 'Ey ahli Xuroson! Agar oralaringizda Abdulloh ibn Abdurrahmon Dorimiy bo'lsalar, sizlarga qanday ham yaxshi', deganlarini eshitdim'.\r\n    Muhammad ibn Abdulloh ibn Mubarrad Mahramiy aytadilar: 'Ey ahli Xuroson, modomiki oralaringizda Abdulloh Dorimiy bor ekanlar, boshqa kishi bilan mashg'ul bo'lmanglar'.\r\n    Bundor aytadilar: 'Dunyo huffozlari to'rttadir: Muhammad ibn Ismoil Buxoriy, Muslim ibn Hajjoj Nisoburiy, Abdulloh ibn Abdurrahmon Dorimiy va Abu Zar'ata ar-Roziy'.\r\n    Imom Dorimiy birinchi ilmiy ishlarini Samarqandda boshladilar. Xurosondagi ulamolar huzurida ham bo'ldilar, undan so'ng Iroq, Shom, Misr, Makka, Madina yurtlarida bo'lib, u yerlik ulamolardan ham foydalandilar. Hadis ilmidagi qilgan asosiy harakatlari Samarqandda zohir bo'ldi.\r\n    Imom Dorimiyning eng mashhur kitoblari 'Sunani Dorimiy' bo'lib, bu kitob mo''tabar olti kitobning biridir ham deyilgan. Ulamolar 'Sahih kitob' egalari, deb beshta imomga ittifoq qildilar. Bular Buxoriy, Muslim, Termiziy, Abu Dovud, Nasaiylardir, lekin oltinchisiga ixtiloflar bor. Ba'zilar 'Sunani Ibn Moja' va yana ba'zilar 'Muvatto'i Molik', yana boshqalar 'Sunani Dorimiy' deyishadi.\r\n    'Sunani Dorimiy'ning oltinchi kitob deya e'tirof etilishiga haqli ekanligiga dalil shuki, u isnodida zaif kishilarning ozligi, jumhur ulamolardan ajramaganligi, inkor etilgan gaplarning topilmasligi jihatidan ajralib turadi.\r\n    Imom Dorimiy hadis ilmi bilan chegaralanib qolganlari yo'q, balki tafsir, fiqh kabi ilmlarda ham yetuk olimlardan edilar. Bu zot 'Bisavmi mustahoza val mutahayyira' deb nomlangan fiqh kitobi muallifidirlar. Va yana Qur'oni Karimning ba'zi juzlariga tafsir yozganlar, lekin tafsirlari bizgacha yetib kelmagan.\r\n    Imom Dorimiyning 'Sunan' kitoblaridagi hadislarning ko'p qismi fiqhga oid ekanligi ma'lum bo'ldi. Bu kitob boshqalardan ajramaganligi, unda noaniq so'zlar topilmasligi bilan mashhurdir. Bu kitobning ismi to'g'risida ulamolar orasida bir oz ixtiloflar bo'ldi. Imom Zahabiy, Ibn Saloh, Mulla Ali Qori kabi ulug' zotlar 'Musnad' deb, Alouddin Mag'latoydek zotlar esa 'Sahih' ham deb nom berishdi. Lekin Imom Ibn Hajar va Suyutiy ta'kidlaganlaridek, bu kitob kishilar orasida 'Sunan' deb nomlangan. Imom Dorimiyning ushbu 'Sunan' kitoblari 3465ta hadisni o'z ichiga olgandir.\r\n    Imom Dorimiyning ustozlari ko'p bo'lgan. Ular: Abu Musahhar Dimashqiy, Marvon ibn Muhammad, Abulvahhob ibn Said, Nazr ibn Shumayyil, Yazid ibn Horun, Said ibn Omir Zab'iy, Ja'far ibn A'vn, Zayd ibn Yahyo ibn Abiyd Dimashqiy, Vahb ibn Hariyr, Xolid ibn Muhammad, Habbon ibn Hilol, Ashhal ibn Hotam Jum'ahiy, Zahhok ibn Muhammadlardir.\r\n    U zotning shogirdlari va u zotdan rivoyat qilgan imomlar: Imom Buxoriy ('Sahih'laridan boshqa kitoblarida rivoyat qildilar), Imom Muslim, Imom Termiziy, Imom Nasaiy, Abu Dovud, Hasan ibn Sabboh, Abu Zar'ata Dimashqiy, Umar ibn Muhammad Bujayriy, Ja'far ibn Muhammad Faryobiy, Abdulloh ibn Ahmad ibn Hanbal va boshqalardir.\r\n    Imom Dorimiy Marv shahrida 255 hijriy sana, Zulhijja oyining sakkizinchi kuni vafot etdilar. Arafa – jum'a kunida dafn qilindilar."
        ]
    },
    {
        "word": "Imom Ibn Moja",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Yaziyd ibn Abdulloh ibn Moja Roba'iy al-Qazviniy hijratning 209 yili Iroq shaharlaridan biri – Qazvinda tavallud topdilar. Otalari Robi'a qabilasining boshlig'i bo'lib, Moja ismi bilan tanilgan edilar.\r\n    Imom Ibn Moja 'Sahih' deb tan olingan olti kitobdan birining sohibi bo'lmish imomlardan edilar.\r\n    U zot voyaga yetganlarida hadis to'plash uchun Iroq, Basra, Kufa, Shom, Misr, Ray kabi o'lkalarga safar qildilar. Damashqdagi Hishom ibn Ammor, Abbos ibn Valid, Abdulloh ibn Ahmad ibn Bashir, Mahmud ibn Xolid, Misrdagi Harlamata ibn Yahyo, Abu Tohir ibn as-Sirota, Muhammad ibn Ramh, Muhammad ibn Horis, Yunus ibn Abdula'lo, Xumsdagi Muhammad ibn Musaffo, Hishom ibn Abdulmalik, Bag'doddagi Abu Bakr ibn Abu Shayba, Ahmad ibn Abda, Ismoil ibn Muso, Abu Haysama Zohir ibn Xarb kabi ulamolardan dars olib, hadislar to'pladilar.\r\n    Imom Ibn Moja hammasi bo'lib o'ttiz ikkita kitob yozganlar. Shulardan mashhurlari: 'Sunani Ibn Moja' (hadis kitoblari), 'Tafsiri Ibn Moja' (tafsir kitoblari), 'Tarixi Ibn Moja' (tarix kitoblari).\r\n    U zotdan Muhammad Iyso al-Abhariy, Abu Umar Ahmad ibn Muhammad al-Madaniy, Ali ibn Ibrohim al-Qatton, Sulaymon ibn Yazid al-Fomiy, Abu Toyyib Ahmad ibn Ruh al-Bag'dodiylar dars olishgan va hadis rivoyat qilishgan.\r\n    Ibn Mojaning o'zlari va kitoblari to'g'risida ulamolar ko'p maqtovli so'zlarni aytganlar. Abu Ya'lo al-Halimiy aytadilar: 'Ibn Mojaga odamlar ishonib, hadis ilmida u kishiga suyanadilar'. Muhammad ibn Ja'far al-Kattoniy o'zlarining 'Risolati al-mustatrofa' nomli kitoblarida shunday keltiradilar: 'Ulamolar Ibn Mojaning 'Sunan' kitoblarining ishonchliligi, kuchliligi va fiqh ilmida katta foyda berishini ko'rib, oltinchi sahih kitob, deb tan oldilar'.\r\n    Ibn Tohir aytadilar: 'Kimki Ibn Mojaning hadis kitoblariga qarasa, boblari ko'pligi, bir hadis qayta takrorlanmasligi va hadislarning chiroyli tartibda yozilganligini ko'rib, haqiyqatda u zotni hadis jamlashda va kitob yozishda qanday yaxshi yo'l tutganlarini biladi. Bu kitob juda mashhur bo'lmasa ham, o'ziga yarasha obro'-e'tibori bordir'.\r\n    Abu Hasan Ali Ibrohim ibn Salama aytadilar: 'Imomning 'Sunan' kitobi 32 juzdan iborat bo'lib, unda 1500ta bob bordir va bu kitob 4341dan ziyod hadisni o'z ichiga olgandir'.\r\n    Bu zot hijratning 273 yili vafot etdilar."
        ]
    },
    {
        "word": "Imom Muslim",
        "type": [],
        "definition": [
            "Imom Abu Husayn Muslim ibn Hajjoj al-Qushayriy an-Nisoburiy Nisoburda dunyoga keldilar. Nisbatlari Qushayriy bo'lib, u Nisoburga qarashli qishloqdir.\r\n    U zot hadis ilmida kitoblari 'Sahih' deb e'tirof qilingan olti imomning biridirlar. Kitoblari 'Sahih Muslim' esa, Qur'oni Karimdan keyingi o'rinda turadigan kitoblardan biridir. Imomning hadis ilmidagi tutgan o'rinlari va oliy martabalarga yetishlariga sabab, sahih kitoblarida birorta ziyodalik ham, noqislik ham bo'lmaganligi, bundan oldin ham, bundan keyin ham bu kabi tartibdagi kitobning topilmasligidir. Darhaqiyqat, bu Imomning hadis jamlashda nechog'liq mohir ekanliklariga dalolat qiladi. Imom Muslim hadis jamlash davrida ularning nozik jihatlariga g'oyatda katta e'tibor qaratdilar. Hatto bir harf bo'lsa ham, o'zgartirishdan saqlandilar. Bu zot hadislarni avvalidan oxirigacha uzilish va illatdan salomat, isnodlari ishonchli bo'lsagina sahih kitoblariga kiritdilar. Imom Muslimning 'Sahih'laridagi ba'zi jihatlar Imom Buxoriyning kitoblariga qaraganda afzalligini ulamolar qayd qilganlar.\r\n    Imom Navaviy aytadilar: 'Yerning ustida, osmonning ostida Muslimning kitoblaridan ko'ra sahihroq kitob topilmaydi'.\r\n    Mag'riblik shayxlarning ba'zilari Muslimning kitoblari Buxoriyning kitoblaridan ko'ra yaxshi ekanligiga ittifoq qilganlar.\r\n    Imom Muslim aytadilar: 'Agar hadis ahllari ikki yuz yil hadis yozsalar ham, kuchlari mana shu 'sahih'ni yozishga yetadi, xolos'. Va yana marhamat qiladilar: 'Har bir yozgan kitobimni Abu Zar'a ar-Roziyga ko'rsatdim. Agar u zot 'Mana bu hadis illatli', desalar, tark qildim, 'Sahih', desalar, kitobimga kiritdim'.\r\n    Imom Muslim ko'plab kitoblarning muallifidirlar. Shulardan eng mashhurlari 'Sahih Muslim' bo'lib, mana shu kitob sababli ulug' martabaga va chiroyli maqtovlarga sazovor bo'ldilar. Bundan tashqari, u zotning 'Jomi'ul-Kabir alal abvob', 'Kitobu musnadil-Kabir ala asmoir-rijol', 'Kitobul-Asmoi val kuna', 'Kitobul-ilal', 'Kitobut-tamyiz', 'Kitobu hadisi Amr ibn Shu'ayb', 'Kitobu mashoyixi Molik', 'Kitobu avhomul muhaddisiyn', 'Kitobu man laysa lahu illa rovin vohid', 'Kitobu tabaqatit-Tobe'iyn', 'Kitobul-muhozramiyn', 'Kitobu mashoyixis-Savriy' kitoblari ma'lum va mashhurdir.\r\n    Bundan tashqari, 'Sahih Muslim'ga bir necha sharh va muxtasarlar yozilgan.\r\n    Imom Muslimning 'Asmour-rijol' nomli kitoblariga Abu Bakr Ahmad ibn Ali Isfahoniy sharh yozganlar (279 hijriy sanada vafot etganlar).\r\n    Imom Muslimdan ana shu davrning katta imomlari, jamoatlar hadis rivoyat qilishdi. Ular Abu Hotim ar-Roziy, Muso ibn Horun, Ahmad ibn Saloma, Abu Iyso at-Termiziy, Abu Bakr Huzaymiy, Yahyo ibn Sa'id, Abu Avona va boshqalardir.\r\n    Imom Muslim rahmatullohi alayhi (Alloh u kishini o'z rahmatiga olgan bo'lsin) 261 hijriy sana, yakshanba kuni, 55 yoshlarida bu olamdan ko'z yumdilar. Dushanba kuni Nisoburda dafn etildilar."
        ]
    },
    {
        "word": "Imom Muhammad",
        "type": [],
        "definition": [
            "Muhammad ibn Hasan Shayboniy rahmatullohi alayhi"
        ]
    },
    {
        "word": "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi boʻyicha kitoblari",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Imom Nasaiy",
        "type": [],
        "definition": [
            "Imom, hofiz, shayxulislom Ahmad ibn Shu'ayb ibn Ali ibn Sinon ibn Bahr ibn Dinor Abu Abdulloh Xurosoniy Nasaiy hijratning 215 yili Xurosonning shaharlaridan biri bo'lgan Nisoda dunyoga keldilar.\r\n    Bu zot kitobi 'Sahih' deb tan olingan olti Imomning biri edilar. Ashobi hadislar ichida asllar ahlining imomi va peshqadami edilar. Yoshlari o'n beshga yetganda Qutayba ibn Sa'id al-Balxiyning huzurlariga borib, bir yilu ikki oy davomida hadis eshitadilar.\r\n    Imom Nasaiy ilm talab qilib, Xuroson, Hijoz, Misr, Iroq, Arabiston yarim oroli, Shom kabi yurtlarni kezib chiqdilar. So'ngra Misrda 'al-Qanaadiyl' nomli mashhur kitob bozori bo'lgan tor ko'chada yashadilar. Bu zotning huzurlariga hadis eshitish uchun huffozlar tashrif buyurishar edi. O'sha vaqtlarda bu kishiga teng keladigan kishi topilmas edi. Dora Qutniy u zotning sifatlarini zikr qilib, shunday deydilar: 'Abu Abdurahmon hadis ilmida esga olinganlarning muqaddami edilar'. Ibn al-Asiyr 'Jomi'ul-Usul' kitobida: 'Nasaiy Shofe'iy mazhabida edilar va Shofe'iy mazhabida 'Haj' kitoblari bor. U kishi taqvoli, talabchan bo'lib, Dovud payg'ambarning ro'zasida davomli edilar', deb aytadilar. Bu zot roviylarni o'z vaqtida jarohatlab, o'z vaqtida ta'dil etar edilar. Shuning uchun jarh va ta'dillari ulamolar orasida e'tiborlidir.\r\n    Imom Nasaiy ta'lif etgan kitoblar quyidagilardan iborat: 'Sunanul-kubro vas-sug'ro', 'Xasoisu fiy fazli Ali ibn Abu Tolib va oli bayt', 'Kitobuz-zuafo val matrukiyn', 'Manosiku Nasaiy', 'Jam'u musnad Molik ibn Anas va musnad Ali ibn Abu Tolib'.\r\n    Imom Nasaiyning 'As-Sunanul-Kubro' kitoblari avvaliga ko'pgina zaif hadislarni ham o'z ichiga olgan edi. Keyin esa, zaif hadislarni olib tashlab, sahihlarini qoldirganlar va bu kitoblarini 'Al-Mujtabo' deb nomlaganlar. Mazkur kitob bizning vaqtimizgacha yetib kelgan.\r\n    Imom Nasaiyning 'Al-Mujtabo'ni yozishlariga sabab, u kishi 'As-Sunanul-Kubro' kitobini yozgach, Ramla degan joyning amiriga taqdim qilganlarida, amir: 'Buning hammasi sahihmi?' deb so'ragan. Imom: 'Bunda sahih ham, hasan ham bor', dedilar. Shunda amir sahihlarini ajratishni so'radi. Shu munosabat bilan Imom Nasaiy 'As-Sunanul-Kubro' kitoblaridan sahih hadislarni tanlab, 'Al-Mujtabo' yoki 'As-Sunanus-sug'ro' deb nomlangan kitobni yozdilar.\r\n    Bu kitob oltita 'Sahih' deb nomlangan kitobning biridir. U birinchi marta 1256 hijriy sanada Hindistonda chop etilgan va eng ishonchli hadis kitoblaridan hamda hadis ulamolari tarafidan zaif hadislari eng kam va majruh kishilari yo'q kitoblardan deb tan olingan. Bu jihatlarga ko'ra ushbu kitob Abu Dovud va Termiziyning hadislariga ыiyoslanadi. Shuningdek, bu kitob hadislarni bir o'rindagina keltirishga, zarurat tug'ilgandagina boshqa joyda rivoyat qilishga ehtimom qiladi. Shu bilan birga, hadislardan fiqh hukmlarini, illatlari bayoni bilan chiqarishga e'tibor beradi.\r\n    Imom Nasaiyning kitoblariga ko'plab sharhlar yozilgan. Bu zotning ustozlari esa quyidagilardir: Ahmad ibn Abdata az-Zobbyi, Ahmad ibn Maniy', Bashir ibn Muoz al-Aqdiy, Hasan ibn Saboh, Muhammad ibn Ismoil ibn Ayla Dimashqiy, Muhammad ibn Abbon al-Balxiy, Ali ibn Hojar, Amr ibn Zirorata al-Kalbiy, Iyso ibn Muhammad ar-Ramliy, Muhammad ibn Hoshim al-Ba'labakkiy, Is'hoq ibn Shohiyn, Qutayba ibn Sa'id, Is'hoq ibn Ibrohim, Is'hoq ibn Mansur, Is'hoq ibn Muso al-Ansoriy, Ibrohim ibn Sa'id al-Javhariy, Ibrohim al-Javjoniy, Iyso ibn Hammod, Hishom ibn Ammor va boshqalardir.\r\n    Imom Nasaiydan Ahmad ibn Umayr ibn Javso, Muhammad ibn Ja'far ibn Mallaas, Abulqosim ibn Abul Aqib, Abul Maymun ibn Rashid, Abu Ali at-Tabaroniy, Abu Ja'far at-Tahoviy va boshqalar rivoyat qilishgan.\r\n    Muhammad ibn Muso al-Ma'muniy aytadilar: 'Imom Nasaiy Abu Bakr va Umar ibn Hattob roziyallohu anhuning faziylatlarini qo'yib, Ali roziyallohu anhuning faziylatlari haqida 'Al-Xasois' kitobini yozdi, deb, uni qabul qilmay, inkor qilayotgan qavmni ko'rdim. Bu haqda Imom Nasaiyga aytganimda shunday dedilar: 'Dimashqqa kirib, Ali roziyallohu anhudan uzoqlashganlarning ko'payganini ko'rib, 'Al-Xasois' kitobini tasnif qildim va Allohdan ularni hidoyatga boshlashini umid qildim'.\r\n    Bu zot tavallud topgan Niso shahri haqida ma'lumot: Shaharning Niso deb atalishiga sabab, fotihlar Xurosonni fath etishganda shaharning erkaklari qochib ketishgan ekan. Musulmonlar shaharda erkak zotini topa olmay, uni tashlab o'tib ketishgan ekan. Shu sababli u Niso ('Ayollar') shahri, deb atalgan ekan. U hozirgi Turkmaniston yerlarida joylashgan shahardir. Bu yerdan Imom Nasaiydan tashqari Abu Ahmad Homid Zinjaviy al-Azdiy kabi katta olimlar ham chiqqan.\r\n    Imom Nasaiy hijratning 303 yili Makkada shahid bo'ldilar va Safo-Marva orasiga dafn etildilar.\r\n    Shayx Nosif mazkur besh imomdan boshqa bir necha eng mashhur muhaddislarning kitoblaridan ham hadislar keltirgan. Biz ularning ham tarjimai hollarini qisqacha bayon etamiz"
        ]
    },
    {
        "word": "Imom Nofeʼdan Varsh rivoyat qilgan qiroat",
        "type": [],
        "definition": [
            "Bu qiroat asosan Islom olamining mag'ribiga tarqalgan"
        ]
    },
    {
        "word": "Imom Osimdan Hafs rivoyat qilgan qiroat",
        "type": [],
        "definition": [
            "Bu qiroat Islom olamining mashriq va markaziy tarafining barchasida keng tarqalgan"
        ]
    },
    {
        "word": "Imom Termiziy",
        "type": [],
        "definition": [
            "Imom Abu Iyso Muhammad ibn Iyso ibn Savra ibn Muso ibn Zahhok as-Sulmiy az-Zaririy al-Bug'iy at-Termiziy hozirgi Termiz shahridan olti farsax uzoqlikda joylashgan Bug' qishlog'ida 209 hijriy sanada tavallud topdilar. Kunyalari Abu Iyso, ismlari Muhammad, otalarining ismlari Iyso, bobolarining ismlari Savra, nisbatlari Jayhun daryosi bilan o'ralgan qadimgi Movarounnahrning Termiz shahri nomi bilandir.\r\n    U zotning ustozlari ko'p bo'lib, ulardan eng mashhuri Imom Buxoriydir. Ko'p hadislarni Buxoriydan rivoyat qilganlar. Imom Muslim, Abu Dovud hamda Basra, Kufa, Xuroson, Hijoz shayxlari ham u kishining ustozlaridan bo'lib, ularning ra'y va vositalaridan ham foydalanganlar. Imom Termiziy kitobi 'Sahih' deb tan olingan olti nafar imomlarning ichida to'rtinchi o'rinda turadilar.\r\n    U zotning kitoblari bo'lmish 'Sunani Termiziy' esa 'Sahih Buxoriy' va 'Sahih Muslim' kitoblaridan keyingi o'rinda turadi. U zot hadisni jamlashda va uni aniqlashda, yodlashda va zikr qilishda alohida bir maqomga ega edilar. U kishining shogirdlaridan bo'lgan Abu Sa'd Idriysiy ustozlarini sifatlab, yodlashlari, zehnlari to'g'risida zarbulmasallar bitilganini aytadilar.\r\n    Shogirdlaridan yana biri: 'Imom Buxoriyning vafotlaridan keyin Xurosonda Abu Iyso at-Termiziydek ilmda, zehnda, taqvoda, zohidlikda biror kishi topilmas edi', deb aytadi.\r\n    Imom Termiziy ko'p yig'laganlaridan hayotlarining oxirgi ikki yilida ko'zlari ojiz bo'lib qolgan.\r\n    Ibn Atiyya: 'Mening huzurimda Imom Buxoriy va Muslimning kitoblariga qaraganda Imom Termiziyning kitoblari nurliroq va tushunarliroq', deb aytadilar. 'Nima uchun?' deb so'ralganida, Ibn Atiyya: 'Chunki ikkita Imomning kitoblaridan faqatgina ilm va ma'rifat ahllarigina foydalana olishadi, xolos', deb aytgan ekanlar.\r\n    Shayxlardan biri Imom Termiziyni imtihon qilish uchun u kishiga qirqta g'arib hadisni aytib, savol beradi. Imom Termiziy qirqta hadisni birorta harfda ham xato qilmay, avvalidan oxirigacha o'qib beradilar. Shayx buni ko'rib, 'Sening mislingdagi kishini ko'rmaganman', deb aytdi.\r\n    Imom Termiziy ko'p kitoblarning muallifidir. Ayniqsa 'Sunan' kitoblari chiroyli, foydasi ko'p bo'lib, takror so'zlari oz, chiroyli tartibda yozilgandir. Abu Ali Mansur ibn Abdulloh Xolidiy Imom Termiziyning 'Al-Jomi'us-Sahih' kitoblarini sifatlab: 'Kimning uyida mana shu kitob bo'lsa, go'yoki uyida Payg'ambarimiz gapirayotgandek bo'ladilar', deb aytadilar. U zotdan bizga quyidagi kitoblar meros bo'lib qoldi:\r\n    'Kitobu azim' ('Al-Jomi' as-Sahih'), bu kitob 'Sahihut-Termiziy' nomi bilan mashhurdir, 'Shamoilun-Nabaviya', 'Ilalu mufrad', 'Ilalu fiy oxiri jomi'', 'Kitobuz-zuhd', 'Kitobut-tarix', 'Asmous-sahoba', 'Al-Asmo val kuna', 'Kitobu fiyl asaril mavqufa'.\r\n    Imom Termiziyning 'Sahih' kitoblariga ko'plab sharh va muxtasarlar yozilgan.\r\n    Ustozlari bo'lmish Imom Buxoriy Termiziyga qarata: 'Sen mendan foydalanganingdan ko'ra, men sendan ko'proq foydalandim', deb aytganlar.\r\n    Imom Termiziy quyida ismlari keladigan shayxlardan hadislar eshitib, ulardan rivoyat qildilar: Abdulloh ibn Muoviya Jum'ahiy (243 hijriy sanada vafot etganlar), Ali ibn Hojar Marvaziy (244 hijriy sanada vafot etganlar), Suvayd ibn Nasr ibn Suvayd Marvaziy (240 hijriy sanada vafot etganlar), Qutayba ibn Sa'id Saqafiy Abu Rojaa (150 hijriy sanada tug'ilib, 240 sanada vafot etganlar), Abu Mus'ab Ahmad ibn Abu Bakr Zuhriy al-Madaniy (150 hijriy sanada tug'ilib, 242 sanada vafot etganlar), Muhammad ibn Abdulmalik Abu Shavorib (244 hijriy sanada vafot etganlar), Ibrohim ibn Abdulloh ibn Hotam al-Hiraviy (178 hijriy sanada tug'ilib, 244 hijriy sanada vafot etganlar), Ismoil ibn Muso Fazoriy as-Suddiy (245 hijriy sanada vafot etganlar)."
        ]
    },
    {
        "word": "Imom Hokim",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Abdulloh ibn Hamdavayh ibn Muhammad ibn Na'iym az-Zobbiy an-Nisoburiy hijratning 321 yilida, Robiul-avval oyining uchinchi kuni tavallud topdilar. Yoshlik paytlarida ilm olishni boshlab, avval otalaridan, so'ng amakilaridan dars oladilar. Yoshlari ulg'aygach, hijratning 356 yili Iroq va Hijozga safar qilib, haj ibodatini ado etdilar. Keyin Xuroson, Movarounnahrni aylanib, 2000ga yaqin ustoz ko'radilar. Hijratning 360 yili yana Hijoz va Iroqqa safar qilib, u yerdagi kishilardan hadis to'playdilar. Keyin o'zlari tug'ilib o'sgan Nisoburga qaytib keladilar va qozilik amaliga o'tiradilar. So'ngra Jurjonga qozi qilib tayinlanadilar. Shuning uchun ham u kishini Hokim deb atashgan.\r\n    Ibn Xallikon aytadilar: 'Bu zot o'z vaqtining imomi, ko'p kitoblar muallifi va fiqh olimlaridan edilar. Fiqh ilmini Abu Sahl Muhammad ibn Sulaymon as-Sa'lukiydan oladilar'.\r\n    Abu Hozim aytadilar: 'Nisoburda Muslim ibn Hajjojdan keyin hadis ilmida mashhur bo'lgan odam Imom Hokim edilar'. Yana u kishi: 'Hokim o'z asrlarida hadis ilmining ulug' olimlari Dora Qutniy, Ibn Adiy, Ibn Muzaffarlarga teng keladilar. Hozirgacha na Hijozda, na Shomda, na Iroqda, na Tobaristonda, na Xurosonda bu shaxsga teng keladigan kishi topiladi'.\r\n    Qozi Abu Samh Abdulloh al-Asmiy agar hukm ishida biror bir ishkallik bo'lib qolsa, Imom Hokimga maktub yozib, shu ishning hukmini so'rar, keyin javobga qarab, hukm qilar edilar.\r\n    Imom Hokimning ta'lif etgan kitoblari: 'Ilal', 'Amoliy', 'Favoidush-shuyux', 'Ma'rifatul hadis', 'Tarixu ulamoi Nisobur', 'Madxalu ila ilmis-sahih', 'al-Mustadrak alas-sahihayni', 'Muzakkiyl-axbor', 'Fazoilu Imomish-Shofe'iy', 'Fazoilu Fotima', 'Tarojimush-shuyux' va boshqalar.\r\n    Ibn Subkiy aytadilar: 'Tarixu ulamoi Nisobur' kitobi mening huzurimda kitoblar sayyididir'.\r\n    Abu Sahl as-Sa'lukiy, Abu Bakr Ahmad ibn Sulaymon, Abul Abbos, Da'laja ibn Ahmad, Ibn Ahzom, Abu Ali Nisoburiy, Dora Qutniy va boshqalar Imom Hokimning ustozlari bo'lishgan. Imom Bayhaqiy, Abulfattoh ibn Abulfavoris, Abu Zarr al-Hiraviy, Abu Solih al-Hiraviy va boshqalar esa Imom Hokimga shogird bo'lishgan.\r\n     Imom Hokim hijratning 405 yili vafot etganlar."
        ]
    },
    {
        "word": "Imom Shofeʼiy",
        "type": [],
        "definition": [
            "Muhammad ibn Idris ibn Abbos ibn Usmon ibn Shofe' ibn Soib ibn Abdulyazid ibn Hoshim ibn Muttalib ibn Abdumanof (kunyalari Abu Abdulloh al-Qurayshiy) hijratning 150 yili G'azza shahrida tavallud topdilar. Bu zot Shofe'iy mazhabining asoschisi, faqih, muhaddis imomlardan biridirlar.\r\n    Imomning yoshlik davrlari Makkada kechib, yetim o'sganlar. Onalari o'qish-yozishni o'rgatmoqchi bo'ladilar, lekin maktabga to'laydigan pullari bo'lmaganligi uchun ko'p qiynaladilar. Oxiri bir muallim Shofe'iydagi tug'ma qobiliyatni bilganligi tufayli bepul o'qitishga rozi bo'ladi. Bu zot o'qish-yozishni tez orada o'rganib, yetti yoshlarida Qur'oni Karimni to'la yod oladilar. Shundan so'ng masjidga kirib, ulamolardan ilm o'rganadilar. Imom Shofe'iyning yodlash qobiliyatlari g'oyat kuchli bo'lganligi uchun o'n yoshlarida Imom Molikning 'Muvatto' kitobini yod oladilar. Keyinchalik Muslim ibn Xolid az-Zanjiy va Molik ibn Anaslardan fiqh va hadis ilmini o'rgana boshlaydilar. O'n beshga to'lganlarida ustozlari Muslim ibn Xolidning fatvo berishga fotihasini oldilar.\r\n    Abdulg'ani ad-Daharniy o'zlarining 'A'lomu Muslimiyn' nomli kitoblarida Shofe'iyning o'zlari haqlaridagi quyidagi so'zlarini keltirib o'tadilar: 'Bir kishiga uchrashib, unga: 'Qur'onni yod oldim, arab she'rlari va balog'atini o'rgandim, endi nima qilay?', desam, u kishi 'Molik ibn Anasning huzurlariga bor', deb aytdi. Ko'nglimga shu narsa ma'qul tushdi. Makkadagi bir kishidan Molik ibn Anasning 'Muvatto' kitoblarini olib, to'qqiz kechada yod oldim. So'ngra Madinaga yo'l oldim. Men u zotning huzurlariga kirdim va o'zim haqimda so'ylab berdim. U kishi so'zimni tinglagach, bir qancha vaqt menga tikilib qoldilar. 'Isming nima?' deb so'radilar. 'Ismim Muhammad', deb aytdim. 'Ey Muhammad, Allohga taqvo qil, gunoh ishlardan chetlangin, albatta, sen tez kunlarda ulug' martabalarga yetasan', deb aytdilar. U kishiga Qur'on tilovat qildim. Endi qiroatdan to'xtay desam, u kishiga qiroatim yoqib qolib, 'O'qi, o'qi', der edilar. Keyin Madinada Molikning vafotlariga qadar dars olib turdim'.\r\n    Abdulloh ibn Zubayr Imom Shofe'iy haqida: 'Shofe'iy Molikning huzurida ilmdan ozgina qoldirdi. Madina ulamolari huzuridagi barcha ilmlarni jamlab oldi', deb aytadilar. Imom Shofe'iy yana Makkaga qaytib, bu yerda bir necha kun turgach, yana safarga otlanadilar. Bu safar Madinadan ham uzoqroq bo'lgan Yamanga safar qiladilar. Ko'p o'tmay, bu zot Makka va Madinadagi kabi, Yamanda ham shuhrat qozonadilar. Hijratning 184 yili Bag'dodga safar qilib, u yerda Muhammad ibn Hasanning uyida turadilar. Imom shu yerda kambag'allikdan chiqa boshlaydilar. U zotni xizmatlari evaziga xalifa Horun ar-Rashid 500000 dinor bilan mukofotlaydi. Iroqda ham ilm olgach, yana Makkaga qaytib keladilar. Masjid al-Haromda halqa qilib, shu yerda dars bera boshlaydilar. U halqada nafaqat toliblar, balki Sufyon ibn Uyayna, Ahmad ibn Hanbal kabi ulamolarni ham topish mumkin edi.\r\n    Hijratning 195 yili yana Bag'dodga qaytib boradilar. U yerdagi 'Jomi'ul-g'arbiy' masjidida odamlarga dars bera boshlaydilar. Ibrohim al-Harbiy: 'Ana shu masjidda yigirmaga yaqin halqa bo'lar edi', deb aytadilar. Bundan tashqari, Imom Shofe'iy Misrga borib, u yerdan ko'p ilmlar o'rganib, shogirdlar orttirib qaytadilar.\r\n    Imom Shofe'iyning zamonalarida hadis, fiqh, tafsir va she'riyatda u kishiga yetadigan kishi topilmas edi. Buni ulamolarning u kishi haqlarida aytgan quyidagi so'zlaridan bilish mumkin.\r\n    Fazl ibn Dukayn 'Shofe'iydan ko'ra aqli yetuk, fahmi komil, ilmi ko'p odamni eshitmadik ham, ko'rmadik ham', deganlar.\r\n    Imom Abu Zar'ata ar-Roziy: 'Islom ummatiga Shofe'iyni minnat qilsa arziydi', der edilar.\r\n    Bashir al-Marisiy: 'Shofe'iyga dunyo ahli aqlining yarmi berilgan edi', deb aytadilar.\r\n    Imom Ahmad ibn Hanbal: 'Kimki qo'liga siyoh bilan qalam olsa, uning zimmasida Shofe'iyning minnati bordir. Agar Shofe'iy bo'lmaganlarida, hadis va fiqhni bilmagan bo'lur edik. Fiqh eshiklariga qulf solingan edi. Alloh Shofe'iy sababli u eshiklarni ochib berdi', deb aytadilar.\r\n    Alloh taoloning bandalariga bo'lgan marhamatidan yana biri – Imom Abu Hanifa vafot etganlarida u zotga o'rinbosar qilib, hijratning 150 yili Imom Shofe'iyni yuborganidir.\r\n    Imom Shofe'iyning ta'lif etgan kitoblari 113 ta bo'lib, shulardan mashhurlari 'Kitobu hujja', 'Risola', 'Um', 'Al-mabsut', 'Ixtiloful-hadis', 'Sifatul-amr van-naxiy', 'Ibtolul-istihson', 'As-salavot', 'Al-buyu'', 'Al-muzora'a', 'Ad-da'vo val bayonot', 'Sayrul-Avzo'iy', 'Fazoilu Quraysh', 'As-sabku varra'yu'lardir.\r\n    Shofe'iyning o'zlari aytadilar: 'Tushimda bir kishi kelib, kitoblarimni oldi va havoga sochib yubordi. Kitoblarim har tomonga tarqalib ketdi. Tush ta'birini ba'zi bir kishilardan so'rasam, tushing to'g'ri chiqadi, sening ilming yoki kitobing kirmagan biror-bir shahar qolmaydi, deb aytishdi'.\r\n    Imom Shofe'iy hijratning 204 yili 54 yoshlarida vafot etdilar."
        ]
    },
    {
        "word": "Isbaʼ",
        "type": [],
        "definition": [
            "(o'rta qomatli odam barmog'ining qalinligi) = 1,925 sm(≈ 2 sm)."
        ]
    },
    {
        "word": "Islom ",
        "type": [],
        "definition": [
            "bo'ysunish, itoat etish, o'zini Alloh irodasiga topshirish. Alloh tomonidan yuborilgan so'nggi din"
        ]
    },
    {
        "word": "Isloh",
        "type": [],
        "definition": [
            "tuzatish, to'g'rilash"
        ]
    },
    {
        "word": "Ismoil al-Abiqiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Is'hoq Ismoil ibn Umar al-Abiqiy al-Buxoriy Buxoro ahlidan bo'lib, hadis rivoyat qilganlar. Hijriy 337 (milodiy 949) yilda tug'ilib, hijriy 417 (milodiy 1027) yili Buxoroda 80 yoshda vafot etganlar. Bu kishi haqlarida Abu Komil al-Basiriy al-Buxoriy 'Al-Muzofot' kitoblarida zikr qilib, shunday deganlar: 'U kishidan ko'p hadislar ta'lim oldim'. Jumladan, Sufyon as-Savriyning ikki jildlik 'al-Musnad' kitobini to'liq shu kishidan ta'lim oldim. Abu Sahl Horun ibn Ahmad al-Astrobodiy, Abu Ahmad Bishr ibn Abdulloh ar-Roziy va Bakr ibn Sahl ad-Dimyotiydan hadis rivoyat qilganlar. O'zlaridan esa Abul Fazl Ibrohim ibn Hamza al-Hamadoniy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Ismoil alayhissalom",
        "type": [],
        "definition": [
            "Ismoil alayhissalom payg'ambarlar ichida eng nasabi mashhur, ya'ni ota-onasi mashhur zotlardan birlari desak, mubolag'a qilmagan bo'lamiz. U zot Ibrohim alayhissalom va Hojar onamizdan dunyoga kelganlar. Ismoil alayhissalom o'z zurriyotlari ichidan Muhammad sollallohu alayhi vasallam chiqqanliklari bilan ham mashhurdirlar. Shunday qilib Ismoil alayhissalom ota tarafdan ham, farzand tarafdan ham o'zlaridan ko'ra mashhur zotlarga bog'lanadilar.\r\n    Ismoil alayhissalomning tug'ilishlarigacha bo'lgan voqealar yuqorida, Ibrohim alayhissalomning tarixlari bayon etilgan sahifalarda keltirildi.\r\n    Ushbu o'rinda ularning qisqacha bayonini yana bir bor keltiramiz:\r\n    Ismoil alayhissalomning onalari Hojar misrlik bo'lib, o'sha yerning podshohi tomonidan Sora onamizga, u kishi tomonidan esa erlari Ibrohim alayhissalomga hadya qilingan edilar. Alloh taoloning va'dasiga binoan, qartayib qolgan Ibrohim alayhissalomdan homilador bo'lgan Hojar onamizdan Ismoil alayhissalom dunyoga keldilar.\r\n    Keyin oilaviy sabablarga ko'ra, Alloh taoloning hikmati asosida Ibrohim alayhissalom go'dak Ismoilni onasi bilan birga o'simliksiz cho'lda qoldirib ketdilar. Qaytib ketayotib, Ibrohim alayhissalom o'zlarining mashhur duolarini qildilar…\r\n    Keyin nimalar bo'lganini Payg'ambarimiz alayhissalomning hadisi shariflari orqali o'rganamiz.\r\n    Ibn Abbos roziyallohu anhudan rivoyat qilinadi:\r\n    'Ayollardan birinchi bo'lib Ismoilning onasi mintaq* tutgan. U izini Soraga ko'rsatmaslik uchun mintaq tutgan edi. Keyin Ibrohim uni va uning farzandi Ismoilni olib kelib, Baytullohning yoniga, ulkan daraxt oldiga – masjidning tepa tomonidagi Zamzamning ustiga tushirdilar. Hojar uni emizar edi. U paytlar Makkada na odam, na suv bor edi. Ikkovlarini o'sha yerga tushirib, oldlariga bir xalta xurmo va bir suvdonda suv qo'ydilar. So'ng Ibrohim yo'lga tushmoqchi bo'lib, ortlariga otlangan edilar, Ismoilning onasi unga ergashib: 'Ey Ibrohim! Bizlarni na bir inson, na biror narsa bor bu vodiyga tashlab, qayerga ketyapsiz?' dedi. U buni unga bir necha marta aytdi. Ibrohim alayhissalom esa unga qaramay turib oldilar. Hojar unga: 'Buni sizga Alloh buyurdimi?' dedi. U kishi 'Ha', dedilar. Hojar 'Unday bo'lsa, U Zot bizni zoye qilmaydi' deb, so'ng ortiga qaytdi.\r\n    Ibrohim alayhissalom yo'lga tushdilar. Nihoyat ular ko'rmaydigan joyga – dovonga yetganlarida Bayt sari yuzlandilar. So'ng qo'llarini ko'targancha, ushbu so'zlarni aytib, duo qildilar: 'Robbimiz, haqiqatda men o'z zurriyotimni Baytul haroming yoniga, giyohsiz vodiyga joylashtirdim. Robbimiz, namozni to'kis ado etishlari uchun. O'zing odamlardan ba'zilarining qalblarini ularga talpinadigan qilgin va ularni mevalardan rizqlantirgin. Shoyad, shukr qilsalar'.\r\n    Hojar Ismoilni emizib, haligi suvdan icha boshladi. Nihoyat suvdondagi suv tugab, chanqay boshladi. O'g'li ham chanqadi. Hojar uning qiynalayotganini ko'rib, bunga qarab turishga chiday olmay, yura boshladi. Safoning o'sha yerda o'ziga eng yaqin tog' ekanini ko'rib, uning ustiga chiqib, turdi. So'ng biror kishini ko'rib qolarmikanman, degan ilinjda vodiyga qaradi. Biroq hech kimni ko'rmadi.\r\n    Safodan tushdi. Nihoyat vodiyga yetganida ko'ylagining etagini ko'tardi da, og'ir ahvolga tushgan insonning yugurishidek yugura ketdi. Shu tarzda vodiydan o'tib ham ketdi.\r\n    Keyin Marvaga kelib, uning ustiga chiqib turdi va biror kishini ko'rib qolarmikanman deb qaradi. Biroq hech kimni ko'rmadi. Yyetti marta shunday qildi (Nabiy sollallohu alayhi vasallam: 'Odamlarning shu ikkisi (Safo – Marva) orasida sa'y qilishlari shundan', deganlar). Marvaning ustiga chiqqanda bir ovoz eshitdi. O'ziga o'zi: 'Jim tur', dedi da, quloq tutdi, yana eshitdi. Hojar: 'Eshittirib bo'lding, agar senda biror yordam bo'lsa (ko'rsat)...' dedi. Qarasa, Zamzamning o'rnida bir farishta turibdi. U tovoni bilan (yoki qanoti bilan) kavladi, nihoyat suv chiqdi. Hojar uning atrofiga qo'li bilan tuproqni uyib, hovuz qila boshladi. So'ng suvdoniga suvdan hovuchlab quya ketdi. Har hovuchlab olganidan so'ng u otilib chiqar edi (Nabiy sollallohu alayhi vasallam: 'Alloh Ismoilning onasini rahmatiga olsin, Zamzamni qo'yib berganida edi (yoki suvdan hovuchlab olmaganida edi), Zamzam oqar buloq bo'lar edi', degan edilar). U undan ichib, bolasini emizdi. Farishta unga: 'Zoye bo'lishdan qo'rqmanglar, chunki mana shu yerda Allohning uyi bo'ladi, (uni) shu bola va uning otasi quradi. Alloh uning ahlini zoye qilmaydi', dedi.\r\n    Bayt yerdan ko'tarilgan, xuddi tepalikdek joy edi. Sellar kelib, uning o'ngidan va chapidan yuvib ketardi. Hojar ana shu ahvolda ekan, uning oldiga Jurhum** qabilasidan yo'lovchilar (yoki Jurhumdan bir oila) Kado*** yo'lidan yurib kelib qolishdi va Makkaning pastiga tushishdi. Ular osmonda doira chizib parvoz qilayotgan qushni ko'rib qolishdi. Shunda: 'Bu qush suvning ustida aylanyapti. Aniq bilamizki, bu vodiyda suv yo'q', deyishdi. Bir yo ikki chopar yuborishdi. Borib qarashsa, suv bor. Ortga qaytib, ularga suvning xabarini berishdi. Shunda barchalari suvga kelishdi. Ismoilning onasi suv oldida edi. Ular: 'Yoningizga tushishimizga izn berasizmi?' deyishdi. U: 'Ha, lekin suvda sizlarning haqqingiz yo'q', dedi. Ular 'Xo'p' deyishdi (Nabiy sollallohu alayhi vasallam: 'Ismoilning onasi uns-ulfat istab turganida uni uchratdi', deganlar). Ular o'sha joyga tushib, o'z ahllariga odam yuborishdi. Ular ham birgalikda kelib tushishdi. Natijada bu yerda ulardan ko'plab oilalar paydo bo'ldi.\r\n    Bola ulg'ayib, ularni o'ziga rom qildi. Voyaga yetgach, uni o'zlaridan bir ayolga uylantirib qo'yishdi. Keyinroq Ismoilning onasi vafot etdi.\r\n    Ismoil uylangach, Ibrohim alayhissalom o'zlari tashlab ketgan kishilarni ko'rgani kelib, Ismoilni topmadilar. Ayolidan uni so'radilar. U: 'Biz uchun rizq izlab chiqib ketganlar', dedi. Keyin undan tirikchiliklari va ahvollari haqida so'ragan edilar, 'Biz yomon ahvoldamiz. Tangchilik, qiyinchilikdamiz', deb shikoyat qildi. U kishi: 'Ering kelsa, unga salom ayt. Yana aytginki, eshigining ostonasini o'zgartirsin', dedilar. Ismoil kelgach, nimanidir sezgandek bo'ldi. 'Biror kishi keldimi?' dedi. U: 'Ha. Shunday shunday bir chol keldi. Bizdan siz haqingizda so'ragan edi, unga aytdim. Tirikchiligimiz qandayligi haqida so'ragan edi, mashaqqat va qiyinchilikda ekanimizni aytdim', dedi. 'Senga biror tavsiya aytdimi?' dedi. U: 'Ha. Sizga salom aytishimni buyurdi. Aytdiki, eshigingizning ostonasini o'zgartirar ekansiz', dedi.\r\n    'O'sha mening otam edi. Menga sendan ajralishimni buyuribdilar, ahlingga boraver', dedi da, uni taloq qilib, o'sha qavmdan yana boshqa ayolga uylandi.\r\n    Ibrohim alayhissalom ulardan uzoqda Alloh xohlagancha yurdilar. So'ng ularning oldiga keldilar. Biroq uni topmadilar. Ayoliga uchrab, o'g'li Ismoilni so'radilar. 'Biz uchun rizq izlab chiqib ketganlar', dedi u. 'O'zlaring qandaysizlar?' deb, undan tirikchiliklari va ahvollari haqida so'radilar. U: 'Yaxshilikda, kengchilikdamiz', dedi va Allohga hamdu sano aytdi. 'Yeguligingiz nima?' dedi. 'Go'sht', dedi. 'Ichimligingiz nima?' dedi. 'Suv', dedi.\r\n    'Allohim! Ular uchun go'shtga ham, suvga ham baraka ber', dedilar (Nabiy sollallohu alayhi vasallam: 'O'sha kunda ularda don yo'q edi. Agar bo'lganida, ular uchun unga ham duo qilgan bo'lar edi', deganlar. Shu bois Makkadan boshqa yerda biror kishi faqat shu ikkisini – go'sht va suvni yesa, bular unga (mizojiga) to'g'ri kelmaydi). 'Ering kelsa, unga salom ayt va tayinlaginki, eshigining ostonasini mahkam qilsin', dedilar.\r\n    Ismoil kelgach: 'Biror kishi keldimi?' dedi. Ayoli: 'Ha, bir xushsurat qariya keldi – ya'ni uni maqtadi, – mendan siz haqingizda so'ragan edi, unga aytdim. Mendan tirikchiligimiz qandayligi haqida so'ragan edi, unga yaxshilikda ekanimizni aytdim', dedi.\r\n    'Senga biror tavsiya aytdimi?' dedi. U: 'Ha, sizga salom aytdi, yana eshigingizning ostonasini mahkam qilishni buyurdi', dedi.\r\n    'O'sha mening otam. 'Ostona' sensan, menga seni mahkam tutishimni buyuribdilar', dedi u.\r\n    Ibrohim alayhissalom ulardan uzoqda Alloh xohlagancha yurib, shundan so'ng yana keldilar. Ismoil Zamzam yaqinidagi ulkan daraxt oldida o'qini uchlayotgan edi. Uning kelganini ko'rgach, o'rnidan turdi. Ikkovlari ota bolaga, bola otaga qiladigan muomalani qilishdi. So'ng: 'Ey Ismoil, Alloh menga bir ish buyurdi', dedilar. U: 'Robbingiz buyurganini qiling', dedi. 'Menga yordam berasanmi?' dedilar. 'Sizga yordam beraman', dedi. U zot bir baland qumtepaga, uning atrofiga ishora qilib: 'Alloh menga mana shu joyga bir uy qurishni buyurdi', dedilar.\r\n    Ular Baytning poydevorlarini ko'tarishdi. Ismoil tosh keltirar, Ibrohim alayhissalom binoni qurar edilar. Nihoyat bino ko'tarilgach, Ismoil mana bu toshni olib kelib, u zot uchun qo'yib berdi. Ibrohim alayhissalom o'shaning ustida turib, qurar edilar. Ismoil esa u kishiga toshni olib berib turar edi. Ikkovlari: 'Robbimiz, bizdan qabul et, albatta Sen eshituvchisan, biluvchisan', deyishar edi. Ular Baytni aylanasiga qura boshlashdi'.\r\n    Buxoriy 'Sahih'ida rivoyat qilgan.\r\n    Ismoil alayhissalom o'zlari yashab o'tgan joylardagi xalqlarga payg'ambarlik qildilar.\r\n    U kishi o'n ikki o'g'il va bir qiz farzand ko'rdilar. Muhammad sollallohu alayhi vasallamning nasablari ham Ismoil alayhissalom bilan tutashadi.\r\n    Ismoil alayhissalom yolg'iz qizlarini ukalarining o'g'li Iys ibn Is'hoqqa turmushga berganlar.\r\n    Ismoil alayhissalom, bir rivoyatga ko'ra, 137 yil umr ko'rganlar va vafotlaridan so'ng onalari Hojarning yonlariga, Ka'ba hijri, ya'ni oysimon poydevori ichiga dafn qilinganlar. U zotga Alloh taoloning salavotu salomlari bo'lsin.\r\n    \r\n    * Mintaq – tananing pastki qismiga o'raladigan izorga o'xshash kiyim. U avvalda xuddi xizmat vaqtida kiyiladigan peshband singari ayollar kiyimi bo'lgan. Hojar onamiz Sora onamizning rashkini pasaytirish maqsadida o'zini uning xizmatiga shay qilib ko'rsatish, o'zini uning oldida xizmatkordek tutish uchun ham mintaq tutgan.\r\n    ** Jurhum – qadimiy arab sulolalaridan biri. Ular asli yamanlik bo'lishgan.\r\n    *** Kado – Makkaning yuqori tomonidagi tog'. Ba'zan mazkur dovonning o'zi ham shu nom bilan atalgan."
        ]
    },
    {
        "word": "Ismoil al-Badixuniy",
        "type": [],
        "definition": [
            "Abu Ibrohim Ismoil ibn Ahmad al-Badixuniy - Buxorodagi Badixun qishlog'ining nisbati bilan mashhurlar. Bu kishi Qur'oni Karimni yoddan biluvchi hofiz edilar. Ismoil ibn Ahmad ibn Hojib al-Kushoniy va Abul Fazl Ahmad ibn Ali as-Sulaymoniy al-Paykandiyning shogirdlaridan. Buxoroda u kishidan Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz ta'lim olganlar. Men u zotdan va otalaridan ta'lim oldim"
        ]
    },
    {
        "word": "Ismoil al-Odiliy",
        "type": [],
        "definition": [
            "Abu Ibrohim Ismoil ibn Ahmad al-Odiliy Buxoro ahlidan bo'lib, bobolarining ismiga berilgan nisbatdir. Tog'alari Abu Muhammad Abdusamad ibn Muhammad al-Hofiz al-Buxoriydan, Abu Muhammad Ahmad ibn Abdulloh al-Muzaniydan va Hirotda Abu Mansur Abbos ibn Fazl al-Hiraviydan hadis yozib olganlar. O'zlaridan esa Abu Turob Ismoil ibn Tohir an-Nasafiy al-Hofiz hadis rivoyat qilganlar. U kishi Sag'oniyonga (Chag'oniyonga) ketayotganda yo'lda kasal bo'lib, hijriy 409 (milodiy 1019) yili Keshda vafot etganlar"
        ]
    },
    {
        "word": "Ismoil as-Saffor",
        "type": [],
        "definition": [
            "Abu Ibrohim Ismoil ibn Abu Nasr as-Saffor fozil imom, haqgo'y bo'lganlar. Haq gapni aytishdan qo'rqmaganlar. 'Shams ul-malik' ('Podshohlar quyoshi') laqabi bilan tanilgan Buxoro xoqoni Nasr ibn Ibrohimni yaxshilikka da'vat etib, yomonlikdan qaytarganlari uchun hijriy 461 (milodiy 1070) yili Buxoroda qatl qilinganlar"
        ]
    },
    {
        "word": "Ismoil as-Somoniy",
        "type": [],
        "definition": [
            "Abu Ibrohim Ismoil ibn Ahmad ibn Asad ibn Somon as-Somoniy adolatli amir, xalqparvar va nasihatgo'y olim edilar. Bu kishining farzandlari, qarindosh-urug'lari, yaqin¬lariga 'as-Somoniya' deb nisbat berilgan. Hadislar yozib olganlar. Ilm ahlini nihoyatda yaxshi ko'rar edilar. Ismoil Somoniy mashhur amir edilar. Hijriy 234 (milodiy 849) yilning shavvol oyida Farg'onada tug'ilib, hijriy 295 (milodiy 909) yilning safar oyida Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Ismoil ibn Abdulloh ibn Ahmad ibn Sahl",
        "type": [],
        "definition": [
            "Abu Ibrohim Ismoil ibn Muhammad ibn Abdulloh ibn Ahmad ibn Sahl ibn Suhayl ibn Arzah al-Omuliy al - Mustamliy al-Muzakkir al-Mufassir Buxoro ahlidan bo'lib, mufassir edilar. Abul Abbos Ja'far ibn Muhammad an-Naqbuniy, Qozi Abu Sa'id Xalil ibn Ahmad as-Sijziydan ta'lim olgan. Buxoroda ko'p o'qilgan 'Musnad us-siroj al-qadar' asarini Abu Homid Muhammad ibn Muhammad ibn Abdulloh as-Soig'dan ta'lim olgan. Bu kishidan Abdulaziz ibn Muhammad an-Naxshabiy va Abu Bakr Muhammad ibn Ali al-Ja'fariy hadis rivoyat qilganlar. Ismoil al-Mustamliy haqida Abdulaziz an-Naxshabiy 'Mu'jam ush-shuyux' ('Shayxlar qomusi') kitoblarida zikr qilganlar. Bu kishi Abu Bakr ibn Abu Is'hoqning 'Kitob at-ta'arruf li mazhab at-tasavvuf' ('Tasavvuf yo'lini bilish haqida kitob') nomli asarini tafsir qilganlar. Yetmish yoshlaridan keyin Omul shayxlaridan ham ta'lim olganlar. Hijriy 434 (milodiy 1043) yil zulqa'da oyining o'n oltinchisida, dushanba kuni peshindan keyin vafot etganlar"
        ]
    },
    {
        "word": "Isnod",
        "type": [],
        "definition": [
            "suyanish; tirgak, dalil, asos; hadisning tarkibiy qismi; hadislarni roviylari bilan keltirish, roviylar silsilasi; hadislarni rivoyat qilgan roviylarning ketma-ket zanjiri"
        ]
    },
    {
        "word": "Iso al-Gʻunjor",
        "type": [],
        "definition": [
            "Abu Muhammad Iso ibn Muso al-G'unjor Buxoro ahlidan bo'lib, fozil, olim, sodiq va obid edilar. Ilm talabida Iroq, Hijoz va Misrda bo'lib, o'sha yerdagi ulamolardan, jumladan, Molik ibn Anas, Sufyon as-Savriy, Sufyon ibn Uyayna, Lays ibn Sa'd va Abdulloh ibn Luhay'adan ta'lim olganlar. O'zlaridan esa Muhammad ibn Salom al-Paykandiy, Abdulloh ibn Muborak, Ya'qub ibn Is'hoq al-Hizramiy, Odam ibn Abu Ilyos as-Asqaloniy va Ismoil ibn Sa'id ash-Sholanjiy hadis rivoyat qilganlar. Abdulloh ibn Vosil aytadilar: 'Iso ibn Muso al-G'unjor hijriy 185 (milodiy 802) yili Saraxsda vafot etganlar. Iso ibn Muso G'unjorning qabrlarini Saraxsda ko'rdim. Yuzlaridagi ikki yonoqlari qip-qizil bo'lganligi uchun 'al-G'unjor' deb nomlanganlar'"
        ]
    },
    {
        "word": "Isro surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 111 oyatdan iborat.\r\n     Surai karimaning 'Isro' degan nomi uning birichi oyatidagi 'Asro' ('kechasi yurgizdi') so'zidan olingan. Arab tilida 'isro' so'zi – 'kechasi yurgizish' degan ma'noni anglatadi. Bu surai karimada Alloh taolo Payg'ambarimiz Muhammad sollallohu alayhi vasallamni Makkai Mukarramadan Quddusi Sharifga kechaning bir qismida yurgizib olib borgani haqida so'z yuritilgan.\r\n    Surai karimaning ikkinchi nomi 'Banu Isroil'dir. Surai karimada Banu Isroil qavmi haqida so'z ketgani bois, u ushbu nom bilan ham nomlanib qolgan.\r\n    Isro surasi Islom da'vati tarixidagi eng mashaqqatli va og'ir damlarda nozil bo'ldi. Bu davrga kelib, Muhammad sollallohu alayhi vasallam boshchiliklaridagi oz sonli musulmonlarga nisbatan mushriklarning ozorlari, qiynoqlari kuchaygan, ularni Allohning dinidan qaytarish yo'lidagi chiranishlari haddidan oshgan edi. Musulmonlar uchun g'oyatda qiyin bir holat paydo bo'ldi. Payg'ambarimiz sollallohu alayhi vasallamni mushriklarning hujumlaridan himoya qiladigan shaxslar – amakilari Abu Tolib va Hadija onamiz ham vafot etganlar. Ana shunday mudhish bir paytda Isro va Me'roj hodisasi bo'lib o'tdi. Alloh taolo Payg'ambari Muhammad sollallohu alayhi vasallamni Makkai Mukarramadan kechasi bir zumda Baytul Maqdisga olib bordi va u yerdan me'rojga olib chiqdi. Bu esa ana shunday og'ir bir paytda u zot sollallohu alayhi vasallam va musulmonlar uchun katta tasalli edi. Noumidlik kayfiyatini so'ndirib, umid uchqunlarini alanga oldirish edi. Surai karimaning asosiy oqimi ana shu uslubda davom etadi.\r\n    Ayni chog'da, Isro voqeasi kishilar iymonini sinashning omili ham edi. Har bir narsaga moddiy mo''jiza talab qilib turgan mushriklarga bu voqea ortiqcha gap-so'zlar uchun yana bir qulay fursat bo'lsa, mo'min-musulmonman, deb yurganlarning esa iymonlari qanchalik mustahkam ekanini sinash uchun bu surai karima zo'r omil bo'ldi.\r\n    Shuningdek, Isro surasi Makkada nozil bo'lgan boshqa makkiy suralar kabi, aqiyda masalasiga, Islom dinining asllariga – vahdoniyat, payg'ambarlik va o'lgandan keyin qayta tirilish aqiydasi kabi narsalarga alohida e'tibor beradi. Bu masalalarni muolaja qilishda Isro surasining boshqa suralardan farqi shuki, bu yerda hazrati Muhammad sollallohu alayhi vasallamning shaxslari alohida ahamiyat bilan ko'rsatiladi hamda u zot sollallohu alayhi vasallamga Alloh tomonidan berilgan mo''jizalar, hujjat-dalillar zohir qilinadi.\r\n    Surai karima isro mo''jizasini bayon qilish bilan boshlanadi. Bu hodisa Muhammad sollallohu alayhi vasallam uchun ilohiy hurmat, ulug' martaba ekani aytiladi, Alloh taoloning qudratiga dalil ekani tushuntiriladi.\r\n    So'ngra Muso alayhissalom va u kishining qavmlari – Banu Isroil haqida so'z ketadi. Quraysh mushriklari Muhammad sollallohu alayhi vasallamdan turli moddiy mo''jizalar keltirishni talab qilganlaridek, bir vaqtlar Banu Isroil qavmi ham Muso alayhissalomdan turli moddiy mo''jizalar keltirishni talab qilishgan edi. Bu ikki qavm o'rtasida ana shunday o'xshashlik bor. Shuning uchun ham surada oldingi o'tganlar Quraysh mushriklariga o'rnak, ibrat bo'lsin deb, Banu Isroilning qissasi keltiriladi. Ularning Allohga isyon etgani, yer yuzidagi fasod ishlari va uning fojiaviy, ayanchli oqibati bayon qilinadi.\r\n    Keyin esa borliqdagi mavjud oyat-mo''jizalar haqida so'z ketadi. Kecha va kunduz mo''jizalari misol qilib keltiriladi. Ularning daqiq nizom asosida harakatda bo'lishi ham Allohning yagona va qudratli Zot ekaniga dalil sifatida ko'rsatiladi. Bu narsalar Alloh taolo tomonidan biz bandalarga berilgan ulkan ne'mat ekani, unga shukr qilishimiz lozimligiga ishora etiladi.\r\n    Shuningdek, Isro surasida fozil jamiyatning asosiy unsurlari haqida ham so'z boradi. Ijtimoiy odoblar, go'zal axloqlarga da'vat etiladi. Ayni chog'da, ba'zi nobor ijtimoiy kasalliklardan saqlanishga chaqiriladi.\r\n    Keyingi oyatlarda mushriklarning adashuvlari, ularning Allohning sherigi bor, xotini, o'g'li yoki qizi bor, deyishlarining inkori keladi. O'lgandan keyin qayta tirilishga mushriklarning shubha bilan qarashlari hikoya qilinib, bunga ham raddiya beriladi.\r\n    Qur'oni Karimdagi la'natlangan daraxt haqidagi oyat ham ushbu suradadir.\r\n    So'ngra esa Odam Ato va iblis la'inning qissasidan sura siyoqiga xos parcha keltiriladi.\r\n    Alloh taolo Banu Odamni mukarram qilib qo'yganligi bayon qilinadi.\r\n    Shuningdek, bu surada Muhammad sollallohu alayhi vasallamning abadiy mo''jizalari bo'lmish Qur'oni Karim vasf qilinadi. Ruh to'g'risida bahs yuritiladi. Mushriklarning sarkashlik qilib, turli mo''jizalarni so'rashlari, jumladan, anhorlarni otiltirib chiqarish, Makkada bog'u bo'stonlar paydo qilish kabi noo'rin talablari haqida ham so'z ketadi.\r\n    Muso alayhissalomga berilgan to'qqiz mo''jiza ham ibrat uchun eslatib o'tiladi.\r\n    Nihoyat, Qur'oni Karim sha'nini yana bir bor ulug'lash va Alloh taoloni nuqson sifatlardan yana bir bor poklash bilan surai karima oxiriga yetadi."
        ]
    },
    {
        "word": "Isrofil",
        "type": [],
        "definition": [
            "sur chalishga vakil qilingan farishtaning nomi"
        ]
    },
    {
        "word": "Istabraq",
        "type": [],
        "definition": [
            "Istabraq – qalin ipak mato"
        ]
    },
    {
        "word": "Istabroq",
        "type": [],
        "definition": [
            "qalin ipak mato"
        ]
    },
    {
        "word": "Istehoza",
        "type": [],
        "definition": [
            "Fiqhiy ta'rif bo'yicha 'Istehoza' ayol kishining rahmidan odat(hayz va nifos)dan tashqari qon oqishidir"
        ]
    },
    {
        "word": "Istivo masalasi ",
        "type": [],
        "definition": [
            "aqidaviy masala; egalik qilish, oliy bo'lish"
        ]
    },
    {
        "word": "Istigʻfor",
        "type": [],
        "definition": [
            "Allohdan gunohni kechirishni, afv etishni so'rash"
        ]
    },
    {
        "word": "Istijmor",
        "type": [],
        "definition": [
            "Istijmor – hojatda tosh bilan tozalanish"
        ]
    },
    {
        "word": "Istilom",
        "type": [],
        "definition": [
            "Istilom – Ka'baning ruknini o'pish yoki qo'l bilan silash. Buning imkoni bo'lmasa, istilom uzoqdan turib, imo-ishora bilan yoki hassa kabi narsalar bilan qilinishi mumkin"
        ]
    },
    {
        "word": "Istinjo",
        "type": [],
        "definition": [
            "'Istinjo' lug'atda 'axlat ketkazish'dir. Fuqaholar istilohida esa, najosatni suv va unga o'xshash narsa ila ketkazish yoki toshga o'xshash narsa ila artishga 'istinjo' deyiladi"
        ]
    },
    {
        "word": "Istirjoʻ",
        "type": [],
        "definition": [
            "Istirjo' – 'Inna lillahi va inna ilayhi roji'un' ('Albatta, biz Allohnikimiz va albatta, Unga qaytuvchimiz') deyish (Baqara surasining 156-oyatidan). Uni kattayu kichik musibat yetgan chog'da aytish tavsiya etilgan. Ba'zan kutilmagan holatga duch kelganda istirjo' aytish odati ham bo'lgan."
        ]
    },
    {
        "word": "Istisqo ",
        "type": [],
        "definition": [
            "'Istisqo' arabcha so'z bo'lib, 'serobchilik', 'sug'orish talab qilish' ma'nolarini anglatadi. Odatda, kutib turilgan suvning kelishi kechiksa, uni talab qilishga aytiladi."
        ]
    },
    {
        "word": "Istisno",
        "type": [],
        "definition": [
            "'Istisno' degani, bir narsani aytib orqasidan 'insho¬alloh'ni aytishdir. Misol uchun, birov ovozini chiqarib taloq qo'ysa-yu, ortidan ichida inshoalloh desa, ammo uning harflarini ichida aytib, birovga eshittirmasa, talog'i tushadi. Chunki, oshkora bo'lmagan gap hisobga olinmaydi."
        ]
    },
    {
        "word": "Istixora",
        "type": [],
        "definition": [
            "'Istixora' so'zi lug'atda 'xayrni talab qilish' degan ma'noni anglatadi. Musulmon kishi ikki ishdan qaysi birini qilishini bilmay qolganda, xayrlisini tanlash uchun Istixora namozi o'qiydi. Bu namozni har bir muboh ishdan oldin o'qish mustahabdir."
        ]
    },
    {
        "word": "Istihoza ",
        "type": [],
        "definition": [
            "Istihoza – ayol kishining rahmidan odatiy hayz va nifosdan tashqari keladigan qondir"
        ]
    },
    {
        "word": "Isʼhoq alayhissalom",
        "type": [],
        "definition": [
            "Is'hoq alayhissalom Ibrohim alayhissalomning Sora onamizdan tug'ilgan o'g'illaridir. Ibrohim alayhissalom 99 yoshga, juftlari Sora ham katta yoshga yetib qolganida Alloh taoloning inoyati ila Is'hoq alayhissalom dunyoga kelganlar. U zotning bashoratlari va sifatlari haqida Soffot surasida quyidagilar aytilgan:\r\n    'Yana unga solihlardan bir nabiyning – Is'hoqning xushxabarini berdik' (112-oyat).\r\n    Ibrohim alayhissalom o'g'illari Is'hoq alayhissalomga ota tomon qarindoshlarning qizlaridan uylanishni tayinlagan ekanlar. Shuning uchun Is'hoq alayhissalom amakivachchalarining qiziga uylandilar. Ular ikki egizak o'g'il farzand ko'rishdi: biri – Iys, ikkinchisi – Ya'qub. Isroil laqabini olgan Ya'qub alayhissalomdan Banu Isroil tarqaldi va u zotning sulolalaridan bir necha payg'ambarlar chiqdi.\r\n    U zot o'zlari yashab o'tgan Falastin va Shom yerlaridagi kan'oniylarga payg'ambar bo'lganlar.\r\n    Is'hoq alayhissalom 180 yoshga kirib bu dunyoni tark etganlar. U zot otalari Ibrohim alayhissalom dafn qilingan Xalil shahri yaqinidagi g'orga dafn etilganlar."
        ]
    },
    {
        "word": "Isʼhoq al-Bobikisiy as-Samarqandiy",
        "type": [],
        "definition": [
            "Abu Ibrohim Is'hoq ibn Ismoil al-Bobikisiy as-Samarqandiy Samarqandda to'rtta rabot bino qilganlar. Ma'ruf ibn Hison, Mas'ud ibn Buhayra, Ahmad ibn Muoviyadan hadis rivoyat qilganlar. Hijriy 259 (milodiy 874) yil ramazon oyining o'n birinchisida, juma kuni asr namozidan keyin vafot etganlar. Ertasi kuni dafn qilinganlar. Janozalarini Buxoro amiri Ismoil ibn Ahmad as-Somoniy o'qiganlar."
        ]
    },
    {
        "word": "Isʼhoq al-Jubuniy",
        "type": [],
        "definition": [
            "Abu Ibrohim Is'hoq ibn Muhammad al-Jubuniy Buxoroning mashhur olimlaridan bo'lib, Buxorodagi Masjidi Kalon jome' masjidida imom-xatib edilar. Pishloq tayyorlab sotganlari uchun 'Jubuniy' (Pishloqchi) taxallusini olganlar. 'Ustoz' nomi bilan tanilgan Abdulloh ibn Muhammad as-Sibadmuniydan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari Abu Nasr ibn al-Jubuniy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Isʼhoq al-Qallos",
        "type": [],
        "definition": [
            "Abu Ibrohim Is'hoq ibn Abdulloh al-Qallos Buxoro ahlidan bo'lib, Muhammad ibn Umayya as-Soviy, Ka'b ibn Sa'id va Muhammad ibn Salom al-Paykandiydan hadis ilmidan ta'lim olganlar. O'zlaridan esa Imron ibn Muso, Muso ibn Iso va Sahl ibn Bishr al-Buxoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Isʼhoq al-Xatib",
        "type": [],
        "definition": [
            "Abu Ibrohim Is'hoq ibn Muhammad al-Xatib ham Buxoro ahlidan bo'lib, 'Al-Jubuniy' nomi bilan tanilgan edilar. Buxorodagi Masjidi Kalon jome' masjidida imom-xatib va hanafiy mazhabi faqihlaridan edilar. Haj qilgandan so'ng Bag'dodga kelib, Muhammad ibn Hamdavayh al-Marvaziy, Abdulloh ibn Muhammad as-Sibadmuniy al-Ustoz, Muhammad ibn Sobir al-Buxoriy va Homid ibn Biloldan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abul Qosim al-Azhariy va Husayn ibn Muhammad hadis rivoyat qilganlar. Hijriy 395 (milodiy 1006) yil zulqa'da oyining birinchisida, juma kuni vafot etganlar"
        ]
    },
    {
        "word": "Isʼhoq al-Hamidiy",
        "type": [],
        "definition": [
            "Is'hoq ibn Takinak al-Hamidiy amir Ismoil Somoniy ozod qilgan qullardan. Abu Is'hoq Ibrohim ibn Muhammad ash-Shikoniy al-Buxoriy va Abu Nasr ibn Ahmad Murojiliy al-Buxoriydan hadis ilmidan ta'lim olganlar. Bu kishi haqlarida Abu Komil al-Basiriy 'al-Muzohot' kitoblarida qayd qilganlar"
        ]
    },
    {
        "word": "Isʼhoq as-Somoniy",
        "type": [],
        "definition": [
            "Abu Ya'qub Is'hoq ibn Ahmad as-Somoniy Buxoro amiri edilar. Otalari Ismoil ibn Ahmad as-Somoniy va Abdulloh ibn Abdurahmondan hadis ilmidan ta'lim olganlar. O'zlaridan esa Solih ibn Abu Rumayh va Abdulloh ibn Yahyo al-Qozi hadis rivoyat qilganlar. Hijriy 301 (milodiy 914) yil safar oyiga 9 kun qolganda, Buxoro quhanduzida* mahbuslikda vafot etganlar.\r\n\r\n\r\n* Quhanduz – hukmdor saroyi atrofidagi mavze, ichki shahriston, ark."
        ]
    },
    {
        "word": "Isʼhoq as-Surmoriy as-Sulamiy",
        "type": [],
        "definition": [
            "Abu Safvon Is'hoq ibn Ahmad as-Surmoriy as-Sulamiy - Abu Is'hoq Ahmad ibn Is'hoq as-Surmoriy az-Zohidning o'g'li. Hadis ilmida kuchli edilar. Otalari bu kishini yoshlik chog'larida Iroqqa olib borganlar va u yerda Abu Osim Zahhok ibn Muxlid, Amr ibn Osim, Makkiy ibn Ibrohim, Sa'id ibn Omir va boshqa olimlardan ta'lim olganlar. Abu Ali Solih ibn Muhammad al-Hofiz va Umar ibn Muhammad ibn Bujayr al-Hofiz 'al-Jomi' as-sahih' ('Ishonchli to'plam') kitoblarida u kishidan hadis rivoyat qilganlar. Abu Safvon aytadilar: 'Jabalda bir shayx hadis rivoyat qilar edilar. Bir kishi: 'Buxorodan Ahmad ibn Hafs degan bir olim chiqibdi', – dedi. Men u kishining shogirdi ekanimni aytgan edim, men bilan tortishdi. Munozarada men u kishidan g'olib chiqdim'. Abu Safvon Is'hoq as-Surmoriy hijriy 276 (milodiy 890) yilning ramazon oyida vafot etganlar"
        ]
    },
    {
        "word": "Isʼhoq roziyallohu anhu",
        "type": [],
        "definition": [
            "Is'hoq roziyallohu anhu Rasululloh sollallohu alayhi vasallamning sahobalaridan bo'lganlar. Abdon ismli kishi Xolid ibn Abdurrahmon orqali Is'hoq rivoyat qilgan hadislarni jamladilar"
        ]
    },
    {
        "word": "Itbon ibn Molik",
        "type": [],
        "definition": [
            "Itbon ibn Molik ibn Amr al-Ansoriy Badr g'azotida Rasululloh sollallohu alayhi vasallam bilan ishtirok etdilar. Shuningdek, Rasulullohdan bir necha hadislar rivoyat qildilar.\r\n    Bu zotdan Anas ibn Molik, Mahmud ibn Robe', Husayn ibn Muhammad va boshqalar rivoyat qilganlar.\r\n    Itbon ibn Molik Rasululloh sollallohu alayhi vasallam vositalarida muhojir Umar ibn Xattob bilan Islomiy birodar bo'lgan edilar.\r\n    Bu zot Muoviya hukmdor bo'lgan davrda vafot etdilar."
        ]
    },
    {
        "word": "Ithaful maharoh fiy tatmimatil-ʼasharoh",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Ifk",
        "type": [],
        "definition": [
            "Ifk – uydirma, tuhmat. Bu so'z diniy manbalarda ko'pincha Oisha roziyallohu anhoga nisbatan qilingan tuhmat ma'nosida ishlatiladi."
        ]
    },
    {
        "word": "Iftor",
        "type": [],
        "definition": [
            "og'iz ochish, ro'zani ochish, ro'zador kishining kun botganda biror narsa yeb og'zini ochishi"
        ]
    },
    {
        "word": "Ixlos ",
        "type": [],
        "definition": [
            "'Ixlos' so'zi lug'atda 'tozalash', 'xolis qilish' ma'nolarini anglatadi. Ixlosning shar'iy istilohi – Allohga ibodatni xuddi U zotni ko'rib turgandek qilishdir"
        ]
    },
    {
        "word": "Ixlos surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 4 oyatdan iborat.\r\n    Mushriklar Payg'ambar sollallohu alayhi vasallamning huzurlariga kelib, 'Bizga Robbingni sifatlab ber, nasabini bayon qilib ber', deganlarida, Alloh taoloning O'zi Ixlos surasini nozil qilib, javob bergan.\r\n    Bu suraning 'Ixlos' deb nomlanganining sababi shuki, unda Alloh taolo bandalarini faqat O'zigagina ibodat qilishga, O'zigagina yuzlanishga, ixlos qilishga undagandir.\r\n    Payg'ambarimiz Muhammad sollallohu alayhi vasallam o'z hadislaridan birida: Ixlos surasi Qur'onning uchdan biriga to'g'ri keladi', – deganlar.\r\n    Chunki Qur'oni Karimning asosiy maqsadi uchga bo'linadi:\r\n    a) Allohning tavhidi, yagonaligi isboti va aqiydani tuzatish.\r\n    b) Ibrat, isloh va o'rnak olish uchun keltirilgan qissalar.\r\n    v) Shariat hukmlari.\r\n    Ixlos surasi ushbu narsalarning birinchi qismini o'z ichiga olgan."
        ]
    },
    {
        "word": "Ixtilof",
        "type": [],
        "definition": [
            "har xillik, tafovut; qarama qarshilik, kelishmovchilik, qarama-qarshi holat, ziddiyat, nizo, bir-biriga zid fikrlar."
        ]
    },
    {
        "word": "Ixtilofi Ibn Abu Laylo",
        "type": [],
        "definition": [
            "Bu kitobda Abu Hanifa rahmatullohi alayhi bilan Qozi Ibn Abu Laylo orasidagi xilofli masalalar jamlangan. Muallif Abu Hanifa rahmatullohi alayhining yonlarini olgan. Bu kitobni Abu Yusuf rahmatullohi alayhidan u kishining sheriklari Muhammad ibn Hasan Shayboniy rivoyat qilganlar."
        ]
    },
    {
        "word": "Ixtiloflar, sabablar, yechimlar",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining 'Ixtiloflar, sabablar, yechimlar' nomli kitobi.\r\n    Diyorimiz musulmonlari qariyb yetmish yil mustabid tuzumning diynga qarshi siyosati ostida yashadilar. O'zbekiston mustaqillikka erishgach, hayotning barcha jabhalariga erkinlik ne'mati ato qilindi. Xalqimiz o'zlikni anglash, asl qadriyatlarni tiklash yo'liga qadam bosdi. Biroq, muqaddas diynimizni o'rganish va uning ta'limotlariga amal qilish oson ko'chmadi. Ilmsizlik, dinsizlikning asoratlari yuzaga chiqib, musulmonlar o'rtasida turli ixtiloflar vujudga kela boshladi. Bir yurtda yashab, bir mazhabga amal qilib kelgan musulmonlar orasida turli nizolar chiqa boshlagach, bu ixtiloflarning sabablari va ularning yechimlarini topishga kuchli ehtiyoj sezildi. Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining 2003 yilda chop etilgan 'Ixtiloflar haqida' kitobi ana shu dolzarb muammoga bag'ishlangan asar bo'ldi.\r\n    O'tgan davr mazkur kitobning nechog'li dolzarb va muhim ekanligini amalda ko'rsatdi. Biroq, nizo, tortishuv va ixtiloflarga hanuz uzil-kesil barham berilgani yo'q. Shu munosabat bilan mazkur kitob yangi ma'lumotlar bilan boyitildi, so'nggi yillarda paydo bo'lgan yangi ixtiloflarga oid g'oyatda muhim tahlillar, hujjat-dalillar bilan to'ldirildi.\r\n    Muallif: Shayx Muhammad Sodiq Muhammad Yusuf\r\n    Nomi: Ixtiloflar, sabablar, yechimlar\r\n    Nashriyot: 'Sharq' NMAK\r\n    Sana: 2011 yil\r\n    Hajmi: 320 bet\r\n    O'lchami: 84×108\/32\r\n    O'zbekiston Respublikasi Vazirlar Mahkamasi huzuridagi Din ishlari bo'yicha qo'mitaning tavsiyasi ila chop etilgan"
        ]
    },
    {
        "word": "Ishaʼyo alayhissalom",
        "type": [],
        "definition": [
            "Isha'yo* alayhissalom miloddan avvalgi VII asrda yashab o'tgan nabiylardan biridirlar.\r\n    Kaldoniylar Baytul maqdisga o'zlarining podshohlari Sanhorib boshchiligida kirmoqchi bo'lishdi. Alloh taolo ularni mazkur Isha'yo alayhissalomning duolari sababli halokatga uchratdi. Shundan so'ng Banu Isroilning yomonliklari va fasodlari yana ham ortdi, ular o'z nabiylari va xaloskorlari bo'lmish Isha'yo alayhissalomni qatl qilishdi. Alloh taolo u kishidan keyin Armiyo** alayhissalom va boshqa nabiylarni yubordi. Banu Isroil esa o'z nabiylarini yolg'onchiga chiqarish va jonlariga qasd qilishda davom etishdi.\r\n    * 'Isha'yo' ismi arab tilida yana 'Ash'iyo, Sha'yo, Sha'iyo, Shi'yo, Shu'yo, Shu'ayo' tarzida ham talaffuz qilinadi, ruschada esa 'Isaiya' deb o'qiladi.\r\n    ** Ruschada 'Iyeremiya' (mil. avv. VII–VI asrlar) shaklida uchraydi."
        ]
    },
    {
        "word": "Ishqor",
        "type": [],
        "definition": [
            "o'simlik turi"
        ]
    },
    {
        "word": "Ishorai sabboba",
        "type": [],
        "definition": [
            "Ibn Umar roziyallohu anhumodan rivoyat qilinadi:\r\n    'Nabiy sollallohu alayhi vasallam namozda o'tirsalar, o'ng kaftlarini o'ng sonlariga qo'yar, barmoqlarini tugib, bosh barmoq yonidagi barmoqlari bilan ishora qilar edilar. CHar kaftlarini cHar sonlariga qo'yar edilar'.\r\n    Beshovlaridan faqat Buxoriy rivoyat qilmagan.\r\n    Ushbu hadisi sharifda barmoqlarni tugib, ko'rsatkich barmoq bilan ishora qilinishi haqida so'z bormoqda.\r\n    Bu barmoq arab tilida 'sabboba' deyiladi. Shuning uchun tashahhudda qilinadigan ishorani ham 'ishorai sabboba' deyiladi.\r\n    'Ishorai sabboba' tashahhudda 'Ashhadu allaa ilaaha' deganda 'laa'ni aytayotganda ko'rsatkich barmoqni yuqoriga ko'tarish bilan bo'ladi. O'sha barmoqni ko'tarishda boshqa barmoqlar yig'ib olinadi.\r\n    Ba'zilar ushbu rivoyatdagi 'barmoqlarini tugib' degan jumlani 'tashahhudga o'tirishda tugib o'tiradi' deb tushunganlar. Shuning uchun avvaldan qo'llarini mushtga o'xshatib o'tirishadi va 'laa'ga kelganda ko'rsatkich barmoqlarini yuqoriga ko'tarishadi. Albatta, bu noto'g'ridir.\r\n    'Sabboba' 'so'kish' degani bo'lib, 'ishorai sabboba' – 'so'kish ishorasi' demakdir.\r\n    Tashahhudda 'Ashhadu allaa ilaaha illallohu'ning 'laa'sida ko'rsatkich barmoqni ko'tarish shaytonni so'kish bo'ladi. Ishorani qilgandan so'ng, namoz tamom bo'lguncha o'sha barmoqqa qarab turiladi.\r\n    Ba'zi ulamolarimiz bu ishorani qilmaslikni aytganlar. Ammo Ibn Humom va Ali Qoriy kabi ulamolarimiz: 'Buni qilmaslik rivoyat va diroyatga xilof bo'ladi', deganlar.\r\n     Biz ixtilofdan chetlanish maqsadida ulamolar majlisida: 'Ustozi o'rgatganlar qilsin, o'rgatmaganlar qilmasin. Ammo ixtilof bo'lmasin', deb aytganmiz."
        ]
    },
    {
        "word": "Iʼanatul maharoh fiz-ziyadati ʼalal ʼasharoh",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    }
]