[
    {
        "word": "Jabriyalar",
        "type": [],
        "definition": [
            "'Inson hamma ishlarini majbur holda qiladi, uning ixtiyori yo'q', deganlar"
        ]
    },
    {
        "word": "Jabroil",
        "type": [],
        "definition": [
            "payg'ambarlarga vahiy keltiradigan farishtaning nomi"
        ]
    },
    {
        "word": "Javo",
        "type": [],
        "definition": [
            "Javo – ob havo yoqmasligi oqibatida paydo bo'ladigan, qorin shishish kasalligi."
        ]
    },
    {
        "word": "Javohirul Kalom",
        "type": [],
        "definition": [
            "Shayx Azududdin Iyjiy rahmatullohi alayhining kitobi. Muallif kalom ilmiga oid bu kitobini Isfahonda ta'lif qilgan."
        ]
    },
    {
        "word": "Javrob",
        "type": [],
        "definition": [
            "'Javrob' so'zi asli 'kavrob' bo'lib, arab tiliga boshqa tildan kirib qolgan ekan.\r\n    'Qomusul Muhiyt' va 'Lisonul Arab' nomli eng mo''tamad lug'at kitoblarda aytilishicha, 'javrob' kishining oyoqlariga o'raladigan narsa ekan. Buni mashhur ulamolardan Tiybiy va Shavkoniylar ham tasdiqlaganlar.\r\n    Shavkoniy: 'Mahsi yumshoq oshlangan teridan qilinadi, choriq uning ustidan kiyiladi, 'javrob' esa choriqdan ham katta bo'ladi', deganlar.\r\n    Ibn Arabiy, Ayniy va boshqa ulamolar: 'Javrob jundan to'qilgan bo'lib, o'ta sovuq o'lka odamlari kiyadi', deganlar.\r\n    U ruslardagi 'piyma' nomli oyoq kiyimiga o'xshash narsadir.\r\n    'Javrob' haqida ulamolarning gaplari turlichaligi ushbu oyoq kiyimining har yurtda har xil bo'lishidandir. Bunga 'do'ppi' deb atalgan bosh kiyimi turli yurtlarda turlicha ekanligi misol bo'la oladi."
        ]
    },
    {
        "word": "Javrob",
        "type": [],
        "definition": [
            "'Javrob' so'zi asli 'kavrob' bo'lib, arab tiliga boshqa tildan kirib qolgan ekan. 'Qomusul Muhiyt' va 'Lisonul Arab' nomli eng mo''-tamad lug'at kitoblarda aytilishicha, 'javrob' kishining oyoqlariga o'raladigan narsa ekan. Buni mashhur ulamolardan Tiybiy va Shavkoniy ham tasdiqlashgan."
        ]
    },
    {
        "word": "Jadid ",
        "type": [],
        "definition": [
            "arabcha so'z bo'lib, yangi degan ma'noni anglatadi"
        ]
    },
    {
        "word": "Jazava",
        "type": [],
        "definition": [
            "kuchli asab qo'zg'alishi, o'z xatti-harakatlarini nazorat qilolmay qolish, xayolot va voqelik o'rtasidagi muvozanatning yo'qolishi natijasida yuzaga keladigan holat"
        ]
    },
    {
        "word": "Jazaʼa",
        "type": [],
        "definition": [
            "Jaza'a – Abu Hanifa rahmatullohi alayhining aytishlaricha, olti oylik qo'y-echki. Bu voqeada jaza'a deganda bir yoshlik uloq nazarda tutilgan"
        ]
    },
    {
        "word": "Jazua",
        "type": [],
        "definition": [
            "besh yoshli urg'ochi tuya"
        ]
    },
    {
        "word": "Jazʼ",
        "type": [],
        "definition": [
            "Jaz' – olarang qimmatbaho gavhartosh, oniks"
        ]
    },
    {
        "word": "Jazʼi zafor",
        "type": [],
        "definition": [
            "Zaforiy munchoqli marjon (Jaz'i Zafor): Zafor – Yaman qishloqlaridan biri, ba'zi rivoyatlarda Azfor deb ham kelgan. Jaz' – olarang qimmatbaho gavhartosh, oniks. Jaz'i Zafor deganda o'sha qishloqdan keladigan gavhartosh nazarda tutilgan. Hozirda ko'proq 'Yaman jaz'i' deb yuritiladi."
        ]
    },
    {
        "word": "Jayyid",
        "type": [],
        "definition": [
            "yaxshi, sifatli, a'lo darajada, puxta"
        ]
    },
    {
        "word": "Jayhun",
        "type": [],
        "definition": [
            "Amudaryoning qadimgi nomlaridan biri; Chorjo'y atrofidagi maskan"
        ]
    },
    {
        "word": "Jayshul usra",
        "type": [],
        "definition": [
            "Jayshul usra – 'qiyinchilik lashkari' degani. Tabuk g'azotiga chiqqan lashkar shunday nomlangan, chunki bu g'azot yozning jazirma kunlarida, og'ir bir vaziyatda o'tgan. O'shanda Usmon roziyallohu anhu ana shu lashkarni to'liq jihozlaganlar."
        ]
    },
    {
        "word": "Jalil",
        "type": [],
        "definition": [
            "Jalil – poyasi mayin, xushbo'y o'simlik. Rasululloh sollallohu alayhi vasallamning davrlarida uylarning tuynuklarini to'sish uchun ishlatilgan"
        ]
    },
    {
        "word": "Jaloluddin Yusuf ibn Ruknuddin Masiyh",
        "type": [],
        "definition": [
            "Tarixchilar ushbu zotdan Allomai Taftazoniy rahmatullohi alayhi u kishiga yozib bergan ijozatni keltiradilar:\r\n    'Ammo ba'd: Alloh taologa hamd, Rasulullohga salavot bo'lsin!\r\n    Batahqiq, mavlo, olim, fozil, komil Jaloluddin Yusuf ibn Imom Rukniddin Masiyhga mendan qiroat qilgan, eshitgan va amalga oshirgan narsalariga umumiy tarzda, tasnif qilgan narsalariga xususiy tarzda ijozat berdim. U mendan 'Sharhul Kashshof va al-miftoh'ga oid ko'p narsalarni o'qidi va eshitdi. Unga o'shalardan dars berishga va mutolaa, muroja'a, taammul qilganidan keyin ba'zi xatolar bo'lsa, isloh qilishga ham ijozat berdim. Ushbu Sa'duddin Taftazoniyning hayotining oxirida va vafoti yaqin qolganda yozgan xatidir. Hijriy 792 sananing oxiri, Samarqand'.\r\n    Allomai Taftazoniy rahmatullohi alayhining mazkur zotlardan boshqa shogirdlari ham ko'p bo'lgan, biroq biz bu yerda ushbular bilan kifoyalanamiz."
        ]
    },
    {
        "word": "Jamiʼul asanid fil qiroat",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Jamoat",
        "type": [],
        "definition": [
            "Fiqhiy istilohda imom bilan muqtadiyning namozi o'rtasida hosil bo'lgan bog'lanish"
        ]
    },
    {
        "word": "Jamra",
        "type": [],
        "definition": [
            "Jamra – hajdagi tosh otiladigan joy"
        ]
    },
    {
        "word": "Jamʼ",
        "type": [],
        "definition": [
            "Jam' – Muzdalifa."
        ]
    },
    {
        "word": "Jamʼi suvriy",
        "type": [],
        "definition": [
            "Hanafiy mazhabida namozni jam' qilish safarda shoshilib turgandagina bo'ladi. Shuningdek, Peshinni oxirgi vaqtiga yetib borib o'qib, uni o'qib bo'lishi bilan vaqti kirgan Asrni ham o'qib olingan. Shuningdek, Shom ham oxirgi vaqtiga borib o'qilib, undan keyin Xufton eng avvalgi vaqtida o'qilgan. Namozlarni bundoq qilib o'qishni Hanafiy mazhabi ulamolari 'Jam'i suvriy', ya'ni 'Suvratdagi jam'', deydilar."
        ]
    },
    {
        "word": "Jamʼi taqdim",
        "type": [],
        "definition": [
            "Bunda Peshin va Asr hamda Shom va Xufton namozlarini qo'shib, birin-ketin, bir vaqtda o'qish ko'zda tutilgandir. Boshqa mazhablarda, safardagi odam Peshin bilan Asrni va Shom bilan Xuftonni jamlab o'qishiga ruxsat, deydilar. Ularning aytishlaricha, Peshinning vaqtida Asrni qo'shib o'qib olsa yoki Shomning vaqtida Xuftonni o'qib olsa, bo'ladi. Buni 'jam'i taqdim' deydilar."
        ]
    },
    {
        "word": "Jamʼi taʼxir",
        "type": [],
        "definition": [
            "Asr va Xuftonning vaqtida ularga Peshin va Shomni qo'shib o'qisa ham, bo'ladi. Buni 'jam'i ta'xir' deydilar. Ammo Hanafiy mazhabida bunga ruxsat yo'q."
        ]
    },
    {
        "word": "Jannat",
        "type": [],
        "definition": [
            "bog', bo'ston, uchmoh; behisht. Taqvodor dindorlar narigi dunyoda rohat va farog'atda yashaydigan joy"
        ]
    },
    {
        "word": "Janoza",
        "type": [],
        "definition": [
            "'Janoza'ning lug'atdagi ma'nosi 'satr'–to'sishdir. Tobutga solingan o'lik 'janoza' deyiladi. Bir musulmon shaxs vafot etsa, qolgan musulmonlardan uning vafotini bilganlarga to'rt narsa kifoya tarzida farz bo'ladi. Ya'ni, o'sha narsalarni ulardan ba'zilari ado qilsa, kifoya qiladi."
        ]
    },
    {
        "word": "Janoh Abdulloh al-Barkadiy",
        "type": [],
        "definition": [
            "Janoh ibn Abdulloh al-Barkadiy Barkad qishlog'i ahlidan bo'lib, Iso ibn Muso al-G'unjorning shogirdlaridan. O'g'illari – Zahhok ibn Janoh al-Barkadiy"
        ]
    },
    {
        "word": "Jarjaroyo ",
        "type": [],
        "definition": [
            "Dajla daryosiga yaqin shahar bo'lib, Bag'dod va Vosit oralig'ida joylashgan."
        ]
    },
    {
        "word": "Jarir ibn Abdulloh",
        "type": [],
        "definition": [
            "Jarir ibn Abdulloh ibn Jobir Bajaliy, kunyalari Abu Amr. Hijratning 10-yili, Rasululloh sollallohu alayhi vasallamning vafotlaridan qirq kun oldin Islomga kirdilar. U kishi qavmlarining sayyidi bo'lganliklari uchun Rasululloh sollallohu alayhi vasallam u kishi Islomga kirgan vaqtlarida 'Kelsa, hurmat qilinglar', deb marhamat qildilar. Iroqda, Qodisiyada va bundan boshqa joylardagi urushlarda ishtirok etdilar. Bajala ahli tafriqaga tushganida Umar ibn Xattob roziyallohu anhu ularni jamlab, Jarirni boshliq etib tayinladilar. Bundan tashqari, Rasululloh sollallohu alayhi vasallam u kishini 'Xulosa' nomli butni buzish uchun yubordilar. U kishi butlarni o'tda yoqib yubordilar.\r\n    Jarir ibn Abdulloh Rasululloh sollallohu alayhi vasallamdan ko'p hadislar rivoyat qildilar. U kishidan o'g'illari Abdulloh, Munzir, Ibrohim va Qays ibn Hozim, Abu Voil, Abu Zur'ata ibn Amr ibn Jarir va boshqalar rivoyat qilishdi.\r\n     Jarir ibn Abdulloh roziyallohu anhu 50-hijriy yilda vafot etganlar"
        ]
    },
    {
        "word": "Jarhad roziyallohu anhu",
        "type": [],
        "definition": [
            "Jarhad ibn Xuvaylid Aslamiy, kunyalari Abu Abdurrahmon. U kishi ahli suffalardan edilar. Hudaybiyada ishtirok etganlar. Rasululloh sollallohu alayhi vasallamdan bir necha mashhur hadislar rivoyat qilganlar. Ana shu hadislardan biri – 'kishilarning soni ham avratdir' degan hadis.\r\n    Bu zot to'plagan hadislardan ba'zilarini uch 'Sahih' sohiblari o'z kitoblariga kiritishgan.\r\n    Jarhad roziyallohu anhu Madinada yashadilar va ana shu yerda Yaziyd ibn Muoviya davrida vafot etdilar."
        ]
    },
    {
        "word": "Jarh-taʼdil",
        "type": [],
        "definition": [
            "hadis roviylari haqida ijobiy yoki salbiy fikr bildirish ilmi."
        ]
    },
    {
        "word": "Jasad",
        "type": [],
        "definition": [
            "tana, gavda, jussa, murda, o'lik, badan"
        ]
    },
    {
        "word": "Jahannam",
        "type": [],
        "definition": [
            "do'zax, nor, jahim, saqar, tamug'. Din talablarini bajarmagan gunohkorlar oxiratda jazolanadigan joy."
        ]
    },
    {
        "word": "Jahmiy",
        "type": [],
        "definition": [
            "Jahm ibn Safvonning (?–745) izdoshlari. Ular Qur'onning yaratilganligi g'oyasini birinchi bo'lib aytgan oqim a'zolari."
        ]
    },
    {
        "word": "Jahmiya",
        "type": [],
        "definition": [
            "Jahm ibn Safvon Samarqandiyning buzuq aqiydaviy firqasiga ergashganlar. Ular asosan Alloh taoloning sifatlarini manfiy qilish, amaldan qoldirish bilan mashhur bo'lganlar"
        ]
    },
    {
        "word": "Jahriy",
        "type": [],
        "definition": [
            "oshkora, boshqalar eshitadigan ohangda, eshittirib"
        ]
    },
    {
        "word": "Jaʼfar al-Butaytiniy",
        "type": [],
        "definition": [
            "Ja'far ibn Muhammad al-Butaytiniy Hotam ibn Hoshim al-Kushoniy, Munzir ibn Yahyo ad-Dabusiy, Hozir ibn Lays ad-Dabusiy, Imron ibn Abdulloh an-Nuriy va Jibril ibn Sahl as-Samarqandiydan hadis ilmidan ta'lim olganlar. O'zlaridan esa o'g'illari Qosim ibn Ja'far al-Butaytiniy ad-Dabusiy Dabusiyada hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Jaʼfar al-Kasiriy al-Biyoriy",
        "type": [],
        "definition": [
            "Abul Fazl Ja'far ibn Husayn al-Kasiriy al-Biyoriy Buxoroda yashagan olimlardan. Abul Qosim (ona tomondan bobolari) shoh Mahmud ibn Sabukteginga ko'p arz qilganlari uchun bu kishiga 'al-Kasiriy' (ko'p) deb nisbat berilgan. Bu zot shayx, fozil, adabiyotshunos va she'rshunos olim va tush ta'birlarini biladiganlardan edilar. O'zlaridan oldin o'tgan va zamondosh shoirlarning she'rlarini juda ko'p yodlar edilar. Hijriy 471 (milodiy 1079) yilning rajab oyida Biyorda tug'ilib, hijriy 553 (milodiy 1159) yilda Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Jaʼfar al-Midyomajkatiy",
        "type": [],
        "definition": [
            "Abu Muhammad Ja'far ibn Muhammad al-Midyomajkatiyning eshitgan hadislari sahih edi. Imom al-Buxoriyning do'stlari Abdulloh ibn Mansur al-Xar'onkatiydan hadis rivoyat qilganlar (Xar'onkat – Buxoro qishloqlaridan.) Hijriy 357 (milodiy 969) yilda Dabusiyaga (Sug'ddagi shaharga) kelgan edilar va odamlar u kishidan hadislar yozib olardilar. Al-Midyomajkatiy hijriy 360 (milodiy 972) yilda vafot etganlar."
        ]
    },
    {
        "word": "Jaʼfar an-Naqbuniy",
        "type": [],
        "definition": [
            "Abul Abbos Ja'far ibn Muhammad an-Naqbuniy Buxoro ahlidan bo'lib, Muhammad ibn Xolid al-Paykandiy va Abu Bakr as-Sa'doniydan hadis rivoyat qilganlar. O'zlaridan esa Xoja G'unjor hadis rivoyat qilganlar. Hijriy 374 (milodiy 985) yil ramazon oyining birinchi kunida vafot etganlar."
        ]
    },
    {
        "word": "Jaʼfar ibn Muhammad",
        "type": [],
        "definition": [
            "Ja'far ibn Muhammad ibn Maslama roziyallohu anhu sahobalardan edilar.\r\n    Ibn Shohin: 'Ja'far ibn Muhammad Rasululloh sollallohu alayhi vasallam bilan suhbatda bo'lib, Makka fath etilgan kuni va bundan keyingi ma'rakalarda ishtirok etganlar', deb aytadilar."
        ]
    },
    {
        "word": "Jigarning ortigʻi",
        "type": [],
        "definition": [
            "Jigarning ortig'i – jigarga yopishgan bir parcha go'sht bo'lib, u juda lazzatli va xushta'm bo'ladi"
        ]
    },
    {
        "word": "Jizoxisht",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Jizya",
        "type": [],
        "definition": [
            "Zimmiy odamlar to'laydigan to'lov. Islomdagi bu to'lov ibodat ma'nosida emas, hukumat odamlari bilan musulmon bo'lmagan kishilar orasidagi kelishuv orqali olib boriladigan muomala sifatida qaraladi. Zimmiy Islom davlati himoyasida yurgani barcha ijtimoiy imtiyozlardan foydalangani, ammo harbiy xizmatdan ozod qilingani uchun jizya to'laydi"
        ]
    },
    {
        "word": "Jimoʻ",
        "type": [],
        "definition": [
            "er-xotinning qovushmog'i, jinsiy aloqa."
        ]
    },
    {
        "word": "Jin surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 28 oyatdan iborat.\r\n    Ushbu surai karimaning birinchi oyatidagi 'jin' so'zi unga nom bo'lib qolgandir.\r\n    Bu surada Islom aqiydasi asoslaridan bo'lgan yakka ilohlik, payg'ambarlik, o'lgandan so'ng qayta tirilish, bu dunyoda qilgan amaliga yarasha oxiratda jazo yoki mukofot olish kabi masalalar aks etgan. Surada asosan jin haqidagi ma'lumotlar zikr qilinadi. Shu sababli ham u Jin surasi deb nomlangan. Oyatlarda jinlarga xos ishlar – ularning Qur'on tilovatini eshitishlari, iymonga kelishlari, ularga xos ajoyib xislatlar, misol uchun, farishtalardan berkinib, yashirincha osmon xabarlarini tinglashlari, ularga qarata uchqun otilishi, ba'zi g'aybiy sirlardan xabardor bo'lishlari va boshqa holatlar haqida xabar qilinadi..\r\n    Surai karima bir guruh jinlarning Qur'on tinglaganlari, undan ta'sirlanib, iymonga kelganlari va o'z qavmlarini ham iymonga chaqirishlari bilan boshlanadi.\r\n    So'ngra jinlarning Alloh taoloni ulug'lashlari, poklashlari, yolg'iz O'ziga ibodat qilishlari va 'Allohning bolasi bor', deganlarni esi past sanaganliklari haqida zikr qilinadi.\r\n    Keyin jinlarning osmon xabarlariga yashirincha quloq osishlari, osmonni qorovul farishtalar o'rab olganligi, Muhammad alayhissalom payg'ambar bo'lganlaridan so'ng ular osmonga chiqqanlarida, ularga qarata uchqunlar otila boshlagani va jinlarning bu ajib o'zgarishdan taajjublanib yurgani, jinlarning ikkiga – mo'minlarga va kofirlarga bo'linishi, bu ikki guruh oqibatining bayonlari keladi.\r\n    Nabiy alayhissalomning da'vatlari, ul zoti bobarakot Qur'on tilovat qilayotganlarida, jinlarning kelib, Rasululloh sollallohu alayhi vasallamning atroflarini o'rab olib, Qur'on o'qishlarini tinglashlari ham, Nabiy alayhissalomga, Alloh taologa bo'ysunish, ixlosni faqat Uning O'zigagina qilishga ko'rsatma ham ushbu surada nozil bo'lgan.\r\n    Va, nihoyat, surada koinotdagi barcha narsalarni Alloh taoloning O'zigina bilishi bayon qilinadi.\r\n    \r\n    JIN HAQIDA QISQAChA MA'LUMOT\r\n    \r\n    Jin haqida qisqacha bo'lsa ham ma'lumot olishimiz bu surai karimaning ma'nolarini yanada chuqurroq tushunishimizga yordam beradi, degan umidda quyidagilarni e'tiboringizga havola qilishga ijozat bergaysiz.\r\n    Qur'oni Karim nozil bo'layotgan paytda arab qabilalari jinlarga maxfiy, noravshan xudolar deb e'tiqod qilardilar. Ular 'Jinlarning nasabi Alloh taologa yetib boradi, Uning jinlardan sheriklari bor' degan buzuq e'tiqodga ham bo'ysunishardi. Shuningdek, arablar 'Jinlar g'aybdan xabardor, folbin va munajjimlarga osmon sirlarini aytib turishadi' degan o'yda edilar. Jin surasi ushbu e'tiqodlarning bekorchi ekanini ta'kidlaydi. Bunga qo'shimcha ma'noda Payg'ambarimiz Muhammad sollallohu alayhi vasallam o'z hadisi shariflarida: 'Kim folbinu munajjimga borsa va ularga ishonsa, Muhammadga nozil bo'lgan narsaga kofir bo'libdi', – deganlar.\r\n    Arablarda 'Jinlarning hukmi yer yuzida o'tadi' degan xom xayol bo'lib, agar ulardan birortalari ma'lum bir joyga borib, yotib qolmoqchi bo'lsalar, 'Ushbu joyning xo'jayin jinidan panoh so'rayman' degan ma'nodagi duoni qilishardi.\r\n    Bizning yurtlarda ham hatto hozirgi vaqtgacha kishilarda yuqoridagi aytilganlarga o'xshash turli-tuman buzuq, bid'at-xurofotdan iborat tushunchalar mavjud va ba'zilar bu yolg'on e'tiqodga bo'ysunadilar. Ayniqsa, keyingi paytda kishilarda ruhiy bo'shliq haddan tashqari ziyoda bo'lganligidan, bu ma'nodagi gap-so'zlar ko'payib ketdi. Agar ularga quloq osadigan bo'lsak, xuddi butun dunyoni jinlar boshqarib turganga o'xshaydi (Astag'firulloh!).\r\n    Shu bilan birga, qadimda ham, hozirda ham jinlarni mutlaqo inkor etadiganlar bor. Ular jin haqidagi har bir so'zni afsona, bekorchi gap, deyishadi. Jinlar haqidagi hodisalarning guvohi bo'lgan kishilarni jinniga, miyasi ayniganga chiqarishadi.\r\n    Islom esa jin haqida, xuddi boshqa masalalardagi kabi, haqiqatni bayon qiladi. Islom jin borligini isbot qilib, u haqidagi to'g'ri tasavvurni bayon etib, noto'g'ri tushunchalarni rad etadi. Shu bilan birga, jinlardan kutiladigan mavhum qo'rqinch va xavfu xatarni ham rad etadi.\r\n    Jinlar haqiqatda ham bor mavjudotlar bo'lib, asli o'tdan yaratilgan. 'Jin' so'zining lug'aviy ma'nosi esa 'to'silgan' degani, ya'ni odamlar ko'zidan to'silgan narsadir. Shu sababli ham u insonlarga ko'rinmaydi. Ular o'zlari ko'rinmay turib, bizlarni va boshqa narsalarni ko'rishlari, shu bilan birga, turli shakllarga kirishlari ham mumkin. Ularning ichida ham xuddi odamlarga o'xshab, iymonli-iymonsizlari, yaxshi-yomonlari, adashgan va hidoyatda yurganlari, firibgar va soddalari bor. Jinlardan ham Qur'onga, Nabiy alayhissalomga iymon keltirib, yaxshi yo'lda yurganlari jannatga, iymonsiz bo'lib, yomon yo'lda yurganlari do'zaxga tushadilar. Ular hech qachon odamlarga yordam bera olmaydilar va g'ayb sirlarini bilmaydilar, chunki Qur'oni Karim nozil bo'lgandan so'ng, ular bu xislatlardan mahrum bo'lganlar. Jinlarning Alloh taolo bilan nasab yo'lidagi bog'liqligiga kelsak, bu haqdagi har qanday fikrlar tuhmatdir.\r\n    Saba' surasida bir guruh jinlarning Sulaymon alayhissalomga xizmatkor bo'lganliklari, u zot hassaga suyanib turib, vafot etganlaridan so'ng ham, tirik, kuzatib turibdi, deb o'ylab, mashaqqatli ishda davom etganliklari haqida oyatlar bor.\r\n    Jin surasining tafsiri davomida bu masalalar yanada ravshan bo'ladi, inshaalloh.\r\n    Islomdan avvalgi vaqtda jinlar osmonga chiqib, maloikalarning o'zaro suhbatlarini, jumladan, yaqin kunlarda sodir bo'ladigan ba'zi ishlar haqidagi ma'lumotlarni yashirincha eshitib, yerdagi folbinu munajjimlarga birga o'nni qo'shib, yetkazishar ekan. Oradan ancha vaqt o'tib, osmon xabariga quloq osgani chiqsalar, ularni yulduzlardan uzilib chiqqan uchqunlar urib haydaydigan bo'lib qolibdi. Ular yerga, o'z qavmlari huzuriga qaytib, 'Nima bo'ldi ekan, bizni uchqunlar quvadigan bo'lib qoldi-ku?' – deyishadi. Shunda ba'zilari 'Dunyoda ulkan, olamshumul o'zgarish bo'lgan bo'lsa kerak', – deyishadi. Mashriqu mag'ribni kezib, bizdan osmon xabarini to'sgan narsani qidirish zarur, degan qarorga kelib, safarga otlanadilar. Rivoyatlarda naql qilinishicha, Nasiybin nomi bilan ataluvchi joyda yashovchi jinlardan yetti nafari Nabiy sollallohu alayhi vasallam bomdod namozida qiroat qilayotganlarini eshitib, to'xtashgan va 'Bizdan osmon xabarini to'sgan narsa shu', deb o'z qavmlariga qaytib, bo'lgan hodisani aytganlar. Shunda Alloh taolo O'z Payg'ambariga Jin surasini nozil qilgan."
        ]
    },
    {
        "word": "Jihod",
        "type": [],
        "definition": [
            "'Jihod' so'zi lug'atda 'bor imkoniyatni sarf qilish', 'bor budini ishga solish' degan ma'nolarni bildiradi."
        ]
    },
    {
        "word": "Jiʼrona",
        "type": [],
        "definition": [
            "Ji'rona – Toifdan Makkaga kirishda joylashgan shahar bo'lib, u bilan Makka oraligi 6–7 mil keladi. U umra uchun miyqot hisoblangan"
        ]
    },
    {
        "word": "Jobir al-Xayyot al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Sa'id Jobir ibn Iso al-Xayyot al-Buxoriy mashhur kiyim tikuvchi bo'lganlar. Iso ibn Muso al-G'unjordan hadis ilmidan ta'lim olganlar."
        ]
    },
    {
        "word": "Jobir ibn Abdulloh",
        "type": [],
        "definition": [
            "Jobir ibn Abdulloh ibn Amr ibn Harom al-Ansoriy as-Salamiy, nasablari ansorlarning o'rtasidan bo'lmish Bani Salamadan. Otalari va tog'alari bilan 'Aqaba' bay'atining ikkinchisida birga bo'lganlar. Bu bay'atda ansorlardan yetmish kishi Rasululloh sollallohu alayhi vasallamning g'alaba qozonishlariga hissa qo'shish va Islomni butun yer yuziga yoyishga ahd qilib, bay'at berishgan. Jobir roziyallohu anhu Badr va Uhud janglaridan tash¬qari, Rasululloh sollallohu alayhi vasallam ishtirok etgan barcha jangda qatnashganlar.\r\n    Jobir ibn Abdulloh: 'Rasululloh sollallohu alayhi vasallam bilan o'n to'qqizta jangda birga bo'ldim. Badr bilan Uhuddagina otamning mone'liklari sababli ishtirok etmadim. Otam vafot etganlaridan so'ng, birorta jangda Rasululloh sollallohu alayhi vasallamning orqalaridan qolganim yo'q', deydilar.\r\n    Jobir ibn Abdulloh sahobalarning ichida ko'p hadis rivoyat qilganlarning oltinchisi bo'lib, 1540ta hadis rivoyat qilganlar.\r\n    Jobir ibn Abdulloh Misr va Shomga borganlarida odamlar u kishidan ko'p ilm o'rganar edilar. Shuningdek, Madinai Munavvaradagi Masjidun Nabaviyda ham ilm halqalari bo'lib, unda to'planganlar u kishining ilm va taqvolaridan ko'p naflanardilar.\r\n    Jobir ibn Abdulloh 74-hijriy sanada Madinai Munavvarada vafot etdilar. Janozalarini Onzak shahrining voliysi Abon ibn Usmon o'qidilar."
        ]
    },
    {
        "word": "Joiz",
        "type": [],
        "definition": [
            "ijozat berilgan, yo'l berilgan, ruxsat etilgan, mumkin"
        ]
    },
    {
        "word": "Joynamoz",
        "type": [],
        "definition": [
            "namoz o'qiladigan to'shama, gilam"
        ]
    },
    {
        "word": "Jom",
        "type": [],
        "definition": [
            "Suv ichiladigan, kosaga o'xshash idish. Arablarda qadimda 'qadah' deyilgan"
        ]
    },
    {
        "word": "Jomeʼ masjid",
        "type": [],
        "definition": [
            "besh vaqt namozdan tashqari, jum'a, taroveh, janoza va hayit namozlari o'qiladigan masjid"
        ]
    },
    {
        "word": "Jomeʼur rumuz",
        "type": [],
        "definition": [
            "Shamsuddiyn Muhammad Xurosoniy Qo'histoniyning 'Muxtasari Viqoya' ga yozgan sharhi"
        ]
    },
    {
        "word": "Josiya surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 37 oyatdan iborat.\r\n    'Josiya' so'zi 'tiz cho'kuvchi' degan ma'noni bildiradi. Ushbu surai karimadagi qiyomat kuni vasfiga oid oyatlardan birida 'Har bir ummatni tiz cho'kkan holida ko'rursan', deyiladi. Ya'ni qiyomat kunining dahshati juda ham kuchli bo'lganidan, ular tik tura olmay, tiz cho'kib qoladilar. Ana shu oyatdagi 'josiya' kalimasi suraga nom bo'lib qolgan.\r\n    Makkada nozil bo'lgan ushbu sura mushriklarning Islom da'vatini qanday qarshi olganlarini tasvirlaydi. Boshqa makkiy suralar kabi, bu surada ham aqiyda masalasiga alohida e'tibor beriladi. Alloh taologa va Uning vahdoniyatiga, Qur'oni Karimga, Muhammad sollallohu alayhi vasallamga, oxiratga, qayta tirilishga va jazo-mukofot berilishiga iymon haqida so'z yuritiladi.\r\n    Sura Qur'oni Karim va uning masdari xususidagi oyatlar bilan boshlanadi. Alloh taolo O'z Kitobini nima uchun nozil qilgani bayon etiladi.\r\n    So'ngra Alloh taoloning Biru Borligiga dalolat qiluvchi borliqdagi belgilar bayon qilinadi. Osmonlardagi alomatlar eslanadi. Shuningdek, kechayu kunduzning almashinishi, shamollarning bo'ysundirilishi va yomg'irlar ham Allohning ulug'ligi va qudratiga oyat-belgi ekani tushuntiriladi.\r\n    Qur'oni Karimni inkor qiluvchi jinoyatchilar va ularning oqibati nima bo'lishi aytiladi.\r\n    Keyingi oyatlarda Alloh taolo bandalariga ulug' ne'matlar bergani uchun ularning shukr keltirishlari lozimligi ta'kidlanadi. Surada o'tgan ummatlardan Banu Isroil haqida so'z ketadi. Alloh taolo ularga ne'matlar berib, hurmatlagani, ular esa bu fazlu karamni noshukrlik va isyon ila qarshi olganlari eslatiladi. Shu munosabat bilan jinoyatchi, gunohkor qavmlarning payg'ambarlar da'vatiga nisbatan yomon muomalasi haqida so'z yuritilib, Alloh taoloning adolati bu ishni taqozo etmasligi uqtiriladi. Keyin esa mushriklarning zalolatga ketish sabablari zikr etiladi.\r\n    Josiya surasining oxirida qiyomat kuni kishilar ikkiga bo'linishlari, bir guruh jannatiy, ikkinchi guruh do'zaxiy bo'lishi, har bir guruh qilmishiga yarasha jazo yoki mukofot olishi haqidagi oyatlar keladi."
        ]
    },
    {
        "word": "Johiliyat",
        "type": [],
        "definition": [
            "arab tarixining islomdan oldingi, diniy-ma'rifiy o'zgarishlardan xoli davri"
        ]
    },
    {
        "word": "Jubayr ibn Mutʼim",
        "type": [],
        "definition": [
            "Jubayr ibn Mut'im ibn Adiy ibn Navfal al-Qurashiy, kunyalari Abu Muhammad.\r\n    Bu sahoba Quraysh qabilasining boy-badavlat boshliqlaridan edilar. Jubayr ibn Mut'im avvaliga Islom dushmani bo'lganlar. Lekin Makka fath etilgan kuni Islomga kirdilar.\r\n    Jubayr hammasi bo'lib 60ta hadis rivoyat qilganlar.\r\n    Bu zotdan Sulaymon ibn Sadr, Abdurrahmon ibn Azhar, ikki o'g'illari Nofe' va Muhammadlar rivoyat qilganlar. Jubayr ibn Mut'im hijratning 53-yili vafot etdilar."
        ]
    },
    {
        "word": "Jubba",
        "type": [],
        "definition": [
            "Jubba – ipak, jun va boshqa matolardan tikilgan qimmatbaho, uzun ustki kiyim"
        ]
    },
    {
        "word": "Jubun",
        "type": [],
        "definition": [
            "arabcha so'z bo'lib, pishloq degan ma'noni anglatadi."
        ]
    },
    {
        "word": "Juvonmarg",
        "type": [],
        "definition": [
            "yosh holatda vafot etish"
        ]
    },
    {
        "word": "Juvoso",
        "type": [],
        "definition": [
            "Juvoso – Bahrayn qishloqlaridan biri bo'lib, keyinchalik shaharga aylanib ketgan"
        ]
    },
    {
        "word": "Juz",
        "type": [],
        "definition": [
            "bitta mavzuga oid hadislar to'plangan saylanma."
        ]
    },
    {
        "word": "Julvon al-Bonabiy",
        "type": [],
        "definition": [
            "Abu Tayyib Julvon ibn Samura al-Bonabiy - Buxorodagi Bonab qishlog'ining nisbati bilan mashhur bo'lgan bu zot zohid, obid va taqvodor olimlardan edilar. Abu Muqotil Isom an-Nahviy, Abdulloh ibn Yazid al-Muqriy, Sa'id ibn Mansur, Xoqon as-Sulamiy va Ahmad ibn Hafsdan hadis rivoyat qilganlar. Bu kishi quyidagi hadisni rivoyat qilganlar: 'Anzi'u at-tususa va xolifu al-majusa' , ya'ni 'Majusiylarga xilof o'laroq idishni tortib olib bo'lsa ham qo'llaringizni yuvinglar'.\r\n    Bir kuni masjidda azon aytayotganlarida bir odam maktub olib keladi. Qarasalar, maktub amirdan. Darhol o'sha kishining qo'liga maktubni qaytarib: 'Men qachondan beri amirning odami bo'libman? Mening ular bilan ishim yo'q', – deb javob beribdilar. Bu xabar yetganida, amir: 'Xudoga shukur, xalqim orasida mening maktubimni o'qimaydigan inson ham bor ekan-da', – degan ekan *\r\n    * O'sha davrlarda zohidlar davlat ishiga aralashmasdilar."
        ]
    },
    {
        "word": "Jummor",
        "type": [],
        "definition": [
            "Jummor – xurmo daraxtining ichidan olinadigan oq rangli, yelimsifat modda bo'lib, tanasining yuqori qismida joylashgan bo'ladi. Uni olish uchun daraxtning uchi kesiladi va shundan keyin daraxt quriydi. Uni xurmoning qalbi – ichi ham deyiladi. U yeyiladigan va qimmatbaho narsa bo'lib, juda ham foydalidir. Jumladan, ichketar, safroni haydash, isitmani tushirish va yara-chaqalarda dori sifatida ishlatiladi"
        ]
    },
    {
        "word": "Jumodo",
        "type": [],
        "definition": [
            "Jumodo – jumodil-oxir oyi. Jumodis-soniyni ham shunday nomlash bor. Rajab oyini 'Muzar rajabi' deb ta'kidlanganining boisi shuki, Muzar qabilasi bu oyni ko'proq ulug'lagan, boshqa oylar bilan uning o'rnini almashtirmagan"
        ]
    },
    {
        "word": "Jumuʼa surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 11 oyatdan iborat.\r\n    Bu sura Soff surasidan so'ng nozil bo'lgan. Mavzusi Soff surasida ko'tarilgan masalalarga o'xshash, lekin boshqacha, o'ziga xos uslub bilan muolaja qilinadi. Suraning nomidan ham ma'lum bo'lib turibdiki, unda juma namozi haqida so'z ketadi. 'Juma' – o'zbek va boshqa turkiy tillarda arabcha 'jumu'a' so'zining bir oz buzib talaffuz etilishidir. 'Jumu'a' so'zi aslida 'jam'' ('jamlanish') so'zidan olingan. Chunki juma kuni musulmonlar o'zlarining ommaviy katta jamoatli namozlariga jamlanadilar. Alloh taolo musulmon bandalariga bu jamoat namozining aynan shu kunda o'qilishini farz qilgan.\r\n    Surai karima Islom dini insoniyat uchun Allohning rahmati ekanini, ushbu din ila arablar shirk va zalolatdan xalos bo'lganliklarini, bu din bashariyatning barcha dardlariga malham ekanini bayon qiladi.\r\n    So'ngra yahudiylar haqida, Alloh taolo Tavrot hukmlariga amal qilishga buyurgan bo'lishiga qaramay, ularning yo'ldan ozganliklari, Allohning dinidan yuz o'girib ketganliklari to'g'risida hikoya qilinadi.\r\n    Undan keyin juma namozi hukmlari haqida so'z ketadi. U namozga azon aytilishi bilan mo'minlar masjidlarga shoshilishlari zarurligi, bu vaqtda savdo-sotiq harom bo'lishi bayon qilinadi. Namozga bormay, tijorat va o'yin-kulgi bilan mashg'ul bo'lishning oqibati yomon bo'lishi ta'kidlanadi."
        ]
    },
    {
        "word": "Jumʼa",
        "type": [],
        "definition": [
            "'Jum'a' so'zi arabcha so'z bo'lib, 'jamlash' ma'nosini anglatadi. Chunki, bu kunda musulmonlar jamlanib, Jum'a namozini o'qiydilar."
        ]
    },
    {
        "word": "Junub",
        "type": [],
        "definition": [
            "'Junub' so'zi lug'atda 'chetda turuvchi' ma'nosini anglatadi. Shariatda esa, jinsiy yaqinlik, uyquda bulg'anish va boshqa sababga ko'ra maniyi chiqib, g'usl vojib bo'lgan shaxsga aytiladi. Fusl vojib bo'lgan odam namozdan, Qur'ondan, masjiddan va shariat ko'rsatgan boshqa narsalardan chetda bo'lgani uchun ham 'junub' nomini olgan."
        ]
    },
    {
        "word": "Jurjoniyot",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Juruf",
        "type": [],
        "definition": [
            "Juruf – Madina yaqinidagi joy nomi"
        ]
    },
    {
        "word": "Jurhum",
        "type": [],
        "definition": [
            "Jurhum – qadimiy arab sulolalaridan. Ular asli yamanlik bo'lgan."
        ]
    },
    {
        "word": "Juhfa",
        "type": [],
        "definition": [
            "Juhfa – Makka yaqinidagi qishloq, u Shom va Misr ahli uchun miyqot hisoblanadi"
        ]
    }
]