[
    {
        "word": "Kaafirun surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 6 oyatdan iborat.\r\n     Ushbu surai karimaga ham uning birinchi oyatidagi 'aafirun' – 'kofirlar' so'zi nom bo'lib qolgan. Alloh taolo Nabiy alayhissalomga ushbu surada mushriklarga nisbatan 'Ey kofirlar!' deb murojaat qilishni amr qilgan.\r\n    Kaafirun surasi makkiy suralardan bo'lib, u 'tavhid surasi', 'shirkdan poklanish surasi' deb ham vasf qilinadi.\r\n    Rivoyatlarda kelishicha, bir guruh Quraysh kofirlari Payg'ambarimizga:\r\n    – Kelishaylik, biz sening diningga ergashaylik, sen ham bizning dinga ergash, biz sening ilohingga bir yil ibodat qilamiz. Sen bizning ilohimizga bir yil ibodat qilasan, – deyishdi. Shunda ul zot:\r\n    – Alloh saqlasin! Men U Zotga hech shirk keltirmayman, – dedilar. Kofirlar:\r\n    – Bizning ba'zi butlarimizni tavof qilgin (sig'in), biz sening ilohingga ibodat qilamiz, – deganlarida, ushbu sura nozil bo'lgan ekan."
        ]
    },
    {
        "word": "Kabas",
        "type": [],
        "definition": [
            "Kabas – arokning mevasi. Arok misvok olinadigan daraxt bo'lib, uning mevasi anjirga o'xshash bo'ladi. Rus tilida 'salvadora persidskaya' deyiladi"
        ]
    },
    {
        "word": "Kabira",
        "type": [],
        "definition": [
            "katta, yirik, ulkan. Katta va og'ir gunoh"
        ]
    },
    {
        "word": "Kabsha binti Kaʼb",
        "type": [],
        "definition": [
            "Kabsha binti Ka'b roziyallohu anho Ka'b ibn Molik Ansoriy Xazrajiy roziyallohu anhuning qizlari bo'ladilar. Otalari Ka'b roziyallohu anhu mashhur sahobiylardandir. Kabsha roziyallohu anho Abdulloh ibn Qatoda roziyallohu anhuga turmushga chiqqan edilar. U kishi ushbu hadislari bilan mashhurdirlar"
        ]
    },
    {
        "word": "Kavsar",
        "type": [],
        "definition": [
            "jannatdagi ajib bir daryo yoki hovuzning nomi"
        ]
    },
    {
        "word": "Kavsar surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 3 oyatdan iborat.\r\n    Ushbu surai karimaning nomi o'zining birinchi oyatidagi 'kavsar' so'zidan olingandir. 'Kavsar' so'zi lug'atda 'ko'p yaxshilik', 'juda ham ko'p yaxshilik' degan ma'nolarni anglatadi. Arablarda soni jihatidan, qadr-qiymati jihatidan va ahamiyati jihatidan ko'p bo'lgan narsaga 'kavsar' deyiladi. Ushbu suradagi 'kavsar'dan murod Alloh subhanahu va taolo tomonidan Nabiy sollallohu alayhi vasallamga ikki dunyoda berilgan ko'p yaxshiliklardir. Mashhur mufassirlardan Abu Xayyonning aytishlaricha, 'kavsar'dan ko'zlangan murod haqida yigirma olti xil narsa zikr qilingan ekan.\r\n    Imom Termiziy rivoyat qilgan hadisda quyidagilar zikr qilinadi: 'Kavsar jannatdagi daryo bo'lib, uning ikki qirg'og'i oltindan, o'zani duru yoqutdan, tuprog'i miskdan xushbo'y, suvi asaldan shirin, qordan oqdir. Kim undan bir marta ichsa, keyin abadiy chanqamaydi'.\r\n    Imom Muslim va imom Termiziylar Anas ibn Molik roziyallohu anhudan rivoyat qilgan hadisda esa shunday deyiladi: 'Bir kuni Rasululloh sollallohu alayhi vasallam ichimizda turgan edilar, bir oz jim turib qoldilar-da, so'ng tabassum-la boshlarini ko'tardilar. Biz:\r\n    – Sizni nima kuldirdi, ey Allohning Rasuli? – dedik.\r\n    – Menga hozirgina bir sura nozil qilindi, – deb, 'Bismillahir rohmanir rohiym. Innaa a'toynakalkavsar surasini qiroat qildilar. So'ngra: – Kavsar nimaligini bilasizlarmi? – dedilar.\r\n    – Alloh va Uning Rasuli biluvchidirlar, – dedik.\r\n    – U Robbim azza va jalla menga va'da qilgan anhordir. Unda ko'p yaxshilik bordir. U qiyomat kuni ummatim kelib, huzurimda suv ichadigan hovuzdir. Uning idishlari yulduzlar adadicha. Ularning ichidan bir banda sug'urib olinadi. Men 'U mening ummatimdan', deyman. Shunda 'Bu sendan keyin nima qilganini bilmaysan', deyiladi'.\r\n    Ibn Abbos roziyallohu anhu: 'Kavsar – ko'p yaxshilik' degan. Shu ma'noda Nabiy sollallohu alayhi vasallam: 'Bu dunyoda berilgan – nubuvvat, Qur'on, ilm, ummatning ko'pligi, dushmanlarga g'oliblik, fathlarning ko'pligi va u dunyoda berilgan – shafoat, havz, maqomi mahmud kabilarning hammasi kavsardan hisoblanadi', – deganlar.\r\n    Ushbu sura Payg'ambar sollallohu alayhi vasallamning o'zlariga xos. Alloh taolo bu surada ul zotga yaxshi va'dalar beradi. Shuningdek, dushmanlarning nomini o'chirishga va'da beradi va u zoti bobarakotni shukrga yo'llaydi.\r\n    Ma'lumki, Muhammad sollallohu alayhi vasallamning o'g'il farzandlari turmagan, vafot etgan. Kofirlar, dushmanlar shundan ham darrov gap tarqatganlar, chunki musulmonlarning rahbariga tuhmat qilib, obro'sini to'kish bilan Islomning obro'sini to'kishga harakat qilish din dushmanlarining qadimdan ishlatib kelayotgan uslubidir. Ular: 'Muhammadning orti kesik, ishini davom ettiradigan o'g'il farzandi yo'q, vafotidan so'ng hammaning yodidan chiqadi', – deyishgan.\r\n    Alloh taolo O'z habibiga tasalli berib, dushmanlarga raddiya qilib, din farzanddan afzal ekanini bayon qiladi."
        ]
    },
    {
        "word": "Kado ",
        "type": [],
        "definition": [
            "Kado – Yuqori dovon chekkasidagi tog'. Ba'zan mazkur dovonning o'zi ham shu nom bilan nomlangan"
        ]
    },
    {
        "word": "Kayl ",
        "type": [],
        "definition": [
            "Kayl - ziroat mahsulotlarini, xususan, xurmo, bug'doy, arpa kabilarni maxsus idishda o'lchashdir. Masalan, so' nomli idishga ma'lum miqdorda mahsulot siqqan. O'shanga o'xshash idishlarni o'lchov qilib olib, mahsulotlar miqdorini o'lchaganlar"
        ]
    },
    {
        "word": "Kayla",
        "type": [],
        "definition": [
            "(hozirgi Misr o'lchov birligi) (pud yoki put) = 16,5 litr. Og'irligi = 13,056 kg(= 2 faraq = 4 makkuk = 6 so' = 12 qist = 16 mann = 24 mudd = 24 katta hovuch miqdori = 32 iroqiy ratl)."
        ]
    },
    {
        "word": "Kalima",
        "type": [],
        "definition": [
            "so'z, jumla, ibora, qisqa gap, gap bo'laklari."
        ]
    },
    {
        "word": "Kalimai shahodat",
        "type": [],
        "definition": [
            "guvohlik kalimasi. Allohdan o'zga iloh yo'qligiga iqror bo'lish"
        ]
    },
    {
        "word": "Kalola",
        "type": [],
        "definition": [
            "'Kalola' so'zi haqida ulamolarimiz ko'p bahs yuritishgan. Bizning tilimizda 'kalola' so'zini aynan ifoda etadigan ibora yo'q. Shuningdek, arab tilida ham bu so'zning boshqa murodifi (sinonimi) yo'q. Odamlar hazrati Abu Bakr Siddiq roziyallohu anhudan kalola haqida so'rashganida: 'U haqda o'z fikrimni aytaman, to'g'ri bo'lsa – Allohdan, xato bo'lsa – mendan va shaytondan, ya'ni Allohning va Uning Rasulining bunga aloqasi yo'q. Kalola – zurriyoti va ajdodi yo'q odamning opa-singlisidir', dedilar. Ya'ni o'lgan paytida orqasidan bola-chaqasi, nevara-chevaralari ham, ota-ona, bobo-momolari ham qolmagan, lekin opasi yo singlisigina merosxo'r bo'lib qolgan odamdan faqat kalola, ya'ni uning opa-singillari meros oladilar."
        ]
    },
    {
        "word": "Kalom",
        "type": [],
        "definition": [
            "ravon nutq, jumla, gap, so'z. Aqida ilmi"
        ]
    },
    {
        "word": "Kalom ahli",
        "type": [],
        "definition": [
            "aqida ilmi bilan shug'ullanadigan kishilar"
        ]
    },
    {
        "word": "Kalom ilmi",
        "type": [],
        "definition": [
            "Allohning yolg'izligi haqida bahs yuritiladigan ilm"
        ]
    },
    {
        "word": "Kamolud-diroya fiy sharhin-Niqoya",
        "type": [],
        "definition": [
            "Shayx Taqiyyuddiyn Abul Abbos Ahmad ibn Muhammad ash-Shamaniyning 'Muxtasari Viqoya' ga yozgan sharhi"
        ]
    },
    {
        "word": "Kamon oʻqi yetadigan joy ",
        "type": [],
        "definition": [
            "eng qisqa masofa - 184.80 metr."
        ]
    },
    {
        "word": "Karmon ",
        "type": [],
        "definition": [
            "Karmon – Xuroson bilan Hind dengizi o'rtasidagi yurt"
        ]
    },
    {
        "word": "Karomat ",
        "type": [],
        "definition": [
            "karomat, ikrom qilinish, yuqorilik, sharaf. Aqlni lol qoldiradigan g'ayritabiiy hodisalar"
        ]
    },
    {
        "word": "Karohiyat",
        "type": [],
        "definition": [
            "'Karohiyat' so'zini 'yomon ko'rilgan narsalar' deb tarjima qilishimiz mumkin. Bu yerda karohiyat lug'atdagi ma'nosidan ko'ra kengroq ma'noni ifoda etadi. Bunda makruhi tahrimiy, makruhi tanziyhiy, muboh va gohida, tark qilinishi harom bo'lgani uchun, farzni ham o'z ichiga oladi."
        ]
    },
    {
        "word": "Karromiylar",
        "type": [],
        "definition": [
            "9–13 asrlarda Bag'dodda tarqalgan ilohiyot oqimi. Asoschisi – Abu Abdulloh Muhammad ibn Karrom (806–869)."
        ]
    },
    {
        "word": "Kasaniyot",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kasra",
        "type": [],
        "definition": [
            "arab harflarining pastiga qo'yiladigan harakat. “I” tovushi bilan o'qiladi"
        ]
    },
    {
        "word": "Katam",
        "type": [],
        "definition": [
            "Katam ‒ Yamanda o'sadigan o'simlik, undan bo'yoq olinadi, bo'yalganda to'q qizil rang beradi. Uni hinno bilan aralashtirib bo'yalganda esa qizg'ish-qoramtir rang hosil bo'ladi."
        ]
    },
    {
        "word": "Kafan ",
        "type": [],
        "definition": [
            "dafn oldidan marhumning jasadi o'raladigan oq mato."
        ]
    },
    {
        "word": "Kafolat ",
        "type": [],
        "definition": [
            "Kafolat so'zi arab tilida 'qo'shish' ma'nosini bildiradi. Shariat istilohida esa: Kafolat haqni talab qilishda bir zimmaga ikkinchisini qo'shishdir. Qarzda emas. Ana o'shanisi to'g'riroq. Bir odamning ikkinchisida haqi bor. U o'z haqini talab qiladi. Ammo uni yana ham ishontirish uchun haqni to'lash kerak bo'lgan odamga boshqa bir kishi kafil bo'ladi. Ya'ni, haqni to'lashda garant bo'ladi. Haq to'lashi kerak bo'lgan kishiga qo'shiladi. Qarzga kafil bo'ladimi, yo'qmi, degan savolga ulamolar ikki xil javob berganlar. Kafolat qarzda bo'lmaydi, degan gap kuchli ekaniga 'Muxtasari Viqoya'ning muallifi ishora qilgan. Kafillikning shariatga kiritilishiga Qur'on, Sunnat va Ijmo'dan dalillar bor."
        ]
    },
    {
        "word": "Kafforat ",
        "type": [],
        "definition": [
            "qilingan gunoh uchun evaz to'lash yoki gunoh kechirilishi uchun beriladigan mablag'"
        ]
    },
    {
        "word": "Kafforot",
        "type": [],
        "definition": [
            "Arab tilida 'kafforot' so'zi bir narsani yaxshilab, hech ham ko'rinmaydigan qilib to'sib berkitishga aytiladi. Shariatda esa, sodir etilgan gunohni yuvish uchun ado etiladigan moliyaviy yoki badan ibodatiga 'kafforot' deyiladi."
        ]
    },
    {
        "word": "Kahf surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 110 oyatdan iborat.\r\n     'Kahf' so'zi 'g'or' ma'nosini anglatadi. Suradagi asosiy qissa qahramonlari – Robblariga iymon keltirgan yosh yigitlar o'z zamonlari podshohining zulmidan qochib, iymonlarini saqlash maqsadida g'orga kirib oladilar va o'sha yerda ilohiy mo''jiza sodir bo'ladi. Suraning nomi shundan olingan.\r\n    Kahf surasi Qur'oni Karimdagi 'Al-hamdu' lafzi bilan boshlangan besh suraning biridir.\r\n    Bu surada asosiy urg'u qissalarga berilgan. Bir yuz o'n oyatdan iborat bo'lgan Kahf surasining yetmish bir oyati qissalardan iborat. Surai karimada kahfga kirib olgan yigitlar, ikki bog', Odam va iblis, Muso alayhissalom va solih banda hamda Zulqarnayn qissalari keladi.\r\n    Kahf surasida ham Makkada nozil bo'lgan boshqa suralardagi kabi, aqiydani, fikr va tasavvurni, odob-axloq va qadriyatlarni islomiy yo'lga solishga da'vat yetakchilik qiladi.\r\n    Islom da'vatining mashaqqatli bosqichida – musulmonlarni kofirlar azoblayotgan bir paytda nozil qilingan bu surai karimaning oyatlari, undagi ibratli qissalar agar iymon ahli qiyinchiliklarga bardosh bersa, albatta g'olib bo'lajaklarini anglatadi. Har zamon va har makonda ham iymon ahli sinovga uchrashi, kofirlar vaqtincha ustun kelishi mumkinligini tushuntiradi."
        ]
    },
    {
        "word": "Kashful asror va uddatul abror",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi fors tilidagi tafsirdir"
        ]
    },
    {
        "word": "Kaʼb ibn Zayd",
        "type": [],
        "definition": [
            "a'b ibn Zayd ibn Qays al-Ansoriy. Bu sahoba Badr g'azotida ishtirok etdilar.\r\n    Rasululloh sollallohu alayhi vasallamdan nikoh to'g'risidagi hadisni rivoyat qildilar."
        ]
    },
    {
        "word": "Kaʼb ibn Ujra",
        "type": [],
        "definition": [
            "Ka'b ibn Ujra ibn Umayya ibn Adiy al-Balaviy, kunyalari Abu Muhammad. Ansorlar boshliqlaridan bo'lib, Rasululloh sollallohu alayhi vasallam bilan barcha g'azotu bay'atlarda ishtirok etgan ulug' sahobalardan edilar.\r\n    Rasululloh sollallohu alayhi vasallamdan 47ta hadis rivoyat qildilar. Bu kishidan Ibn Umar, Jobir ibn Abdulloh, Abdulloh ibn Amr ibn Oss, Abdulloh ibn Abbos, Toriq Abu Laylo, Abdulmalik, Muhammad, Robiy', o'g'illari Ishoq va boshqalar rivoyat qilganlar.\r\n    U kishi uchun Qur'onda Baqara surasining 196-oyati nozil bo'lgan.\r\n    Ka'b ibn Ujra Kufada istiqomat qilganlar, hijratning 51-yili 75 yoshlarida Madinada vafot etganlar."
        ]
    },
    {
        "word": "Kaʼba",
        "type": [],
        "definition": [
            "Islom dinining eng muqaddas ibodatxonasi, Allohning uyi."
        ]
    },
    {
        "word": "Keyin kelgan mujtahidlar",
        "type": [],
        "definition": [
            "Abu Yusuf va Muhammad hamda ulardan so'ng kelganlarning ashoblaridir. Ular ko'pchilik bo'lib, xabarlari tabaqot kitoblarida kelgan"
        ]
    },
    {
        "word": "Kibr ",
        "type": [],
        "definition": [
            "mag'rurlik, takabburlik, o'zini katta tutish, g'ururlanish, o'ziga bino qo'yish"
        ]
    },
    {
        "word": "Kiylaja",
        "type": [],
        "definition": [
            "1,934 litr(≈ 2 litr). Og'irligi = 1,530 kg."
        ]
    },
    {
        "word": "Kinda ",
        "type": [],
        "definition": [
            "Kinda – Iroqdagi bir joyning nomi. Shuningdek, Yamanda Kinda degan qabila ham bor. So'zlovchi o'sha qabila vakillari orasida gapirgan bo'lishi ham mumkin."
        ]
    },
    {
        "word": "Kisoiy qiroati",
        "type": [],
        "definition": [
            "Imom Aliy ibn Abdulloh ibn Bahman ibn Feruz Hamza Kisoiy. U kishining kunyasi Abulhasan. U zot hijriy 119 yilda tavallud topib, 189 sanada vafot etgan.\r\n    U kishining ikki roviylari – Abu Horis va Hafs Duriy."
        ]
    },
    {
        "word": "Kitob ",
        "type": [],
        "definition": [
            "'Kitob' so'zi 'yozish' o'zagidan olingan bo'lib, 'yozilgan' ma'nosini anglatadi. Bir to'p yozilgan varaqlarning muqova orasiga olingani 'kitob' deb ishlatib kelingan. Aslida esa, u kengroq ma'noni anglatadi. Qur'oni Karimning nomlaridan biri ham 'Kitob'dir. Islomda 'Allohning kitobida', 'Kitob va Sunnatda' kabi iboralardagi kitob Qur'on demakdir. Shuningdek, Islom adabiyotida bir necha fasl va boblarni o'z ichiga olgan bir mavzu haqidagi ma'lumotlar to'plamini ham 'kitob' deb atash odat bo'lib qolgan. 'Haj kitobi', 'Ro'za kitobi' kabilar shu jumladandir."
        ]
    },
    {
        "word": "Kitobu nafyi tashbih",
        "type": [],
        "definition": [
            "Imom Ahmad ibn Hanbal rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kitobuz-ziyodot",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi."
        ]
    },
    {
        "word": "Kitobul asl",
        "type": [],
        "definition": [
            "Bu kitobning ikkinchi nomi 'Mabsut'. Imom Muhammad rahmatullohi alayhining kitobi."
        ]
    },
    {
        "word": "Kitobul Jomeʼul Kabir",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kitobul Jomeʼus-Sagʻir",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kitobul iymon",
        "type": [],
        "definition": [
            "Imom Ahmad ibn Hanbal rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kitobul Osor",
        "type": [],
        "definition": [
            "Bu kitobni Abu Yusuf rahmatullohi alayhi otasidan, u kishi esa Abu Hanifa rahmatullohi alayhidan rivoyat qilgan. Abu Hanifa rahmatullohi alayhi esa Rasululloh sollallohu alayhi vasallamdan, sahobiydan yoki o'zlari rozi bo'lgan tobe'indan rivoyat qilganlar. Ushbu kitobda tobe'inlar va Iroq faqihlarining ko'pgina fatvolari ham jamlangan"
        ]
    },
    {
        "word": "Kitobul Xaroj",
        "type": [],
        "definition": [
            "Bu o'ta muhim kitobda Abu Yusuf rahmatullohi alayhi Islom davlatining moliyaviy ishlariga sobit nizom tuzganlar. U kishi unda o'z shayxlariga xilof qilgan narsalar ham zikr qilingan."
        ]
    },
    {
        "word": "Kitobur ruh",
        "type": [],
        "definition": [
            "Ibn Qayyumning kitobi"
        ]
    },
    {
        "word": "Kitobur-Raddi ala ahli Madiyna",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kitobur-raddi alal jahmiyya",
        "type": [],
        "definition": [
            "Imom Ahmad ibn Hanbal rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kitobur-raddi alal qadariya",
        "type": [],
        "definition": [
            "Imom Abu Hanifa rahmatullohi alayhning kitoblari"
        ]
    },
    {
        "word": "Kitobus-Siyaril Kabir",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kitobus-Siyaris-Sagʻir ",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Kifayatul-almaʼiy fiy ayati ʼYaa ardublaʼiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari."
        ]
    },
    {
        "word": "Kotib",
        "type": [],
        "definition": [
            "yozuvchi, mirza, amaldor"
        ]
    },
    {
        "word": "Kofir",
        "type": [],
        "definition": [
            "Islom dinini e'tirof etmagan, Allohga ishonmagan, haqiqatni bila turib imon keltirmagan, halolni harom, haromni halol deb da'vo qilgan, og'ir gunoh ishlarni qilgan shaxs"
        ]
    },
    {
        "word": "Kofur ",
        "type": [],
        "definition": [
            "Kofur – musulmon o'lkalarida keng ishlatiladigan xushbo'y modda bo'lib, uni suvga qo'shib mayyitni yuvishga ishlatiladi. Bunda jasad tez qotadi va tez aynimaydi, xushbo'yligida esa inson va farishtalarning ikromi bor."
        ]
    },
    {
        "word": "Kofur al-Quhanduziy",
        "type": [],
        "definition": [
            "Abul Askar Kofur ibn Abdulloh al-Quhanduziy Buxoro 'Quhan¬duz'idan. Buxoro amiri Abul Hasan Nasr ibn Ahmad ibn Ismoil as-Somoniy ozod qilgan qullardan. Abu Abdulloh Muhammad al-Azhariy va Abdulloh ibn Muhammad al-Ustozdan hadis rivoyat qilganlar. Hijriy 376 (milodiy 987) yilda vafot etganlar."
        ]
    },
    {
        "word": "Kohin",
        "type": [],
        "definition": [
            "g'oyibdan xabar beruvchi, folbin, bashoratgo'y"
        ]
    },
    {
        "word": "Kubro",
        "type": [],
        "definition": [
            "katta, yirik, ulkan, azim, ulug'"
        ]
    },
    {
        "word": "Kudo ",
        "type": [],
        "definition": [
            "Kudo – Quyi dovonning chekkasidagi tog' bo'lib, bu dovonni ham gohida shu nom bilan atashgan"
        ]
    },
    {
        "word": "Kulliyot fiy mohiyatil ashyo",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Bu asar risola shaklidagi kichik kitob bo'lib, unda narsalarning mohiyati haqida so'z yuritilgan."
        ]
    },
    {
        "word": "Kunya ",
        "type": [],
        "definition": [
            "Kunya – kishining o'z farzandiga nisbat berilgan holda olgan nomi. Rasululloh sollallohu alayhi vasallamning kunyalari Abul Qosim (Qosimning otasi) bo'lgan."
        ]
    },
    {
        "word": "Kurayb roziyallohu anhu",
        "type": [],
        "definition": [
            "Kurayb ibn Abraha ibn Saboh ibn Marsad al-Asbahiy Yamanning amirlaridan bo'lib, hadis rivoyat qiluvchi tobe'inlardan edilar. Misr fath etilgan kuni va Siffiyn urushida Muoviya bilan birga ishtirok etdilar. Jiyza degan joyda yashab o'tdilar. Hadislarni Huzayfa ibn Yamondan rivoyat qiladilar. Bu kishidan Shomdagi ulug' tobe'inlar rivoyat qilganlar.\r\n    Bu zot hijratning 75-yili vafot etdilar"
        ]
    },
    {
        "word": "Kusti azfor",
        "type": [],
        "definition": [
            "Kusti azfor – Yamandagi Azfor degan joydan keltiriladigan xushbo'ylik. U aslida Hindistondan olib kelinadigan, isiriq kabi tutatiladigan xushbo'y cho'p bo'lgan. Uni maydalab, biror suyuqlikka qo'shib, xushbo'y modda hosil qilingan. Biroq azador ayollarga xushbo'ylanish emas, balki hayz qonining hidini ketkazish uchun g'uslda undan foydalanishga ruxsat berilgan"
        ]
    },
    {
        "word": "Kusuf ",
        "type": [],
        "definition": [
            "'Kusuf' so'zi quyosh tutilishiga ishlatiladi. 'Xusuf' so'zi oy tutilishiga ishlatiladi. Amalda esa, ikkalasi bir-birining o'rniga almashtirilib ishlatilaveradi."
        ]
    },
    {
        "word": "Kufr ",
        "type": [],
        "definition": [
            "imonsizlik, imonning ziddi; satr, to'smoq; inkor etmoq"
        ]
    }
]