[
    {
        "word": "La avvaahun",
        "type": [],
        "definition": [
            "'La avvaahun' - ko'p ohu nolali degani. Muallif oyati karimada kelgan Ibrohim alayhissalomning bu sifati hayiqish va qo'rquv yuzasidan hosil bo'lganini ta'kidlamoqda. Shu bilan birga, undan yasalgan 'ta`avvaha' kalimasi ohu nola qilish ma'nosida kelishiga bir she'rdan dalil keltirmoqda."
        ]
    },
    {
        "word": "Labbod ",
        "type": [],
        "definition": [
            "arabcha so'z bo'lib, namat (kigiz) degan ma'noni anglatadi"
        ]
    },
    {
        "word": "Lavhul mahfuz",
        "type": [],
        "definition": [
            "muhofaza qilingan lavh. Alloh insoniyatning taqdirlarini yozgan ulkan kitob"
        ]
    },
    {
        "word": "Lagʻv ",
        "type": [],
        "definition": [
            "Lag'v – behuda, befoyda gap-so'z va xatti-harakatlar"
        ]
    },
    {
        "word": "Layl surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 21 oyatdan iborat.\r\n    Ushbu surai karimaning nomi ham o'zining birinchi so'zidan olingan. 'Layl' – 'tun' deganidir. Alloh taolo bu surani tun ila qasam ichib boshlaganidan, unga 'Layl' nomi berilgan.\r\n    Bu surada hayotning qarama-qarshi yo'llari bayon qilingan. Sura ikkiga bo'linib, birinchi bo'lagida bir-biridan tubdan farq qiluvchi axloqiy sifatlar keladi. Bir guruh kishilar o'z boyliklarini Alloh taoloning roziligi uchun sarflaydilar, taqvodor bo'lib, qalblarini pok tutadilar, yaxshini yaxshi, yomonni yomon deb biladilar.\r\n    Ikkinchi guruhdagilar esa xasis, baxil, Alloh taolodan qo'rqmaydigan, bandadan uyalmaydiganlar bo'lib, haqiqatni yolg'on, razolatni fazilat deb hisoblaydilar. Albatta, har kim o'z qilmishiga yarasha qiyomatda mukofot yoki jazosini oladi.\r\n    Suraning ikkinchi qismida Alloh taolo insonga to'g'ri yo'lni ko'rsatib qo'ygani, payg'ambarlar, samoviy kitoblar yuborgani eslatiladi.\r\n    Layl surasining avvalida tun, kun va erkagu urg'ochining yaratilishi ila qasam ichilib, odamlarning hatti-harakatlari turlicha bo'lishi ta'kidlanadi.\r\n    So'ngra saodat va shaqovat yo'li bayon qilinadi. Najot izlovchi kishi uchun yurishi lozim bo'lgan yo'l ko'rsatiladi. Yaxshilarning sifatlari qanday bo'ladi-yu, yomonlarning sifati qanday bo'ladi – ochib beriladi.\r\n    Shuningdek, ahli jannat va ahli do'zax vasflari keltiriladi.\r\n    Keyin esa kofir va osiylarning to'plagan molu dunyolari oxiratda hech qanday manfaat bermasligi ajoyib uslub ila aytib o'tiladi.\r\n    Suraning xotimasida solih mo'min kishi qanday bo'lishiga misol keltiriladi."
        ]
    },
    {
        "word": "Lays al-Kamoriy",
        "type": [],
        "definition": [
            "Abu Nasr Lays ibn Abdulloh al-Kamoriy Buxoroning Kamoriy nomli qishlog'idan. Ilyos ibn Kidom al-Buxoriydan hadis rivoyat qilganlar. Bu kishidan esa Abu Amr Ahmad ibn Muhammad al-Muqri hadis rivoyat qilganlar. Hijriy 331 (milodiy 943) yilning muharram oyida vafot etganlar."
        ]
    },
    {
        "word": "Laqiyt ibn Sobira",
        "type": [],
        "definition": [
            "Laqiyt ibn Sobiraning asl ismlari Laqiyt ibn Omir ibn Sobira ibn Abdullohdir. Kunyalari Abu Razin al-Aqaliydir. Bu zot mashhur sahobalardan bo'lib, hadislarni Rasululloh sollallohu alayhi vasallamdan rivoyat qiladilar.\r\n     Bu zotdan o'g'illari Osim ibn Laqiyt, akalarining o'g'li Voqe' ibn Adas, Abdulloh ibn Xojib, Amr ibn Avs as-Saqafiylar rivoyat qilganlar"
        ]
    },
    {
        "word": "Lahv olatlari",
        "type": [],
        "definition": [
            "'Lahv olatlari' deganda musiyqa asboblari va shunga o'xshash o'yin-kulguga ishlatiladigan narsalar ko'zda tutiladi."
        ]
    },
    {
        "word": "Lahyu jamal",
        "type": [],
        "definition": [
            "Lahyu Jamal – Makka bilan Madina o'rtasidagi quduq va uning atrofidagi hudud. U Madinaga yaqin bo'lib, Makkaga yurishda Juhfadan keyin keladi."
        ]
    },
    {
        "word": "Livota",
        "type": [],
        "definition": [
            "Erkak kishi bilan erkak kishining jinsiy aloqada bo'lishi 'livota' deyiladi"
        ]
    },
    {
        "word": "Limos",
        "type": [],
        "definition": [
            "Limos – savdo molini ko'rmasdan, ushlab ko'rish orqali savdo qilib olish. U 'mulomasa' ham deyiladi."
        ]
    },
    {
        "word": "Liʼon",
        "type": [],
        "definition": [
            "'Li'on' so'zi 'la'nat'dan olingan bo'lib la'natlashish ma'nosini anglatadi. Shariatda esa, xotinini zinoda ayblab, guvoh keltira olmagan erning va zinoni rad etgan xotinning qozining oldida bir-birlarini la'natlashlariga aytiladi."
        ]
    },
    {
        "word": "Luboba binti al-Horis",
        "type": [],
        "definition": [
            "Luboba binti Horis ibn Hazn al-Hiloliya fozila ayollardan sanalib, Makkada Xadi'a binti Xuvaylid roziyallohu anhodan so'ng Islomga kirdilar. U kishining kunyalari Ummu Fazl bo'lgan. O'zlari Omir qabilasidan bo'lib, Pay¬g'ambarimiz sollallohu alayhi vasallamning ama¬ki¬lari hazrati Abbos ibn Abdulmuttolib roziyal¬lohu anhuning xotinlari edilar. Hazrati Abbos bolalarining aksariyati shu Luboba binti Horis roziyallohu anhodan tug'ilgan. Hazrati Abbos roziyallohu anhuning Payg'ambarimiz sollallohu alayhi vasallamga xulq va xalq, ya'ni, axloq va tuzilish jihatidan juda ham o'xshash o'g'illari Fazl ibn Abbos roziyallohu anhu edilar. Luboba roziyallohu anhoning bosh farzandlari Fazl ibn Abbos roziyallohu anhu bo'lganligi uchun Ummu Fazl kunyasini olganlar. Shu bilan birga, Luboba binti Horis roziyallohu anho Pay¬g'ambarimiz sollallohu alayhi vasallamning zavjai mutahharalari Maymuna binti Horis onamizning opalaridir. Ya'ni, Luboba binti Horis roziyallohu anho Rasuli Akram sollallohu alayhi vasallamga qayn¬egachi bo'ladilar. Ba'zi rivoyatlarda kelishicha, bu opa-singil Rasululloh sollallohu alayhi vasallamga Xadicha onamizdan ke¬yin birinchi iymon keltirgan ayollar hisoblanadilar. Fazl uchun shuning o'zi yetarli bo'lsa kerak. Bu kishi Payg'ambarimiz sollallohu alayhi vasallamdan ko'p hadis rivoyat qilgan sahobiyalardandir.\r\n    Lubobadan o'g'illari Abdulloh ibn Abbos, Umayr ibn al-Horis, Anas ibn Molik, Qobus, al-Muhariq hamda Abdulloh ibn al-Horis va bosh¬qalar rivoyat qilganlar.\r\n    Ko'rinib turibdiki, qarindoshlik aloqalari tufayli ham Luboba binti Horis roziyallohu anho Rasululloh sollallohu alayhi vasallamning oilalariga tez-tez kelib, u yerdagi narsalardan xabardor bo'lib turganlar. Ko'p hadis rivoyat qilishlarining sabablaridan biri ham shu."
        ]
    },
    {
        "word": "Luqmon surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 34 oyatdan iborat.\r\n    Suraning bunday nomlanishi unda Luqmoni Hakimning qissasi kelgani sababidandir. Bu makkiy surada ham asosan aqiyda masalasi muolaja qilinadi. Xususan, vahdoniyat, payg'ambarlik va qayta tirilish haqida so'z ketadi. Ushbu masalalarda mushriklarning xato tushunchalari turli yo'llar bilan ko'rsatiladi. Ayni chog'da aqiyda, iymon, dinu diyonat masalasida zarur bo'lgan odob-axloq jihatlariga ham alohida e'tibor beriladi. Bular, ayniqsa, hazrati Luqmonning o'g'liga qilgan nasihatlarida yaqqol ko'zga tashlanadi.\r\n    Makkiy suralarda nafaqat 'Laa ilaaha illalloh' masalasiga, balki shu tavhid kalimasini tili bilan aytib, dili bilan tasdiqlagan kishilarning axloqlariga ham e'tibor qilinadi. Ya'ni 'Laa ilaaha illalloh' shiorining sohibi bo'lgan insonning odob-axloqi ham go'zal bo'lishiga katta ahamiyat beriladi.\r\n    Luqmon surasi oxirgi Payg'ambar Muhammad sollallohu alayhi vasallamga nozil bo'lgan abadiy mo''jiza, hikmatli Kitob – Qur'oni Karimdan bahs yuritish bilan boshlanadi. Avval boshda alifbo harflaridan uchtasi keltirilib, ushbu Kitob ham, ushbu sura ham xuddi mana shu harflardan tarkib topganiga va ayni paytda bu Qur'on Allohning mo''jizasi ekaniga ishora qilinadi. Yana boshqa ba'zi sifatlari ham eslatib o'tiladi. So'ngra Alloh taoloning vahdoniyatidan bahs yuritiladi. Bunda Allohning cheksiz qudratiga dalolat qiluvchi borliqdagi mavjudotlarga – osmon, yer, quyosh, oy, kecha, kunduz, tog', dengiz, dov-daraxt va boshqalarga e'tibor bilan nazar solishga da'vat etiladi.\r\n    Tabiat hodisalari haqidagi bahsdan so'ng odamning o'zidagi ajoyibotlardan so'z ochiladi. Luqmoni Hakimning o'g'liga qilgan nasihatlari keltiriladi. Bu nasihatlarning asosiy markazida ham shirk masalasi muolaja qilinadi. Luqmoni Hakim o'z nasihatlarini o'g'lini shirkdan qaytarish va shirkning katta zulm ekanini bayon qilish bilan boshlaydi. Iymon-e'tiqod, dinu diyonat masalasi qon-qarindoshlik munosabatlaridan ustun ekani ham bayon etiladi. Shuningdek, bu nasihatlarda iymon sohibi yo'liqishi mumkin bo'lgan qiyinchiliklar va ularga nisbatan sabr-matonatli bo'lish lozimligi zikr qilinadi.\r\n    Keyin esa aqiyda masalasi osmonlaru yerga va ulardagi ne'matlarga nisbatan inson munosabati nuqtai nazaridan kelib chiqib muolaja qilinadi. Alloh taolo osmonlaru yerni inson uchun yaratdimi, demak, inson unga shukr qilmog'i lozim. Allohga shukr qilish esa Unga iymon keltirib, ibodat etish bilan ro'yobga chiqadi.\r\n    Suraning oxirida kechayu kunduzga, quyoshu oyga razm solib, ibrat ko'zi bilan boqib, ulardan xulosa chiqarib, Alloh taoloning cheksiz qudrati va vahdoniyatini anglab olish zarurligi eslatiladi. Qiyomat kuni dahshatidan ogohlantiriladi."
        ]
    },
    {
        "word": "Lungi",
        "type": [],
        "definition": [
            "'Lungi' erkak kishi belidan pastiga tutib oladigan choyshabga o'xshash narsa, arabchada 'izor' deyiladi. Bu kiyim issiq o'lkalarda keng tarqalgan."
        ]
    },
    {
        "word": "Lut alayhissalom",
        "type": [],
        "definition": [
            "Payg'ambarlarning mashhurlaridan bo'lmish Lut alayhissalom Ibrohim alayhissalomning akalari Horonning o'g'li edilar. Ya'ni Ibrohim alayhissalom Lut alayhissalomga amaki bo'ladilar. Alloh taolo u zotni ham Ibrohim alayhissalomning zamonlarida payg'ambar qilib yuborgan.\r\n    Dastlab Lut alayhissalom ham Ibrohim alayhissalomga iymon keltirib, u zotning yo'lidan yurganlar. Keyinchalik Lut alayhissalom amakilari Ibrohim alayhissalomning iznlari bilan Urdunning (Iordaniya) Sadum degan joyiga ketdilar.\r\n    Shunday qilib Alloh taoloning izni bilan ular O'lik dengiz atrofidagi Sadum nomli shahar hamda uning atrofidagi aholi yashaydigan joylarda istiqomat qildilar va o'sha yer aholisiga payg'ambar etib yuborildilar.\r\n    Lut alayhissalom payg'ambar bo'lib kelgan Sadum shahrining aholisi dunyodagi eng yomon gunohlardan biriga mubtalo bo'lishgan edi. Ular bachchabozlik bilan shug'ullanishardi. Lut alayhissalomning asosiy vazifalaridan biri ularni shu qabih ishdan qaytarish bo'ldi.\r\n    Alloh taolo Ankabut surasida bu haqda quyidagilarni aytadi:\r\n    '...va Lutni (ham yubordik). O'shanda u o'z qavmiga dedi: 'Siz o'zingizdan oldin o'tgan olamlardan hech kim qilmagan fahsh ishni qilmoqdasiz' (28-oyat).\r\n    Bu fahsh ish nima ekani hammaga ma'lum. Bu qavm jinsiy buzuqlikka mukkasidan ketgan edi. Ushbu oyatda mazkur buzuqlikni Lut qavmidan oldin insoniyat tarixida hech kim qilmagani ham ta'kidlanmoqda. Keyingi oyatda Lut alayhissalom mazkur fahsh ishni ochiq bayon etadilar:\r\n    'Sizlar erkaklarga yaqinlik qilib, yo'lni kesasizmi va yig'inlaringizda munkar ish qilasizmi?!' Qavmining javobi 'Agar rostgo'ylardan bo'lsang, bizga Allohning azobini keltir', deyishdan boshqa bo'lmadi' (29-oyat).\r\n    Lut qavmi bu ishga juda berilganidan mazkur qabohatni to'p-to'p bo'lib olib, ochiqchasiga qilishar edi. Ular na o'zlaridan, na boshqalardan uyalishardi.\r\n    Bu ishlari oddiy fahsh emas, balki o'taketgan yovuzlik, insoniylik doirasidan chiqib ketish edi. Shu darajada tubanlikka yetganlar darhol tavba qilib, o'zlarini o'nglamasalar, oqibati yomon bo'lishi aniq edi.\r\n    Shuning uchun ham Lut alayhissalom o'z qavmlarini yuqoridagi gaplar bilan bu yo'ldan qaytishga da'vat qildilar. Xo'sh, qavm bu da'vatga qanday javob berdi?\r\n    'Qavmining javobi 'Agar rostgo'ylardan bo'lsang, bizga Allohning azobini keltir', deyishdan boshqa bo'lmadi'.\r\n    Tabiati buzilib, hirsga berilgan bu buzuq qavmga o'zlaridan chiqqan payg'ambar – Lut alayhissalomning da'vati zarracha ham ta'sir qilmadi. Aksincha, tug'yonga ketgan qavm o'z payg'ambariga istehzo bilan: 'Agar gaping rost bo'lsa, bizga Allohning azobini keltir', deyishdi. Bu hol Lut alayhissalom uchun katta sinov bo'ldi. Shahvoniy lazzatga berilgan qavmning iymon va dinu diyonat bilan ham, Allohning amri va payg'ambarning da'vati bilan ham hech qanday ishi yo'q edi. Ular qilayotgan gunohlari uchun azob kelishidan ham qo'rqmay qo'yishgandi. Ana o'shanda Lut alayhissalomning Alloh taologa yolvorishdan boshqa choralari qolmadi:\r\n    'Robbim, menga buzg'unchi qavmlarga qarshi O'zing nusrat ber', dedi' (30-oyat).\r\n    Bu buzg'unchi qavmga hech qanday nasihat, da'vat foyda bermadi. Endi ularga qarshi Allohning O'zi nusrat bermasa, boshqa iloj yo'q edi.\r\n    Azob farishtalarining yuborilishi va jinoyatchi qavmning halokati\r\n    Alloh taolo Lut alayhissalomning bu duolarini qabul etdi. Qavmni halok qilish uchun farishtalarni yubordi.\r\n    Lut alayhissalomning xonadonlariga yosh, xushro'y yigitlar suratida kelgan mehmonlar bilan bachchabozlik qilish niyatida u zotning uylariga yopirilib kelgan fahshboz qavm ularning o'zlariga topshirilishini talab qildi. Payg'ambar Lut alayhissalom qavmni bu maqsaddan qaytarishga ko'p urindilar, hech foyda bermadi.\r\n    Yigitlardan biri tashqariga chiqib, ba'zi bir harakatlar qildi. Shunda buzuq qavmning ko'zlari ko'r bo'lib qoldi va tumtaraqay bo'lib, kelgan joylariga qaytib ketish uchun yo'l axtarib qolishdi.\r\n    Yosh yigitlar o'zlarini himoya qila olmaydigan mehmonlar emas, balki Allohning elchilari – mazkur jinoyatchi qavmni halok qilish uchun yuborilgan kuchli farishtalar edi. Ular Lut alayhissalomga u zotning mustahkam panohda – Alloh taoloning himoyasida ekanlarini eslatdilar.\r\n    E'tibor va mulohaza bilan qaraladigan bo'lsa, ko'p halokatlar subh vaqtida yuz berishi ma'lum bo'ladi. Bu paytni Alloh taolo barakali qilib qo'ygan. Lekin gunohkor va kofir qavmlar kechasi bilan gunoh ishlarni qilib, ayni tong – subh chog'ida g'aflat uyqusiga ketishgan bo'ladi.\r\n    Mazkur diyorning nomi Sadum bo'lib, rivoyatlarda kelishicha, Allohning amri ila farishtalar Sadumni borligicha ko'tarib, chappasiga, ya'ni yerning ostini ustiga aylantirib qo'yganlar. Sadum butun aholisi va bor-yo'g'i bilan yer ostiga ko'milgan."
        ]
    }
]