[
    {
        "word": "Maaʼuun surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 7 oyatdan iborat.\r\nUshbu surai karimaning nomi o'zining oxirgi so'zidan olingandir. 'Maa'uun' so'zi haqida ulamolarimiz bir necha xil ma'nolarni aytganlar. Avvalo, ulamolarimiz lug'aviy jihatdan 'maa'uun' lafzi 'oz, arzimagan narsa' degan ma'noni anglatishini aytishgan. Bu suradagi ma'no haqida esa ba'zilari, 'maa'uun'dan murod zakot, boshqalari, xo'jalikda kerak bo'lib turadigan asbob-anjomlar, deyishgan.\r\nBu surai karima dinga e'tiqodi yo'q, oxiratdan umidi yo'q odamning alomatlarini bayon qiladi. So'ngra ba'zi bir Islom amallarini ado etib yuruvchi, masalan, namoz o'qib yuruvchi, lekin o'zi Islom haqiqatidan uzoq shaxslar haqida so'z yuritadi.\r\nMaa'uun surasi o'zi qisqa bo'lishiga qaramay, ulkan haqiqatni – iymon va kufr haqidagi tushunchani muolaja qildi."
        ]
    },
    {
        "word": "Mabrur haj",
        "type": [],
        "definition": [
            "Mabrur haj – barcha arkonlariga rioya etib ado qilingan maqbul haj"
        ]
    },
    {
        "word": "Mabtuta ",
        "type": [],
        "definition": [
            "Mabtuta – boin taloq qilingan ayol"
        ]
    },
    {
        "word": "Mavzuʼ ",
        "type": [],
        "definition": [
            "to'qilgan hadis, yolg'on hadis, sun'iy ravishda keltirilgan va hadisga nisbat berilgan xabar"
        ]
    },
    {
        "word": "Mavquf ",
        "type": [],
        "definition": [
            "sahobiyga izofa berilgan so'z, fe'l yoki taqrir"
        ]
    },
    {
        "word": "Mavlo ",
        "type": [],
        "definition": [
            "Mavlo tushunchasi ham avvalgi paytlarda bo'lgan. 'Mavlo'–ozod qilingan qul yoki birovning qo'lida islomni qabul qilgan shaxs bo'lishi mumkin."
        ]
    },
    {
        "word": "Mavlolari ",
        "type": [],
        "definition": [
            "rahnamo, homiy, janob; bir shaxsni yoki uning ota-bobolaridan birini biror kishi qullikdan ozod qilsa, ozod qiluvchiga ham ozod qilinganga ham “mavlo” deyiladi"
        ]
    },
    {
        "word": "Mavlono ",
        "type": [],
        "definition": [
            "bizning janob, bizning xo'jayin."
        ]
    },
    {
        "word": "Mavhum ",
        "type": [],
        "definition": [
            "noma'lum, noaniq."
        ]
    },
    {
        "word": "Mavʼiza ",
        "type": [],
        "definition": [
            "Ma'ruza"
        ]
    },
    {
        "word": "Madrasa ",
        "type": [],
        "definition": [
            "dars o'qitiladigan joy, darsxona, diniy o'quv yurti."
        ]
    },
    {
        "word": "Majanna ",
        "type": [],
        "definition": [
            "Majanna – Qadimgi Makka shahridan taxminan bir barid masofadagi, Ukoz bozori yaqinida joylashgan suv havzasining nomi (bir barid taxminan 55,44 km). U yerda shu nom bilan atalgan bozor ham bo'lgan."
        ]
    },
    {
        "word": "Majlis ",
        "type": [],
        "definition": [
            "o'tirish joyi; kengash, yig'ilish, ilmiy bahs-munozara yoki diniy darslar o'tkaziladigan yig'in"
        ]
    },
    {
        "word": "Majmaʼul navozil",
        "type": [],
        "definition": [
            "Notifiyning kitobi"
        ]
    },
    {
        "word": "Majnun ",
        "type": [],
        "definition": [
            "jinni, devona, savdoyi."
        ]
    },
    {
        "word": "Majusiy",
        "type": [],
        "definition": [
            "quyosh yoki olovga sig'inuvchi odam."
        ]
    },
    {
        "word": "Maziy ",
        "type": [],
        "definition": [
            "Erkak kishining jinsiy a'zosidan jinsiy aloqani o'ylagan yoki xotinini quchoqlagan paytda chiqadigan oq suyuqlik."
        ]
    },
    {
        "word": "Mazlum ",
        "type": [],
        "definition": [
            "zulm ko'rgan."
        ]
    },
    {
        "word": "Mazoda ",
        "type": [],
        "definition": [
            "Mazoda, satiyha – ikkita terini bir-biriga ulab tikilgan katta meshkob, u asosan safarga mo'ljallangan suv idishi bo'lgan"
        ]
    },
    {
        "word": "Mazhab",
        "type": [],
        "definition": [
            "yo'nalish, oqim, yo'l, ta'limot. Islomda diniy huquq tizimlari va yo'nalishlari"
        ]
    },
    {
        "word": "Mazhab mujtahidlari tabaqasi",
        "type": [],
        "definition": [
            "Hanafiy faqihlari ikkinchi tabaqasi"
        ]
    },
    {
        "word": "Maymuna roziyallohu anho",
        "type": [],
        "definition": [
            "Mo'minlarning onasi Maymuna binti Horis ibn Hazn al-Hiloliya.\r\nBu fozila ayol johiliyat davrida Mas'ud ibn Amr ibn Umayr Saqafiy bilan turmush qurgan edilar. So'ng u kishidan ajrashib ketdilar va Abu Ruhm ibn Abdulizza ibn Abu Qaysga turmushga chiqdilar. Ko'p o'tmay, Abu Ruhm vafot etib, hazrati Maymuna beva qoldilar.\r\nPayg'ambarimiz sollallohu alayhi vasallam Makkani fath qilganlaridan Maymuna nihoyatda xursand edilar. Bir kuni opalari Ummu Fazlga Rasululloh sollallohu alayhi vasallamga bo'lgan cheksiz muhabbatlari haqida so'zladilar. Ular Xadicha onamizdan so'ng Islomni qabul qilgan ayollar edilar. Ummu Fazl Abbosga:\r\n'Rasululloh sollallohu alayhi vasallamga borib, 'Maymuna sizga qo'lini beryapti', deb ayting', dedilar. Abbos bunday sovchilik qilishga Rasululloh sollallohu alayhi vasallamdan tortinib, o'zlari bormay, akalarining o'g'lini yubordilar. Shundan keyin Rasululloh sollallohu alayhi vasallam Maymuna onamizga to'rt yuz (besh yuz, deganlar ham bor) dirham mahr berib, uylandilar. Bu ish yettinchi hijriy sanada sodir bo'ldi.\r\nMaymuna onamiz Rasuli Akram sollallohu alayhi vasallamning oxirgi uylangan ayollari edilar.\r\nIbn Shihob aytadilar: 'Maymuna onamiz o'zlarini Rasululloh sollallohu alayhi vasallamga hiba qilgan edilar. Shuningdek, Qatoda ham 'Alloh taolo Maymuna haqida 'Mo'mina ayol o'zini Payg'ambarga hiba qildi' degan oyati karimani nozil qildi', deydilar.\r\nHazrati Maymuna Rasuli Akram sollallohu alayhi vasallamdan 76ta hadisi sharif rivoyat qildilar. Shulardan bittasiga Imom Buxoriy va beshtasiga Imom Muslim yakka holda, yettitasiga birgalikda ittifoq qilishdi. Maymuna onamizdan opa-singillarining o'g'illari: Abdulloh ibn Abbos, Yaziyd ibn Madad ibn al-Had, Abdurrahmon ibn as-Saib al-Xalamiy, Yaziyd ibn al-Asom va Ubaydulloh al-Javlaniy, Sulaymon ibn Yasar, Ibrohim ibn Abdulloh ibn Ma'bad, Karib Mavlii ibn Abbos, Ubayda ibn as-Siboq va Oliya binti Sobi' va boshqalar rivoyat qilganlar.\r\nMaymuna onamizning vafot etgan yillari to'g'risida ixtilof bor. Ibn Sa'd va al-Hakimning aytishlariga qaraganda, u kishi vafot etganlarida yoshlari sakson birda edi."
        ]
    },
    {
        "word": "Makka ",
        "type": [],
        "definition": [
            "Makka - ulug', muqaddas shahar. Alloh taolo uning nomi bilan Qur'oni Karimda qasam ichgan. O'zining uyi bo'lmish Ka'baning shu shaharda qaror topishini iroda qilgan. Oxirzamon Payg'ambari Muhammad alayhissalomning ham shu shaharda dunyoga kelishlarini xohlagan. Oxirgi kitobi Qur'oni Karim oyatlarini tushirishni ham shu shaharda boshlagan. Bu shaharni Alloh taolo Qur'oni Karimda 'ummul Quro' 'shaharlarning onasi' deb atagan. Har bir musulmon uchun aziz va mukarram bo'lgan Bu muqaddas shaharga safar qilish, Har kuni namozlarida necha bor yuzlarini to'g'rilayotgan qiblani tavof etish cheksiz baxtdir."
        ]
    },
    {
        "word": "Makkiy al-Bardaiy",
        "type": [],
        "definition": [
            "Abu Bakr Makkiy ibn Ahmad al-Bardaiy Samarqand muhaddislaridan ta'lim olganlar. Samarqandda imlo majlisining ishtirokchilaridan edilar. Hadis ilmi talabida ko'p safarda bo'lgan mashhur muhaddislardan. Hijriy 302 (milodiy 915) yilda Nishopurga, hijriy 350 (milodiy 962) yilda Movarounnahrga kelganlar. Hijriy 354 (milodiy 966) yili Shoshda vafot etganlar."
        ]
    },
    {
        "word": "Makkuk ",
        "type": [],
        "definition": [
            "4,125 litr. Og'irligi = 3,264 kg(= 1,5 so' = 3 qist = 4 mann = 6 mudd = 6 katta hovuch miqdori = 8 iroqiy ratl)."
        ]
    },
    {
        "word": "Makonat ",
        "type": [],
        "definition": [
            "Makonat – martaba, mavqe', obro'-e'tiborga ega bo'lish, birovning qalbidan o'rin olish, mehrini qozonish. Bu yerda Ibn Abbos roziyallohu anhumo o'zining Nabiy alayhissalomning huzurlaridagi makonatlarini nazarda tutmoqdalar"
        ]
    },
    {
        "word": "Makruh ",
        "type": [],
        "definition": [
            "rad etilgan, qoralangan, nomaqbul. Shariat hukmlaridan biri, jazoga sabab bo'lmaydigan, ammo islom qonun va me'yorlariga uyg'un kelmaydigan nomaqbul hisoblangan amal. Shariatda haromdan biroz yengil hisoblangan amal"
        ]
    },
    {
        "word": "Makruh roʻza",
        "type": [],
        "definition": [
            "Bu xildagi ro'zani hanafiy mazhabida makruhi tanzihiy ham deyiladi. Ular quyidagilardir: 1. Oshuro kunining yolg'iz o'zining ro'zasini tutish. 2. Juma kunining yolg'iz o'zining ro'zasini tutish. 3. Shanba kunining yolg'iz o'zining ro'zasini tutish. 4. Navro'z kuni ro'za tutish. 5. Mehrijon kuni ro'za tutish. 6. Har kuni ro'za tutish. 7. Gapirmasdan ro'za tutish. 8. Ulab ro'za tutish. 9. Musofirning qiynalib ro'za tutishi."
        ]
    },
    {
        "word": "Makruhi tanzihiy",
        "type": [],
        "definition": [
            "Ozodalik makruhi. Shariat tark qilishni jazm bo'lmagan va uqubat tayin qilmagan holda talab qilgan narsa makruhi tanzihiydir. Bunga mushuk va yirtqich qushlar tekkan suvdan toharat qilish, sunnati muakkada ishlarni tark qilishlar misol bo'ladi."
        ]
    },
    {
        "word": "Makruhi tahrimiy",
        "type": [],
        "definition": [
            "Harom hisoblanadigan makruh. Shariat (ohod xabarlarda) qat'iy bo'lmagan dalil ila tark qilishni jazm ila talab qilgan narsa makruhi tahrimiy bo'ladi. Bunga birovning savdosi ustiga savdo qilish yoki sovchiligi ustiga sovchilik qilish, erkaklarning ipak yoki tillo iste'mol qilishi kabi ishlar misol bo'ladi. Hanafiylarda makruhi tahrimiyni qisqa qilib 'makruh' deb qo'yiladi. Ularning nazdida makruhi tahrimiy haromga juda yaqin narsa hisoblanadi. Ammo uni inkor qilgan kishi kofir bo'lmaydi."
        ]
    },
    {
        "word": "Maqolotul islomiyyin",
        "type": [],
        "definition": [
            "Imom Abul hasan al-Ash'ariy rahmatullohi alayhining bu kitoblarida Ahli sunna va jamoaning aqiydasini bayon qilib bergan"
        ]
    },
    {
        "word": "Maqomat ",
        "type": [],
        "definition": [
            "daraja, pog'ona, martaba"
        ]
    },
    {
        "word": "Maqomi Ibrohim",
        "type": [],
        "definition": [
            "Baytulloh yonidagi shu nomdagi belgili joy. Tavof tugagandan keyin 'Maqomi Ibrohim' yoki unga yaqin bir yerda ikki rakat namoz o'qiladi. Birinchi rakatda 'Fotiha' surasidan keyin 'Kaafipyn' surasini, ikkinchi rakatda esa, 'Ixloc' surasini o'qish tavsiya etilgan"
        ]
    },
    {
        "word": "Maqomi Mahmud",
        "type": [],
        "definition": [
            "'Maqomi Mahmud' – maqtalgan maqom Alloh taoloning 'Shoyadki, Robbing seni Maqomi Mahmudda qayta tiriltirsa' oyati ila Alloh taolo tomonidan Muhammad sollallohu alayhi vasallamga va'da qilingan. Maqomi Mahmud–buyuk shafoat maqomidir."
        ]
    },
    {
        "word": "Maqʼad ",
        "type": [],
        "definition": [
            "Maq'ad – orqa taraf, dumba"
        ]
    },
    {
        "word": "Maloika ",
        "type": [],
        "definition": [
            "'Maloika' (Farishtalar) – Fotir surasining yana bir nomi."
        ]
    },
    {
        "word": "Mandub",
        "type": [],
        "definition": [
            "tavsiya etilgan, lozim topilgan."
        ]
    },
    {
        "word": "Mandub yoki mustahab roʻza",
        "type": [],
        "definition": [
            "Rasululloh sollallohu alayhi vasallam bardavom tutmagan ixtiyoriy ro'za. 1. Bir kun tutib, bir kun ochib yurish. 2. Har oydan uch kun tutish. 3. Haftaning dushanba va payshanba kunlarini tutish. 4. Shavvoldan olti kun tutish. 5. Arafa kunini tutish. 6. Arafadan oldingi sakkiz kunni tutish. 7. Sha'bon oyida tutish."
        ]
    },
    {
        "word": "Maniy ",
        "type": [],
        "definition": [
            "Shahvat shiddatlashgan paytda otilib chiqadigan suyuqlikdir."
        ]
    },
    {
        "word": "Manih al-Buxoriy an-Nahliy",
        "type": [],
        "definition": [
            "Manih ibn Sayf al-Buxoriy an-Nahliy Musayyab ibn Ishoq, Ahmad ibn Hafs, Muxtor ibn Sobiq, Muhammad ibn Salom al-Paykandiy va Hibbon ibn Musodan ta'lim olganlar. Bu kishi haqlarida Abu Abdulloh al-G'unjor al-Hofiz 'Tarixi Buxoro' kitoblarida zikr qilganlar. Hijriy 264 (milodiy 878) yilda vafot etganlar."
        ]
    },
    {
        "word": "Mann ",
        "type": [],
        "definition": [
            ") mann yoki Mano (botmon) = 1,03125 litr(≈ 1,04 litr). Og'irligi = 816 gr(= 2 iroqiy ratl).\r\n2) 'Mann' so'zi aslida 'ne'mat', 'in'om' degan ma'nolarni anglatadi va bu yerda Banu Isroilga tushirilgan yegulikni bildiradi. Shuning uchun 'Yer osti qo'ziqorini manning bir turidir', degan jumlani 'Banu Isroilga tushirilgan mazkur yeguliklardan biri yer osti qo'ziqorini edi', deb tushunish ham, 'Yer osti qo'ziqorini Allohninng beminnat ne'matlaridan biri', deb tushunish ham mumkin. Uning bunday xoslanishining sababi shundaki, u insonlarga xuddi Banu Isroilga osmondan tushirilgan mann kabi hech qanday mehnat-mashaqqatsiz ato etilgandir."
        ]
    },
    {
        "word": "Manoqib ",
        "type": [],
        "definition": [
            "'Manoqib' so'zi 'manqobatun'ning ko'plik shakli bo'lib, kishiga maqtov, izzat-obro' keltiradigan, taqdirlashga sazovor xislatlarga aytiladi. Boshqacha qilib aytganda, bu 'fazilatlar' deganidir."
        ]
    },
    {
        "word": "Manosiʼ ",
        "type": [],
        "definition": [
            "'Manosi'' deb baland va keng joyga aytiladi"
        ]
    },
    {
        "word": "Mansur al-Barsaxiy",
        "type": [],
        "definition": [
            "Abu Bakr Mansur al-Barsaxiy Barsaxon qishlog'idan. Bu kishi 'Tarixi Buxoro' kitobining muallifi bo'lib, quloqlari eshitmas edi. Shofe'iy mazhabida edilar. Abu Komil al-Basiriyning ustozlaridan. Abu Solih Xalaf ibn Muhammad al-Xayyom va Abu Homid al-Karminiydan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Mansur al-Muhtasib",
        "type": [],
        "definition": [
            "Abu Nasr Mansur ibn Muhammad al-Muhtasib ham Buxoro olimlaridan. Buxoroda ancha muddat muhtasib bo'lganlar. Buxoro va Marvda hadislar yozib olib, ularni jamlab, tasnif etganlar. Shom va Iroq mashoyixlaridan ta'lim olganlar. Taqvodor olimlardan bo'lganlar. Shom, Iroq, Xuroson, Movarounnahr muhaddislaridan hadislar rivoyat qilganlar. O'zlaridan esa Abu Sa'd al-Idrisiy al-Hofiz va Abu Abdulloh al-G'unjor al-Hofiz hadis rivoyat qilganlar. Hijriy 381 (milodiy 992) yili Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Mansur al-Harbiy al-Buxoriy al-Muhtasib",
        "type": [],
        "definition": [
            "Abu Nasr Mansur ibn Muhammad al-Harbiy al-Buxoriy al-Muhtasib Buxoro olimlaridan. Farg'onada qozilik qilganlar, keyinchalik Buxoroda muhtasib (shariatga xilof ishlarni tekshiruvchi) bo'lib ishlaganlar. Muhammad ibn Yusuf, Abu Naim Abdulmalik ibn Muhammad al-Astrobodiy, Ahmad ibn Sulaymon ad-Dimashqiy va Shom, Misr, Iroq, Xurosonning boshqa olimlaridan ta'lim olganlar. Bu kishi ko'p hadis bilar edilar. Karomatlari ham bor edi. Hijriy 381 (milodiy 992) yil jumodul oxir oyining o'n yettinchisida, seshanba kuni Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Mansur as-Sulamiy as-Surmoriy",
        "type": [],
        "definition": [
            "Abu Talha Mansur ibn Salim as-Sulamiy as-Surmoriy - Buxoroning Surmoro qishlog'idan bo'lib, nomlari eslatilgan Abu Safvon Ishoq ibn Ahmad as-Surmoriydan hadis rivoyat qilganlar. O'zlaridan esa Abul Husayn Muhammad ibn Nasr as-Surmoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Mansur ash-Shahrastoniy",
        "type": [],
        "definition": [
            "Abul Qosim Mansur ibn Nuh ash-Shahrastoniy 'Shayx ul-huffoz' (Hadis hofizlarining shayxi) unvoni bilan mashhur Abul Hasan Umar ibn Abdulkarim ar-Ravvosiy va Abul Xayr ibn Rifoa al-Hoshimiy az-Zaynabiydan hijriy 483 (milodiy 1091) yilning sha'bon oyida ta'lim olganlar. O'zlaridan esa o'g'illari Abu Mansur Muhammad ta'lim olganlar"
        ]
    },
    {
        "word": "Mansux ",
        "type": [],
        "definition": [
            "bekor qilingan; o'chirilgan. Avvalgi hukmning keyingisi bilan bekor qilinishi. Qur'onning ayrim oyatlarini bilan ayrim oyatlarining, ba'zi hadislar bilan ba'zi hadislarning amaldan qolishi. Shu kabi oyat va hadis – “mansux”, uni bekor qiluvchi esa – “nosix” deb ataladi."
        ]
    },
    {
        "word": "Mantiq ",
        "type": [],
        "definition": [
            "balog'at ilmi, fasohat bilan so'zlash"
        ]
    },
    {
        "word": "Marsiya ",
        "type": [],
        "definition": [
            "inson vafot etganda uning yaxshiliklarini eslab aytiladigan she'r"
        ]
    },
    {
        "word": "Marfuʼ ",
        "type": [],
        "definition": [
            "Marfu' – Nabiy sollallohu alayhi vasallamga izofa qilingan so'z, fe'l, taqrir yoki sifatdir"
        ]
    },
    {
        "word": "Maryam surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 98 oyatdan iborat.\r\nUshbu surai karima onamiz Bibi Maryam sharaflariga 'Maryam' deb nomlangan bo'lib, surada ul zotning va zurriyotlari Iyso alayhissalomning qissalari alohida zikr etilgandir.\r\nBoshqa makkiy suralar kabi, Maryam surasida ham tavhid masalasi bosh o'rinni tutadi. Aqiyda masalalariga alohida e'tibor beriladi. Alloh taoloning biru borligi, qayta tirilishning va qiyomat kunidagi hisob-kitobning haqligi, hidoyat va zalolat ahllarining yo'llari kabi mavzular muolaja etiladi.\r\nO'tgan ummatlar qismati bayoni suraning asosini tashkil etadi. Sura avvalida Zakariyo alayhissalomning qissalari, so'ngra Yahyo alayhissalom qissalari zikr qilinadi. Nihoyat, sura muborak ismlari bilan atalgan onamiz Bibi Maryamning ajoyib va g'aroyib taqdirlari – Iyso alayhissalomning otasiz tavallud topishlari, tug'ilganlaridan keyingi hodisotlar birin-ketin bayon etiladi.\r\nShuningdek, surai karimada Allohning ulug' payg'ambarlaridan Ibrohim alayhissalomning tarixlari, ul zot bilan otalari orasida bo'lib o'tgan mojarolar, nihoyat, u zot alayhissalomning o'z yurtlarini tark etib ketishlari hikoya qilinadi. So'ngra navbat Muso alayhissalomning qissalariga kelib, undan keyin Ismoil alayhissalom va pirovard Idris alayhissalom haqlarida so'z yuritiladi. Mazkur payg'ambarlar tarixi suraning uchdan ikki qismini tashkil qiladi. Bundan muddao payg'ambarlik va payg'ambarlarning asllari va maqsadlari birligi, shuningdek, vazifalari ham mushtarak bo'lib, kishilarni iymon-e'tiqod va solih amallar ijrosiga da'vat qilishdan iborat ekanini bashariyatga anglatishdir. Surada qiyomat sahnasidan ayrim lavhalar, odamlarning dahshatli kundagi ahvolotlari, xususan, kofir qavmning jahannamda o'tin kabi yoqilg'i bo'lishlari ta'riflanadi.\r\nSuraning xotimasida Alloh taoloning farzandi, sherigi yoki tengdoshi zinhor yo'qligi ta'kidlanib, mushriklar qavmining bu boradagi shak-shubhalari rad etiladi."
        ]
    },
    {
        "word": "Masad surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 5 oyatdan iborat.\r\nBu surai karimaga o'zining oxirgi 'Masad' so'zi nom bo'lib qolgan. Suraning ikkinchi ismi 'Lahab'dir. Ko'pchilik uni suraning avvalidagi birinchi ibora – 'Tabbat yadaa' bilan ham ataydi. 'Masad' so'zining ma'nosi 'arqon'dir. Surada Abu Lahabning xotini bo'ynida arqon ila do'zaxga kirishi ta'kidlangan.\r\nUshbu suraning qahramoni Abu Lahabning asl ismi Abduluzzo ibn Abdulmuttolib bo'lib, ikki yonog'i olovdek qizarib turgani uchun Abu Lahab degan kunya olgan edi.\r\nAlloh taolo 'Va yaqinlaringni ogohlantir' degan oyatni nozil qilganda, Nabiy sollallohu alayhi vasallam Safo tepaligiga chiqib, baland ovoz bilan:\r\n– Ey Quraysh jamoasi! – deb nido qildilar. Shunda ular to'planishdi. Ul zot ularga qarab: – Agar sizlarga hozir 'Vodiyda otliqlar ustingizga bostirib kelishga tayyor turibdilar', desam, ishonasizlarmi? – dedilar.\r\nTo'planganlar:\r\n– Ishonamiz, sening yolg'on gapirganingni hech ko'rmaganmiz, – deyishdi. Payg'ambar sollallohu alayhi vasallam:\r\n– Albatta, men sizlarga shiddatli azobdan qo'rqituvchi (payg'ambar) bo'lib keldim, – dedilar. Shunda Abu Lahab:\r\n– Halok bo'lgur! Bizni shunga yig'dingmi?! – degandan so'ng Alloh taolo Masad surasini nozil qilgan.\r\nAbu Lahab Payg'ambar sollallohu alayhi vasallamning amakilari va eng ashaddiy dushmanlaridir. Uni boyligi, mol-mulki g'ururga ketkazgan. U shunday sinf vakiliki, ular o'zlariga vazifa yuklovchi barcha harakat va tuzumlarga qarshi chiqaverishadi.\r\nAbu Lahabning xotini Ummi Jamil ham Islomning ashaddiy dushmanlaridan biri bo'lib, Nabiy alayhissalom haqida turli bo'hton va tuhmatlar tarqatib yurardi. U ham chaqimchilik, g'iybatchilikka o'ch, fitnachi ayollar toifasining vakilasi."
        ]
    },
    {
        "word": "Masbuq ",
        "type": [],
        "definition": [
            "Namoz boshlangandan keyin kelib qo'shilgan odamni 'masbuq' deyiladi"
        ]
    },
    {
        "word": "Masjid",
        "type": [],
        "definition": [
            "sajda qilinadigan, namoz o'qiladigan joy, ibodatxona"
        ]
    },
    {
        "word": "Masjidi aqso",
        "type": [],
        "definition": [
            "uzoqdagi masjid. Quddus shahridagi yahudiylik an'anasida muqaddas hisoblangan qadimiy ibodatxona (Sulaymon ibodatxonasi). Qur'onda shu nom bilan tilga olingan. Musulmonlarning ilk qiblasi."
        ]
    },
    {
        "word": "Masjidi nabaviy",
        "type": [],
        "definition": [
            "Madinai munavvaradagi payg'ambar alayhissalomning masjidlari"
        ]
    },
    {
        "word": "Masjidi harom",
        "type": [],
        "definition": [
            "Makkai mukarramadagi masjid. Ka'ba ana shu masjid ichida joylashgan"
        ]
    },
    {
        "word": "Maslakdosh",
        "type": [],
        "definition": [
            "maslagi (yo'nalishi) bir bo'lgan, hammaslak, hamfikr inson."
        ]
    },
    {
        "word": "Masoniy ",
        "type": [],
        "definition": [
            "Masoniy – oyatlarining adadi yuzta atrofida bo'lgan suralar; Qur'oni karimdagi yettita uzun sura – Baqara, Oli Imron, Niso, Moida, An'om, A'rof va Yunus suralaridan tashqari 'Mufassal'gacha bo'lgan suralarning umumiy nomi."
        ]
    },
    {
        "word": "Mash ",
        "type": [],
        "definition": [
            "'Mash' so'zi lug'atda qo'lni bir narsaning ustidan silab o'tkazishga aytiladi. Shar'iy istilohda esa, suv bilan ho'llangan qo'lni maxsus oyoq kiyimining maxsus joyidan maxsus zamonda silab o'tkazishga 'maxsiga mash tortish' deyiladi."
        ]
    },
    {
        "word": "Matn ",
        "type": [],
        "definition": [
            "hadis istilohida sanadning nihoyasi, ya'ni ma'nolardan tashkil topgan hadisning lafzlari"
        ]
    },
    {
        "word": "Maxluq ",
        "type": [],
        "definition": [
            "yaratilgan narsa. Alloh yaratgan olam shu jumladan inson va butun jonivorlarning, ashyo, o'simlik olami, barcha mavjudotning umumiy nomi. Qur'onga nisbatan ishlatilganda, uning yaratilmaganligi, ilohiyligi, mo''jizakorligi nazarda tutilgan"
        ]
    },
    {
        "word": "Maxsar ",
        "type": [],
        "definition": [
            "Maxsar – yovvoyi za'faron"
        ]
    },
    {
        "word": "Maxsi ",
        "type": [],
        "definition": [
            "Maxsi–ma'lum va mashhur oyoq kiyimi. U oyoqni to'pig'idan yuqorisigacha yaxshilab berkitib turadi. Sovuqdan va turli nopokliklardan saqlaydi. 'Maxsi' deb nomlanmasa ham, uning mazkur sifatlariga ega bo'lgan oyoq kiyimlari maxsi hukmida bo'ladi."
        ]
    },
    {
        "word": "Maxfiy suhbat",
        "type": [],
        "definition": [
            "'Maxfiy suhbat' – qiyomat kuni Alloh bilan banda o'rtasida bo'ladigan suhbat"
        ]
    },
    {
        "word": "Mahdiy at-Torobiy",
        "type": [],
        "definition": [
            "Abul Fazl Mahdiy ibn Ishkob at-Torobiy Torob qishlog'ida yashaganlar. Imom al-Buxoriyning ustozlari Muhammad ibn Salom al-Paykandiydan, Ibrohim ibn Ash'as va Abu Solih Muhammad ibn Ismoil ar-Roziydan hadis rivoyat qilganlar. O'zlaridan esa Abdulloh ibn Muhammad ibn Horis va Ubaydulloh ibn Munih ibn Sayf hadis rivoyat qilganlar. Hijriy 265 (milodiy 879) yilda vafot etganlar."
        ]
    },
    {
        "word": "Mahmud az-Zamaxshariy al-Lugʻaviy",
        "type": [],
        "definition": [
            "Abul Qosim Mahmud ibn Umar ibn Muhammad az-Zamaxshariy al-Lug'aviy Uning taniqli arab tilshunosi va adibi ekanligi haqida zarbulmasallar aytilgan. Ilm talabida Iroqqa borganlar. Bir necha yil Makkada Ka'baning yonida mujovir bo'lib yashaganlar. Taniqli muhaddislardan hadis tinglaganlar. Tafsir, hadis, nahv va boshqa sohalar bo'yicha asarlar bitganlar. She'riy devonlari ham bor. Mening zamonimda az-Zamaxshariy Marvga kelgan edilar. Ammo u kishini ko'rish va u zotdan iqtibos olish menga nasib etmadi. Ko'pgina do'stlari va shogirdlari bor. Menga bu alloma haqlarida shogirdlari: Tabaristonda Abul Mahosin Ismoil ibn Abdulloh, Abivardda Abul Mahosin Abdurahim ibn Abdulloh al-Bazzor, Zamaxsharda Abu Amr Omir ibn Hasan as-Simsor, Samarqandda Abu Sa'd Ahmad ibn Mahmud ash-Shoshiy, Xorazmda mashhur faqih Abu Tohir Somon ibn Abdulmalik va boshqalar ma'lumot berdilar. Mahmud az-Zamaxshariy hijriy 467 (milodiy 1075) yilning rajab oyida Zamaxsharda tavallud topib, hijriy 538 (milodiy 1144) yilning arafa kechasi Xorazmning Jurjoniyasida vafot etganlar"
        ]
    },
    {
        "word": "Mahmud al-Gʻashidiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Homid Mahmud ibn Yunus al-G'ashidiy al-Buxoriy - Buxoroning G'ashid G'ashid qishlog'idan bo'lib, Abu Tohir Asbot ibn Yasa' va Abu Muqotil Homid ibn G'olib at-Tavovisiydan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari Abu Bakr va Muhammad ibn Mahmud al-Vazzon hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Mahmud as-Sobuniy al-Madiniy",
        "type": [],
        "definition": [
            "Abu Ahmad Mahmud ibn Abu Bakr as-Sobuniy al-Madiniy solih shayx, ko'p xayru ehson qiluvchi edilar. Abu Bakr Muhammad ibn Umar as-Siyobiy va Abul Qosim Ali ibn Umar al-Qoridan ta'lim olganlar. Hijriy 485 (milodiy 1093) yilda tug'ilganlar"
        ]
    },
    {
        "word": "Mahmud at-Taroziy",
        "type": [],
        "definition": [
            "Imom Abul Qosim Mahmud ibn Ali at-Taroziy fozil, faqih va nazar ilmida kuchli edilar. Chiroyli siyratli, doimo Qur'on tilovat qilib yuruvchi solih kishilardan edilar. Abu Sodiq Ahmad ibn Husayn az-Zandiy al-Buxoriy va Abul Hasan Ali ibn Muhammad al-Buxoriydan hadislar yozib olganlar. Hijriy 535 (milodiy 1141) yili Buxoroda vafot etganlar. Imom, olim farzandlari bo'lib, hanafiy mazhabida edilar."
        ]
    },
    {
        "word": "Mahmud ibn Labiyd",
        "type": [],
        "definition": [
            "Mahmud ibn Labiyd ibn Uqba ibn Rofe' al-Avsiy, kunyalari Abu Naim al-Madaniy. Onalari Ummu Manzur bintu Muhammad ibn Maslama bo'lgan. Rasululloh sollallohu alayhi vasallam vafot etganlarida bu zot 13 yoshda edilar. Bu zot avvalgi tabaqadagi tobe'inlardan bo'lib, hadislarni Umar ibn Xattob, Usmon ibn Affon, Shaddod ibn Avs, Rofe' ibn Xudayj, Abu Sa'iyd al-Xudriy va yana boshqa bir nechta sahobalardan rivoyat qilganlar.\r\nBu zot hijratni 96-sanasida vafot etdilar."
        ]
    },
    {
        "word": "Mahmud ibn Robeʼ",
        "type": [],
        "definition": [
            "Mahmud ibn Robe' ibn Suroha al-Ansoriy al-Xazrajiy, kunyalari Abu Muhammad.\r\nBu zot Rasululloh sollallohu alayhi vasallamning hadislarini Utbon ibn Molik, Uboda ibn Somit, Abu Ayyub al-Ansoriylardan rivoyat qiladilar.\r\nBu zotdan Anas ibn Molik, Zuhriy, Rajo ibn Xayvalar rivoyat qilganlar.\r\nMahmud ibn Robe' hijratning 99-yili 93 yoshlarida vafot etdilar."
        ]
    },
    {
        "word": "Mahmud ibn Husayn ibn Sulaymon Sheroziy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Mahr ",
        "type": [],
        "definition": [
            "'Mahr' aqdi nikoh yoki eru xotin bo'lish bilan er zimmasiga yuklanadigan xotinga berilishi lozim bo'lgan moldir. Mahr turli nomlar bilan nomlanadi, Qur'oni Karimda sadoq, sadaqa, ajr, fariyza, nihla atamalari ishlatilgan."
        ]
    },
    {
        "word": "Mahram",
        "type": [],
        "definition": [
            "'Mahram' deganda eri hamda nikohi harom bo'lgan boshqa erkak qarindoshlari tushuniladi. Ular tug'ishganlik yoki qudachilik tarafidan bo'lishi mumkin."
        ]
    },
    {
        "word": "Mahshar",
        "type": [],
        "definition": [
            "to'planish, yig'ilish joyi. Insonlar tirilib, o'rnidan turib to'planadigan va so'roq qilinadigan kun."
        ]
    },
    {
        "word": "Mashixat Junayd ibn Ahmad al Bulyaniy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari"
        ]
    },
    {
        "word": "Mashoyixlar ",
        "type": [],
        "definition": [
            "Imom Abu Hanifa rahmatullohi alayhini ko'rmagan ulamolar"
        ]
    },
    {
        "word": "Mashhur",
        "type": [],
        "definition": [
            "'Mashhur' – Payg'ambarimiz sollallohu alayhi vasallamdan mutavotir darajasiga yetmaydigan sahobiy yoki sahobalar rivoyat qilib, ulardan ham ko'pchilik rivoyat etib, shuhrat topgan hadis 'mashhur' deyiladi. 'Mashhur' hadisning 'mutavotir'dan farqi Payg'ambarimiz sollallohu alayhi vasallamdan rivoyat qiluvchi sahobalarning soni ozligida, xolos. 'Albatta, amallar niyatga bog'liqdir', 'Islom besh narsaga bino qilingandir' kabi hadislar 'mashhur' hadislardir. Kim mashhur hadis orqali sobit bo'lgan hukmni inkor qilsa, fosiq bo'ladi. Unga amal qilmasa, gunohkor bo'ladi. 'Mutavotir' hadis ham, 'mashhur' hadis ham Qur'oni Karimning umumiy hukmini xos, mutlaq hukm etib, qayd qiladi."
        ]
    },
    {
        "word": "Mashʼar ",
        "type": [],
        "definition": [
            "ochiq alomat degani."
        ]
    },
    {
        "word": "Mashʼarul harom",
        "type": [],
        "definition": [
            "Muzdalifa"
        ]
    },
    {
        "word": "Maʼdan",
        "type": [],
        "definition": [
            "Ma'dan – naslning boshlanish nuqtasi"
        ]
    },
    {
        "word": "Maʼn ibn Yaziyd",
        "type": [],
        "definition": [
            "Ma'n ibn Yaziyd ibn al-Axnas ibn Habib ibn Jurra ibn Zehb ibn Molik ibn Xufofa ibn Imriul Qays ibn Buhata ibn Sulaym as-Sulmo.\r\nBu zot ham, u kishining otalari va bobolari ham Payg'ambarimiz sollallohu alayhi vasallamning sahobalari edilar.\r\nU kishining kunyalari Abu Yaziyd bo'lib, Sulaym qabilasidan edilar. Dimashq fathida ishtirok etganlar. Avval Kufada, keyin Misrda va oxiri Shomda istiqomat qilganlar. 'Siffiyn' jangida Muoviya tarafidan ishtirok etganlar.\r\nHazrati Umarning xalifalik davrlarida mansablardan birida o'tirganlar, 'Maraj raht' voqeasida Zahhoq ibn Qays bilan birga bo'lganlar va hijratning 64-sanasida o'ldirilganlar."
        ]
    },
    {
        "word": "Maʼorij surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 44 oyatdan iborat.\r\nBu surai karimaning nomi o'zining uchinchi oyatidagi 'ma'orij' so'zidan olingan. 'Ma'orij' 'me'roj' so'zidan olingan bo'lib, 'me'rojlar' – 'yuqoriga chiqadigan yo'l' degan ma'noni anglatadi. Bu surada Alloh taolo 'me'rojlar egasi' deb vasf qilingandir. Ya'ni Alloh taolo farishtalar osmonga chiqib, tushadigan me'rojlar egasidir, degani.\r\nBu surai karima ham Islom aqiydasining aslini muolaja qiladi. Alloh taolo qiyomat va uning dahshatlari, oxiratdagi saodat hamda baxtsizlik, rohat va azob, mo'min va gunohkor bandalarning u yerdagi holi xususida O'z bandalarini ogohlantiradi.\r\nSuraning asosiy mavzusi Makka kofirlarining qiyomatda qayta tirilishni inkor etishlari, janobi Payg'ambarimiz Rasululloh sollallohu alayhi vasallamning da'vatlarini masxara qilishlari haqidadir.\r\nShunga ko'ra, bu sura Makka ahlining tug'yoni, ularning Nabiy alayhissalomga itoat etishdan bosh tortishlari, oxirat azobini masxara qilishlari voqealarining bayoni bilan boshlanadi.\r\nSo'ngra qiyomat kuni gunohkor bandalar qanday holatlarda bo'lishlarining bayoniga o'tiladi. Inson, tabiatan, yaxshilik yetganda noshukr va yomonlik yetganda chidamsiz ekani zikr qilinadi.\r\nShuningdek, bu surada Haq subhanahu va taolo mo'minlarning ulug' sifatlari, fazilatlari, axloqlarini va Alloh taolo ular uchun tayyorlab qo'ygan ulug' ajrlar va na'im jannatlari vasfini ham bayon qilgan.\r\nAlloh taolo O'zining Payg'ambari Rasulullohni masxara qilgan kofirlarni ham O'z oyatlarida siz bilan bizga ibrat tarzida ko'rsatib o'tgan.\r\nSuraning oxirida Robbul olamin O'zining Makka kofirlaridan ko'ra yaxshiroqlarni yaratishga ham qodir ekanini, qayta tirilish va jazo borligiga shak-shubha bo'lishi mumkin emasligini qasam bilan ta'kidlaydi."
        ]
    },
    {
        "word": "Maʼrifa ",
        "type": [],
        "definition": [
            "Aniq"
        ]
    },
    {
        "word": "Maʼrur ibn Suvayd",
        "type": [],
        "definition": [
            "Ma'rur ibn Suvayd al-Asadiy, kunyalari Abu Umayya al-Kufiydir.\r\nHadislarni Umar ibn Xattob, Abu Zarr, Ibn Mas'ud, Xuraym ibn Fatik, Ummu Salamalardan rivoyat qilganlar."
        ]
    },
    {
        "word": "Maʼruf as-Sibadmuniy",
        "type": [],
        "definition": [
            "Abu Solih Ma'ruf ibn Mansur as-Sibadmuniy peshqadam olimlardan. Iroq, Hijoz va Shomda bo'lib, ulug' ulamolardan ta'lim olganlar. Sufyon ibn Uyayna, Marvon ibn Muoviya, Abu Abdulloh ibn Abu Hafs, Asbot ibn Yasa' va Ahmad ibn Laysdan hadis rivoyat qilganlar. O'zlaridan esa Abu Hafs Ahmad ibn Yunus al-Buxoriy, Abu Bakr Ahmad ibn Asad as-Sibadmuniy va Muhammad ibn Yusuf hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Maʼsum",
        "type": [],
        "definition": [
            "saqlangan, daxlsiz; gunohsiz, pok, beg'ubor, begunoh, toza"
        ]
    },
    {
        "word": "Maʼuna qudugʻi",
        "type": [],
        "definition": [
            "Ma'una qudug'i – Madinai Munavvara bilan Makkai Mukarrama orasida joylashgan, Banu Sulaym qabilasiga tegishli hududdagi quduq. Madinai Munavvaradan to'rt marhala uzoqlikda bo'lgan (Marhala – ikki manzil orasidagi masofa. Karvon quyosh chiqqandan so'ng bir manzildan jo'nab, kuni bilan faqat zarurat uchungina to'xtab, so'ng quyosh botganda dam olib, tunash uchun ikkinchi bir manzilda to'xtaydi. Ana shu ikki manzil orasi bir marhala deyilgan. Bir marhala 44,352 km ga to'g'ri keladi)."
        ]
    },
    {
        "word": "Mezon ",
        "type": [],
        "definition": [
            "tarozi; mahshar maydonida insonlarning savob va gunohlari tortiladigan tarozi"
        ]
    },
    {
        "word": "Meros",
        "type": [],
        "definition": [
            "mol-mulk yoki majburiyatlarning egasi vafot etishi bilan boshqa shaxs ixtiyoriga o'tishi"
        ]
    },
    {
        "word": "Mehjan ",
        "type": [],
        "definition": [
            "boshi egri kichik aso."
        ]
    },
    {
        "word": "Mehrob ",
        "type": [],
        "definition": [
            "sajdagoh; namozda imom sajda qiladigan makon."
        ]
    },
    {
        "word": "Meʼroz ",
        "type": [],
        "definition": [
            "'Me'roz'–uch tarafi o'tkir qilingan kichik ov nayzasi."
        ]
    },
    {
        "word": "Miyqot ",
        "type": [],
        "definition": [
            "Hajda ehromga kirishning tayinli vaqti va tayinli makoni bor. Ular miyqot deyiladi. Hajning zamon miyqoti Shavvol Zulqa'da oylari hamda Zulhijja oyining birinchi o'n kuni. Makon miyqoti esa, turli diyor hojilari uchun, ularning Makkai mukarramaga kelish yo'llariga qarab, turli joylardir. Ya'ni, makon miyqoti Makkai mukarramaning atrofidagi maxsus belgilangan chegaradir, desa bo'ladi. Haj yoki umra qiluvchilar o'sha yerlarda ehromga kiradilar. Agar bir odam miyqotdan o'tib ketib ehromga kirsa, qaytib chiqib miyqotdan ehromga kirishi lozim bo'ladi. Ilojini topa olmasa, jonliq so'yishi vojib bo'ladi."
        ]
    },
    {
        "word": "Miysoq",
        "type": [],
        "definition": [
            "Alloh taolo kelajakda yaratadigan barcha bandalarining ruhlarini yaratib, ulardan ahdnoma olgan kun."
        ]
    },
    {
        "word": "Miqdom ibn Kandiy",
        "type": [],
        "definition": [
            "Miqdom ibn Karaba ibn Amr ibn Yaziyd, kunyalari Abu Kariymata al-Kandiy. U zot yoshlik chog'larida Kanda elchilari bilan birga Yamandan Rasululloh sollallohu alayhi vasallamning huzurlariga keldilar. Ular sakson nafar otliq kishilar edi. Shundan so'ng Shom shahrida istiqomat qildilar. Hammasi bo'lib, 40ta hadis rivoyat qildilar.\r\nUshbu hadislardan Imom Buxoriy ham ajratib oldilar.\r\nBu zot hijratning 87-yili 91 yoshlarida Hims shahrida vafot etdilar."
        ]
    },
    {
        "word": "Milodiy yil",
        "type": [],
        "definition": [
            "milodiy taqvimga asos bo'lgan yil. Uning ma'nosi – tug'ilish. Iso alayhissalomning tug'ilishlari – 1-yilning 1 yanvaridan boshlangan."
        ]
    },
    {
        "word": "Minbar ",
        "type": [],
        "definition": [
            "masjidda imom va'z aytadigan baland joy, keng zinapoyali supa"
        ]
    },
    {
        "word": "Mintaq",
        "type": [],
        "definition": [
            "'Mintaq' – tananing pastki qismiga o'rab olinadigan izor kabi kiyim. U avvalda xuddi peshband singari xizmat vaqtida kiyiladigan ayollar kiyimi bo'lgan. Hojar onamiz Sora onamizning rashkini pasaytirish maqsadida o'zini uning xizmatiga shay qilib ko'rsatish, o'zini uning oldida xizmatkordek tutish uchun mintaq tutgan."
        ]
    },
    {
        "word": "Mirt ",
        "type": [],
        "definition": [
            "Mirt – ipakdan yoki ipak va yungdan to'qiladigan yo'l yo'l ustki en kiyim (yaxlit mato)"
        ]
    },
    {
        "word": "Mirshab ",
        "type": [],
        "definition": [
            "tungi poyloqchi, harbiy askarlar boshlig'i"
        ]
    },
    {
        "word": "Misboh fiy sharhil Miftoh",
        "type": [],
        "definition": [
            "Bu kitob Sayyid Sharif Jurjoniy rahmatullohi alayhining imom Sakkokiyning 'Miftohul ulum' deb nomlangan balog'atga oid kitobining sharhidir. Bu asar haqida ilmiy ish yoqlangan"
        ]
    },
    {
        "word": "Misvok ",
        "type": [],
        "definition": [
            "tishni tozalaydigan vosita. Hadislarda uning sunnatligi aytib o'tilgan"
        ]
    },
    {
        "word": "Misvok qilish",
        "type": [],
        "definition": [
            "Bizda 'misvok qilish' deb ishlatiladigan istiloh tishni ishqalab yuvish ma'nosidadir. Payg'ambarimiz Muhammad (s.a.v.)ning zamonlarida ma'lum bir butalarning, aniqrog'i esa, arok nomli butaning uchi yumshatilgan novdalari bilan tish tozalangan."
        ]
    },
    {
        "word": "Misqol ",
        "type": [],
        "definition": [
            "qad. og'irlik o'lchov birligi; Sharq (arab) mamlakatlarida qimmatbaho buyumlarning og'irligi M. bilan o'lchangan. 1 M.ning og'irligi 100 dona arpa (yoki bug'doy) doni og'irligiga tenglashtirilgan. Agar bir dona arpa donini qadimda o'rtacha 0,04255 gr ga teng qilib olingani hisobga olinsa, u holda 1 M = 100 arpa doni = 100 x 0,04255 = 4,255 gr bo'ladi."
        ]
    },
    {
        "word": "Misliy ",
        "type": [],
        "definition": [
            "'Misliy' deganda kayliy, vazniy va adadiy narsalarni narx qilib berishni tushuniladi. 'Misliydan boshqa narxlar' deganda kiyim, hayvon va ko'chmas mulk kabi narsalar kiradi."
        ]
    },
    {
        "word": "Misliy narx",
        "type": [],
        "definition": [
            "'Misliy narx' deganda pul emas, bug'doy yoki shunga o'xshash narsalarga sotish tushuniladi."
        ]
    },
    {
        "word": "Misr ",
        "type": [],
        "definition": [
            "'Misr' eng katta masjidiga aholisi sig'maydigan aholi yashaydigan joydir. Bu kabi istiqomat maskanlari avvallari 'shahar' deyilgan. Ammo hozirgi kichikroq qishloqlar ham avvalgi shaharlardan katta bo'lib qolgan. Mazkur iboradagi 'aholi'dan murod, Jum'a namozi o'qishi farz bo'lgan aholidir."
        ]
    },
    {
        "word": "Miftahul hisn al hasin",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari"
        ]
    },
    {
        "word": "Mihjan ibn al-Adraʼ",
        "type": [],
        "definition": [
            "Mihjan ibn al-Adra' Aslamiy al-Madaniy mohir chavandozlardan bo'lib, Madinada istiqomat qilganlar. Keyin Basraga ko'chib o'tdilar va ana shu yerdagi masjidning atrofini devor bilan o'rab chiqdilar.\r\nBu zot uzoq umr ko'rdilar. Rasululloh sollallohu alayhi vasallamdan beshta hadis rivoyat qilganlar.\r\nMihjan ibn al-Adra' roziyallohu anhudan Hanzala ibn Ali al-Aslamiy, Rujo ibn Abu Rujo, Abdulloh ibn Shaqiq va boshqalar rivoyat qildilar. U kishi rivoyat qilgan hadislarni uchta 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\nMihjan ibn al-Adra' roziyallohu anhu hijratning 60-yili Muoviyaning xalifalik davrida vafot etdilar."
        ]
    },
    {
        "word": "Miʼroz ",
        "type": [],
        "definition": [
            "Mi'roz – ketiga pat qadalmagan kamon o'qi, uchi o'tkirlangan yoki temir tig'li yog'och. U ov quroli hisoblangan."
        ]
    },
    {
        "word": "Moida surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 120 oyatdan iborat.\r\nUshbu surai karimada moida (yasatilgan dasturxon) haqida oyatlar bo'lib, uning nomi shundan kelib chiqqan. Iyso alayhissalomning eng yaqin safdoshlari (havoriylari) u kishidan osmondan yasatilgan bir dasturxon tushirib berishlarini so'raydilar. Undan ovqatlanishni va bashorat olishni orzu qiladilar. Garchi bu taklif noo'ringa o'xshasa ham, Alloh taolo payg'ambari Iyso alayhissalomni qo'llab-quvvatlash, u zotning payg'ambar ekanliklarini tasdiqlash uchun talab qilingan moidani tushirdi. Surada moidaga tegishli oyatlar to'rttagina, xolos.\r\nSurai karimaning ikkinchi nomi 'Uhuud', ya'ni 'Ahdnomalar'dir. Chunki unda so'z asosan turli shartnoma – ahdnomalar haqida ketadi. Ma'lumki, Qur'oni Karim musulmonlarning ilohiy dasturi bo'lib, u alohida musulmonlar jamiyati barpo etish, yangi bir ummatni tarbiyalash, ushbu jamiyat a'zolarining turli aloqalarini yo'lga qo'yish uchun Alloh taolo tomonidan nozil qilingandir. Albatta, mazkur aloqalar avvalo Alloh bilan, qolaversa, boshqa jamiyatlar, xalqlar, dinlar bilan bo'ladi. Bu esa o'ziga xos ahdlashuvlarni taqozo etadi. Surada ana o'shanday shartnomalar keng ma'noda talqin qilingandir.\r\nShuningdek, bu surai karimada noislomiy jamiyatlarning aqiyda, muomala, shartnomalar va boshqa sohalardagi xatolari tanqid etiladi. Musulmonlarga o'sha xatolarni takrorlamaslik uqtiriladi, Islom, din tushunchalarining haqiqati bayon qilinadi. Dunyoda faqat Allohning hukmigina joriy bo'lishi shartligi, halol-harom, to'g'ri-noto'g'rini aniqlash faqat Allohning haqqi ekani tushuntiriladi.\r\nUlamolarimiz Moida surasida nidolar ko'pligini ham mulohaza qilganlar. Bu surada 'Ey iymon keltirganlar!' nidosi o'n olti marta takrorlangan. Nabiy alayhissalomga ikki nido, ahli kitoblarga olti nido kelgan. Har bir nidodan keyingi ma'nolar o'ziga xos shartnomaga aylangan. Xuddi shu sababdan ham suraga 'Uhuud' – 'ahdnomalar surasi' deb ikkinchi nom berilgan. Alloh taolo musulmon ummatidan, shuningdek, ahli kitoblardan (yahudiy va nasorolardan) olgan ahdnomalarini ham eslatadi.\r\nShu bilan birga, surada tavhid masalasi ham doimiy ravishda muolaja qilib boriladi. O'tgan ummatlarning bu muhim masalada yo'l qo'ygan xatolari eslatiladi.\r\nSurai karimada turli shar'iy hukmlar ham kelgan. Jumladan, halol-harom to'g'risidagi hukmlar, hayvonlarni so'yish, ovlash masalalari, Masjidul Haromni haj yoki umra qilish davridagi ehromga tegishli masalalar, nikohdagi halol va harom narsalar, tahorat va namozga tegishli masalalar, shuningdek, qozilik qilib hukm chiqarishda adolatli bo'lishga da'vat, o'g'rilik, musulmonlar jamoasiga qarshi chiqish, aroqxo'rlik, qimorbozlik, butparastlik, folbinlikka oid masalalar hal etilgan. Ov hayvonlarini noto'g'ri ovlashning, qasam va ehromdagi xatolarning kafforoti qanday bo'lishi bayon qilinadi. Ushbu surada o'lim paytidagi vasiyat haqida ham so'z ketadi. Ayni chog'da johiliyatning ba'zi ahkomlari tanqid etiladi, Tavrotda kelgan ba'zi hukmlar eslanadi. Injilda kelgan hukmlar ham tilga olinadi va endi hamma Qur'onda kelgan hukmlarga amal qilishi lozimligi ta'kidlanadi. Islom Allohning mukammal dini ekani alohida uqtiriladi. Yahudiylar va nasorolar bilan bo'ladigan aloqalar, ularning o'ziga xos xususiyatlari bayon qilinadi.\r\nSuraning so'ngida o'quvchilarga barcha ahdnomayu shartnomalar takroran eslatilib, ularga amal qilindimi-yo'qmi, o'ylab ko'rish taklif etiladi."
        ]
    },
    {
        "word": "Molik ibn Anas",
        "type": [],
        "definition": [
            "Molik ibn Anas ibn Molik ibn Abu Omir ibn Amr ibn al-Horis Abu Abdulloh al-Asbahiy al-Madaniy – Dorul-hijratning imomi va faqihi hisoblanadilar. Molik ibn Anas 93 hijriy sanada Madinai Munavvarada dunyoga keldilar. Al-Asbahiy nasablari Yamanning al-Asbah qabilasidandir. Imom Molik taba' tobe'inlardan bo'lib, o'z davrlarining buyuk ilm sohiblaridan biri, muhaddis va Molikiy mazhabining imomi edilar.\r\nImom Shofe'iy u kishi haqida shunday deydilar: 'Molik tobe'inlardan keyin Alloh taoloning xalqiga hujjatidir'. Imom Nasaiy Imom Molikning hadis ilmidagi o'rinlari va fazllari haqida shunday deydilar: 'Men uchun hadis ilmida Molikdan ko'ra bilimdon, hurmatli, ishonchli, amin va zaiflardan kam rivoyat qilgan boshqa kishi yo'qdir'.\r\nImom Shofe'iy: 'Agar Molik va Ibn Uyayna bo'lmaganida, Hijozning ilmi yo'qolib ketgan bo'lardi', deydilar. Shuningdek: 'Agar ulamolar esga olib o'tilsa, Molik yulduzdirlar', deydilar. Ibn Mahdiy: 'Molik al-Hakam va Hammoddan faqihroqdir', deganlar.\r\nImom Molik xalifa Abu Ja'far al-Mansurning taklifi bilan Islom ta'limotlarini musulmonlarga tushuntiruvchi kitob yozadilar va uni 'Muvatto' ('Osonlashtirilgan') deb ataydilar. Xalifa Mansur hamma musulmonlarni shu kitob bo'yicha ish tutishga buyurmoqchi bo'lganlarida Imom Molik rozilik bermaydilar. Bu kitob qirq yil mobaynida to'plangan hadislarni o'z ichiga olib, ularni mingga yaqin kishi rivoyat qilgan. Bu kitobdagi hadislar o'ttizdan ortiы roviy tomonidan rivoyat ыilingan bo'lib, ularning yigirmatasi mashhurdir.\r\nYahyo ibn Yahyo al-Laysiy al-Andalusiy 'Muvatto'ni vasflab: 'U hadis va fiqh kitobidir, unga teng keladigan boshqasini bilmayman', deydilar. Imom Shofe'iy: 'Yer yuzida ilmda 'Muvatto'dan to'g'riroq kitob yo'q', deydilar.\r\nImom Molik Na'iym al-Mujmir, Zayd ibn Aslam, Abul Zinod, Sa'id al-Maqburiy, Hamiyd at-Toviyl, Huzayfa as-Sahmiy al-Ansoriylardan rivoyat qilganlar. Ammo Imom Molikdan rivoyat qilganlar ko'p bo'lib, u kishining ustozlari az-Zuhriy va Yahyo ibn Sa'id, asrdosh ulamo sheriklaridan al-Avzo'iy, as-Savriy, Sufyon ibn Uyayna, al-Lays ibn Sa'd, Ibn Jurayj, Shu'ba ibn Hajjoj, ash-Shofe'iy, Ibn al-Qatton va Abu Ishoq al-Fazariylar shular jumlasidandir.\r\nImom Molik buyuk taqvo sohibi edilar. Agar hadis aytmoqchi bo'lsalar, tahorat qilib, o'rinlariga viqor bilan joylashib olib, keyin hadis aytishni boshlar edilar. U kishiga shu haqda aytishganida: 'Rasululloh sollallohu alayhi vasallamning hadislarini ulug'lashni yaxshi ko'raman, shuning uchun tahoratdan xotirim jam bo'lgandagina hadis aytaman', deb javob qilgan ekanlar. U kishi yo'lda ketayotib, tik turib yoki shoshilib turgan hollarida hadis aytishni yomon ko'rar edilar. Yoshlari ulug' bo'lib, zaiflashib qolganlarida ham Madinai Munavvarada ot yoki tuya minmagan, 'Rasululloh sollallohu alayhi vasallamning jussalari dafn etilgan shaharda ot yoki tuya minmayman', degan ekanlar.\r\nImom Molik muhaddisgina bo'lib qolmay, buyuk faqih, Molikiy mazhabining imomi ham edilar. U kishining mazhablari Islom olamida keng yoyilgan bo'lib, Shofe'iy va Hanbaliy mazhablarining asosi hisoblanadi. Molikiy mazhabi hozirda, asosan shimoli-g'arbiy Afrika davlatlarida keng tarqalgan.\r\nImom Molik Islom davlatining eng katta ilm markazlaridan biri bo'lgan 'Dorus-Sunna' – Madinai Munavvarada yashaganliklari sababli hadis talab qilib, boshqa yurtlarga safar qilmaganlar, balki hadis talabida Madinaga kelgan ulamolar bilan uchrashib, hadis almashar edilar.\r\nImom Molik butun umrlari davomida hech qanday qo'zg'olon-fitnalarga aralashmaganlariga qaramay, xalifa Abu Ja'far al-Mansur davrida, ya'ni 146 yilda u kishining boshlariga musibat tushadi: darra bilan kaltaklanadilar va qo'llarini tortib, kuraklarini chiqarib yuborishadi. Buning sababi, Imom Molik rivoyat qilgan 'Mustakrah (majburlangan)ga taloq yo'q' hadisining Muhammad ibn Abdulloh ibn Hasan an-Nafs az-Zakiya Madinai Munavvarada qo'zg'olon qilib chiqqan paytida ba'zi bir kuchlar tomonidan fitna uchun qo'llanilganligi va bu hadisi sharif bilan Abu Ja'far al-Mansurga qilingan bay'at noto'g'ri ekanligi bildirilganligidir. Chunki xalifa al-Mansur taloq sharti bilan musulmonlardan bay'at olardi.\r\nImom Molik ibn Anas 179 hijriy sanada vafot etadilar."
        ]
    },
    {
        "word": "Molik ibn Hubayra",
        "type": [],
        "definition": [
            "Molik ibn Hubayra ibn Hodiy Sukuniy al-Kindiy, kunyalari Abu Sa'iyd.\r\nUmaviylar asrida Kinda qabilasining boshliqlaridan edilar. Siffiyn urushida Muoviya bilan ishtirok etdilar, Muoviyaga bay'at berilgan kuni insonlar orasida xutba o'qigan kishi shu zot edilar.\r\nHijratning 48-yili dengizdagi bo'lgan g'azotda hamda Misrni fath etishda ishtirok etdilar. Shu yili Muoviya tomonidan Hims shahriga voliy etib tayinlangan edilar.\r\nMolik Rasululloh sollallohu alayhi vasallam bilan birga bo'lganlar va u kishidan ko'plab hadislar rivoyat qilganlar.\r\nU kishidan Marsad ibn Abdulloh al-Bazaniy rivoyat qildilar.\r\nMolik ibn Hubayra roziyallohu anhu hijratning 65-yili, Marvon ibn Hakam davrida vafot etdilar."
        ]
    },
    {
        "word": "Molik ibn Huvayris",
        "type": [],
        "definition": [
            "Molik ibn Huvayris basralik bo'lib, kunyalari Abu Sulaymon edi. Bu zot va qavmlaridan bir necha kishilar Rasululloh sollallohu alayhi vasallamning huzurlariga kelganlarida u zot ularga namoz o'qishni o'rgatganlar. So'ng qavmlariga qaytayotganlarida ularga ham namoz o'qishni o'rgatishni buyurganlar. Shuning uchun bo'lsa kerak, bu sahoba Rasululloh sollallohu alayhi vasallamdan namoz xususida ko'plab hadislar rivoyat qilganlar"
        ]
    },
    {
        "word": "Muabbid az-Zandarmitaniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Amr Muabbid ibn Amr az-Zandarmitaniy al-Buxoriy - Buxoroning Zandarmitan nomli qishlog'idan . Muhammad ibn Ziyoddan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari Hamdon ibn Muabbid hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muavvizatayn",
        "type": [],
        "definition": [
            "Muavvizatayn – ikki panohchi. 'Qul a'uuzu', ya'ni 'Panoh tilayman', deb ayt' deb boshlangani uchun Falaq va Naas suralari shu nomni olgan"
        ]
    },
    {
        "word": "Muazzin",
        "type": [],
        "definition": [
            "Azon aytuvchi kishi."
        ]
    },
    {
        "word": "Muallaq ",
        "type": [],
        "definition": [
            "hadis roviylarining sahobadan pastdagi tabaqa va hokazo bir yo undan ko'p roviyning tushib qolishi."
        ]
    },
    {
        "word": "Muallaq ayol",
        "type": [],
        "definition": [
            "'Muallaq ayol' deb xotin bo'lib xotin emas, boshi ochiq bo'lib, boshi ochiq emas–arosat holda 'osilib' qolgan ayolga aytiladi."
        ]
    },
    {
        "word": "Muammar al-Karminiy al-Muaddib",
        "type": [],
        "definition": [
            "Abu Sulaymon Muammar ibn Jibril al-Karminiy al-Muaddib Samarqandda yashaganlar. Bu kishi shayx, ishonchli muhaddis, dindor, 'Usul ilmi'ni yaxshi biluvchi va sunna ahlidan edilar. Abu Sa'd al-Idrisiy aytadilar: 'Samarqandda biz u kishidan hadislar yozib olganmiz'."
        ]
    },
    {
        "word": "Muarrix ",
        "type": [],
        "definition": [
            "tarixchi, tarix ilmi bilan shug'ullanadigan kishi"
        ]
    },
    {
        "word": "Muboh ",
        "type": [],
        "definition": [
            "Shariat tomonidan mukallaf kishiga qilish yoki qilmaslik ixtiyori teng berilgan narsa mubohdir. Yemoq yoki ichmoqqa o'xshash narsalar. Haromligi yoki man' qilingani haqida hukm kelmagan barcha narsalar mubohdir. Muboh narsani qilganga ham, qilmaganga ham savob ham, itob ham yo'q. Ammo muboh narsani qilmaslik halokatga olib boradigan bo'lsa, uni qilish vojibga aylanadi. Misol uchun, taom yemaslik o'limga sabab bo'ladigan bo'lsa, uni yemoq vojibga aylanadi."
        ]
    },
    {
        "word": "Mubosharat ",
        "type": [],
        "definition": [
            "'Mubosharat' – er va xotin badanining to'siqsiz bir biriga tegishi (quchoqlashish). Bunda butun tana ham, uning bir qismi ham nazarda tutiladi"
        ]
    },
    {
        "word": "Muvaqqat nikoh",
        "type": [],
        "definition": [
            "Muayyan muddatga nikohlanishni 'muvaqqat nikoh' deyiladi. Muvaqqat nikoh ham mut'a nikohiga o'xshash bo'lganisababli durust bo'lmaydi."
        ]
    },
    {
        "word": "Muvatto",
        "type": [],
        "definition": [
            "Imom Molik rahmatullohi alayhining xadis kitobi."
        ]
    },
    {
        "word": "Muvattoi Molik",
        "type": [],
        "definition": [
            "Mashhur muhaddis, mazhabboshi imomlardan biri Molik ibn Anasning hadis to'plami 'Muvatto' deb ataladi. Imom Abu Abdulloh Molik ibn Anas ibn Molik ibn Abu Omir ibn Amr al Horis al Asba'iy al Madaniy rohimahulloh taba'a tobe'inlardan bo'lib, zamonasining yetuk olimi, molikiy mazhabi asoschisidir. Molik ibn Anas hijriy 93 (milodiy 712) sanada Madinai Munavvarada tug'ilgan. Imom Avzo'iy, Imom Shofe'iy, Muhammad ibn Hasan kabi olimlar u kishidan ta'lim olganlar. Imom Shofe'iy: 'Molik tobe'inlardan keyin Alloh taoloning hujjatidir', deganlar.\r\nImom Molik: 'Men ushbu kitobni Madina faqihlaridan yetmishtasiga ko'rsatdim. Ularning barchalari buni ma'qullashdi va men uni 'Muvatto' ('Osonlashtirilgan') deb nomladim', degan. Bu kitob aslida fiqhiy masalalarni yoritish maqsadida yozilgan bo'lsa-da, mo''tabar hadis kitoblaridan sanaladi. U hatto 'Olti sahih'ning oltinchisi bo'lishga loyiq ko'rilgan. Undagi hadislar qirq yil mobaynida to'plangan hadislar ichidan tanlab olingan bo'lib, ularni mingga yaqin kishi rivoyat qilgan.\r\nImom Shofe'iy: 'Alloh taoloning kitobidan keyin yer yuzida Molikning kitobidek sahih kitob bo'lmadi', degan.\r\nImom Molik 179 (milodiy 795) yili Madinai Munavvarada vafot etgan."
        ]
    },
    {
        "word": "Mugʻiyra ibn Shoʻʼba",
        "type": [],
        "definition": [
            "Mug'iyra ibn Sho''baning kunyalari Abu Abdullohdir. Bu sahoba oldiniga Islomga qarshi bo'lib, keyinchalik Xandaq yili Islomni qabul qiladilar va Hudaybiya g'azotida ishtirok etadilar.\r\nBu zot Rasululloh sollallohu alayhi vasallamdan hammasi bo'lib 136ta hadis rivoyat qildilar.\r\nUmar ibn Xattob xalifalik davrlarida Mug'iyrani Basraga hokim qilib tayinladilar. So'ng bu amaldan bo'shatib, Kufaga amirlik kursisiga o'tkazdilar.\r\nUsmon ibn Affon xalifalik davrlarida ham Mug'iyrani Kufa amirligida qoldirdilar.\r\nKeyinchalik bu ishdan bo'shab, Yamoma, Yarmuk g'azotlari va Shom, Hamadon, Nahovand fathlarida ishtirok etdilar. Muoviya davrida yana qayta Kufa amirligiga o'tirdilar.\r\nBu zot Rasululloh sollallohu alayhi vasallamdan hammasi bo'lib 136ta hadis rivoyat qildilar"
        ]
    },
    {
        "word": "Mugʻiyra ibn Shoʻʼba roziyallohu anhu ",
        "type": [],
        "definition": [
            "Bu zotning to'liq ismlari Mug'iyra ibn Sho''ba ibn Abu Omir ibn Mas'ud ibn Muattib ibn Molik ibn Ka'b ibn Amr ibn Sa'd ibn Avf ibn Qaysdir.\r\nXandaq jangi bo'lgan yilda Islomga kirganlar. Hudaybiya sulhida ishtirok etganlar.\r\nHazrati Umar roziyallohu anhuning xalifalik davrlarida u kishi Basraga voliy qilib ta-yinlanganlar. So'ngra Kufaga voliy bo'lganlar.\r\nHazrati Usmon zamonlarida voliylikdan bo'shab, Yamoma, Shom fathlarida ishtirok etdilar. Keyinchalik Yarmuk Qodisiya va Nahovand janglarida qatnashdilar.\r\nMug'iyra ibn Sho''badan sahobalar Abu Amoma Bohiliy, Masvar ibn Muhrama, Qurratu al-Mazniylar, farzandlari Urva, Hamza, Aqqor, mavlolari Varrod, Masruq, Qays ibn Abu Hozim, Abu Voil va boshqalar hadislar rivoyat qilganlar.\r\nU zot birinchi bo'lib Basrada devon – mirzaxona tashkil qilgan edilar.\r\nMug'iyra ibn Sho''ba hijratning 50-yilida Kufada vafot etdilar."
        ]
    },
    {
        "word": "Muguz ",
        "type": [],
        "definition": [
            "Muguz – hayvon shoxi."
        ]
    },
    {
        "word": "Mudabbar ",
        "type": [],
        "definition": [
            "Xojasi 'men o'lgandan keyin ozodsan' deb qo'ygan qul."
        ]
    },
    {
        "word": "Mudallis ",
        "type": [],
        "definition": [
            "aldoqchi, firibgar, qallob, yolg'onchi, aldamchi, hadislarni soxtalashtiruvchi"
        ]
    },
    {
        "word": "Mudarris",
        "type": [],
        "definition": [
            "dars beruvchi, o'qituvchi, pedagog, saboq beruvchi, ustoz, muallim, domla"
        ]
    },
    {
        "word": "Mudd ",
        "type": [],
        "definition": [
            "0,6875 litr(≈ 0,688 litr). Og'irligi = 544 gr(= 0,25 so' = 0,5 qist = 1,33 iroqiy ratl = 1 katta hovuch miqdori)."
        ]
    },
    {
        "word": "Muddassir surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 56 oyatdan iborat.\r\nUshbu suraning birinchi oyatidagi 'muddassir' ('burkanib yotgan') so'zi unga nom qilib olingandir.\r\nXuddi Muzzammil surasidagi kabi, bu surada ham ulug' Nabiy alayhissalomning ba'zi shaxsiy xususiyatlari zikr qilinadi.\r\nSurai karima Rasululloh sollallohu alayhi vasallamni da'vat qiyinchiliklarini ko'tarishga va kishilarga ilohiy ta'limotlarni jiddiyat ila yetkazishga, kofirlarni ogohlantirishga, fojirlarning bergan ozorlariga sabr qilishga chaqirish bilan boshlanadi.\r\nSo'ngra gunohkorlarga qiyomat kuni bo'ladigan qiyinchiliklar, beriladigan shiddatli azoblar haqida bayon qilinadi.\r\nSo'ng Qur'onni eshitib, uning Allohning kalomi ekanini bilib turib, mansab, obro' deb, to'g'ri yo'lni qo'yib, noto'g'ri yo'lni tanlagan fojir va fosiq Valid ibn Mug'iyraning holi ne kechganligi haqida Alloh taolo O'z bandalarini ogohlantiradi.\r\nKofirlarga va'da qilingan do'zax haqida, do'zaxning kuchli posbonlari, undagilarni azoblovchi farishtalar haqida, ularning soni haqida ham oyatlar keladi.\r\nSurada oy va tong bilan qasam ichiladi va jahannam ulkan balolarning biri ekani ta'kidlanadi.\r\nJannatga kirgan mo'minlar va do'zaxga tushgan gunohkorlarning oxiratdagi so'zlashuvi keltiriladi.\r\nMushriklarning iymondan yuz o'girishlarining sababi haqidagi oyatlar suraning oxirida nozil bo'lgan.\r\nTafsir kitoblarida Muzzammil va Muddassir suralarining nozil bo'lish sabablari bir-birlariga o'xshashligi ta'kidlanadi. Buning hech ajablanarli joyi yo'q, suralar bir-birlariga tarix va mavzu jihatidan juda ham o'xshash. Nozil bo'lish sababi ham o'xshash bo'lishi tabiiy.\r\nRivoyatlardan birini keltiramiz:\r\nQuraysh qabilasi mushriklari yig'ilish o'tkazib, odamlarni Nabiy alayhissalomning chaqiriqlaridan to'sish uchun tadbirlar qabul qilishganda, Payg'ambar sollallohu alayhi vasallam g'am-g'ussaga botib, kiyimlariga burkanib, yotib olganlar. Shunda farishta Jabroil alayhissalom kelib, 'Yaa ayyuhalmuddassir surasining avvalini o'qigan ekanlar."
        ]
    },
    {
        "word": "Mudobara ",
        "type": [],
        "definition": [
            "Qulog'ining uchi kesilgan hayvon"
        ]
    },
    {
        "word": "Mujavvid",
        "type": [],
        "definition": [
            "Qur'oni karimni tajvid bilan o'qiydigan kishi"
        ]
    },
    {
        "word": "Mujallad ",
        "type": [],
        "definition": [
            "tom, juz"
        ]
    },
    {
        "word": "Mujodala surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 22 oyatdan iborat.\r\nBu muborak sura ikki xilda nomlanib kelinmoqda.\r\nAgar sura 'Mujodila' deb nomlansa, 'Tortishuvchi ayol', 'Mujodala' deb nomlansa, 'Tortishuv' deya tarjima qilinadi. Ikkala tarjimada ham Xavla binti Sa'labaning shaxslariga ishora qilingan bo'ladi. Odatda 'Mujodala' nomi ko'proq ishlatiladi. Bu surani o'rganish davomida Alloh taolo mo'min-musulmonlarning hayotiy ishlariga bevosita aralashib, ularning noto'g'ri ishlarini tuzatib turganining guvohi bo'lamiz. Ya'ni oilaviy ishlarda, er-xotin o'rtasida bo'ladigan muomalalarda Alloh taolo O'z oyatlari bilan tuzatishlar kiritib turganini ko'ramiz.\r\nSura Nabiy alayhissalom bilan Xavla binti Sa'labaning gap tortishgani haqidagi xabar bilan boshlanadi.\r\nBu surada ko'plab shar'iy masalalar, jumladan, zihor masalasi kelgan.\r\nIslomdan avval arablarning johiliyat tuzumida er o'z xotiniga: 'Sen men uchun onamning belideksan', – deb aytsa, oralaridagi er-xotinlik aloqalari abadiy barbod bo'lardi. Mana shu va boshqa sabablar xotinlarni qiynash, azoblash va xo'rlashning bir uslubi edi. Aziz kitobxonga tushunarliroq bo'lishi uchun quyidagi misolni ham keltiramiz. Hozirgi kunimizga nazar tashlaydigan bo'lsak, bizda ham ba'zi og'ziga kuchi yetmaydiganlar, iymonu odobdan bexabarlar bo'lar-bo'lmasga 'Agar falon ishni qilmasam, onam xotinim bo'lsin' degan gapni gapirishadi. Yuqorida aytganimizdek, arablarda ham er xotiniga 'Sen men uchun onamning belideksan', desa, bundan 'Menga onam(ning nikohi) harom bo'lganidek, sen ham haromsan' degan ma'no tushunilar edi.\r\nMujodala surasi mazkur johiliy tushunchadagi hukmni bekor qiladi va zihor qilganlarga gunohini yuvish uchun moliyaviy ibodatni, ya'ni kafforotni joriy etadi.\r\nSo'ngra sura o'zaro pichirlashib gaplashish odoblarini o'rgatadi. Chunki o'sha davrda yahudiy va munofiqlar o'zaro suhbatdagi pichir-pichirlari bilan mo'min-musulmonlarga ozor berishar edi. Alloh taolo O'zining mo'min bandalarini ularga o'xshamaslikka, g'iybatdan yiroq yurishga chaqiradi.\r\nAlloh taolo ushbu surai karimada yahudiylarning so'z o'yini qilib, makkorlik bilan, xuddi salom berganga o'xshab, aslida esa yomonlikni ifoda qiluvchi so'zlarni aytishlarini ham bayon qiladi. Bu ham Allohning har bir zararli va botiniy narsalarni ko'ruvchi va biluvchiligiga dalolatdir.\r\nMunofiqlar haqida batafsilroq zikr qilingan oyatlarda ularning yahudiylar bilan do'stlik aloqalari o'rnatganliklari, mo'minlarning sir-asrorlarini ularga yetkazib turganliklari to'g'risida xabar kelgan.\r\nTafsirga kirishishdan oldin mazkur suradagi oyatlarning tushishiga sabab bo'lgan ba'zi rivoyatlarni o'rganib chiqsak. Zero, shunda oyatlar ma'nosi yaxshiroq va to'laroq mazmunda yetkazilgan bo'lur, inshaalloh!\r\nImom Ahmad ibn Hanbal Nabiy alayhissalomning jufti halollari Oisha onamizdan quyidagi rivoyatni keltiradilar:\r\n'Hamma ovozlarni eshitib turuvchi Allohga hamd bo'lsin! Tortishuvchi ayol Nabiy alayhissalomning huzurlariga kelib, so'zlashganda, men uyning bir burchagida edim. Nima deganini eshitganim yo'q. Alloh taolo 'Qod sami'a Allohu...' oyatlarini nozil qildi'.\r\nOisha onamiz bu rivoyatda Allohning hamma narsalarni bexato eshitib turishiga o'zlari yana bir bor guvoh bo'lganliklarini aytmoqchilar. Chunki bu tarixiy hodisa Oisha onamizning uylarida sodir bo'lgan. Xavla binti Sa'laba kelganida, Oisha onamiz Nabiy alayhissalomning boshlarini yuvib turgan edilar. So'ngra Xavla roziyallohu anho Nabiy alayhissalomga o'z shikoyatlarini ayta boshlaganlar. Oisha onamiz esa uyning bir burchagiga borib, ularning ovozlari bir past, bir baland bo'lib turganini eshitgan bo'lsalar-da, tortishuvning mohiyatini tushunmaganlar. Alloh taolo 'Qod sami'a Allohu' – 'Albatta, Alloh eshitdi...' oyatlarini nozil qilgan.\r\nKeling, aziz kitobxon, bu tarixiy qissaga yanada teranroq nazar tashlaylik.\r\nXavla binti Sa'laba chiroyli ayol edi. Bir kuni eri Avs ibn Somitning ko'ngli u bilan yaqinlikni istab qoladi. Xavla esa unamaydi va, tabiiyki, oralarida janjal chiqadi. Avs achchig'i tez odam edi, u xotinining bu muomalasidan o'zini tuta olmay: 'Sen men uchun onamning belideksan', – deb yuboradi. Hovuridan tushgach, u afsus-nadomatlar qiladi. Chunki bu so'zlar o'sha davrdagi johiliyat hukmi bo'yicha taloq o'rniga o'tar va er-xotinning abadiy ajralishiga sabab bo'lardi. Avs xotiniga qarab:\r\n– Endi menga harom bo'lgan bo'lsang kerak, – deydi. Xavla bo'lsa:\r\n– Allohga qasamki, bu taloq emas, – deydi. So'ngra qo'shni ayolning kiyimini qarzga olib, bu masalaning hukmini oydinlashtirish uchun Rasulullohning huzurlariga yo'l oladi. Ul zoti bobarakotning huzurlariga kelib:\r\n– Ey Allohning Rasuli, erim Avs ibn Somit menga yosh, boy va aqlu hushli paytimda uylandi. Molimni yeb bitirdi, yoshligimni so'ldirdi, aqlimni sustlatdi va yoshim ulug' bo'lgan bir damda mendan zihor qildi. Endi o'zi bu zihordan afsus-nadomatda. Bizlarning yana qayta qo'shilishimizga biror yo'l bormi? – dedi.\r\nNabiy alayhissalom:\r\n– Unga harom bo'libsan, – dedilar. Xavla esa bunga javoban:\r\n– Sizga Qur'onni nozil qilgan Zot bilan qasamki, u taloqni zikr qilgani yo'q. U mening bolamning otasi va eng sevimli kishim-ku axir? – dedi.\r\nNabiy alayhissalom yana:\r\n– Unga harom bo'libsan, – dedilar. Xavla binti Sa'laba bo'lsa:\r\n– Mushkulimni va yolg'izligimni Allohning O'ziga shikoyat qilaman, men erim bilan uzoq hayot kechirdim, undan farzandlar ko'rdim, – dedi.\r\nRasululloh sollallohu alayhi vasallam 'Unga harom bo'libsan'dan boshqa gapni aytmadilar va:\r\n– Sening to'g'ringda biror amr kelgani yo'q, – dedilar. Xavla binti Sa'laba esa Nabiy alayhissalom bilan tortishaverdi. Ul zot:\r\n– Unga harom bo'libsan', – desalar, u:\r\n– Mushkulimni, yolg'izligimni va holimning og'irligini Allohning O'ziga shikoyat qilaman, – derdi.\r\nShunday aytishuv chog'ida Xavla binti Sa'laba:\r\n– Axir mening yosh bolalarim bor, men bilan qolsalar, och qoladilar, u bilan bo'lsalar, zoye bo'ladilar, – der va boshini osmonga ko'tarib: – Allohim! O'zingga yolvoryapman. Allohim! Payg'ambaring tiliga mening mushkulimni oson qiluvchi (oyatlarni) tushir, – derdi.\r\nBirdan Nabiy alayhissalom jim bo'lib qoldilar. Vahiy kelganda bo'ladigan holat yuzaga keldi. Bir muddatdan keyin u kishi muborak boshlarini ko'tardilar-da:\r\n– Alloh taolo sen va sening ering haqida oyat nozil qildi, – dedilar. So'ngra 'Qod sami'a Allohu'dan to 'azaabun aliym'gacha o'qib berdilar.\r\nBu qissadan johiliyat qonunlari o'sha davr kishilari uchun qanchalik og'ir bo'lgani ko'rinib turibdi. Bu zulmkor hukmlar Islomning adolatli hukmlari oldida kuchsizlana boshlagan. Chunki Islom din sifatida vujudga kelgach, ko'p o'tmay, o'z adolati bilan kishilarni harakatga keltirib qo'ydi.\r\nRivoyat qilinishicha, hazrati Umar ibn Xattob o'z xalifalik davrlarida bir guruh kishilar bilan ketayotgan ekanlar, bir ayol u kishini uzoq to'xtatib qolibdi. Va'z, nasihat qilibdi. Shunda:\r\n– Ey Umar, – debdi ayol, – yaqindagina 'Umarcha', deb chaqirilarding, ulg'ayganingdan so'ng 'Ey Umar' deb chaqiriladigan bo'lding. Endi esa 'Ey amiral mo'minin', deb chaqirilmoqdasan. Allohdan qo'rqqin! Ey Umar! Kim o'limga ishonsa, umrini bekor o'tkazishdan qo'rqadi, kim hisob-kitobga ishonsa, azobdan qo'rqadi, – deya so'zlayveribdi. Hazrati Umar bo'lsalar, jim quloq solib turaveribdilar. Atrofdagilar u kishiga:\r\n– Ey mo'minlarning amiri! Bir kampirga ham shunchalik to'xtab turasizmi? – deyishganida, hazrati Umar ularga javoban bunday degan ekanlar:\r\n– Allohga qasamki, kunning avvalidan oxirigacha ushlab tursa ham, farz namoz vaqtidan boshqa vaqtda turaveraman. Bu kampirning kimligini bilasizlarmi o'zi? Bu – Xavla binti Sa'laba. Uning so'zini Alloh taolo yetti osmonning ustidan eshitgan. Bu ayolning so'zlarini Olamlarning Parvardigori eshitadi-yu, Umar eshitmasinmi?!\r\nMuhtaram o'quvchi! Mana, Qur'oni Karimning yigirma ikki oyatdan iborat Mujodala surasining nozil bo'lishiga sabab bo'lgan voqealar bayoni bilan qisman tanish bo'ldingiz. Inshaalloh, endi oyatlar tafsiriga o'tsak ham bo'lar."
        ]
    },
    {
        "word": "Mujohid al-Xorazmiy",
        "type": [],
        "definition": [
            "Abu Ali Mujohid ibn Muso al-Xorazmiy Bag'dodda yashaganlar. U yerda Ibn Uyayna, Yahyo ibn Salim at-Toifiy, Hoshim ibn Bashir, Abdulloh ibn Idris, Qosim ibn Molik al-Muzaniy va boshqa muhaddislardan hadis ilmidan ta'lim olganlar. O'zlaridan esa Muhammad ibn Yahyo az-Zuhaliy, Abu Zur'a Abu Hotam ar-Roziy, Ibrohim ibn Abdulloh, Ibrohim al-Harbiy, Abu Abdurahmon an-Nasoiy va Abul Qosim al-Bag'aviy hadis rivoyat qilganlar. Hijriy 158 (milodiy 776) yilda tavallud topib, hijriy 244 (milodiy 859) yilning rabi'ul avval oyida vafot etganlar"
        ]
    },
    {
        "word": "Mujtaboi Nasoiy",
        "type": [],
        "definition": [
            "'Mujtaboi Nasoiy' buyuk muhaddis, imom, hofiz, shayxulislom Ahmad ibn Shu'ayb ibn Aliy ibn Sinon ibn Bahr ibn Dinor Abu Abdulloh al Xurosoniy an-Nasoiy rohimahullohning qalamiga mansub mo''tabar to'plamdir. Bu zot 215 (milodiy 831) sanada Xurosonning Naso degan shaharchasida dunyoga keldi.\r\nBu zotning hadis kitobi 'Olti sahih'ning biridir. Nasoiy hadis ulamolari ichida asl hadislar bilimdonlarining imomi va peshqadami edi. U kishi o'n besh yoshga yetganda Qutayba ibn Sa'id al Balxiyning huzuriga borib, bir yilu ikki oy davomida hadis eshitadi.\r\nImom Nasoiy ilm talab qilib, Xuroson, Hijoz, Misr, Iroq, Arabiston yarim oroli, Shom kabi yurtlarni kezib chiqdi. So'ngra Misrda 'Al-Qanadiyl' nomli mashhur kitob bozori yaqinida yashadi.\r\nImom Nasoiy ta'lif etgan kitoblar quyidagilar: 'Xasoisu fii fazli Aliy ibn Abu Tolib va oli bayt', 'Kitobu az-zuafo val matrukiyn', 'Manosiku an-Nasoiy', 'Jam'u musnad Molik ibn Anas va musnad Aliy ibn Abu Tolib'.\r\nImom Nasoiy 'Sunani kubro' kitobini yozib tugatgach, uni Romla amiriga hadya qildi. Amir: 'Bundagi hadislarning barchasi sahihmi?' dedi. Nasoiy: 'Unda sahih ham, hasan ham, ularga yaqini ham bor', dedi. Amir: 'Menga faqat sahihlarini ajratib bering!' dedi. Shunda Nasoiy u uchun 'Sunani sug'ro' kitobini yozib, uni 'Mujtabo minas-sunan' deb nomladi. Ushbu kitobga 5758 ta hadis kiritilgan bo'lib, boshqa sunan kitoblari kabi fiqhiy boblar asosida tartiblangan. Ulamolar: 'Sunani Nasoiy' daraja jihaitdan 'Sahihayn'dan keyin turadi, chunki u 'Sunan'kitoblari orasida zaif hadislari eng kam kitobdir', deyishgan. Bu kitob bizgacha yetib kelgan bo'lib, unda olti mingga yaqin hadis jamlangan. U birinchi marta hijriy 1256 sanada (milodiy 1840) Hindistonda chop etilgan.\r\nImom Nasoiy (milodiy 303 hijriy 915) yili Makkada (ba'zi rivoyatlarga ko'ra Romlada) vafot etgan."
        ]
    },
    {
        "word": "Mujtahid ",
        "type": [],
        "definition": [
            "intiluvchi, g'ayrat qiluvchi. Ijtihod qilish darajasiga yetgan faqih olim. O'rta asrlarda islomda ijtihod huquqiga ega bo'lgan, ya'ni mustaqil ravishda diniy aqidaviy va huquqiy masalalar bo'yicha xulosa bera oladigan va hukm chiqara olgan shaxs. Sunniylikda oliy darajadagi mujtahidlar deb mazhabboshilar (imom Abu Hanifa, imom Shofe'iy, imom Molik, imom Ahmad ibn Hanbal) e'tirof etilgan."
        ]
    },
    {
        "word": "Muzammam",
        "type": [],
        "definition": [
            "'Muzammam' so'zi ma'noda 'Muhammad' so'zining teskarisi bo'lib, 'yomonlangan', 'mazammat qilingan' degan ma'noni anglatadi. Quraysh kofirlari Rasululloh sollallohu alayhi vasallamga bo'lgan adovatlari qattiqligidan u zot alayhissalomni ana shu so'z bilan ham tilga olishar edi. Holbuki, Alloh O'zi u zotga Muhammad degan ismni ravo ko'rgan va mazkur mushriklardan boshqa hamma u zotni Muhammad deb atar edi."
        ]
    },
    {
        "word": "Muzaffar al-Gʻaziniziy al-Kotiy",
        "type": [],
        "definition": [
            "Abul Osim Muzaffar ibn Ahmad al-G'aziniziy al-Kotiy Faqih, fozil, chiroyli siyratli va shariat qoidalariga rioya qiluvchi edilar. Abul Qosim Hibbatulloh ibn Muhammad ash-Shayboniydan ta'lim olganlar. U zotni Xorazmda uchratdim va ba'zi narsalarni yozib oldim. Hijriy 499 (milodiy 1106) yilning shavvol oyida tavallud topganlar"
        ]
    },
    {
        "word": "Muzaffar al-Hijjiy al-Kotiy",
        "type": [],
        "definition": [
            "Abu Osim Muzaffar ibn Ahmad al-Hijjiy al-Kotiy Bu kishi Xorazm ahlidan bo'lib, faqih, fozil, chiroyli siyratli, xayrli ishlarga bosh-qosh bo'luvchi va shariat qoidalariga rioya qiluvchilardan edilar. Ilm talabida Bag'dodda bo'lib, u yerning mashhur olimi Abul Qosim Hibbatulloh ibn Muhammad ash-Shayboniydan ta'lim olganlar. Xorazmda u kishidan hadis ilmidan dars olganman. Hijriy 496 (milodiy 1103) yilning shavvol oyida tavallud topganlar"
        ]
    },
    {
        "word": "Muzaffat ",
        "type": [],
        "definition": [
            "Muzaffat – zift bilan bo'yalgan idish. Mesh va sanoch kabi idishlarni suv o'tmaydigan qilib mustahkamlash uchun ishlatiladigan yelimsimon qora modda zift deb atalgan"
        ]
    },
    {
        "word": "Muzdalifada turish",
        "type": [],
        "definition": [
            "Hanafiy mazhabiga binoan, o'ninchi Zulhijjaning tongi otgandan so'ng bir lahza bo'lsa-da, tupish kerak."
        ]
    },
    {
        "word": "Muzzammil surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 20 oyatdan iborat.\r\nUshbu surai karimaning nomi o'zining birinchi oyatidan olingandir. 'Muzzammil' so'zi lug'atda 'o'ranib oluvchi' degan ma'noni bildiradi. Ushbu sura Iqro' surasidan keyin nozil bo'lgan ikki suraning biri bo'lib, Nabiy sollallohu alayhi vasallam o'ranib yotganlarida, Jabroil alayhissalom kelib, 'Ey o'ranib yotgan', deb xitob qilganlari tufayli 'Muzzammil' deb nomlanib qolgan. Demak, 'Muzzammil'dan murod Muhammad sollallohu alayhi vasallamdirlar.\r\nBu sura Payg'ambarimiz Muhammad sollallohu alayhi vasallamning ulkan hayotlarining bir tarafini bayon qiladi: Alloh taologa toatlari, bu o'tkinchi dunyo tashvishlaridan ajrab chiqishlari, kechalarini ibodat bilan bedor o'tkazishlari, Alloh taoloning kitobini tilovat qilishlari va hokazo.\r\nSura boshidan oxirigacha Nabiy alayhissalom haqlarida. Shuning uchun ham ul zoti bobarakotning ismlaridan biri Muzzammildir.\r\nSura Nabiy alayhissalomga qilingan nozik nido bilan boshlanadi. So'ngra vahiyni qabul qilib olish qiyin ish ekani, uni odamlarga yetkazish uchun yana harakat, urinish zarurligi ta'kidlanadi. Bu og'ir, mashaqqatli ishni ado etishda kechalari ibodat qilib, ruhiy tayyorgarlik ko'rish zururligi bayon qilinadi.\r\nYana bu surada mushriklarning Rasulullohga berayotgan ozorlariga sabr-bardosh ila javob qilish, ularning davrasidan chiroyli uslub bilan chetlashishga amr etiladi.\r\nSo'ngra Alloh taolo mushriklarga itob qilib, qiyomat kuni qattiq azobga qolishlari, u vaqtdagi qo'rqinch va dahshatdan bolalarning ham sochlari oqarib ketishini ta'kidlaydi.\r\nSuraning oxirida esa Alloh taolo kechasi qilinadigan ibodatni Nabiy alayhissalomga va mo'minlarga shafqat yuzasidan yengillatganining xabari keladi.\r\nBu surai karimaning nozil bo'lish sababidagi rivoyatda naql qilinishicha, payg'ambarlik kelishidan uch yil avval Muhammad sollallohu alayhi vasallamda Makkai Mukarrama yaqinidagi Hiro g'orida bir yilda bir oy (Ramazon oyida) 'tahannus' ibodati, ya'ni g'orda o'tirib, ruhiy poklanish odati paydo bo'lgan edi.\r\nUl zot o'sha yerga kelgan miskinlarga (beva-bechoralarga) taom berardilar. Vaqtni ko'proq ibodatda o'tkazib, borliq va undagi ajoyibotlar haqida tafakkur qilardilar. O'z qavmlari e'tiqod qilayotgan diyonatdan ko'ngillari to'lmasdi. U kishi ochiq-oydin hayotiy yo'lni izlardilar.\r\nBunday tanholikni xohlab qolishlari ham Alloh taoloning kelajak ishlarni o'ylab qilgan tadbiri edi. Chunki bu zotni kelajakda ulkan ishlar kutmoqda edi.\r\nVa, nihoyat, kutilgan o'sha ulug' ish sodir bo'ldi. Kunlardan birida Jabroil farishta kelib, Muhammad sollallohu alayhi vasallamga 'Iqro'', ya'ni 'O'qi! Seni yaratgan Robbingning nomi bilan o'qi!' – dedilar. Shu tarzda Qur'oni Karimning birinchi oyatlari nozil bo'ldi.\r\nKeyin vahiy kelishi bir muddat to'xtab qoldi. Kunlardan bir kun Nabiy alayhissalom tog'da ketayotganlarida, Jabroil alayhissalom o'zlarining asl holatlarida, butun ufqni qoplagan holda ko'rindilar. Muhammad alayhissalom qo'rqib ketdilar. O'z ahllari huzuriga titrab-qaqshagan holda kirib bordilar va 'Meni o'rab qo'yinglar', – dedilar. O'sha qo'rqinch ta'sirida titrab yotganlarida, Jabroil alayhissalom kelib: 'Yaa ayyuhal muzzammil' – 'Ey o'ranib yotgan', – dedilar, ya'ni Qur'onning ikkinchi surasi – siz bilan biz tafsirini o'rganayotgan Muzzammil surasi nozil bo'la boshladi."
        ]
    },
    {
        "word": "Muzobana ",
        "type": [],
        "definition": [
            "'Muzobana'–'zabn' 'qaytarish' so'zidan olingan bo'lib, bir narsani olib o'rniga boshqa narsani qaytarish ma'nosini bildiradi. Voqe'likda esa, bir mevaning ho'lini olib qurug'ini qaytarishga aytiladi. Misol uchun, daraxtda turgan ho'l xurmoni olib o'rniga quruq xurmo yoki tokdagi uzumni olib o'rniga mayiz qaytarish. Bu holatda ham savdoda aniqlik bo'lmaydi. Ho'l meva quritilganda o'z o'rniga olingan quruq meva sifati va miqdoriga to'g'ri keladimi, yo'qmi ma'lum emas."
        ]
    },
    {
        "word": "Muzoraba ",
        "type": [],
        "definition": [
            "'Muzoraba' 'yer yuzida yurish' ma'nosini anglatadi. Chunki, bu ishni yurituvchi yer yuzida talabi kasb qilib yuradi. Muzorabada ra'sulmol bir tomondan, xizmat ikkinchi tomondan bo'ladi. Molning egasi ishchi bilan kelishib, molni unga beradi. Tushgan foyda kelishuvga asosan bo'lib olinadi. Zarar mol egasiga bo'ladi. Ishchi esa, qilgan mehnatidan zarar ko'radi, xolos. Muzoraba Qur'on, Sunnat, Ijmo' va Qiyos ila sobit bo'lgandir"
        ]
    },
    {
        "word": "Muzoraba shirkati",
        "type": [],
        "definition": [
            "Bunda ra'sulmol bir tomondan, xizmat ikkinchi tomondan bo'ladi. Molning egasi ishchi bilan kelishib, molni unga beradi. Tushgan foyda kelishuvga asosan bo'lib olinadi. Zarar mol egasiga bo'ladi. Ishchi esa, qilgan mehnatidan zarar ko'radi, xolos."
        ]
    },
    {
        "word": "Muzoraʼa ",
        "type": [],
        "definition": [
            "'Muzora'a' arab tilidagi 'ziroat' so'zidan olingan bo'lib, 'o'stirish' ma'nosini bildiradi. Muzora'a ishning ikki tomondan bajarilishini aks ettiradi va bizning tilimizda 'ziroatda sherikchilik qilish' deyiladi. Muzora'ani ba'zilar Muxobara yoki Muhoqala ham deydilar. Hammasi 'sherikchilik asosida yerga ishlov berish' ma'nosini bildiradi. Shar'iy istilohda esa: 'Muzora'a' hosilning ba'zisiga sheriklik uchun tuzilgan shartnomadir. Xulosasini aytadigan bo'lsak, muzora'a yer egasi bilan dehqon orasida hosilni hissaga qarab taqsimlab olish, shartnoma tuzib ish yuritishdir. Abu Hanifa rahimahullohuning nazdida, u to'g'ri emas. Shuningdek, imom Zufar va imom Shofe'iy ham 'muzora'a durust emas', deganlar."
        ]
    },
    {
        "word": "Mukallaf ",
        "type": [],
        "definition": [
            "'Mukallaf' deganda aqli raso, balog'atga yetgan shaxs qasd qilinishini yaxshi bilamiz. Ba'zi bir ta'riflarda 'mukallaf' so'zining o'rniga to'g'ridan-to'g'ri 'oqil va balog'atga yetgan shaxs' deb ketilgani ham bor. 'Mukallaf' shariat hukmlari unga nisbatan taklif qilingan, ya'ni, qilishi farz bo'lgan shaxs tushuniladi. Bu yerda asosan balog'atga yetganlik va oqillik ko'zda tutilgan."
        ]
    },
    {
        "word": "Mukammilot",
        "type": [],
        "definition": [
            "Farz namozlaridan avval va keyin o'qiladigan sunnat namozlar"
        ]
    },
    {
        "word": "Mukammilot ",
        "type": [],
        "definition": [
            "Farz namozlaridan avval va keyin o'qiladigan sunnat namozlar."
        ]
    },
    {
        "word": "Mukotab ",
        "type": [],
        "definition": [
            "ozod bo'lish uchun to'lov to'lashga xojasi bilan shartnoma tuzgan qul."
        ]
    },
    {
        "word": "Mukotaba ",
        "type": [],
        "definition": [
            "Mukotaba – mamluk (qul yoki cho'ri) bilan xoja orasidagi shartnoma bo'lib, unga ko'ra, mamluk kelishuvdagi qiymatni ma'lum muddatda to'lashi bilan ozod bo'ladi"
        ]
    },
    {
        "word": "Muqaddimatun fis sarf",
        "type": [],
        "definition": [
            "Arab tili qoidalari haqidagi fors tilidagi asarni Sayyid Sharif Jurjoniy rahmatullohi alayhi yuqoridagi nom bilan atagan"
        ]
    },
    {
        "word": "Muqayyar ",
        "type": [],
        "definition": [
            "Muqayyar – qiyrlangan idish. Qiyr bir o'simlik bo'lib, quritib kuydirilgan va undan olingan modda bilan idishlar mustahkamlash maqsadida bo'yalgan. Aslida 'muqayyar' bilan 'muzaffat' bitta narsa, ya'ni bir xil idish. Shuning uchun Ibn Abbos roziyallohu anhu gohida 'muzaffat' so'zi o'rniga 'muqayyar' so'zini ishlatar edi."
        ]
    },
    {
        "word": "Muqim ",
        "type": [],
        "definition": [
            "bir joyda yashovchi, musofirning aksi, istiqomat qiluvchi, tub joy aholisi"
        ]
    },
    {
        "word": "Muqobala",
        "type": [],
        "definition": [
            "Qulog'ining bir tomoni kesilgan hayvon"
        ]
    },
    {
        "word": "Muqoddimatu ulumil hadis",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari"
        ]
    },
    {
        "word": "Muqotil az-Zohid al-Baydariy",
        "type": [],
        "definition": [
            "Abul Hasan Muqotil ibn Sa'd az-Zohid al-Baydariy Buxoro ahlidan bo'lib, bu nisbat bilan tanilgan taqvodor, parhezkor kishi edilar. Iso ibn Muso al-G'unjor va Ahmad ibn Hafsdan hadis rivoyat qilganlar. O'zlaridan esa Sahl ibn Shozavayh al-Buxoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muqriy ",
        "type": [],
        "definition": [
            "Muqriy – Qur'on o'qituvchi ustoz"
        ]
    },
    {
        "word": "Muqtadiy ",
        "type": [],
        "definition": [
            "Imomga iqtido qiluvchi"
        ]
    },
    {
        "word": "Mulk surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 30 oyatdan iborat.\r\nUshbu surai karima o'zining birinchi oyatida kelgan 'Mulk' – 'podshohlik' so'zi bilan nomlangan. Ko'pchilik uni o'zining birinchi so'zi bilan nomlab, Taborak surasi deb ham ataydilar.\r\nMakkada nozil bo'lgan boshqa suralar kabi, bu sura ham aqiyda masalasini muolaja qiladi. Mulk surasi uchta bosh maqsadni o'z ichiga olgan:\r\n1. Allohning azamati, tiriltirish va o'ldirishga qodirligini bayon qilish;\r\n2. Allohning yagonaligiga dalil va hujjatlar keltirish;\r\n3. Qiyomatga va o'lgandan so'ng qayta tirilishga ishonmaydiganlarning oqibati nima bo'lishidan xabar berish.\r\nSura birinchi maqsadni tushuntirish bilan boshlanadi. Butun mulk va hukmronlik Alloh taoloning qo'lidaligi, Alloh taolo butun borliqning Boshqaruvchisi ekani, barcha narsa Unga bo'yin egishi, Alloh hamma narsani O'zi yaratishi – yo'qdan bor qilishi, jon ato etishi va o'ldirishi haqida so'z ketadi.\r\nSo'ng yetti osmonning yaratilishi, Alloh taolo bu dunyo osmonini yulduzlar bilan ziynatlab qo'ygani va bularning barchasi Uning yagonaligi va qudratiga dalil ekaniga ishora qilinadi.\r\nShundan keyin Alloh taolo siz bilan bizga o'rnak tarzida gunohkorlar haqida batafsil xabar beradi. 'Ular g'azabidan yorilib ketay deb qaynab turgan jahannamni ko'radilar', – deydi Haq subhanahu va taolo. Surada kofirlar bilan mo'minlarning boradigan joylari taqqoslanadi.\r\nAlloh taolo O'z ulug'ligi va qudratiga dalil hamda hujjatlar keltirganidan so'ng, g'azabi va azobidan ehtiyot bo'lishga da'vat qiladi.\r\nSurai karimaning oxirida Payg'ambar sollallohu alayhi vasallamning payg'ambarliklarini yolg'onga chiqarmoqchi bo'lganlarga Alloh taoloning azobi tushishidan ogohlantiriladi.\r\nShuning uchun bu sura 'Saqlovchi' va 'Najot beruvchi' deb ham ataladi, chunki u bandalarni katta azobdan saqlaydi. Imom Termiziy rivoyat qilgan hadisi sharifda Nabiy sollallohu alayhi vasallam: 'U man qiluvchi va najot beruvchidir, qabr azobidan najot beradi', – deganlar. Keling endi, azizlar, Allohning irodasi bilan surai karimani tafsir qilishga kirishaylik."
        ]
    },
    {
        "word": "Mulk shirkati",
        "type": [],
        "definition": [
            "Mulk shirkati. Bunda ikki (va undan ortiq) kishi bir narsaga molik bo'ladilar. Ushbu egalik meros, savdo, sovg'a, sadaqa, vasiyat, molini qo'shib yuborish kabi ishlar bilan bo'ladi. Ulardan har biri o'z sherigining moliga nisbatan ajnabiydir. Biri ikkinchisining ruxsatisiz sherigining molini tasarruf qila olmaydi. Ammo o'z ulushini tasarruf qilsa, bo'ladi. Molni aralashtirib yuborilganda esa, sherigining iznisiz umuman tasarruf qila olmaydi"
        ]
    },
    {
        "word": "Mulomasa ",
        "type": [],
        "definition": [
            "'Mulomasa' lug'atda, 'ushlab ko'rish' ma'nosini anglatadi. Amalda esa, matnda kelganidek, 'ushlaganini olish' qoidasi asosida savdo qilinadi. Savdo molini aylantirib ko'rish, yaxshilab tekshirishga imkon berilmaydi. Qo'ling tegdimi, olasan, deb turib olinadi. Albatta, bu g'irromlikdan iborat narsa. Savdo ikki tomonning o'zaro roziligi bilan, molning aybi bo'lsa aytib, ko'rib, aynish ixtiyori bilan bo'lishi kerak."
        ]
    },
    {
        "word": "Muloʻana ",
        "type": [],
        "definition": [
            "Mulo'ana (mubohala ham deyiladi) ‒ o'zaro la'natlashish. Bir masala ustida tortishib, har biri o'zining haq ekanini da'vo qilib turgan taraflarning 'Kim nohaq bo'lsa, unga Allohning la'nati bo'lsin', deb la'nat o'qishi."
        ]
    },
    {
        "word": "Mulhid ",
        "type": [],
        "definition": [
            "dinsiz kishi"
        ]
    },
    {
        "word": "Moʻmin ",
        "type": [],
        "definition": [
            "'Mo'min' – G'ofir surasining yana bir nomi"
        ]
    },
    {
        "word": "Mumsik ",
        "type": [],
        "definition": [
            "Mumsik – o'taketgan xasis, baxil, ziqna kishi"
        ]
    },
    {
        "word": "Mumtahana surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 13 oyatdan iborat.\r\n'Mumtahina' so'zining ma'nosi 'imtihon qiluvchi ayol'dir. Sura ichida 'Mo'min bo'ldim', deb kelgan ayollarning iymonini imtihon qilib ko'rishga buyruq bor.\r\nBa'zi rivoyatlarda bu sura 'Mumtahana' deb ham nom olgani aytilgan. U holda 'imtihon qilingan ayol' ma'nosini anglatadi.\r\nMadinada nozil bo'lgan boshqa suralar kabi bu sura ham shariat hukmlari haqida so'z yuritadi. Suraning asosiy mavzusi Alloh uchun yaxshi ko'rish va Alloh uchun yomon ko'rishdir. Chunki iymonli kishi birovga muhabbat qo'ysa, Alloh uchun qo'yadi. Va, aksincha, birovni yoqtirmasa, Alloh uchun yoqtirmaydi.\r\nSuraning boshlanishida mo'minlarga ozor berganlarni – Allohning dushmanlarini do'st tutmaslik haqida so'z ketadi. So'ngra qarindoshlik, naslu nasab va do'st-birodarlik qiyomat kuni hech qanday foyda bermasligi, balki faqat iymon va yaxshi amallargina manfaat berishi eslatib o'tiladi.\r\nUndan keyin Ibrohim alayhissalom va u zotga ergashgan mo'minlarning o'z qavmlaridan yuz o'girib, iymonlarini saqlashga harakat qilganliklari siz bilan bizga o'rnak bo'lishi uchun eslatma sifatida keltiriladi.\r\nSo'ngra mo'minlarga dushmanlik qilmagan, ularga qarshi urush qilmagan g'ayridinlar to'g'risidagi hukm va mo'minlarga ozor berib, ularga qarshi urush qilgan g'ayridinlar to'g'risidagi hukm zikr qilinadi.\r\nShuningdek, surada hijrat qilib kelgan ayollarni imtihon qilib, iymonlari sobit bo'lsa, ularni kofirlarga qaytarmaslikning bayoni keladi. So'ng ayollarning Rasuli Akramga bay'at (ahdnomalari) hukmi va uning shartlari haqida so'z ketadi. Va, nihoyat, suraning oxirida yana takror, kofirlarni do'st tutmaslik haqida oyatlar keladi.\r\nSurai karima oyatlarini yaxshiroq anglab yetish uchun mazkur oyatlar nozil bo'lgan davrdagi siyosiy, ijtimoiy va ruhiy holatlarni yaxshi tushunmoq kerak bo'ladi.\r\nHijratdan so'ng Madinai Munavvarada alohida Islom jamiyati shakllanib, musulmonlar boshqalardan ajralib, o'zlariga xos qonun-qoidalar asosida yashay boshladilar. Albatta, yangi jamiyat o'zining shakllanish jarayonida turli to'siqlarga duch keladi. Bu yerda ham yangi-yangi muammolar paydo bo'ladi. Masalan, kimni do'st, kimni dushman tutish kerak, boshqa dindagilar bilan aloqalar qanday bo'ladi, ayniqsa, ayollar masalasiga qanday yondoshmoq kerak, erkaklar xususida tuzilgan shartnomaga ayollar ham qo'shiladimi yoki ularga o'ziga xos muomala qilinadimi, kabi savollarga ushbu surai karimada javob topamiz. Suraning avvalgi oyatlarining nozil bo'lish sababi haqidagi rivoyat ham yuqoridagi fikrni tasdiqlaydi.\r\nBadr urushi ishtirokchilaridan bo'lgan sahobiy Hotib ibn Abi Balta'a Makkadan Madinaga ko'chib kelgan edi. Makkada uning bola-chaqasi va mol-dunyosi qolgandi. O'zi quraysh qabilasidan bo'lmay, ularga do'st tutinganlardan edi. Quraysh qabilasi ahdnomani buzgandan so'ng, Rasululloh Makkani fath etishga ahd qildilar va musulmonlarni g'azotga tayyorgarlik ko'rishga buyurdilar. O'sha paytda u zot 'Allohim, bizning xabarimizni ulardan berkitgin', deb duo ham qildilar. Hotib ibn Abi Balta'a Nabiy alayhissalomning g'azotga qasd qilganliklari haqida xat yozib, bir ayol kishi orqali quraysh qabilasiga yubordi. Alloh taolo Nabiy alayhissalomning duolarini qabul aylab, buning xabarini u zotga bildirdi. Nabiy alayhissalom hazrati Ali, Zubayr ibn Avom va Miqdodni chaqirib: 'Tezda yo'lga otlaninglar, sizlarga bir bog' duch keladi, u yerdan bir ayolni topasizlar, unda xat bor, o'sha xatni olib, qaytinglar', – dedilar. Uchovlon ot choptirib, boqqa yetib borib, o'sha ayolni topishdi va 'Xatni chiqar', – deyishdi. Ayol 'Menda xat yo'q', – dedi. Shunda uchovlon xatni qidirib bo'lsa ham topishlariga ishora qilib: 'Yo xatni chiqarasan, yo kiyimlaringni yechasan!' – deyishdi.\r\nAyol nochor qolgach, soch turmaklari orasidan xatni chiqarib berdi. Uchovlari xatni olib, Nabiy alayhissalomning huzurlariga olib borishdi. Qarashsa, Hotibning mushriklarga yozgan xati ekan.\r\nNabiy alayhissalom:\r\n– Ey Hotib, bu nima? – dedilar.\r\nShunda Hotib:\r\n– Iltimos, shoshilmang, men sizning g'olib kelishingizni yaxshi bilardim. Men Quraysh a'zosi emasman, boshqa muhojirlarning Makkadagi qarindoshlarini himoya qiladigan kishilari bor, men ham nasabdan bo'lmasa-da, biror yo'l bilan Makkadagi yaqinlarimni himoya qilish yo'lini o'ylagan edim. Buni kofirligim uchun yoki dindan qaytib, murtad bo'lganim uchun qilganim yo'q, – dedi.\r\nNabiy alayhissalom:\r\n– To'g'ri aytding, – deb, uni kechirdilar.\r\nAna o'shanda Alloh Mumtahana surasining avvalgi oyatlarini nozil qilib, bu masaladagi O'z hukmlarini bayon qildi."
        ]
    },
    {
        "word": "Munabbih al-Bardaiy",
        "type": [],
        "definition": [
            "Abu Ahmad Munabbih ibn Abdulmajid al-Bardaiy Samarqandda yashaganlar. Fozil kishi va ahli sunna edilar. Abu Naim al-Astrobodiy va Abu Bakr Muhammad ibn Mahdiy al-Ixmimiydan hadis rivoyat qilganlar. Abu Sa'd al-Idrisiy aytadilar: 'Hijriy 370 (milodiy 981) yildan oldin Samarqandda u kishidan hadis yozib olganman'"
        ]
    },
    {
        "word": "Munaqqid",
        "type": [],
        "definition": [
            "Tanqidchi"
        ]
    },
    {
        "word": "Munjidul muqriin va murshidut-tolibin ",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Munkar ",
        "type": [],
        "definition": [
            "inkor etilgan, rad qilingan, qaytarilgan amal"
        ]
    },
    {
        "word": "Munkar va nakir",
        "type": [],
        "definition": [
            "o'lganlarni qabrda dastlabki so'roq qiluvchi ikki farishtaning nomi"
        ]
    },
    {
        "word": "Munobaza ",
        "type": [],
        "definition": [
            "'Munobaza' so'zi lug'atda 'irg'itish' ma'nosini bildiradi. Amalda esa, 'Qachon senga ushbu kiyimni tashlasam, savdo vojib bo'lur', deb shart qo'yishlikdir. Bu ham g'irt g'irromlikning o'zginasi. Shuning uchun ham, Islom bunday zolimona savdoni harom qilgan. Hozirda ham moli kasodga uchrab, savdosi yurishmay qolgan ba'zi savdogarlar shunga o'xshash ishlarni qilishga o'tadilar. Bu esa, shariatga to'g'ri kelmaydi. Musulmonlar bunday ishlardan ogoh bo'lishlari kerak"
        ]
    },
    {
        "word": "Munovala ",
        "type": [],
        "definition": [
            "Munovala – shayxning o'zi eshitib qabul qilgan 'asl'ni yoki 'far''ni tolibi ilmga berib, 'Bu mening eshitganim' yoki 'falonchidan rivoyatim' deb, 'Buni mendan rivoyat qilavergin' yoki 'Buni mendan rivoyat qilishingga ijozat berdim' kabi so'zlar bilan ijozat berishidir. Bunda shayx tolibni nusxaga ega qilib qo'yadi yoki 'Buni olib, nusxa ko'chir va uni solishtir, so'ng uni menga qaytar', deydi. Asl – asl nusxa, far' – asldan ko'chirilgan nusxa"
        ]
    },
    {
        "word": "Munozara ",
        "type": [],
        "definition": [
            "bahs-munozara, ilmiy bellashuv"
        ]
    },
    {
        "word": "Munofiq",
        "type": [],
        "definition": [
            "tovlamachi, firibgar, aldoqchi, ikkiyuzlamachi, sotqin, xoni, dili boshqa tili boshqa; mug'ambir; dilida imoni yo'q, lekin jonini yoki molini saqlab qolish uchun xiyonat maqsadida musulmonlar safiga qo'shilgan"
        ]
    },
    {
        "word": "Munofiqun surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 11 oyatdan iborat.\r\nBu surai karimada ham shariat ahkomlari, Islomning amaliy taraflari haqida so'z ketadi. Asosan Madinada yuzaga kelgan nifoq va munofiqlar haqida so'z yuritiladi. Suraning 'Munofiqun' – 'Munofiqlar' deb atalishining boisi shundan.\r\nSurai karimaning avvalida munofiqlarning xulqlari, ularning razil sifatlari, jumladan, yolg'onchiliklari, ichlari boshqa-yu, ustilari boshqa, dillari o'zga-yu, tillari o'zga ekani bayon etiladi.\r\nSo'ngra ularning Nabiy alayhissalomga va musulmonlarga qarshi uyushtirgan fitnalari haqida xabar beriladi. Munofiqlar sirtdan musulmonlikni ko'rsatib, aslida, din uchun hatto kofirlar ham qila olmaydigan yomonliklarni qilishlari bayon etiladi. Sirtdan musulmonlik da'volariga ko'pchilik ishonib qolishi mumkin, shuning uchun ularning dinga, musulmonlarga yetkazadigan zararlari kofirlar yetkazadigan zararlardan ham ko'ra xatarliroqdir.\r\nBinobarin, ular do'zaxda tortadigan azob ham kofirlarga beriladigan azobdan ko'ra kuchliroq bo'ladi.\r\nBu surada yana munofiqlarning Nabiy alayhissalom sha'nlariga aytgan behayo so'zlari, u kishining ishlari oxiriga yetmaydi, degan e'tiqodlari va boshqa kirdikorlari haqida so'z yuritiladi.\r\nSuraning oxirida musulmonlar munofiqlarga o'xshamaslikka, dunyo ziynatlariga, hoyi-havasga berilib, Allohning toat-ibodatini unutmaslikka da'vat qilinadilar. Vaqt borida Alloh yo'lida xayr-ehson qilib qolish kerakligi, keyingi afsus-nadomat foyda bermasligi ta'kidlanadi.\r\nAvval nifoq va munofiqlar haqida to'liqroq tushunchaga ega bo'lib olishimiz kelajakda oyati karimalarni yaxshi tushunishimizga yordam beradi.\r\nArab tilida 'nifoq' so'zi ichi bo'sh, tashqi ko'rinishi o'zgacha narsaga nisbatan ishlatiladi. Misol uchun, yumronqoziq yoki tulkining uyasi ham 'nifoq' deyiladi. Chunki ular ustidan oddiy yerga o'xshaydi, bir tarafdan kirsa, ikkinchi tarafdan chiqib ketaveradi. Hozirgi kunda ajnabiy tillarda 'tonnel' deb nomlanayotgan inshootlar ham arab tilida 'nafaq' deyiladi.\r\nAgar bu ma'noni diniy-aqiydaviy istilohda ishlatadigan bo'lsak, sirtdan musulmonlikni e'lon qilib, ichidan unga loyiq bo'lmaslik 'munofiqlik' deb ataladi. Odamlar ko'z o'ngida Islom diniga mansubligini e'lon qilib, hatto ba'zi amallarni ham qilib yuradigan, aslida e'tiqodi buzuq bo'lgan kishilar 'munofiq' deyiladi.\r\nKo'pgina hadisi shariflarda munofiqlarning alomatlari haqida so'z yuritilgan, ulardan birida Rasuli Akram alayhissalom: 'Munofiqning belgisi uchtadir: gapirsa, yolg'on gapiradi, omonatga xiyonat qiladi, va'da bersa, ustidan chiqmaydi. Kimda shu xislatlar bo'lsa, unda munofiqning barcha xislatlari jamlangan bo'ladi, agar bittasi bo'lsa, bitta xislati bo'ladi', – deganlar.\r\nMunofiqlarning ochiq-oydin kofirlardan ham katta xatarli ekanliklari shundaki, kofirlar bilan bo'ladigan aloqa va muomalalarda biz ularning kimligini e'tiborga olib, o'zlariga yarasha ish tutamiz. Munofiqlar esa sirtdan musulmon bo'lib ko'rinaveradilar. Odamning ichidagini bilish mumkin bo'lmagani uchun ularga ham musulmoncha muomala qilishga majbur bo'linadi. Bu bilan munofiqlarning dinga katta zararlar yetkazishlariga imkon yaratiladi.\r\nAynan mana shu holat ularga qiyomat kuni kofirlardan ko'ra ko'proq va alamliroq azob berilishiga sabab bo'ladi. Alloh taolo munofiqlar jahannamning eng qa'ridan joy olishlarini ta'kidlab aytgan.\r\nIslom dinining avvalgi paytlarida Makkai Mukarramada munofiqlik bo'lmagan. Hijratdan keyin musulmonlar Madinai Munavvarada alohida jamiyat bo'lib, 'ko'kraklariga shamol tegib' yashay boshlaganlaridan so'nggina bu dard paydo bo'ldi.\r\nMakkada musulmonlar oz sonli, zaif bo'lib, xohlagan kishi ularga bemalol zulm o'tkazar va azob berar edi. Odatda bunday paytda faqat haqiqiy mo'minlargina sabr-chidam bilan dinlarini mahkam ushlaydilar. Madinada esa musulmonlar kuch-quvvatga, o'z davlatlariga ega bo'ldilar, ular bilan hisoblashmaslikning iloji qolmadi. Shunday bir paytda dillarini mog'or bosgan, qalblarida marazi bor ba'zi kimsalar munofiqlik yo'liga o'tdilar. Allohdan emas, Allohning bandalaridan qo'rqib, Islomga yuzaki kirdilar.\r\nUshbu surai karima munofiqlarning ko'pgina kirdikorlarini fosh qiladi. Jumladan, ular turli yolg'on mish-mishlar tarqatadilar, musulmonlarni ma'naviy-ruhiy tarafdan zaiflashtirishga, ularning qalblarida iymonni susaytirishga va umidsizlikni kuchaytirishga harakat qiladilar.\r\nMunofiqlik turli axloqiy razilatning uyasidir. Riyokorlik, aldamchilik, xiyonat, yolg'onchilik, ikkiyuzlamachilik, va'daga xilof qilishlar shular jumlasidandir. Munofiqlik har bir ummatning jismini titib yuboradigan ijtimoiy kasallikdir.\r\nMunofiqun surasining nozil bo'lish sabablari haqidagi rivoyatlarni muxtasar qilib keltiradigan bo'lsak, ko'z o'ngimizda quyidagi voqea namoyon bo'ladi.\r\nBanu Mustalaq qavmi bilan bo'lgan urushga Nabiy alayhissalomga va mo'minlarga qo'shilib, jihod uchun emas, balki o'lja olish umidida munofiqlar ham chiqishgan edi.\r\nG'azot Nabiy alayhissalomning g'alabalari bilan tugab, barcha ortga qaytayotganda, yo'lda Sinan va Jahjah ismli kishilar quduq ustida suv talashib, urushib qoldilar. Jahjah Sinanni urib, yuzini qonatdi. Sinan:\r\n'Ey xazrajliklar! Bormisan?!' – dedi, ular yugurib keldilar. O'z navbatida Jahjah:\r\n'Ey qurayshliklar! Bormisan?!' – dedi, ular ham yugurib keldilar. Orada fitna chiqadigan holat paydo bo'ldi. Muhojirlardan bir guruhi fitnaning oldini oldilar. Bu xabar munofiqlarning boshlig'i Abdulloh ibn Ubayga yetib borganida, u: 'Allohga qasamki, sizlar bilan anavi qurayshliklar xuddi eskilarning 'Itingni semirtirsang, o'zingni qopadi' degan gapiga o'xshaysizlar. O'zingizga o'zingiz qildingiz. Ularga uylaringizni bo'shatib berdingiz. Molu mulkingizni sarfladingiz. Ular kuchli bo'ldilar. Siz zaiflashdingiz. Allohga qasamki, agar siz yordam bermasangiz, anavining (Payg'ambarning) atrofidagilar tarqab ketishadi. Madinaga yetib borganimizda aziz undan (Madinadan) xorni chiqaradi', – dedi.\r\nAbdulloh ibn Ubay 'aziz' deganda o'zini nazarda tutmoqda. 'Xor' deganda esa Nabiy alayhissalomni ko'zda tutgan.\r\nO'sha yerda Zayd ibn Arqam ismli balog'atga yetmagan yigitcha ham turgan edi. Nabiy alayhissalomga borib, bo'lib o'tgan gap-so'zlarni aytdi. Ul zot Abdulloh ibn Ubayni olib kelishni buyurdilar va:\r\n– Shu gaplarni sen aytdingmi? – dedilar. U bo'lsa:\r\n– Senga Qur'onni nozil qilgan Zot bilan qasamki, bu gaplardan bittasini ham aytganim yo'q, Zayd yolg'onchi ekan, – dedi. O'sha yerda hozir bo'lgan musulmonlar:\r\n– Kichkina bolaning gapiga ishonaverish kerak emas, balki adashgandir, – deyishdi. Rasululloh uni kechirdilar. Ansoriylar Zaydni malomat qilishdi, yolg'onchiga chiqarishdi. So'ngra Alloh taolo Munofiqun surasini nozil qilib, Zaydning so'zini tasdiqladi va Abdulloh ibn Ubayning yolg'onini fosh qildi."
        ]
    },
    {
        "word": "Muoviya ibn Abu Sufyon",
        "type": [],
        "definition": [
            "Muoviya ibn Abu Sufyon ibn Harb Qurayshiy al-Umaviy, onalari Hind binti Utba ibn Robiy'a, kunyalari Abu Abdurrohman, Quraysh qabilasidan, Umaviylar davlatining asoschisi.\r\nHijratning sakkizinchi sanasida Fath kunida Islomga kirganlar. Rasululloh sollallohu alayhi vasallamning vahiy kotiblaridan bo'lganlar. Rasululloh sollallohu alayhi vasallam bilan Hunayn g'azotida ishtirok etganlar. Islomda ulug' fotihlardan bo'lib, u kishi qilgan fathlar Atlantika okeanigacha yetib borgan.\r\nU zot Abu Bakr roziyallohu anhuning xalifalik davrlarida Islom askarlariga qo'mondonlik qilganlar.\r\nUmar ibn Xattob roziyallohu anhu davrlarida to'rt yil, Usmon roziyallohu anhuning xalifalik davrlarida o'n ikki yil, Ali roziyallohu anhuning xalifalik davrlarida to'rt yil chamasi Shomga voliy bo'lganlar. Mana shu vaqtda u kishi bilan Ali roziyallohu anhu o'rtalarida kelishmovchilik chiqadi. Muoviya Shomda o'zlarini xalifa deb e'lon qiladilar. Bu ishning oxiri Ali roziyallohu anhuning o'limlari bilan tugaydi. Otalarining vafotidan so'ng xalq Hasan roziyallohu anhuga bay'at qiladilar. Ammo Hasan roziyallohu anhu bu fitnalar barham topishi uchun hijratning 41-sanasida xalifalikni Muoviyaga topshiradilar.\r\nMuoviya roziyallohu anhu hammasi bo'lib, 163ta hadis rivoyat qilganlar. U kishidan Abdulloh ibn Abbos, Abu Dardo, Jarir ibn Abdulloh, Nu'mon ibn Bashir, Abdulloh ibn Umar, Abdulloh ibn Zubayr, Abu Sa'iyd al-Xudriy, Soib ibn Yaziyd, Abu Umoma ibn Sahl, tobe'inlardan Sa'iyd ibn Musayyib, Xolid ibn Abdurrohman, Ibn Siyriyn va boshqa kishilar rivoyat qilganlar.\r\nPayg'ambarimiz sollallohu alayhi vasallam: 'Ey Alloh, Muoviyani hidoyat qiluvchi, hidoyat topgan va u sababli hidoyat topiladigan qil', deb duo qilganlar.\r\nUmar ibn Xattob Muoviyani arablar Kisrosi deb ataganlar.\r\nAbdulloh ibn Abbos: 'Muoviya diynda faqihlardan edi', deganlar.\r\nMuoviya ibn Abu Sufyon roziyallohu anhu hijratning 60-sanasida Shomda vafot etdilar"
        ]
    },
    {
        "word": "Muoz ibn Jabal",
        "type": [],
        "definition": [
            "Muoz ibn Jabal ibn Amr Ansoriy Xazrajiy, kunyalari Abu Abdurrahmon. O'n ikki yoshlarida Islomni qabul qilgan. Ikkinchi 'Aqaba' bay'atida ishtirok etgan. Rasululloh sollallohu alayhi vasallam bilan jamiki janglarda birga bo'lgan. U zot ulug' tabiatli, muloyim, chiroyli xulqli sahobalardan edilar.\r\nBu zot hammasi bo'lib 157ta hadis rivoyat qilganlar. U zotdan Abdulloh ibn Umar, Abdulloh ibn Abbos, Abdulloh ibn Amr ibn Oss, Jobir, Anas, Abu Sa'laba, Abu Qatoda kabi sahoba va tobe'iynlar rivoyat qilganlar.\r\nRasululloh sollallohu alayhi vasallam mar¬hamat qildilar:\r\n'Ummatimning ichida halol-haromni ajratuvchisi Muozdir'.\r\nRasululloh sollallohu alayhi vasallam yana:\r\n'Qiyomat kunida Muoz ibn Jabal ulamolarning imomidir', deb aytdilar.\r\nUmar ibn Xattob roziyallohu anhu aytadilar:\r\n'Xotinlar Muoz ibn Jabal singari farzand tug'ishdan ojizdirlar. Agar Muoz bo'lmasa, Umar halok bo'libdi'.\r\nRasululloh sollallohu alayhi vasallam Muoz roziyallohu anhuni Yamanga, diyn ta'limotlarini o'rgatish uchun yuborayotganlarida:\r\n'Ey Muoz, nima bilan hukm chiqarasan?' deb so'radilar.\r\nShunda Muoz roziyallohu anhu:\r\n'Allohning Kitobi bilan', deb javob berdilar.\r\n'Agar Allohning Kitobidan topolmasang-chi?' dedilar.\r\n'Allohning Rasulining sunnatlari bilan', dedi.\r\n'Undan ham topolmasang-chi?' dedilar.\r\n'Ra'yim ila ijtihod qilaman va bo'shashmayman', dedi.\r\nRasululloh sollallohu alayhi vasallamning yuzlari xursandlikka to'lgan holda:\r\n'Allohga hamdlar bo'lsin, Alloh Rasulining elchisini Allohni va Uning Rasulini rozi qiladigan narsaga yo'lladi', dedilar.\r\nMuhojirlardan bo'lgan Abdulloh ibn Mas'ud roziyallohu anhu Muoz ibn Jabalning tutingan islomiy birodari edilar.\r\nRasululloh sollallohu alayhi vasallam: 'Qur'onni to'rt kishidan olinglar', deb aytdilar. Shularning biri Muoz ibn Jabaldir.\r\nUmar ibn Xattob xalifalik davrlarida Falas¬tin yaqinidagi 'Amovas' degan joyga vabo kasali tarqaldi. Mana shu vabo sababli Muozning ikki xotinlari, o'g'li Abdurrahmon vafot etdi. Muoz ibn Jabal ham ushbu xastalik sababli hijratning 18-yili 38 yoshlarida bu olamdan ko'z yumdilar"
        ]
    },
    {
        "word": "Muoza roziyallohu anho",
        "type": [],
        "definition": [
            "Muoza binti Abdulloh al-Avsiya juda ham oqila ayol bo'lganlar. Har kuni kechasi olti yuz rakat namoz o'qib, uyqudan doimo o'zlarini tiyib yurar, qirq yil osmonga tik qaramagan ekanlar.\r\nKunyalari Ummu as-Suhba bo'lib, o'g'illari shahid bo'lgan ekan. O'g'illari jannatda bo'lganlari uchun 'Robbim meni o'g'lim Suhba bilan uchrashtirsa edi', deb duo qilar ekanlar.\r\nMuoza roziyallohu anho Oisha onamizdan, Hishom ibn Omir va Ummu Amr binti Abdullohdan bir necha hadislarni rivoyat qilgan ekanlar.\r\nU kishidan esa Abu Qaloba, Qatoda, Yaziyd ar-Rishk, Ayyub va Isom al-Ahval, Sulaymon ibn Abdulloh al-Basri, Ishoq ibn Sa'id, Ummu al-Hasan va boshqalar rivoyat qilganlar.\r\nMuoza roziyallohu anho 101-hijriy sanada vafot etdilar"
        ]
    },
    {
        "word": "Murjiiy",
        "type": [],
        "definition": [
            "7–8 asrlarda paydo bo'lgan ilohiyot oqimi tarafdorlari"
        ]
    },
    {
        "word": "Murjiʼalar",
        "type": [],
        "definition": [
            "Murji'alar ('kechiktiruvchilar') – botil firqalardan biri. Xavorijlar gunohi kabira qilganlarni darhol jazolash tarafdori bo'lsa, murji'alar jazolashni kechiktirishni yoqlab chiqishgan. Shuning uchun ular shunday nom olishgan. Murji'a firqasidagilar mo'min kishi har qancha ulkan gunoh qilsa ham fosiq va osiy bo'lmaydi, hatto tavbasiz o'lsa ham ularga azob joiz bo'lmaydi, deb hisoblashadi. Shuningdek. ular iymon va amal boshqa-boshqa narsalardir deb bilishadi."
        ]
    },
    {
        "word": "Murid ",
        "type": [],
        "definition": [
            "xohlovchi; tasavvuf yo'liga kirib, murshidga qo'l bergan shogird"
        ]
    },
    {
        "word": "Muriy ",
        "type": [],
        "definition": [
            "Muriy – xamrning ichiga baliq, tuz solib, quyosh nuriga qo'yib tayyorlanadigan sirka. Baliq bilan quyosh nuri xamrning ta'sirini ketkazadi, mast qilish xususiyatini yo'q qiladi. Matnda 'so'ygandir' deganda shu ma'no ko'zda tutilgan. Bu bilan so'yish hayvonni halol qilgani kabi, bu ikki narsaning xamrga ta'siri uni halolga aylantiradi, deyilmoqchi."
        ]
    },
    {
        "word": "Mursal ",
        "type": [],
        "definition": [
            "sanadining oxiridan tobe'indan keyin birorta roviy tushib qolgan hadis."
        ]
    },
    {
        "word": "Mursalot surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 50 oyatdan iborat.\r\nUshbu sura ham o'zining birinchi oyatida kelgan 'mursalaat' ('yuborilganlar') so'zi ila nomlanadi.\r\nHaq subhanahu va taoloning amri bilan farishta Jabroil alayhissalom Janobi Payg'ambarimiz Rasululloh sollallohu alayhi vasallamga oyatma-oyat olib tushgan Mursalot surai karimasida ham qiyomat kunining haqligi, uning azoblari, Alloh taoloning cheksiz qudrat va mo''jiza egasi ekani zikr qilinadi.\r\nSura borliqdagi ba'zi ishlarning tadbirini qilib turuvchi farishtalar bilan qasam ichilgan oyatlar ila boshlanadi.\r\nAna shu oyatlarda Alloh taoloning vafot etgan insonni qayta tiriltirishdek buyuk qudrati, gunohkorlarning oxiratdagi holatlari, u yerda duchor bo'ladigan azob-uqubatlari zikr etiladi.\r\nGunohkorlar haqida so'z tugagandan so'ng, taqvodor mo'minlar haqida xabarlar keladi. Alloh taolo ular uchun tayyorlab qo'ygan hurmat va e'zozlarni yana bir bor eslatadi.\r\nSuraning oxirida esa kofirlarning Alloh taologa ibodat qilishdan bosh tortishlari bayon qilinadi."
        ]
    },
    {
        "word": "Murtad",
        "type": [],
        "definition": [
            "islom dinidan qaytgan, undan voz kechgan, chekingan odam. Murtadning islomda qilgan barcha amallari behuda ketadi"
        ]
    },
    {
        "word": "Murtazo",
        "type": [],
        "definition": [
            "undan rozi bo'lingan"
        ]
    },
    {
        "word": "Murshid ",
        "type": [],
        "definition": [
            "to'g'ri yo'lga boshlovchi; tasavvuf yo'liga kirganlarni hidoyatga boshlovchi ustoz, shayx"
        ]
    },
    {
        "word": "Musayyib al-Aloiy",
        "type": [],
        "definition": [
            "Abu Abdurahmon Musayyib ibn Ishoq al-Aloiy Buxoro ahlidan bo'lib, Alo ko'chasida yashar edilar. Ulug' ulamolar: Sufyon ibn Uyayna, Yahyo ibn Salim, Vake' ibn Jarroh, Umar ibn Horun va Salim ibn Solimdan hadis rivoyat qilganlar. O'zlaridan Hurayn ibn Rufayd hadis rivoyat qilganlar. Hijriy 229 (milodiy 845) yil muharram oyining o'n beshinchisida vafot etganlar."
        ]
    },
    {
        "word": "Musannaf",
        "type": [],
        "definition": [
            "Ibn Abu Shaybaning kitobi."
        ]
    },
    {
        "word": "Musannafot",
        "type": [],
        "definition": [
            "yozilgan kitoblar, asarlar"
        ]
    },
    {
        "word": "Musannif ",
        "type": [],
        "definition": [
            "muallif, asar yozgan kishi"
        ]
    },
    {
        "word": "Musinna ",
        "type": [],
        "definition": [
            "Musinna – qurbonlik qilishga yaroqli hayvon. Besh yoshli tuya, ikki yoshli qoramol, bir yoshli qo'y-echki 'musinna' deyiladi"
        ]
    },
    {
        "word": "Musla ",
        "type": [],
        "definition": [
            "Musla – mayyitning jasadini qiymalash, a'zolarini kesib, pajmurda qilish"
        ]
    },
    {
        "word": "Musnad ",
        "type": [],
        "definition": [
            "asoslangan, dalillangan, ya'ni isnodga asoslangan. Hadis to'plamlarining ilk turi. Unda hadislar roviy sahobiylarning ismlari, fazilatlari, islomga kirish tarixiga ko'ra joylashtirilgan bo'ladi. Har bir sahobadan rivoyat qilingan hadislar jamlanmasi"
        ]
    },
    {
        "word": "Musnid ",
        "type": [],
        "definition": [
            "hadislarni sanadi bilan biladigan kishi."
        ]
    },
    {
        "word": "Muso alayhissalom",
        "type": [],
        "definition": [
            "Muso alayhissalom 'ulul azm' ('sabot-matonatli') payg'ambarlardan biridirlar. U zotning 'Kalimulloh' degan laqablari ham bor. Muso alayhissalomning hayotlari kufrga, isyonga, shirkka qarshi kurash bilan o'tgan.\r\nBanu Isroil Yusuf alayhissalom davrlarida asl vatanlaridan Misrga hijrat qilgan edi.\r\nAkalari Yusuf alayhissalomni quduqqa tashlab ketganlaridan so'ng karvondagi yo'lovchilar u kishini topib olib, Misr aziziga, ya'ni vazirga sotishdi.\r\nOradan yillar o'tib, Yusuf alayhissalom bosh vazirlik martabasiga ko'tarildilar va ota-onalari boshliq butun qavmlarini Misrga chaqirdilar.\r\nZamon o'tishi bilan ular shu joyda o'rnashib, o'zlaridan ko'payib, ko'p sonli xalqqa aylanishdi. Qavmlaridan ko'plab payg'ambarlar chiqqan, qadimdan samoviy dinlar bilan aloqada bo'lib, payg'ambarlar keltirgan aqiyda va dinga egalik qilib yashab o'tgan bu xalq Misrning butparastlik dinini hech qabul etmas, ayniqsa fir'avnning shaxsiga sig'inishni mutlaqo istamas edi. O'zini Xudo o'rniga qo'ygan fir'avn ularni aynan shu sababli qiynardi.\r\nShu bilan birga, ilohiy ta'limot, ilohiy tuzum va ilohiy adolatdan xabardor bo'lgan Banu Isroil qavmida fir'avn o'z shaxsi, hukmi va xudolik da'vosiga qarshi katta xavf-xatarni ko'rardi. Banu Isroilning haqiqatdan xabardorligining o'zi fir'avn uchun katta tashvish edi. Fir'avnga qolsa, qani endi Banu Isroil o'zi bilgan haqiqatga amal qilmasa va o'sha haqiqatni yerlik aholiga ham o'rgatmasa.\r\nShu maqsadda fir'avn dastlab ularning oralarini bo'lib tashladi. Banu Isroilni ezish, zug'um o'tkazish siyosatini olib bordi, o'ziga sig'ingani uchun yerlik aholini ulardan yuqori qo'ydi. Nihoyat Banu Isroilni zaiflashtirish yo'lini o'ylab topdi: o'g'illarini bo'g'izlash va qizlarini tirik qoldirish siyosatini qo'lladi. Shu yo'l bilan asta-sekin Banu Isroilni yer yuzidan umuman yo'qotishni rejalashtirdi. Erkaklar yo'q bo'lib ketaversa, odam soni kamayadi, ayollarni xohlagan ko'yga solish oson bo'ladi.\r\nBuning uchun bahona ham topildi. Rivoyatlarda kelishicha, fir'avn atrofidagi gumashta sehrgar-kohinlar unga 'Banu Isroildan kelajakda tug'ilajak bir o'g'il bola sening mulkingning zavolidir', degan xabarni yetkazishdi.\r\nFir'avn o'z mulkining zavolga uchrashiga chiday olmadi. Taxtiga bo'lgan xavfni joniga bo'lgan xavfdan ustun ko'rdi. Garchi o'zi xudolikni da'vo qilsa ham, taxtiga xavf solgani uchun ona qornidagi homiladan ham qo'rqdi.\r\nFir'avnning gumashtalari uning bu zaif joyini yaxshi bilishardi. Shuning uchun fir'avnga yoqmagan toifaning homiladagi bolasini ham unga ashaddiy dushman, taxtiga ko'z olaytirgan qilib ko'rsatishga urinishdi. Kelajakda Banu Isroildan tug'iladigan har bir o'g'il bola uning mulkining zavoli bo'lishi mumkin. Shu bois fir'avn 'Ular darhol o'ldirilsin!' degan farmon chiqardi. Shu soatdan boshlab har bir Banu isroillik homilador ayolning yonida bir doya qo'shilib yuradigan bo'ldi. Ayolning ko'zi yorishi bilan doya ko'rar, chaqaloq o'g'il bo'lsa, xabar berar va jallodlar bolani o'ldirishardi. Shu tariqa fir'avn o'zining misli ko'rilmagan shafqatsiz siyosatini yurgizdi.\r\nMuso alayhissalom davrlarida Ramses II ning fir'avn, ya'ni Misr podshohi (mil. avv. XIII asr) bo'lganini ko'pchilik ta'kidlaydi. Qur'oni Karimda Xudoning yo'lidan chiqqan fuqarolarni o'z xohishiga bo'ysundirishga harakat qilgan, odamlarga o'zini robb sifatida ko'rsatgan, o'ziga bo'ysunmay, uning aytganini qilmagan, unga qul bo'lishni xohlamaganlarga cheksiz zulm o'tkazgan yagona hukmdori mutlaq bu shaxs mustabid podshoh sifatida sifatlanadi.\r\nO'zi hukmronlik qilgan yer aholisini turli toifalarga ajratib, bo'lib tashlash barcha fir'avnlarning odatidir, chunki u faqat o'zini, o'z halovatini, o'z taxtini o'ylaydi, taxtdan ajrab qolmaslik uchun har qanday pastkashlikdan qaytmaydi. Aholini parchalash esa fir'avnga aynan taxtni mustahkamlash, shaxsiy rohatini ta'minlash uchun kerak, chunki fir'avn aholini toifalarga bo'lib tashlab, ularning orasida nizo chiqarib, bir-biriga qarshi qilib qo'ysa, ular bir-birlari bilan ovora bo'lib, fir'avn bilan ishlari bo'lmay qo'yadi. Qaysi taraf o'ziga yaxshiroq topinsa, o'shani quvvatlab, boshqalarning tomoshasini ko'rib, hukm suraveradi.\r\nMuso alayhissalom davrlaridagi Misr fir'avni ham shu yo'ldan borib, Misr aholisini turli toifalarga bo'lib tashlagan edi.\r\n'Ulardan bir toifasini ezar, o'g'illarini so'yib, qizlarini tirik qoldirardi. U buzg'unchilardan bo'lgan edi' (Qasas surasi, 4-oyat).\r\nFir'avn ezgan toifa Banu Isroil edi.\r\n'Biz esa yer yuzida xo'rlanganlarga beminnat ne'mat berishni, ularni peshvo qilishni, ularni vorislar qilishni va yer yuzida ularga imkon berishni, Fir'avn, Homon va ikkovining lashkarlariga ulardan qo'rqqan narsalarini ko'rsatishni istaymiz' (5–6-oyatlar).\r\nHomon – fir'avnning vaziri. U har doim fir'avn qiladigan yomonliklarga bosh-qosh bo'lib kelgan.\r\nFir'avn, Homon va ularning askarlari Banu Isroildan nima uchun qo'rqishardi? Aniqki, ular mulkiga zavol yetishi xavfidan behalovat edilar. Alloh taolo ular qo'rqqan narsani aynan Banu Isroil orqali ko'rsatishni va'da qilmoqda.\r\nMuso alayhissalom nihoyatda xatarli bir vaqtda dunyoga kelganlari uchun onalari nima qilishni bilmay qoldi. Fir'avnning ayg'oqchilari yangi tug'ilgan go'dakning o'g'illigini sezib qolishsa, uni onasidan tortib olib, o'ldirishlari mumkin. Nima qilish kerak? Biror chorasi bormi? Insonning qo'lida hech qanday chora yo'q. Shunda Alloh taoloning O'zi yo'l ko'rsatdi.\r\n'Musoning onasiga: 'Uni emizaver. Qo'rqqan chog'ingda uni daryoga tashla, qo'rqma, mahzun bo'lma, Biz, uni senga albatta qaytaramiz va uni rasullardan qilamiz', deb vahiy qildik' (7-oyat).\r\n'Baribir o'lib ketadi, deb bolani tashlab qo'yma, uni emizaver, noumid bo'lma. Agar fir'avnning odamlari uni o'ldirishidan qo'rqsang, bolani sandiqqa solib, daryoga tashla'.\r\n'...qo'rqma, mahzun bo'lma...'\r\n'Bolamga nima bo'lar ekan, deb qo'rqma. Jigargo'shamdan ayrilib qolyapman, deb xafa bo'lma'.\r\n'Biz uni senga albatta qaytaramiz va uni rasullardan qilamiz', deb vahiy qildik'.\r\nYa'ni 'Biz bolangni tezda o'zingga qaytaramiz va uni o'zing emizasan. Kelajakda esa uni payg'ambarlardan qilamiz'.\r\nAlloh Muso alayhissalomning onasiga bildirgan ish amalga oshdi: ichiga go'dak Muso solingan sandiq daryoda oqib borib, fir'avnning qasridagi boqqa kirdi. Hech narsaga qodir bo'lmagan, hatto o'ziga kerak bo'lgan ovqatni ham tanovul qila olmaydigan go'dak Muso dushmanning qoq o'rtasiga kelib tushdi. Alloh taolo fir'avnning xotinining qalbiga go'dakning muhabbatini joyladi. Uning gapi bilan go'dakni o'ldirmay, boqib olishga qaror qilindi.Muso alayhissalom o'z qavmiga moyil bo'lib o'sib-ulg'aydilar. Bir kuni Banu isroillik bir odam yerlik qibtiy bilan janjallashib qoldi. Banu isroillik Muso alayhissalomdan yordam so'radi. Muso alayhissalom qibtiyni bir urib, o'ldirib qo'ydilar.\r\nBoshqa bir kuni xuddi shunga o'xshash holat yana takrorlandi. Muso alayhissalom bo'lgan voqealardan ta'sirlanib, buning oqibati nima bo'lar ekan, deb hadiksirab yurganlarida u kishiga xabar keldi. Bu haqda Qasas surasida shunday deyilgan.\r\n'...va shaharning narigi chetidan bir kishi shoshib kelib: 'Ey Muso, aniqki, a'yonlar seni o'ldirish uchun til biriktirmoqdalar. Chiqib ket! Men senga nasihat qiluvchilardanman', dedi' (20-oyat).\r\nSo'ng Muso alayhissalom Madyan yurtiga bosh olib ketdilar. U yerda ikki qizga qo'ylarini sug'orishda yordam berdilar. O'sha ikki qizning otalari bo'lmish Shuayb alayhissalom Muso alayhissalomga sakkiz yoki o'n yil ishlab berish sharti bilan qizlaridan birini nikohlab berishni taklif qildilar va bu gap amalga oshdi ham.\r\nOradan yillar o'tdi. Vaqti-soati kelganda, Muso alayhissalom o'z ahllari bilan Misrga qaytishga qaror qildilar. Siyno mintaqasiga yetib kelganlarida Alloh vahiy qilib, u zotni fir'avn va uning qavmiga payg'ambar qilib yubordi. Shu bilan birga, Alloh Muso alayhissalomga akalari Horunni yordamchi qilib berdi, u zotni mo''jizalar bilan qo'llab-quvvatladi.\r\nMuso alayhissalom fir'avnni Allohga da'vat qilar, u esa o'z siyosatida, isyonda davom etib, o'zining xudo ekanini da'vo qilar, u zotni yolg'onchiga chiqarar edi. Muso alayhissalomning qo'llarining oq bo'lib chiqishi, hassalarining ilonga aylanib, harakatga kelishi kabi mo''jizalarni fir'avn sehr deb da'vo qildi. Sehrgarlarni to'plab, ular bilan Muso alayhissalom orasida bellashuv o'tkazishni, kim g'olib kelishini aniqlashini e'lon qildi.\r\nAlloh taolo bu haqda Nozi'ot surasida xabar bergan:\r\n'Senga Musoning xabari keldimi?' (15-oyat)\r\nYa'ni 'Senga Musoning xabari kelgan, buni bilasan'.\r\n'Esla, Robbi unga muqaddas Tuvo vodiysida nido qildi' (16-oyat).\r\nTur tog'ida – Tuvo deb atalgan muqaddas vodiyda Muso alayhissalom boshqalarga nasib etmagan marhamatlarga, jumladan, Haq subhanahu va taolo bilan roz aytishish – bevosita so'zlashish sharafiga muyassar bo'lganlar. Oyatda mana shu ulkan hodisa zikr qilinyapti. O'shanda Alloh taolo Muso alayhissalomga dedi:\r\n'Fir'avnning huzuriga bor, u tug'yonga ketdi' (17-oyat).\r\nAllohni unutib, tug'yonga ketgan, haddidan oshib, kishilarga zulmni ko'paytirgan, hattoki xudolik da'vosini ham qilgan zolimga, tug'yonga ketgan podshohga Alloh taolo O'z payg'ambari Muso alayhissalomni yuborib, yumshoq gapirishni tayinlayapti.\r\n'Ayt: 'Senda poklanishga (rag'bat) bormi?' (18-oyat)\r\nYa'ni 'Ey fir'avn, senda kofirlikdan, xudolik da'vosini qilishdan va boshqa gunohlaringdan poklanishga rag'bat bormi?' degin.\r\nBunda dinga da'vat qiluvchilar uchun katta ibrat bor. Agar da'vat qilinayotgan shaxs fir'avn bo'lsa ham, unga yumshoq gapirib, tushuntirib, da'vat qilish kerak.\r\n'...va seni Robbingga hidoyat qilsam, shoyadki, qo'rq-sang' (19-oyat).\r\nYa'ni 'Men seni Robbingni rozi qiladigan narsaga hidoyat qilaymi? Shoyad, o'sha hidoyatga amal qilib, Allohdan qo'rqadigan, Unga taqvo qiladigan bandalardan bo'lsang'.\r\nUshbu oyatda oldin hidoyat, keyin qo'rqish zikr qilinishi ham o'ziga yarasha hikmatga ega, chunki banda hidoyat topmaguncha, Allohdan qo'rqmaydi.\r\nKeyingi oyatlarda esa Muso alayhissalom bilan fir'avn orasida bo'lib o'tgan mojarolar zikr qilinadi.\r\n'...va unga katta oyat-alomatni ko'rsatdi' (20-oyat).\r\nAlloh taolo O'z payg'ambarlarini qo'llab-quvvatlash, kishilarga ularning haqiqiy payg'ambar ekanini tan oldirish uchun mo''jizalar beradi. Muso alayhissalomga ham Alloh taolo ko'plab mo''jizalar bergan. mo''jizani Qur'oni Karim ba'zida 'oyat-alomat' deydi. Bu oyatdagi ulkan alomatdan murod Muso alayhissalomga berilgan katta mo''jiza – qo'llaridagi hassaning ilonga aylanishidir. Demak, shu mo''jizani u zot zolim fir'avnga ko'rsatdilar. Shunda\r\n'U yolg'onchiga chiqardi va osiy bo'ldi' (21-oyat).\r\nYa'ni fir'avn Allohning payg'ambari bo'lmish Muso alayhissalomni yolg'onchiga chiqardi, Alloh taoloning amriga isyon qildi.\r\n'So'ng ortiga o'girilib, tezlab ketdi' (22-oyat).\r\nYa'ni fir'avn Muso alayhissalom tomonlaridan ko'rsatilgan mo''jizalarni ko'rganidan so'ng ortiga o'girilib, tezlab yurib ketdi.\r\n'Keyin (odamlarni) to'pladi va nido qildi' (23-oyat).\r\nFir'avn Muso alayhissalomning oldlaridan burilib ketganidan keyin borib, o'z hukmi ostida yashayotgan odamlarni bir joyga to'pladi va\r\n'Men sizlarning eng oliy robbingizman', dedi' (24-oyat).\r\nYa'ni robblik da'vosini qildi. Qilganda ham, eng oliy robb¬lik da'vosini qildi, chunki Muso alayhissalom fir'avnni ham, boshqalarni ham Robbul olaminga ibodat qilishga da'vat qilgan edilar. Fir'avn o'zining bu ishi ila 'Muso da'vat qilayotgan Robb emas, eng oliy robb menman', demoqchi bo'ldi.\r\n'Alloh uni avvalgi va oxirgi(gunoh)lari uchun bezdiruvchi iqobga oldi' (25-oyat).\r\nU bo'lsa aqlini yo'qotib: 'Men sizlarning eng oliy robbingizman', deb yuribdi.\r\nVa'dalashilgan kunda bo'lib o'tgan bellashuvda Muso alayhissalom sehrgarlar ustidan g'olib keldilar. O'zlari qilib yurgan narsa botil ekani ayon bo'lib, Allohga iymon keltirgan sehrgarlarni fir'avn osishga buyurdi, ularni qatl qildi. So'ng Banu Isroilga nisbatan ozorlar yana ham shiddatli tus oldi. Shunda Alloh subhanahu va taolo fir'avnni va uning qavmini qahatchilik – ocharchilik yillari bilan siquvga oldi. Shunda ham ular o'z ishlaridan qaytishmagach, Alloh taolo ularga boshqa uqubatlarni ham nozil qildi.\r\nAlloh taolo bu haqda A'rof surasida shunday xabar bergan:\r\n'Ustlariga to'fon, chigirtkalar, kanalar, baqalar va qonni ochiq-oydin va mufassal belgilar qilib yubordik. Mutakabbirlik qildilar va jinoyatchi qavm bo'ldilar' (133-oyat).\r\nYa'ni Alloh taolo fir'avn va uning ahli va'z-nasihatga quloq tutsin, insofu iymonga kelsin, qilayotgan jinoyatlaridan qaytsin deb, ularga mufassal tarzda, alohida-alohida qilib oyat-belgilarni yubordi. Ba'zi ulamolarning fikricha, Isro surasida 'Batahqiq, Musoga to'qqizta ochiq-oydin oyat-mo''jiza berdik' deyilishiga qaraganda, to'qqiz yilda to'qqizta oyat-mo''jiza yuborilgan, chunonchi: aso, qo'l, qahatchilik, meva va jonlarni nuqsonga uchratish, to'fon, chigirtka, mita, baqa va qon.\r\nBu holat haqida imom Ibn Jarir Tabariy Sa'id ibn Jubayr roziyallohu anhudan quyidagi rivoyatni keltiradilar:\r\n'Muso alayhissalom fir'avnning huzuriga kelib, 'Banu Isroilni men bilan qo'yib yuborgin' deganida, fir'avn ko'nmadi. Shunda Alloh taolo ularning ustiga to'fon – shiddatli yomg'ir yubordi. Ustlaridan sel qilib quydi. Ular 'Bu ilohiy azob bo'lsa kerak', deb qo'rqishdi va Musoga: 'Robbingga duo qil, bizdan yomg'irni daf etsin. Biz senga iymon keltiramiz va Banu Isroilni sen bilan qo'yib yuboramiz', deyishdi. Muso alayhissalom duo qilgan edilar, ijobat bo'ldi. Biroq ular iymon keltirishmadi, Banu Isroilni qo'yib ham yuborishmadi. O'sha yili Alloh ularga bundan oldin yetishmagan turfa ziroat, meva va o't-o'lanlarni o'stirdi. Ular: 'Biz orzu qilgan narsa shu edi', deyishdi. Alloh ularning ustidan chigirtka balosini yuborib, o'simliklarga zavol yetkazdi. Ular chigirtkalardan o'simliklarga yetayotgan zararni ko'rib, nabototning urug'i ham qolmasligiga ishonishdi va: 'Ey Muso, Robbingga duo qil, bizdan chigirtka balosini daf etsin, biz senga iymon keltiramiz va Banu Isroilni sen bilan qo'yib yuboramiz', deyishdi. Muso alayhissalom duo qildilar. Alloh ularni chigirtka balosidan xalos etdi. Ular esa yana iymon keltirishmadi, Banu Isroilni ham qo'yib yuborishmadi. Ular donlarni uyda saqlashni o'rganib olishdi va xotirjam: 'Endi saqlab olaveramiz', deyishdi. Shunda Alloh ularga mitani (donning o'zidan chiqadigan qurt) yubordi. Ulardan bir kishi tegirmonga o'n jarib (don) olib borsa, o'n qafiz ham un chiqmaydigan bo'ldi*. Shunda ular: 'Ey Muso, Robbingga duo qil, bizdan mitani daf etsin, biz senga iymon keltiramiz va Banu Isroilni sen bilan qo'yib yuboramiz', deyishdi. Muso alayhissalom Allohga duo qildilar va ulardan bu azob yiroqlashdi. Ammo ular Banu Isroilni qo'yib yuborishdan yana bosh tortishdi.\r\nBir kuni Muso alayhissalom fir'avnning huzurida o'tirganlarida birdan baqaning ovozini eshitib qoldilar va fir'avnga: 'Sen va qavming buni nima deb o'ylaysan?' dedilar. U (fir'avn): 'Bu ham bir balo bo'lmasa edi', deb javob berdi. Kechga borib ularning har biri tomog'igacha baqaga ko'milib o'tirar, gapirmoqchi bo'lishsa, og'izlariga baqa kirib ketar edi. Ular yana Musoga: 'Robbingga duo qil, bizdan manavi baqalarni daf etsin. Keyin biz senga iymon keltiramiz va Banu Isroilni sen bilan birga qo'yib yuboramiz', deyishdi. Alloh ulardan baloni daf etdi, lekin qavm yana iymon keltirmadi. So'ng Alloh ularning ustiga qon balosini yubordi. Anhorlardan, quduqlardan, idishlaridan suv olmoqchi bo'lishsa, yangi qon chiqar edi. Ular bu haqda fir'avnga arz qilib: 'Biz qon balosiga uchradik. Toza ichimlik qolmadi', deyishdi. Fir'avn: 'U (Muso) sizlarni sehrlab qo'ygan bo'lsa, ajab emas', dedi. Ular: 'Qayerdan sehrlaydi? Biz idishlarimizda suv topa olmayapmiz, yangi qondan boshqa hech vaqo yo'q!' deyishdi. So'ng kelib: 'Ey Muso, Robbingga duo qil, bizdan qon balosini ko'tarsin. Keyin biz senga iymon keltiramiz va Banu Isroilni sen bilan birga qo'yib yuboramiz', deyishdi. Balo daf bo'ldi. Ular yana iymon keltirishmadi, Banu Isroilni qo'yib ham yuborishmadi'.\r\nAlloh taolo Toho surasida xabar bergan:\r\n'Musoga 'Bandalarim ila kechasi yo'lga tush, ularga dengizdan quruq yo'l och, yetib olishlaridan xavf qilma va qo'rqma', deb vahiy qildik' (77-oyat).\r\nFir'avnning zulmi va tug'yoni yana ham avjiga chiqdi. O'shanda Alloh taolo payg'ambari Muso alayhissalomga o'z qavmi bilan Shom diyoriga hijrat qilishni buyurdi. Fir'avn va uning odamlaridan qochib, Qizil dengizning shimolidagi tor qismiga yetganlarida Allohning izni bilan Muso alayhissalom hassalari bilan dengizni urdilar. U yerdan oson o'tadigan yo'l ochildi. U zot qavmlari bilan mana shu yo'l orqali o'tib oldilar.\r\n'Fir'avn lashkarlari bilan ularning ortidan ta'qib etdi. Dengiz ularni o'raganicha o'rab oldi' (78-oyat).\r\nFir'avn o'z askarlari bilan Banu Isroilni quvib kelib, ortlaridan dengizga tushdi. Ular dengiz tubida ketishayotgan bir paytda to'xtab turgan suv birdan harakatga keldi va barchalari to'lqinlar ostida qolib ketishdi. Alloh taolo ularni shu zaylda halok qildi. Muso alayhissalom va u zot bilan birga bo'lganlar esa qirg'oqning narigi tomoniga eson-omon yetib olishdi.\r\n'Fir'avn o'z qavmini adashtirdi, to'g'ri yo'lga boshlamadi' (79-oyat).\r\nOqibat shu tarzda yakun topdi. Xudoga emas, fir'avnlarga ergashganlar doimo shunday oqibat topadilar.\r\nAlloh taolo fir'avn va uning lashkarini g'arq etib, Banu Isroilni zulm, jabr-sitamdan ozod qildi.\r\nYahudiylar Muso alayhissalomdan yegulik-taom so'rashdi. Alloh taolo ularga osmondan mann (shirinlik, taom) va salvo (pishirilgan bedana) tushirdi. Muso alayhissalom ular bilan yurishni davom ettirib, nihoyat Siyno mintaqasiga yetib bordilar. Muso alayhissalom toqqa chiqib, u yerda qirq kun turdilar. O'shanda Alloh taolo u zot bilan bevosita gaplashdi va Tavrotni nozil qildi, toshdan bo'lgan lavhlarga yozilgan vasiyatlarni berdi. So'ng Muso alayhissalom o'z qavmlariga qaytdilar. Ularning tilladan o'zlari yasab olgan buzoqqa ibodat qilayotganlarini ko'rib, juda qattiq g'azablandilar. So'ng iqob tarzida ularga bir-birlarini o'ldirishga amr qildilar. Bu amr Allohdan bo'lgan edi. Shundan so'ng u zot qavmlariga Alloh subhanahu va taolo ularga tiyhni, ya'ni adashib-uloqib yurishni, zoye bo'lishni yozgani, bu ishlar Siyno sahrosida qirq yil davom etishi haqida xabar berdilar.\r\nMuso alayhissalom Horun alayhissalomdan keyin vafot etdilar. Banu Isroilni Muqaddas zaminga u zot emas, Yusha' ibn Nun olib kirdilar. Muso alayhissalom bu ¬dunyoni 120 yoshlarida tark etdilar va O'lik dengizining shimoli-sharqiy tarafida, Muob mintaqasidagi Nibu (Nebo) tog'iga dafn etildilar.\r\nMuso alayhissalomning qissalari Qur'oni Karimda eng ko'p kelgan qissadir.\r\nMulohaza qilinsa, Muso alayhissalom insoniyat ilohiy ta'limotlardan juda ham uzoqlashgan bir paytda payg'ambar bo'lganliklari anglashiladi.\r\nU zot payg'ambar bo'lib kelgan qavm podshohni 'iloh' deb e'tiqod qilgan, jamiyat esa o'zida barcha nobakorliklarni mujassam etgan edi. Ular har bir kattayu kichik masalada ilohiy ta'limotdan uzoqlashib, o'zlari ixtiro qilgan nobakorliklarga amal qilishga o'tib olishgandi.\r\nShuning uchun Muso alayhissalom ularga ko'plab tushuntirish ishlari olib borgan bo'lsalar ham, u zotning qavmlaridan bo'lgan bir guruh yoshlardan boshqa hech kim ilohiy yo'lga yurmadi. Aksincha, ular o'zlariga payg'ambar bo'lib kelgan zotni o'ldirishga qasd qilishdi.\r\nMuso alayhissalomning fir'avn va uning ahli bilan bo'lgan kurashlari kofir qavmning Alloh taolo tomonidan g'arq qilinishi ila yakunlandi.\r\nBoshqa payg'ambarlarning qissalarida kofir qavm halok bo'ladi, payg'ambar va unga iymon keltirganlar najot topadilar, ammo Muso alayhissalom qissasida asosiy voqealar kofir qavm halok bo'lganidan keyin boshlanadi. Fir'avn va uning qavmi halok bo'lganidan keyin Muso alayhissalom va u zotning akalari Horun alayhissalom o'z qavmlari bilan yuzma-yuz qoladilar.\r\nUzoq muddat qullikda, azob-uqubatda yashagan bu qavm Alloh taolo ozod qilib, O'z ne'matlarini ato qilganidan keyin turli noshukrliklar qilishni boshladi.\r\nMuso alayhissalom ularni insofga, shukr qilishga chaqirib, da'vat qilib, ko'p urindilar. Alloh taolo ham ularga tanbeh uchun turli azob-uqubatlarni yo'llab turdi. Ammo xalq insofga kelmadi. Banu Isroilning nobakorligi borgan sari kuchayib boraverdi. Oxir-oqibat Alloh taolo ularning yosh bolalaridan boshqa barchalarini doimiy adashuvda o'lib ketishlarini iroda qildi.\r\nMuso alayhissalomning qissalari Qur'oni Karimda bunchalik ko'p kelishining asosiy sabablaridan biri Banu Isroil ilohiy kitobga – Tavrotga amal qilib yashashi talab etilgan qavm edi. Musulmonlar ham oxirgi ilohiy kitob – Qur'oni Karimga amal qilib yashashlari lozim va lobud ummatdir. Ana shu ma'noda ular hammadan ko'ra Banu Isroildan ko'proq ibrat olishlari va ular yo'l qo'ygan xatolarni takrorlamasliklari kerak. Shuning uchun ham Qur'oni Karim bu masalaga alohida e'tibor bergan.\r\n* Jarib, qafiz – o'lchov birliklari. 1 jarib 132 litr, 4 qafiz esa 33 litr sig'imga teng"
        ]
    },
    {
        "word": "Muso al-Biforiniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Imron Muso ibn Aflah al-Biforiniy al-Buxoriy Biforin qishlog'idan. Bu kishi uzoq umr ko'rgan olimlardan bo'lib, Imom al-Buxoriy zamonlarida yashab, u zotdan ta'lim olganlar. Hijriy 291 (milodiy 905) yilning jumodul oxir oyida vafot etganlar"
        ]
    },
    {
        "word": "Musoqot ",
        "type": [],
        "definition": [
            "'Musoqot'ning lug'atdagi ma'nosi 'sheriklikka sug'orish'dir. Sheriklik uchun sug'orishdan esa, sheriklikka bog'dorchilik qilish tushuniladi. Bir kishining bog'i bo'ladi. Uni bog'bonga beradi. Oralarida yig'iladigan mahsulni ma'lum miqdorda bo'lib olishga kelishiladi. 'Muxtasari Viqoya'da musoqotni quyidagicha ta'riflangan: 'Musoqot' daraxtni uni parvarish qiluvchiga mevasining bir qismi evaziga berishdir. Musoqotning hukmi sunnatdan olingan"
        ]
    },
    {
        "word": "Mustavrid roziyallohu",
        "type": [],
        "definition": [
            "Mustavrid ibn Shaddod ibn Amr Qurashiy al-Fihriy, onalari Da'd binti Jobir Makka ahlidan bo'lib, Rasululloh sollallohu alayhi vasallam vafot etganlarida hali yosh bola edilar.\r\nAvval Kufada, so'ng Misrda istiqomat qildilar, Misrni fath etishda ishtirok etdilar.\r\nRasululloh sollallohu alayhi vasallamdan hammasi bo'lib 7ta hadis rivoyat qildilar. Bundan ikkitasini Imom Muslim o'z 'Sahih' kitob¬lariga kiritganlar. U zotdan Qays ibn Abu Xodim, Sha'biy, Abu Abdurrahmon Xubuliy, Abdurrahmon ibn Jubayr, Ali ibn Raboh va boshqalar rivoyat qilganlar.\r\nBu zot hijratning 45-sanasida (milodiy 665 yilda) Iskandariyada vafot etdilar"
        ]
    },
    {
        "word": "Mustadrak ",
        "type": [],
        "definition": [
            "Muhaddisning shartlariga muvofiq bo'lgani holda, qandaydir bir sabab bilan kitobiga olmagan hadislarning boshqa muallif tomonidan boshqa bir kitobda to'planishi"
        ]
    },
    {
        "word": "Mustajob ",
        "type": [],
        "definition": [
            "ijobat qilingan, qabul qilingan."
        ]
    },
    {
        "word": "Musulmon ",
        "type": [],
        "definition": [
            "islom diniga e'tiqod qiluvchi kishi."
        ]
    },
    {
        "word": "Mushaf ",
        "type": [],
        "definition": [
            "sahifalangan, Qur'oni karim."
        ]
    },
    {
        "word": "Mutaaxxir ",
        "type": [],
        "definition": [
            "keyingi asrlarda yashaydigan ulamolar."
        ]
    },
    {
        "word": "Mutavotir ",
        "type": [],
        "definition": [
            "'Mutavotir' - bu istiloh lug'aviy jihatdan 'ko'plik' ma'nosini anglatadi. Ulamolar istilohida esa, bunday hadislarda Payg'ambarimiz sollallohu alayhi vasallamdan rivoyat qilgan birinchi, ikkinchi va uchinchi halqa odamlari yolg'on kelishuvga imkon bermaydigan darajada ko'p bo'lishi kerak. Misol uchun, bir hadisni Payg'ambarimiz sollallohu alayhi vasallamdan o'ttiz kishi rivoyat qilgan. Xuddi shu hadisni mazkur o'ttiz sahobiydan shu qadar yoki undan ham ko'p adaddagi tobe'inlar, ulardan esa xuddi shuncha taba' tobe'inlar rivoyat qilganlar. Ana o'sha hadis mutavotir hadis deyiladi. Payg'ambarimiz sollallohu alayhi vasallamning tahorat qilishlari, namoz o'qishlari, ro'za tutib, haj qilishlari, jum'ada xutba o'qishlari, azon, iqomat kabi amallari ko'p marta va ko'pchilik huzurida bo'lganligi uchun haddan tashqari ko'p odamlar rivoyat qilganlar. Mana shu masalalarga tegishli hadislar mutavotir hisoblanadi. Shuningdek, Payg'ambarimizning: 'Kim mening nomimdan qasddan yolg'on to'qisa, do'zaxdan joyini olaversin', degan hadislari mazmuniga o'xshash ko'pgina hadislar mutavotir hisoblanadi. Mutavotir hadis ila sobit bo'lgan hukmni inkor qilgan kishi kofir, bunday hukmni e'tirof etgan, lekin unga amal qilmagan odam esa, gunohkori azim bo'ladi."
        ]
    },
    {
        "word": "Mutakabbir ",
        "type": [],
        "definition": [
            "kibrli, mag'rur, o'ziga bino qo'ygan, o'zini katta tutuvchi."
        ]
    },
    {
        "word": "Mutakallim ",
        "type": [],
        "definition": [
            "aqiyda ilmi borasida mutaxassis, musulmon ilohiyot oqimlari."
        ]
    },
    {
        "word": "Mutlaq kalom",
        "type": [],
        "definition": [
            "Namozda qasdanmi, unutibmi, bilmasdanmi, xato tariyqasidami yoki majburanmi gapirilsa, u botil bo'ladi. Bu narsa ikki harfni yoki fahmlasa bo'ladigan bir harf-ni nutq qilish bilan bo'ladi."
        ]
    },
    {
        "word": "Mutorrif roziyallohu anhu",
        "type": [],
        "definition": [
            "Mutorrif ibn Abdulloh ibn Shixxiyr al-Omiriy, kunyalari Abu Abdulloh.\r\nRasululloh sollallohu alayhi vasallam hayotlik davrlarida Basrada tavallud topdilar. Ishonch¬li hadislar rivoyat qiluvchi ulug' tobe'¬inlardan edilar.\r\nHadislarni otalaridan, Usmon ibn Affon, Ali ibn Abu Tolib, Ammor ibn Yosir, Abu Zarr, Usmon ibn Abul Osslardan rivoyat qilganlar.\r\nMutorrif ibn Abdulloh roziyallohu anhu hijratning 87-yili Basrada vafot etdilar"
        ]
    },
    {
        "word": "Mutoffifun surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 36 oyatdan iborat.\r\nUshbu surai karimaning nomi 'Mutoffifun' o'zining birinchi oyatidan olingandir. 'Mutoffifun' so'zini bizning tilimizga, ushbu surai karima ma'nosini e'tiborga olganda, 'o'lchovdan urib qoluvchilar' deb tarjima qilish mumkin. 'Mutoffifun' so'zining asl o'zagi 'tofif' bo'lib, 'ozgina narsa' degan ma'noni anglatadi. Savdo, oldi-berdi paytida o'lchovdan urib qoluvchi ham oz-ozdan urib qoladi. Agar u o'lchovda ko'p urib qolsa, xaridor bilib qolishi mumkin.\r\nSuraning 'Mutoffifun' – 'o'lchovdan urib qoluvchilar' deb nomlanishidan ham unda ushbu qabih va harom ish haqida so'z ketishi bilinib turibdi.\r\nMutoffifun surasi Makkada, Islom da'vatining dastlabki davrida nozil bo'lganini e'tiborga oladigan bo'lsak, o'sha davrdagi nozil bo'lgan oyatlarda iymon-e'tiqod, tavhid, qiyomat, jannat, do'zax, Qur'on va payg'ambarlik kabi masalalar bilan bir qatorda, ba'zi bir ijtimoiy muomalalar ham muolaja qilingani ma'lum bo'ladi.\r\nMutoffifun surasi boshqa makkiy suralarga o'xshab aqiyda masalasini muolaja qiladi.\r\nSuraga asl ism qilib olingan 'o'lchovdan urib qolish' masalasi ham aqiyda masalasi asosida muolaja qilinadi. Tarozidan urib qoluvchilar oxiratdan qo'rqmaganlari uchun shu ishni qilishda ayblanadilar.\r\nSo'ngra badbaxt fojirlar va ularning qiyomat kuni nimalarga duchor bo'lishlari vasf etiladi.\r\nKeyin esa abrorlar va ularning oxiratdagi hollari vasf qilinadi.\r\nSurai karimaning xotimasida esa bu dunyoda kofir va fojirlar mo'min va taqiylar (taqvodorlar) ustidan masxara qilib kulishlari, oxiratda esa holat aksincha bo'lishi eslatiladi"
        ]
    },
    {
        "word": "Muttalib ibn Abu Vadoʻa",
        "type": [],
        "definition": [
            "Muttalib ibn Abu Vado'a al-Horis as-Sahliy al-Qurashiy, onalari Arvo binti Horis ibn Abdulmuttalib Makka fath etilgan kuni Islomga kirdilar.\r\nHadislarini Rasululloh sollallohu alayhi vasallamdan va Hafsa onamizdan rivoyat qildilar.\r\nBu kishidan o'g'illari Ja'far, Abdurrahmon, Kusayrlar va Soib ibn Yaziyd, Ikrima ibn Xolid, Abdulloh ibn Horislar rivoyat qildilar."
        ]
    },
    {
        "word": "Muttasil ",
        "type": [],
        "definition": [
            "roviylar silsilasining bir-biriga ketma-ket bog'liqligi"
        ]
    },
    {
        "word": "Muttasil ",
        "type": [],
        "definition": [
            "uzluksiz, ketma-ket, oraga roviylardan biror kishi tushib qolmagan hadislar sanadi."
        ]
    },
    {
        "word": "Muttafaqun alayh",
        "type": [],
        "definition": [
            "Imom Buxoriy va imom Muslimlar birgalikda rivoyat qilgan hadislar"
        ]
    },
    {
        "word": "Mutʼa ",
        "type": [],
        "definition": [
            "'Mut'a' so'zi lug'atda 'huzurlanish' ma'nosini bildiradi. Shariatda esa, faqat jinsiy huzurlanish maqsadida vaqtinchalik uylanishga aytiladi. Mut'a nikohida bir hafta, bir oy, bir yil kabi ma'lum muddatga kelishib uylaniladi. Bu nikoh ham Islom ta'limotlariga zid bo'lgani uchun harom qilingandir."
        ]
    },
    {
        "word": "Mufaqqih ",
        "type": [],
        "definition": [
            "Faqih"
        ]
    },
    {
        "word": "Mufassal ",
        "type": [],
        "definition": [
            "'Mufassal' – Qur'oni karimning Hujurot surasidan boshlab to oxirigacha bo'lgan suralarning umumiy nomi. Ularning o'zlari ham, oyatlari ham qisqa-qisqa bo'lgani uchun shunday nomlangan. 'Mufassal' degani 'fosilasi ko'p' deganidir. 'Fosila' esa oyatlarning tugashini anglatadi."
        ]
    },
    {
        "word": "Mufassir ",
        "type": [],
        "definition": [
            "Qur'oni Karimni sharhlash va tafsir qilishda mutaxassis. Bayon qiluvchi"
        ]
    },
    {
        "word": "Mufovaza shirkati",
        "type": [],
        "definition": [
            "Bu – mol, hurriyat va diynda teng bo'lganlarning sherikligidir. 'Moli teng bo'lishi', deganda shirkat sarmoyasi uchun qo'shadigan mablag'i bir xil bo'lishi anglanadi. Biri pul boshqasi imorat qo'shsa, bo'lmaydi. Shuningdek, ikki taraf ham hur va musulmon bo'lishi lozim. Bu turdagi shirkat vakolat va kafolatni ham o'z ichiga oladi. Ya'ni, mufovaza shirkati tuzganlar bir-birlariga vakil va kafil ham bo'ladilar."
        ]
    },
    {
        "word": "Mufovaza shirkati",
        "type": [],
        "definition": [
            "Tengdoshlik shirkati. Bundoq shirkatda sheriklarning ra'sulmoldagi hissasi ham, shirkatdagi ishi ham va foydadagi ulush ham teng bo'ladi."
        ]
    },
    {
        "word": "Muftiy ",
        "type": [],
        "definition": [
            "fatvo beruvchi, diniy masalalarda qaror chiqaruvchi, shariat peshvosi."
        ]
    },
    {
        "word": "Muxobara ",
        "type": [],
        "definition": [
            "'Muxobara'–'xabar' 'ekishish' so'zidan olingan bo'lib, sheriklikka yer ekish ma'nosini bildiradi. Voqe'likda esa, yer egasi o'z yerini bir kishiga berib, 'O'zing nima qilsang, qilaver, menga mahsulotning falon qismini berasan', deyishidir. Bu ham aniq narsa bo'lmagani uchun joiz emas."
        ]
    },
    {
        "word": "Muxtasar",
        "type": [],
        "definition": [
            "qisqartirilgan, lo'nda bayon qilingan, ixcham."
        ]
    },
    {
        "word": "Muxtasar tarixil Islam liz-Zahabiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari"
        ]
    },
    {
        "word": "Muxtasari sharhi talxiysi Jomeʼil kabir",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining kitobi. Bu kitob shofe'iy fiqhiga oid mashhur 'Jome'ul kabir' nomli kitobga yozilgan sharhning qisqartirilgan shaklidir."
        ]
    },
    {
        "word": "Muxtasarul Maʼoniy",
        "type": [],
        "definition": [
            "Bu kitob 'Talxiysul Miftoh'ning sharhidir. Allomai Taftazoniy rahmatullohi alayhi bu kitobni G'ijduvonda hijriy 756 yili tugatgan.\r\nBu kitob eng mashhur kitoblardan bo'lib, qayta-qayta chop qilingan va hozirgacha tolibi ilmlar tomonidan sevib o'qiladi."
        ]
    },
    {
        "word": "Muhammad al-Majubsiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Abdulloh al-Majubsiy Buxoroning Majubs qishlog'i ahlidan bo'lib, Sa'id ibn Ayyub al-Jo'yboriy va Abu Abdulloh ibn Abu Hafsdan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhaddis ",
        "type": [],
        "definition": [
            "hadis rivoyat qiluvchi; hadis rofiylariga berilgan xos nomlardan biri bo'lib, hadislarni to'plash, saralash va sharhlash bilan shug'ullangan olim."
        ]
    },
    {
        "word": "Muhaqqiq ",
        "type": [],
        "definition": [
            "haqiqatga chiqaruvchi, ma'lumotlarning to'g'ri-noto'g'riligini aniqlab, isbotlab beruvchi"
        ]
    },
    {
        "word": "Muhammad ad-Dehqoniy al-Andoqiy",
        "type": [],
        "definition": [
            "Abu Mansur Muhammad ibn Hasan ad-Dehqoniy al-Andoqiy – ishonchli muhaddis. Nasr ibn Fath al-Ishtixaniydan hadis rivoyat qilganlar. Abu Sa'd al-Idrisiy aytadilar: 'Hijriy 370 (milodiy 981) yildan oldin u kishidan hadis yozib olganmiz. Shu sanadan keyin vafot etdilar'."
        ]
    },
    {
        "word": "Muhammad ad-Diymasiy al-Buxoriy al-Hokim",
        "type": [],
        "definition": [
            "Abu Tohir Muhammad ibn Ya'qub ad-Diymasiy al-Buxoriy al-Hokim - Buxoroning Diymas nomli qishlog'idan. Bu kishidan Abul Hasan Ali ibn Muhammad al-Buxoriy al-Xidomiy hadis rivoyat qilganlar. Taxminan hijriy 430 (milodiy 1039) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad ad-Dorimiy as-Samarqandiy al-Ushtobdiziy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ja'far ad-Dorimiy as-Samarqandiy al-Ushtobdiziy Abdulloh ibn Hammod al-Omuliy va Hotam ibn Mansur ash-Shoshiydan hadis rivoyat qilganlar. O'zlaridan esa Abdulvohid ibn Muhammad al-Kog'aziy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad ad-Duvaydiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Sahl ad-Duvaydiy al-Buxoriy Tamim qabilasi tomonidan musulmon qilinganlardan. Buxoro ahlidan. Bag'dodda yashaganlar. O'z zamonalarining olimlaridan ta'lim olib, ko'p shogird chiqarganlar. Hijriy 251 (milodiy 866) yilning sha'bon oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad az-Zaraxshiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Sa'id az-Zaraxshiy - Zaraxsh qishlog'idan bo'lib, Haysam ibn Kulayb ash-Shoshiy, Abul Fazl Muhammad ibn Ahmad as-Sulamiy va Abu Hafs al-Ijliydan hadis rivoyat qilganlar. Hijriy 399 (milodiy 1009) yilning rajab oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad az-Zaraxshiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Sa'id az-Zaraxshiy - Zaraxsh qishlog'idan bo'lib, Haysam ibn Kulayb ash-Shoshiy, Abul Fazl Muhammad ibn Ahmad as-Sulamiy va Abu Hafs al-Ijliydan hadis rivoyat qilganlar. Hijriy 399 (milodiy 1009) yilning rajab oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Avdaniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Abdulloh al-Avdaniy - Avdana qishlog'i nisbati bilan mashhurdirlar. Bu kishi 'Imomu ashob al-hadis' (Muhaddislar imomi) unvoni bilan tanilganlar. O'z asrining Shofe'iy mazhabidagi faqihi edilar, ilmga nihoyatda chanqoq bo'lganlar, ilmlarini boshqa kishilarga o'rgatishni yoqtirganlar. Umrlarining oxiriga qadar ilm talab qilishni tark etmaganlar. Daftar-kitoblarini doim o'zlari bilan yenglari ichida olib yurganlar. Uylaridan biror marta daftarsiz chiqmaganlar. Haysam ibn Kulayb ash-Shoshiy, Abu Bishr Ahmad ibn Muhammad al-Mus'abiy, Muhammad ibn Sobir al-Buxoriy va Abu Ya'lo Abdulmu'min ibn Xalaf an-Nasafiydan hadis rivoyat qilganlar. O'zlaridan esa Xoja G'unjor, Abu Abdulloh al-Halimiy va Abul Abbos al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 385 (milodiy 996) yilning rabi'ul avval oyida vafot etganlar. Qabrlari Buxorodagi 'Kalobod' mahallasida bo'lib, mashhurdir."
        ]
    },
    {
        "word": "Muhammad al-Azrakyoniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Hasan al-Azrakyoniy – yuqorida nomlari zikr qilingan tijoratchining nevaralari. Buxoro ahlidan. Iroqqa safar qilganlar. Buxoroda Sahl ibn Mutavakkil, Sahl ibn Bishr al-Kindiy, Ahmad ibn Rizvon al-Xashshob, Sa'id ibn Zokir al-Asadiy, Muso ibn Aflah va Lays ibn Hibravayhlardan, Bag'dodda esa Muoz ibn Musanno al-Anbariy va Bishr ibn Muso al-Asadiydan ta'lim olganlar. Hijriy 344 (milodiy 956) yilning sha'bon oyida olamdan o'tganlar."
        ]
    },
    {
        "word": "Muhammad al-Aloiy",
        "type": [],
        "definition": [
            "Muhammad ibn Abdurahmon al-Aloiy imom, zohid, Buxoro ahlining voizi va mufassiri bo'lganlar. Tafsir ilmini bilishda tengi yo'q, fasohat (chiroyli so'zlash) bobida yagona, odoblari go'zal, barcha ishlari xos oldida ham, avom oldida ham maqbul edi. Buxoro ahli u kishi haqlarida yaxshi rivoyatlar qilishardi. Buxoroda u zotni tirikliklarida uchratmadim."
        ]
    },
    {
        "word": "Muhammad al-Afraxshiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Hotam al-Afraxshiy Buxoro mashoyixlaridan. Ibn Hayit nomi bilan tanilgan edilar"
        ]
    },
    {
        "word": "Muhammad al-Balʼamiy",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Ubaydulloh al-Bal'amiy Xuroson amiri Ismoil ibn Ahmadning vaziri edilar. Abul Fazl al-Bal'amiyning katta bobolari Rajo ibn Muabbid Rumning Bal'am shahrida yashaganlar. O'sha yerda oila qurib, serfarzand bo'lganlar. Farzandlariga 'al-Bal'amiy' deb nisbat berilgan.\r\nVazir Abul Fazl al-Bal'amiy o'z zamonalarining oqil, dono, olim kishisi va buyuk davlat arbobi edilar. Buxoro ahlidan. Juda ko'p olimdan dars olganlar. Bu zot haqlarida alohida kitob yozilgan. 'Tarixi Tabariy' asarini birinchi bo'lib fors tiliga tarjima qilganlar. Hijriy 329 (milodiy 942) yil safar oyining o'ninchi kuni kechasi vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Bardaiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Yahyo al-Bardaiy Bag'dodda yashaganlar. Hijriy 350 (milodiy 962) yilda Samarqandga kelganlar. U kishidan hadislar yozib olganmiz. Abu Bakr Muhammad ibn Fazl at-Tabariy va Abul Husayn Muhammad ibn Ibrohim al-G'oziy at-Tabariydan hadis rivoyat qilganlar. O'zlaridan esa Abu Sa'd Abdurahmon ibn Muhammad al-Idrisiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad al-Barroniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ismoil al-Barroniy - Buxoroning Barron nomli qishlog'idan bo'lib, ishonchli faqihlardan edilar. Bu kishi Abul Fazl al-Kog'aziy va Abul Badr Soib ibn Aburahmon al-Xayzaroniydan dars olganlar. Abu Bakr al-Barroniy faqih, ishonchli olimlardan bo'lib, bu kishi haqlarida Abu Komil al-Basiriy 'Muzohot' kitoblarida ma'lumot berib o'tganlar"
        ]
    },
    {
        "word": "Muhammad al-Barroniy al-Xatib",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Sahl al-Barroniy al-Xatib (Sahl al-Barroniyning o'g'illari) otalaridan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad al-Bodaniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Husayn al-Bodaniy al-Buxoriy - Buxoroning Bodan qishlog'idandir. U kishi Iroqqa safar qilib, u yerning peshqadam muhaddis olimlari – Yazid ibn Horun va Abu Naim Fazl ibn Dikkindan hadis ilmidan ta'lim olganlar. Hijriy 267 (milodiy 881) yilning safar oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Bujayriy",
        "type": [],
        "definition": [
            "Abul Hasan Muhammad ibn Umar al-Bujayriy otalaridan va Ishoq ibn Ibrohim ad-Dabariy, Ali ibn Abdulaziz al-Bag'aviy, Bishr ibn Muso al-Asadiy, Ya'qub ibn Yusuf al-Qozi va Umar ibn Hafs as-Sudusiydan hadis rivoyat qilganlar. Hijriy 345 (milodiy 957) yilning rabi'ul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Buxoriy az-Zandaniy",
        "type": [],
        "definition": [
            "Abu Ja'far Muhammad ibn Sa'id al-Buxoriy az-Zandaniy - Buxoroning Zandana nomli qishlog'idan bo'lib, Sa'id ibn Mas'ud al-Buxoriy, Ubaydulloh ibn Vosil al-Buxoriy, Abu Safvon Ishoq ibn Ahmad al-Buxoriy, Abdusamad ibn Fazl al-Balxiy, Hamdon ibn Zunnun al-Balxiy va Ahad ibn Husayn al-Balxiydan hadis ilmidan ta'lim olganlar. O'zlaridan esa Muhammad ibn Ham al-Buxoriy hadis ilmidan ta'lim olganlar. Hijriy 320 (milodiy 933) yilning ramazon oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Buxoriy al-Varroq",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Abu Bakr ibn Ahmad ibn Komil al-Buxoriy al-Varroq - 'G'unjor al-Hofiz' laqabi bilan tanilgan edilar. Yuz mingdan ko'p hadisni yoddan bilar edilar. Yoshliklaridan yuqorida nomlari zikr etilgan Iso ibn Muso G'unjordan hadislarni varaqqa yozib, u kishining hadislariga ergashganlari uchun 'G'unjor' degan laqab olganlar. 'Tarixi Buxoro' va 'Fazoil us-sahoba al-arba'a' ('To'rt sahoba fazilatlari') kitobining muallifi. Abu Solih Xalaf ibn Muhammad al-Xayyom, Abu Amr Muhammad ibn Muhammad ibn Sobir al-Buxoriy, Abu Homid Ahmad ibn Husayn al-Hamadoniy va boshqa juda ko'p ulamodan ta'lim olganlar. Marvga borib, u yerning mashoyixlaridan hadis yozib olganlar. O'zlaridan esa Imom Abu Bakr Muhammad ibn Ali al-Ja'fariy, Abul Muzaffar Hannod ibn Ibrohim an-Nasafiy, Abul Valid Hasan ibn Muhammad ad-Darbandiy, Abu Hafs Umar ibn Ahmad al-Bazzor, Abu Bakr Ahmad ibn Abdurahmon al-Hofiz ash-Sheroziy va Abu Tohir Husayn ibn Ali al-Hamadoniy hadis rivoyat qilganlar. Hijriy 412 (milodiy 1022) yilda Buxoroda vafot etganlar (qabrlari Ismoil Somoniy xiyobonining g'arbi-janubiy tomonida)."
        ]
    },
    {
        "word": "Muhammad al-Buxoriy al-Jadidiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Abdak al-Buxoriy al-Jadidiy (Buxoroda 'Sikkat ul-jadid' (Yangi ko'cha) deb nomlangan ko'cha bor) shu ko'chadan. Buxoro ahlidan. Imom al-Buxoriydan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad al-Buxoriy al-Qudaydiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Husayn al-Buxoriy al-Qudaydiy Buxoro ahlidan. Keyinchalik Qudaydga borib yashaganlar. Shuning uchun bu nisbat berilgan. Fozil imom va Abu Hanifa mazhabining faqihi edilar. 'Abu Bakr Xoharzoda' nomi bilan tanilgan edilar. Men bu kishini 'xo' harfida tilga oldim."
        ]
    },
    {
        "word": "Muhammad al-Buxoriy al-Qudaydiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Husayn al-Buxoriy al-Qudaydiy Buxoro olimlaridan bo'lib, 'Bakr Xoharzoda' nomi bilan tanilgan edilar. Buxoroning ma'lum va mashhur olimi Xoharzodaning avlodlari ekanliklari uchun shu nisbat berilgan. Bu kishi Buxoro qozisi Abu Sobit Muhammad ibn Ahmad al-Buxoriyning singillarining o'g'li bo'lib, imom, fozil, Abu Hanifa mazhabida, fiqh ilmida tengi yo'q dengiz edilar. Bu kishi fiqhiy masalalarni jamlab, yodlardilar. Buxoroda imlo aytar edilar . Otalari Abu Alidan va Mansur ibn Nasr al-Kog'aziy va boshqa olimlardan ta'lim olganlar. Abu Amr Usmon ibn Ali al-Paykandiy bu kishidan ta'lim olganlar. Abu Bakr Xoharzoda hijriy 483 (milodiy 1091) yil jumodul avval oyining yigirma beshinchisida, juma kuni kechasi Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Buxoriy al-Malohimiy",
        "type": [],
        "definition": [
            "Abu Nasr Muhammad ibn Ahmad al-Buxoriy al-Malohimiy Buxoro ahlidan. Abdulloh ibn Muhammad al-Buxoriy, Hotam ibn Aqiyl al-Buxoriy, Haysam ibn Kulayb ash-Shoshiydan hadis ilmidan ta'lim olganlar. Bag'dodda Mahmud ibn Ishoq al-Buxoriydan Abu Abdulloh al-Buxoriyning 'Raf' ul-yadayn fis-salot' ('Namozda ikki qo'lni ko'tarish'), 'al-Qiroatu xalf al-imom' ('Imom orqasida turib qiroat qilmoq') kitoblarini ta'lim olganlar. Abu Nasr al-Malohimiy 'A'yonu ashob al-hadis' va 'Huffoz al-hadis' unvonlari bilan mashhur edilar. Hijriy 312 (milodiy 925) yilda tavallud topib, hijriy 395 (milodiy 1006) yili sha'bon oyining yettinchi kunida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Buxoriy al-Harbiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ahmad al-Buxoriy al-Harbiy ham Buxoro ahlidan. Katta bobolarining ismlari Harb bo'lganligi uchun bu kishiga shu nisbat berilgan. Abu Ali Solih ibn Muhammad al-Bag'dodiy, Fazl ibn Bisom va Ibrohim ibn Ma'qaldan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdulloh al-G'unjor al-Hofiz hadis rivoyat qilganlar. Hijriy 354 (milodiy 966) yilning muharram oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Vananduniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Ishoq al-Vananduniy al-Buxoriy Ubaydulloh ibn Vosil, Abu Safvon ac-Sulamiy, Bakr ibn Sahl ad-Dimyotiydan hadis rivoyat qilganlar. Hijriy 313 (milodiy 926) yilning rabi'ul avval oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Vardoniy",
        "type": [],
        "definition": [
            "Abul Hasan Muhammad ibn Fath al-Vardoniy Buxoro ahlidan. Asbot ibn Yasa' al-Bohiliy va Ya'qub ibn G'armul al-Vobkaniydan hadis rivoyat qilganlar. O'zlaridan esa Sahl ibn Usmon al-Buxoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad al-Vardoniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Hasan al-Vardoniy Buxoro ahlidan bo'lib, Abu Safvon Ishoq ibn Ahmad va Sahl ibn Mutavakkildan hadis rivoyat qilganlar. Hijriy 333 (milodiy 945) yilning jumodul oxir oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Varkiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Hafs al-Varkiy al-Buxoriy Buxoroning Varka qishlog'i ahlidan. Xuroson, Iroq, Hijozda bo'lib, u yerdagi olimlardan ta'lim olganlar. Bu kishidan Abul Abbos Ja'far ibn Muhammad al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 381 (milodiy 992) yilning rabi'ul avval oyida Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Varkiy al-Mutavviʼiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Bakr al-Varkiy al-Mutavvi'iy solih shayx edilar. Varka ahlidan. Ko'p olim va fozil shogirdlari bor. Bu kishidan Abul Abbos al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 380 (milodiy 991) yilning rabi'ul oxir oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Vobkaniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Nazr al-Vobkaniy Buxoro ahlidan bo'lib, Sufyon ibn Abdulhakim, Ahmad ibn Zuhayr, Ahmad ibn Lays, Asbot ibn Yasa, Abu Abdulloh ibn Abu Hafs al-Kabir va boshqalardan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Muhammad ibn Dovud al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad al-Voiziy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Ahmad al-Voiziy al-Buxoriy Voiz nisbati bilan mashhur bo'lib, ilm talabida Iroqda bo'lganlar. Muhammad ibn Husayn ibn Ali al-Azrakyoniy, Muhammad ibn Ali al-Jabohoniy, Abu Bakr Ahmad ibn Sulaymon al-Abbodoniy va Ahmad ibn Komil al-Qozidan hadis rivoyat qilganlar. O'zlaridan Xoja G'unjor al-Hofiz hadis rivoyat qilganlar. Hijriy 383 (milodiy 994) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Gʻunjor al-Hofiz al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Ahmad al-G'unjor al-Hofiz al-Buxoriy Buxorodan bo'lib, Buxoro tarixi to'g'risida 'Tarixi Buxoro' nomi bilan mashhur bir kitob bitganlar. Biror kishi bunday qimmatli tarixiy kitob yozgan emas"
        ]
    },
    {
        "word": "Muhammad al-Jarjaroiy al-Hofiz ",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Idris al-Jarjaroiy al-Hofiz Buxoroda yashaganlar. Bu kishi hofiz al-hadis, ishonchli muhaddis, husnixatlari chiroyli xattot edilar; xayrli ishlarga doimo bosh-qosh bo'lar va ko'p ro'za tutardilar. Ilm talabida Buxoroga kelgunlariga qadar Abu Bakr Ahmad ibn Ibrohim al-Ismoiliy, Abu Ahmad ibn Yusuf ad-Dimashqiy, Abu Bakr Muhammad ibn Ahmad al-Jarjaroiy va boshqa olimlardan ta'lim olganlar. O'zlaridan esa Abul Abbos al-Mustag'firiy al-Hofiz va Abul Hasan Ali ibn Muhammad al-Ja'fariy hadis rivoyat qilganlar. Hijriy 415 (milodiy 1025) yil rabi'ul avval oyining beshinchisida, shanba kuni Buxoroda vafot etib, o'sha kuni Paykandga olib borilib, shu yerda dafn qilinganlar"
        ]
    },
    {
        "word": "Muhammad al-Jaʼfariy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ali al-Ja'fariy Buxoro ahlidan. Bu kishi Payg'ambar alayhissalomning amakilarining o'g'li Ja'far ibn Abu Tolib at-Tayyorning avlodlaridan bo'lganlari uchun ushbu nisbat berilgan. Abu Abdulloh Muhammad ibn Ahmad al-G'unjor va Abu Bakr Muhammad ibn Idris al-Jarjaroiy al-Hofizdan ta'lim olganlar. O'zlaridan esa Buxoroning peshqadam olimlari ta'lim olganlar. Abu Amr al-Paykandiy Abu Bakr al-Ja'fariyni taniydigan eng oxirgi roviy edilar. Bu kishi haqlarida Abdulaziz ibn Muhammad an-Naxshabiy 'Mu'jam ush-shuyux' ('Shayxlar qomusi') kitoblarida ma'lumot berganlar"
        ]
    },
    {
        "word": "Muhammad al-Jovarsoniy",
        "type": [],
        "definition": [
            "Abu Ja'far Muhammad ibn Bakr al-Jovarsoniy Buxoroda yashagan olimlardan. Bu kishi zohid, taqvodor va doim ibodat bilan mashg'ul bo'lib, nafl namozlarini ko'p o'qirdilar. Ko'zlari ojiz edi, ammo yuz mingdan ko'proq hadisni yoddan aytib berardilar. Abu Yahyo al-Hammoniy, Husayn ibn Ali al-Ju'fiy va Sa'id ibn Omir az-Zab'iydan hadis ilmidan ta'lim olganlar. Ahmad ibn Muhammad al-Buxoriy va Ishoq ibn Muhammad al-Buxoriy u zotning shogirdlaridan. Bu kishi hijriy 258 (milodiy 873) yili Omulda (Chorjo'yda) vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Jokardiziy as-Samarqandiy",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Ishoq al-Jokardiziy as-Samarqandiy bu nisbat bilan mashhurdirlar. Ilm talabida Xuroson, Iroq, Hijoz va Misrda bo'lganlar. Ja'far ibn Muhammad al-Faryobiy, Abu Alosa Muhammad ibn Amr al-Misriy va Ahmad ibn Tohir al-Misriydan hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad al-Juʼfiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Ismoil ibn Ibrohim ibn Mug'ira al-Ju'fiy al-Buxoriy 'Sahih ul-Buxoriy' kitobini ta'lif qilganlar. Bu kishining bobolari Mug'ira majusiy edilar. Mug'ira yuqorida nomlari zikr qilingan al-Musnadiyning bobolari, ya'ni Yamon al-Ju'fiy qo'lida musulmon bo'lganligi uchun u kishiga 'al-Ju'fiy' deb nisbat berilgan. Yamon al-Ju'fiy Buxoro hukmdori edilar. Imom al-Buxoriy hijriy 256 (milodiy 871) yili Samarqandning Xartang qishlog'ida Ramazon hayiti kechasi vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Izajiy",
        "type": [],
        "definition": [
            "Abul Husayn Muhammad ibn Husayn al-Izajiy Samarqandning Izaj qishlog'idan bo'lib, hikmat ilmi sohibi Abul Qosim al-Hakimning suhbatdosh do'sti edilar. U kishining ko'pgina hikmatli so'zlaridan bahramand bo'lganlar. Abu Sa'd al-Idrisiy bu kishidan hadis rivoyat qilganlar. Hijriy 387 (milodiy 998) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Izoriy",
        "type": [],
        "definition": [
            "Faqih Abu Bakr Muhammad ibn Homid al-Izoriy Buxoro ahlidan. Faqih Abu Bakr Muhammad ibn Ibrohim, Haysam ibn Kulayb ash-Shoshiy va Abdulloh ibn Muhammad al-Ustozdan ta'lim olganlar. Hijriy 383 (milodiy 994) yilning rajab oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Izuxiy ash-Shovzariy",
        "type": [],
        "definition": [
            "Abul Husayn Muhammad ibn Husayn al-Izuxiy ash-Shovzariy Abu Ya'qub Yusuf ibn Ali as-Samarqandiy va Samarqand qozisi Ahmad ibn Muhammad al-Balxiydan hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad al-Ismitaniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Nazr al-Ismitaniy Iso ibn Ahmad al-Asqaloniy al-Balxiy va Abu Iso Muhammad ibn Iso at-Termiziydan hadis rivoyat qilganlar. Hijriy 320 (milodiy 933) yildan oldin vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Isfaranjiy",
        "type": [],
        "definition": [
            "Abu Zayd Muhammad ibn Ismoil al-Isfaranjiy U kishi yosh faqih, fozil, chiroyli so'zlovchi, zehnlari o'tkir olim va shoir edilar. Hijriy 550 (milodiy 1156) yili o'z qishloqlarida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Ishtixaniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ahmad ibn Mat al-Ishtixaniy bu nisbat bilan mashhurdirlar. Faqih va muhaddis edilar. Imom al-Buxoriyning 'al-Jome' as-sahih' ('Ishonchli to'plam') kitoblarini Abu Abdulloh Muhamad ibn Yusuf al-Farabriydan rivoyat qilganlar. O'zlaridan esa ushbu kitobni Abu Nasr ad-Dovudiy rivoyat qilganlar. Hijriy 381 (milodiy 992) yilning rajab oyida vafot etganlar. Abu Komil al-Basiriy faqih Abu Nasr ad-Dovudiydan eshitganlar: 'Shayx Abu Bakr al-Ishtixaniyning huzurlariga hadisdan ta'lim olish uchun borgan edim. U kishi mendan: 'Imom al-Buxoriyning 'al-Jome' as-sahih'larini ta'lim olganmisan?' – deb so'radilar. 'Ha', – deb javob berdim. 'Kimdan?' – deb so'radilar. 'Ismoil al-Hojibiydan', – dedim. Aytdilar: 'Endi u kitobni mendan saboq ol, chunki men Imom al-Farabriydan ushbu kitobni ta'lim olganimda katta yoshli faqih edim. Ismoil al-Hojibiy esa hali yosh bola edi. U olgan bilim bilan mening olgan bilimim tengmi?!' O'shandan keyin men bu kishidan Imom al-Buxoriyning 'al-Jome' as-sahih'laridan ta'lim olishni boshladim'. Abu Sa'd al-Idrisiy 'Tarixi Samarqand' kitoblarida aytadilar: 'Abu Bakr al-Ishtixaniy shayx, fozil, zohid, faqih edilar. Ishtiqxonda u kishidan bir necha marta hadislar yozib olganmiz. Muhammad ibn Yusuf al-Farabriy va Hasan ibn Sohib ash-Shoshiydan hadis rivoyat qilganlar'. Hijriy 388 (milodiy 999) yilning rajab oyida Ishtixonda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Karobisiy al-Ushtobdiziy",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Solih al-Karobisiy al-Ushtobdiziy Samarqand ahlidan. Fozil, ishonchli muhaddis va ko'p hadislar roviysi. Abu Muhammad Abdulloh ibn Abdurahmon ad-Dorimiy, Abu Hafs Umar ibn Huzayfa al-Karobisiy al-Bohiliy, Shuayb ibn Lays al-Kog'aziy, Ya'qub ibn Yusuf al-Lu'luiy, Ali ibn Dovud al-Qantariydan hadis rivoyat qilganlar. Hijriy 322 (milodiy 935) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Karobisiy ar-Ruxshabudiy",
        "type": [],
        "definition": [
            "Abul Husayn Muhammad ibn Ishoq al-Karobisiy ar-Ruxshabudiy Ruxshabud (Termiz qishloqlaridan) nisbati bilan mashhurdirlar. Abu Abdulloh ibn Abdurahmon ad-Dorimiy as-Samarqandiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdulloh Muhammad ibn Ja'far al-Varroq hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad al-Koxushtuvoniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Sulaymon al-Koxushtuvoniy al-Buxoriy Buxoroning Koxushtuvon nomli qishlog'idan. Bu kishi haqlarida Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz 'Mu'jam ush-shuyux' ('Shayxlar qomusi') kitobida zikr qilganlar. Bu zot Abu Zar al-Bag'dodiydan ta'lim olganlar. Abu Bakr al-Ismoiliy, Abu Bakr Muhammad ibn Fazl va Abu Sa'id ar-Roziydan hadis rivoyat qilganlar. Muhammad al-Koxushtuvoniy imom Abul Fazl az-Zaranjariyning ustozlaridirlar. Hijriy 449 (milodiy 1058) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Kuziy as-Sakaniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ahmad al-Kuziy as-Sakaniy al-Buxoriy Buxoro ahlidan. Bu kishi solih shayx va to'g'ri so'z muhaddis edilar. Buxoroda Abu Sahl Horun ibn Ahmad al-Astrobodiy, Muhammad ibn Sobir al-Buxoriy, Fazl ibn Abbos al-Hiraviy va boshqa ulamolardan ta'lim olganlar. Bu kishidan esa Abdulaziz ibn Muhammad al-Hofiz an-Naxshabiy ta'lim olib, ustozlari haqida 'Mu'jam ush-shuyux' ('Shayxlar qomusi') kitoblarida zikr qilganlar."
        ]
    },
    {
        "word": "Muhammad al-Qozi al-Barkadiy",
        "type": [],
        "definition": [
            "Abu Ja'far Muhammad ibn Ahmad al-Qozi al-Barkadiy Buxoroda qozi bo'lganlar. Buxoro olimlaridan ta'lim olganlar. Amir Ismoil ibn Ahmad Somoniy zamonida hijriy 289 (milodiy 903) yilning zulhijja oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Quhanduziy",
        "type": [],
        "definition": [
            "Abu Amr Muhammad ibn Homid al-Quhanduziy 'Muazzin al-abyaz' nomi bilan tanilgan edilar. Bu kishi Buxoro ahlidan bo'lib, Abu Bakr al-Munkadiriy va Abu Amr Sa'id ibn Muhammad al-Ahnafdan hadis rivoyat qilganlar. Hijriy 369 (milodiy 980) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Quhanduziy",
        "type": [],
        "definition": [
            "Abu Abdurahmon Muhammad ibn Horun al-Quhanduziy Buxoro ahlidan bo'lib, ilm sohibi edilar. Abdulloh ibn Muborak, Sufyon ibn Uyayna, Fuzayl ibn Iyoz, Muhammad ibn Muslim at-Toifiy va Iso ibn Muso G'unjordan ta'lim olganlar. Ilm talabida Iroq va Hijozda bo'lganlar. Bu kishidan Sa'id ibn Janoh va Asbot ibn Yasa' al-Buxoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad al-Madiniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Abu Bakr al-Madiniy Buxoro olimlaridan. Solih shayx, taqvodor, parhezkor, kunduzlari ro'zador bo'lib, kechalarini esa tahajjud va nafl namozlarini o'qish bilan o'tkazar edilar. Yusuf Hamadoniyning suhbatdoshlaridan. Abu Muhammad az-Zubayriy, Abul Yusr al-Pazdaviy va Abu Bakr an-Nasafiydan hadis ilmidan ta'lim olganlar"
        ]
    },
    {
        "word": "Muhammad al-Maydoniy",
        "type": [],
        "definition": [
            "Xoja G'unjor 'Tarixi Buxoro' kitoblarida aytadilar: 'Abu Abdulloh Muhammad ibn Ismoil al-Maydoniy Buxoroning Maydon mahallasidan. Sa'id ibn Mansur, Yahyo ibn Yahyo, Muhammad ibn Salom al-Paykandiy va boshqa muhaddislardan hadis rivoyat qilganlar. O'zlaridan esa Abu Ismat Ahmad ibn Muhammad al-Yashkuriy va Abu Ali Husayn ibn Husayn al-Bazzoz hadis rivoyat qilganlar. Rabi'ul avval oyiga 3 kun qolganda, yakshanba kuni kechasi... (yili noma'lum) vafot etganlar'."
        ]
    },
    {
        "word": "Muhammad al-Margʻabuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Ahmad al-Marg'abuniy al-Buxoriy Buxoroning Marg'abun nomli qishlog'idan. Muhammad ibn Iso at-Tarsusiydan hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad al-Maʼrufiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Ahmad al-Ma'rufiy al-Buxoriy Buxoro ahlidan bo'lib, Buxoroda Homid ibn Sahl, Muhammad ibn Abdulloh ibn Sahldan va Basra olimlaridan ta'lim olganlar"
        ]
    },
    {
        "word": "Muhammad al-Mostiniy",
        "type": [],
        "definition": [
            "Muhammad ibn Ahmad al-Mostiniy Buxoroning Mostin nomli qishlog'idan bo'lib, Xanab nomi bilan tanilgan edilar. Xalaf ibn Muhammad al-Xayyomdan hadis ilmidan ta'lim olganlar. Hijriy 218 (milodiy 834) yilda tug'ilib, hijriy 301 (milodiy 914) yilning shavvol oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Mostiniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Abdulloh al-Mostiniy al-Buxoriy Buxoroning Mostin nomli qishlog'idan bo'lib, Ali ibn Hajar, Ali ibn Xushrum, Ishoq ibn Mansurdan hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad al-Muabbir al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ubaydulloh Muhammad ibn Surriy al-Muabbir al-Buxoriy – buxorolik ta'birshunos. Hanash ibn Harb, Honi' ibn Nazr va Muhammad ibn Ja'far al-Ijliydan ta'lim olganlar. O'zlaridan esa Ahmad ibn Sulaymon ibn Farinom ta'lim olganlar"
        ]
    },
    {
        "word": "Muhammad al-Muazzin al-Argʻiyoniy",
        "type": [],
        "definition": [
            "Abu Amr Muhammad ibn Ahmad al-Muazzin al-Arg'iyoniy peshqadam muhaddis olimlardan bo'lib, Samarqandda yashaganlar. Sahih hadislar roviysi, ishonchli va fozil muhaddis. Samarqandda Abul Abbos Muhammad ibn Ishoq as-Sarroj va Ali ibn Fazl al-Balxiydan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abu Sa'd al-Idrisiy hadis rivoyat qilganlar. U kishi aytadilar: 'Hijriy 369 (milodiy 980) yilning zulqa'da oyida Samarqandda vafot etganlar'."
        ]
    },
    {
        "word": "Muhammad al-Muazzin al-Faraxshiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Hotam al-Muazzin al-Faraxshiy Buxoroning Faraxshiy nomli qishlog'idan bo'lib, Abu Amr Qays ibn Anif va Abu Ali Solih ibn Muhammad al-Bag'dodiydan hadis rivoyat qilganlar. Hijriy 363 (milodiy 974) yil ramazon oyida iftor payti tovada pishirilgan qalin quymoqsimon non yeganda tomoqlariga tiqilib qolib, yuz yoshga yaqin umr ko'rib, to'satdan vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Muazzin as-Sobiriy",
        "type": [],
        "definition": [
            "Abu Amr Muhammad ibn Muhammad ibn Sobir ibn Kotib al-Muazzin as-Sobiriy Buxoro ahlidan. Bobolarining ismi Sobir edi. Shuning uchun 'as-Sobiriy' deb nisbat berilgan. Abu Ali Solih ibn Muhammad al-Bag'dodiy, Homid ibn Sahl, Muhammad ibn Hurays, Abu Sahl Muhammad ibn Abdulloh, Abdulloh ibn Ja'far at-Tojir va Muhammad ibn Munzir al-Hiraviydan ta'lim olganlar. O'zlaridan esa Abu Abdulloh Muhammad ibn Ahmad G'unjor al-Hofiz hadis rivoyat qilganlar. Hijriy 369 (milodiy 980) yilning jumodul oxir oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Muqri al-Kurkonjiy",
        "type": [],
        "definition": [
            "Abu Homid Muhammad ibn Ahmad al-Muqri al-Kurkonjiy Qur'on ilmini o'rganish uchun dunyo mamlakatlari, jumladan, Shom, Hijoz, Iroqda bo'lib, bu yerdagi imomlardan ta'lim olganlar. Kitoblar ham ta'lif qilganlar. Hijriy 481 (milodiy 1089) yili Marvda vafot etganlar.\r\nO'g'illari Abu Muhammad Abdurahmon ibn Muhammad al-Kurkonjiy Qur'on ilmi va qiroatda tengi yo'q qori va imom edilar. Ko'p muhaddisdan hadis ilmini o'rganganlar. Bobomdan Qur'ondan maxsus ta'lim olganlar"
        ]
    },
    {
        "word": "Muhammad al-Muqri al-Farabriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Abu Bakr al-Muqri al-Farabriy solih shayx, ishonchli muhaddis va Qur'oni karimni yoddan biluvchi qori edilar"
        ]
    },
    {
        "word": "Muhammad al-Munajjim al-Muabbir",
        "type": [],
        "definition": [
            "Abul Xattob Muhammad ibn Xalaf al-Munajjim al-Muabbir asli balxlik bo'lib, Buxoroda yashagan faqih olimlardan edilar. Balxda o'z zamonalarining ajoyib faqihlaridan edilar. U yerda avval Abu Bakr al-Forisiydan fiqh ilmidan ta'lim olib, so'ngra Iroqqa borganlarida fiqh ilmini qo'yib ilmi nujum (astronomiya) va tushlar ta'birini bilishga qiziqqanlar. Keyinchalik Buxoroni o'zlariga vatan qilib, Abu Abdulloh al-Halimiy va Abul Fazl al-Halimiyning uyida yashaganlar"
        ]
    },
    {
        "word": "Muhammad al-Mutavviʼiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Xolid al-Mutavvi'iy al-Buxoriy mashoyixlar avlodidan bo'lib, Buxoro muhaddislaridan edilar. Buxoroda Masih ibn Muhammad va Abu Abdurahmon ibn Abu Laysdan ta'lim olganlar. Marv, Nishopur, Bag'dod, Xurosonda bo'lib, u yerdagi muhaddislardan ham hadis rivoyat qilganlar. Muhammad al-Mutavvi'iydan Abu Abdulloh Muhammad ibn Abdulloh al-Hofiz al-Hokim ta'lim olib, 'Tarixi Nishopur' kitoblarida u kishi haqlarida ma'lumot berganlar. Haj ham qilganlar. Hijriy 362 (milodiy 974) yilda Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Mutahhariy al-Buxoriy",
        "type": [],
        "definition": [
            "Qozi Abul Fazl Muhammad ibn Ali al-Mutahhariy al-Buxoriy Buxoroning shayxlaridan va ilm ahlidan bo'lib, nihoyatda serg'ayrat va ma'rifatli kishilardan edilar. Ko'p olimdan ta'lim olganlar. Eshitgan jami hadislari haqida menga Balxda o'z qo'llari bilan ijozat xati yozib berganlar. Hijriy 537 (milodiy 1143) yili Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Muhtasib al-Buxoriy",
        "type": [],
        "definition": [
            "aqih Abu Abdulloh Muhammad ibn Hasan al-Muhtasib al-Buxoriy Buxoro ahlidan bo'lib, 'al-Muhtasib' nisbati bilan mashhur edilar. Abu Sobit al-Buxoriyning bobolari. Insonlarni yaxshilikka da'vat qilib, yomon ishlardan qaytarar edilar."
        ]
    },
    {
        "word": "Muhammad al-Muʼdil al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Hamdun al-Mu'dil al-Buxoriy - Nishopurning adolatli qozisi va raisi edilar. Ko'p ulug' olimlar u zotdan ta'lim olganlar. Hijriy 348 (milodiy 960) yilning ramazon oyida, 72 yoshda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Obid al-Mazrankaniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Hasan al-Obid al-Mazrankaniy Buxoro ahlidan. Abdusamad ibn Fazl va Hammod (Hamdon) ibn Zunnundan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Muhammad ibn Hafs al-Buxoriy hadis rivoyat qilganlar. Hijriy 329 (milodiy 942) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Paykandiy",
        "type": [],
        "definition": [
            "Abu Ja'far Muhammad ibn Ahmad al-Paykandiy Paykandda imom-xatib edilar. Bag'dodga borib, u yerning mashhur muhaddislaridan hadis ilmidan ta'lim olganlar. Hijriy 372 (milodiy 983) yili Paykandda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Paykandiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Salom al-Paykandiy hadis ilmining ishonchli muhaddislaridan bo'lib, bular Imom al-Buxoriyga, ya'ni Muhammad ibn Ismoil al-Buxoriyga ta'lim bergan muhaddis ustozlardan. Hijriy 225 (milodiy 841) yil safar oyining yettinchisida, yakshanba kuni vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Usmandiy",
        "type": [],
        "definition": [
            "Abul Fath Muhammad ibn Abdulhamid al-Usmandiy Bu kishi faqih, muhaddis, fozil va olim edilar. Abul Hasan Ali ibn Umar al-Xarrotdan ta'lim olganlar. Muhammad al-Usmandiyni Samarqandda bir necha marta uchratdim va menga u kishi: 'Dars olish uchun Marvga borib, Qozi al-Arsobandiyni topolmaganimdan keyin otangiz Muhammad ibn Mansur as-Sam'oniy rahimahullohdan 'Bay' ul-lahmi bish-shot' (Qo'y go'shtini sotish) masalasini so'radim. So'ngra Marvdan jo'nab ketdim', – dedilar. O'g'lim Abul Muzaffar as-Sam'oniy u kishidan ta'lim olgan."
        ]
    },
    {
        "word": "Muhammad al-Usrushaniy",
        "type": [],
        "definition": [
            "Abu Ja'far Muhammad ibn Amr al-Usrushaniy Buxoroda qozi edilar va mumtoz olim ham edilar. Amakilari Luqmon ibn ash-Shuabiy al-Usrushaniy, Sahl ibn Horun al-Astrobodiy, Muhammad ibn Sobir al-Buxoriy, Abu Sa'id Xalil ibn Ahmad as-Sijziy va Muhammad ibn Muzaffar al-Bag'dodiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Zar Muhammad ibn Ja'far al-Mustag'firiy hadis rivoyat qilganlar. Keyinchalik Samarqandda qozi bo'lganlar va qozilik davrlarida hijriy 404 (milodiy 1014) yilning safar oyida Samarqandda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Fagʻitusiniy",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Naim al-Fag'itusiniy ham Buxoro ahlidan bo'lib, Xoja G'unjor al-Hofiz bu kishidan hadis rivoyat qilganlar. Hijriy 372 (milodiy 983) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Fazliy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Muhammad al-Fazliy Buxoroda imom-xatib bo'lib, pok, zohid, nur yuzli va chiroyli siyratli edilar. Otalarining amakilarining o'g'li Abu Amr Usmon ibn Ibrohim al-Fazliydan ta'lim olganlar. Buxoroda hovlilarida hadis yozib olganman. Bu kishida Payg'ambar alayhissalomning kavushlari va hassalarining yarmi bor edi. Ularni har bir kelgan kishi ziyorat qilar edi. Hijriy 549 (milodiy 1155) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Faqih al-Bishr",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ibrohim al-Faqih al-Bishr Maydon mahallasidan. Abu Bakr ibn Hurays va Ali ibn Muso al-Qaysiydan hadis rivoyat qilganlar. Hijriy 339 (milodiy 951) yilning zulqa'da oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Faqih at-Termiziy",
        "type": [],
        "definition": [
            "Abu Ja'far Muhammad ibn Ahmad al-Faqih at-Termiziy Termiz ahlidan. Shofe'iy mazhabining faqihi, fozil, taqvodor, parhezkor va chiroyli siyratli edilar. Bag'dodda yashab, u yerning muhaddislaridan ta'lim olganlar. Muhammad ibn Nasr at-Termiziydan hadis rivoyat qilganlar. Hijriy 200 (milodiy 816) yilning zulhijja oyida tavallud topib, hijriy 295 (milodiy 909) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Farabriy",
        "type": [],
        "definition": [
            "Abul Bishr Muhammad ibn Ali al-Farabriy 'as-Sag'ir' nomi bilan tanilgan edilar. Buxoroda Abul Xattob Muhammad ibn Ibrohim at-Tabariy va Abu Nasr Ahmad ibn Abdurahmon ar-Rig'damuniydan hadislar yozib olganlar. Menga ijozat xati berganlar. Hijriy 550 (milodiy 1156) yili Farabrda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Farabriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Yusuf al-Farabriy Imom al-Buxoriyning 'al-Jome' as-sahih' ('Ishonchli to'plam') kitobini rivoyat qilganlar. Ko'p kishi kelib, bu zotdan ushbu kitobni yozib olganlar. Ali ibn Xushrum al-Marvaziydan ta'lim olganlar. O'zlaridan esa Abu Muhammad Abdulloh ibn Ahmad as-Saraxsiy, Abu Ishoq Ibrohim ibn Muhammad al-Mustamliy va Abul Haysam Muhammad ibn Makkiy al-Kushmihaniy hadis rivoyat qilganlar. Al-Farabriydan mazkur 'al-Jome' as-sahih' kitobini birinchi bo'lib rivoyat qilgan olim Abu Zayd Muhammad ibn Ahmad al-Foshoniydir. Oxirgi roviy esa Abu Ali Ismoil ibn Muhammad al-Kushoniydir. Al-Farabriy Imom al-Buxoriydan 'al-Jome' as-sahih' kitoblarini hijriy 254 (milodiy 869) yilda 23 yoshlarida ta'lim olganlar. Ali ibn Xushrumdan esa Farabrda hijriy 258 (milodiy 873) yilda ta'lim olganlar. Al-Farabriy hijriy 231 (milodiy 846) yilda tavallud topib, hijriy 320 (milodiy 933) yili shavvol oyiga uch kun qolganda, yakshanba kuni vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Faraxshiy",
        "type": [],
        "definition": [
            "Faqih Abu Bakr Muhammad ibn Homid ibn Ahmad al-Faraxshiy Buxoroning Faraxshiy nomli qishlog'idan bo'lib, Abu Rajo Muhammad ibn Hamdavayh al-Hofiz al-Huraqoniy, Abu Sahl Muhammad ibn Abdulloh, Ali ibn Muso al-Qumiy, Muhammad ibn Munzir al-Hiraviy va Abdulloh ibn Yahyo as-Saraxsiydan ta'lim olganlar. O'zlaridan esa Abu Abdulloh Muhammad ibn Ahmad al-G'unjor al-Hofiz al-Buxoriy ta'lim olganlar. Hijriy 355 (milodiy 967) yilning rajab oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Faroiziy as-Sarrom",
        "type": [],
        "definition": [
            "Abul Hasan Muhammad ibn Xalaf al-Faroiziy as-Sarrom Buxoro ahlidan bo'lib, ilm talabida Xurosonga kelib, so'ngra Iroqqa ketganlar. Sahl ibn Mutavakkil, Sahl ibn Bishr, Qays ibn Anif, Solih ibn Muhammad al-Bag'dodiy, Muoz ibn Musanno va Bishr ibn Muso al-Asadiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Muhammad ibn Fazl al-Buxoriy va nevaralari Abu Sa'id Muhammad ibn Hasan hadis rivoyat qilganlar. Hijriy 316 (milodiy 929) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Fominiy ash-Shayboniy",
        "type": [],
        "definition": [
            "Abu Ahmad Muhammad ibn Mardak al-Fominiy ash-Shayboniy Fomin qishlog'idan. Muhammad ibn Salom al-Paykandiy, Abu Ja'far Abdulloh al-Ju'fiy al-Musnadiy va Abu Qudoma as-Saraxsiydan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari Abu Abdulloh Muhammad ibn Muhammad al-Fominiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad al-Furoviy",
        "type": [],
        "definition": [
            "Abu Naim Muhammad ibn Qosim al-Furoviy Furovada rabot bino qilganlar. Humayd ibn Zanjavayhidan ta'lim olganlar. Ko'p ibodat qilar edilar. Taqvodorliklaridan ko'p yig'lardilar"
        ]
    },
    {
        "word": "Muhammad al-Xayyot",
        "type": [],
        "definition": [
            "Abul Husayn Muhammad ibn Husayn al-Xayyot Xorazmda yashaganlar. Bobolari tikuvchilik qilib kun kechirganlari uchun 'Xayyot' (tikuvchi) degan taxallus olganlar. Bu kishidan Abu Abdulloh Muhammad al-G'unjor al-Hofiz hadis rivoyat qilganlar. Hijriy 353 (milodiy 965) yilning zulqa'da oyida Samarqandda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Xayyot an-Navdobodiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Sa'id al-Xayyot an-Navdobodiy Ishoq ibn Hamza, Yahyo ibn Muhammad al-Lu'luiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Ishoq Ibrohim ibn Muhammad al-Buxoriy va Muhammad ibn Ham al-Buxoriy hadis rivoyat qilganlar. Hijriy 321 (milodiy 934) yilning muharram oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Xanbiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ahmad al-Xanbiyning otalari buxorolik bo'lib, o'zlari Bag'dodda tug'ilganlar. Buxoroga qaytib, vafotlariga qadar shu yerda yashaganlar. Hadis ilmiga mohir edilar. Ko'p hadis rivoyat qilganlar. Hijriy 350 (milodiy 962) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Xarʼonkatiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Xizr al-Xar'onkatiy Buxoroning Xar'onkat nomli qishlog'idan. Bu kishi Abdulloh ibn Muhammad al-Bag'aviy, Abu Homid Jibril ibn Majo al-Kushoniy, Tayyib ibn Muhammad al-Ishtixaniy, Abu Hafs Umar ibn Muhammad al-Buxoriydan ta'lim olganlar. Ilm talabida Xuroson, Iroqda bo'lganlar. Abu Abdulloh al-G'unjor al-Hofiz bu kishidan hadis rivoyat qilganlar. Hijriy 357 (milodiy 969) yilning rajab oyida Xar'onkat qishlog'ida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Xasravoniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Alo Muhammad ibn Muhammad ibn Ahmad al-Xasravoniy al-Buxoriy - Buxoroning Xasravon nomli qishlog'idan. Bu kishi to'g'ri so'z (siddiq) edilar. Taxminan hijriy 480 (milodiy 1088) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Xorazmiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Abbos al-Xorazmiy shoir-adib bo'lganlar. Bu kishiga 'Tabariy' deb ham nisbat berilgan, chunki otalari Omulning Tabaristonidan, onalari Xorazmdan. Abu Bakr al-Xorazmiy o'z asrining yagona tilshunosi, shoiri va nihoyatda zehni o'tkir kishilaridan edilar. She'rlari qisqa bo'lsa-da, ammo sermazmun edi. 'Devoni Abu Bakr al-Xorazmiy' nomli kitoblari bor. Bunda o'z hayotlari, she'rlari, zamondoshlari va Somoniylar davlati haqida ma'lumot beradilar (Bu devon hozir ham mavjud bo'lib, 1997 yili Eronda nashr qilingan).\r\nAbu Bakr al-Xorazmiy haqlarida Abu Abdulloh al-Hofiz al-Hokim 'Tarixi Nishopur' kitoblarida ham zikr qilganlar. Hijriy 383 (milodiy 994) yil ramazon oyining o'n beshinchisida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Xorazmiy al-Baraqiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Ahmad al-Xorazmiy al-Baraqiy Xorazm ahlidan bo'lib, adib, imom-xatib, chiroyli so'zlovchi, xattot va faqih olimlardan edilar. Ilm talabida Iroqqa safar qilganlar. Makkai mukarramada ham bo'lib, haj qilganlar. Keyinchalik Buxoroda muqim yashaganlar."
        ]
    },
    {
        "word": "Muhammad al-Xorazmiy at-Tabarxaziy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Abbos al-Xorazmiy at-Tabarxaziy taniqli shoirlardan. Otalari Tabaristondan, onalari Xorazmdan. Shuning uchun ikki nisbat bir qilinib, qisqartma shaklda 'At-Tabarxaziy' deyilgan. Bu nisbat bilan ham shuhrat qozonganlar.\r\nArab tilshunosligi va uning usullarini yoddan bilardilar. Zabardast shoir edilar. Bag'dodda Abu Ali Ismoil ibn Muhammad as-Saffor, Abu Bakr Ahmad ibn Komil al-Qozi va boshqalardan hadis ilmidan ta'lim olganlar. Hijriy 383 (milodiy 994) yilning ramazon oyida Nishopurda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad al-Xujodiy",
        "type": [],
        "definition": [
            "Abu Ali Muhammad ibn Ali al-Xujodiy Buxoroning Xujodo nomli qishlog'idan. Bu kishi nihoyatda ishonchli, muhaddis, fahmli va zehnlari juda o'tkir olim edilar. Ahmad ibn Ali al-Ustoz, Ismoil ibn Muhammad al-Mustamliydan va buxorolik mashoyixlardan ta'lim olganlar. O'zlaridan esa Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz hadis rivoyat qilganlar. Hijriy 417 (milodiy 1027) yilda tavallud topganlar."
        ]
    },
    {
        "word": "Muhammad al-Hassob al-Buxoriy al-Faroiziy",
        "type": [],
        "definition": [
            "Muhammad ibn Ibrohim al-Hassob al-Buxoriy al-Faroiziy hisob va muqaddarot (matematika) ilmiga mohir edilar. Shuning uchun ushbu nisbat berilgan. Hijriy 339 (milodiy 951) yilning zulqa'da oyida vafot etganlar. Bu kishi haqlarida ma'lumot Abu Abdulloh al-G'unjor al-Hofizning 'Buxoro tarixi' kitobida mavjud."
        ]
    },
    {
        "word": "Muhammad al-Hofiz al-Kinoniy",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Abdulloh al-Hofiz al-Kinoniy Buxoro ahlidan. Hadisni yaxshi tushunar edilar va uni hofiz al-hadisdan yodlab olar edilar. Bu kishi Abu Ali Solih ibn Muhammad, Nasr ibn Ahmad al-Bag'dodiy, Sahl ibn Hizom va Ali ibn Hasan an-Najjordek hofizlardan hadisdan ta'lim olganlar. O'zlaridan esa Xalaf ibn Muhammad al-Xayyom va Ahmad ibn Sahl al-Kindiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad al-Yazdodiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Abdulloh al-Yazdodiy Buxoro ahlidan. Mufassir va Hanafiy mazhabi olimlaridan bo'lib, 'Ibn al-Xabboz' kuniyasi bilan mashhur edilar. Bag'dod, Basra olimlaridan ta'lim olganlar. Hijriy 280 (milodiy 894) yilning safar oyida Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad al-Yasoragʻiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Hunayf al-Yasorag'iy Buxoroning Bamijkat qishlog'idan. Ko'p olimdan, jumladan, Abu Abdulloh ibn Abu Hafs, Asbot ibn Yasa'dan ta'lim olganlar"
        ]
    },
    {
        "word": "Muhammad an-Navjobodiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abul Mahosin Muhammad ibn Abu Nasr an-Navjobodiy al-Buxoriy - Abu G'onim Ahmad ibn Ali al-Kurosiydan ta'lim olganlar. O'zlaridan esa Muhammad ibn Abdulloh ibn Ahmad as-Samarqandiy hadis rivoyat qilganlar. Hijriy 470 (milodiy 1078) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad an-Narshaxiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Hamdon an-Narshaxiy Buxoro ahlidan bo'lib, Yahyo ibn Suhayldan hadis rivoyat qilganlar. O'zlaridan esa Dovud ibn Muhammad ibn Muso al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad ar-Razmonoxiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Yusuf ar-Razmonoxiy al-Buxoriy Buxoroning Razmonox nomli qishlog'idan bo'lib, Abu Hotam Dovud ibn Abul Avom, Abu Solih Xalaf ibn Omir va Jahon ibn Abul Hasan al-Farg'oniydan hadis rivoyat qilganlar. Hijriy 356 (milodiy 968) yilning muharram oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad ar-Rigʻdamuniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ahmad ar-Rig'damuniy fozil kishilardan bo'lib, yolg'iz qolganlarida sukunat va viqorni yaxshi ko'rardilar. Dinu diyonatni har xil gaplardan, tuhmatlardan himoya qilardilar. Buxorodagi Masjidi Kalon jome' masjidida imom-xatib edilar. Bobolari Abdurahmon ibn Ishoq ar-Rig'damuniy va Sulaymon ibn Ibrohim as-Saraxsiydan ta'lim olganlar. U kishidan Abu Amr Usmon ibn Ali al-Paykandiy hadis rivoyat qilganlar. Hijriy 518 (milodiy 1125) yilning jumodul avval oyida Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad ar-Rigʻdamuniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ahmad ar-Rig'damuniy fozil kishilardan bo'lib, yolg'iz qolganlarida sukunat va viqorni yaxshi ko'rardilar. Dinu diyonatni har xil gaplardan, tuhmatlardan himoya qilardilar. Buxorodagi Masjidi Kalon jome' masjidida imom-xatib edilar. Bobolari Abdurahmon ibn Ishoq ar-Rig'damuniy va Sulaymon ibn Ibrohim as-Saraxsiydan ta'lim olganlar. U kishidan Abu Amr Usmon ibn Ali al-Paykandiy hadis rivoyat qilganlar. Hijriy 518 (milodiy 1125) yilning jumodul avval oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad ar-Romitaniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Abu Hoshim ar-Romitaniy - Buxoroning Romitan nomli qishlog'idan bo'lib, Nazr ibn Shumayl va Affon ibn Abduljabbordan hadis rivoyat qilganlar. O'zlaridan esa nevaralari Abu Amr Abdurahmon ibn Abdulloh hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad as-Sagʻoniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ishoq as-Sag'oniy Bag'dodda yashaganlar. Abu Osim Zahhok ibn Mahmud, Abu Iso Muhammad ibn Iso at-Termiziy va Abu Bakr Muhammad ibn Horun ar-Ruyoniydan hadis rivoyat qilganlar. Bu kishi ishonchli muhaddis va taqvodor edilar. Ko'p sunnatga amal qilar edilar. Ilm talabida Bag'dod, Basra, Kufa, Madina, Makka, Shom va Misrda bo'lib, hadis yozib olganlar. Abu Abdurahmon an-Nasoiydan fiqh ilmidan ta'lim olganlar. Hijriy 270 (milodiy 884) yilning safar oyida vafot etganlar"
        ]
    },
    {
        "word": "Muhammad as-Safardariy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Dovud as-Safardariy Muhammad ibn Abu Ilyosdan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdulloh Muhammad ibn Ahmad al-G'unjor al-Hofiz hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad as-Saʼdoniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ahmad as-Sa'doniy al-Buxoriy - Sa'don nisbati bilan mashhur bo'lib, Buxoro ahlidandir. Ubaydulloh ibn Vosildan hadis rivoyat qilganlar. O'zlaridan esa Abu Amr Ahmad ibn Muhammad al-Muqri hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad as-Simajuriy",
        "type": [],
        "definition": [
            "Amir Abul Hasan Muhammad ibn Ibrohim as-Simajuriy aqlli inson va fozil amirlardan bo'lib, laqablari 'Nosir ad-davla' (Davlat yordamchisi) edi. Bu kishi ta'limni Abu Quraysh Muhammad ibn Juma al-Hofiz al-Quhistoniy va Abu Turob Muhammad ibn Sahl al-Voiz al-Qahastoniydan olganlar. Bu zot haqlarida Abu Abdulloh al-Hofiz al-Hokim 'Tarix' kitoblarida zikr qiladilar: 'Amir ibn amir ibn amir 'Nosir ad-davla', ya'ni Abul Hasan donishmand va aqlli amirlardan edilar. Davlat siyosatini qo'llari, tillari, qalamlari va qilichlari bilan yurgizar edilar. Nishopur, Hirot va Sijistonda (Kobuldagi mashhur shaharda) o'ttiz yildan ko'proq hukmdor va sulton xizmatida bo'lganlar. U kishidan rozi odamlar: 'Olimlarning qalbi – dunyo sirlarining qabri' deb aytar edilar'.\r\nMakkai Mukarramada o'z asrining yagona va ulug' olimi bo'lgan Abul Hasan al-Hoshimiy aytar edilar: 'Laqad mannallohu alaykum, yo ahla Xuroson, bil-amir al-odil Abul Hasan Muhammad ibn Ibrohim va ja'ala lano fiyhi avfar al-huzuz' (Ey Xuroson ahli! Darhaqiqat Alloh sizlarga odil amir – Abul Hasan Muhammad ibn Ibrohimni tuhfa qildi va Alloh uni biz uchun Xurosonga baxtlarning mukammali qildi).\r\nAbu Bakr al-Qaffol ash-Shoshiy aytadilar: 'Lav la al-amir Abul Hasan lamo istaqarra liy vataniy bish-Shosh' (Agar amir Abul Hasan bo'lmaganlarida edi, vatanim Shoshda muqarrar yashay olmas edim).\r\nQozi Abu Sa'id Xalil ibn Ahmad aytar edilar: 'Lav la al-amir Abul Hasan ma salima liy ruhiy inda xurujiy min Sijiston va ma vasaltu ila Buxoro' (Agar amir Abul Hasan bo'lmaganlarida edi, Sijistondan chiqayotganimda ko'nglim tinchimasdi va Buxoroga yetib borolmasdim.)"
        ]
    },
    {
        "word": "Muhammad as-Sorkuniy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ishoq as-Sorkuniy Buxoroning Sorkun nomli qishlog'idan. bo'lib, bu nisbat bilan mashhur edilar. Abu Bakr Muhammad ibn Ahmaddan hadis rivoyat qilganlar. O'zlaridan esa Buxoroda Abu Ubayd ibn Molik al-Xanomatiy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad as-Subizgʻukiy",
        "type": [],
        "definition": [
            "Muhammad ibn Hotam as-Subizg'ukiy Buxoroning Subizg'uk qishlog'idan bo'lib, sunnat ahlidan edilar. Muhammad ibn Mazohim va Ahmad ibn Hafsdan hadis rivoyat qilganlar. O'zlaridan esa Sahl ibn Shozavayh hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad as-Surmoriy az-Zushiy an-Nuriy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Abdusayyid as-Surmoriy az-Zushiy an-Nuriy - Buxoroning Zush nomli qishlog'idan. Samarqandda Abu Ahmad Abdurahmon ibn Ishoq ar-Rig'damuniydan hadis ilmidan ta'lim olganlar. Abu Hafs Umar ibn Muhammad an-Nasafiy bu kishidan hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad at-Tavziy al-Varasniniy",
        "type": [],
        "definition": [
            "Muhammad ibn Ibrohim ibn Xattob at-Tavziy al-Varasniniy Bu kishi Samarqandning Varasnin qishlog'ida yashar edilar. Keyinchalik Tavz qishlog'iga ko'chib borib yashaganlar. Abbos ibn Fazl an-Nadabiy, Muhammad ibn G'olib as-Samarqandiy va Ahmad ibn Bakr as-Samarqandiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Ja'far Muhammad ibn Makkiy an-Navoiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Muhammad at-Taroxiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Muso at-Taroxiy al-Buxoriy Taroxiy qishlog'idan. Hijriy 350 (milodiy 962) yil zulhijja oyining oxirida vafot etib, muharram oyining birinchi kunida dafn qilinganlar"
        ]
    },
    {
        "word": "Muhammad at-Tarxuniy",
        "type": [],
        "definition": [
            "Abul Fazl Muhammad ibn Ahnaf at-Tarxuniy ham Buxoro ahlidan bo'lib, Abu Bakr ibn Abu Amrning bobolari. Sa'id ibn Janoh, Hafs ibn Dovud va Nasr ibn Husayndan hadis rivoyat qilganlar. O'zlaridan esa Abu Nasr Ahmad ibn Abu Homid al-Bohiliy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad at-Tarxuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Abu Surriy at-Tarxuniy al-Buxoriy Buxoro ahlidan. Tarxun – bobolarining ismiga berilgan nisbat. Ilm talabida Hijoz, Iroq, Shomda bo'lib, Sufyon ibn Uyayna, Yahyo ibn Salim, Marvon ibn Muoviya, Abdulhamid ibn Abdulaziz va Iso ibn Muso al-Buxoriy G'unjordan hadis rivoyat qilganlar. Ishoq ibn Ahmad al-Buxoriy esa u kishidan hadis rivoyat qilganlar. Hijriy 247 (milodiy 862) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad at-Turboniy",
        "type": [],
        "definition": [
            "Abu Ali Muhammad ibn Yusuf at-Turboniy mashhur muhaddis va faqih edilar. Hijriy 323 (milodiy 936) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad at-Turvoxiy",
        "type": [],
        "definition": [
            "Faqih Abul Fazl Muhammad ibn Muhammad ibn Ahad at-Turvoxiy – shayx, shofe'iy mazhabining faqihlaridan va ishonchli muhaddis, 'Usuli sihoh' kitobining muallifi. Faqih Sa'id ibn Muso al-Ka'biy al-Xorazmiy va Abu Bakr al-Qosimiydan hadis ilmidan ta'lim olganlar. Abu Komil al-Basiriy al-Buxoriy bu kishidan ta'lim olganlar. Abu Muhammad Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz u kishi haqlarida 'Mu'jam ush-shuyux' ('Shayxlar qomusi') kitoblarida zikr qilib, aytganlar: 'Ya'qub ibn Sufyonning 'Tafsir' kitoblarining bir qismini shu kishidan ta'lim olganman'."
        ]
    },
    {
        "word": "Muhammad at-Tusiy an-Navqoniy al-Musofiriy",
        "type": [],
        "definition": [
            "Muhammad ibn Ahmad at-Tusiy an-Navqoniy al-Musofiriy Tusning Navqon shahri ahlidan bo'lib, muhaddislar avlodidan edilar. Buxoroda yashab, shu yerda vafot etganlar. Abu Abdulloh al-Hofiz al-Hokim shu kishining shogirdlaridan bo'lib, ustozlari haqlarida quyidagicha aytganlar: 'Buxoro va Nishopurda u kishi bilan bardavom suhbat qilganmiz. Keyinchalik Buxoroga kelib, vafotlariga qadar shu yerda yashaganlar. Hijriy 357 (milodiy 969) yil safar oyining o'n beshinchisida, juma kuni kechasi Buxoroda uyimda vafot etdilar. Janozalarini faqih Abu Bakr al-Avdaniy o'qidilar. Keyin u kishini 'Kalobod'da dafn qildik'"
        ]
    },
    {
        "word": "Muhammad ash-Shayboniy al-Karminiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Zav ash-Shayboniy al-Karminiy Bu kishidan bir hadisni Abu Homid Ahmad ibn Lays al-Karminiy rivoyat qilganlar. O'zlari esa Abu Ubayd Qosim ibn Salom, Muzohim ibn Sa'id al-Kushmihaniy, Abu Amr al-Havziy va boshqa muhaddislardan ta'lim olganlar. Hijriy 282 (milodiy 896) yilda vafot etganlar"
        ]
    },
    {
        "word": "Muhammad ash-Shanjiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Tohir Muhammad ibn Ali ash-Shanjiy al-Buxoriy Buxoro ahlidan bo'lib, 'Ash-Shujoiy' nomi bilan mashhur bo'lganlar. Abul Abbos Ja'far ibn Muhammad al-Mustag'firiy al-Hofiz bu kishidan ta'lim olganlar. Hijriy 415 (milodiy 1025) yildan keyin vafot etganlar."
        ]
    },
    {
        "word": "Muhammad ash-Sharafdaniy",
        "type": [],
        "definition": [
            "Abu Abdulloh Muhammad ibn Fazl ash-Sharafdaniy asli kufalik bo'lib, Sharafdan qishlog'ida yashaganlar. Bu kishidan Baqiyya ibn Valid, Hishom ibn Ubaydulloh ar-Roziy, Iso ibn Muso G'unjor va Muhammad ibn Qosim al-Asadiy ta'lim olganlar. Buxoroning 'Xashshobin' (yog'och va o'tinfurushlar) darvozasida turar edilar. Bu joy Sharafdan qishlog'idadir. Muhammad ash-Sharafdaniydan Buxoro mashoyixlari ta'lim olardilar. Yahyo ibn Yahyo Ishoq ibn Rohavayhga: 'Muhammad ibn Fazl ash-Sharafdaniydan hadislar yozib oldim', deganlar. Ishoq aytdilar: 'U kishi hadis ahlidan. Otalari Fazl ibn Atiyya al-Xurosoniy ishonchli va kuchli muhaddislardan edilar'. Dor ul-marzo (shifoxona) yaqinida dafn qilinganlar."
        ]
    },
    {
        "word": "Muhammad ash-Shargʻiy",
        "type": [],
        "definition": [
            "Imom Abu Bakr Muhammad ibn Ibrohim ash-Sharg'iy Buxoroning Sharg' nomli qishlog'idan. Ilm talabida Buxoro, Xuroson, Iroq va Hijozda bo'lganlar. Abul Makorim Nosir ibn Muhammaddan, u esa Hasan ibn Muhammaddan, u esa Abu Ishoq al-Kufiydan, u esa Vake'dan, u esa A'mashdan, u esa Abu Solihdan, u esa Abu Hurayradan quyidagi hadisni Payg'ambar alayhissalomdan rivoyat qilganlar: 'Iza suiltum hojatan falo taqulu 'la'. Fainnalloha taolo yabg'uzu 'la'. Va min bug'zihi 'la'. Lam yaxluq fil-jannati 'la'' (Agar biron kishi sizlardan hojat so'rab kelsa, unga 'yo'q' demanglar. Chunki Alloh taolo 'yo'q' lafzini yomon ko'radi. Uning g'azabini keltiruvchi so'z 'yo'q' so'zidir. Jannatda ham 'yo'q' narsani yaratmadi).\r\nAbu Komil al-Basiriy aytadilar: 'Mendan ushbu hadisni bir guruh ilgarigi va hozirgi faqihlar, mashoyixlar va muhaddislar yozib oldilar'. 'Ushbu hadis zaif bo'lib, Imom al-Buxoriyning 'Sahih ul-Buxoriy' va Imom Muslimning 'Sahih ul-Muslim' kitoblarida ham, 'Musnad' kitobida ham yo'qdir'."
        ]
    },
    {
        "word": "Muhammad ash-Shikoniy",
        "type": [],
        "definition": [
            "O'g'illari qozi Abul Muayyid Muhammad ibn Abdulxoliq ash-Shikoniy Samarqandda bir necha muddat qozi bo'lganlar. Undan keyin Keshda 30 yildan ortiqroq qozilik qilganlar. Hijriy 450 (milodiy 1059) yildan bir-ikki yil oldin tavallud topib, hijriy 520 (milodiy 1127) yil rajab oyining yigirma uchinchisida, yakshanba kuni Keshda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad ash-Shirgʻovashuniy",
        "type": [],
        "definition": [
            "Abu Nasr Muhammad ibn Abu Bakr ash-Shirg'ovashuniy - Buxoroning Shirg'ovashun qishlog'idan bo'lib, ilm talabida Xuroson va Iroqqa borib, u yerdagi mashoyixlardan ta'lim olganlar, keyin Buxoroga qaytganlar. Abu Muslim Ibrohim ibn Abdulloh al-Kajiy, Abu Shuayb al-Harroniy, Muhammad ibn Abdulloh al-Muqri, Yusuf ibn Ya'qub al-Qozi va Abu Ammora Muhammad ibn Ahmad al-Kushmihaniydan ta'lim olganlar. O'zlaridan esa jiyanlari Abu Ahmad Muhammad ibn Ahmad ash-Shirg'ovashuniy hadis rivoyat qilganlar. Hijriy 346 (milodiy 958) yilda vafot etganlar."
        ]
    },
    {
        "word": "Muhammad ibn Aliy",
        "type": [],
        "definition": [
            "Muhammad ibn Aliy – imom Husaynning Muhammad Boqir nomi bilan mashhur nabirasi. U kishi tashriq kunlarida nafl, ya'ni farzdan boshqa namozlar ketidan ham takbir aytar ekan. Ammo jumhur ulamolar nazdida, jumladan, hanafiylarga ko'ra, takbir faqat farz namozlaridan so'ng aytiladi."
        ]
    },
    {
        "word": "Muhammad ibn Atoulloh ibn Muhammad",
        "type": [],
        "definition": [
            "Bu zot 767 hijriy sanada Hirotda tug'ilgan. Hanafiy va shofe'iy mazhablarini yaxshi o'zlashtirgan. Allomai Taftazoniy rahmatullohi alayhidan dars olgan. Turli yurtlarning ilmiy muassasalarida dars bergan. Uzoq vaqt Qohirada yashab, u yerda obro' topgan, hokimlar uni ehtirom qilishgan. Ko'plab kitoblar ta'lif qilgan. Jumladan, 'Ta'riful ahkom', 'At-tamhiys fiy sharhit-talxiys', 'At-Tanviyr fiy talxiysil-Jome'il-kabir', 'Sharhi Misbohus Sunna', 'Al-Mun'im bisharhil-Jome'is-Sahihi li Muslim' kabi kitoblarni yozgan."
        ]
    },
    {
        "word": "Muhammad ibn Jazariy",
        "type": [],
        "definition": [
            "U kishining to'liq ismi Muhammad ibn Muhammad ibn Muhammad ibn Ali ibn Yusuf Jazariy Damashqiy. Kunyasi Abulxayr. U kishi ilmiy doiralarda Ibn Jazariy nomi bilan mashhur bo'lgan.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi hijriy 751 sana, Ramazon oyining yigirma beshinchisi, jumadan shanbaga o'tar kechasi (m. 1350 yil 30 noyabr) Damashq shahrida tavallud topdi. Imom Jazariy rahmatullohi alayhi kurd millatiga mansubdir.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhining otasi tojir bo'lgan. U kishi qirq yil bola ko'rmagan. So'ng hajga borib, zamzam suvidan ichib turib, Alloh taolodan olim farzand tilab, astoydil duo qilgan. Uning iltijo ila qilgan duosi qabul bo'lib, tarovih namozidan keyin o'g'li Muhammad tug'ilgan.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi Damashq shahrida katta bo'ldi. Xuddi shu shaharning o'zida Qur'oni Karimni o'n uch yoshida to'liq yod oldi. O'n to'rt yoshida namozda xatmga o'tdi.\r\nU kishi rahmatullohi alayhi boy-badavlat bo'lib, xushbichim, ko'rkam, go'zal, oq-qizg'ish rangli va fasohatli zot edi.\r\nILM TAHSIL QILIShI\r\nImom Jazariy rahmatullohi alayhining otasi solih, ilmga berilgan, ahli Qur'on kishi edi. Shuning uchun ham tilab olgan farzandini duoda so'raganidek inson bo'lishi uchun yoshligidanoq Qur'on ustozlarining, zamona ulamolarining huzuriga olib borib, ulardan ilm olishini ta'minladi. Imom Jazariyni otasi birinchi bo'lib, o'ziga Qur'ondan ta'lim bergan ustozi shayx Hasan Sarujiyning oldiga olib bordi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi yoshligidan qiroat ilmlariga qattiq qiziqdi va o'z asrining katta ustozlaridan dars oldi. Shom, Misr va Hijoz ulamolaridan 'Shotibiya', 'Taysir', 'Kofiy', 'Unvon', 'E'lon', 'Mustaniyr', 'Tazkira', 'Tajriyd' va bu sohadagi boshqa ona kitoblarni o'qib o'rgandi.\r\nImom Jazariy rahmatullohi alayhi Qur'on bilan birga hadis ilmini ham o'rganib bordi. Damashqda Faxr ibn Buxoriyning ashoblari va boshqalardan hadis tingladi. Muhammad ibn Ismoil Xabbozdek katta shayxlardan hadis ilmida ijoza olishga erishdi. Xabboz imom Jazariyning bobosining tog'asi edi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi nafaqat tajvid, qiroat hamda hadis ilmlarida, balki tafsir, fiqh, usuli fiqh, aqiyda, balog'at, nahv, sarf va boshqa ilmlarda ham yetuk olim bo'lib o'sdi.\r\nO'z vatanining mashoyixlaridan qiroat ilmining mashhur kitoblarini o'qib bo'lganidan so'ng Imom Muhammad ibn Jazariy rahmatullohi alayhining nafsi oliy sanadlarga erishish uchun Shomdan boshqa joylarga ilm talabida safar qilishni tusab qoldi. Uning o'zi Andalusga safar qilmoqchi bo'ldi. Uning niyati o'sha yerning shayxi, G'arnotaning xatibi Muhammad ibn Yusuf ibn Abdulloh Andalusiydan dars olish edi. Chunki mazkur shayx o'sha zamonning sanadi eng oliy qorisi edi. Ammo ota-onasi safarning mashaqqati va yo'lning xataridan qo'rqib, u tomonga safar qilishdan uni man etdilar.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhining birinchi safari hijriy 768 sanada haj niyatida Hijozga borish bo'ldi. Madinai Munavvarada u yerning shayxi, Hijozdagi eng oliy qiroat sanadining egasi shayx Abu Abdulloh Muhammad ibn Solih Muqriydan Rasululloh sollallohu alayhi vasallamning ravzalari va minbarlari orasida 'Kofiy' va 'Taysir' kitoblarini o'qidi.\r\nUndan so'ng Imom Muhammad ibn Jazariy rahmatullohi alayhi Misrga uch marta ilmiy safar qildi. So'ngra yana turli maqsadlarda Misrga ko'plab safarlar uyushtirdi.\r\nBirinchi ilmiy safar hijriy 769 sanada bo'lgan. Unda Imom Muhammad ibn Jazariy rahmatullohi alayhi Misrning uchta katta shayxlaridan qiroat ilmi bo'yicha dars olgan.\r\n1. Ibn Jundiy nomi bilan mashhur bo'lgan Abu Bakr ibn Oydug'di ibn Abdullohdan uning 'Al Bo'ston fiy qiroatis salasata ashar' kitobini o'qidi va vafotidan oldin u kishidan ijoza oldi.\r\n2. O'sha yili Abulhasan Muhammad ibn Abdurrohman ibn Ali ibn Soig'dan 'Shotibiya', 'Taysir' va 'Unvon' kitoblari asosida yetti qiroatni jamlab o'qidi. So'ngra yana 771 yili uning huzuriga safar qildi.\r\n3. Abu Muhammad Abdurrohman ibn Ahmad ibn Ali Bag'dodiy huzurida qiroatlarni jamlab ikki marta xatm qildi. Birinchi xatm 'Shotibiya', 'Taysir' va 'Unvon' kitoblari asosida bo'ldi. So'ng hijriy 771 sanada ikkinchi marta borib, ikkinchi xatmni qildi. O'sha safari davomida Qohirada 'At-Tamhid fiy ulumit tajvid' nomli kitobini yozdi.\r\nIkkinchi ilmiy safar hijriy 771 sanada amalga oshirildi.\r\nUnda Imom Muhammad ibn Jazariy rahmatullohi alayhi Qohirada turib qiroatlar, hadis va fiqh ilmlaridan darslar oldi. Yuqorida aytib o'tilgan ikki ustozidan qiroat ilmini oldi va xatmlar qildi.\r\nUchinchi ilmiy safar 778 hijriy sanada bo'ldi. Unda Imom Muhammad ibn Jazariy rahmatullohi alayhi qiroat, usul, ma'oniy va bayon ilmlari bo'yicha darslar oldi. So'ngra Iskandariyaga safar qilib, u yerdagi shayxlardan ilm oldi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi Misrga qilgan safarlaridan qaytib borganida Damashqdagi shayxlarning huzurida turli ilmlardan, xususan, qiroat ilmidan ko'p dars olar edi.\r\nZamonasining bir qancha ulamolari Imom Muhammad ibn Jazariy rahmatullohi alayhiga fatvo va dars berish hamda Qur'oni Karim qiroatini o'rgatish bo'yicha izojatlar bergan. Imom Muhammad ibn Jazariy rahmatullohi alayhi Shom va Quddusdagi bir necha madrasalarda darslar berdi. So'ngra o'zi Damashqning Aqabtul Katton nomli mavzesida 'Dorul Qur'on' nomli madrasa qurdi. Unda odamlarga qiroat ilmidan dars berdi.\r\nShomda yashasa ham doimo Misrga qatnab turdi. Hijriy 793 sanada Shomga qozi bo'ldi. Ammo bu borada ishi yurishmadi. Tezda bu ishni tark etdi. So'ngra amir Qutlubekning ba'zi idora ishlarini bajardi. Ammo bu yerdagi faoliyat uning boshiga ko'p qiyinchiliklar kelishiga va hayotining tamomila boshqa yo'nalishga burilib ketishiga sabab bo'ldi.\r\nHijriy 798 sananing jumadul avval oyida Imom Muhammad ibn Jazariy rahmatullohi alayhi Rum diyori tomonga qochib ketdi. Bunga Misrda uning mol-mulki zulm ila tortib olingani sabab bo'lgan edi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi Bursa shahrida qaror topdi. U Sulton Boyazid ibn Usmon huzurida yashay boshladi. O'sha paytlarda Bursa usmoniy Sulton Boyazid ibn Murod ibn O'rxon ibn Usmonning poytaxti edi. Unga 791 hijriy sanada bay'at qilingan bo'lib, u ilm va ulamolarni, Qur'oni Karim ahlini juda ham sevar va hurmat qilardi.\r\nAlloh taoloning inoyati bilan Imom Muhammad ibn Jazariy rahmatullohi alayhi o'sha yerlarda o'zining Shayx Hoji nomi bilan tanilgan, Damashqda unda dars olgan eski shogirdi bilan uchrashib qoldi. O'sha shogird uni sultonga tanishtirdi. Sulton esa uni ulug'ladi, izzat-ikrom ko'rsatdi. Unga har kuniga ikki yuz dirham maosh tayin qildi. Yana bir nechta otlar va xizmatkorlar berdi.\r\nShuningdek, bu yerda Imom Muhammad ibn Jazariy rahmatullohi alayhi o'zining eski shogirdlaridan biri Mo'min ibn Ali ibn Muhammad Rumiy Falakobodiy bilan uchrashib qoldi. U ham Damashqda imom Muhammad ibn Jazariy rahmatullohi alayhidan dars olgan edi. U o'sha shogirdinikiga joylashdi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi Bursada yashab, usmoniylarning lashkari bilan janglarda ishtirok etdi va ilmiy ishlar bilan mashg'ul bo'ldi. O'sha diyorning ahli undan qiroatlarni, hadisni o'rgandi. Ular u kishidan juda ko'p foyda oldilar. Imom Muhammad ibn Jazariy rahmatullohi alayhi bu yerda dars berish bilan birga kitob ta'lif qilish bilan ham mashg'ul bo'ldi. Hijriy 799 sanada o'zining mashhur kitobi 'An-Nashr fiy qiroatil ashr' nomli kitobini yozdi. O'sha yili 'Tiybatun Nashr' degan nazmiy asarini ham yozdi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi o'sha yerda doimiy yashab qolishni niyat qilgan bo'lsa kerak, uning bolalari ham u yerga kela boshladilar. U ham otasi bilan birga turib, odamlarga foyda bera boshladi. Shuningdek, boshqa bir o'g'li Abulxayr Muhammad ham kelib, namozda Qur'oni Karimni xatm qildi. 'Muqaddima' va 'Javhara' kitoblarini yod oldi. Uchinchi o'g'li Abulfath Muhammad Damashqda qolib, otasining ishlarini davom ettirdi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhining bu yerlarda yashaganiga olti yilu bir necha oy bo'lganida Amir Temur o'z askarlari bilan usmoniylar davlatiga hujum qildi. Imom Muhammad ibn Jazariy rahmatullohi alayhi usmoniylarning lashkari bilan birga hijriy 804 sanada Anqara yaqinida bo'lgan jangga chiqdi. Usmoniylarning lashkari yengildi. Sulton Boyazid asirga tushdi. Shuningdek, Imom Muhammad ibn Jazariy rahmatullohi alayhi ham asirga tushdi.\r\nAmir Temur Imom Muhammad ibn Jazariy rahmatullohi alayhidan xabardor bo'lib, uning kimligini anglab yetdi va o'zi borgan musulmon yurtlardagi katta ulamolarga nisbatan qiladigan odatiga binoan uni o'zi bilan Movarounnahrga olib ketdi.\r\nAmir Temur Imom Muhammad ibn Jazariy rahmatullohi alayhini Kesh – Shahrisabzga joylashtirdi. Katta olim bu yerda o'zining ilmiy ishlari uchun katta fursat va imkoniyat topdi. U odamlarga Qur'oni Karim bo'yicha ta'lim bera boshladi. Kitob yozish ishlariga butunlay ajrab chiqdi. Kesh va Samarqandda undan juda ko'p odamlar dars oldilar. Ularning ichida Abdulqodir ibn Tilla Rumiy, Hofiz Boyazid Keshiy, Kesh viloyati qiroat shayxining o'g'li Hofiz Mahmudlar ham bor edi. Shuningdek, Muhammad ibn Shihob al Xofiy al Hanafiy, Muhammad ibn Fazlulloh al Xatibiy kabi olimlar imom Jazariyning qo'lida hadis ilmidan dars olishdi. 'Ibn Arabshoh' laqabi bilan mashhur bo'lgan alloma Ahmad ibn Muhammad ibn Abdulloh al Hanafiy ham imom Jazariy rahmatullohi alayhidan hadis ilmidan tahsil olgan hamda ustozning bir qancha kitoblarini uning o'zidan dars olgan. Imom Jazariy Samarqandda 'Bog'i Xudo' madrasasida ham dars bergan.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi Movarounnahr diyorida Alloh taolo u kishiga bergan baraka tufayli juda ham samarali hayot kechirdi. Ko'plab olimlar bilan suhbat qurish, son-sanoqsiz tolibi ilmlarga turli ilmlardan dars berish bilan birga, bir qancha ilmiy asarlarni ham yozib bitirdi. Jumladan, qorilar tarixiga oid 'G'oyatul-maharoh fiz-ziyada alal-asharoh', qiroat ilmidagi 'Toyyibatun-nashr fil qiroatil ashr', nahvga doir 'Al javharoh', hozirgi kungacha tajvid ilmining asosi bo'lib xizmat qilib kelayotgan 'Al-muqoddima fii maa yajibu 'alaa qoriil-Qur'ani an ya'lamah' manzumalarini ham shu diyorda ta'lif etdi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi yerlik aholining ehtiyojini e'tiborga olib, hadis ilmi bo'yicha kitoblar yozishga kirishdi. Avval u 'Masobiyhus sunna' kitobini sharh qildi. Shunda yerlik ahli ilmlar hadis ilmi asoslari bo'yicha bir kitob yozishni iltimos qilishdi. Ularning iltimoslariga binoan Imom Muhammad ibn Jazariy rahmatullohi alayhi 'Al-Hidoya 'alaa Ma'olimir rivoya' nomli nazmiy asarini yozdi. Ammo bu kitob talabga javob bera olmadi. Shuning uchun mustalahul hadis ilmi bo'yicha 'Tazkiratul ulamaa fiy usuli ilmil hadis' nomli kitobini yozdi. Bu kitob o'zidan oldingi kitobga muqaddima bo'ldi.\r\nUshbu ishlardan keyin Imom Muhammad ibn Jazariy rahmatullohi alayhining obro'si yana ham ortdi. Uning shuhrati yetti iqlimga taraldi. Sanog'iga yetib bo'lmaydigan darajada ko'p odamlarga ilm o'rgatdi.\r\nBir kuni Amir Temur Samarqandda katta ziyofat berdi. U o'zining devonida o'tirdi. Uning cHar tarafiga amirlar o'tirishdi, o'ng tarafida ulamolar o'tirishdi. Ana o'sha majlisda Amir Temur Imom Muhammad ibn Jazariy rahmatullohi alayhini mashhur Sayyid Sharif Jurjoniy rahmatullohi alayhidan yuqoriga o'tirg'izdi. U o'sha vaqtda Samarqandda mudarris edi. Amir Temurdan nima uchun bunday qilgani haqida so'raldi. Shunda u kishi: 'Qanday qilib Qur'on va Sunnat bo'yicha olim va mushkul masalani so'ragan odamga darhol mushkulini yechib beradigan odamni oldinga o'tirg'izmay', dedi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi o'zining 'Muqaddimatut-tajvid' nomli mashhur nazmiy kitobini aynan shu yurtlarda yashagan kezlarida yozgani avval ham aytib o'tilgan edi. Bunga asardagi ayrim o'ziga xos holatlar ham ishora qiladi. Mazkur kitobdagi baytlardan birida shunday deyiladi:\r\nTarjimasi:\r\nMustafil harflarni ingichka qilgin,\r\nAlifni yo'g'on aytishdan hazir bo'lgin.\r\nArab nutq tovushlari talaffuz holatiga ko'ra ikkita katta qismga bo'linadi: mustafil va musta'liy. Mustafillar ochiq, ingichka aytiladi. Musta'liylar og'iz to'ldirib, yo'g'on talaffuz etiladi. Ammo ayrim nutq tovushlari goh unday, goh bunday o'qiladi. Shulardan biri alif, ya'ni cho'ziq 'a' unlisi hisoblanadi. Alif aslida o'zidan oldingi nutq tovushiga tobe bo'ladi: mustafildan keyin ingichka, musta'liylardan so'ng yo'g'on aytiladi. Demak, mazkur baytdagi 'Alifni yo'g'on aytishdan hazir bo'lgin' degan jumlani oldingi misraga bog'liq holda tushunish kerak. Muallif aytmoqchiki, 'Mustafil tovushlarni ingichka o'qi, ayniqsa, ularning ketidan kelgan alifni yo'g'on aytishdan hazir bo'l'.\r\nUshbu baytni izohlagan ayrim sharhchilar muallif nega bunday deganini tushunishga va tushuntirishga qiynalganlar. Chunki bu yerda ogohlantiralayotgan xato – mustafil harflardan keyin alifni yo'g'on aytish holati arablarda kuzatilmaydi. Shu bois bu tanbehni o'rinsiz deb bilganlar ham, 'Buni qanday tushunish mumkin, axir alif musta'liylardan keyin yo'g'on aytiladi ku?' degan ma'noda e'tiroz bildirganlar ham bo'lgan. Aslida esa muallif bu yerda ajamlarda, jumladan, bizning yurtlarda keng tarqalgan xatoga ishora qilmoqchi bo'lgan. Masalan, 'bimaa', 'innaa' kalimalarini 'bimoo', 'innoo' shaklida o'qish. Bu xato odamlarimiz o'rtasida hozir ham bor. Zakariyo Ansoriy kabi shorihlar buni alohida ta'kidlab aytganlar.\r\nBundan imom Jazariy bu yerda kishilarga ta'lim berar ekanlar, ushbu yurt aholisining xususiyatlarini ham kuzatib, o'z munosabatini bildirgani anglashiladi. U kishining yerlik aholi bilan qorishib, ularning hayotlariga aralashib yurgani bilinadi.\r\nAmir Temurning vafotidan keyin Imom Muhammad ibn Jazariy rahmatullohi alayhi o'z vataniga qaytib ketishni qasd qildi. U safarga otlanib, Hirot shahriga yetib bordi. U yerda undan o'n qiroat bo'yicha ko'pchilik dars oldi. Ulardan Jamoliddin Muhammad ibn Muhammad ibn Iyatixor Hiraviy darslarni oxirigacha tugalladi.\r\nSo'ngra Imom Muhammad ibn Jazariy rahmatullohi alayhi Yazd shahriga yetib keldi. U yerda ham undan o'n qiroat bo'yicha ko'pchilik dars oldi. Ularning ichida Shamsuddin Muhammad ibn Dabbog' Bag'dodiy ham bor edi. Lekin ko'pchilik oxirigacha yetkaza olmadi.\r\nKeyin Imom Muhammad ibn Jazariy rahmatullohi alayhi Isfihonga kirdi. U yerda ham undan o'n qiroat bo'yicha ko'pchilik dars oldi, ammo hech kim mukammal qila olmadi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi hijriy 808 sanada Sherozga yetib bordi. Bundan u kishining yo'lda juda ham tez yurgani bilinadi. Chunki Samarqand bilan Sheroz orasidagi masofani bir oyda kesib o'tgan. Shu bilan birga, odamlarga qiroat ilmidan ijozatlar ham bergan.\r\nSherozda Imom Muhammad ibn Jazariy rahmatullohi alayhini u yerning sultoni Pirmuhammad tutib qoldi. U kishidan ko'plab odamlar o'n qiroatni ta'lim oldilar. So'ngra Sherozning sultoni Pirmuhammad uni qozi bo'lishga majburladi. O'zi istamagan holda ushlanib qolgan Imom Muhammad ibn Jazariy rahmatullohi alayhi bir muddat Sherozda qolib ketdi. Podshohlar o'zgardi. Keyin esa Imom Muhammad ibn Jazariy rahmatullohi alayhi Sherozda doimiy ravishda yashab qoldi. U yerning ahli u kishidan Qur'oni Karim va hadis ilmlarida ko'p foyda oldi. Imom Muhammad ibn Jazariy rahmatullohi alayhi o'sha yerda 'Dorul ¬Qur'on' nomli madrasa ochdi. Bozor yaqinida o'ziga uy-joy qurdi. Oilasi bilan birga jamlandi. Farzandlari va nabiralari bu yerga kelishdi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi Sherozda o'n besh yil yashaganidan keyin hijriy 822 sanada haj safariga chiqdi. Avval Basraga, u yerdan Unayzaga bordi. Unayzadan chiqib, yo'lda ketayotganida sahro qaroqchilariga duch keldi. Shu sabab Unayzaga qaytdi. O'sha yerda 'Ad-Durratul Muziy'a fiy qiroaatis salasa murziyya' kitobini nazm ila ta'lif qildi. Bo'lib o'tgan hodisalar tufayli hajdan qoldi.\r\nSo'ngra Imom Muhammad ibn Jazariy rahmatullohi alayhi Yanbu'da bir muddat turganidan keyin Madina tomon yuzlandi. So'ngra Makkaga bordi. O'sha yerda Baytullohga qo'shni bo'lib turdi. Hijriy 823 sanada haj qildi va Iroqqa qaytdi. Misrning podshohi Muayyadga Qohiraga kirish uchun izn so'rab muktub yozgan edi, o'sha yili u vafot etib qoldi. Shuning uchun Imom Muhammad ibn Jazariy rahmatullohi alayhi to'g'ri Sherozga qaytdi.\r\nSo'ngra yana haj hamda Misr va Qohirani ziyorat qilish niyatida yo'lga otlandi. O'ttiz yildan so'ng avval ona shahri Damashqqa kirdi. U yerdan turib Qohiraga kirishga izn so'ragan edi, izn berildi. Qohirada odamlarga Qur'oni Karim va hadisdan darslar berdi. Keyin hojilar bilan birga Makkaga yo'l oldi. So'ngra dengiz yo'li bilan tijorat maqsadida Yamanga ravona bo'ldi. U yerda hadisdan dars berdi.\r\nImom Muhammad ibn Jazariy rahmatullohi alayhi hijriy 828 sanada yana bir bor haj qildi. So'ngra Qohiraga bordi. U yerda uning huzuriga undan ilm olish uchun odamlar yog'ilib kelishdi. O'sha paytlarda yetmish yetti yoshga kirgan Imom Muhammad ibn Jazariy rahmatullohi alayhining qulog'i bir oz og'irlashib qolgan edi. Ammo ko'zi juda ham yaxshi ko'rar, nihoyatda chiroyli xat yozar edi.\r\nKeyin Imom Muhammad ibn Jazariy rahmatullohi alayhi Shom va Basra orqali Sherozga qaytib ketdi. U yerda yana bir necha yillar yashab, ilmiy xizmatlarni qildi."
        ]
    },
    {
        "word": "Muhammad ibn Jaʼfar al-Paykandiy",
        "type": [],
        "definition": [
            "Paykand ahlidan bo'lib, Abu Osim va Abdurazzoqdan hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Muhammad ibn Jaʼfar an-Narshaxiy",
        "type": [],
        "definition": [
            "Abu Bakr Muhammad ibn Ja'far an-Narshaxiy – 'Buxoro tarixi' kitobining muallifi. Buxoro ahlidan bo'lib, Abu Bakr ibn Hurays, Abdulloh ibn Ja'far va boshqalardan hadis rivoyat qilganlar. Hijriy 286 (milodiy 900) yilda tavallud topib, hijriy 348 (milodiy 960) yilning safar oyida vafot etganlar."
        ]
    },
    {
        "word": "Muhammad ibn Xolid as-Sulamiy",
        "type": [],
        "definition": [
            "Muhammad ibn Xolid as-Sulamiy Rasululloh sollallohu alayhi vasallamning hadislarini otalari va bobolaridan rivoyat qildilar. Bu kishidan esa Abu Molij va boshqalar rivoyat qildilar."
        ]
    },
    {
        "word": "Muhammad surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 38 oyatdan iborat.\r\nUshbu surai karima boshqa madaniy suralar kabi, shariat hukmlariga, ibodatga, odob-axloqqa, muomala va shunga o'xshash narsalarga ahamiyat beradi. Bu surada Nabiy alayhissalomning nomlarini abadiylashtirish, u zot oxirgi payg'ambar ekanliklari, u zot ila nabiylik tugagani, u zot omonatli va sodiq ekanliklari, u zotga ergashganlar to'g'ri yo'lda bo'lishlari, ular ilohiy hidoyat sohiblari ekanliklari haqida so'z ketadi. Shuning uchun va suraning ikkinchi oyatida '…va Muhammadga nozil qilingan narsaga…' degan jumla kelgani uchun ham ushbu muborak sura Muhammad surasi deb nomlanadi.\r\nBu suraning ikkinchi nomi 'Qitol'dir. Allohning dushmanlariga qarshi sahobalar olib borgan qitollar (urushlar, janglar) ushbu suraning asosiy mavzusi bo'lgani uchun ham, unga shu nom berilgan.\r\nSura iymon va kufrning haqiqatini bayon qilish hamda mo'min-musulmonlaru kofir-fojirlarning sifatlarini bayon etish bilan boshlanadi.\r\nMuhammad surasi Allohning dini ustun bo'lishi uchun janglarda qatnashib, yer yuzini shirkdan tozalashga hissa qo'shganlarni madh etar ekan, aslida, Alloh busiz ham o'ch olishi mumkin ekani, lekin kishilarni sinash uchun shunday qilganligini bayon qiladi.\r\nShuningdek, mo'minlarning Allohning diniga nusrat berishdagi vojib amallari, dushmanlarning ziddiga harakat qilish lozimligi, agar Allohning diniga xizmat qilsalar, Yaratganning O'zi ularni sobitqadam qilib, baxt-saodatga erishtirishi mumkin ekani haqida so'z yuritiladi.\r\nSo'ngra inkor etuvchilarning oqibatlari yomon bo'lishi haqida gap ketib, Makka ahli o'zlaridan avval halokatga uchraganlardan ibrat olishga undaladi. Tug'yonga ketganlarni, sarkash qavmlarni, dinni yolg'onga chiqaruvchilarni Alloh taolo qanday ahvolga solgani eslatiladi.\r\nSurai karima mo'minlar bilan kofirlarning niyat-maqsadlarini taroziga solib ko'radi. Mo'minlar Allohga ibodat qiladilar, Uning roziligini qasd qiladilar, jannati na'imga kirishni orzu qiladilar. Shuning uchun ham Alloh taolo ularning talablarini qondiradi.\r\nKofirlar esa havoyi nafslariga banda bo'ladilar, hayotning ma'nosini qorin to'ydirib, shahvat qondirishdan iborat, deb biladilar. Shuning uchun ham ularning boradigan joylari jahannamning qa'ri bo'ladi. Bu dunyoda o'zlarini o'zlari xor qilgan edilar, u dunyoda ham xor bo'ladilar.\r\nMo'minlar bilan kofirlar o'rtasidagi ulkan farqni ta'kidlash uchun surada jannat ne'matlari bilan do'zax azoblari solishtiriladi.\r\nUndan so'ng Islomga va musulmonlarga eng ashaddiy xatar bo'lmish munofiqlar haqida so'z yuritiladi. Ular Madinai Munavvarada o'zlarining boshliqlari Abdulloh ibn Salul rahbarligida musulmonlar bilan birga, o'zlarini go'yo musulmon ko'rsatib, aslida esa Islomga, musulmonlarga, Rasulullohga, sahobalarga ko'p yomonliklar qilish maqsadida kelar edilar. Ularning yahudiylarga qo'shilib, qilgan kirdikorlari boshqa madaniy suralar qatori, Muhammad surasida ham fosh etiladi.\r\nSuraning oxirida mo'minlar Allohning dini yo'lida baxillik qilmasdan, jonu molini sarflashga da'vat qilinadilar."
        ]
    },
    {
        "word": "Muhojir ",
        "type": [],
        "definition": [
            "Makka fathiga qadar Muhammad alayhissalomga ergashib Makkadan Madinaga ko'chib borgan musulmonlar"
        ]
    },
    {
        "word": "Muhoqala ",
        "type": [],
        "definition": [
            "'haql'–'dala' so'zidan olingan bo'lib, daladagi o'simlikni sotish ma'nosini bildiradi. Voqe'likda esa, o'sib chiqayotgan yoki chiqqan maysa ekinni o'lchovli bug'doyga sotishni anglatadi. Bundoq savdo mumkin emas. Chunki, bu ish aniq navli, ma'lum o'lchovli narsani o'zi yo'q, o'lchovi va navi noma'lum narsaga almashtirish hisoblanadi. Ekilgan bug'doy unib chiqib, yetilib hosilga kiradimi, yo'qmi, yaxshi pishadimi, pishsa navi qanday bo'ladi–hammasi noma'lum. Bu holda tayyor bug'doyning egasi kuyib qolishi mumkin."
        ]
    },
    {
        "word": "Muhtazar",
        "type": [],
        "definition": [
            "O'limga yuz tutgan shaxs(vafot etayotgan inson)"
        ]
    },
    {
        "word": "Muhtasib",
        "type": [],
        "definition": [
            "arabcha so'z bo'lib, hisobchi, shariatga xilof ishlarni tekshiruvchi, bozordagi tosh-tarozi va narxlarni nazorat qiluvchi degan ma'noni anglatadi"
        ]
    },
    {
        "word": "Mucha ",
        "type": [],
        "definition": [
            "Abu Hurayra roziyallohu anhudan rivoyat qilinadi:\r\n'Nabiy sollallohu alayhi vasallam: 'Ayolning to'rt muchasi* orasiga o'tirsa, so'ng unga kuch sarflasa, g'usl vojib bo'libdi', dedilar'.\r\n* 'Mucha' deb tarjima qilingan so'z hadisda 'shu'ab' ('a'zolar') deb kelgan. Hadisda bu so'zdan qaysi a'zolar nazarda tutilgani haqida ulamolar turlicha fikrlarni aytishgan. Muhimi, bu so'z ayolga yaqinlik qilish ma'nosida ishlatilgan. Bu o'rinda undan ikki qo'l va ikki oyoq nazarda tutilsa, maqsadga muvofiq bo'ladi"
        ]
    },
    {
        "word": "Mushallal",
        "type": [],
        "definition": [
            "Mushallal – Qudayd qishlog'ining dengiz tarafida joylashgan tepalik"
        ]
    },
    {
        "word": "Mushrik ",
        "type": [],
        "definition": [
            "Xudoga sherik bergan. Ko'pxudolikning arab qabilalari o'rtasida, Islom vujudga kelishidan oldin keng tarqalgan sodda shakli. Mushriklar turli narsalarga: tosh, but, haykal, surat, hayvon... ibodat qilishgan."
        ]
    },
    {
        "word": "Mushtarak ish bajaruvchi",
        "type": [],
        "definition": [
            "'Mushtarak ish bajaruvchi' deganda faqat bir kishiga bog'lanib qolmagan ishchi yoki hunarmand ko'zda tutiladi. Tikuvchi, bo'yoqchi va shularga o'xshashlar"
        ]
    },
    {
        "word": "Muʼajjal",
        "type": [],
        "definition": [
            "Mahrni ikkiga bo'lib to'lash ham mumkin. Dastlabkisi avval beriladi va mahri mu'ajjal–'erta mahr' deb ataladi. Keyingisi keyin beriladi va mahri muajjal–'kechiktirilgan mahr' deb ataladi."
        ]
    },
    {
        "word": "Muʼayqiyb roziyallohu anhu",
        "type": [],
        "definition": [
            "Mu'ayqiyb ibn Abu Fotima ad-Davsiy al-Azdiy. Abdushshams qabilasi boshlig'i bo'lganlar. Birinchilardan bo'lib Makkada Islomga kirganlar. Habashiston va Madina muhojirlaridan bo'lganlar. Badr g'azoti, Rizvon bay'ati va bundan keyingi janglarda ishtirok etganlar.\r\nU kishi Rasululloh sollallohu alayhi vasallamning uzuklariga musharraf bo'lganlar. Mazkur uzuk Usmon ibn Affonning xalifalik davr¬larida 'Ariys' qudug'iga tushib ketgan va qaytib topilmagan.\r\nMu'ayqiyb roziyallohu anhu Abu Bakr va Umar roziyallohu anhularning xalifalik davrlarlarida xazinachi bo'lganlar.\r\nRasululloh sollallohu alayhi vasallamdan hammasi bo'lib, 7ta hadis rivoyat qildilar. Bu zotdan Abu Salama, Abdurrahmon ibn Avf, o'g'illari Muhammad va Horis, nevaralari Iyos ibn Horislar rivoyat qildilar. Bu kishi rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\nMu'ayqiyb roziyallohu anhu hijratning 40-sanasida, Usmon ibn Affon roziyallohu anhuning xalifalik davrlarida vafot etdilar."
        ]
    },
    {
        "word": "Muʼjam ",
        "type": [],
        "definition": [
            "muhaddis har bir ustozidan rivoyat qilgan hodisalarni bir joyga keltirib jamlangan"
        ]
    },
    {
        "word": "Moʻjiza",
        "type": [],
        "definition": [
            "aqlni ojiz qoldiruvchi hodisa"
        ]
    },
    {
        "word": "Muʼqin ",
        "type": [],
        "definition": [
            "'mu'qin' – aniq ishonuvchi odam."
        ]
    },
    {
        "word": "Muʼmin al-Bunjikatiy",
        "type": [],
        "definition": [
            "Abu Muslim Mu'min ibn Abdulloh al-Bunjikatiy Muhammad ibn Nasr al-Balxiydan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Hamdon al-Marvaziy hadis yozib olganlar."
        ]
    },
    {
        "word": "Muʼminun surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 118 oyatdan iborat.\r\n'Mu'minun' so'zi 'mo'min' so'zining ko'plik shakli bo'lib, 'mo'minlar' degan ma'noni anglatadi. Ushbu nomning o'ziyoq surada mo'minlar haqida alohida so'z ketishini bildirib turibdi. Ma'lumki, Makkada nozil bo'lgan suralarda aqiyda masalalari, tavhid, payg'ambarlik, qiyomat, qayta tirilish, bu dunyo hayotida qilingan amalga qarab, jazo yoki mukofot olish kabi masalalar bilan birga, 'Laa ilaaha illalloh' axloqiyoti, ya'ni ushbu shahodat kalimasini aytib, mo'min bo'lgan kishilarning odob-axloqi qanday bo'lishi haqida ham so'z yuritilgan. 'Mu'minun' ana shu borada o'ziga xos mavqega ega bo'lgan bir suradir.\r\nSura muvaffaqiyatga erishadigan mo'minlarning sifatlarini keltirish bilan boshlanadi. So'ngra insondagi va borliqdagi iymonga chorlovchi dalillar eslatiladi. Insonning paydo bo'lishidan boshlab, ona qornidagi rivoji, tug'ilishi, o'sishi va umrining oxirigacha bo'lgan holati bayon qilinadi. Keyin esa umuminsoniy hayotning qiyomatgacha davom etish jarayoni tilga olinadi.\r\nBulardan keyin borliqdagi osmonlarning yaratilishi, suvning tushirilishi, o'simlik va mevalarning o'stirilishi, insonga bo'ysundirib berilgan chorva hayvonlari va odamlar uchun ulov vazifasini bajaruvchi kemalar hamda hayvonlar xususida gap ketadi.\r\nShu bilan birga, iymon taqozo etadigan yagona haqiqat – 'Faqat Allohning O'zigagina ibodat qilish'ga da'vat masalasida ham batafsil gapiriladi. Xuddi shu da'vatni qilgan payg'ambarlardan Nuh, Hud, Muso va Iyso alayhimussalomning qissalari keltiriladi. Nihoyat, navbat Muhammad sollallohu alayhi vasallamga yetib keladi. Alloh taolo u zot sollallohu alayhi vasallamni payg'ambar qilib yuborganida mushriklar u kishini qanchalik qarshilik bilan kutib olganlari bayon qilinadi. Kofirlarning e'tirozlariga javoblar beriladi.\r\nKeyin esa oxir-oqibatda payg'ambarlar va ularga iymon keltirganlar doimo najotga erishib kelganliklari ta'kidlanadi.\r\nPayg'ambarlar haqida bayonotlardan so'ng, odamlarning ulardan keyin ixtilof qilib, tafriqaga tushishlari, dunyo hayotiga aldanishlari bayon etiladi. Ammo shunda ham haqiqiy mo'minlar fitnaga uchmasdan, Alloh taolodan qolmasdan, Unga ixlos bilan ibodat qilishlari, doimo U Zotdan qo'rqib turishlari vasf qilinadi.\r\nKeyin esa g'ofil bandalar azobga yo'liqqanlarida qanday holga tushishlari so'zlanadi.\r\nMu'minun surasida Nabiy sollallohu alayhi vasallamga xitoban, o'zlarini ma'lum holatlarda qanday tutishlari lozimligi yuzasidan ko'rsatmalar beriladi.\r\nSuraning oxirida esa Alloh taoloni poklab yod etiladi hamda kofirlar hech qachon najotga erisha olmasliklari ta'kidlanadi. Inson doimo Alloh taoloning rahmatini va mag'firatini tilab turishi lozimligi uqtiriladi."
        ]
    },
    {
        "word": "Muʼovama",
        "type": [],
        "definition": [
            "'Mu'ovama'–'om' 'yil' so'zidan olingan bo'lib yillashish ma'nosini bildiradi. Voqe'likda esa, bir daraxtning bir necha yillik mevasini oldindan sotishni bildiradi. Bundoq savdo ham haromdir. Chunki, unda yo'q narsani, taslim qilib berib bo'lmaydigan narsani sotish bilan shug'ullaniladi."
        ]
    },
    {
        "word": "Muʼtaziliy",
        "type": [],
        "definition": [
            "8–asrda arab xalifaligida vujudga kelgan, musulmonlardan ajralib chiqqan oqim."
        ]
    }
]