[
    {
        "word": "Naas surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 6 oyatdan iborat.\r\n    Qur'oni Karimning oxirgi surasi bo'lmish bu surai karimaga ham uning birinchi oyatidagi 'naas' so'zi nom bo'lib qolgan. 'Naas' – 'odamlar' deganidir.\r\n    Bu surai karima yomonlik bilan yaxshilik orasidagi kurashni tasvirlaydi. Shu bilan bir vaqtda, kishilarni yomonlikdan uzoqda bo'lish va undan g'olib kelishda Alloh taolodan yordam so'rashga undaydi."
        ]
    },
    {
        "word": "Nabatiylar ",
        "type": [],
        "definition": [
            "Nabatiylar – Arabiston yarim orolining shimoli-g'arbida yashab o'tgan qadimiy arab xalqlaridan biri. Ular asli arab bo'lib, keyin ajamlar, rumliklar bilan qo'shilib ketib, nasablari ham aralashib, tillari buzilib ketgan, Shom va Iroq hududidagi vodiylarda yashagan elat. Ular asosan dehqonchilik bilan shug'ullanishgan va shu boisdan, quduq qazib, suv tortishda yetarli bilim va malakaga ega bo'lganlari uchun 'nabatiy' – 'quduqchi', 'suv tortuvchi' deb nomlanib qolishgan. Ularning mamlakati hozirgi Iordaniya mamlakati hududida joylashgan bo'lib, poytaxti Batro shahri bo'lgan."
        ]
    },
    {
        "word": "Nabaʼ surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 40 oyatdan iborat.\r\n    'Naba'' – 'muhim xabar' degani bo'lib, suraning ichida kelgan shu so'z unga nom bo'lgan. Boshlanish so'zini e'tibor qilib, bu surai karima 'Amma surasi' ham deyiladi.\r\n    Muhammad alayhissalom Payg'ambar qilib yuborilganlaridan, u zotga Qur'oni Karim nozil bo'la boshlaganidan, u zot odamlarga diniy ta'limotlarni yetkazishni o'z zimmalariga olganlaridan so'ng mushriklar o'zaro: 'Nima kelibdi unga?', 'Qiyomat bo'ladi, deydimi?' kabi savollarni bir-birlariga berib yurishganda, Alloh taolo ushbu surani nozil qilgan. Bu surada qiyomat kuni haq ekani, unga ishonganlarning oqibati xayrli bo'lib, oxiratda jannatga tushishlari, ishonmaganlar do'zaxiy bo'lishlari ta'kidlanadi. Alloh taoloning qiyomatni qoim qila olishiga aqliy dalillar keltiriladi.\r\n    Surai karima qiyomat, qayta tirilish va hisob-kitob haqidagi oyatlar bilan boshlanadi. Zotan, Makka mushriklari ham o'sha paytda aynan shu haqda so'rar edilar.\r\n    So'ngra Alloh taoloning qudrati cheksiz ekaniga dalillar keltirilib, ana shunday ajoyibotlarni qilishga qodir bo'lgan Alloh taolo o'liklarni qayta tiriltirishi hech gap emasligiga ishora qilinadi.\r\n    Keyin esa o'sha qayta tirilish qiyomat kunida bo'lishiga, unda avvalgilaru oxirgilar hisob-kitob uchun to'planishlariga oid oyatlar keladi.\r\n    U oyatlarning ortida esa Alloh taolo kofir va osiylar uchun tayyorlab qo'ygan jahannam va undagi alvon azoblar haqida so'z yuritiladi.\r\n    Kofirlar haqidagi oyatlardan so'ng Qur'oni Karim uslubiga mos ravishda, taqvodorlar va ularning oqibatlari haqidagi oyatlar keladi.\r\n    Suraning oxirida esa qiyomat kuni dahshatlari va unda kofirlarning holi nima bo'lishi haqida so'z ketadi."
        ]
    },
    {
        "word": "Nabiz ",
        "type": [],
        "definition": [
            "'Nabiz' deb xurmo, mayiz kabi quruq mevalarni suvga ivitib, xamrga aylanmay turib iste'mol qilinadigan ivitmaga aytiladi. Agar uning vaqti o'tib ketsa, xamrga, ya'ni mast qiluvchi ichimlikka aylanib qoladi."
        ]
    },
    {
        "word": "Nabiy ",
        "type": [],
        "definition": [
            "payg'ambar, ilohiy xabar keltiruvchi, Allohning farmoyishini insonlarga yetkazib beruvchi vositachi shaxs."
        ]
    },
    {
        "word": "Nabiyz",
        "type": [],
        "definition": [
            "'Nabiyz' xurmo yoki mayizni suvga solib ivitganda hosil bo'ladigan xushta'm, mast qilmovchi ichimlikdir. Ammo nabiyz tayyorlashda xatoga yo'l qo'yilsa, ichimlik xamrga aylanib qolishi ham mumkin."
        ]
    },
    {
        "word": "Nabiyulloh ",
        "type": [],
        "definition": [
            "'Nabiyulloh' – Allohning nabiysi degani"
        ]
    },
    {
        "word": "Nabhon al-Baskoyiriy",
        "type": [],
        "definition": [
            "Abu Ahmad Nabhon ibn Ishoq al-Baskoyiriy Baskoyir qishlog'idan. Bu kishi faqih va zohid edilar. Buxoroda Sa'd ibn Muoz al-Marvaziy, Sufyon ibn Abdulhakim, Asbot ibn Yasa' va Abu Abdulloh ibn Abu Hafsdan ilm o'rganib, ularning tahsinlariga sazovor bo'lganlar. Keyinchalik Shom, Misr va boshqa arab mamlakatlariga borib, u yerdagi olimlardan ta'lim olganlar. Hijriy 320 (milodiy 933) yilning muharram oyida vafot etganlar."
        ]
    },
    {
        "word": "Nabhon al-Baskosiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ahmad Nabhon ibn Ishoq al-Baskosiy al-Buxoriy Baskos qishlog'idan bo'lib, bu nisbat bilan mashhurdirlar. Misr va Shom (Suriya) olimlaridan ta'lim olganlar. O'zlaridan esa Muhammad ibn Muhammad al-Buxoriy va Abu Bakr ibn Muhammad al-Buxoriy hadis rivoyat qilganlar. Hijriy 310 (milodiy 923) yilning muharram oyida vafot etganlar."
        ]
    },
    {
        "word": "Nabhon al-Fagʻdiriy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ahmad Nabhon ibn Hasan al-Fag'diriy al-Buxoriy Buxoroning Fag'din nomli qishlog'idan bo'lib, bu nisbat bilan mashhurdirlar. Iso ibn Muso G'unjordan hadis rivoyat qilganlar. Muhammad ibn Hasan ibn Vazzoh bu kishidan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Navodir",
        "type": [],
        "definition": [
            "Hanafiy mazhabidagi ikkinchi darajadagi kitoblar"
        ]
    },
    {
        "word": "Navozil ",
        "type": [],
        "definition": [
            "Abu Lays Samarqandiyning kitobi. Bunda keyin kelgan mujtahidlarning fatvolari jamlangan."
        ]
    },
    {
        "word": "Navʼ ",
        "type": [],
        "definition": [
            "Nav' – qadimiy Sharq taqvimiga ko'ra, ma'lum yulduzlarning har 13 kunda biri chiqqanda boshqasining botishidir. Bu almashuv bir yilda 28 marta sodir bo'ladi. Johiliyat kishilari yomg'ir yog'ishini o'sha yulduzlarning chiqishi yoki botishiga bog'liq deb e'tiqod qilishar edi"
        ]
    },
    {
        "word": "Najas ",
        "type": [],
        "definition": [
            "Najas pokning ziddidir. Shar'iy e'tiborda iflos sanalgan narsa najas bo'ladi."
        ]
    },
    {
        "word": "Najm surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 62 oyatdan iborat.\r\n    Ushbu surai karimaga ham o'zining birinchi so'zi ism bo'lib qolgan.\r\n    'Zoriyot', 'Tur' va 'Najm' ('Yulduz') suralarining uslub va mavzu jihatidan bir-biriga o'xshashini ko'p tafsirchilar bayon etganlar. Najm surasi ham avvalgi ikki sura kabi, asosan aqiyda masalasini muolaja qiladi. Xususan, unda Muhammad alayhissalomning haq payg'ambar ekanliklari, vahiyni farishta Jabroil orqali qabul qilishlari, u ulug' farishtani haqiqiy yaratilgan holida ko'rganliklari to'g'risida so'z ketadi. Shu bilan birga, dinsizlarning va mushriklarning aql ishlatmasliklari xususida hamda qiyomat kuni haqida ham oyatlar kelgan.\r\n    Mushriklar xudo to'g'risida xayollarida o'zlaricha har xil tasavvurlar yaratib olishgan, farishtalar xususida ham buzuq fikrlar bayon etar edilar. Misol uchun, butlaru farishtalar bizni shafoat qiladi, degan ma'noda afsonalar to'qib olishgan edi.\r\n    Sura davomida ana shu botil tushunchalar fosh etiladi. Mushriklarning barcha e'tiqod va ishlari gumonlarga asoslanganligi, Nabiy alayhissalom esa ularni ochiq-oydin va ishonchli xabar orqali iymonga chaqirayotganliklari bayon qilinadi.\r\n    So'ng Nabiy alayhissalomga xitob qilinib, Allohni unutgan, faqat dunyo tashvishida bo'lgan, sarkash dinsizlardan yuz o'girishga ko'rsatma beriladi. Qiyomat muqarrar qoim bo'lishi, unda hamma qilmishiga yarasha jazo yoki mukofot olishi ayni haqiqat ekani aytiladi. Chunki Alloh taolo har bir insonning onasi qornida homila ekanidan boshlab, to olamdan o'tgunicha bo'lgan davrdagi har bir harakati, qilgan ishi va yurish-turishini ochiq-oydin hisoblab qo'ygan. Endi qiyomatda bularning bari adolat ila hisob-kitob bo'lishi ta'kidlanadi.\r\n    Shundan so'ng Alloh taolo hamma shariatlarda, hamma payg'ambarlarda, ya'ni Ibrohim alayhissalomdan to oxirgi Payg'ambar Muhammad alayhissalomgacha – hammalarida aqiydaning asli bir ekanini tushuntiradi. So'ngra Allohning qudrati, asarlari, Uning yagonaligi, ulug'ligi, bularning dalillari haqida so'z yuritiladi. Mushriklarning e'tibori o'tgan qavmlarning taqdirlariga qaratiladi, ular kufrga ketganlari tufayli qanday halok bo'lganliklari eslatiladi."
        ]
    },
    {
        "word": "Nazar ahli",
        "type": [],
        "definition": [
            "mushohadagi asoslangan mulohaza, nazariy qarash ahli."
        ]
    },
    {
        "word": "Nazr ",
        "type": [],
        "definition": [
            "so'z berish, va'da qilish, ahd qilish."
        ]
    },
    {
        "word": "Nazr al-Bardodiy as-Samarqandiy",
        "type": [],
        "definition": [
            "Abu Salama Nazr ibn Rasul al-Bardodiy as-Samarqandiy Ahmad ibn al-Hanaziy, Sa'id ibn Xushnom, Solih ibn Sa'id at-Termiziy va Abu Iso Muhammad ibn Iso at-Termiziydan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Ali al-Kabuzanjakatiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Nazr al-Kahuniy",
        "type": [],
        "definition": [
            "Nazr ibn Abdulaziz al-Kahuniy Buxoroning Kahun nomli qishlog'idan. Huzayr ibn Nazrning otalari Iso ibn Muso al-G'unjordan hadis rivoyat qilganlar. O'zlaridan esa o'g'illari Huzayl ibn Nazr al-Kahuniy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Nazr ibn Shaybon",
        "type": [],
        "definition": [
            "Nazr ibn Shaybon Xuddoniy al-Basriy. Hadislarni Abu Salama ibn Abdurrahmon ibn Avf va otalaridan rivoyat qiladilar. Bu hadislar ro'zaning fazli to'g'risidadir.\r\n    Bu zotdan Qosim ibn Fazl Xuddoniy, Nasr ibn Ali al-Jahzamiy, Abu Aql ad-Davraqiylar rivoyat qilganlar."
        ]
    },
    {
        "word": "Nakra",
        "type": [],
        "definition": [
            "Noaniq"
        ]
    },
    {
        "word": "Naqib",
        "type": [],
        "definition": [
            "Naqib – guruhga rais bo'lib, uning nomidan gapiruvchi shaxs, oqsoqol"
        ]
    },
    {
        "word": "Naqiyr ",
        "type": [],
        "definition": [
            "Naqiyr – quritib, ichini o'yib, idish yasalgan xurmo ildizi"
        ]
    },
    {
        "word": "Naqiʼ ",
        "type": [],
        "definition": [
            "Naqi' – xurmo ivitmasi. U mayizdan ham tayyorlangan"
        ]
    },
    {
        "word": "Namat ",
        "type": [],
        "definition": [
            "Namat – jundan qilinadigan tukli to'shama bo'lib, uni hozir kigiz ham deyiladi"
        ]
    },
    {
        "word": "Namira ",
        "type": [],
        "definition": [
            "Namira – jundan qilingan, oq-qora yo'lli, popuk hoshiyali ustki kiyim"
        ]
    },
    {
        "word": "Naml surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 93 oyatdan iborat.\r\n    Surai karimada naml (chumoli) haqida ham so'z ketgani uchun u shu nom bilan atalgan.\r\n    Bir tarafdan, bu narsa, ya'ni Qur'oni Karimdek ilohiy dastur bo'lmish kitobdagi butun boshli bir suraning 'Chumoli surasi' deb nomlanishi hayvonot olamiga e'tiborni tortishdir. Hayvonot ham o'ziga yarasha bir olam bo'lib, ular ham insonlarga o'xshash ummatlar ekani, ularga e'tibor berish, ularni o'rganish zarurligi sura ichidagi oyatlardan fahmlab olinadi. Ayniqsa, hazrati Sulaymon alayhissalom qissalarida bu narsa alohida bo'rtib turadi.\r\n    Ulamolarimizning ta'kidlashlaricha, Naml surasi bevosita Shuaro surasidan keyin nozil bo'lgan. Demak, ikki sura bir-biriga yaqin sharoitda nozil bo'lgan. Shuning uchun ham ularning uslublarida o'xshashlik, bir-biriga yaqinlik bo'lishi turgan gap.\r\n    Boshqa makkiy suralar kabi, Naml surasining ham asosiy mavzusi aqiyda masalasidir. Surada Allohga va oxiratga iymon keltirish, faqat Yaratganning O'zigagina ibodat qilish, u dunyoda mukofot yoki jazoga yo'liqishini nazarda tutib amal qilish, vahiyga ishonish, g'aybni faqat Alloh taologina bilishiga taslim bo'lish, Allohning yaratuvchi, rizq beruvchi ekaniga iymon keltirib, Unga shukr qilish kabi masalalar yoritiladi.\r\n    Orada ushbu masalalarni chuqurroq yoritish uchun o'tgan ummatlarning qissalari ham keltiriladi. Ularda asosan mo'minlarning oqibati nima bo'lgan-u, kofirlarniki nima bo'lganiga alohida e'tibor beriladi.\r\n    Avvalo, Muso alayhissalom va Fir'avnlarning qissalari keladi. Dovud alayhissalom ham bir eslab o'tiladi, so'ngra Sulaymon alayhissalom va Saba' malikasi qissalari batafsil yoritiladi.\r\n    Keyin Solih alayhissalom va Samud qavmi qissasi keladi. Oxirida Lut alayhissalom va u kishining qavmlari haqida so'z yuritiladi. Albatta, bu qissalar suraning siyoqiga mos ravishda, yangi qirralari ko'rsatilgan holda hikoya qilinadi.\r\n    So'ngra Alloh taoloning Biru Borligiga dalil va hujjatlar, yaratgan maxluqotlaridagi ajoyib xislatlar sanaladi. Qiyomat kuni va undagi ba'zi dahshatli, qo'rqinchli manzaralar bayon etiladi.\r\n    Suraning oxirida Allohga ibodat qilishga, musulmon bo'lishga, Qur'on hidoyatida yurishga, Allohning ko'rsatgan oyat-belgilaridan ibrat olishga chaqiriladi.\r\n    O'tgan Shuaro surasida Alloh taoloning 'Robbul olamin' (Olamlarning Robbi – Tarbiyachisi) degan sifati alohida bo'rttirib ko'rsatilgan, ko'pgina oyatlar aynan o'sha sifat atrofida fikr yuritgan edi. Naml surasida esa Alloh taoloning 'olimlik' sifatiga – hamma narsani bilishiga va bu bilishining turli ko'rinishlarda zohir bo'lishiga e'tibor tortiladi."
        ]
    },
    {
        "word": "Namoz",
        "type": [],
        "definition": [
            "Namoz arabchada 'Salot' deyilib, lug'atda 'yaxshilikka duo' ma'nosini anglatadi. Shariatda esa: takbir ila boshlanib, salom berish ila tugaydigan, maxsus shartlari bor gaplar va ishlar namozdir. Isro kechasida, Payg'ambarimiz sollallohu alayhi vasallamning hijratlaridan oldinroq besh mahal namoz (bomdod, peshin, asr, shom, xufton) farz qilingan. Namoz qibla – Makkadagi Ka'baga qarab o'qiladi."
        ]
    },
    {
        "word": "Namozgoh ",
        "type": [],
        "definition": [
            "namoz o'qiladigan joy"
        ]
    },
    {
        "word": "Namozni qasr oʻqish",
        "type": [],
        "definition": [
            "Safarda to'rt rak'atli farz namozlarni ikki rak'at qilib o'qish tushuniladi."
        ]
    },
    {
        "word": "Nasibin ",
        "type": [],
        "definition": [
            "Nasibin – qadimiy shaharlardan. Hozirda Turkiyaning Suriyaga chegaradosh Mardin viloyatiga qaraydi."
        ]
    },
    {
        "word": "Nasimiddin Abu Abdulloh Muhammad ibn Saʼiyd ibn Masʼud ibn Muhammad ibn Ali Naysaburiy",
        "type": [],
        "definition": [
            "Bu zot ham ilmning turli sohalarida peshqadam olim bo'lgan. Makkai Mukarramada o'n olti yil yashagan.\r\n    U kishining mashhur kitoblari:\r\n    1. 'Sharhi Sahihul Buxoriy'.\r\n    2. 'Sharhut tanbiyh'.\r\n    3. 'Sharhu muxtasari tanbiyh'.\r\n    4. 'Sharhul asoniyd fiy rivoyatil kutubi val masoniyd'.\r\n     Yana boshqa ko'pgina kitoblarning muallifidir."
        ]
    },
    {
        "word": "Nasiya ribosi",
        "type": [],
        "definition": [
            "Qarzni ado etishni kechga surish evaziga olinadigan foyda. U oddiy qarz bo'lsa ham, sotib olingan narsaning narxi bo'lsa ham–baribir. Agar bir kilo bug'doyni qishda olib, yozda uni bir yarim kilo qilib qaytarishga kelishilsa, 'nasiya ribosi' bo'ladi."
        ]
    },
    {
        "word": "Nasr al-Anisuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Lays Nasr ibn Zohir al-Anisuniy al-Buxoriy - Anisun qishlog'idan bo'lib, Abu Abdulloh ibn Abu Hafs va Asbot ibn Yasa'dan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Nasr al-Ishtixaniy",
        "type": [],
        "definition": [
            "Abu Lays Nasr ibn Fath al-Ishtixaniy Abu Iso Muhammad ibn Iso at-Termiziydan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Nasr al-Kandasarvoniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Muhammad Nasr ibn Sobir al-Kandasarvoniy al-Buxoriy Buxoroning Kandasarvon nomli qishlog'idan. Abu Abdulloh ibn Abu Hafs va Asbot ibn Yasa'dan ta'lim olganlar."
        ]
    },
    {
        "word": "Nasr as-Sobiriy",
        "type": [],
        "definition": [
            "Abul Qosim Nasr ibn Ahmad ibn Muhammad al-Buxoriy as-Sobiriy bobolari Muhammad ibn Sobirdan ta'lim olganlar. Abul Fazl al-Osimiy va Muhammad ibn Muhammad al-Mardakiydan hadis rivoyat qilganlar. Hijriy 372 (milodiy 983) yilda vafot etganlar."
        ]
    },
    {
        "word": "Nasr as-Somoniy",
        "type": [],
        "definition": [
            "Abul Hasan Nasr ibn Ahmad as-Somoniy amir Ismoil Somoniyning akalari. Otalari Ahmad ibn Asad as-Somoniydan, Solim ibn G'olib as-Samarqandiy va Abu Abdulloh Muhammad ibn Nasr al-Marvaziydan ta'lim olganlar. O'zlaridan esa Sahl ibn Shozavayh hadis rivoyat qilganlar. Nasr ibn Ahmad as-Somoniy hijriy 279 (milodiy 893) yil jumodul oxir oyiga 7 kun qolganda, dushanba kuni shom namozidan keyin vafot etganlar. Buxoroda bu kishining qarindosh-urug'lari ko'p va mashhurdir."
        ]
    },
    {
        "word": "Nasr at-Tavziy",
        "type": [],
        "definition": [
            "Abul Lays Nasr ibn Muhammad at-Tavziy Abu Hanifa mazhabining mashhur faqihi bo'lib, munozara va jadal ilmida tengi yo'q olim edilar. Abu Ibrohim at-Termiziydan hadis rivoyat qilganlar. Samarqandda yashab, shu yerda vafot etganlar."
        ]
    },
    {
        "word": "Nasr surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 3 oyatdan iborat.\r\n    Ushbu surai karimaning nomi o'zining birinchi oyatidagi 'Izaa jaa'a nasrullohi' jumlasidan olingan. 'Nasr' – 'nusrat', 'g'alaba', 'yordam' degan ma'nolarni anglatadi. Har bir ishda Alloh taoloning nusrati bo'lmasa, bir narsaga erishib bo'lmaydi. Ayniqsa, fath kabi ulkan hodisalar faqatgina U Zotning nusrati ila bo'ladi. Ushbu surai karimada Alloh taolo Nabiy sollallohu alayhi vasallamga xitob qilib, u zotga O'zi bergan ne'matni eslatmoqda va nasr kelganda, g'alabaga erishilganda o'zni qanday tutish kerakligini o'rgatmoqda.\r\n    Musulmonlar Islom da'vatining boshlanishida oz sonli bo'lib, ko'plari kambag'allardan edi. Kofirlarning soni, mol-dunyosi, quvvati juda ko'p edi. Muhammad sollallohu alayhi vasallam va sahobalar kofirlardan ozor chekardilar, azoblanardilar. Lekin shunga qaramay, Islom oldinga qadam tashlardi. Madinada musulmonlar jamoasi paydo bo'ldi. Kofirlarning, ayniqsa, Makka mushriklarining adovati yanada kuchaydi. Bir necha urushlar bo'ldi. Atrofdagi barcha qabilalar: 'Muhammad bilan o'z qavmi – Makka mushriklari orasidagi nizo nima bilan tugar ekan, agar makkaliklar g'olib kelsa, Muhammadning payg'ambarligi rost bo'lmaydi, agar Muhammad g'olib kelsa, payg'ambarligi rost bo'ladi, iymon keltiramiz', – deb kutib turishardi. Vaqti kelib, Makka fath etilib, Nabiy sollallohu alayhi vasallam boshchiliklaridagi sahobiylar g'olib, muzaffar bo'lib, Makkaga kirib borishgandan so'ng, hamma guruh-guruh bo'lib Islomga kira boshladi. Bu surada shular haqida so'z yuritiladi."
        ]
    },
    {
        "word": "Nasroniy",
        "type": [],
        "definition": [
            "masihiy, xristian"
        ]
    },
    {
        "word": "Nass ",
        "type": [],
        "definition": [
            "ochiq hujjat. Bundan murod oyat va hadislarning zohiriy ma'nolari"
        ]
    },
    {
        "word": "Nasx ",
        "type": [],
        "definition": [
            "Islom shariatida shar'iy dalil bilan sobit bo'lgan bir hukmning o'sha dalildan keyin kelgan boshqa bir shar'iy dalil bilan kuchdan qoldirilishi va amali to'xtatilishiga 'nasx' deyiladi"
        ]
    },
    {
        "word": "Nafl ",
        "type": [],
        "definition": [
            "'Nafl' so'zi lug'atda 'ziyoda' ma'nosini anglatadi. Shariatda farz, vojib va sunnat bo'lmagan faziylatli amalni 'nafl' deyiladi."
        ]
    },
    {
        "word": "Nafl haj",
        "type": [],
        "definition": [
            "Musulmon kishining umri davomida bir martadan ortiq qilingan xaji."
        ]
    },
    {
        "word": "Naxla ",
        "type": [],
        "definition": [
            "Naxla – Makka bilan Toif o'rtasidagi joy nomi"
        ]
    },
    {
        "word": "Nahv ",
        "type": [],
        "definition": [
            "tomon, taraf; o'xshash, misol; chekka; sintaksis; arab tili grammatikasi"
        ]
    },
    {
        "word": "Nahyi munkar",
        "type": [],
        "definition": [
            "yomonliklardan qaytarish"
        ]
    },
    {
        "word": "Nahl surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 128 oyatdan iborat.\r\n    Ushbu surai karimaga qo'yilgan 'Nahl' (ya'ni 'Asalari') degan nom undagi 'Robbing asalariga vahiy yubordi: 'Tog'lardan, daraxtlardan va ko'tarilgan ishkomlardan uy tutgin' degan oyatdan olingandir.\r\n    Makkada nozil bo'lgan boshqa suralar kabi, bu surai karimaning asosiy mavzusi ham aqiyda masalasidir. Surada Allohning vahdoniyati, vahiy, qayta tirilish va qiyomat haqida alohida uslub ila so'z boradi. Shuningdek, Alloh taoloning qudratiga va vahdoniyatiga dalolat qiluvchi osmon, yer, dengiz, tog', vodiy, pasttekislik, suv, nabotot va jamodot kabi atrofimizdagi narsalarga e'tibor tortiladi. Quruqliq, suv va havodagi hayvonlar, ulardan inson uchun keladigan manfaatlar haqida batafsil so'z ketadi.\r\n    Suraning birinchi qismida vahiy to'g'risida, kofirlar uni rad va masxara qilishayotgani hamda qiyomatni inkor etishlari haqida so'zlanadi. Bu masalalar alohida muolaja qilinadi.\r\n    Shuningdek, Nahl surasida Allohning yagonaligi masalasiga ham alohida e'tibor beriladi. Allohning yagonaligiga, Uning qudratiga va har narsadan ustun ekaniga turli dalillar keltiriladi. Inson aqlini Alloh tomonga burishga harakat qilinadi.\r\n    Bu surada kufrning, noshukrchilikning oqibati yomon bo'lishi alohida ta'kidlanadi. Nabiy alayhissalomga kishilarni Allohning yo'liga sabr bilan, yaxshi mav'iza bilan da'vat qilish topshiriladi."
        ]
    },
    {
        "word": "Nahr ",
        "type": [],
        "definition": [
            "Tuya va unga o'xshash uzun bo'yinli hayvonlar o'ziga xos so'yilib, uni 'nahr' deb ataladi. Nahr ko'krakka yaqin joydan pichoq solish bilan amalga oshiriladi"
        ]
    },
    {
        "word": "Nahr kuni",
        "type": [],
        "definition": [
            "Nahr kuni – Qurbon hayiti kuni"
        ]
    },
    {
        "word": "Niboz ",
        "type": [],
        "definition": [
            "Niboz – savdo molining ustiga biror narsani tashlash orqali sotib olganini bildirish. U 'munobaza' ham deyiladi."
        ]
    },
    {
        "word": "Nizo ",
        "type": [],
        "definition": [
            "tortishuv, kelishmovchilik, bahs-munozara"
        ]
    },
    {
        "word": "Nikoh",
        "type": [],
        "definition": [
            "'Nikoh' lug'atda 'qo'shilish', 'jamlanish', 'yaqinlashish' ma'nolarini anglatadi. Shariatda esa, nikoh bir bog'lanish bo'lib, u tufayli ikki bog'lanuvchiga bir-biridan shar'iy asosda qasdan huzurlanishni halol qilishdir."
        ]
    },
    {
        "word": "Niqoya Muxtasari Viqoya",
        "type": [],
        "definition": [
            "Sodrush shariy'a Ubaydulloh ibn Mas'ud al-Buxoriyning kitobi. Kitobning qisqv nomi 'Muxtasari Viqoya' dir."
        ]
    },
    {
        "word": "Niso surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 176 oyatdan iborat\r\n    Ulamolarning ta'kidlashlaricha, bu surada 'niso' so'zining borligi va umuman, unda xotinlar to'g'risida ko'p hukmlar kelganligi uchun u shu nom bilan atalgan. Zotan, 'niso' so'zining ma'nosi 'xotinlar' demakdir. Bu sura hajm jihatidan Qur'oni Karimda ikkinchi o'rinda turadi.\r\n    Niso surasining nozil bo'lishi ham uzoq davom etgan. Uning birinchi oyatlari uchinchi hijriy sanada – Uhud jangidan keyin nozil bo'lgan bo'lsa, oxirgi oyatlari sakkizinchi hijriy sanada nozil bo'lgandir. Albatta, avvallari ta'kidlab aytilganidek, orada boshqa suralarning oyatlari ham tushib turgan.\r\n    Niso surasida yetimlarning haqlariga rioya qilish, kichik yoshdagi bolalar, zaif kishilar va ayollarning huquqlarini himoya qilish masalalariga alohida ahamiyat berilgan. Shuningdek, bu surada ayollardan jabr va zulmni ko'tarib, ularga haqiqiy insoniy munosabatda bo'lish yo'lga qo'yilgan. Oilani mustahkamlash, qarindosh-urug'chilikni joyiga qo'yishga katta e'tibor qaratilgan.\r\n    Johiliyat paytida odatdagi hol bo'lgan ishlar: birovlarning molini botil yo'l bilan yeyish, poraxo'rlik, omonatga xiyonat, kishilarning haq-huquqlarini poymol etish, nohaq odam o'ldirish kabi razolatlar muolaja qilinadi. Ularning o'rnini islomiy fazilatlar egallashi lozimligi uqdiriladi.\r\n    Surada jamiyatni fahsh, zulm va fitnadan saqlash haqida ham so'z ketadi. Meros masalasi batafsil bayon etiladi, zaiflarning haq-huquqlarini himoya qilishga targ'ib qilinadi. Shu asnoda xalqaro aloqalar haqida ham so'z yuritiladi.\r\n    Jihod paytida, urushda namozni qanday ado etishning hukmi ham shu surada kelgan. Doimo og'ir paytda pand beradigan munofiqlar haqidagi masalalar ham urush haqidagi oyatlar ichida muolaja etiladi. Yahudiylarning musulmonlar jamoasiga qarshi olib borgan ishlari haqida bahs yuritiladi. Ular munofiq va mushriklar bilan birikib olib, Islomga, musulmonlarga qarshi turli fitnalar uyushtirar edilar. Jumladan, ularning musulmonlarda Muhammad sollallohu alayhi vasallamning payg'ambarliklariga shubha uyg'otish uchun qilgan urinishlari fosh etiladi.\r\n    Shuningdek, bu surai karimada dinning ma'nosi, iymonning chegarasi, Islomning sharti va ularga taalluqli masalalar atroflicha yoritiladi. Har bir jamiyatning asosiy unsuri bo'lmish axloq haqida alohida ta'kidli bayonotlar keladi."
        ]
    },
    {
        "word": "Nisobga yetgan mol",
        "type": [],
        "definition": [
            "Zakot beradigan miqdorga yetgan mol"
        ]
    },
    {
        "word": "Nifos",
        "type": [],
        "definition": [
            "'Nifos' so'zi 'tug'ish' va 'qon' ma'nolarini anglatadi. Shariatda esa, tug'ishdan keyin ayol kishining rahmidan kelgan qonga 'nifos' deb aytiladi."
        ]
    },
    {
        "word": "Nihayatud-diroyat fiy asmai rijalil qiroat",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari"
        ]
    },
    {
        "word": "Nihayatul baroroh fiy ma zada ʼalal ʼasharoh",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Niyat ",
        "type": [],
        "definition": [
            "'Niyat' so'zi 'qasd qilish' ma'nosini bildiradi. Shariatda, qalbning Allohga qurbat hosil qilish uchun ibodatni ado etishga azmu qaror qilishi niyatdir."
        ]
    },
    {
        "word": "Noziʼot surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 46 oyatdan iborat.\r\n    Ushbu surai karimaning ismi o'zining birinchi so'zidan olingandir. 'Naazi'aat' so'zi lug'atda 'sug'urib oluvchilar' degan ma'noni bildiradi. Ushbu oyatda esa bu so'z nimani anglatishi haqida ulamolar turli bahs qilgan bo'lsalar ham, 'G'olib fikr 'Jonni sug'urib oluvchi farishtalar' degan ma'nodir', – deydilar. Binobarin, suraning keyingi to'rt oyatida ham turli ishlarni bajaruvchi farishtalar bilan qasam ichilgan.\r\n    Nozi'ot surasi makkiy suralardan bo'lib, xuddi boshqa makkiy suralar kabi aqiyda, vahdoniyat, payg'ambarlik, o'lgandan so'ng qayta tirilish va jazo masalalarini muolaja qiladi. Suraning asosiy mavzusi qiyomat va uning sifatlari, taqvodorlarning oqibati-yu, jinoyatchi kofir-osiylarning qismatidir.\r\n    Surai karima besh toifa farishtalar: kofirlarning jonini shiddat ila sug'urib oluvchilar, mo'minlarning jonini lutf bilan sug'urib oluvchilar, bulut kabi suzib yuruvchilar, yaxshilikda kimo'zarga musobaqa qiluvchilar va ishlarning tadbirini qiluvchilar bilan qasam ichish ila boshlanadi.\r\n    So'ngra mushriklar, qayta tirilish va to'planishni inkor qiluvchilar va ularning qiyomat kunidagi hollari haqida so'z yuritiladi.\r\n    Keyin esa Fir'avn qissasi keltiriladi.\r\n    So'ngra surai karima kofir va mushriklarga xitob etib, ularga tahdid qiladi.\r\n    Va, nihoyat, qiyomat kuni haqidagi oyatlar bilan suraga xotima yasaladi.\r\n    Avval aytganimizdek, bu surai karima qasam bilan boshlanadi.\r\n    Arab tilida qasam turli uslublar bilan bo'ladi: ochiq qasam ichish ma'nosidagi so'zlar bilan yoki qasam harflari, jumladan, 'vov', 'be', 'to' harflari bilan. Qur'oni Karimning bir qancha suralari qasam bilan boshlangan. Jumladan, Nozi'ot surasi ham. Bu holatda qasam lafzlari ishlatilmaydi, balki qasam harflarining o'zi kifoya qiladi. Masalan: 'Van-naazi'aati' – 'Sug'urib oluvchi bilan qasam ichaman' degani. Odatda bir gapni ta'kidlash uchun, unga e'tiborni jalb qilish uchun eng muhim masalalarni bayon qilishdan avval qasam ichiladi. Alloh taolo O'zi yaratgan narsalardan ba'zilarining nomini qasamda tilga olishi o'sha narsalarning ahamiyatini yana ham oshiradi.\r\n    Alloh taolo xohlagan narsasi bilan qasam ichaveradi, bu O'zining ishi. Lekin bandalarning Alloh taolodan boshqa bilan qasam ichishga haqqlari yo'q. Nabiy sollallohu alayhi vasallamdan vorid bo'lgan 'Kim qasam ichmoqchi bo'lsa, Allohning nomi bilan ichsin, bo'lmasa, jim tursin' degan hadisi sharif bor. Bir narsani qilaman yoki qilmayman, deb qasam ichsa, o'sha ishni bajarmog'i vojib, agar bajara olmasa, kafforot to'laydi. Yaxshisi, har narsaga Alloh taoloning nomini ishlatib, qasam ichavermaslik ma'qul."
        ]
    },
    {
        "word": "Noiha",
        "type": [],
        "definition": [
            "Biz 'aytib yig'lashni kasb qilib olgan ayol' deb nomlagan shaxs arabchada 'noiha' deyiladi."
        ]
    },
    {
        "word": "Nomai aʼmol",
        "type": [],
        "definition": [
            "amallar nomasi, daftari. Ikki farishta (Kiroman kotibayn) tomonidan har bir kishining savobli ishlari va gunohlari yozib borilgan daftar."
        ]
    },
    {
        "word": "Nomus ",
        "type": [],
        "definition": [
            "Nomus – sir sohibi, ya'ni Jabroil alayhissalom"
        ]
    },
    {
        "word": "Nosix va mansux",
        "type": [],
        "definition": [
            "bekor qiluvchi va bekor qilingan; o'chiruvchi va o'chirilgan. Avvalgi hukmning keyingisi bilan bekor qilinishi. Qur'onning ayrim oyatlarini, ba'zi hadislarni amaldan qoldirish, tatbiq etmaslik. Shu kabi oyat va hadis – “mansux”, uni bekor qiluvchi esa – “nosix” deb ataladi."
        ]
    },
    {
        "word": "Nofeʼ Madaniy qiroati",
        "type": [],
        "definition": [
            "Imom Abu Ruvaym Nofe' ibn Abdurrahmon ibn Abu Ruvaym Laysiy. U kishi hijriy 70 yili tavallud topib, 169 sanada vafot etgan.\r\n    Imom Nofe' Madaniy rahmatullohi alayhining qiroati bugungi kunda ham imom Osim qiroatidan keyingi eng ko'p tarqalgan qiroat bo'lib kelmoqda. Hozirda Libiya, Tunis, Jazoir, Mag'rib, Nigeriya, Mali va boshqa Afrika davlatlarida aynan shu qiroat keng tarqalgan.\r\n    Imom Nofe' Madaniy rahmatullohi alayhining ikki roviylari – Qolun va Varsh."
        ]
    },
    {
        "word": "Nofeʼ roziyallohu anhu",
        "type": [],
        "definition": [
            "Nofe' al-Madaniy, kunyalari Abu Abdulloh. Bu zot ulug' tobe'inlardan bo'lib, Abdulloh ibn Umarning qullari edilar.\r\n    Nofe' roziyallohu anhu taqvodor, fiqh ilmida alloma, hadis ilmida ishonchli edilar. Bu zot rivoyat qilgan hadisda xato yoki zaiflik topilmas edi.\r\n    Umar ibn Abdulaziz bu zotni sunnatni o'rgatish uchun Misrga jo'natgan edilar.\r\n    Nofe' roziyallohu anhu hijratning 119-yili Madinada vafot etdilar."
        ]
    },
    {
        "word": "Nubuvvat ",
        "type": [],
        "definition": [
            "nabiylik, payg'ambarlik, risolat; Alloh bilan bashar o'rtasida vositachilik, Allohning amri va istaklarini, risolatni insonlarga yetkazish."
        ]
    },
    {
        "word": "Nur surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 64 oyatdan iborat.\r\n    'Nur' so'zining ma'nosi ma'lum va mashhurdir. Ushbu surai karimaning nomi undagi 'Alloh osmonlar va yerning nuridir' oyatidan olingandir.\r\n    Nur Alloh taoloning go'zal ismlaridan biridir. Nur moddiy va ma'naviy bo'ladi, shu bilan birga, u Allohdandir. Zotan, har bir narsaning vujudga kelishi Allohga bog'liq. Butun borliq Alloh bor qilsa, bor bo'ladi, bor qilmasa, bo'lmaydi. Kunduzi quyoshdan nur taralishi ham Allohdan, kechaning oy nuri bilan yorug' bo'lishi ham Allohdan. Allohning Nur ekani surani o'rganish jarayonida kengroq sharhlanadi.\r\n    Bu surai karima Madinada nozil bo'lgan. Yana ham aniqroq qilib aytadigan bo'lsak, Madinai Munavvarada hijriy sananing oltinchi yilida, Nabiy sollallohu alayhi vasallam boshchiliklaridagi musulmon lashkarlar Banu Mustalaq g'azotidan qaytib kelayotganlarida nozil bo'lgan. O'sha paytda yosh Islom davlati endi qaddini tiklab, birin-ketin dushmanlarni yengib, olg'a qadam bosib bormoqda edi. Musulmonlar Badr urushida mushriklarni, Handaq urushida mushrik-yahudiy-munofiqlarning qo'shma kuchlarini mag'lubiyatga uchratgan edilar. O'n ming kishilik lashkari ila qaqshatqich mag'lubiyatga uchragan dushman guruhlari musulmonlarga qarshi turli uslublarni qo'llashga o'tdilar. Chunki ular bundan keyin musulmonlarni faqat qurol kuchi va lashkar bilan yengib bo'lmasligini tushunib qolgan edilar.\r\n    Haqiqatda, musulmonlar qurol-yarog' jihatidan juda kuchsiz edilar. Son jihatidan esa dushmanning o'ndan biriga ham teng kelmasdilar. Shuningdek, iqtisodiy tomondan ham musulmonlar juda nochor ahvolda edilar. Lekin musulmonlarning birdan-bir ustunliklari bor edi. U ham bo'lsa, iymonlari tufayli erishgan ma'naviy ustunlik edi.\r\n    Iymon tufayli musulmonlarning qalblari pok, axloqlari go'zal edi. Iymon tufayli poklangan shaxslardan pok jamiyat tuzilgan edi. Iymon tufayli musulmonlarning birligi, ichki intizomi mustahkam edi. Shuning uchun ham ular o'zlaridan ko'ra son, iqtisod, kuch-quvvat jihatlaridan bir necha o'n marta ko'p bo'lgan dushman ustidan birin-ketin g'alaba qozona boshladilar.\r\n    Nihoyat, dushman taraf ham bu sirni tushunib yetdi. Musulmonlarni zaiflashtirish uchun ularga ma'naviy zarba berishni rejalashtirdi. Buning uchun dushman ma'naviy jihatdan kuchli bo'lishga uringani yo'q. Balki musulmonlarning ma'naviyatini o'zlarinikiga o'xshatib, buzishga qasd qildi. Bu rejani amalga oshirish uchun munofiqlarni tanlashdi. Chunki munofiqlar sirtdan o'zlarini musulmon ko'rsatib, musulmonlar ichiga kirib olgan edilar. Buzg'unchilik qilish ular uchun juda ham oson edi.\r\n    Bu qabih rejani amalga oshirish beshinchi hijriy sananing zulqa'da oyida, Nabiy sollallohu alayhi vasallam Zaynab binti Jahsh onamizga uylanganlarida boshlandi. Munofiqlar 'Muhammad o'zining o'g'li Zayd ibn Horisaning xotinini yaxshi ko'rib qolib, uni taloq qildirib, o'zi uylanib oldi' degan ig'vo va bo'htonni tarqatishdi. Bu ishda ularga yahudiy va mushriklar yaqindan yordam berdilar. Orada katta fitna chiqdi.\r\n    Bu boradagi ikkinchi va eng dahshatli fitnani munofiqlar Banu Mustalaq g'azotidan keyin uyushtirishdi.\r\n    Banu Mustalaq qavmi Banu Huzofa qabilasidan bo'lib, Jidda bilan Robig' o'rtasidagi Muraysi' degan joyda yashar edi. Oltinchi hijriy sananing sha'bon oyida Rasululloh sollallohu alayhi vasallamga banu mustalaqliklar musulmonlarga qarshi urush ochish uchun kuch to'playotganining xabari keldi. Fitnani o'z o'chog'ida o'chirish uchun Rasululloh sollallohu alayhi vasallam ularning ustilariga lashkar tortib bordilar. Musulmonlar orasida munofiqlar va ularning boshliqlari Abdulloh ibn Ubay ibn Salul ham bor edi. Ushbu safarda aynan Abdulloh ibn Ubay ibn Salulning o'zi ikkita katta fitnani boshladi.\r\n    Yo'lda suv bo'yiga yetganlarida, Jahjah ibn Mas'ud va Sinon ibn Vabar Juhaniylar suv talashib qoldilar. Juhaniy o'z qavmini, ya'ni ansoriylarni, Jahjah ham o'z qavmini – muhojirlarni yordamga chaqirdi. Orada g'ala-g'ovur boshlandi. Munofiqlar boshlig'i Abdulloh ibn Ubay fursatdan foydalanib, fitna qo'zg'adi. U: 'Hali shu darajaga yetishdimi? Yurtimizga kelib joylashishdi, ko'payishdi, 'Itingni semirtirsang, o'zingni qopadi', degani shu ekan-da, Allohga qasamki, agar Madinaga qaytsak, aziz undan (Madinadan) xorni chiqaradi', – dedi ('xor' deb Rasululloh sollallohu alayhi vasallamni nazarda tutdi). Keyin atrofiga odamlarni to'plab: – 'Bunga o'zingiz sababchisiz. Ularga yurtingizdan joy ajratdingiz. Molu dunyongizni taqsimlab berdingiz. Allohga qasamki, agar ularga biror narsa bermay qo'ysangiz, boshqa yoqqa ko'chib ketadilar', – deb, ansoriy musulmonlarni muhojir musulmonlarga qarshi gij-gijlay boshladi. Bu gap Rasululloh sollallohu alayhi vasallamga yetib borganida, fitnani bostirish uchun darhol yo'lga chiqishni buyurdilar. Chunki harakatda bo'lgan odamlar gap-so'zni tez unutar edi.\r\n    Yo'lda Abdulloh ibn Ubay musulmonlarning birligini buzadigan fitnadan ham kattaroq fitnani qo'zg'adi. Qazoi hojat uchun lashkar qarorgohidan uzoqlashgan Oisha onamiz bo'yinlaridagi taqinchoqlarini tushirib qo'yadilar. Uni izlash bilan ovora bo'lib, odamlarning jo'nab ketganidan ham bexabar qoladilar. Qarorgohga qaytib kelsalar, hamma ketib bo'lgan. U kishi nima qilishlarini bilmay, bir joyda qimirlamay o'tiradilar. Oxiri o'sha joyda ko'zlari ilinadi. Keyin kimningdir ovozidan uyg'onib ketadilar. U odam sahobalardan bittasi ekan. U kishi Oisha onamizni tuyaga mindirib, yo'lga tushadi. Ikkovlari qo'shinga yetib olishganda, Abdulloh ibn Ubay boshliq munofiqlar Oisha onamizning sha'nlariga bo'hton uyushtiradilar. Fitna kattalashib ketadi. Oxiri, ushbu sura nozil bo'lib, hamma narsa o'z o'rniga tushadi.\r\n    Islom dushmanlari musulmonlar birligiga futur yetkazmoq va ularning axloqiy-ma'naviy hayotlarini buzmoq uchun harakat qildilar. Bu ikki masala nihoyatda nozik masala edi. Ayniqsa, ikkinchi masalada, xususan, Rasuli Akram sollallohu alayhi vasallamning shaxslariga, u zotning eng yaqin sohiblari Abu Bakr Siddiq roziyallohu anhu va u kishining qizlari, Nabiy sollallohu alayhi vasallamning zavjai mutohharalari Oisha onamiz shaxslariga katta bo'hton bor edi.\r\n    Nur surasi ana shunday masalalarni muolaja etish uchun nozil qilindi.\r\n    Madinada nozil bo'lgan boshqa suralar kabi, Nur surasida ham shariat ahkomlarining qat'iyligi, odob-axloq masalalariga alohida e'tibor berilgan.\r\n    Nur surasida mo'min-musulmonlarning shaxsiy va o'zaro muomalalardagi odoblari, boshqalarning turar joylariga izn so'rab kirish, ko'zni nomahramlardan tiyish, zinodan saqlanish, nomahramlarning bir-birlari bilan aralashmasligi kabi masalalar xususida ham so'z ketadi. Shuningdek, musulmon oila uchun zarur bo'lgan iffat, poklik, shariatda mustaqim bo'lish haqida gapiriladi. Ichki nizolar va axloqiy buzuqliklardan qaytariladi.\r\n    Bu surada shariatda joriy qilingan ba'zi jazolar ham zikr etiladi. Zinokorlik, birovni zinoda ayblash kabi jinoyatlarning jazosi bayon qilinadi.\r\n    Ushbu surada oila masalasiga ko'proq e'tibor berilgani uchun ham hazrati Umar ibn Xattob roziyallohu anhu Kufa ahliga yozgan maktublarida 'Ayollaringizga Nur surasini o'rgatinglar', – deganlar.\r\n    Suraning avvalida unda nimalar xususida so'z ketishi haqida qisqacha xabar beriladi. Keyin esa 'Zino nima?', 'Uning jazosi nimadan iborat?' degan savollarga javob qilinadi, zinokor bilan musulmonlar jamoasi o'rtasida hech qanday aloqa bo'lishi mumkin emasligi bayon etiladi.\r\n    So'ngra birovni zinoda ayblashning jazosi qanday bo'lishi, bundan er-xotinlar mustasno ekani, shuning uchun ularga 'mulo'ana' deb nomlangan chora qo'llanishi so'zlanadi.\r\n    So'ngra esa ifk – bo'hton hodisasi va unga aloqador masalalar keladi.\r\n    Zino va unga oid masalalar bayon qilinib bo'lgach, bu jinoyatning oldini olish uchun qanday choralar ko'rish lozimligi haqida so'z ketadi. Uy-joylardagi odob qanday bo'lishi kerak, izn so'rab kirish qanday yo'lga qo'yilishi lozim, ko'zni nomahramlardan tiyish, ziynatni nomahramlarga ko'rsatmaslik, turmush qurmaganlarni uylab qo'yish, ayol-qizlarni fahsh ishga undashdan qaytarish kabi masalalar muolaja qilinadi.\r\n    Keyin esa surada zikr etilgan odoblar Allohning nuri bilan bog'liq ekani aytilib, pok oilalarning vasfi keltiriladi. Shuningdek, kofirlarning amallari sarob ekani bayon qilinadi. Alloh taoloning nuri butun borliqni va undagi narsalarni qoplab olgani haqida so'z ketadi.\r\n    Shundan so'ng munofiqlar Nabiy sollallohu alayhi vasallamga itoat etish, u zotning hukmlari bilan ish yuritish odoblariga xilof qilganlari, mo'min-musulmonlarning esa bu xususda ixlos ila amal qilishlari bayon etiladi. Bu ixloslari uchun ularni yer yuzida xalifa qilishga, dinlariga imkon yaratishga va kofirlar ustidan nusrat berishga va'da qilinadi.\r\n    Suraning oxirlariga kelib, oila, qarindosh-urug' va yoru birodarlar orasidagi bordi-keldilar, ziyofat chog'larida o'zini qanday tutish kerakligi, musulmon jamoasining rahnamosi bo'lmish Rasululloh sollallohu alayhi vasallamga ko'rsatiladigan hurmat va odoblar bayon qilinadi.\r\n    Va, nihoyat, Alloh taolo osmonlaru yerning Moliki ekani, odamlarning voqe'ligini bilib turishi, oxir-oqibat barchaning Allohga qaytishi, hisob-kitob bo'lishi yana bir bor eslatib qo'yiladi."
        ]
    },
    {
        "word": "Nuh alayhissalom",
        "type": [],
        "definition": [
            "Nuh alayhissalom Idris alayhissalomning avlodlaridandir. U zotning otalarining ismi Lomakdir.\r\n    Imom Buxoriy Ibn Abbos roziyallohu anhudan rivoyat qilishlaricha, u kishi: 'Odam bilan Nuh orasida o'n asr (avlod) o'tgan. Hammasi Islomda bo'lgan', deganlar.\r\n    Odamlarning dindan uzoqlashishi\r\n    Alloh taolo Odam Atoni jannatdan yerga tushirgach, uning zurriyotiga baraka berdi. Ular tezda ko'payib ketdilar, kasb-kor o'rgandilar. Ular Odam Atoga kelgan dinga e'tiqod qilib, yagona Allohga ibodat qilib yashay boshladilar. Odam alayhissalom avlodlarini to qiyomatgacha xayrli ishlardan qaytarishga ont ichgan shayton bu holga toqat qila olmadi. Kishilarni shirkka chaqirish, but-sanamlarga ibodat qildirish payiga tushdi. Odam Atoning dastlabki avlodlari ichida Allohdan qo'rqadigan, taqvodor, solih kishilar bor edi. Atrofdagilar ularni yaxshi ko'rishar, hurmat qilishardi. Vaqti-soati yetib, ular olamdan o'tganlaridan so'ng shayton qolgan kishilarni: 'Agar sizlar vafot etgan solih kishilarni haqiqatda yaxshi ko'rsangiz, ularni eslab turishni xohlasangiz, suratlarini chizib qo'ying, ertayu kech ko'rib turasizlar', deya vasvasa qila boshladi. Bu gap odamlarga yoqib tushdi. Avvalboshda suratlariga qarab, ularni eslab turishdi. So'ng suratlar o'rniga haykallar qilib, ibodatxona va uylarga qo'yishdi. Ular bu haykallar hech kimga foyda ham, zarar ham keltira olmasligini yaxshi bilishsa ham, lekin solih kishilarning barakasi umidida haykallarni hurmat qilishardi. Vaqt o'tishi bilan haykallarning soni ham, ularga bo'lgan izzat-ikrom ham ortib boraverdi. Qaysi solih kishi vafot etsa, unga haykal qo'yadigan bo'lishdi.\r\n    Keyingi avlodlar odamlar o'z otalarining haykallarini ulug'layotganlarini, ularning huzurida duo qilishayotganini ko'rib voyaga yetdilar. Oxir-oqibatda kishilar haykallarga sajda qiladigan, ulardan yordam so'raydigan va ularga qurbonlik ataydigan bo'lib qolishdi. Shunday qilib haykallar butu sanamlarga aylandi. Odamlar ularni iloh darajasiga ko'tarib, e'tiqod bilan ibodat qila boshladilar.\r\n    Yaratgan Xoliqni qo'yib, toshdan, loydan, yog'ochdan bo'lgan haykallarga sig'inish katta xato va zulm, Alloh taoloning g'azabini keltiradigan ulkan gunoh edi.\r\n    Yangi payg'ambarlar yuborish zarurati\r\n    Ana shunda Alloh taolo adashgan bandalariga rahm qilib, ularga to'g'ri yo'lni ko'rsatishi uchun payg'ambar yuborishni iroda qildi.\r\n    Parvardigor bu payg'ambar odamlarning o'zlaridan bo'lishini xohladi, chunki payg'ambar Alloh taoloning farmonlarini kishilarga yetkazish bilan birga, o'z hayotiga tatbiq qilib, o'rnak bo'lishi ham zarur edi. Agar payg'ambar farishta bo'lsa, odamlar: 'Bu farishta. Uning bizdan ustunligi bor. Shuning uchun farmonlarni bajarishi ham oson, biz esa bajara olmaymiz', deya bahona qilishlari mumkin edi. Shuning uchun Alloh taolo odamlarga o'zlaridan chiqqan, o'zlariga o'xshash bir odam payg'ambar bo'lsa, bunday bahonani pesh qila olmaydilar, degan hikmat bilan shunday iroda qildi.\r\n    Shis va Idris alayhissalomlar nabiy sifatida o'z qavmlarining xatolarini tuzatishga, to'g'ri yo'lga boshlashga harakat qildilar, ammo ulardan keyin ahvol yanada og'irlashdi. Alloh taolo yana yangi payg'ambar yuborishni iroda qildi.\r\n    Nuh alayhissalomning yuborilishlari\r\n    O'sha zamonda yashagan kishilar ichida boylar, zodagonlar ko'p bo'lishiga qaramasdan, Alloh taolo Nuh alayhissalomni payg'ambar qilib tanladi. Nuh olijanob, solih, aqlli, halim, to'g'riso'z, omonatli, mehribon odam edi.\r\n    Alloh taolo u zotga vahiy yuborib, qavmini dinga chaqirishga buyurdi. Nuh alayhissalom 'Men sizga payg'ambar bo'ldim', deb qavmiga murojaat qilganlarida, ba'zilar: 'Bu qachondan beri payg'ambar bo'lib qolibdi? Kechagina biz bilan yurgan edi-ku!' deyishdi.\r\n    Mutakabbir boylar esa: 'Alloh shu qashshoqdan boshqani topa olmabdi-da, nima, boshqalar o'lgan ekanmi?' deyishdi.\r\n    Yana boshqa birovlar: 'Nuh shu yo'l bilan obro' topmoqchi, boshliq bo'lmoqchi', deyishdi.\r\n    Shunday qilib Nuh alayhissalom o'z qavmini iymonga chorladi. But-sanamlarni tark etib, Allohga ibodat qilishga da'vat eta boshladi.\r\n    Bu holatni Alloh taolo Nuh surasida quyidagicha bayon etadi:\r\n    'Biz Nuhni 'Qavmingni ularga alamli azob kelishidan avval ogohlantir', deb o'z qavmiga rasul qilib yubordik' (1-oyat).\r\n    Nuh alayhissalom Iroqning janubida, hozirgi Kufa shahri joylashgan hudud atrofida yashagan aholiga payg'ambar qilib yuborilganlar.\r\n    Nuh alayhissalom 'rasullarning shayxi' deb ham ataladilar, chunki u zot besh 'ulul azm' ('sabot-matonatli') payg'ambarlardan biridirlar.\r\n    Nuh alayhissalomning da'vatlari\r\n    Nuh alayhissalom amri ilohiyni bajarishga, o'z qavmlarini Alloh taoloning diniga da'vat qilishga kirishdilar. U zot qavmlarini Allohning diniga da'vat qilishda barcha imkoniyatlarni ishga soldilar.\r\n    Avval maxfiy, keyinroq oshkora, oxirida ham oshkora, ham maxfiy da'vat qildilar. Shu bilan birga, ularni qiziqtirish uchun dindorlikdan bu dunyoning o'zidayoq keladigan foydalarni ham zikr qildilar. Ammo sarkash qavm o'z payg'ambarining da'vatini qabul qilmadi, turli nobakorliklarda davom etdi.\r\n    Nuh alayhissalomning hasratlari\r\n    Shunda Nuh alayhissalom o'z ishlarini, dardu hasratlarini to'kib soldilar.\r\n    Alloh taolo Nuh surasida marhamat qiladi:\r\n    'Nuh dedi: 'Robbim, ular menga isyon qildilar va moli, bola-chaqasi ziyondan boshqani ziyoda qilmaganga ergashdilar va nihoyatda katta makr qildilar. Ular: 'Ilohlaringizni hech tark qilmanglar va Vaddni ham, Suvo'ni ham, Yag'usni ham, Yauqni ham, Nasrni ham tark qilmang', dedilar' (21–23-oyatlar).\r\n    Rivoyatlarda kelishicha, Vadd, Suvo', Yag'us, Yauq va Nasrlar solih, taqvodor kishilar bo'lishgan. Odamlar ularni nihoyatda yaxshi ko'rib, hurmat qilishgan. Vaqti-soati yetib, ular vafot etib ketishgach, odamlar shayton vasvasasiga uchib, ularning suratlarini chizishgan, so'ng haykallarini yasab olishgan. Ular ziyorat qilingan va asta-sekin ularga dardu hasratlar aytiladigan bo'lgan. Oqibatda vaqt o'tib ularga iloh deb qaralgan va ibodat qilingan.\r\n    Nuh alayhissalomning duolari\r\n    Umid uzilgandan keyin Nuh alayhissalom o'zlarining mashhur duolarini qildilar:\r\n    'Darhaqiqat, ular ko'plarni adashtirdilar. Sen zolimlarga zalolatdan boshqani ziyoda qilma' (Nuh surasi, 24-oyat).\r\n    Nuh alayhissalomning duolari qabul bo'ldi. Alloh taolo kofirlarni bitta ham qo'ymay halok qildi, chunki ular insoniyat badaniga tushgan qorason kasali kabi ediki, ularni kesib tashlamasa bo'lmasdi.\r\n    Sarkash qavm ila tortishuv\r\n    Mazkur holat Nuh alayhissalomning sarkash qavmga qilgan da'vatlarining sodda bir ko'rinishi, xolos. Aslida u zot uzoq vaqt turli sharoitlarda da'vat olib borganlar.\r\n    Bu haqda imom Jaloliddin Suyutiy 'Ad-Durrul mansur fit-tafsir bil ma'sur' kitobida Ibn Abbos roziyallohu anhudan quyidagilarni rivoyat qiladilar:\r\n    'Alloh taolo Nuh alayhissalomni qirq yoshida payg'ambar qilib yubordi. U o'z qavmini ellik yil kam ming yil Allohga da'vat qildi. U to'fondan keyin oltmish yil yashadi. Odamlar ko'payib, keng dunyo torlik qildi'.\r\n    Bir odamning ming yildan ortiq hayot kechirgani ko'plarga g'alati tuyulishi mumkin. Lekin bu inkor qilib bo'lmaydigan haqiqatdir. Qur'oni Karimda kelgan xabarni inkor qilgan odam kofir bo'ladi. Ayni choqda, bu hol aql tarozisida tortsa bo'ladigan oddiy bir ish. Qadimgi kishilar uzoq umr kechirgani hammaga ma'lum. Buning ustiga, oz sonli jonzotlarning umri uzun, adadi ko'plarniki qisqa bo'lishi ham tajribada ko'rilgan. Nuh alayhissalom insoniyat to'fon tufayli qirilib ketgan bir davrda yashaganlari e'tiborga olinsa, bunday uzoq umr ko'rish oddiy bir hol ekani bilinadi.\r\n    Nuh alayhissalom turli yo'llar bilan to'qqiz yuz ellik yil da'vat qilsalar ham, ozgina qavmdan boshqalar iymonga kelmadi. Bunday holda ko'plar sinovga dosh bera olmay, qaytib ketishi ham mumkin. Ammo haqiqiy iymon sohiblari o'z iymonlaridan qaytmaydilar. Nuh alayhissalomning davrlarida ham shunday bo'ldi. Nuh alayhissalom va u zotga iymon keltirganlar iymonlarida sobit qoldilar.\r\n    Oxirgi duoyi bad\r\n    Kofirlar esa shuncha yillar o'tsa ham, iymonga kelishmadi. Ularning iymonga kelishlariga hech qanday umid ham qolmadi.\r\n    Nuh alayhissalom qavmining o'taketgan sarkashligi, zalolatga mahkam yopishib olgani hamda ularga va'z-nasihat ta'sir qilmasligini anglab yetgach, Alloh taologa nido qildilar:\r\n    'Robbim! Qavmim meni yolg'onchiga chiqarishdi. O'zing men bilan ularning oramizni yaxshilab ochgin va menga hamda men bilan birga bo'lgan mo'minlarga najot bergin' (Shuaro surasi, 117–118-oyatlar).\r\n    Kema yasashga amr bo'ldi\r\n    Alloh taolo Nuh alayhissalomning duolarini qabul qildi.\r\n    '...va Nuhga vahiy qildikki: 'Qavmingdan iymon keltirganlardan boshqa hech kim iymon keltirmas va ularning qilmishlaridan qayg'uga tushmagin. Bizning rioyatimiz va vahiyimiz ila kema yasagin hamda zulm qilganlar to'g'risida Menga gap ochmagin, albatta, ular g'arq qilinuvchilardir' (Hud surasi, 36–37-oyatlar).\r\n    Nuh alayhissalom Alloh taoloning amriga binoan ulkan kema yasadilar.\r\n    To'fon yaqinlashdi\r\n    Mana, o'sha va'da qilingan vaqt ham keldi:\r\n    'Nihoyat, amrimiz kelib, tannur favvora otganda, 'Unga (kemaga) har bir (tur)dan bir juftdan va avval u haqda so'z ketgan kimsadan boshqa ahlingni va iymon keltirganlarni ham ol', dedik. U bilan birga iymon keltirganlar juda oz edi' (Hud surasi, 40-oyat).\r\n    To'fon dahshatli tus olib kelardi. Nuh alayhissalom va sheriklari najot kemasiga minganlaridan so'ng kema ularni tog'lardek bo'lib mavj urayotgan to'lqinlar ustida olib keta boshladi.\r\n    Allohning azobi kelgandan keyin kofirlarning birortasini hech kim, hech narsa qutqara olmadi. Faqat Alloh O'zi rahm qilgan bandalarini najot kemasida qutqarib qoldi.\r\n    Vaqti-soati yetib, to'fon tinchidi. Dunyoni sukunat chulg'adi.\r\n    Tarixchilarning ta'kidlashlaricha, najot kemasida Nuh alayhissalom bilan birga sakson kishi o'z oilalari bilan bo'lgan. Ular kemada bir yuz ellik kun qolganlar.\r\n    Nuh alayhissalom mustaqil shariat ila kelgan birinchi rasul-payg'ambar bo'ldilar.\r\n    Nuh alayhissalom shirkdan ogohlantirgan birinchi payg'ambar bo'ldilar.\r\n    Nuh alayhissalom 'payg'ambarlarning shayxi' nomini oldilar.\r\n    Nuh alayhissalom eng ko'p umr ko'rgan inson va payg'ambardirlar.\r\n    Tarixchilarning ta'kidlashlaricha, u zot Makkai mukarramada Masjidul Haromning yaqiniga dafn qilinganlar.\r\n    Nuh alayhissalomning o'g'illaridan biri bo'lmish Som va uning farzandlari Arabiston yarimoroli tomonga yurdilar. Homning o'g'illari janub tarafga – Iroq tomon yurdilar va o'sha yerlarning atroflariga joylashdilar. Nuh alayhissalomning Yofas ismli o'g'illari va uning zurriyoti sharq tomonga, bir qismi esa g'arb tomonga harakatlanishdi. Boshqalar esa turli taraflarga tarqalib ketdi."
        ]
    },
    {
        "word": "Nuh al-Qassor al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Hotam Nuh ibn Ayyub al-Qassor al-Buxoriy Buxoro ahlidan bo'lib, Hafs ibn Dovud ar-Rabi'iy, Abdurahmon ibn Muhammad, Ishoq ibn Hamza, Valid ibn Ismoil va Sa'id ibn Janohdan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar. Hijriy 293 (milodiy 907) yilda vafot etganlar."
        ]
    },
    {
        "word": "Nuh al-Ushmiyuniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ahmad Nuh ibn Mansur al-Ushmiyuniy al-Buxoriy - Ushmiyun qishlog'idan. Makkiy ibn Ibrohim, Ibrohim ibn Sulaymon az-Ziyotdan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdurahmon Abdulloh ibn Muhammad al-Buxoriy hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Nuh ibn Asad ",
        "type": [],
        "definition": [
            "Abu Muhammad Nuh ibn Asad ibn Somon hijriy 225 (milodiy 841) yilda Isbijobni (Isfijob, Sharqdagi katta shahar) fath qilganlar. Hijriy 227 (milodiy 843) yilda vafot etganlar."
        ]
    },
    {
        "word": "Nuh surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 28 oyatdan iborat.\r\n    Ushbu surada Nuh alayhissalomning ismlari va qissalari kelgani uchun, u Nuh surasi deb atalgan.\r\n    Makkada nozil bo'lgan boshqa suralar kabi Nuh surasi ham aqiydaning aslini muolaja qilib, iymon asoslarini yoritadi. Unda mashhur payg'ambarlardan Nuh alayhissalomning o'z qavmlariga qarata qilgan da'vatlarining boshlanishidan to to'fon hodisasigacha bo'lgan qissalari bayon qilinadi. Surai karima Alloh taoloning amriga yurmaganlarning, payg'ambarlarga ergashganlar va qarshi chiqqanlarning oqibatlari nima bo'lishini bayon qiladi.\r\n    Sura Nuh alayhissalomning payg'ambar etib yuborilishi, kishilarni dinga da'vat qilishlari va qavmlariga Alloh taoloning azobi haqida qo'rqinchli xabar berishga taklif etilishlari bilan boshlanadi.\r\n    Surada Nuh alayhissalomning urinishlari, sabrlari va din yo'lidagi fidokorliklari zikr etiladi. U kishi o'z qavmlarini kechayu kunduz, maxfiy va oshkora da'vat qildilar. Qavmlari esa borgan sari bu da'vatga qarshi chiqish, isyon ko'tarishga tayyorgarlik ko'rib boraverdi.\r\n    Surada o'sha noshukr qavmga Alloh taoloning bergan ne'atlarini va fazlini eslatish ham bor bo'lib, bundan bandalar Alloh taoloning qudrati va rahmatini sezsinlar va toatni yaxshilasinlar, degan maqsad ko'zda tutiladi.\r\n    Shuncha va'z-nasihat, eslatishlarga qaramay, qavm kufrda, zalolatda va sarkashlikda umr kechiraverdi. Nuh alayhissalomning da'vatlarini qabul qilmadi. Oqibatda Alloh taolo ularni to'fon balosi bilan halok etdi.\r\n    Suraning tafsirini boshlashdan avval Nuh alayhissalomning qissalari bilan qisqacha tanishib chiqsak.\r\n    \r\n    NUH ALAYHISSALOM QISSASI\r\n    \r\n    Alloh taolo Otamiz Odam alayhissalomni jannatdan yerga tushirgach, uning zurriyotiga baraka berdi. Ular tezda ko'payib ketdilar, kasbu kor o'rgandilar. Ular Otamiz Odam alayhissalomga kelgan dinga e'tiqod qilib, yagona Allohga ibodat qilishar edi. Odam avlodini xayrli ishlardan qaytarishga ont ichgan shayton bu holga toqat qila olmadi. Kishilarni shirkka chaqirishga, butu sanamlarga ibodat qildirishga urina boshladi. Otamiz Odam alayhissalomning dastlabki avlodlari ichida Allohdan qo'rqadigan, taqvodor, solih kishilar bor edi. Ularni atrofidagilar yaxshi ko'rishar, hurmat qilishardi. Vaqti-soati yetib, ular olamdan o'tganlaridan so'ng, shayton qolgan kishilar orasida vasvasa qilib: 'Agar sizlar vafot etgan solih kishilaringizni haqiqatan yaxshi ko'rsalaringiz va eslab turishni xohlasalaringiz, suratlarini chizib qo'ying, ertayu kech nazar solib turasizlar', – dedi. Bu gap odamlarga yoqib tushdi. Avval boshda suratga qarab, ularni eslab turishdi, so'ngra suratlar o'rniga haykallar qilib, ibodatxona va uylarga qo'yishdi. Ular bu haykallar hech kimga foyda ham, zarar ham keltira olmasligini yaxshi bilishardi. Lekin solih kishilarning barakasi deb haykallarni hurmat qilishardi. Vaqt o'tishi bilan haykallarning soni ham, izzat-ikromi ham ortib boraverdi. Qaysi solih kishi vafot etsa, unga haykal qo'yadigan bo'lishdi.\r\n    Keyingi avlodlar otalarining o'z haykallarini ulug'layotganini, ularning huzurida duo qilishayotganini ko'rib, voyaga yetdi. Oxir-oqibatda kishilar haykallarga sajda qiladigan, ulardan yordam so'raydigan va ularga qurbonlik ataydigan bo'lib qolishdi. Shunday qilib, haykallar butu sanamlarga aylandi. Odamlar ularni xudo darajasiga ko'tarib, ularga e'tiqod bilan ibodat qila boshladilar.\r\n    Yaratgan Xoliqni qo'yib, toshdan, loydan, yog'ochdan bo'lgan haykallarga sig'inish katta xato va zulm edi. Allohning g'azabini keltiradigan ulkan gunoh edi. Ana shunda Alloh adashgan bandalariga rahm qilib, ularga to'g'ri yo'lni ko'rsatish uchun payg'ambar yuborishni iroda qildi. Alloh taolo bu payg'ambar odamlarning o'zlaridan bo'lishini xohladi. Chunki payg'ambar Alloh taoloning farmonlarini kishilarga yetkazish bilan birga, o'z hayotiga tatbiq qilib, o'rnak bo'lishi ham zarur edi. Agar payg'ambar farishta bo'lsa, odamlar 'Bu – farishta, bizdan ustunligi bor, shuning uchun farmonlarni bajarishi ham oson, biz esa bajara olmaymiz', deya bahona qilishlari mumkin edi. Shuning uchun Alloh taolo odamlarga o'zlaridan chiqqan, o'zlariga o'xshash bir odam payg'ambar bo'lsa, bunday bahonani pesh qila olmaydilar, degan maqsadda shunday iroda qildi.\r\n    O'sha zamonu makonda yashagan kishilar ichida boy, zodagonlari ko'p bo'lishiga qaramasdan, Alloh taolo Nuh alayhissalomni payg'ambar qilib tanladi. Nuh karamli, solih, aqlli, halim, to'g'riso'z, omonatli, mehribon inson edi.\r\n    Alloh taolo u kishiga vahiy yuborib, o'z qavmini dinga chaqirishni buyurdi. Nuh alayhissalom o'z qavmlariga 'Men sizga payg'ambar bo'ldim', deb murojaat qilganlarida, ba'zilar: 'Bu qachondan beri payg'ambar bo'lib qolibdi? Kechagina biz bilan yurgan edi-ku', – deyishdi.\r\n    Mutakabbir boylar esa: 'Alloh qashshoqdan boshqani topa olmabdi-da, nima, boshqalar o'lib bitgan ekanmi?' – deyishdi.\r\n    Boshqa birovlar esa: 'Nuh shu yo'l bilan obro' topmoqchi, boshliq bo'lmoqchi', – dedilar.\r\n    Shunday qilib, Nuh alayhissalom o'z qavmlarini iymonga chorladilar, sanamlarni tark etib, Allohga ibodat qilishga da'vat eta boshladilar. Lekin faqat sanoqli kishilargina iymonga keldilar, xolos. Bu mo'minlar halol kasblari bilan hayot kechiruvchi kishilar edilar. Boylar esa: 'Yalangoyoq, miskinlarga oshno bo'lmaymiz', – deyishdi.\r\n    Nuh alayhissalom o'z qavmlarini turli yo'llar bilan dinga chaqirdilar. Bu holat shu tariqa to'qqiz yuz ellik yil davom etdi. Oxiri Allohdan 'Sening qavmingdan hozirgi mo'minlardan boshqasi iymonga kelmaydi', degan xabar keldi. Shunday bo'lsa ham, Nuh alayhissalom yana bir marta da'vat qildilar. Sarkash qavm esa: 'Biz bilan ko'p tortishding, gaping rost bo'lsa, va'da qilayotgan azobni keltir', – dedi. Nuh alayhissalomning umidlari uzildi, g'azablari keldi va: 'Ey Robbim, yer yuzida kofirlardan birortasini qo'ymagin', – deb duo qildilar.\r\n    Alloh taolo bu duoni qabul qildi. Nuh alayhissalom va u kishiga ergashgan mo'minlarga najot berib, qolganlarini g'arq qilishni iroda qildi va Nuh alayhissalomga katta kema qurishni buyurdi. Ul zot ish boshladilar. Buni ko'rgan qavmlari: 'Hoy Nuh, qachondan beri duradgor bo'lib qolding? Senga 'Anavi yalangoyoqlar bilan yurmagin', demaganmidik? Bu kemang qayerga boradi, sahrogami yoki toqqami?' – deb masxara qildilar.\r\n    Nuh alayhissalom sabr-bardosh bilan ishlarini davom ettiraverdilar. Gohida ularga qarab: 'Sizlar bizni masxara qilayotgan bo'lsalaringiz, biz ham bir payt kelib, xuddi sizga o'xshab, sizlarni masxara qilamiz', – deb qo'yardilar.\r\n    Alloh taoloning va'dasi amalga oshdi. Tinimsiz yomg'ir quya boshladi. Suv yig'indilari ko'payib bordi. Alloh taolo Nuh alayhissalomga: 'O'zing bilan mo'minlarni, ahlingni va barcha hayvonlardan bir juftdan olib, kemaga chiq', – deb buyurdi. Chunki to'fon ommaviy bo'lib, undan na inson va na hayvon qutula olar edi. Nuh alayhissalom Alloh taoloning aytganini qildilar. Shu bilan birga, kofirlar safidagi o'g'illarini ahlimdan, deb o'ylab, kemaga olmoqchi bo'ldilar. Lekin Alloh taolo 'Bu sening ahlingdan emas', deb, olishga ruxsat bermadi. U farzand ham kofirlar bilan birga halok bo'ldi. Iymoni bo'lmagach, payg'ambarning o'g'li bo'lgani ham foyda bermadi.\r\n    Dunyoni to'fon bosib, hamma kofirlar halok bo'lganidan so'ng, Nuh alayhissalomning kemasi tog'da to'xtadi. Hozirda o'sha kema qoldiqlari fazo kemalari yordamida topilgan. Nuh alayhissalom va mo'minlar sog'-salomat holda yerga tushib, hayotlarini davom ettirdilar. Alloh taolo ularning zurriyotlariga baraka berdi. Ular ko'payib, unib-o'sdilar, ichlaridan payg'ambarlar chiqdi.\r\n    Aziz kitobxon! Sizga tafsir qilinajak oyatlar tushunarli bo'lishi uchun Nuh alayhissalom qissasidan baholi qudrat hikoya qildik. Endi Alloh taoloning irodasi bilan surani tafsir qilishga kirishsak."
        ]
    },
    {
        "word": "Nuʼaym ibn Hammor",
        "type": [],
        "definition": [
            "Nu'aym ibn Hammor G'atafoniy ash-Shomiy hadislarini Rasululloh sollallohu alayhi vasallamdan va Uqba ibn Omir al-Juhaniydan rivoyat qildilar. Bu zotdan Abu Idris Xuvloniy, Qays al-Juzomiy, Kusayr ibn Murra al-Hazramiy, Qatodalar rivoyat qildilar. Bu kishi rivoyat qilgan hadislarni uchta sahih sohiblari o'z kitoblariga kiritganlar."
        ]
    },
    {
        "word": "Noʻʼmon ibn Bashir",
        "type": [],
        "definition": [
            "U kishining to'liq ismlari No''mon ibn Bashir ibn Sa'd ibn Salaba ibn Xallos al-Ansoriy al-Xazrajiydir.\r\n    U kishining onalari Amro binti Ravoha roziyallohu anho bo'lib, u kishi ulug' sahobiy Abdulloh ibn Ravoha roziyallohu anhuning singillari edilar.\r\n    No''mon ibn Bashir Payg'ambarimiz sollallohu alayhi vasallamning hijratlaridan o'n to'rt oy o'tgandan keyin tavallud topgan bo'lib, hijratdan so'ng ansoriylar orasida birinchi tug'ilgan chaqaloq hisoblanadi. U kishining o'zlari ham, ota-onalari ham sahobiy bo'lganlar.\r\n    U kishi Abdulloh ibn Zubayr roziyallohu anhu tomonidan Himsga omil etib tayinlanganlar. 65-hijriy sanada o'sha yerda Xolid ibn Xuliy al-Kulo'iy ismli kishi tomonidan qatl etilganlar. Alloh u kishidan rozi bo'lsin."
        ]
    },
    {
        "word": "Noʻʼmon ibn Bashir",
        "type": [],
        "definition": [
            "Hijratning 2-yili Madinada tavallud topdilar. U kishi hijratdan keyingi birinchi tug'ilgan bola edilar. Usmon ibn Affon roziyallohu anhu o'ldirilganlarida u zotning ko'ylaklari qonga belanadi. Shunda Usmon ibn Affon roziyallohu anhuning xotinlari Noila bu ko'ylakni No''mon ibn Bashirga berib, Muoviyaga olib borishni buyuradilar. No''mon ibn Bashir ko'ylakni Shomga olib borib, Muoviyaga topshiradilar, so'ngra Siffiyn urushida Muoviya bilan qatnashadilar.\r\n    No''mon ibn Bashir roziyallohu anhu Damashqda qozilik qildilar, keyinchalik Yaman, Kufa, Hims shaharlarida amir bo'ldilar. Bu zot hammasi bo'lib Rasululloh sollallohu alayhi vasallamdan 124ta hadis rivoyat qildilar.\r\n    Bu zotdan Sha'biy, Hamid ibn Abdurrahmon, Samok ibn Harb, Solim ibn Abu Ja'd, shuningdek, o'g'illari Muhammad va Bashir kabi ko'plab roviylar hadis rivoyat qilganlar.\r\n     No''mon ibn Bashir hijratning 65-yili 'Marju Rohit' voqeasida o'ldirildilar."
        ]
    }
]