[
    {
        "word": "Obid ",
        "type": [],
        "definition": [
            "ibodat qiluvchi inson"
        ]
    },
    {
        "word": "Ogʻir najosat",
        "type": [],
        "definition": [
            "Najasligi qat'iy dalil bilan sobit bo'lgan narsa 'og'ir najosat' hisoblanadi. Bunga oqqan qon, go'shtini yeb bo'lmaydiganlarning tezagi va siydigi, agar taom yemaydigan darajada kichik bo'lsa ham, aroq, havoda tezak tashlamaydigan uy o'rdagi va g'ozi hamda tovuqqa o'xshash parrandalarning tezagi, o'limtikning go'shti va terisi, itning tezagi, yirtqichlarning tezagi va so'lagi, og'izni to'ldirib chiqqan qayt, odamdan chiqib toharatni sindiradigan narsalar kiradi."
        ]
    },
    {
        "word": "Odam alayhissalom",
        "type": [],
        "definition": [
            "Birinchi inson Odam alayhissalomdir. Shuningdek, Odam alayhissalom nabiylarning ham birinchisi hisoblanadi. Alloh subhanahu va taolo O'zining hikmati ila yer yuzida insonni yaratib, O'ziga o'rinbosar qilishni iroda etdi. Shu bilan birga, ana shu O'zi yaratgan o'rinbosariga yer yuzidagi barcha narsalar va imkoniyatlarni beminnat xizmat qildirib qo'yishni ham iroda etdi. Allohning alohida lutfi ila va barcha imtiyozlarga ega qilib yaratilgan ana shu jonzot Odam deb ataldi.\r\n    Alloh subhanahu va taolo Odamni tuproqdan yaratdi. So'ng unga O'z ruhidan, ya'ni O'zi yaratgan ruhdan jon pufladi. Odamga O'zi bu dunyoda yaratib qo'ygan har bir narsaning nomini o'rgatdi, farishtalarni unga sajda-ta'zim qilishga amr etdi. Odamga sajda qilishdan bosh tortgan, Allohning amriga bo'ysunmagan iblisni esa la'natlab, O'z huzuridan quvdi.\r\n    Bu haqda Alloh subhanahu va taolo quyidagi oyatni nozil etib, shunday bayon qilgan:\r\n    'Esla, Robbing farishtalarga: 'Men yer yuzida xalifa qilmoqchiman', dedi. Ular: 'Unda buzg'unchilik qiladigan, qon to'kadigan kimsani (xalifa) qilasanmi? Holbuki, biz Seni hamding ila poklab yod etib va Seni muqaddaslab turibmiz', dedilar. (U Zot) 'Men siz bilmaydigan narsani bilaman', dedi' (Baqara surasi, 30-oyat).\r\n    Ushbu oyatdan ma'lum bo'lyaptiki, Alloh taolo Odamni O'zining yer yuzidagi o'rinbosari – xalifasi bo'lishini iroda etgan ekan. Demak, insonga ulkan ishonch bildirilgan, u ulug' Allohning xalifasi bo'lishdek oliy maqomga loyiq ko'rilgan. Bunday marhamatning o'ziga yarasha buyuk mas'uliyati ham bor. Inson shuni anglagan holda, uni xalifa qilib qo'ygan Zotning buyurganlarini bajarmog'i, yaratgan Zot munosib ko'rgan oliy maqomga dog' tushirmaslikka harakat qilmog'i kerak.\r\n    Farishtalarning 'Unda buzg'unchilik qiladigan, qon to'kadigan kimsani (xalifa) qilasanmi?' degan gaplaridan bilinadiki, ular o'zlarigagina ma'lum yo'l bilan insonning yer yuzida fasod, buzg'unchilik qilishi va qon to'kishini, ayni choqda, ular farishtalik tabiati bilan o'zlari aytib turgan tasbehu hamdlarni va qilib turgan ulug'lashlarni ushbu maxluqotlarning yaratilish maqsadi deb bilganlar. Ammo Allohning ilmi boshqa, farishtalar buni bilmaydilar. Shuning uchun ham Alloh taolo: 'Men siz bilmaydigan narsani bilaman', dedi. Ya'ni odamlardan ba'zilarining buzg'unchilik qilishi yoki qon to'kishi yer yuzida xalifa yaratish irodasiga to'siq bo'la olmaydi. Shuningdek, farishtalarning tasbeh va hamd aytib, Allohni hamisha ulug'lab turishlari ham U Zotni ulardan boshqa mavjudotni yaratishdan to'sa olmaydi.\r\n    '...va Odamga ismlarning barchasini o'rgatdi, so'ngra ularni farishtalarga ko'rsatib: 'Agar rostgo'ylardan bo'lsangiz, manavilarning ismlarini menga aytib bering chi', dedi' (31-oyat).\r\n    Alloh taolo Odamni O'zining yer yuzidagi xalifasi qilayotgan paytda unga ulug' bir sirni bergani ushbu oyatdan bilinib turibdi. U ham bo'lsa Odamga ismlarning barchasini o'rgatishidir. Ya'ni inson o'zini o'rab turgan barcha ashyolarning belgisi sifatida ismni, ma'noni ishlatadi. His qilinadigan, jismga ega bo'lgan narsalarni fahmlash uchun nutqiy ramzlarni ishlatish qudrati inson hayotidagi eng ulug' qudratlardan biri hisoblanadi. Aks holda, birovga tog'ni tushuntirmoqchi bo'lsangiz, uni tog'ning oldiga olib borib aylantirib ko'rsatishdan o'zga chora bo'lmas edi. Agar Alloh taolo insonga ushbu qobiliyatni bermaganida, yer yuzida hayotni tasavvur qilish ancha qiyin bo'lardi.\r\n    Rivoyatlarda kelishicha, 'Buning ismi ot, bunisi tuya, mana bu quyosh, bu esa yulduz', deb hatto kichkina narsalargacha o'rgatilgan. Ya'ni Odamning yer yuzida xalifa bo'lishining asosiy sabablaridan biri ilm olishga iste'dodining borligidir. Hozirda insonning ilm yordamida borliqning sirlarini kashf etayotgani ham o'shanda berilgan qobiliyat natijasidir.\r\n    Alloh taolo Odamga ismlarning barchasini o'rgatganidan keyin ularni farishtalarga ro'baro' qildi va: 'Agar 'Unda buzg'unchilik qiladigan, qon to'kadigan kimsani (xalifa) qilasanmi?' degan da'volaringiz rost bo'lsa, Menga ushbu narsalarning ismlarini aytib beringlar', dedi. Farishtalar u narsalarga ism qo'yishdan ojiz qoldilar va o'z ojizliklarini tan olib:\r\n    'O'zing poksan! Bizda Sen bildirgandan boshqa ilm yo'q. Albatta, Sen O'zing biluvchisan, hakimsan', dedilar' (32-oyat).\r\n    Farishtalar shu o'rinda yuksak odob misolini ko'rsatdilar. Bilmagan narsalarini so'zsiz 'Bilmaymiz' deb aytdilar. Bilmagan narsasini tan olib, vaqtida 'Bilmayman' deyish ham katta odob, ham katta ilm hisoblanadi.\r\n    Shunda Alloh taolo O'zining yer yuzidagi xalifasi – Odamning ustunligini namoyon etish uchun:\r\n    'Ey Odam, ularga bularning ismlarini aytib ber', dedi. Ularga o'shalarning ismlarini aytib bergan chog'ida: 'Sizlarga osmonlaru yerning g'aybini bilaman va sizlar oshkor qiladigan narsalarni ham, berkitgan narsalarni ham bilaman, demabmidim?' dedi' (33-oyat).\r\n    Shu bilan Odamning farishtalardan ustunlik tarafi namoyon bo'ldi. U ham bo'lsa, ilm-ma'rifat edi. Inson yer yuzida buzg'unchilik qilishi va qon to'kishi ham mumkin, ilohiy ne'mat bo'lmish ilmni o'z o'rnida ishlatib, farishtalardan ustun bo'lishi ham mumkin.\r\n    So'ng Alloh subhanahu va taolo Odam Atoning cHar qovurg'asidan u zot alayhissalom uchun jufti halol – Momo Havvoni yaratdi. Ularga jannatdan joy ato etib, unda farog'atda yashashlarini ta'minladi. Ular jannatda ma'lum bir muddat yashadilar.\r\n    Alloh taolo ularga jannatdagi hamma mevalarni tanovul qilishga ruxsat berib, faqat bittagina daraxt mevasini (sinov uchun) man qildi.\r\n    Odamni va uning zurriyotlarini to qiyomatgacha ig'voga solishni, to'g'ri yo'ldan adashtirishni va'da qilgan la'nati iblis Odam Ato va Momo Havvoni tinmay ig'vo qilib, ularni man qilingan daraxt mevasidan yeyishga olib keldi. Ushbu hodisadan keyin Odam alayhissalom bilan Momo Havvo Allohga tavba qildilar. Alloh tavbalarini qabul qildi va ularni yer yuziga tushirdi.\r\n    Jabroil alayhissalom Odam alayhissalomga yer yuzida yashash, hayot kechirish, mehnat qilish, jumladan, dehqonchilik, ziroat ishlari, ekin-tikinlarni sug'orish kabi ishlarni o'rgatdi. Odam alayhissalom o'z juftlari bilan ekin ekib, ziroatchilik bilan shug'ullandilar. O'z hayotlari uchun zarur bo'lgan mahsulotlarni yetishtirib, hosil olib, kun kechirdilar. Alloh subhanahu va taolo Odam Ato va Momo Havvoga farzandlar ato etdi.\r\n    Tarixchilar Odam Ato va Momo Havvo yer yuzining qaysi hududiga tushganlari to'g'risida ixtilof qiladilar. Bu borada turli-tuman va juda ko'p gaplar aytilgan. Odam Ato va Momo Havvo Arabiston yarimoroliga tushirilgan, degan fikr egalari ko'pchilikni tashkil etadi. Yana Hindistondagi tog' yaqiniga tushirilgan, deganlar ham bor.\r\n    Yaratilishining ilk davridan boshlab inson o'zining komil va go'zal suratida bo'lgan. Ba'zi dinsizlar aytganidek, avval sodda jonzot bo'lib, so'ng maymunga va nihoyat odamga aylanmagan. Balki Alloh taolo uni eng go'zal suratda, eng chiroyli xilqatda yaratgan. Bu haqiqatni Alloh taolo Qur'oni Karimda alohida ta'kidlab, Tiyn surasida shunday marhamat qiladi:\r\n    'Biz insonni eng go'zal tuzilishda yaratdik' (4-oyat).\r\n    Alloh taolo insonni ham jismonan, ham aqlan, ham ruhan eng yaxshi holatda yaratgani hammaga ma'lum.\r\n    Shundan so'ng insoniyat tarixidagi eng mashhur, olamshumul voqealardan biri – Qobil va Hobil voqeasi ro'y berdi. Bu voqea yer yuzida sodir etilgan eng birinchi gunoh, eng birinchi jinoyat sifatida eslanadi.\r\n    Qobil va Hobil Odam alayhissalomning to'ng'ich farzandlaridan edi. O'sha vaqtdagi sodda hayotga moslangan sodda sharoitda farzandlar (ilohiy hikmatga ko'ra juft holda) bir o'g'il, bir qiz bo'lib tug'ilar edi. Keyingi farzandlar ham xuddi shunday – bir o'g'il, bir qiz tug'ilgan. Ular voyaga yetgan paytda yer yuzida ulardan boshqa odam bo'lmagani sababli, Alloh taoloning O'zi joriy qilgan shariat qoidasiga ko'ra, birinchi tug'ilishdagi o'g'il ikkinchi tug'ilishdagi qizga uylanishi, ikkinchi juftlik ham xuddi shunday almashib turmush qurishi yo'lga qo'yilgan. Bu faqat o'sha ilk davrga xos ruxsat bo'lgan. Alloh taolo boshqa inson zoti yo'q ilk davrdayoq insonlarning ko'payishini shu tarzda iroda etgan. Buning uchun esa oila qurib yashashni hayotning bosh qonuni qilib qo'ygan.\r\n    Tarixchilar Qobilning to'ng'ich farzand bo'lgani, u yuqoridagi qonuniyatga zid ravishda o'zi bilan birga tug'ilgan singlisiga uylanishni xohlagani, shunda Hobil unga qarshilik qilgani va shu tariqa ularning orasida nizo paydo bo'lganini ta'kidlaydilar. Shundan so'ng Qobil va Hobil Alloh subhanahu va taolo uchun qurbonlik qilishadi. Hobil qo'chqor qurbonlik qiladi va Alloh taolo uni qabul etadi. Qobilning qilgan qurbonligi esa qabul bo'lmaydi. Shunda Qobil hasad qilib, Hobilni o'ldirib qo'yadi. Mana shu bashariyat yer yuzida sodir etgan birinchi jinoyat hisoblanadi.\r\n    Alloh taolo Moida surasida marhamat qiladi:\r\n    'Ularga Odamning ikki o'g'li xabarini haq ila tilovat qilib ber. O'shanda ikkovlari qurbonlik qilganlarida, birlaridan qabul qilindi, boshqasidan qabul qilinmadi. 'Men seni o'ldirajakman', dedi. (Narigisi) dedi: 'Alloh taqvodorlardangina qabul qiladi. Agar meni o'ldirish uchun qo'l ko'tarsang ham, men seni o'ldirish uchun qo'l ko'tarmayman. Men olamlarning Robbi Allohdan qo'rqaman. Mening gunohimni ham, o'zingning gunohingni ham olib ketib, shu sababdan do'zax ahlidan bo'lishingni xohlayman. Ana o'sha zolimlarning jazosidir'. Nafsi unga birodarini o'ldirishni yaxshi ko'rsatdi. Bas, uni o'ldirdi. Shu sababdan ziyon ko'ruvchilardan bo'ldi' (27–30-oyatlar).\r\n    Qur'oni Karimda Odam Atoning vafotlari haqida gap yo'q. Bu haqda tarixchilar o'z mulohaza va ilmiy izlanishlarining natijalarini quyidagicha bayon qiladilar.\r\n    Odam Ato, bir rivoyatga ko'ra, ming yil yashab, so'ng vafot etganlar va imom Tabariy, Ibn Asir, Ya'qubiy va boshqa olimlarning rivoyatlariga ko'ra, Makkai mukarramadagi Abu Qubays tog'i yoniga dafn qilinganlar. Odam alayhissalomni yuvish, kafanlash, janozalarini o'qish, qabrlarini qazish va dafn qilish ishlarini farishtalar amalga oshirganlar.\r\n    Ba'zilar u zotning Hindistondagi bir tog' yaqiniga dafn qilinganlarini aytishadi."
        ]
    },
    {
        "word": "Odam ibn Iyos",
        "type": [],
        "definition": [
            "Odam ibn Iyos – imom Buxoriy rahmatullohi alayhning shayxi"
        ]
    },
    {
        "word": "Odoblar xaziynasi",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining qalamlariga mansub 'Odoblar xaziynasi' deb nomlangan kitobi.\r\n    Ushbu kitob Imom Buxoriyning ikkinchi bosh asarlari bo'lmish 'Al-adab Al-Mufrad' kitoblariga Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining qilgan sharhlaridir.\r\n    Imom Buxoriy bu kitobda odob-ahloq masalalariga oid hadislarni saralab keltirganlar. 'Odoblar xaziynasi' to'rt jilddan iborat bo'lib, e'tiboringizga uning birinchi jildini xavola etmoqdamiz. Birinchi jild Imom Buxoriyning siyratlari xaqidagi ma'lumot bilan boshlanib, so'ngra odob-ahloqqa oid 306 ta hadis sharhi keltiriladi.\r\n    Muallif: Shayx Muhammad Sodiq Muhammad Yusuf\r\n    Nomi: Odoblar xaziynasi\r\n    Hajmi: 496 bet\r\n    O'lchami: 84×108\/32\r\n    O'zbekiston Respublikasi Vazirlar Mahkamasi huzuridagi Din ishlari bo'yicha qo'mitaning 439 -sonli tavsiyasi ila chop etilgan"
        ]
    },
    {
        "word": "Odobul alloma",
        "type": [],
        "definition": [
            "Shayx Azududdin Iyjiy rahmatullohi alayhining kitobi. Bu kitobni ba'zi olimlar sharh qilganlar."
        ]
    },
    {
        "word": "Oisha bint Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qizlari"
        ]
    },
    {
        "word": "Oisha roziyallohu anho",
        "type": [],
        "definition": [
            "Hazrati Oisha binti Abu Bakr Siddiq roziyallohu anho hijratdan sakkiz yil avval tug'ilganlar. Bu zot Rasulullohning eng yaqin sahobalari, xulofai roshidinlardan biri Abu Bakr Siddiq roziyallohu anhuning qizlari, Payg'ambarimiz Muhammad sollallohu alayhi vasallamning zavjai mutahharalaridir. Onalari Ummu Rummon Zaynab binti Omir edi. Bu kishi hijratning oltinchi yili vafot etganlar.\r\n    Hazrati Oisha onamizning laqablari Siddiyqa va unvonlari Ummul muminindir. Juda kichiklik paytlaridayoq o'n sakkiz kishidan so'ng Islomni qabul qilganlar, hijratdan ikki yil avval Makkada Rasulullohga nikohlanganlar.\r\n    Hazrati Oisha tafsir, hadis, fiqhdan, arab tarixi va adabiyotidan yaxshi voqif edilar. U kishi zamonalarining ulug' donishmandlaridan bo'lib, hatto hazrati Abu Bakr, Umar, Usmon davr¬larida taniqli sahobalar va olimlarga dars, fatvo beradigan darajada yuksak salohiyat va iqtidor sohibasi edilar. Uyda va safarlarda doimo Payg'ambar alayhissalom bilan birga bo'lganliklari uchun ashobi kiromdan ko'pchilikka nasib etmagan diyniy ahkomlardan voqif bo'lganliklari sababli eng yetakchi sahobalar ham hal eta olmagan diyniy masalalarni hazrati Oishadan so'rardilar.\r\n    Oisha onamiz Rasuli akramdan 2210ta hadis rivoyat qilganlar va bu sohada Abu Hurayradan so'ng turadilar. Hazrati Oishadan sahoba va tobe'inlardan ko'plari hadis naql etishgan. Ahmad ibn Hanbalning 'Musnad'larida bunday hadislardan 2258 sahifa to'plangan.\r\n    Hazrati Oisha Payg'ambarimiz sollallohu alayhi vasallam bilan sakkiz yilu besh oy birga yashadilar. O'n sakkiz yoshlarida Payg'ambarimiz vafot etdilar. Oisha onamiz oltmish besh yil yashadilar va hijratning 58-yilida Madinada vafot topdilar.\r\n    Oisha onamizda ko'pgina nodir fazilatlar to'plangan edi. U kishi juda aqlli va zehnlari o'tkir, ilmli ayol edilar. Oisha onamiz tilni, she'rni, tib fanini, nasablar va urush tarixlarini yaxshi bilar edilar.\r\n    Zuhriy Oisha onamiz haqlarida aytadilarki, 'Agar Rasulullohning barcha ayollarining ilmini va jamiki ayollarning ilmini to'plab turib, Oishaning ilmiga solishtirilsa, albatta, Oishaning ilmi afzaldir'.\r\n    Oisha onamizning ilmlari to'g'risida Urva: 'Tib fanida, she'riyatda va fiqh ilmida Oishadan ilm¬liroq biror kishini ko'rmadim', dedilar.\r\n    Hazrati Oisha otalari Abu Bakr Siddiqdan, Umar va Sa'd ibn Abi Vaqqos, Usayd ibn Huzayr va boshqalardan ham rivoyat qildilar. Ammo Oisha roziyallohu anhodan aksar sahobalar ko'plab hadislar rivoyat qildilar. Shulardan: Abu Hurayra, Abu Muso Ash'ariy, Zayd ibn Xolid al-Juhaliy va Sofiya binti Shayba roziyallohu anhumlarni zikr qilishimiz mumkin. Oisha onamizdan tobe'iynlardan bo'lgan ikki yuzga yaqin kishi hadis rivoyat qilgan. Ular orasida Sa'iyd ibn Musayyib, Alqama ibn Qays, Masruq ibn al-Ajda', Oisha binti Talha, Amra binti Abdurahmon, Hamsa binti Siyrin va boshqalar bor.\r\n    Oisha onamiz ahyonda yolg'iz o'zlari ba'zi bir masalalarni hal etar edilar va o'zlariga xos bo'lgan ijtihod qilar edilar. Gohida u kishi ulamo sahobalar bilmay qolgan masalalarni ham hal etar edilar. Hatto Zarkashiy shu ma'noda kitob yozib, uni 'Oishaning sahobalar bilmaganini idrok etgan javoblari' deb nomlagan. Abu Muso roziyallohu anhu:\r\n    'Biz, Allohning Rasulining sahobalari, bilmaganlarimizni doimo Oishadan topar edik', deganlar.\r\n    Masruq roziyallohu anhu: 'Katta shayx sahobalarning Oishadan farzlar haqida so'rayotganlarini ko'rdim', dedilar.\r\n    Hazrati Oishaning yoshligidan kamoliga qadar butun hayoti makorimi axloqning jonli namunasi bo'lmish Rasuli akramning zavjiyatida o'tdi. Oisha onamizning axloqi yuksak, nihoyatda taqvodor va qanoatli ayol edilar. Payg'ambar alay¬hissalomning har bir amrlariga itoat etar, u kishini xushnud etmoqni o'zlarining eng buyuk vazifalari deb bilar edilar."
        ]
    },
    {
        "word": "Oq boʻlish",
        "type": [],
        "definition": [
            "'Oq bo'lish' iborasi arab tilida 'kesish', 'uzish' degan ma'noni bildiradi, shar'iy iste'molda esa ota onaga aziyat berish, ma'siyat bo'lmagan ishlarda ularga itoatsizlik qilish, ularni g'azablantirish, norozi qilish, ulardan aloqani uzishga aytiladi. Binobarin, uni qandaydir qarg'ishga qolish, biror kasallikka giriftor bo'lish ma'nosida tushunmaslik kerak."
        ]
    },
    {
        "word": "Oqila ",
        "type": [],
        "definition": [
            "'Oqila' so'zi aql masdaridan olingan bo'lib lug'atda 'man' qilish' ma'nosini bildiradi. Aql ham insonni zararli narsalardan man' qilib turgani uchun aql–man' nomi bilan atalgan. Diyani ham aql deyiladi. Chunki, diya odamning qonini to'kishni man' qiluvchi omildir. Oqila diya beruvchi kishilar jamoasidir."
        ]
    },
    {
        "word": "Oli ",
        "type": [],
        "definition": [
            "'Oli' so'zi aslida ahli oila degan ma'noni bildiradi. Ammo bu so'z oyat-hadislarda ishlatilganda ko'zda tutilgan oilaga tegishli mo'minlarnigina anglatib keladi. Binobarin, 'Oli Imron', 'Oli Ibrohim', 'Oli Muhammad' deyilganda ushbu avlodlar ichidagi mo'minlar nazarda tutilgan bo'ladi."
        ]
    },
    {
        "word": "Oli Imron surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 200 oyatdan iborat.\r\n    \r\n    Oli Imron surasi Madinada nozil bo'lgan uzun suralardan biri bo'lib, asosan diniy ishlardan ikki muhim masalani muolaja qiladi:\r\n    Birinchisi – aqiyda masalasi bo'lib, Allohning yagonaligiga hujjat va dalillar keltiriladi.\r\n    Ikkinchisi – shariat qonunlari masalasi, xususan, urush va Allohning yo'lida jihod qilishning qonunlari haqida so'z yuritiladi.\r\n    Birinchi masala bo'yicha Alloh taoloning yagonaligini va payg'ambarlikning haqligini, Qur'onning haqligini isbot qiluvchi oyatlar kelgan. Shuningdek, ahli kitoblar Islom, Qur'on va Muhammad alayhissalom haqlarida tarqatgan shubhalarga raddiyalar berilgan.\r\n    Oli Imron surasida asosan ahli kitoblarning nasoro toifasi haqida so'z yuritiladi. Ularning Masih alayhissalom haqlarida, u kishini iloh deb gumon qilishlari va shuning oqibatida Muhammad alayhissalomni yolg'onchiga chiqarib, Qur'onni inkor qilishlari haqida so'z boradi. Surai karimaning deyarli yarmi shular haqidagi oyatlardan iboratdir. O'sha oyatlarda nasorolar qo'zg'agan shubhalarga, xususan, Bibi Maryam va u kishining o'g'illari Iyso alayhissalom haqlaridagi shubhalarga ochiq-oydin hujjat va dalillar bilan raddiyalar keladi. Mazkur dalil va hujjatlarni keltirish jarayonida yahudiylarga nisbatan ba'zi ishora va kinoyalar ham qilib o'tiladi. Musulmonlarni ahli kitobning makr va hiylalaridan hushyor bo'lishga chaqiriladi.\r\n    Ikkinchi masala bo'yicha haj ibodatiga, jihodga, riboga va zakotni man qiluvchilarga xos hukmlar zikr qilinadi. Badr, Uhud kabi g'azotlar haqida batafsil so'z yuritilib, ulardan olingan ibratlar bayon etiladi. Musulmonlar Badr g'azotida kofirlar ustidan g'olib keldilar, ammo Nabiy alayhissalomga bo'ysunmasdan, Uhud g'azotida mag'lubiyatga uchradilar va ta'nalar eshitdilar. Oli Imron surasida ana shu darsning hikmatlari ochiladi. Alloh taolo mo'min-musulmonlarning safini qalbi buzuqlardan tozalashni iroda etganligi bayon qilinadi.\r\n    Shuningdek, surai karimada nifoq va munofiqlar haqida batafsil so'z yuritiladi, ularning Islomga hamda musulmonlarga zarar yetkazish uchun qanday urinishlari bayon qilinadi.\r\n    Suraning oxirlarida osmonlaru yerning yaratilishidagi ajoyibotlarni tafakkur va tadabbur qilib ko'rishga chaqiriladi. Pirovardida esa jihod va mujohidlar haqida so'z ketadi.\r\n    Imom Muslim Navos ibn Sam'on roziyallohu anhudan rivoyat qiladilarki, u kishi:\r\n    'Payg'ambar alayhissolatu vassalomning 'Qiyomat kuni Qur'on va unga amal qilgan ahllari keltirilganida, Baqara va Oli Imron suralari bosh bo'lib keladilar', deganlarini eshitdim', – dedilar.\r\n    Ushbu surai karimaning Oli Imron degan nom olishining sababi – sura ichida Bibi Maryamning otalari Imron va u kishining sharafli oilalari – Oli Imron qissasining kelganligidir."
        ]
    },
    {
        "word": "Oliy sanad",
        "type": [],
        "definition": [
            "oz roviylar bilan eng yuqori tabaqaga yetgan silsila"
        ]
    },
    {
        "word": "Olti kitob",
        "type": [],
        "definition": [
            "mashhur olti muhaddislarning kitoblari. Ularning ikkitasi sahih, to'rttasi sunan kitoblari"
        ]
    },
    {
        "word": "Omil ",
        "type": [],
        "definition": [
            "'Omil' sultonning xaroj, zakot, sadaqa yig'ish uchun tayin qilgan xizmatchisi"
        ]
    },
    {
        "word": "Omir al-Fallos al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Solih Omir ibn Fazl al-Fallos al-Buxoriy Buxoro ahlidan bo'lib, Ishoq ibn Hamza, Muhammad ibn Husaynning ikki o'g'illari Ibrohim va Umar hamda Muhammad ibn Horun al-Fallos al-Bag'dodiydan hadis rivoyat qilganlar. Yuz ming hadisni yoddan bilar edilar."
        ]
    },
    {
        "word": "Omir al-Hamadoniy al-Arbinjaniy",
        "type": [],
        "definition": [
            "Abu Muslim Omir ibn Muqotil al-Hamadoniy al-Arbinjaniy Abu Salama Yahyo ibn al-Mug'ira, Hoshim ibn Qosim al-Harroniy, Horun ibn Muso al-Faraviy va Salama ibn Shubaybdan hadis rivoyat qilganlar. U zotdan Muhammad ibn Ahmad az-Zahabiy, Abdurahmon ibn Fath, Muhammad ibn Zakariyo an-Nasafiy hadis rivoyat qilganlar. Omir al-Arbinjaniy fozil, to'g'ri rivoyat qiluvchi, ko'p hadis yod olgan kishi bo'lganlar. Hijriy 293 (milodiy 907) yilda vafot etganlar."
        ]
    },
    {
        "word": "Omir ash-Shaʼbiy",
        "type": [],
        "definition": [
            "Omir ibn ash-Sha'biy – ulug' tobe'in, olim, taqvodor, haliym, ziyrak, serharakat, yodlash qobiliyati o'tkir kishilardan edilar. Rivoyat qilgan hadislari kishilar orasida ishonchli deb tan olingan. Bu kishining yodlash qobiliyatlari nihoyatda kuchli bo'lgani uchun tillarda doston edi.\r\n    Omir roziyallohu anhudan rivoyat qilinadi:\r\n    'Biror narsani qoradan oqqa ko'chirgan bo'lsam, yoki biror so'z eshitgan bo'lsam, hammasini yodlab borardim'.\r\n    Ash'as ibn Sivodan rivoyat qilinadi:\r\n    'Omir ash-Sha'biy o'z zamonasida ilmda, halimlikda tengi yo'q bo'lgan'.\r\n    Ulug' zotlardan Makhul:\r\n    'Omir ash-Sha'biydan faqihroq odamni uchratmadim', deb aytadilar.\r\n    Omir ash-Sha'biy hijratning 19-yili Hamadonda tug'ilib, hijratning 103-yili Kufada vafot etdilar.\r\n    Bu zot hadislarni Ali, Sa'd ibn Abu Vaqqos, Sa'iyd ibn Zayd, Zayd ibn Sobit, Abu Hurayra, Mug'iyra ibn Shu'ba, Muoviya va boshqa sahoba va tobe'in roziyallohu anhulardan rivoyat qildilar.\r\n    Bu kishidan Abu Ishoq, Sa'iyd ibn Amr, Ismoil ibn Abu Xolid, Husayn ibn Abdurrahmon, Sa'iyd ibn Masruq as-Savriy, Salama ibn Kuhayl va boshqa katta hadis olimlari rivoyat qilganlar."
        ]
    },
    {
        "word": "Orif",
        "type": [],
        "definition": [
            "biluvchi, tanuvchi (Allohni tanuvchi)"
        ]
    },
    {
        "word": "Oriya ",
        "type": [],
        "definition": [
            "'Oriya'–lug'atda 'ketib keldi' deganidir. Shariatda esa: Nafni evazsiz mulk qilib berishdir. Oriyada narsani vaqtincha foydalanish uchun beriladi. Misol uchun, boy odam kambag'al kishiga: 'Ushbu daraxtni senga bir yilga oriyatga – vaqtinchalik foydalanib turishga berdim', deydi. Oriyat muomalasi savobli ish hisoblanadi."
        ]
    },
    {
        "word": "Osiy ",
        "type": [],
        "definition": [
            "syon qiluvchi, itoatsiz, gunohkor. Allohning buyruqlari, Payg'ambar alayhissalomning sunnatlariga rioya qilmaydigan, shar'an taqiqlangan ishlarga qo'l uradigan shaxs."
        ]
    },
    {
        "word": "Osim Kufiy qiroati",
        "type": [],
        "definition": [
            "Imom Osim ibn Abu Najud Kufiy. Imom Osimning kunyasi Abu Bakr.\r\n    Imom Osim ibn Abu Najud hijriy 127 sanada Kufada vafot etgan.\r\n    U kishining ikki roviylari – Hafs va Shu'ba.\r\n    Aynan imom Osimdan Hafs rivoyat qilgan qiroat hozirgi kunda butun olam bo'ylab tarqagan. Bizning diyorimizda ham qadimdan shu qiroat joriy bo'lgan. Bizning qiroat imomimiz imom Osim, roviyimiz Hafsdir."
        ]
    },
    {
        "word": "Oxirat",
        "type": [],
        "definition": [
            "so'ng, nihoya, tamom bo'lish; narigi dunyo; oxirgi kun. Odam vafot etgandan keyin boradigan dunyo, olam; dunyoning tugashi."
        ]
    },
    {
        "word": "Ohod ",
        "type": [],
        "definition": [
            "'Ohod'. Bu so'z lug'atda 'ozchilik kishilar' ma'nosini bildiradi. Ulamolar istilohida esa, birinchi uch asrda roviylarining soni mutavotir darajasiga yetmagan hadisga aytiladi. Ohod hadis bilan sobit bo'lgan hukmga amal qilish vojibdir. Unga amal qilmagan odam tarki vojib ila gunohkor bo'ladi.\r\n    Shu bilan birga ulamolar ohod hadisda kelgan hukmga amal qilish uchun ba'zi shartlar ham qo'yganlar. Jumladan, Hanafiy mazhabi ulamolari ohod hadisga amal qilish uchun uchta shart qo'yganlar.\r\n    1) O'sha ohod hadisni rivoyat qilgan shaxs unga xilof ish qilmasligi kerak. Agar roviy bir hadisni rivoyat qilsa-yu, unga amal qilmasa, uning rivoyatiga emas, amaliga ergashiladi. Zero roviy o'z rivoyatiga uning mansux bo'lganini (amaldan qolganini) bilgani uchungina amal qilmasligi mumkin. Shuning uchun hanafiylar Abu Hurayra roziyallohu anhu rivoyat qilgan 'It yalagan idishni yyetti marta yuvish' haqidagi hadisga amal qilishmagan, chunki Abu Hurayra roziyallohu anhuning o'zlari bunday idishni uch marta yuvganlar. Ulamolar ana shunga amal qilishni tanlaganlar.\r\n    2) Ohod hadisda kelgan narsa ko'p takrorlanmaydigan, ko'pchilik ko'z o'ngida sodir bo'lmaydigan bo'lishi kerak. Shuning uchun ham hanafiylar namozda Ruku'ga ketishdan oldin ikki qo'lni ko'tarish haqidagi hadisga amal qilmaganlar. Bu ish aslida ko'p takrorlanadigan, ko'pchilikdan yashirin qolishi mumkin bo'lmagan narsa. Chunki namoz ko'p o'qilgan, namozning hamma amallari mutavotir hadislar bilan sobit bo'lgan. Ruku'ga ketishdan oldin ikki qo'lni ko'tarish haqidagi hadis ohod bo'lib qolishining o'zi shubha tug'diradi. Agar bu amal boshqa amallar darajasida bo'lganida, mutavotir hadis bilan sobit bo'lar edi.\r\n    3) Ohod hadisda kelgan narsa shariatning asosiga xilof bo'lmasligi kerak. Bunga Abu Hurayra roziyallohu anhu rivoyat qilgan, birovning sersut qo'yini sog'ib ichib turgan odam sut evaziga bir so' miqdorda xurmo beradi, degan hadis misol bo'ladi. Vaholanki, shariat qoidasi bo'yicha, bir narsaning evaziga uning o'ziga o'xshash narsa qaytariladi.\r\n    Qolaversa, Abu Hurayra roziyallohu anhu rivoyat qilgan bu hadis nasx qilingan bo'lishi ham mumkin."
        ]
    },
    {
        "word": "Oyat",
        "type": [],
        "definition": [
            "ilohiy mo''jiza, belgi; Qur'on suralarining tarkibiy qismi"
        ]
    }
]