[
    {
        "word": "Qabziyat ",
        "type": [],
        "definition": [
            "ich ketishi, qorin og'rishi"
        ]
    },
    {
        "word": "Qabih ",
        "type": [],
        "definition": [
            "jirkanch, yaramas; dag'al; qo'pol; axloqsiz; insoniylik me'yorlariga zid; razil"
        ]
    },
    {
        "word": "Qabo ",
        "type": [],
        "definition": [
            "Qabo - oldi ochiq, uzun, jangda kiyiladigan, ko'ylaksimon xipcha ustki kiyim. Bizdagi rumcha to'nga o'xshaydi."
        ]
    },
    {
        "word": "Qavm ",
        "type": [],
        "definition": [
            "jamoa, urug', qabila"
        ]
    },
    {
        "word": "Qadar ",
        "type": [],
        "definition": [
            "peshonaga bitilgan narsa, Almiysoqda hukm qilingan ishlar"
        ]
    },
    {
        "word": "Qadariya",
        "type": [],
        "definition": [
            "qazoi qadarni inkor qiladiganlar"
        ]
    },
    {
        "word": "Qadr surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 5 oyatdan iborat.\r\n     Ushbu surai karimaning nomi ham o'zining birinchi oyatidagi 'Qadr' kalimasidan olingan, to'g'rirog'i, 'Laylatul Qadr' – 'Qadr kechasi'dan olingan. Bu muborak kecha 'Qadr' deb atalishining ikki xil ma'nosi bor. Birinchisi 'qadr', ya'ni qadri ulug', ikkinchisi 'qadar', ya'ni bandalarning qadarini belgilashdir. Chunki Qadr kechasi qadri ulug' kechadir. Qadr kechasi bandalarning bir yillik qadarlari – taqdirlari belgilanadigan kechadir. Ushbu surai karima boshidan oxirigacha muborak Qadr kechasiga bag'ishlangandir.\r\n    Barcha xalqlarda o'tgan ulug' kishilari, mashhur kunlari, dasturlari yoki boshqa munosabatlarini bayram qilish odat tusiga kirgan. Ular bu bayramlarda yeb-ichish, o'ynab-kulish, aroqxo'rlik, turli fisqu fujurni xohlaganicha qilishga qulay fursat topadilar.\r\n    Islomda esa bayram o'ziga xos bo'ladi. Ilohiy dastur bayrami bo'lmish 'Laylatul Qadr' kechasi shulardan biridir. Chunki xuddi shu kechada Qur'oni Karimning nozil bo'lishi boshlangan. Bu bayramda qalbni poklash, vijdonni sayqallash uchun ibodat qiladilar. Alloh taologa yaqinlik hosil qilish uchun bu kecha bedor bo'lib, tunni ibodat bilan o'tkaziladi.\r\n    Qadr surasida Alloh taolo musulmonlarga O'zi bergan ulkan ne'matni, ularni zulmatdan nurga olib chiqqan Qur'oni Karimni nozil qilganini eslatadi."
        ]
    },
    {
        "word": "Qazaʼ ",
        "type": [],
        "definition": [
            "Qaza' – sochning bir qismini oldirib, bir qismini qoldirish. Bu asosan bolalarda qilingan. Bu ish g'ayridinlarning odati bo'lgani va xilqatni o'zgartirishga o'xshagani uchun undan qaytarilgan"
        ]
    },
    {
        "word": "Qazo ",
        "type": [],
        "definition": [
            "Qilinishi lozim narsani belgilangan vaqtidan keyin qilishni 'qazo' deyiladi"
        ]
    },
    {
        "word": "Qazoi qadar",
        "type": [],
        "definition": [
            "peshanaga yozilgan narsaning ijro etilishi"
        ]
    },
    {
        "word": "Qazf ",
        "type": [],
        "definition": [
            "'Qazf' so'zi lug'atda qattiq jismni otishga, masalan, tosh otishga nisbatan ishlatiladi. Shariatda esa, birovni zinoda ayblashga 'qazf' deyiladi. Ya'ni, iffatli kishiga 'zino qildi' degan bo'hton toshini otishdir."
        ]
    },
    {
        "word": "Qaulula",
        "type": [],
        "definition": [
            "Qaulula – tush paytida mizg'ib olish."
        ]
    },
    {
        "word": "Qays al-Vanufogʻiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Amr Qays ibn Anif al-Vanufog'iy al-Buxoriy Bu kishi Qutayba ibn Sa'id, Mahmud ibn G'iylon, Ali ibn Hajar al-Marvaziy, Suvayd ibn Nasr al-Marvaziy va Muhammad ibn Vosil al-Marvaziydan hadis rivoyat qilganlar. O'zlaridan esa Abu Nasr ibn Sahl al-Buxoriy hadis rivoyat qilganlar. Hijriy 288 (milodiy 902) yilning zulhijja oyida haj qilgandan keyin Makkai Mukarramada vafot etganlar."
        ]
    },
    {
        "word": "Qays ibn Osim",
        "type": [],
        "definition": [
            "Qays ibn Osim ibn Sinon Munqiriy at-Tamimiy. Kunyalari Abu Ali, arablarning tadbirli amirlaridan, shijoat va halimlik bilan tanilgan, johiliyatda shoir va sayyidlik bilan mashhur bo'lgan sahobalardan edilar.\r\n    Bu sahoba aroq ichishni Islomga kirishdan oldin ham o'zlariga harom qilgan edilar. Hijratning 9-sanasida Tamim qabilasi tomonidan Rasululloh sollallohu alayhi vasallamga elchi bo'lib kelib, ana shu yili Islomga kirdilar.\r\n    Rasululloh sollallohu alayhi vasallam bu zotni qavmlaridan sadaqalarni yig'ish uchun mas'ul etib tayinladilar.\r\n    Bu zot Rasululloh sollallohu alayhi vasallamdan ko'p hadislar rivoyat qildilar. U kishidan Hasan, Ahnaf, Xulayfa ibn Husayn, o'g'illari Hakim ibn Qays va boshqalar rivoyat qilganlar.\r\n    Qays ibn Osimning 33 nafar farzandlari bor edi. Vafot etishlaridan oldin ularni chaqirib:\r\n    'Ey bolalarim, mening vasiyatimni eshitinglar. Chunki mendan boshqa kishi sizlarga nasihat qilmaydi. Mollaringizni tadbir bilan ishlating, bunday qilishlaringiz saxiy bo'lish uchun ogoh etadi va malomatdan saqlaydi. Odamlardan narsa so'rashdan saqlaninglar, chunki kishining oxirgi kasbi so'rashdir'.\r\n    Bu zot hayotlarining oxirida Basrada istiqomat qildilar. Hijratning 20-sanasida (milodiy 640 yilda) ana shu yerda vafot etdilar."
        ]
    },
    {
        "word": "Qalam surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 52 oyatdan iborat.\r\n    Ushbu suraning nomi uning birinchi oyatidagi 'qalam' so'zidan olingan. Alloh taolo unda qalam bilan qasam ichgan.\r\n    Qalam surasi ham aqiyda va iymon aslini o'z ichiga oluvchi makkiy suralardan bo'lib, uch asosiy mavzuni yoritadi:\r\n    1. Payg'ambarlik masalasi va Makka kofirlarining Muhammad sollallohu alayhi vasallamning da'vatlariga shubha bilan qarashlari.\r\n    2. Bog' egalarining qissasi. Bu qissadan murod kufrning natijasini kishilarga anglatish, oxiratda Alloh taolo musulmonlar va gunohkorlar uchun tayyorlab qo'ygan narsalarga e'tiborni tortishdir.\r\n    3. Muhammad sollallohu alayhi vasallamning haqiqiy payg'ambar ekanliklarini isbotlash.\r\n    Surai karima Nabiy alayhissalomning qadr-qiymatlari ulug'ligi mushriklar qilgan tuhmatlardan pok bo'lib, oliy axloq egasi ekanliklarini ta'kidlovchi qasam ila boshlanadi.\r\n    So'ngra mushriklarning Muhammad sollallohu alayhi vasallamning da'vatlariga munosabatlari va Alloh taolo ular uchun oxiratda tayyorlab qo'ygan azob-uqubatlar haqida zikr qilinadi.\r\n    Undan keyin esa Alloh taolo Makka mushriklariga O'zi bergan ne'matiga noshukr bo'lish, Payg'ambar sollallohu alayhi vasallamni yolg'onchiga chiqarish oqibati nima bo'lishini tushuntirish uchun bog' egalari qissasini keltiradi.\r\n    Bu surada ham Qur'on mo'minlar va mushriklarning holini o'z uslubi bo'yicha solishtirib ko'radi. Shuningdek, qiyomat kuni kofirlarning holi nima kechishi ham tasvirlanadi.\r\n    Suraning oxirida Haq subhanahu va taolo Muhammad sollallohu alayhi vasallamni sabr qilishga amr etib, Yunus alayhissalomga o'xshab, shoshmaslikka undaydi."
        ]
    },
    {
        "word": "Qalandar ",
        "type": [],
        "definition": [
            "dunyo rohatlaridan voz kechib, sufiylik yo'lini tutgan, kelajak va bugungi kun tashvishlarini butunlay unutgan, faqirlik, xokisorlik va malomatni o'zi uchun shior qilib tanlagan, jamoa odatini tark etgan, tasavvuf yo'liga kirib darbadarlik va xayr-ehson bilan kun kechiruvchi"
        ]
    },
    {
        "word": "Qalansuva ",
        "type": [],
        "definition": [
            "Qalansuva – turli ko'rinish va hajmga ega bo'lgan bosh kiyim, do'ppi. Uni salla ostidan ham kiyishgan."
        ]
    },
    {
        "word": "Qamar surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 55 oyatdan iborat.\r\n     Bu surai karimaning 'Qamar' ('Oy') surasi deb nom olishining sababi – Alloh bu surada Nabiy alayhissalomning mo''jizalari sifatida oyning yorilgani haqidagi ulkan hodisani hikoya qiladi.\r\n    Imom Buxoriy rivoyat qilishlaricha, Makka ahli Muhammad alayhissalomdan haqiqiy payg'ambar ekanliklariga dalil sifatida hujjat-mo''jiza ko'rsatishni so'radilar. Rasululloh sollallohu alayhi vasallam duo qildilar. Alloh taolo u kishining duolarini qabul qildi va oy ikkiga bo'lindi. Ikki bo'lakning orasida Hiro g'ori ko'rinib turardi.\r\n    Imom Ahmad Jubayr ibn Mut'amdan bunday rivoyat qiladilar:\r\n    'Nabiy alayhissalomning vaqtlarida oy yorilib, ikkiga bo'lindi. Bir bo'lagi manavi tog' ustida, ikkinchi bo'lagi anavi tog'ning ustida ko'rindi. Mushriklar: 'Muhammad bizni sehrlab qo'ydi, – deyishdi. So'ng ular: – Agar bizni sehrlasa ham, barchani sehrlay olmaydi, musofirlar kelishini kutib turinglar, – deyishdi. Musofirlar kelishganda, ulardan so'rab ko'rishgan edi, musofirlar ham oyning yorilganini ko'rishganini aytdilar. Shunda mushriklar: – Muhammad hammani sehrlab qo'ydi', – deyishdi. Alloh taolo Qamar surasining avvalini nozil qildi'.\r\n    Makkada nozil bo'lgan boshqa suralar kabi, Qamar surasi ham aqiyda asoslarini muolaja qiladi. Uning uslubi o'ziga xos. Tahdid solib, cho'chitib, ogohlantiradi. Avvalidan oxirigacha Qur'oni Karimga ishonmagan barcha toifalarga qattiq hamla qiladi.\r\n    Uning avvalida oy va qiyomat haqida so'z boradi. Keyin esa ibrat, ogohlantirishlar keladi. Ortidan qiyomat kuni dahshatlarining tasviri bayon etiladi. Odamlarning qabrlaridan chiqishi va hokazolar zikr qilinadi.\r\n    So'ngra tug'yonga ketgan qavmlarning halokatga uchraganlari haqidagi qissalar eslatiladi.\r\n    Har bir qavmning qilmishiga yarasha tortgan azobi, mashaqqati hikoya qilib bo'lingandan so'ng, inson eslashga va o'tganlardan ibrat olishga yumshoqlik va lutf ila da'vat qilinadi.\r\n    Nuh, Hud, Solih, Lut va Muso alayhissalomlarning qavmlari o'z payg'ambarlariga qarshi chiqqanlari, Allohning amriga itoat qilmay, o'zboshimchalik ila ish tutganlari oqibatida halokatga uchraganliklari mazkur qissalarda bayon qilinadi. Bu qissalarni keltirishdan maqsad, Qur'on tushayotgan davrdagi kofirlarni ibrat olishga chaqirishdir. Shuningdek, bu qissalar musulmonlarni chidam va bardoshga da'vat etsa, keyingi avlodlarga ham doimiy eslatmadir. Shuning uchun ham suraning oxirida umumiy xitob keladi."
        ]
    },
    {
        "word": "Qaraz ",
        "type": [],
        "definition": [
            "Qaraz – mayda bargli, yong'oqqa o'xshash, katta daraxt. Uning bargidan tayyorlangan modda yordamida oshlangan terilar eng yaxshi terilar hisoblangan."
        ]
    },
    {
        "word": "Qasam ",
        "type": [],
        "definition": [
            "Bizning tilimizdagi 'qasam' va 'ont' so'zlari o'rniga arab tilida 'qasam', 'halif' va 'yamin' so'zlari ishlatiladi. 'Yamin' so'zi Turkiyada ham arabcha ma'nosida ishlatiladi. 'Yamin' so'zi 'o'ng tomon', 'o'ng qo'l' ma'nolarini anglatadi. Arablarda qasamga yamin so'zi ishlatilishining sababi, ularning odatlari bo'yicha, kishilar o'zaro qasam ichishganlarida bir-birlarining o'ng qo'lidan tutib turib qasam ichishar ekanlar. 'Yamin'ni shar'iy istilohda quyidagicha ta'rif qilinadi: 'Alloh taoloning ismi yoki U zotning sifatlaridan birining zikr qilish ila ehtimoli bor bir ishni ta'kid qilish yamindir'. Boshqa bir ta'rifda: 'Xabarni Allohning zikri yoki ta'liq ila kuchlantirish yamindir', deyilgan."
        ]
    },
    {
        "word": "Qasoma ",
        "type": [],
        "definition": [
            "'Qasoma' so'zi lug'atda 'qasam ichish', 'qasam ichadigan qavm' va 'o'lik topilgan mahalla ahlining qasam ichishi' ma'nolarini anglatadi. 'Qasoma' 'qasam ichish'dan olingan bo'lib, shariat istilohida qotili muayyan bo'lmagan o'likning qotilini aniqlash uchun yoki qotillikni inkor etish uchun qasam ichishdan iboratdir. 'Qasoma' sunnat ila sobit bo'lgan hukmdir."
        ]
    },
    {
        "word": "Qasos ",
        "type": [],
        "definition": [
            "Arab tilida 'qasos' so'zi birovning qilgan ishiga o'xshash ish qilishga aytiladi. Xususan, birov yurib o'tgan yo'ldan izma-iz yurish, ma'nosini anglatadi. Qasdan odam o'ldirganni ham, o'zi qanday qilib o'ldirgan bo'lsa, shunday qilib o'ldiriladi."
        ]
    },
    {
        "word": "Qasr namozi",
        "type": [],
        "definition": [
            "90 km.dan ortiq masafoga safar qilgan kishi to'rt rakaatlik farz namozlarni ikki rakaat qilib o'qishi."
        ]
    },
    {
        "word": "Qassiy ",
        "type": [],
        "definition": [
            "Qassiy – zaytun poyasiga ipak aralashtirib to'qiladigan mato bo'lib, o'sha vaqtlarda Misrning Qass degan shahridan olib kelingan; deboj – o'rish-arqog'i ipakdan bo'lgan yupqa shoyi; istabraq – debojning qalini. Ba'zilar bularni toza ipak emas deb o'ylab qolishlari mumkinligi uchun hadisda alohida-alohida ta'kidlanmoqda."
        ]
    },
    {
        "word": "Qatabun ",
        "type": [],
        "definition": [
            "'Qatabun' – kichik egar, tuyaning o'rkachisicha keladigan egar turi."
        ]
    },
    {
        "word": "Qaʼdai ulaa",
        "type": [],
        "definition": [
            "'Qa'dai ulaa' so'zi lug'atda 'avvalgi o'tirish' ma'nosini bildiradi. Shariatda esa, ikki rak'atdan ko'p namozlarda ikki rak'atni o'qib, keyin o'tirib tashahhudni o'qishga 'qa'dai ulaa' deyiladi."
        ]
    },
    {
        "word": "Qibla ",
        "type": [],
        "definition": [
            "'Qibla' lug'atda 'qarshida, ro'baro'da turgan narsa', degani. Namozda Ka'bai Muazzama namozxonning yuzlanadigan tomonida bo'lgani uchun 'qibla' deyiladi."
        ]
    },
    {
        "word": "Qiyom ",
        "type": [],
        "definition": [
            "'Qiyom' so'zidan 'tik turish' anglanadi. Namozda tik turish farzdir."
        ]
    },
    {
        "word": "Qiyomat ",
        "type": [],
        "definition": [
            "insonlarning o'lgandan so'ng qayta tirilish kuni, bu dunyo tugagach, u dunyoda hamma tirilib, so'roqqa to'planadigan kun; oxirat, mahshar."
        ]
    },
    {
        "word": "Qiyomat surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 40 oyatdan iborat.\r\n    Ushbu surai karimaning nomi uning birinchi oyatidan olingan.\r\n    Qiyomat surasida iymon arkonlaridan biri – o'lgandan so'ng tirilish va bu dunyoda qilganlariga yarasha jazo yoki mukofot olish mavzusi muolaja qilinadi. Ayniqsa, surada qiyomat va uning shiddatlariga alohida e'tibor beriladi. Insonning o'lim oldidagi holati, kofirga oxiratda bo'ladigan musibat va qiyinchiliklar zikr qilinadi. Shuning uchun ham sura Qiyomat nomi bilan ataladi.\r\n    Surai karima qiyomat kuni va malomatchi nafs bilan qasam ichib, o'lgandan so'ng tirilish haq ekanini ta'kidlash bilan boshlanadi.\r\n    So'ngra o'sha qo'rqinchli kunning ba'zi alomatlari, jumladan, oy tutilishi, ko'zning hayron qolishi, xaloyiqning mahsharga yig'ilishi va hisob-kitob bo'lishi eslatiladi.\r\n    Qiyomat kunida odamlarning ikkiga bo'linishlari, birinchisi baxtiyorlar, ikkinchisi esa badbaxtlar ekani, baxtiyorlar Alloh taoloning oldida yuzlari yorug' bo'lib, o'z Robblariga nazar solishlari, badbaxtlarning yuzlari qaro bo'lib, xoru zorlikda qolishlari vasf etiladi.\r\n    So'ngra surai karimada insonning o'lim oldidagi holati, o'zi o'ylamagan g'am-g'ussalarga botishi va u paytdagi qiyinchiliklar zikr qilinadi.\r\n    Oxirida mahshar va qayta tirilishning haq ekani aqliy dalillar bilan isbot qilinadi"
        ]
    },
    {
        "word": "Qiyos ",
        "type": [],
        "definition": [
            "Qur'oni Karim oyatlari , Payg'ambarimiz Muhammad sollalohu alayhi vasallamning sunnatlari va ijtixod ahli bo'lgan ulamolarining ijmo'larida hukmi kelmagan masalani mazkur manba'larda hukmi bor shunga o'xshash narsaga qiyoslab hukm chiqarish"
        ]
    },
    {
        "word": "Qiyrot ",
        "type": [],
        "definition": [
            "Qiyrot – miqdor o'lchovi. Uning miqdori turli o'lkalarda turlicha bo'lgan. Masalan, makkaliklarda qiyrot dinorning yigirma to'rtdan bir ulushi hisoblansa, aksar yurtlarda yigirmadan biri bo'lgan. Ammo 'qiyrot' kalimasi keyinchalik bir narsaning nihoyatda ko'pligini, cheksizligini ifoda etish uchun qo'llanadigan bo'lib ketgan. Bu yerda ham o'sha ma'no ko'zda tutilgan."
        ]
    },
    {
        "word": "Qiroat ",
        "type": [],
        "definition": [
            "Qur'on oyatlarini tajvid qoidalariga rioya qilgan holda, o'ziga xos ohangda o'qish."
        ]
    },
    {
        "word": "Qiron ",
        "type": [],
        "definition": [
            "haj oylarida haj va umrani niyat qilib bir ehrom bog'lashdir. 'Qipon' so'zi 'yaqinlik', 'qo'shilish' ma'nolarini anglatadi. Umra bilan yaqinlashtirib, bip-bipiga qo'shib qilingan hajni 'Qipon haji' deyiladi."
        ]
    },
    {
        "word": "Qisma ",
        "type": [],
        "definition": [
            "'Qisma' lug'atda 'taqsimlash' ma'nosini bildiradi. Fuqaholar istilohida esa: Qisma tarqoq haqni tayin qilishdir. Bir mulk bir necha kishining qo'liga o'tganda ulardan har birining o'sha mulkdagi haqini aniqlab berish 'qisma' deb ataladi. 'Qisma' Qur'on, Sunnat va Ijmo' bilan sobit bo'lgandir."
        ]
    },
    {
        "word": "Qist ",
        "type": [],
        "definition": [
            "1,375 litr. Og'irligi = 1,088 kg (= 0,5 so' = 2 mudd = 2 katta hovuch miqdori)."
        ]
    },
    {
        "word": "Qobiysa ibn Halib",
        "type": [],
        "definition": [
            "Qobiysa ibn Halib Toliy al-Kufiy ulug' tobe'inlardandir. Hadislarini otalaridan rivoyat qiladilar. Otalari Rasululloh sollallohu alayhi vasallam bilan suhbatda bo'lganlar."
        ]
    },
    {
        "word": "Qogʻonoq ",
        "type": [],
        "definition": [
            "Qog'onoq – urg'ochi hayvonning homilasini o'rab turuvchi shilliq parda."
        ]
    },
    {
        "word": "Qod qomatis solat",
        "type": [],
        "definition": [
            "Namoz qoim bo'ldi"
        ]
    },
    {
        "word": "Qodisiya ",
        "type": [],
        "definition": [
            "Qodisiya - Ko'fadan 15 mil masofada joylashgan shahar."
        ]
    },
    {
        "word": "Qozi ",
        "type": [],
        "definition": [
            "tayin qiluvchi, hukm chiqaruvchi, shariat hukmlarini tayinlovchi"
        ]
    },
    {
        "word": "Qozi Abu Yusuf Ahmad ibn Husayn Kafriy Hanafiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Damashqlik ulamo."
        ]
    },
    {
        "word": "Qozilik ",
        "type": [],
        "definition": [
            "Qozilik arabchada 'Qazo' deyiladi va bir ishni 'bitirish' ma'nosini anglatadi. Bizda 'hukm chiqarish' ma'nosida ham ishlatiladi. Shariat istilohida esa, hukmlarni lozim tutish, xusumatlarni ajrim qilish va nizolarni kesishga 'qozilik' deyiladi. Qozilik farzi kifoya ish hisoblanadi. Agar qozilikka bir kishi yaroqli bo'lsa, o'shanga bu ishni qilish vojib bo'ladi."
        ]
    },
    {
        "word": "Qoyim ",
        "type": [],
        "definition": [
            "turuvchi, ishni tadbir qilib boshqaruvchi"
        ]
    },
    {
        "word": "Qomusiy olim",
        "type": [],
        "definition": [
            "ilmning barcha turlaridan xabardor bo'lgan alloma."
        ]
    },
    {
        "word": "Qori ",
        "type": [],
        "definition": [
            "Qori – Qur'on o'quvchi."
        ]
    },
    {
        "word": "Qoriʼa surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 11 oyatdan iborat.\r\n    Bu surai karima qiyomat kuni haqida so'z yuritib, u kunni yangi nom – 'Qori'a', ya'ni 'shiddat bilan qoquvchi' degan nom bilan ataydi. Bu nomning o'zi dahshatli, chunki uning qalblarni qo'rqinchga to'ldiruvchi ma'nosi bor. Ushbu surai karima ana shu so'z bilan boshlangani uchun, bu so'z unga ism bo'lib qolgan.\r\n    Sura nihoyasida yaxshi amal qilib o'tganlar najotga erishishlari va kofirlar azobu hasratda qolishlari ta'kidlanadi."
        ]
    },
    {
        "word": "Qosim al-Koyashkaniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ahmad Qosim ibn Muhammad al-Koyashkaniy al-Buxoriy Buxoroning Koyashkan nomli qishlog'idan. Bu kishi Abu Ali Solih ibn Muhammad, Nasr ibn Ahmad al-Kindiy va boshqalardan hadis rivoyat qilganlar. Ko'p olimlardan ta'lim olganlar."
        ]
    },
    {
        "word": "Qosos surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 88 oyatdan iborat.\r\n    Bu surai karimada Muso alayhissalom qissalari batafsil kelgani uchun, unga 'Qosos' ('Qissa') nomi berilgan. Qosos surasi musulmonlar Makkada g'oyat og'ir kunlarni boshlaridan kechirayotgan bir paytda nozil bo'lgan. Shu sababli o'zidan avval kelgan Shuaro va Naml suralariga o'xshab ketadi. Ushbu uch surai karima Qur'oni Karimda qanday joylashtirilgan bo'lsa, shu tartibda birin-ketin nozil etilgan.\r\n    Imom Olusiy o'zining 'Ruhul ma'oniy' nomli tafsirida keltirishicha, Abdulloh ibn Abbos va Jobir ibn Zayd roziyallohu anhular: 'Avval Shuaro surasi, so'ngra 'Naml', undan keyin Qosos surasi nozil bo'ldi', – degan ekanlar.\r\n    Avvalgi ikki sura kabi, bunda ham Nabiy sollallohu alayhi vasallamga va mo'min-musulmonlarga tasalli beriladi, ular iymon-Islom yo'lida sabrga chaqiriladi. Mushrik va kofirlarning jabr-sitamlari o'tkinchiligi, oxir-oqibat kufr va uning ahli mag'lub bo'lishi, iymon va uning ahli g'olib kelishi ta'kidlanadi.\r\n    Surai karima mo'minlar ustidagi qiyin va og'ir sharoit vaqtincha ekanini, ularning kelajaklari porloq, zulmning oqibati, albatta, zulmat bo'lishini alohida ta'kidlaydi.\r\n    Shu bilan birga, 'sabrning tagi sariq oltin' ekani, musulmonlar sabrlari tufayli hozirgi zaifhollik va nochorlikdan qutulib, yaqin orada oyoq-qo'llaridagi kishanlarni parchalab, qayta hurriyatga chiqishlari uqtiriladi.\r\n    Bunga tarixiy misol o'laroq, Muso alayhissalom va u kishining qavmlari bilan Fir'avn va uning qavmi orasida bo'lib o'tgan qissa mufassal hamda o'ziga xos uslub bilan keltiriladi. Boshqa suralarda batafsil so'zlangan hodisalar bu yerda qisqacha eslatilsa, boshqa suralarda qisqacha so'zlangan voqealar to'liq yoritiladi.\r\n    Avvalgi ikki surada zikr qilinmagan quyidagi to'rt jihat Qosos surasida keng bayon etilgan.\r\n    1. Muso alayhissalomning tug'ilishlari; tug'ilishlari bilan boshlariga tushgan musibatlar; onalari u kishini sandiqqa solib, suvga oqizishi; sandiq oqib borib, Fir'avnning qasriga kirishi.\r\n    2. Muso alayhissalomning Fir'avn qasridagi hayotlari; hech kimni emmay qo'yganlari uchun, onalari Fir'avn va uning ahliga o'zini bolaga begona qilib ko'rsatib, emizgani.\r\n    3. Voyaga yetgan yigit – Muso alayhissalomning o'z qavmlaridan bo'lgan odamga yordam bermoqchi bo'lib, bir qibtiyni urib, o'ldirib qo'yishlari; bu xatoga tavba qilishlari; so'ngra bir odamning u kishiga 'Fir'avnning odamlari seni o'ldirishni maslahat qilishmoqda' degan xabarni yetkazishi; shundan keyin Misrni tashlab, chiqib ketishlari.\r\n    4. Muso alayhissalomning Madyandagi hayotlari; uylanishlari va qo'y boqishlari; so'ngra esa boshqa suralarda ham kelgan voqealar – Madyandan qaytishlari; Tur tog'idagi hodisalar; Misrga payg'ambar bo'lib borishlari; u yerda bo'lib o'tgan voqealar oxirigacha keltiriladi.\r\n    Surada Qorun qissasi ham zikr etilgan. U mol-dunyoga berilgan va har bir narsani modda bilan o'lchovchi kofirdir. Bu qissada iymon mantig'i bilan tug'yon mantig'i solishtirib ko'riladi.\r\n    Suraning so'ngida esa barcha payg'ambarlarga xos saodat yo'li bo'lmish iymon yo'liga irshod qilinadi."
        ]
    },
    {
        "word": "Qof surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 45 oyatdan iborat.\r\n    Ushbu surai sharifaga o'zining avvalida kelgan, alifbo harflaridan biri bo'lgan 'Qof' ism etib ixtiyor etilgan.\r\n    Qof surasi Makkada nozil bo'lgan suralarning ichida o'zining shiddati, qalblarni larzaga solishi bilan ajralib turadi. Bu sura kuchli xitoblar ila insonning ko'zini ochib, unga o'limni, qayta tirilishni, hisob-kitobni va jannat-do'zaxni eslatadi.\r\n    Sura qasam bilan boshlanib, payg'ambarlikni va o'lgandan so'ng tirilishni inkor qiluvchi mushriklarni qoralaydi. Qur'oni Karim bu muhim masalani muolaja qilibgina qolmaydi, balki izdan chiqqan, adashgan qabilalarni tarbiyalab, to'g'ri yo'lga solishga ham harakat qiladi.\r\n    Alloh shunday misollarni keltiradiki, ular yordamida hamma narsani, jumladan, yer o'liklarni kemirib borayotganini ham bilishini bayon etadi. Borliqdagi barcha mavjudot va maxluqotlarni O'zi yaratganini ta'kidlaydi. O'tgan kofir qavmlarning qismatini eslatadi.\r\n    Insonni doimo ikki farishta kuzatib, amallarini yozib borishi ham Allohning amri ila bo'ladi. Qolaversa, o'lim paytida haq zohir bo'ladi. Oxiratda – qiyomat qoim bo'lganda hamma qilganiga yarasha jazo yoki mukofot oladi.\r\n    Surada jahannamning holi alohida, jannat ahlining holi alohida tavsif qilinadi.\r\n    Nihoyat, suraning oxirida Nabiy alayhissalom va musulmonlar sabrga chaqirilib, Allohga hamd aytish va Uni poklab yodga olish, oxiratni eslash tavsiya etiladi"
        ]
    },
    {
        "word": "Qubaysa ibn Zuʼayb",
        "type": [],
        "definition": [
            "Qubaysa ibn Zu'ayb ibn Xalxala al-Xuzoiy, kunyalari Abu Sa'iyd al-Madaniy. Fath yilida dunyoga keldilar. Sahobalar avlodidan, Madina ahlining faqih va solih kishilaridan bo'lganlar.\r\n    Hadislarni Umar ibn Xattobdan mursal holda rivoyat qildilar. Yana Bilol, Usmon ibn Affon, Abdurrahmon ibn Avf, Abu Hurayra, Oisha va Ummu Salama onalarimizdan hadislar rivoyat qildilar.\r\n    Hijratning 89-yili Abdulmalik ibn Marvonning xalifalik davrida vafot etdilar."
        ]
    },
    {
        "word": "Qubba ",
        "type": [],
        "definition": [
            "Qubba – yarimshar shaklidagi chodir, arablarning uylaridan biri"
        ]
    },
    {
        "word": "Qubo ",
        "type": [],
        "definition": [
            "Qubo – Madinai Munavvaraning g'arbidagi joy nomi. Masjidi Nabaviydan taxminan 5 km uzoqlikda joylashgan. Rasululloh sollallohu alayhi vasallam hijrat qilib kelganlarida birinchi shu joyga tushganlar va o'sha yerda ilk masjidga asos solganlar."
        ]
    },
    {
        "word": "Qudayd",
        "type": [],
        "definition": [
            "Makkai mukarrama bilan Madinai munavvara oralig'idagi manzil"
        ]
    },
    {
        "word": "Qudayd ",
        "type": [],
        "definition": [
            "Qudayd – Makka bilan Madina o'rtasidagi sersuv, obod qishloq. Bu ism aslida o'sha yerdagi buloqning nomi bo'lgan."
        ]
    },
    {
        "word": "Qunut ",
        "type": [],
        "definition": [
            "'Qunut' lug'atda 'duo' va 'tazarru'' ma'nosidadir. Shariatda esa, namozda ruku'dan oldin yoki keyin turib Alloh taologa iltijo qilib, yomonlikni daf' qilish yoki yaxshilikni jalb qilishni so'rashdir."
        ]
    },
    {
        "word": "Quraysh",
        "type": [],
        "definition": [
            "Payg'ambar alayhissalomning qabilalari"
        ]
    },
    {
        "word": "Quraysh surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 4 oyatdan iborat.\r\n    Ushbu suraning nomi o'zining birinchi oyatidan olingan. Quraysh eng hurmatli, eng qadrli arab qabilasi hisoblanadi. Ushbu surada Alloh taolo Quraysh qabilasiga O'zi bergan ulug' ne'matlarni eslatib, mazkur ne'matlar shukronasiga ular Alloh taologa, Qurayshga izzat-ikrom keltirgan baytning Robbiga ibodat qilmoqlari lozim ekanini eslatadi.\r\n    Quraysh surasi Fil surasining uzviy davomidek. Fil surasida Abriha va uning askari to'g'risida zikr qilingan hodisalar Ka'ba va uning atrofida yashab, hojilar xizmatini qilib turuvchilarning obro'sini yanada oshirib yubordi. Ayniqsa, Quraysh qabilasining obro'si Arabiston yarim orolida o'sdi. Hamma tarafda qaroqchilik, bosqinchilik hukm surishiga qaramay, Baytullohning aholisi, deb hurmat qilib, ularga hech kim tegmas edi. Ular bu omonlikdan foydalanib, bemalol safar qilib yurishardi. Quraysh qabilasining savdo karvonlari ham bemalol qishda Yamanga, yozda Shomga safar qilardi. Bu esa ularga rizq-ro'zning mo'l bo'lishi imkonini berardi. Yerlarida hech narsa o'smaydigan qaqroq cho'l bo'lishiga qaramay, ular barakali hayot kechirardilar.\r\n    Alloh taolo bu surada O'zining ana shu ne'matlarini ularning eslariga soladi va shukr qilib, Allohga ibodat qilishga undaydi."
        ]
    },
    {
        "word": "Qurbonlik",
        "type": [],
        "definition": [
            "'Qurbonlik' qurbon hayiti kunlari so'yiladigan hayvondir. Fuqaholar istilohida 'qurbonlik' 'Maxsus hayvonni maxsus vaqtda so'yishdir'. Qurbonlik shariatga ikkinchi hijriy sanada kiritilgan. Hanafiy mazhabi bo'yicha, qurbonlik qilish vojibdir. Qurbonlik qilish hur, oqil, muqim va zakot nisobiga molik bo'lgan musulmon shaxsga vojib bo'ladi. Hanafiy mazhabi bo'yicha, qurbonlik qilish vojib musofirga bo'lmaydi."
        ]
    },
    {
        "word": "Qurʼon",
        "type": [],
        "definition": [
            "Allohning Muhammad alayhissalomga nozil qilgan kitobi; Allohning kalomi; ilohiy kitob"
        ]
    },
    {
        "word": "Qust ",
        "type": [],
        "definition": [
            "Qust – Hind, Xitoy yerlarida o'sadigan o'simlikning ildizi. Shuning uchun uni 'hind qusti' deyilgan. U Arab jazirasiga odatda dengiz orqali keltirilgani uchun uni 'dengiz qusti' ham deb atalgan. Uning oq va qora turi bo'lib, oqini 'dengiz qusti', qorasini 'Hind qusti' deyishadi. Ibn Sino uning yana bir turini ham aytgan. Ushbu ildizning po'stlog'i juda ham foydali bo'lib, ko'pgina kasalliklarni davolashda ishlatilgan. Uni burunga qabul qilish uch xil usulda bo'lgan: 1. Po'stloqning tolqonini burunga tortish; 2. Ildizni yoqqa ivitib, o'sha yog'ni burunga tomizish; 3. Tolqonini suvga aralashtirib, burunni chayish."
        ]
    },
    {
        "word": "Qutayba al-Foriziy",
        "type": [],
        "definition": [
            "Abu Muhammad Qutayba ibn Hasan al-Foriziy Hamid ibn Qutayba va Muhammad ibn Qutaybaning otalari. Laqablari 'Hasan kaj' edi. Ubbod ibn Avom va Muxlid ibn Umardan hadis rivoyat qilganlar. O'zlaridan esa Ibrohimning otalari Muhammad ibn Husayn hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Qutbuddin Muhammad ibn Muhammad Roziy -",
        "type": [],
        "definition": [
            "Bu ustoz turli ilmlarda peshqadam bo'lgan. U kishi ta'lif etgan mashhur kitoblar quyidagilar:\r\n    1. 'Sharhush Shamsiya'.\r\n    2. 'Sharhul Matole''.\r\n    3. 'Sharhul Hoviy'.\r\n    4. 'Hoshiyatul Kashshof'.\r\n     Yana boshqa ko'pgina kitoblari bor."
        ]
    }
]