[
    {
        "word": "Rabaza",
        "type": [],
        "definition": [
            "Rabaza – Tabuk yaqinidagi joyning nomi"
        ]
    },
    {
        "word": "Rabboniy",
        "type": [],
        "definition": [
            "ilohiy, Allohga haqiqiy bog'langan"
        ]
    },
    {
        "word": "Rabot",
        "type": [],
        "definition": [
            "musofirxona, bekat, shahar atrofi, karvonsaroy, savdo joyi"
        ]
    },
    {
        "word": "Ravh ar-Romitaniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ibrohim Ravh ibn Mustanir ar-Romitaniy al-Buxoriy - Buxoroning Romitan nomli qishlog'idan. Bu kishi Muxtor ibn Sobiq, Abu Hafs al-Kabir va Musayyib ibn Ishoqdan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Hishom hadis rivoyat qilganlar"
        ]
    },
    {
        "word": "Ravho",
        "type": [],
        "definition": [
            "Ravho – Makka bilan Madina orasida joylashgan joy nomi"
        ]
    },
    {
        "word": "Rajaz",
        "type": [],
        "definition": [
            "Rajaz – qisqa vaznli she'r turi."
        ]
    },
    {
        "word": "Rajʼat",
        "type": [],
        "definition": [
            "'Raj'at' bir yoki ikki taloq qilingan xotinni er o'z ixtiyoriga qaytarib olishidir."
        ]
    },
    {
        "word": "Rajʼiy taloq",
        "type": [],
        "definition": [
            "Haqiyqiy duxul–jinsiy yaqinlikdan keyin, ochiq-oydin lafz bilan qilingan, turli sifatlarni qo'shmay kinoya lafzi bilan qilingan va hokimning hukmi ila nafaqa bermaslik va iylo sababidan qilingan bir yoki ikki taloq raj'iy taloq bo'ladi. Bunday taloqdan keyin er taloq qilingan xotinni o'z nikohiga iddasi ichida, agar xotin rozi bo'lmasa ham, qaytarib olish haqqiga ega. Buning uchun er 'Xotinimni o'zimga qaytarib oldim' yoki 'Xotinimni nikohimda ushlab qoldim' desa, kifoya qiladi. Yangitdan mahr berish, aqdi nikoh qilishning hojati yo'q. Eng muhim shart shuki, qaytish xotinning iddasi chiqmay turib bo'lishi kerak. Agar idda chiqquncha qaytmasa, taloq boinga aylanib qoladi. Unda yangitdan aqdi nikoh qilish zarur bo'ladi."
        ]
    },
    {
        "word": "Raml",
        "type": [],
        "definition": [
            "Tavofda cHar elka Baytullohga qilinib, qicqa, shaxdam qadamlar bilan Yurish"
        ]
    },
    {
        "word": "Rasmiy fiqhiy mazhablar",
        "type": [],
        "definition": [
            "1) Hanafiy mazhabi; 2) Shofe'iy mazhabi; 3) Molikiy mazhabi; 4) Hanbaliy mazhabi;"
        ]
    },
    {
        "word": "Rasul",
        "type": [],
        "definition": [
            "elchi, chopar, payg'ambar, nabiy"
        ]
    },
    {
        "word": "Ratl",
        "type": [],
        "definition": [
            "Iroqiy ratl 12 = 0,515625 litr (≈ 0,516 litr)."
        ]
    },
    {
        "word": "Rahm",
        "type": [],
        "definition": [
            "'Rahm' so'zi bu yerda qarindoshlikni bildirib, kelib chiqishi rahm shafqat, mehribonlik mazmunidagi 'rohiman' o'zagidandir. Allohning 'o'ta mehribon' degan ma'noni bildiruvchi ismi – Rahmon ham xuddi shu o'zakdan olingan. Bu ikki so'zning o'zakdosh bo'lishidagi tashbeh qarindoshchilikning Rahmon taolo nazdida qanchalar katta ahamiyatga ega ekanini uqtirish, tasavvur qildirsh uchundir. Alloh taoloning 'Kim seni bog'lasa, bog'layman, kim seni uzsa, uzaman', degani qarindosh urug'chilik rishtalarini bog'lagan kishilarga U Zotning rahmatu fazl bilan boqishi, duolarini qabul qilishini, silai rahmni uzgan kishilarga esa aksincha munosabatda bo'lishini bildiradi."
        ]
    },
    {
        "word": "Rahmatullohi alayh",
        "type": [],
        "definition": [
            "unga Allohning rahmati bo'lsin"
        ]
    },
    {
        "word": "Rahn",
        "type": [],
        "definition": [
            "Garov arab tilida 'rahn' deyiladi va bir narsani qanday bo'lsa ham bir sababga ko'ra ushlab qolishga aytiladi. Shariat istilohida esa: Garov arzigulik molni undan olib qolish mumkin bo'lishi uchun zimmadagi to'lovga o'xshash haqq yuzasidan tutib qolishdir. Garovning shariatga kiritilishiga Qur'on, Sunnat va Ijmo'dan dalillar bor."
        ]
    },
    {
        "word": "Raʼd surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 43 oyatdan iborat.\r\n    'Ra'd' so'zining bizning tilimizdagi ma'nosi 'momaqaldiroq'dir. Ushbu surai karimaning nomi 'Va ra'd – momaqaldiroq Uning hamdi ila tasbeh aytadi' oyatidan olingandir. Ulamolarimiz: 'Bu surai karima o'z nomiga mos, xuddi ra'd – momaqaldiroq kabi gulduros solib, hammaning e'tiborini tortadi; Allohga, Qur'onga, Payg'ambarga ishonishga chorlaydi', – deydilar.\r\n    Makkada nozil bo'lgan boshqa suralar kabi, bu surai karimaning ham asosiy mavzusi aqiyda va uning turli maqsadlarini muolaja qilishdan iboratdir. Unda asosan ilohu ma'budning yagonaligi, bu dunyoyu oxiratda faqat yagona Allohga bo'ysunish lozimligi haqida so'z ketadi. Shuningdek, vahiy, ilohiy Kitob va o'lgandan so'ng qayta tirilish masalalariga ham alohida e'tibor qilinadi.\r\n    To'g'ri, mazkur masalalar boshqa suralarda ham o'tgan. Ammo Ra'd surasi shu masalalarning ayni o'zini tamoman boshqacha uslub ila talqin etadi. Ayniqsa, bu masalalarning borliq ajoyibotlariga bog'langan holda bayon qilinishi diqqatni tortadi. Sura inson qalbini ufqlar sari yetaklaydi. Uni atrofidagi mavjudotlarga, osmonu yerga, tog'u toshga, quyoshu oyga, kechayu kunduzga, quruqligu suvlikka, o'simliklarga, turli manzaralarga, o'zgarishlarga nazar solishga, e'tibor qilishga chorlaydi."
        ]
    },
    {
        "word": "Raʼy",
        "type": [],
        "definition": [
            "fikr, taqqoslash"
        ]
    },
    {
        "word": "Revartun",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Ribo",
        "type": [],
        "definition": [
            "'Ribo' lug'atda ziyoda ma'nosini anglatadi. Shariatda esa: Molni molga almashtirishda ikki aqd qiluvchidan biriga keladigan evazsiz ortiqcha mol ribodir. Alloh taolo 'Baqara' surasida quyidagilarni aytadi: 'Riboni yeydiganlar (qabrlaridan) faqat shayton urib, jinni bo'lgan kishidek dovdirab turarlar. Bunday bo'lishi, ularning, tijorat ham riboga o'xshash-da, deganlari uchundir. Va holbuki, Alloh tijoratni halol, riboni harom qilgan. Kimki Robbidan mav'iza kelganda to'xtasa, avval o'tgani o'ziga va uning ishi Allohning O'ziga havola. Kimki, yana (riboga) qaytsa, ana o'shalar do'zax egalaridir. Ular unda abadiy qolurlar', (275-oyat)."
        ]
    },
    {
        "word": "Ribo al-fazl",
        "type": [],
        "definition": [
            "Oltin, kumush, bug'doy, arpa, tuz va xurmolardan bir jinsdagi narsani almashtirishda ziyoda olishdir. Buni savdo ribosi ham deyiladi. Misol uchun, tilloni tilloga sotsa va biri ikkinchisidan ko'p bo'lsa, 'ribo al-fazl' bo'ladi. Bu yerda jinsi ham bir xil, o'lchovi ham bir xil narsada bir taraf fazl, ya'ni ortiqcha narsani evazsiz olmoqda."
        ]
    },
    {
        "word": "Rido",
        "type": [],
        "definition": [
            "Rido – tananing yuqori qismiga kiyiladigan en kiyim. U izorning muqobili, yupqa, bir qavatli choyshabsimon ustki kiyim. U yengli bo'lishi ham, yengsiz bo'lishi ham, kalta yengli bo'lishi ham, tikilgan bo'lishi ham mumkin;"
        ]
    },
    {
        "word": "Riyo",
        "type": [],
        "definition": [
            "Xo'jako'rsin"
        ]
    },
    {
        "word": "Riyo",
        "type": [],
        "definition": [
            "'Riyo' so'zi ko'rish ma'nosini anglatadi. Shariatda esa Alloh uchun emas, xo'jako'rsinga amal qilish 'riyo' deyiladi."
        ]
    },
    {
        "word": "Riyozat",
        "type": [],
        "definition": [
            "qiynalish, zahmat, mashaqqat, tariqat shartlaridan biri."
        ]
    },
    {
        "word": "Rijol",
        "type": [],
        "definition": [
            "hadis rivoyat qilgan kishilar"
        ]
    },
    {
        "word": "Rizvon al-Badokariy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ja'far Rizvon ibn Solim al-Badokariy al-Buxoriy - Buxorodagi Badokar qishlog'idan bo'lib, Abu Hafs al-Kabir va Musayyib ibn Ishoqdan hadis rivoyat qilganlar. O'zlaridan esa Makkiy ibn Xalaf ibn Usmon al-Buxoriy va Abu Bakr Ahmad ibn Abdulvohid al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Rizvon bayʼati",
        "type": [],
        "definition": [
            "'Rizvon bay'ati' – 'rozilik bay'ati'. Hudaybiyada Makkaga elchi bo'lib ketgan Usmon roziyallohu anhu hadeganda qaytib kelavermagach, Rasululloh sollallohu alayhi vasallam urush bo'lish ehtimolini e'tiborga olib, musulmonlardan bay'at olganlar va bu juda ham og'ir vaziyat bo'lgan. O'shanda Alloh taolo ushbu bay'atda qatnashganlardan rozi bo'lganini aytib, oyat nozil qilgan. Shu bois bu bay'at mazkur nomni olgan."
        ]
    },
    {
        "word": "Rizq",
        "type": [],
        "definition": [
            "Allohning har bir insonga bergan ulushi"
        ]
    },
    {
        "word": "Rikoz",
        "type": [],
        "definition": [
            "Rikoz – dafina va xazina"
        ]
    },
    {
        "word": "Risala fil vaqf ʼalal hamz li Hamza va Hisham",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Risalatun fil vazʼi",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining asari. Bu risolada yolg'ondan hadis to'qish haqida ma'lumotlar berilgan"
        ]
    },
    {
        "word": "Risolai Bahoiya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhi o'zining bu risolasida o'zi mansub bo'lgan naqshbandiya tariqatining shayxi xoja Bahouddin Naqshband rahmatullohi alayhining manoqiblarini bitgan."
        ]
    },
    {
        "word": "Risolai Shavqiya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu asari fors tilida yozilgan bo'lib, tasavvufning asllarini bayon qiladi."
        ]
    },
    {
        "word": "Risolatul kibro fil mantiq",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. 'Mantiq bo'yicha katta risola'.\r\n    Bu risolani Sayyid Sharif Jurjoniy rahmatullohi alayhi fors tilida yozgan. Keyinchalik ushbu risolani u kishining o'g'li Muhammad rahmatullohi alayhi arab tiliga tarjima qilgan va 'Durra' deb nomlagan. Bu risola chop qilingan"
        ]
    },
    {
        "word": "Risolatul qadar",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu risolasi qadar masalasi haqida ekani uning nomidan ham ko'rinib turibdi."
        ]
    },
    {
        "word": "Risolatun ila ahlis sagʻr",
        "type": [],
        "definition": [
            "Mazkur risolada imom Abulhasan Ali ibn Ismoil al-Ash'ariy rahmatullohi alayhi mo''taziliylarga ma'lum bir masalalarda raddiya qiladi va o'zining imom Ahmad mazhabida ekanini bayon etadi."
        ]
    },
    {
        "word": "Risolatun ila Usmon ibn Muslim al Battiy",
        "type": [],
        "definition": [
            "Imom Abu Hanifa rahmatullohi alayhning kitoblari"
        ]
    },
    {
        "word": "Risolatun fiy qovlihi taolo ʼSanuriyhim aayatinaa fil oofoqi va fiy anfusihimʼ",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhning risolasi. U Zot taoloning 'Ularga ham ufqlardagi, ham o'zlaridagi oyat(belgi)larimizni yaqinda ko'rsatamiz', degan qavli haqidagi risola."
        ]
    },
    {
        "word": "Risolatun fil vujudi",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhi o'zining ushbu risolasida mavjudotlarning martabalari haqida so'z yuritgan"
        ]
    },
    {
        "word": "Risolatun fil ikroh",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi birovni majburlashga oid hadislardan iboratdir."
        ]
    },
    {
        "word": "Risolatun fil firqatin nojiya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining 'Najot topuvchi firqa haqidagi risola' degan ma'nodagi bu risolasi mazhablar va firqalar to'g'risidagi asardir"
        ]
    },
    {
        "word": "Risolatus sugʻro fil mantiq",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. 'Mantiq bo'yicha kichik risola'. Bu risolani Sayyid Sharif Jurjoniy rahmatullohi alayhi fors tilida yozgan. Keyinchalik ushbu risolani u kishining o'g'li Muhammad rahmatullohi alayhi arab tiliga tarjima qilgan va 'G'urra' deb nomlagan. Bu risola chop qilingan."
        ]
    },
    {
        "word": "Risolatut Tavhid",
        "type": [],
        "definition": [
            "Muhammad Abduhning aqoid ilmiga oid kitoblari"
        ]
    },
    {
        "word": "Rifoʻa ibn Rofeʼ",
        "type": [],
        "definition": [
            "Rifo'a ibn Rofe' ibn Molik ibn Ajalon Ansoriy az-Zurqiy, kunyalari Abu Muoz. Onalari Abdulloh ibn Ubay ibn Salul ismli munofiqning singlisi Ummu Molikdir.\r\n    Uhud, Xandaq, Rizvon bay'ati va boshqa bir qancha ma'rakalarda Rasululloh sollallohu alayhi vasallam bilan ishtirok etganlar.\r\n    Rifo'a ibn Rofe' Jamal, Siffiyn urushlarida Ali ibn Abu Tolib roziyallohu anhu bilan ishtirok etgan ulug' sahobalardan edilar.\r\n    Rasululloh sollallohu alayhi vasallamdan 24ta hadis rivoyat qilganlar. Abu Bakr va Uboda ibn Somitlardan ham rivoyat qilganlar.\r\n    U kishidan o'g'illari Ubayd, Muoz, inilarining o'g'li Yahyo ibn Xallod, Ziror ibn Sard va boshqalar rivoyat qilganlar.\r\n    Bu kishi rivoyat qilgan hadislardan ba'zilarini mashhur uchta 'Sahih' sohiblari o'z kitoblariga kiritganlar. Bu zot hijratning 41-sanasida vafot etdilar."
        ]
    },
    {
        "word": "Rihlat",
        "type": [],
        "definition": [
            "Safar"
        ]
    },
    {
        "word": "Robaʼiyya",
        "type": [],
        "definition": [
            "'roba'iyya' so'zi 'tishlar' deb tarjima qilindi. Roba'iyya deb ustki va pastki jag'lardagi kurak tishlarning yonida joylashgan tishlar, ya'ni ustki va pastki II tishlarga aytiladi. Uhud jangida Rasululloh sollallohu alayhi vasallamning pastki ikkilamchi tishlari shikastlangan va pastki lablari jarohat olgan."
        ]
    },
    {
        "word": "Robiyʼa ibn Kaʼb",
        "type": [],
        "definition": [
            "To'liq ismlari Robiy'a ibn Ka'b ibn Molik ibn Ya'mur al-As¬lamiy, kunyalari – Abu Firos. Bu kishi Hijoz ahlidan bo'lib, ulug' sahobalardan hisoblanar edilar.\r\n    Robiy'a ibn Ka'b roziyallohu anhu suffa ahlidan edilar. Rasululloh sollallohu alayhi vasallamdan bir necha hadislar rivoyat qildilar. Bu kishidan Abu Salama ibn Abdurrahmon, Xanzala ibn Amr, Abu Imron al-Ju'fiylar rivoyat qilganlar."
        ]
    },
    {
        "word": "Roviy",
        "type": [],
        "definition": [
            "rivoyat qiluvchi"
        ]
    },
    {
        "word": "Roziqiya",
        "type": [],
        "definition": [
            "Roziqiya – zig'ir matosidan tikilgan uzun oq kiyim"
        ]
    },
    {
        "word": "Roziyallohu anhu",
        "type": [],
        "definition": [
            "Alloh undan rozi bo'lsin"
        ]
    },
    {
        "word": "Roma-hurmuz",
        "type": [],
        "definition": [
            "Roma-Hurmuz (hozir Romhurmuz deyiladi) – Fors diyoridagi qadimiy shaharlardan biri bo'lib, hozirda u Erondagi Xuziston viloyatining markaziy shahri hisoblanadi."
        ]
    },
    {
        "word": "Romitan",
        "type": [],
        "definition": [
            "(Armitana deb ham aytiladi) – Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Romush",
        "type": [],
        "definition": [
            "Buxoroning qishloqlaridan"
        ]
    },
    {
        "word": "Rofeʼ ibn Sinon",
        "type": [],
        "definition": [
            "Rofe' ibn Sinon al-Avsiy, kunyalari Abu Hakam al-Madaniy. Hadislarni Rasululloh sollallohu alayhi vasallamdan rivoyat qildilar. Bu zotdan nabiralari Ja'far ibn Abdulloh ibn Hakam ibn Rofe' rivoyat qildilar."
        ]
    },
    {
        "word": "Rofizalar",
        "type": [],
        "definition": [
            "shialar va ularga tobe'lar"
        ]
    },
    {
        "word": "Rofiziy",
        "type": [],
        "definition": [
            "islom dinidan chetga chiqqan oqim."
        ]
    },
    {
        "word": "Rohib",
        "type": [],
        "definition": [
            "xristianlar boshlig'i"
        ]
    },
    {
        "word": "Rohila",
        "type": [],
        "definition": [
            "'Rohila' deganda hajga borib kelguncha yetadigan yo'l xarajatlari anglanadi."
        ]
    },
    {
        "word": "Ruvaysa",
        "type": [],
        "definition": [
            "Ruvaysa – Makka bilan Madina orasida joylashgan qishloq, u bilan Madina orasida o'n yetti farsax masofa bor."
        ]
    },
    {
        "word": "Roʻza",
        "type": [],
        "definition": [
            "islomdagi beshta asosiy rukndan biri. Alloh roziligi va savob umidida sahardan iftorgacha yeyish, ichish va jimo'dan saqlanish"
        ]
    },
    {
        "word": "Roʻzani ochuvchi narsalar",
        "type": [],
        "definition": [
            "'Ro'zani ochuvchi narsalar' deganda yemoq, ichmoq, jinsiy yaqinlik qilmoq kabi ro'zaning buzilishiga sabab bo'luvchi barcha narsalar ko'zda tutilgandir."
        ]
    },
    {
        "word": "Rukn",
        "type": [],
        "definition": [
            "Bir narsaning vujudga kelishi unga bog'liq bo'lgan va o'zi o'shandan bir bo'lak bo'lgan narsadir. Misol uchun, sajda namozning ruknlaridan biridir. Sajda bo'lmasa, namoz vujudga kelmaydi. Shu bilan birga, sajda namozning bir bo'lagi bo'lgani uchun, uning ichida qilinadi"
        ]
    },
    {
        "word": "Ruknul Yamoniy",
        "type": [],
        "definition": [
            "Pyknyl Yamoniy, tavof yo'nalishi bo'yicha hisoblaganda, Ka'baning Hajapul Acvadga yaqin qolgan burchagidir"
        ]
    },
    {
        "word": "Rukona ibn Abduyaziyd",
        "type": [],
        "definition": [
            "Rukona ibn Abduyaziyd ibn Hoshim ibn Muttalib ibn Abdumanof al-Matlabiy.\r\n    Bu zot Islomga kirishlaridan oldin Rasululloh sollallohu alayhi vasallam bilan kurashga tushgan, mana shu ishlari u kishining Islomga kirishlariga sabab bo'lgan edi. Bu zot Madinada istiqomat qildilar. Usmon roziyallohu anhuning xalifalik davrlarigacha ana shu yerda yashadilar.\r\n    Rukona ibn Abduyaziyd roziyallohu anhu hijratning 41-sanasida vafot etdilar."
        ]
    },
    {
        "word": "Rukuʼ",
        "type": [],
        "definition": [
            "'Ruku'' lug'atda 'egilish' ma'nosini bildiradi. Shariatda esa, bosh va orqa ila qo'li tizzasiga yetguncha engashishga 'ruku'' deyiladi. Ruku'ning eng ozi ikki kaftining tizzalariga yetishidir. Mukammal ruku' esa, tizzalarini changallab ushlagan holda orqasi va bo'ynini to'g'rilab tep-tekis bo'lishini ta'minlash."
        ]
    },
    {
        "word": "Ruqayyot",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Ruqbaa",
        "type": [],
        "definition": [
            "'Ruqbaa' lug'atda muroqabot 'kutib turish' ma'nosini bildiradi. Ya'ni 'Bu narsa senga, sen oldin o'lsang, menga qaytadi, men oldim o'lsam, senda qoladi', degani bo'ladi."
        ]
    },
    {
        "word": "Ruqya",
        "type": [],
        "definition": [
            "Ruqya – turli yomonliklardan panoh so'rab, shuningdek, og'riq, qo'rqinch, shayton va sehrdan tuzalishni so'rab o'qiladigan zikrlar. Bularni o'qib, dam solish ham ruqya deyilaveradi."
        ]
    },
    {
        "word": "Rum surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 60 oyatdan iborat.\r\n    Bu surai karimaning boshida Rumning g'alabasi haqida bashorat keladi. Sura 'Rum' deb nomlanishining boisi shundan. Rum mashhur davlat va katta imperatorlikning nomi bo'lib, hozirgi o'zbek tilida 'Rim' shaklida qo'llaniladi.\r\n    Musulmonlar bilan mushriklar orasidagi ziddiyat hayotning turli jabhasida keng tarqalgan edi. Dushmanlikka odatlanib qolgan mushriklar musulmonlarga ozor berish uchun har bir fursatdan foydalanardilar. O'sha vaqtning ikki yetakchi davlati bo'lmish Rum va Fors imperatorliklari orasida o'zaro tortishuv, urush-janjal tinimsiz davom etardi. Ularning bu tortishuvlarini arablar ham kuzatib turar va o'zlaricha tarafdorlik ham qilar edilar. Rumliklar ahli kitob bo'lganlari sababli, musulmonlar ular taraf bo'ldilar. Majusiy forsliklarga esa dinlari o'xshash bo'lgan mushriklar tarafdorlik qilishdi.\r\n    O'sha paytdagi urushlarning birida Fors g'olib keldi. Bundan mushriklar cheksiz xursand bo'ldilar va 'Yaqinda biz ham musulmonlarni albatta yengajakmiz', deb gapira boshladilar. Ahli kitob bo'lmish rumliklarning mag'lubiyati musulmonlarni qattiq xafa qildi.\r\n    Shunda Alloh taolo Rum surasining avvalgi oyatlarini indirib, rumliklar sanoqli yillar ichida g'alabaga erishajaklari va bundan mo'minlar xursand bo'lishlari haqida bashorat berdi. Bu bashorat Qur'on mo''jizalaridan edi.\r\n    Suraning davomida iymon va kufr orasidagi kurash mavzusi rivojlanib boradi. Qadimdan haq va botil o'rtasidagi kurashda iymon tomoni g'olib kelayotgani, bundan keyin ham shunday bo'lishi haqida xabarlar beriladi. Bu ishda Allohning yagonaligiga, payg'ambarlikka, o'lgandan keyin qayta tirilishga va har kimga jazo yoki mukofot berilishiga iymon keltirish muhim o'rin tutishi uqtiriladi.\r\n    Surada iymon va kufr ahli orasidagi kurashda iymon ahlining g'alaba qozonishi aniq ekani bilan birga, ularning oxiratda ham najotga, ulkan yutuqqa erishishlari alohida ta'kidlanadi. Shuningdek, bu dunyoda mag'lub bo'lgan kufr ahlining u dunyoda ham yomon oqibatga duchor bo'lib, do'zax azobini tortishlari muqarrar ekani bayon qilinadi.\r\n    Rum surasida Allohning vahdoniyatiga va cheksiz qudratiga dalolat qiluvchi borliqdagi mavjudotlar va g'aybiy dalillar haqida ham so'z yuritiladi. Alloh taologa ibodat qiluvchilar bilan but-sanamlarga sig'inuvchilar orasidagi farq misollar bilan tushuntiriladi.\r\n    Surai karimaning so'ngida ilohiy oyatlar va ogohlantirishlardan ibrat olmayotgan Quraysh kofirlari haqida so'z yuritilib, Payg'ambar sollallohu alayhi vasallamga va mo'minlarga tasalli beriladi.\r\n    Rasululloh sollallohu alayhi vasallam payg'ambarliklarining beshinchi yili (milodiy 613 yil) Rum va Fors imperatorliklari orasida juda katta qonli urush ro'y berdi. O'sha paytda Forsga Xusrav II, Rumga Herakl podshohlik qilishardi. Bu ikki davlatning o'ziga yarasha yerlari, askariy kuch-quvvatlari bor edi. O'sha davrda Falastin, Suriya, Misr, Iroqning bir qismi va Kichik Osiyo Rumga tobe edi. Mazkur urushda forsliklar Rumga ikki tomondan hujum qildilar. Dajla va Furot daryolari bo'ylab Suriya yerlariga, Ozarbayjon va Armaniston tarafdan Kichik Osiyoga bostirib kirdilar. Fors lashkarlari Rum kuchlarini ikki jabhada ham yengib, dengizgacha ta'qib etib bordilar. Ular Suriyadagi nasorolarning barcha muqaddas shaharlarini egalladilar. Milodiy 614 yili butun Falastinni, jumladan, Quddusni ham qo'lga oldilar. Urush davomida barcha kanisalar yiqitildi, diniy binolar xarob etildi. Forsliklar yigirma olti ming nafar yahudiyni va oltmish mingdan ziyod xristianni qilichdan o'tkazdilar. Fors podshohi saroyiga o'ldirilgan odamlardan o'ttiz mingining kallalari keltirildi.\r\n    Urush harakatlari Misrga ham yetib bordi. Milodiy 616 yili forsliklar Nil vodiysini ishg'ol etdilar. So'ngra Iskandariyaga yurish qildilar. Boshqa tomondan esa butun Kichik Osiyoni qo'lga kiritib, o'sha paytdagi Rum poytaxti Kustantaniyaga (Konstantinopolga), uning oldidagi bo'g'ozga yetib keldilar. Forsliklar qayerni bosib olsalar, o'sha yerda otashparastlik ibodatxonasini qurar va shu yo'l bilan xristianlikning o'rniga otashparastlikni joriy qilar edilar. Bu katta mag'lubiyatdan so'ng Rum imperatorligiga qarashli bir qancha viloyat va o'lkalarda markaziy davlatga qarshi isyon ko'tarildi. Afriqo va Yevropadagi bir qancha o'lkalar, hatto poytaxtga qo'shni bo'lgan ba'zi o'lkalar ham imperiya qaramog'idan chiqqanlarini e'lon qildi. Qisqasi, sharqiy Rum imperatorligi parchalandi. Lashkar tarqalib ketdi. Xazina bo'shab qoldi. Imperator Herakl poytaxtni tark etib, Qartajaga qochdi. G'alabadan sarxush bo'lgan forsliklar bir qancha shartlarni qo'ydilar. Imperator forsliklarga, jumladan, ming yuk tilla, ming yuk kumush, ming yuk ipak, mingta ot, mingta ayol berishi shart edi. Rum imperatorligi bu talablarning hammasini so'zsiz qabul qildi. O'zaro shartnoma imzolandi.\r\n    Rumliklarning vakillari to'lovlarni to'lashga roziliklarini bildirish uchun Xusravning oldiga kirganlarida, u:\r\n    'Bu yetarli emas, Imperator Heraklning o'zi zanjirband holda kelib, xochga osilgan xudosini qo'yib, otashga va quyoshga topinishini istayman', – dedi.\r\n    Xullas, rumliklarning mag'lubiyatini eshitgan Makka mushriklari cheksiz quvondilar va musulmonlarga: 'Siz va rumliklar ahli kitobsizlar, biz va forsliklar ahli kitob emasmiz, bizning sheriklarimiz sizning sheriklaringizni yengdi, endi biz ham sizlarni yengamiz', – dedilar.\r\n    Ana shunda Alloh taolo Rum surasining avvalgi oyatlarini nozil qildi"
        ]
    },
    {
        "word": "Ruma",
        "type": [],
        "definition": [
            "Ruma – Madinadagi buloq yoki quduqning nomi. Ruma aslida buloq bo'lgan. Musulmonlar Madinaga kelganlarida bu yerning suvi ularga yoqmagan. Shunda Rasululloh sollallohu alayhi vasallam musulmonlarni mana shu buloqni sotib olishga chaqirganlarida, Usmon roziyallohu anhu uni 35000 dirhamga sotib olgan. Keyin uni qazib, kengaytirgan."
        ]
    },
    {
        "word": "Rusgʻ",
        "type": [],
        "definition": [
            "'Rusg'' so'zi arabcha bo'lib, bilak bilan kaftning qo'shilish bo'g'inidagi bir oz turtib chiqib turadigan suyakka aytiladi."
        ]
    },
    {
        "word": "Ruhoniy",
        "type": [],
        "definition": [
            "din arboblari"
        ]
    }
]