[
    {
        "word": "Sabaʼ surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 54 oyatdan iborat.\r\n    Bu surai karimada Saba' (Yaman) podshohlari qissasi kelgani uchun u ushbu nom bilan atalgan.\r\n    Boshqa makkiy suralar kabi, bunda ham asosan aqiyda, iymon-e'tiqod masalasi muolaja qilinadi. Xususan, Alloh taoloning vahdoniyati, vahiysi, iymon va o'lgandan keyin tirilish haq ekaniga ishonch masalalariga alohida e'tibor beriladi.\r\n    Sura Alloh taologa hamdu sano va maqtovlar hamda Uning barkamol sifatlarining tavsifi bilan boshlanadi. So'ngra mushriklarning oxiratni, o'lgandan keyin qayta tirilishni inkor etishlari zikr etilib, ularning shak va shubhalariga yarasha javob qaytariladi.\r\n    Keyin esa Dovud alayhissalomning va u kishining o'g'illari Sulaymon alayhissalomning qissalari keladi. Alloh taoloning ne'matlariga ular qanday shukr keltirganliklari va oqibatda Allohning marhamatiga erishganliklari bayon qilinadi.\r\n    Bunga muqobil, saba'liklarning Alloh taolo bergan ne'matlarga shukr qilmasdan, manmanlikka berilganlari oqibatida qanday kunlarga duchor bo'lganlari aytiladi.\r\n    Shuningdek, surada mushriklarning Alloh taologa shirk keltirishlari bayon qilinib, bu ulkan zulmlarining mohiyati hujjat va dalillar bilan fosh etiladi.\r\n    Keyin vahiy va payg'ambarlik mavzusiga o'tiladi. Odamlarning bu ikki muhim masalaga munosabatlari muolaja qilinadi. Kofir va mushriklarning shak-shubhalariga qarshi hujjat va dalillar keltiriladi."
        ]
    },
    {
        "word": "Sabboba ",
        "type": [],
        "definition": [
            "O'ng barmoq panjalarini tugib, bosh barmoq yonidagi ko'rsatgich barmoq ila ishora qilish. O'sha barmoqni arabchada 'sabboba' deyiladi. Shuning uchun, tashahhudda qilinadigan ishorani ham 'ishorai sabboba' deyiladi. 'Ishorai sabboba' tashahhudda 'Ashhadu allaa ilaaha' deganda 'Laa ilaaha'ni aytayotganda ko'rsatgich barmoqni yuqoriga ko'tarish va 'Illallohu'ni aytganda tushirish bilan bo'ladi. O'sha barmoqni ko'tarishda boshqa barmoqlarni yig'ib olinadi."
        ]
    },
    {
        "word": "Sabiyl ",
        "type": [],
        "definition": [
            "'sabiyl' arabchada 'yo'l' ma'nosini anglatadi."
        ]
    },
    {
        "word": "Sabiyr ",
        "type": [],
        "definition": [
            "'Sabiyr' Muzdalifa yaqinidagi tog'ning nomi. Mushriklar Muzdalifadan quyosh chiqqanidan keyin tushishar edi. Ungacha, Sabiyr tog'iga nido qilib, uning yoritishini so'rashar edi. Payg'ambar sollallohu alayhi vasallam ularga xilof qilib, Muzdalifadan quyosh chiqishidan oldin tushishni joriy qildilar."
        ]
    },
    {
        "word": "Sabir ",
        "type": [],
        "definition": [
            "Sabir – Muzdalifadan Minoga qarab yurganda cHar tomondagi katta tog'"
        ]
    },
    {
        "word": "Sabo",
        "type": [],
        "definition": [
            "Arab tilida 'sabo' deb sharqdan esgan shamolga, 'dabur' deb esa g'arbdan esgan shamolga aytiladi."
        ]
    },
    {
        "word": "Saboh ",
        "type": [],
        "definition": [
            "'Saboh!' – dushman to'satdan hujum qilganini ko'rib qolgan kishi atrofdagilarni ogohlantirish uchun aytadigan so'z. Dushman ko'pincha tongda hujum qilgani uchun 'Saboh!' deb aytish odat bo'lib qolgan."
        ]
    },
    {
        "word": "Sabr qasami",
        "type": [],
        "definition": [
            "'Sabr qasami' ‒ egasidan o'tashi talab qilinadigan, hatto o'tashga majburlash uchun egasi hibsga olinadigan qasam. 'Sabr' so'zi ushlab turish, hibsga olish degan ma'nolarni bildirgani uchun bu qasam shunday nom olgan."
        ]
    },
    {
        "word": "Savbon roziyallohu anhu",
        "type": [],
        "definition": [
            "Savbon ibn Yujdudning kunyalari Abu Abdulloh bo'lgan. O'zlari Rasululloh sollallohu alayhi vasallamning xizmatkorlaridan bo'lib, Yaman bilan Makka orasidagi Sirot degan joydan edilar. Rasululloh sollallohu alayhi vasallam bu kishini sotib olib:\r\n    'Agar biz bilan bir oilada yashashni xohlasang, biz bilan yashagin. Agar boshqa kishi bilan yashashni xohlasang, ixtiyor o'zingda, sen ozodsan' deganlarida, bu zot Rasululloh sollallohu alayhi vasallam bilan qolishni ixtiyor qildilar. Savbon roziyallohu anhu Payg'ambarimiz alayhissalom vafot etgunlariga qadar u zotning xizmatlarida bo'ldilar.\r\n    Savbon roziyallohu anhu hammasi bo'lib 128ta hadis rivoyat qildilar. Bu zotdan Shaddod ibn Avs, Jubayr ibn Nufayr, Abu Idris Havloniy, Abu Salom Habashiy, Ma'don ibn Abu Tolha, Abul Ash'as Sa'oniy, Abu Asmo Rahabiy, Abu Xayr Yazaniy va boshqalar rivoyat qilganlar.\r\n    Bir kuni Rasululloh alayhissalom sahobalardan:\r\n    'Qaysi biringiz 'Kishilardan hech narsa so'ramayman' deb va'da beradi? Men ana shu kishining jannatga kirishiga kafilman', deb so'raganlarida bu va'dani Savbon berdilar va hayotlarining oxirigacha hech kimdan hech narsa so'ramadilar'.\r\n    Bu zot Misr fathida ishtirok etdilar. Shomda va Falastinning Ramla degan joyida istiqomat qildilar. So'ngra bu yerdan Xumsga ko'chib o'tdilar. Hijratning 54-sanasida ana shu yerda vafot etdilar. Savbon ibn Yujdud rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Savbon roziyallohu anhu Payg'ambarimiz sollallohu alayhi vasallamning xizmatlarida yurgan paytlarida, bir kuni odamlar u kishidan Allohga eng mahbub amal haqida so'radilar. U kishi sukut saqlab, jim qoldilar. Yana savol berildi. Savbon roziyallohu anhu yana jim edilar. Odamlar Allohga eng mahbub amal haqida uchinchi marta so'raganlarida, ushbu biz o'rganayotgan hadisni ayt¬dilar."
        ]
    },
    {
        "word": "Savdoning asli",
        "type": [],
        "definition": [
            "'Savdoning asli' deganda uning rukni va mahalli ko'zda tutiladi."
        ]
    },
    {
        "word": "Savdoning vasfi",
        "type": [],
        "definition": [
            "'Savdoning vasfi' uning rukni va mahallidan tashqari narsalaridir. Misol uchun, noto'g'ri shart yoki yo'q narsani sotish kabilar."
        ]
    },
    {
        "word": "Savdoning mahalli",
        "type": [],
        "definition": [
            "'Savdoning mahalli' deganda savdo moli ko'zda tutiladi."
        ]
    },
    {
        "word": "Savdoning rukni",
        "type": [],
        "definition": [
            "Savdoning rukni iyjob va qabuldan iboratdir."
        ]
    },
    {
        "word": "Savob ",
        "type": [],
        "definition": [
            "yaxshilik, ezgulik, ajr."
        ]
    },
    {
        "word": "Sadaqa ",
        "type": [],
        "definition": [
            "Zakotning bir nomi 'sadaqa'dir. Bizda 'sadaqa' so'zi ixtiyoriy xayr-ehsonga nisbatan aytilsa ham, arabchada zakotni bildiradi. Zakotni 'sadaqa' deyish, sadaqa so'zida 'tasdiq' ma'nosi borligi uchundir. Chunki, o'z molidan iymon-ixlos bilan zakotni chiqarib berish mazkur odamning iymoni haqiyqiy ekanining tasdig'idir."
        ]
    },
    {
        "word": "Sadar tavofi",
        "type": [],
        "definition": [
            "'Sadar tavofi' – qaytish tavofi degani bo'lib, Vidolashuv tavofining ikkinchi nomi. U hajdan qaytish oldidan qilingani uchun shunday deb ham nomlangan"
        ]
    },
    {
        "word": "Saduq ",
        "type": [],
        "definition": [
            "rostgo'y, hadis roviylarning ijobiy sifatlaridan biri"
        ]
    },
    {
        "word": "Sajda ",
        "type": [],
        "definition": [
            "'Sajda' so'zi lug'atda 'bo'ysunish', 'hokisorlik', 'o'zini past olish' va 'mayl' ma'nolarini bildiradi. Shariatda namozxonning ochiq peshona va burnini yerga qo'yishi 'sajda'dir."
        ]
    },
    {
        "word": "Sajda oyatlari",
        "type": [],
        "definition": [
            ". 'A'rof' oxiridagi ikki yuz oltinchi oyat. 2. 'Ra'd'dagi o'n beshinchi oyat. 3. 'Nahl'dagi qirq to'qqizinchi oyat. 4. 'Bani Isroil'('Isro')dagi bir yuz to'qqizinchi oyat. 5. 'Maryam'dagi ellik sakkizinchi oyat. 6. ' Haj'ning birinchisi, ya'ni, o'n sakkizinchi oyat. 7. 'Furqon'dagi oltmishinchi oyat. 8. 'Naml'dagi yigirma oltinchi oyat. 9. 'Sajda'dagi o'n beshinchi oyat. 10. 'Sod'dagi yigirma to'rtinchi oyat. 11. 'Fussilat'dagi o'ttiz yettizinchi oyat. 12. 'Najm'dagi oltmish ikkinchi oyat. 13. 'Inshiqoq'dagi yigirma birinchi oyat. 14. 'Alaq'dagi o'n to'qqizinchi oyat."
        ]
    },
    {
        "word": "Sajda surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 30 oyatdan iborat.\r\n    Bu surai karimaning 'Sajda' deb nomlanishiga sabab shuki, sura oyatlarining birida mo'min bandalarning Alloh taologa sajda qilishlari vasf etiladi. Nom shu oyati karimadan olingan.\r\n    Sajda surasi boshqa makkiy suralar kabi asosan aqiyda masalasiga bag'ishlangandir. Xususan, ushbu surada Alloh, oxirat kuni, ilohiy kitoblar, payg'ambarlar, qayta tirilish va hisob-kitob mavzulari haqida gap boradi. Ular boshqa suralardan farqli ravishda, o'ziga xos uslub bilan muolaja qilinadi. Shuningdek, bu surada insoniyat tarixida yangi ummat – Islom ummati tug'ilgani ham e'lon etiladi. Bu yangi ummat a'zolari qanday sifatlarga ega ekani aytiladi.\r\n    Sajda surasining avvalida Qur'oni Karim Alloh tomonidan kelgan haq Kitob ekani esga olinadi. Shu bilan birga, Payg'ambarimiz Muhammad sollallohu alayhi vasallamning haq payg'ambar ekanliklari ta'kidlanadi. Bu haqdagi kofir va mushriklarning shubhalari mutlaqo bema'niligi ochib tashlanadi.\r\n    So'ngra Alloh taoloning yagona ilohligi, har bir narsaga qodir Zot ekani dalil va hujjatlar bilan isbotlanadi.\r\n    Surada tilga olingan qayta tirilish va oxiratdagi hisob-kitob masalasida ham kofir va mushriklar qo'zg'agan shak-shubhalarga yetarli va qoniqarli javoblar beriladi. Qiyomat kuni manzaralari tasvirlanib, kishilarning qalbiga ta'sir o'tkaziladi. U Kunda kofir va osiylarning qanday azoblarga uchrashlari-yu, mo'min va muttaqiylarning qanday mukofotlarga erishishlari aytiladi.\r\n    So'ngra Muso alayhissalom haqida so'z ketib, u zot bilan Muhammad sollallohu alayhi vasallamning payg'ambarliklari bir xil ekani bayon qilinadi. U kishilarning sabri haqida so'z yuritiladi.\r\n    O'tgan zamonda g'ofil bo'lib, kufr bilan o'tganlarning oqibati nima bo'lgani eslatib o'tiladi.\r\n    Nihoyat, sura kofir va mushriklarning qiyomat kuni qachon bo'lishi haqidagi savollariga javob berish bilan tamomlanadi."
        ]
    },
    {
        "word": "Sayd ",
        "type": [],
        "definition": [
            "Sayd – ovlangan hayvon"
        ]
    },
    {
        "word": "Sayyod ",
        "type": [],
        "definition": [
            "Ovchi"
        ]
    },
    {
        "word": "Sayyid Sharif Jurjoniy",
        "type": [],
        "definition": [
            "Amir Temur davrida Samarqandda yashab, ilmiy harakatda ishtirok etgan va butun dunyoga dong'i ketgan allomalardan yana biri Sayyid Sharif Jurjoniy rahmatullohi alayhidir.\r\n    Bu ulug' zotning to'liq ismi Imom Fozil Alloma Sayyid Sharif Abulhasan Ali ibn Muhammad ibn Ali Jurjoniy Husayniydir. Ismdan ko'rinib turibdiki, bu kishining nasablari imom Husayn ibn Ali roziyallohu anhuga yetib boradi.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi Jurjonning Astrobod viloyatiga qarashli Toku shahrida hijriy 740 sana, sha'bon oyining 24-kuni (milodiy 1340 sana, mart oyining 2-kuni) tavallud topgan. Sayyid Sharif Jurjoniy rahmatullohi alayhi Rasululloh sollallohu alayhi vasallamning sulolalaridan bo'lib, u kishi bilan Muhammad sollallohu alayhi vasallamning oralarida o'n uchta ota bordir. U kishi hijriy 287, milodiy 900 yili vafot etgan imom Muhammad ibn Zayd Do'iy rahmatullohi alayhining avlodidandir.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi boshlang'ich ilmlarni o'zi tug'ilgan vatanida oldi. So'ngra taxminan hijriy 762 sanada ilm talab etish niyatida Hirotga safar qildi. U kishining bu safardan ko'zlagan niyati mashhur olim Qutbiddin Roziy Tahtoniyga shogird tushib, u zotning mantiq ilmi bo'yicha yozgan 'Sharhush shamsiya' va 'Sharhul Matole'' nomli kitoblarini o'zidan ta'lim olib, o'qish edi. Ma'lum muddatdan so'ng shayx Qutbiddin Roziy Tahtoniy Sayyid Sharif Jurjoniy rahmatullohi alayhiga yoshi ulg'ayib qolganini bahona qilib, uzr aytdi va Misrga borib, o'zining mantiq ilmida ko'zga ko'ringan shogirdi Muborakshohdan dars olishni tavsiya qildi.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi shayx Qutbiddin Roziy Tahtoniy rahmatullohi alayhining tavsiyasiga amal qilib, ilm ilinjida Misr tomon ravona bo'ldi. U kishi bu safari davomida Onado'li diyoridan ham o'tdi. O'sha yerda o'zi shuhratini yaxshi bilgan va haqida odamlarning maqtovini eshitgan mashhur olim shayx Jamoliddin Oqsaroiydan ilm olmoqchi bo'ldi. Odamlar shayx Jamoliddin Oqsaroiyni kitob yozishdan ko'ra dars berishga usta, deb maqtashgan edi. Sayyid Sharif Jurjoniy rahmatullohi alayhi Oqsaroyga borib, shayx Jamoliddin Oqsaroiy rahmatullohi alayhining vafot etganidan xabar topdi.\r\n    So'ngra Sayyid Sharif Jurjoniy rahmatullohi alayhi shayx Jamoliddin Oqsaroiyning shogirdi Mulla Fanoriy bilan birga Misr tomon yurishini davom ettirdi. U kishi safar mashaqqatlarini chekib, oxiri o'zi ko'zlagan Misr diyoriga yetib bordi.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi Misrda o'n yilcha yashab, katta olimlardan dars oldi. U kishi aqliy ilmlarni asosan shayx Muborakshoh rahmatullohi alayhidan o'rgandi. Naqliy ilmlarni esa Akmaliddin Bobartiy rahmatullohi alayhidan ta'lim oldi.\r\n    Sayyid Sharif Abulhasan Ali ibn Muhammad ibn Ali Jurjoniy Husayniy rahmatullohi alayhining o'sha davrda talabalikdagi sheriklari ichida shayx Badriddin Simoviy, shoir Ahmadiy va Toyyib Hoji Poshsha kabi keyin mashhur bo'lgan zotlar ham bor edi.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi Misrda turgan paytida katta olim bo'lib yetishdi va kitob yozish ishlarini ham boshlab yubordi. U kishining hayoti va ilmiy faoliyatini yaxshilab o'rgangan tarixchilarning ta'kidlashlaricha, Sayyid Sharif Jurjoniy rahmatullohi alayhi o'sha paytda Qutbiddin Roziyning 'Sharhi Matoli'ul anvor' kitobiga hoshiya yozgan.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi Misrda ilm olishni tugallaganidan keyin o'sha zamonda usmoniylar davlatining markazi bo'lmish Bursa shahri orqali o'z ona vataniga qaytdi.\r\n    Bu yerda Allomai Taftazoniy rahmatullohi alayhi u zotni o'sha yerning podshohi Shoh Shujo'ga tanishtirdi. Podshoh Sayyid Sharif Jurjoniy rahmatullohi alayhini 'Dorush shifo' madrasasiga mudarris qilib tayinladi. U zot ushbu dargohda o'n yil davomida dars berdi, fatvo bilan mashg'ul bo'ldi va kitoblar yozdi. Asta-sekin Sayyid Sharif Jurjoniy rahmatullohi alayhining shuhrati atrofga tarqaldi. U kishi ayniqsa aqliy ilmlarning allomasi sifatida keng doirada mashhur bo'ldi.\r\n    Hijriy 789, milodiy 1378 sanada Sherozni zabt etgan Amir Temur Ko'ragoniy Sayyid Sharif Jurjoniy rahmatullohi alayhini o'zi bilan Samarqandga olib ketdi. Amir Temur Sayyid Sharif Jurjoniy rahmatullohi alayhini mudarrislarning boshlig'i mansabiga qo'ydi. Samarqandda o'tgan o'n sakkiz yillik davr u zotning buyuk hayotlarining eng samarali yillari bo'ldi, desak mubolag'a qilmagan bo'lamiz. U kishi o'zining ko'plab asarlarini aynan Samarqandda yozdi. Ko'pchilikka turli ilmlardan darslar berib, mashhur shogirdlarini tarbiyalab yetishtirdi. O'sha vaqtning Allomai Taftazoniy rahmatullohi alayhi kabi mashhur allomalari bilan turli ilmiy munozaralar, bahslar va so'zlashuvlar o'tkazdi.\r\n    Amir Temur Ko'ragoniy Sayyid Sharif Jurjoniy rahmatullohi alayhini olimligi uchun nihoyatda hurmat qilar edi. Olimlarning ichida sayyid va shariflardan – Nabiy sollallohu alayhi vasallamning nasablaridan bo'lganligi uchun, yana alohida e'zozlar edi. Shuningdek, ulamolar orasida ham Sayyid Sharif Jurjoniy rahmatullohi alayhining e'tiborlari yuqori edi.\r\n    Sayyid Sharif Abulhasan Ali ibn Muhammad ibn Ali Jurjoniy Husayniy rahmatullohi alayhi Samarqandda Xoja Alouddin Attor Buxoriy rahmatullohi alayhi bilan tanishib, birga bo'ldilar. U kishi Xoja Bahouddin Naqshband rahmatullohi alayhining xalifalaridan edilar. U kishi bilan tanishuv Sayyid Sharif Jurjoniy rahmatullohi alayhida tasavvufga alohida ahamiyat bilan qarash hissini uyg'otdi va naqshbandiya tariqatiga mansub bo'ldi.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi Samarqandda naqshbandiya tariqatining yana bir ulkan namoyandasi Mavlono Nizomiddin Xomush rahmatullohi alayhi bilan do'st bo'ldi va u kishining tasavvuf majlislarida faol ishtirok etdi.\r\n    Hijriy 807, milodiy 1405 yili Amir Temur vafot etdi. So'ngra Sayyid Sharif Jurjoniy rahmatullohi alayhi o'z ona vatani Sherozga qaytib ketdi va umrining oxirigacha ilmiy faoliyatini davom ettirdi.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi Sherozda hijriy 816 sanada, robiy'us soniy oyining oltinchisida (m.1413 yil, 14 iyul) chorshanba kuni vafot etdi. Haq subhanahu va taolo u zotni rahmat qilsin!"
        ]
    },
    {
        "word": "Sayf as-Samarqandiy as-Sutxaniy",
        "type": [],
        "definition": [
            "Abu Kasir Sayf ibn Hafs as-Samarqandiy as-Sutxaniy Buxoroning Sutxan qishlog'ida yashaganlar. Abu Muhammad ibn Hibbon ibn Muso al-Kushmihaniy va Ali ibn Ishoq al-Hanzaliydan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Muhammad ibn Nasr ash-Sharg'iy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Sayhon as-Samarqandiy al-Ushtobdiziy",
        "type": [],
        "definition": [
            "Abu Muhammad Sayhon ibn Husayn as-Samarqandiy al-Ushtobdiziy adib edilar. Abu Ja'far Muhammad ibn Iso al-Varroqdan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Sakina ",
        "type": [],
        "definition": [
            "Sakina – lug'atda xotirjamlik, sokinlik degani. Bu yerda zikr qilingan 'sakina' nima ekani xususida ulamolar turli fikrlar aygan. Ba'zilar uni mayin shamol desa, boshqalari farishtalar, degan. Ko'pchilik ulamolarning qarashlariga ko'ra, sakina Alloh taoloning xotirjamlik va rahmatni o'zida mujassam qilgan maxluqoti bo'lib, farishtalarning hamrohligida yuzaga keladi."
        ]
    },
    {
        "word": "Salavot ",
        "type": [],
        "definition": [
            "payg'ambar alayhissalomga bag'ishlab aytiladigan duolar majmuyi"
        ]
    },
    {
        "word": "Salam ",
        "type": [],
        "definition": [
            "'Salam' lug'atda 'taslim qilish', 'berish' ma'nosini ang-latadi. Shariatda esa, zimmadagi vasf qilingan molning qiymatini oldindan berishga aytiladi. Bunday savdoni 'salaf' ham deyiladi, bu 'qiymati oldin berilgan' degan ma'noni anglatadi. Bu savdo hojat tushganda, ribo aralashmasligi sharti ila joiz. Ya'ni, oldi-sotdi qilinayotgan narsa bir xil bo'lmasligi va riboning boshqa ko'rinishlari ham aralashmasligi lozim."
        ]
    },
    {
        "word": "Salama al-Fuyozasuniy an-Nahviy",
        "type": [],
        "definition": [
            "Abu Solih Salama ibn Najm al-Fuyozasuniy an-Nahviy Buxoro ahlidan bo'lib, laqablari 'Salmavayh' edi. Abu Qarsosa Muhammad ibn Abdulvahhob al-Asqaloniydan hadis rivoyat qilganlar. Bu kishidan Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Salama as-Sulaymoniy al-Hofiz al-Paykandiy",
        "type": [],
        "definition": [
            "Abul Fazl Ahmad ibn Ali as-Sulaymoniy al-Hofiz al-Paykandiy Paykand ahlidan. Ahmad ibn Sulaymon al-Paykandiy ona tomondan bobolari bo'lganlari uchun bu kishiga 'As-Sulaymoniy' deb nisbat berilgan. Ko'p mamlakatda bo'lib, hofiz al-hadis sifatida tanilganlar. O'z zamonlarida u kishi hadislarning asosini (dalilini) keltirishda, hadislarni yoddan bilishda va aytgan hadislarining to'g'riligini isbotlashda tengi yo'q edilar. Muhammad ibn Sobir al-Buxoriy, Muhammad ibn Hamdavayh al-Marvaziy, Ali ibn Ishoq al-Basriy, Muhammad ibn Ya'qub al-Asam va boshqa olimlardan ta'lim olganlar. Ko'pgina kichik va katta hajmli kitob ta'lif qilganlar. Har haftada bir kitob yozib, Paykanddan Buxoroga olib kelib, Buxorodagi Masjidi Kalon jome' masjidida o'qib berar edilar. O'zlaridan Abu Zarr Muhammad ibn Ja'far (o'g'illari) va Abul Abbos Ja'far ibn Muhammad an-Nasafiy hadis rivoyat qilganlar. Abul Fazl Ahmad as-Sulaymoniy hijriy 311 (milodiy 924) yilda tavallud topib, hijriy 404 (milodiy 1014) yilning zulqa'da oyida Paykandda vafot etganlar."
        ]
    },
    {
        "word": "Salama ibn al-Akvaʼ",
        "type": [],
        "definition": [
            "Salama ibn Amr ibn Sino al-Akva' al-Aslamiy, kunyalari Abu Muslim. Rasululloh sollallohu alayhi vasallamga ikki marta daraxt ostida bay'at bergan sahobalardan. Rasululloh alayhissalom bilan yettita g'azotda ishtirok etganlar, 'Zuv-qard' nomli g'azotda Rasululloh sollallohu alayhi vasallamni dushmanlar zarbasidan saqlab qolganlar.\r\n    Usmon ibn Affonning xalifalik davrlarida Afrika g'azotlarida ishtirok etgan shijoatli kamonchi, chiroyli xulqli, oliyjanob sahobalardan edilar.\r\n    Hammasi bo'lib, Rasululloh sollallohu alayhi vasallamdan 77ta hadis rivoyat qildilar. Bu kishidan Madina ahlidagi jamoatlar, o'g'illari Iyos, qullari Yaziyd ibn Abu Ubayd va boshqalar rivoyat qilganlar."
        ]
    },
    {
        "word": "Salama ibn Soxr",
        "type": [],
        "definition": [
            "Salama ibn Soxr ibn Salmon al-Xazrajiy. Bu zot Biyoziy deb ham ataladi.\r\n    U zot Rasululloh sollallohu alayhi vasallamdan 'zihor' to'g'risidagi hadisni rivoyat qildilar. Bu zotddan Sa'iyd ibn Musayyib va boshqalar rivoyat qildilar."
        ]
    },
    {
        "word": "Salama roziyallohu anhu ",
        "type": [],
        "definition": [
            "Salama ibn Amr ibn Sino al-Akva' al-Aslamiy, kunyalari Abu Muslim. Rasululloh sollallohu alayhi vasallamga ikki marta bay'at qilgan sahobalardan.\r\n    U kishi Rasululloh sollallohu alayhi vasallam bilan yettita g'azotda ishtirok etganlar. 'Zuv-hard' g'azotida u zot sollallohu alayhi vasallamni dushmanlar zarbasidan saqlab qolganlar.\r\n    Usmon ibn Affonning xalifalik davrlarida Afrika g'azotlarida ishtirok etgan, shijoatli kamonchi hamda chiroyli xulqli, oliyjanob sahobalardan edilar.\r\n    Hammasi bo'lib, Rasululloh sollallohu alayhi vasallamdan 77ta hadis rivoyat qilganlar.\r\n    Bu kishidan Madina ahlidan ko'p jamoatlar, o'g'illari Iyos, qullari Yaziyd ibn Abi Ubayd va boshqalar rivoyat qilganlar.\r\n    Bu kishi rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Rasululloh sollallohu alayhi vasallam: 'Kuchlilarimiz ichida eng yaxshisi Salama ibn Akva'dir', deb marhamat qilganlar.\r\n    O'g'illari Iyos 'Otam hech yolg'on gapirmas edilar', deb aytadilar.\r\n     Bu zot Madinada istiqomat qildilar. Keyin Madinadan uch mil uzoqlikda joylashgan Rabza nomli qishloqqa ko'chib o'tdilar. Hijratning 74-sanasida 80 yoshlarida ana shu yerda vafot etdilar"
        ]
    },
    {
        "word": "Salasu rasoila fiy istihbobi duoi va rafʼul yadayni fiyhi baʼdas-salovotil maktuba",
        "type": [],
        "definition": [
            "shayx Abdulfattoh Abu Fudda rahmatullohi alayhining kitobi"
        ]
    },
    {
        "word": "Salaf ",
        "type": [],
        "definition": [
            "'Salaf' deganda, sahobalar, tobe'iiylar va diynda ularning yo'lidan borganlar ko'zda tutiladi."
        ]
    },
    {
        "word": "Salim al-Xudimankaniy",
        "type": [],
        "definition": [
            "Abu Umar Salim ibn Mujohid al-Xudimankaniy - Buxorodagi Xudimankan nomli qishlog'idan. U kishi Imom al-Buxoriy bilan suhbatdosh bo'lganlar."
        ]
    },
    {
        "word": "Salmo bint Muhammad ibn Muhammad Jazariy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qizlari"
        ]
    },
    {
        "word": "Salmon ibn Omir",
        "type": [],
        "definition": [
            "Salmon ibn Omir ibn Avs ibn Hajar ibn Amr ibn Horis az-Zabiy. Rasululloh sollallohu alayhi vasallamning suhbatlarida bo'lib, bir necha hadislar rivoyat qilganlar.\r\n    Bu kishidan Muhammad ibn Siyriyn, Abdulloh ibn Bashir va boshqalar rivoyat qildilar.\r\n    Dulobiy: 'Bu zot 100 yil umr ko'rib, 'Jamal' urushi kuni vafot etdilar', deydi."
        ]
    },
    {
        "word": "Salmon Forsiy",
        "type": [],
        "definition": [
            "Bu ulug' sahoba fors bo'lib, Islomga qadar majusiy va nasroniy diynida bo'lganlar. Kitob¬larda bu sahobaga 'Haq yo'l qidiruvchi' deb ta'rif berilgan.\r\n    Islomga kirganlaridan boshlab Islomga va Payg'ambarimiz Muhammad sollallohu alayhi vasallamga sidqidildan xizmat qildilar.\r\n    Salmon Forsiy roziyallohu anhu Xandaq jangidan boshlab, hamma janglarda ishtirok etdilar. Xandaq jangida u kishining maslahatlariga binoan Rasululloh sollallohu alayhi vasallam musulmonlarga xandaq qazib olishni buyurdilar.\r\n    Salmon Forsiy roziyallohu anhu hammasi bo'lib 60ta hadis rivoyat qildilar. Bu sahoba rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitob¬lariga kiritganlar. Salmon Forsiy roziyallohu anhu Umar ibn Xattobning xalifalik davrlarida (milodiy 656 yilda) vafot etdilar."
        ]
    },
    {
        "word": "Salotush Shuruq",
        "type": [],
        "definition": [
            "'Shuruq namozi' ham deyiladi. 'Shuruq' degani quyosh chiqishini bildiradi. Shuruq namozi choshtgoh namozining eng avvalgi vaqt-dagi namozidir."
        ]
    },
    {
        "word": "Salotush Shuruq",
        "type": [],
        "definition": [
            "'Shuruq namozi' ham deyiladi. 'Shuruq' degani quyosh chiqishini bildiradi. Shuruq namozi choshtgoh namozining eng avvalgi vaqt-dagi namozidir."
        ]
    },
    {
        "word": "Salʼ ",
        "type": [],
        "definition": [
            "Sal' – Madinai Munavvaradagi mashhur tog', Masjidi Nabaviyning sharqiy tomonida, taqriban 500 m. uzoqlikda joylashgan."
        ]
    },
    {
        "word": "Sammocha oʻranish",
        "type": [],
        "definition": [
            "'Sammocha o'ranish' deganda ma'lum suratda kiyinish nazarda tutiladi: a) en kiyimni qo'l-oyoqlarini ham qo'shib, butun tanasiga o'rab olish. Bunda kishi qo'llari erkin harakat qila olmagani sababli turli zararlardan o'zini himoya qila olmasligi mumkin. Shuningdek, qo'lini harakatlantirganda avrat joyining ochilib ketish ehtimoli ham bor. Ana shu sabablarga ko'ra bundan qaytarilgan. Bu ma'noni lug'atshunoslar tanlagan; b) en kiyimni bir yelkadan tashlab oladi-da, ikkinchi tomoni ochiq qoladi. Bu holatda harakat qilinganda avrat ochilib qoladi. Shu sababdan bunday kiyinishdan qaytarilgan. Bu ma'noni faqihlar tanlagan. Bu ikki holatda ham kiyimni yalang'och tanaga kiyish nazarda tutilgan."
        ]
    },
    {
        "word": "Samoviy betoharatlik",
        "type": [],
        "definition": [
            "Namozxonning ixtiyorisiz toharati ketib qolishi."
        ]
    },
    {
        "word": "Samoviy dinlar",
        "type": [],
        "definition": [
            "Samoviy dinlar deganda, Islom, masiyhiy va yahudiy diynlari tushuniladi."
        ]
    },
    {
        "word": "Samura ",
        "type": [],
        "definition": [
            "Samura – tikanli daraxtlar oilasiga mansub bo'lib, ularning ichida eng sifatli yog'och beradigan daraxt."
        ]
    },
    {
        "word": "Samura ibn Jundub",
        "type": [],
        "definition": [
            "Samura ibn Jundub ibn Hilol al-Fazoriy, kunyalari Abu Sulaymon. Basrada tavallud topdilar. Otalari vafot etgandan keyin onalari bilan Madinaga keldilar. Madinada katta bo'lib, ulg'aydilar va yana Basraga ko'chib o'tdilar.\r\n    Rasululloh sollallohu alayhi vasallamdan bir nechta hadislar rivoyat qildilar. Bu kishidan Sha'biy, Ibn Abu Laylo, Ali ibn Robiy'a, Abu Rajo va boshqalar rivoyat qilganlar. Bu zot rivoyat qilgan hadislarni uchta 'Sahih' sohiblari o'z kitoblariga kiritganlar. U kishi hijratning 60-yili Basrada vafot etdilar."
        ]
    },
    {
        "word": "Sanad ",
        "type": [],
        "definition": [
            "hadis roviylari silsilasi"
        ]
    },
    {
        "word": "Sanam",
        "type": [],
        "definition": [
            "Bosh-yuz qismi insonga o'xshash but"
        ]
    },
    {
        "word": "Saniyyatul-vadoʻ",
        "type": [],
        "definition": [
            "Madina yaqinidagi joy nomi. Hadislarda Hafyo bilan Saniyyatul-vado'ning orasi besh yoki olti mil deyilgan."
        ]
    },
    {
        "word": "Sanʼo",
        "type": [],
        "definition": [
            "San'o – ko'hna shaharlardan biri, qadimdan Yamanning poytaxti bo'lgan. Yamoma – Arab jazirasidagi qadimiy shaharlardan biri. U hozir Saudiya Arabistoni hududida, Najdning janubida joylashgan."
        ]
    },
    {
        "word": "Sargʻ ",
        "type": [],
        "definition": [
            "Sarg' – Tabuk vodiysiga qarashli shaharcha. Hijozning Shomga tutash tarafida joylashgan."
        ]
    },
    {
        "word": "Sardariy ",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan. Bu qishloqdan ulug' olimlar yetishib chiqqanlar"
        ]
    },
    {
        "word": "Sarid ",
        "type": [],
        "definition": [
            "Sarid – taom turi. Uni o'zbek tilida 'to'g'ramcha' deyish mumkin. Uning tayyorlanishi quyidagicha: suvga tuz solib, unda go'shtni ozgina suvi qolguncha, uzoq qaynatiladi. Keyin bug'doy nonni to'g'rab, ustidan go'shtning sho'rvasi quyiladi va go'shtini maydalab, nonning ustiga terib chiqiladi. So'ng ustidan ozgina sirka sepiladi. Sarid arablarning eng yoqimli va foydali taomlaridan hisoblangan."
        ]
    },
    {
        "word": "Sariyya ",
        "type": [],
        "definition": [
            "Sariyya – jang qilish yoki ma'lumot bilib kelish uchun dushman tarafga yuboriladigan kichik qo'shin (otryad). Odatda tunda yurilgani uchun 'sariyya' (tunda yuruvchi) deb atalgan."
        ]
    },
    {
        "word": "Sariqa ",
        "type": [],
        "definition": [
            "O'g'irilikni arablar 'sariqa' deydilar va u lug'atda 'bir narsani maxfiy ravishda, egasiga bildirmasdan olish' ma'nosini anglatadi. Shariatda esa: Mukallaf shaxsning zarb qilingan o'n dirham miqdoridagi birovning makondagi yoki qo'riqchisi bor, ehtiyotlagan va shubhasiz mulkini maxfiy ravishda olishi o'g'irlikdir."
        ]
    },
    {
        "word": "Sarif ",
        "type": [],
        "definition": [
            "Sarif – Makka yaqinidagi qishloq"
        ]
    },
    {
        "word": "Saroburda ",
        "type": [],
        "definition": [
            "Saroburda – chodirning atrofini o'rab turadigan qurilma. Uning eshigi bo'lib, chodirga u orqali kiriladi. U asosan podshohlar, sarkardalar va zodagonlarda bo'lgan."
        ]
    },
    {
        "word": "Sarf",
        "type": [],
        "definition": [
            "'Sarf' so'zi 'ziyoda' ma'nosini bildiradi. Shariatda: 'Sarf' naqd pulni naqd pulga, xoh bir jinsdan bo'lsin, xoh turli jinsdan bo'lsin, sotishdir. Ajrashmasdan turib ikki tarafdan qo'lma-qo'l oldi-berdi bo'lishi shart qilinadi."
        ]
    },
    {
        "word": "Safar ",
        "type": [],
        "definition": [
            "'Safar' lug'atda masofani kesib o'tish ma'nosini anglatadi. Hanafiy mazhabi o'lchoviga ko'ra, 96 km masofa safar masofasi hisoblangan."
        ]
    },
    {
        "word": "Safvon ibn Assol",
        "type": [],
        "definition": [
            "Bu sahoba Rasululloh sollallohu alayhi vasallam bilan 12ta g'azotda ishtirok etganlar. Kufada istiqomat qilganlar. Rasululloh sollallohu alayhi vasallamdan ko'p hadislar rivoyat qildilar.\r\n    Bu zotdan Abdulloh ibn Mas'ud, Zirr ibn Hubaysh, Abdulloh ibn Salama, Abu al-G'ofirlar rivoyat qilganlar."
        ]
    },
    {
        "word": "Safo va Marva tepaliklari orasida saʼy qilish",
        "type": [],
        "definition": [
            "Hanafiy mazhabi bo'yicha, bu amal ham hajning vojib amallaridan hisoblanadi. Bu ibodat tavofdan keyin bajariladi. Ikki tepalik orasida yetti marta borib kelinadi. Yurishni Safo tepaligidan boshlash shart. Alloh taolo Qur'oni Karimda oldin Safoni zikr qilgan. Safodan Marvagacha borish bir sa'y sanaladi, qaytish yana bir sa'y. Shu tariqa yettinchi sa'y Marvada tugaydi. Ikki tepalikning o'rtalarida yashil chiroqlar o'rnatilgan ikkita yashil ustun bor, shularning orasida tezlab Yurish kerak."
        ]
    },
    {
        "word": "Safrovot ",
        "type": [],
        "definition": [
            "Safrovot – Marruz-zahrondan keyin keladigan vodiylar yoki tog'liklar"
        ]
    },
    {
        "word": "Saffor ",
        "type": [],
        "definition": [
            "arabcha so'z bo'lib, miskar, mis buyumlar yasash, ularni tuzatish va sotish ishi bilan shug'ullanuvchi degan ma'noni anglatadi."
        ]
    },
    {
        "word": "Sahv sajdasi",
        "type": [],
        "definition": [
            "'Sahv' so'zi lug'atda 'unutish' ma'nosidadir. Namozda ma'lum bir amallar unutilsa, undan hosil bo'lgan nuqsonni sahv sajdasi qilish ila to'g'rilab olish imkoni bor. Bu ham Islom diyni yengillik diyni ekanligi, Alloh taolo musulmonlarga mehribon ekanligining yorqin dalilidir."
        ]
    },
    {
        "word": "Sahih ",
        "type": [],
        "definition": [
            "sog'lom, haqiqiy, ishonchli, to'g'ri, bexato; maqbul hadislarning birinchi turi; isnodi boshidan oxirigacha adolatli, aniqlik egasi bo'lgan kishining o'zi kabi bo'lgan kishidan rivoyat qilgan, o'zidan kuchliroq roviyga zid bo'lmagan illatsiz hadislar."
        ]
    },
    {
        "word": "Sahih savdo",
        "type": [],
        "definition": [
            "Asli va vasfi shar'iy bo'lgan, birovning haqi unga bog'liq va xiyori bo'lmagan savdo sahih bo'ladi."
        ]
    },
    {
        "word": "Sahihayn",
        "type": [],
        "definition": [
            "imom Buxoriy va imom Muslimning mashhur ikki kitobi: “Sahihi Buxoriy”, “Sahihi Muslim”."
        ]
    },
    {
        "word": "Sahihi Buxoriy",
        "type": [],
        "definition": [
            "'Sahihi Buxoriy' kitobi buyuk vatandoshimiz, muhaddislar imomi, hadis ilmi olimlarining ustozi imom Buxoriy qalamiga mansubdir. U zotning to'liq ismi Abu Abdulloh Muhammad ibn Ismoil ibn Ibrohim ibn Mug'iyra ibn Ahnaf Bardizbah Jo''fiy al Buxoriydir.\r\n    Imom Muhammad ibn Ismoil Buxoriy muhaddislar imomi, hadis ilmi olimlarining ustozidir. Imom Buxoriy hijriy 194 (milodiy 810) yili Buxoroda tug'ilgan. Yetimlikda o'sib, to'qqiz yoshda Qur'oni karimni to'la yod oldi. Hadis eshitishni yaxshi ko'rar, voyaga yetguncha yetmish ming hadisni yod olgan edi. O'n oltiga kirganida ona-bola haj safariga jo'nashadi, Muhammad hadis o'rganish maqsadida Makkada qoladi. Keyin ilm talabida Xuroson, Shom, Misr, Jazira va Hijoz o'lkalari, Basra, Bag'dod, Kufa kabi shaharlarda bo'ladi.\r\n    Imom Buxoriy jami olti yuz ming hadis to'plab, shundan yuz ming sahih, ikki yuz ming zaif hadisni yod olgan, bularni to'plashda mingdan ortiq shayxlarning huzurida bo'lgan. Ushbu hadislar ichidan sahihlarini aniqlab, ular asosida o'zining mashhur 'Al-Jome' as-sahih' kitobini o'n olti yilda yozib tugatgan. Ibn Hajarning hisobi bo'yicha, imom Buxoriy ushbu to'plamga 7397 mingdan ortiq sahih hadisni boblarga ajratib, tartibli ravishda jamlagan. U kishi har bir hadisni alohida g'usl qilib, ikki rak'at namoz o'qib, keyin kitobga qayd qilar edi.\r\n    O'z davrining atoqli ulamolaridan imom Hokim aytadi: 'Bu dunyo ostin-ustin qilib yuborilsa ham, Buxoriy kabi hadis biluvchi va uni yod oluvchi odam topilmaydi'. Rajo ibn Murajjo esa: 'Imom Buxoriy Allohning yerda yuruvchi mo''jizasi edi', degan. U imom Muslim, Termiziy, Nasoiy va boshqalarga ustoz bo'lgan. Bundan tashqari, Imomning 'Al-Musnad al kabir', 'At-Tarix al kabir', 'At-Tafsir al kabir', 'Al-Hadis an-Nabaviy', 'Kitobu asmoi sahoba', 'At-Tarix as-sag'ir', 'Xolqu af'oli ibod', 'Zuafous-sag'ir', 'Al-Adabu al mufrad' va boshqa yigirmadan ortiq asarlari bor.\r\n    Imom Buxoriy hijriy 256 (milodiy 870) yili Ramazon hayiti kechasi vafot etib, hayit kuni dafn qilindi. U kishining maqbaralari Samarqand yaqinidagi Xartang qishlog'ida bo'lib, hozirda u joyda muhtasham yodgorlik barpo qilingan."
        ]
    },
    {
        "word": "Sahihi Ibn Hibbon ",
        "type": [],
        "definition": [
            "Ushbu kitob 'Oltin silsila' majmuasiga kiritilgan so'nggi asar bo'lib, uning muallifi ham vatandoshimiz, ulug' olim imom Ibn Hibbon Bustiydir.\r\n    Abu Hotim Muhammad ibn Hibbon Ahmad at-Tamimiy al Bustiy rohimahuloh hijriy 270 (milodiy 884) yilda tavallud topgan bo'lib, o'z davrining taniqli muhaddislaridan, shofe'iy mazhabining faqihi edi. Imom Ibn Hibbon Samarqandda voyaga yetgan va bir muddat shu yerda qozilik qilgan. Keyinchalik Iroq, Xuroson, Movarounnahr, Shom, Hijoz o'lkalarini kezib, yetuk ustozlardan hadis o'rgangan. Ibn Hibbonning o'zi: 'Men Shoshdan Iskandariyagacha bo'lgan yerlarda ikki mingdan ortiq shayxdan hadis yozib olganman', degan. U Ibn Huzaymaning shogirdlaridan edi. Ibn Hibbon hadis ilmidan tashqari tib, falakiyot va boshqa tabiiy fanlardan ham xabardor bo'lgan. Uning 'Al Anvo vat-taqosim', uch jildli 'As-Siqot', 'Kitabus-sahoba', 'Ma'rifatul-majruhin minal-muhaddisiyn', 'Kitabul-ilal', 'Ashobut-tavorix', 'Kitabu atbo'it-tobe'iyn' kabi asarlari mashhur. Uning 'Al Anvo vat-taqosim' nomli hadis kitobi 'Sahihi Ibn Hibbon' nomi bilan yuritiladi.\r\n    Ibn Hibbon Islom tarixida shayxlari eng ko'p bo'lgan ulamo sifatida yuqori o'rinlarni egallaganlar. U zot o'z 'Sahih' kitoblarining muqaddimasida: 'Men Shoshdan Iskandariyagacha bo'lgan yerlarda 2000 dan ortiq shayxdan hadis yozib olganman', deganlar. Ana shu shayxlarning ichidan 217 tasini tanlab, ulardan olgan hadislarni 'Sahih' to'plamlariga kiritganlar. Ulardan 21 tasi siqa, sanadi oliy muhaddis bo'lib, Abu Ya'la Mosuliy, Ibn Xuzayma Nishopuriy va Imom Nasoiy kabi zabardast ulamolar bo'lgan. Ibn Hibbon aksariyat hadislarini mana shu zotlardan rivoyat qilganlar.\r\n     Ibn Hibbon rohimahulloh hijriy 354 yili (m. 965) shavvol oyidan sakkiz kun qolganda, juma kuni kindik qoni to'kilgan shahri Bustda vafot etganlar."
        ]
    },
    {
        "word": "Sahihi Muslim",
        "type": [],
        "definition": [
            "Bu asar imom Abu Husayn Muslim ibn Hajjoj ibn Muslim ibn Vard al Qushayriy an-Naysoburiy qalamiga mansubdir. Imom Muslim rohimahulloh atoqli hadis ilmi imomlaridan, fazilati jihatidan 'Sahihul Buxoriy'dan keyin turadigan 'Sahih' hadislar to'plamining muallifidir. Hijriy 206 (milodiy 821) yili Nishopurning (Naysobur) Qushayr qishlog'ida tug'ilgan. Iroq, Hijoz, Shom, Misr, Buxoro va boshqa o'lkalarda bo'lib, mashhur ulamolardan ta'lim olgan. U o'zining 'Sahihi Muslim' kitobida uch yuz ming hadis ichidan takrorsiz uch mingdan ortiq, takrori bilan yetti mingdan ziyod sahih hadis jamlagan. Ushbu kitob 'Olti sahih'ning ikkinchisi hisoblanadi. Abu Aliy Nishopuriy: 'Osmonning ostida Imom Muslimning kitobidan sahihroq kitob yo'q', degan.\r\n    Imom Termiziy imom Muslimdan ta'lim olib, ustozdan eshitgan hadislarni o'z kitobida rivoyat qilib keltirgan. Bir mavzuga tegishli hadislarning barchasini daqiqlik, sinchkovlik bilan kitobning bir joyida keltirgani uchun ba'zi Mag'rib ulamolari 'Sahihi Muslim'ni 'Sahihi Buxoriy'dan ustun ko'rishgan.\r\n    Imom Muslimning bundan tashqari 'Al-Jomi' al kabir alal-abvob', 'Kitabu al musnad al kabir', 'Kitabu asmoi va kuna', 'Kitabul-ilal', 'Kitabu tamyiz', 'Kitabu mashoyixi Molik', 'Kitabu avhomul muhaddisiyn', 'Kitabu tabaqotu at-tobe'in' va boshqa asarlari bor.\r\n    Imom Muslim 261 (milodiy 875) sanada Nishopurda vafot etgan va shu joyga dafn qilingan."
        ]
    },
    {
        "word": "Sahl al-Xatib",
        "type": [],
        "definition": [
            "Abul Maoliy Sahl ibn Mahmud al-Xatib - Muhammad al-Barroniyning o'g'illari. Makkai Mukarramada bir necha muddat yashaganlar. Ko'plar bu zotning ilmlaridan bahramand bo'lgan. Ko'p ibodat qiluvchi, tirishqoq, fozil imom, voiz edilar. Hijriy 524 (milodiy 1131) yilning jumodul avval oyida Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Sahl ibn Abi Hasma",
        "type": [],
        "definition": [
            "Sahl ibn Abdulloh ibn Abi Hasma al-Ansoriy al-Avsiy, kunyalari Abu Abdurrahmon. Rasululloh sollallohu alayhi vasallam vafot etganlarida yoshlari sakkizda edi.\r\n    Hadislarni Rasululloh sollallohu alayhi vasallamdan, Zayd ibn Sobit va Muhammad ibn Maslamalardan rivoyat qildilar.\r\n    Bu kishidan o'g'illari Muhammad, inilari Muhammad ibn Sulaymon ibn Abi Hasma, Nofe' ibn Jubayr, Urva ibn Zubayr va boshqalar rivoyat qildilar.\r\n    Ulug' zotlardan Abu Hotam ar-Roziy: 'Sahl daraxt ostida bay'at bergan sahobalardan edi. Bundan bu sahoba Badrdan tashqari hamma g'azotlarda ishtirok etganlar, degan xulosa chiqadi', deb aytganlar.\r\n    Bu zot Muoviya roziyallohu anhuning xalifalik davrining avvalida vafot etdilar"
        ]
    },
    {
        "word": "Sahl ibn Saʼd",
        "type": [],
        "definition": [
            "Sahoba Sahl ibn Sa'd roziyallohu anhu ansoriylardan, Xazraj qabilasidan edilar. Bu kishining avvalgi ismlari Huzn bo'lib, Rasululloh sollallohu alayhi vasallam uni Sahl degan ism bilan almashtirdilar.\r\n    Sahl ibn Sa'd hammasi bo'lib, 188ta hadis rivoyat qilganlar. Bu zotdan Abu Hurayra, Sa'd ibn Musayyib az-Zuhriy, Abu Hozim, o'g'illari Abbos ibn Sahllar rivoyat qildilar.\r\n    Bu zot hijratning 91-sanasidaa 100 yoshlarida Madinada vafot etdilar."
        ]
    },
    {
        "word": "Sahl ibn Hunayf",
        "type": [],
        "definition": [
            "Sahl ibn Hunayf ibn Vahb Avsiy al-Ansoriy, kunyalari Abu Sa'iyd.\r\n    Islomga birinchilardan bo'lib kirgan sahobalardan. Badr g'azotida ishtirok etganlar. Uhud g'azoti kuni aytilgan vazifada sobit turib, so'ng boshqa hamma g'azotlarda ishtirok etganlar. Muhojir Ali ibn Abu Tolib roziyallohu anhu bilan islomiy birodar bo'lganlar, Islom yo'lida hamma qiyinchiliklarga chidashga Rasululloh sollallohu alayhi vasallamga bay'at qilganlar.\r\n    Hazrati Ali Madinadan Basraga ko'chganlarida Sahl roziyallohu anhu u kishining o'rinlariga Madinada boshliq bo'lib qolganlar.\r\n    U kishi Siffiyn jangida Ali roziyallohu anhu bilan birga bo'lganlar, Fors shaharlariga voliy bo'lgan sahobalardan edilar.\r\n    Hammasi bo'lib, Rasululloh sollallohu alayhi vasallamdan 40ta hadis rivoyat qilganlar. U kishidan Abu Voil, Abiyd ibn Sabboq, Abdurrohman ibn Abu Laylo, o'g'illari Abu Umoma va boshqalar rivoyat qildilar.\r\n    Sahl ibn Hunayf roziyallohu anhu hijratning 38-sanasida Kufada vafot etdilar. U kishiga Ali roziyallohu anhu janoza o'qidilar."
        ]
    },
    {
        "word": "Sahl Shozavayh al-Hayzomiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Horun Sahl ibn Shozavayh al-Hayzomiy al-Buxoriy asli yamanlik bo'lib, nodir, ajoyib rivoyatlar aytar edilar. Hafs ibn Dovud ar-Rabiy'iy, Yahyo ibn Ja'far al-Azdiy va Abdulloh ibn Abdurahmon ad-Dorimiydan ta'lim olganlar. Hijriy 299 (milodiy 912) yilning zulqa'da oyida vafot etganlar."
        ]
    },
    {
        "word": "Sahoba ",
        "type": [],
        "definition": [
            "suhbatdosh, safdosh, yordamchi, hamroh; Muhammad alayhissalomni imon keltirgan holda ko'rgan va musulmon holida vafot topgan kishi"
        ]
    },
    {
        "word": "Sahul ",
        "type": [],
        "definition": [
            "Sahul – Yamandagi mato to'qishda, kiyim bo'yash va ohorlashda mashhur bo'lgan o'lka"
        ]
    },
    {
        "word": "Saʼd ibn Abu Vaqqos",
        "type": [],
        "definition": [
            "Sa'd ibn Abu Vaqqos ibn Uhayb Zuhriy al-Qurashiy, kunyalari Abu Ishoq.\r\n    Abu Bakr roziyallohu anhuning huzurlarida to'rtinchi bo'lib Islomga kirdilar. U kishi ana shu vaqt¬da 17 yoshda edilar. Islomda birinchi bo'lib kamondan o'q otgan shaxs ham, jannatga kirishlariga bashorat berilgan o'nta sahobalarning biri ham, Rasululloh sollallohu alayhi vasallam vafot etganlarida rozi bo'lgan oltita sahobalarning biri ham shu zot bo'lganlar.\r\n    Sa'd ibn Abu Vaqqos Alloh yo'lida birinchi bo'lib bir mushrikni qatl etib, qonini oqizgan, Badr, Uhud, Xandaq va bundan boshqa hamma ma'rakalarda Rasululloh sollallohu alayhi vasallam bilan birga ishtirok etgan pahlavon sahobalardan edilar.\r\n    Bu zot Rasululloh sollallohu alayhi vasallamning onalari Omina binti Vahb Zuhriyaning qabilasidan bo'lganlari uchun Rasululloh sollallohu alayhi vasallam bu kishini 'tog'a' deb atar edilar.\r\n    Rasululloh sollallohu alayhi vasallam Sa'd roziyallohu anhuning duolari qabul qilinishini so'raganlarida Alloh duolarini qabul qilgan. Shuning uchun odamlar Sa'd ibn Abu Vaqqosning duolaridan qo'rqar edilar.\r\n    Rasululloh sollallohu alayhi vasallam Sa'd ibn Abu Vaqqosdan tashqari biror kishiga 'Ota-onam fido bo'lsin', deb aytmaganlar.\r\n    Bu zot Umar ibn Xattobning xalifalik davrlarida forslar bilan bo'lgan urushda askarlarga qo'mondon bo'ldilar. Hijratning 15-sanasida Qodisiyani, hijratning 16-yili Jaluloni, hijratning 17-yili Kufani fath etdilar.\r\n    Umar ibn Xattob roziyallohu anhu bu kishini Iroqqa voliy qilib tayinladilar. Usmon ibn Affon roziyallohu anhuning xalifalik davrlarida ham shu amalda bo'ldilar.\r\n    Qachonki hazrati Usmon roziyallohu anhu o'ldirilib, fitna zamoni kelganidan keyin bu ishlarning hammasidan chetlanib, Madinaga qaytib keldilar.\r\n    Sa'd ibn Abu Vaqqos Rasululloh sollallohu alayhi vasallamdan 270ta hadis rivoyat qildilar. Bu hadislarni Abdulloh ibn Abbos, Abdulloh ibn Umar, Xavla binti Hakimlardan rivoyat qildilar. Bu zotdan Soib ibn Yaziyd, Mujohid, Alqama ibn Qays, Jobir ibn Samura, qizlari Oisha, Omirning bolalari, Mus'ab ibn Umayr, Ibrohim ibn Abdurrahmon ibn Avf, Qays ibn Abu Hozim va boshqalar rivoyat qilganlar. Bu kishi rivoyat qilgan hadislarni uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Bu zotning ko'zlari hayotlarining oxirida ojiz bo'lib qoldi va hijratning 55-sanasida Madinadan yetti mil uzoqlikdagi Aqiq degan joyda vafot etdilar.\r\n    Sa'd ibn Abu Vaqqos jannatga kirishlariga bashorat berilgan, oxirgi vafot etgan sahobalardan edilar."
        ]
    },
    {
        "word": "Saʼdiy Sheroziyning ʼBoʻstonʼ nomli kitobining turk tilidagi nasriy tarjimasi",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhi bu tarjimani 755 hijriy yilda amalga oshirgan"
        ]
    },
    {
        "word": "Saʼdon ",
        "type": [],
        "definition": [
            "Sa'don – tikanli o'simlik bo'lib, tuyaning sevimli yemishi hisoblanadi."
        ]
    },
    {
        "word": "Saʼid al-Bonabiy",
        "type": [],
        "definition": [
            "Abu Sa'id Sa'id ibn Ismat al-Bonabiy [bu zot Julvon al-Bonabiyning birodari (akasi yoki ukasi) bo'ladilar] Abdusamad ibn Fazl al-Balxiy, Ismoil ibn Bishr va Ahmad ibn Jarir al-Balxiydan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr Muhammad ibn Husayn al-Muqri al-Buxoriy hadis rivoyat qilganlar. Hijriy 326 (milodiy 939) yilning shavvol oyida vafot etganlar."
        ]
    },
    {
        "word": "Saʼid al-Harashiy",
        "type": [],
        "definition": [
            "Abu Zayd Sa'id ibn Rabi' al-Harashiy Buxoro shayxlaridan. Mug'ira ibn Shu'badan hadis rivoyat qilganlar. Abu Zaydning bobolari Zirora ibn Avfning kotibi bo'lganlar"
        ]
    },
    {
        "word": "Saʼid at-Termiziy",
        "type": [],
        "definition": [
            "Abu Usmon Sa'id ibn Xolid at-Termiziy ilm talabida Bag'dodda bo'lib, Iso ibn Ahmad al-Asqaloniydan hadis ilmidan ta'lim olganlar. Haj ham qilganlar."
        ]
    },
    {
        "word": "Saʼid ash-Shargʻiy",
        "type": [],
        "definition": [
            "Abu Usmon Sa'id ibn Sulaymon ibn Dovud ash-Sharg'iy Buxoroning Sharg' qishlog'idan bo'lib, Yahyo ibn Ja'far, Honiy ibn Nazr, Muhammad ibn Muhlab va Hotam ibn Mansurdan hadis rivoyat qilganlar. O'zlaridan esa Abu Solih Xalaf ibn Muhammad al-Xayyom hadis rivoyat qilganlar. Hijriy 300 (milodiy 913) yilda vafot etganlar."
        ]
    },
    {
        "word": "Saʼid Usmon al-Xorazmiy al-Atakiy",
        "type": [],
        "definition": [
            "Faqih Sa'id Usmon al-Xorazmiy al-Atakiy Xorazm ahlidan bo'lib, Jurjonda Ismoil ibn Muhammad as-Saffordan hadis rivoyat qilganlar. O'zlaridan esa Abu Bakr al-Ismoiliyning o'g'illari Abu Nasr va Abu Sa'd hadis yozib olganlar"
        ]
    },
    {
        "word": "Saʼiyd ibn Marjona",
        "type": [],
        "definition": [
            "Aslida ismlari Sa'iyd ibn Abdulloh Qurashiy al-Omiriydir. Onalarining ismlari esa Marjonadir. Tobe'inlardan bo'lganlar.\r\n    Zuhaliy:\r\n    'Bu zot Sa'iyd ibn Yasor, onalari Marjonadir', deb aytdilar.\r\n    Hadislarni Abu Hurayra, Ibn Abbos, Ibn Umarlardan rivoyat qildilar.\r\n    Bu zot taxminan, hijratning 97-yilida vafot etdilar."
        ]
    },
    {
        "word": "Saʼiyd ibn Musayyib",
        "type": [],
        "definition": [
            "Sa'iyd ibn Musayyib (milodiy 634—713 yillarda yashab o'tgan) ibn Hazn ibn Abu Vahb Maxzumiy al-Qurayshiy, kunyalari Abu Muhammad.\r\n    Bu zot tobe'inlarning sayyidi, Madinadagi yetti faqih imomlardan biri edilar.\r\n    Sa'iyd ibn Musayyib Umar ibn Xattobning xalifalik davrlarining 2-yilida tavallud topdilar. Hadislarni Abu Bakr, Umar, Usmon, Abu Hurayra, Zayd ibn Sobit, Oisha onamiz roziyallohu anhumdan va yana boshqalardan rivoyat qildilar.\r\n    U kishidan Salim ibn Abdulloh, Zuhriy, Qatoda, Shurayh, Abu Zanod va boshqalar rivoyat qildilar.\r\n    Ulug' zotlardan Makhul:\r\n    'Ilm talab qilib, ko'pgina yerlarni aylanib chiqdim-u, lekin Sa'iyd ibn Musayyibdan ko'ra olimroq kishiga yo'liqmadim', deb aytadilar.\r\n    Sa'iyd ibn Musayyibda fiqh, taqvo, zohidlik mujassam bo'lgan edi. Hayotlari davomida yog' savdosi bilan shug'ullanib, insonlardan hech bir narsa so'ramasdan, kasblari orqasidan ro'zg'or tebratdilar.\r\n     Hijratning 93-yili Madinada vafot etdilar."
        ]
    },
    {
        "word": "Saʼut ",
        "type": [],
        "definition": [
            "Sa'ut – burunga tomiziladigan dori"
        ]
    },
    {
        "word": "Saʼf ",
        "type": [],
        "definition": [
            "Sa'f – xurmo daraxtining tepa shoxlari"
        ]
    },
    {
        "word": "Sepoya ",
        "type": [],
        "definition": [
            "Sepoya – uchta yog'ochning uchini bir-biriga bog'lagan holda tikka qilib, kiyim va shunga o'xshash narsalar osib qo'yiladigan moslama (ilgich)."
        ]
    },
    {
        "word": "Siboriy ",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan bo'lib, 'Sabiriy' yoki 'Isbiriy' deb ham aytiladi"
        ]
    },
    {
        "word": "Sibtiy shippak",
        "type": [],
        "definition": [
            "Sibtiy shippak – molning oshlangan terisidan qilingan shippak. 'Sibtiy' so'zi aslida 'junsiz', 'qirilgan' degan ma'nolarni anglatadi. Ilgari arablar shippakni oshlanmagan teridan kiyishgan. Moddiy imkoniyati kengroq kishilargina charm teridan shippak kiya olgan."
        ]
    },
    {
        "word": "Sibtiyya shippak",
        "type": [],
        "definition": [
            "'Sibtiyya shippak' –- molning oshlangan terisidan qilingan shippak. 'Sibtiyya' so'zi aslida 'junsiz', 'qirilgan' degan ma'nolarni anglatadi."
        ]
    },
    {
        "word": "Siddiq ",
        "type": [],
        "definition": [
            "chin dildan tasdiq etib ishonuvchi, valiylik martabasi"
        ]
    },
    {
        "word": "Sidq ",
        "type": [],
        "definition": [
            "Rostgo'ylik"
        ]
    },
    {
        "word": "Sidr ",
        "type": [],
        "definition": [
            "Sidr – Arabistonda o'sadigan butasimon daraxt"
        ]
    },
    {
        "word": "Sidr ",
        "type": [],
        "definition": [
            "'Sidr' bir o'simlik bo'lib, suvga qo'shilsa, sovun vazifasini o'tashi mumkin."
        ]
    },
    {
        "word": "Sidratul muntaho",
        "type": [],
        "definition": [
            "Sidratul muntaho – lug'atda 'nihoya daraxti', 'chegara daraxti' degan ma'nolarni anglatadi. Hadisda ta'riflanishicha, u butasimon daraxt bo'lib, chavandoz bir necha o'n yil ot choptirsa ham, uning soyasi tugamaydi. Uning 'nihoya' deb nomlanishiga sabab shuki, barcha maxluqotning ilmi o'sha joygacha yetadi, undan uyog'ida nima borligini Allohdan o'zga hech kim bilmaydi. Farishtalar ham undan uyog'iga o'ta olmaydilar. Bu ham g'aybga taalluqli narsalardan bo'lib, u haqda oyat va hadislarda kelgan ma'lumotlar bilan kifoyalanish lozim. Uning kayfiyati va boshqa jihatlari Allohning O'zigagina ma'lum bo'lib, inson aqlu idrokidan ustundir."
        ]
    },
    {
        "word": "Sidratul-muntaho",
        "type": [],
        "definition": [
            "Sidratul-muntaho – lug'atda 'intiho daraxti', 'chegara daraxti' degan ma'noni anglatadi. Hadisda ta'riflanishicha, u butasimon daraxt bo'lib, chavandoz bir necha o'n yil ot choptirsa ham uning soyasidan chiqa olmaydi. Uning 'intiho' deb nomlanishiga sabab shuki, barcha maxluqotning ilmi o'sha joygacha yetadi, undan uyog'ida nima borligini Allohdan o'zga hech kim bilmaydi. Farishtalar ham undan uyog'iga o'ta olmaydilar. Bu ham g'aybga taalluqli narsalardan bo'lib, bu haqda oyat va hadislarda kelgan ma'lumotlar bilan kifoyalanish lozim. Uning kayfiyati va boshqa jihatlari Allohning O'zigagina ma'lum bo'lib, inson aqlu idrokidan ustundir."
        ]
    },
    {
        "word": "Siyom ",
        "type": [],
        "definition": [
            "Ro'za arab tilida 'siyom' deb atalib, lug'atda bir narsadan o'zini tiymoqlikni bildiradi. Shariat istilohida esa: 'Ro'za tong otgandan to quyosh botguncha niyat bilan ro'zani ochuvchi narsalardan o'zini tiymoqdir'."
        ]
    },
    {
        "word": "Sijol ",
        "type": [],
        "definition": [
            "Sijol - quduqdan bir xil suratda navbatma-navbat suv olishga aytiladi."
        ]
    },
    {
        "word": "Siyrat ",
        "type": [],
        "definition": [
            "xulq-atvor, tarjimai hol, yashash turmush tarzi, hayot kechinmalari."
        ]
    },
    {
        "word": "Siqa ",
        "type": [],
        "definition": [
            "ishonchli (adolati va zehni yuqori darajada bo'lgan roviy)"
        ]
    },
    {
        "word": "Sila roziyallohu anhu",
        "type": [],
        "definition": [
            "Sila ibn Zufar al-Abasiy, kunyalari Abu A'lo. Ba'zilar u kishini Abu Bakr al-Kufiy deb ham ataydilar.\r\n    Bu zot ishonchli hadis rivoyat qiluvchi ulug' tobe'inlarning katta ulamolaridan hisoblanadilar. Rasululloh sollallohu alayhi vasallamning hadisi shariflarini Ammor ibn Yosir, Huzayfa ibn Yamon, Ibn Mas'ud, Ali, Ibn Abbos roziyallohu anhumlar orqali rivoyat qiladilar. Bu zot hijratning 70-yillari atrofida vafot etganlar."
        ]
    },
    {
        "word": "Silq",
        "type": [],
        "definition": [
            "Silq – barg lavlagi (mangold)."
        ]
    },
    {
        "word": "Silsila ",
        "type": [],
        "definition": [
            "zanjir, halqa"
        ]
    },
    {
        "word": "Sipar ",
        "type": [],
        "definition": [
            "Sipar – qalqonning bir turi."
        ]
    },
    {
        "word": "Sirka ",
        "type": [],
        "definition": [
            "mevalardan achitib tayyorlangan suyuqlik"
        ]
    },
    {
        "word": "Siroj ",
        "type": [],
        "definition": [
            "chiroq, ziyo, yorug'lik"
        ]
    },
    {
        "word": "Sixob",
        "type": [],
        "definition": [
            "Sixob – xushbo'y o'simliklardan qilingan, qimmatli toshlar aralashmagan munchoq"
        ]
    },
    {
        "word": "Siyaro",
        "type": [],
        "definition": [
            "Siyaro – ipak aralashtirib to'qilgan mato yoki shu matodan tikilgan chopon"
        ]
    },
    {
        "word": "Sobiy ",
        "type": [],
        "definition": [
            "Sobiy – eski dinidan chiqib, yangi dinga kiruvchi. Johiliyat arablari johiliyatdagi dinini tashlab, Islom diniga kirganlarni shunday deb atashar edi."
        ]
    },
    {
        "word": "Sobit ",
        "type": [],
        "definition": [
            "mustahkam (zehnda mustahkam)"
        ]
    },
    {
        "word": "Sod surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 88 oyatdan iborat.\r\n    Ushbu surai karima hijo harfi bo'lmish 'sod' bilan boshlangani uchun shu nomni olgan. Unda asosan, aqiydaning eng markaziy uch masalasi – tavhid, vahiy va oxiratdagi hisob-kitob masalalari muolaja qilinadi.\r\n    Sod surasining avvalida Qur'oni Karim bilan qasam ichiladi. Qur'oni Karim haq Kitob ekani, Muhammad sollallohu alayhi vasallam haq payg'ambar ekanliklari ta'kidlanadi.\r\n    So'ngra tavhid xususida va uni mushriklar inkor etishlari haqida so'z ketadi. Muhammad sollallohu alayhi vasallamning da'vatlaridan ularning ajablanganlari bayon qilinadi.\r\n    Keyin mushriklar uchun eslatma sifatida avval o'tgan tug'yonkorlarning qilmishlari va ular topgan oqibatlar haqidagi xabarlar keltiriladi.\r\n    Shu bilan birga, Payg'ambarimiz Muhammad sollallohu alayhi vasallamga va muxlis mo'min-musulmonlarga tasalli bo'lsin uchun, o'tgan payg'ambarlardan Dovud alayhissalom va u zotning o'g'illari Sulaymon alayhissalom hamda Ayyub, Ishoq, Ya'qub, Ismoil va Zulkifl alayhimussalomning qissalari keltiriladi.\r\n    Sod surasida Alloh taoloning Biru Borligiga va U Zotning cheksiz qudratiga dalolat qiluvchi maxluqotlarga, ular bekorga yaratilmaganiga e'tibor tortiladi.\r\n    Surai karimaning nihoyasida Payg'ambar sollallohu alayhi vasallamning haqiqiy vazifalari nimadan iborat ekani bayon qilinadi."
        ]
    },
    {
        "word": "Sodrush shariyʼa",
        "type": [],
        "definition": [
            "Ubaydulloh ibn Mas'ud al-Buxoriy rahmatullohi alayhi"
        ]
    },
    {
        "word": "Soj ",
        "type": [],
        "definition": [
            "Soj – taxtaning sifatli va qimmatbaho turi, u Hindistondan keltirilgan"
        ]
    },
    {
        "word": "Soib ibn Yaziyd",
        "type": [],
        "definition": [
            "Soib ibn Yaziyd ibn Sa'iyd al-Kindiy, kunyalari Abu Yaziyd bo'lgan. Hijratning ikkinchi yilida tavallud topganlar.\r\n    Hajjatul Vado' kuni bu kishi va otalari Rasululloh sollallohu alayhi vasallam bilan birga haj qildilar. O'sha vaqtda Soib yetti yoshda bo'lgan.\r\n    Hammasi bo'lib 22ta hadis rivoyat qilganlar.\r\n    Bu kishidan o'g'illari Abdulloh, Ju'da ibn Abdurahmon, Hamza ibn Sufyon, Umar ibn Ato va boshqalar rivoyat qildilar.\r\n    Umar ibn Xattobning xalifalik davrlarida bu zot Madina bozorlari ustidan boshliq edilar.\r\n    Hijratning 91-yili Madinada vafot etdilar. Madinada eng oxirgi vafot etgan sahoba shu kishidirlar."
        ]
    },
    {
        "word": "Solis – Uchinchi",
        "type": [],
        "definition": [
            "Imom Muhammad rahmatullohi alayhi"
        ]
    },
    {
        "word": "Solih ",
        "type": [],
        "definition": [
            "to'g'ri, salohiyatli (adolatli hisoblangan roviy)"
        ]
    },
    {
        "word": "Solih ad-Daʼo",
        "type": [],
        "definition": [
            "Abu Shuayb Solih ibn Imron ad-Da'o asli buxorolik bo'lib, Abu Naim Fazl ibn Dikkin, Sulaymon ibn Harb, Muslim ibn Ibrohim va Affon ibn Muslimlardan ta'lim olganlar. Bu kishidan Yahyo ibn Muhammad, Ahmad ibn Komil va Abu Bakr ash-Shofe'iy hadis rivoyat qilganlar. Hijriy 285 (milodiy 899) yilning sha'bon oyida vafot etganlar."
        ]
    },
    {
        "word": "Solih ad-Dorazanjiy as-Sagʻoniy",
        "type": [],
        "definition": [
            "Abu Shuayb Solih ibn Mansur ad-Dorazanjiy as-Sag'oniy Abu Rajo Qutayba ibn Sa'id al-Bag'loniy va Muhammad ibn Shujo'dan hadis rivoyat qilganlar. O'zlaridan esa Abdulloh ibn Muhammad al-Buxoriy, Muhammad ibn Zakariyo an-Nasafiy va Ja'far ibn Muhammad hadis rivoyat qilganlar. Hijriy 300 (milodiy 913) yildan oldin yoki shu sanada vafot etganlar."
        ]
    },
    {
        "word": "Solih alayhissalom",
        "type": [],
        "definition": [
            "Solih alayhissalomning otalarining ismi Ubayd bo'lib, nasablari Nuh alayhissalomga borib taqaladi. U zot boida arablardan bo'lmish Samud qabilasiga mansubdirlar.\r\n    Samud qavmi Arabiston yarimoroli, Hijoz o'lkasining shimoliy tarafida, Hijr deb ataladigan vodiyda istiqomat qilar edi. U vodiy hozirda 'Madoini Solih' deb ataladi. Alloh taolo Samud qavmiga o'z ichlaridan Solih alayhissalomni payg'ambar qilib yubordi.\r\n    Alloh taolo bu haqda Hud surasida quyidagilarni aytadi:\r\n    '...va Samudga o'z birodarlari Solihni (yubordik). U 'Ey qavmim, Allohga ibodat qiling. Siz uchun Undan o'zga iloh yo'q. U sizni yerdan paydo qildi va uni obod qilishingizni talab qildi. Undan mag'firat so'rang, so'ngra Unga tavba qiling. Albatta, Robbim yaqindir, ijobat qiluvchidir', dedi' (61-oyat).\r\n    Oyatdan ko'rib turibmizki, Solih alayhissalom ham payg'ambar bo'lib kelib, qavmlariga o'zlaridan oldingi payg'ambarlarning gaplarini aytganlar.\r\n    Solih alayhissalomning bu gaplariga qavmlari quyidagi javobni berishdi:\r\n    'Ey Solih, bundan oldin ichimizda orzu qilingan eding. Endi bizni ota-bobolarimiz ibodat qiladigan narsaga ibodat qilmog'imizdan qaytarasanmi? Biz sen da'vat qilayotgan narsa haqida shak-shubhadamiz' (62-oyat).\r\n    Samud qavmi ham boshqa qavmlarga o'xshab o'zlaridan chiqqan payg'ambarga, u da'vat qilayotgan dinga shak-shubha bilan qarashmoqda. Shu bilan birga, ular Solih alayhissalomning avvalgi hollarini e'tirof qilishmoqda:\r\n    'Ey Solih, bundan oldin ichimizda orzu qilingan eding'.\r\n    Ya'ni 'Fazilatlaring uchun, aqling, ilming, rostgo'yliging, husni xulqing, omonatdorliging uchun hammamiz senga havas qilar, sendek bo'lishni orzu etar edik'.\r\n    'Endi bizni ota-bobolarimiz ibodat qiladigan narsaga ibodat qilmog'imizdan qaytarasanmi?'\r\n    Nobakor qavmning bu raddiyasidan so'ng Solih alayhissalom ularga bosiqlik bilan haqiqatni tushuntirishga urinib ko'rdilar:\r\n    'Ey qavmim, ayting-chi, agar Robbim tomonidan ochiq-oydin hujjatga ega bo'lsam va menga U Zotdan rahmat berilgan bo'lsa-yu, Unga osiy bo'lsam, kim menga Alloh (azobi)dan (qutulishga) yordam beradi?! Sizlar menga ziyondan o'zgani ziyoda qilmassizlar' (63-oyat).\r\n    Ming afsuski, bu gaplarning barchasi Samud qavmiga ta'sir qilmadi. Shuaro surasida aytilganidek:\r\n    'Samud rasullarni yolg'onchiga chiqardi. O'shanda birodarlari Solih ularga dedi: 'Qo'rqmaysizlarmi?! Men sizlarga ishonchli rasulman. Allohdan qo'rqinglar va menga itoat qilinglar. Buning uchun sizlardan ajr so'ramasman. Mening ajrim faqatgina olamlar Robbining zimmasidadir. Bu joydagi narsalarda omon holda tark qilinasizmi?! Bog'-rog'larda, buloqlarda?! Ekinzorlaru tugunchasi mayin xurmozor ichlarida-ya?!' (141–148-oyatlar).\r\n    Allohning payg'ambari Solih alayhissalomning qavmiga aytayotgan ushbu gaplaridan bu qavmning moddaparastlikka, mol-dunyo va aysh-ishratga berilgani ko'rinib turibdi.\r\n    '...va tog'lardan manmanlik-la uylar yo'naverasizmi?!' (149-oyat).\r\n    Samud qavmi ahli dunyolarga – moddaparastlarga o'xshab o'zlaridagi mavjud dunyo matohlari ila manmanlik qilishni xush ko'rishardi. Ularning manmanlik qilishlarining ko'zga ko'ringan sohasi – tog' yonbag'irlaridagi toshlarni yo'nib uy qilish edi. Ular tog'ning toshlarini yo'nib, ich tomoniga kirib, uylar, qasrlar qilishar edi. Ana o'sha uylari hozirgacha saqlanib qolgan bo'lib, Arabiston yarimorolining shimolida sayohatchilar ularni tomosha qilishadi.\r\n    Solih alayhissalom qavmlariga o'sha manmanlik uchun toshdan uy yo'nishlarini ham tanqid ma'nosida eslatmoqdalar.\r\n    Solih alayhissalomning kuyunib aytgan bu gaplariga jinoyatchi Samud qavmi quyidagi javobni berdi:\r\n    'Sen sehrlanganlardandirsan, xolos. Sen bizga o'xshagan bashardan boshqa hech narsa emassan. Agar rostgo'ylardan bo'lsang, mo''jiza keltir' (153–154-oyatlar).\r\n    Samud qavmining bu talabiga binoan Alloh taolo Solih alayhissalomga mo''jiza berdi.\r\n    Endi Solih alayhissalom Samud qavmiga o'sha mo''jizani e'lon qilmoqdalar:\r\n    'Mana bu tuya. Unga (bir kun) suv ichish va sizga ma'lum bir kun suv ichish. Va unga yomonlik yetkazmanglar, yo'qsa sizni buyuk kunning azobi tutadir'. Uni so'ydilar-u, nadomat chekuvchilarga aylandilar' (155–157-oyatlar).\r\n    Boshqa oyatlarda bayon etilganidek, Alloh taolo tomonidan mazkur tuyaning toshdan chiqarilishining o'zi mo''jiza bo'lgan edi.\r\n    Qavm tuyaga mutlaqo zarar yetkazmasligi kerak. Agar bu shartni buzib, tuyaga zarar yetkazadigan bo'lsalar, ularga azob yetishi turgan gap edi. Ammo jinoyatkor qavm shartga amal qilmadi. Samud qavmi tug'yonga ketib, tuyani so'yishdi. Keyin esa nadomat cheka boshlashdi.\r\n    Samudning yana boshqa jinoyati ham bor edi. Nobakorlarning bu jinoyati haqida Naml surasida quyidagilar aytiladi:\r\n    'U shaharda to'qqiz kishilik guruh bo'lib, yer yuzida buzg'unchilik qilishar, isloh qilmas edilar' (48-oyat).\r\n    Ya'ni Solih alayhissalomning shaharlari bo'lmish Hijr shahrida to'qqiz kishidan iborat bir guruh bo'lib, o'sha guruh a'zolari buzg'unchilik, fasod ishlar bilan shug'ullanishar, yaxshilikka, isloh qilishga qo'l urishmas edi.\r\n    Ana o'sha to'qqiz kishilik buzg'unchi guruh a'zolari islohga chaqirayotgan Solih alayhissalomdan eng ko'p darg'azab bo'lishdi. O'z jinoyatlari bilan shahar aholisini qo'rqitib olgan mazkur uyushgan jinoyatchilar guruhi o'zlarining barcha hamkasblariga o'xshab shaharning kattayu kichik har bir ishiga aralashib turishardi.\r\n    Solih alayhissalomning xabarlari chiqqanidan so'ng ular ishni o'zlaricha muolaja qilishga o'tishdi. Hamma zamondagi buzg'unchi, zo'ravon, jinoyatchi, iymonsiz guruhlarning uslubi shu – o'zlarining yo'liga qarshi bo'lgan, odamlarni fisqu fasoddan qaytarayotgan, xaloyiqqa buzg'unchilik, qalloblik, harom-xarish nimaligini anglatib, ularning ko'zini ochayotgan shaxsga suiqasdlar uyushtiriladi; kechasi xoinlarcha berkinib kelib, o'ldirib yoki boshqa biror zarar yetkazib ketiladi; keyin mazlumning tarafdorlariga 'Bu ishni kim qildi ekan, bilmadik', deya bexabardek turaverishadi.\r\n    Solih alayhissalomning ilohiy da'vati yoqmagan to'qqiz kishilik jinoyatchi guruhdagilar ham xuddi shu uslubni qo'llash haqida maslahat qilishdi.\r\n    Solih alayhissalomni ochiqdan-ochiq o'ldirishga ularning yuragi betlamadi. Kechasi xoinlarcha kelib, hech kimga bildirmasdan o'ldirishga ahd qilishdi.\r\n    Solih alayhissalomni o'ldirmoqchi bo'lgan jinoyatchilarni Samud qavmidan oldin Alloh taolo osmondan tushgan toshlar bilan parchalab halok qildi.\r\n    Samudning qolgan kofirlarini esa Alloh taolo turli uslubdagi shiddatli azoblar bilan halok qildi. Qur'oni Karim o'sha halok qilish qanday bo'lganini o'ziga xos uslublar ila turli suralarda bayon etgan.\r\n    Azobning birinchi turi:\r\n    'Biz ularga bir ovoz yubordik va ular qo'ra quruvchining quruq shox-shabbalariga o'xshab qoldilar' (Qamar surasi, 31-oyat).\r\n    Ya'ni Alloh taolo Samud qavmini dahshatli, kuchli ovoz bilan halok qilgan. Ular halok bo'lganlaridan so'ng qo'yboqarlar qo'yxona qurish uchun ishlatadigan quruq shox-shabbalarga o'xshab qolishgan edi. Hozirgi paytda ham sirli suratda halok bo'lganlarni 'Qattiq ovozdan qo'rqib o'lgan bo'lsa kerak', deb taxmin qilishmoqda.\r\n    Azobning ikkinchi turi:\r\n    'Ularni shiddatli zilzila oldi va joylarida muk tushib qoldilar' (A'rof surasi, 78-oyat).\r\n    Azobning uchinchi turi:\r\n    'Ammo Samudni hidoyat qildik. Ular esa hidoyatdan ko'ra ko'rlikni afzal ko'rdilar. Kasb qilgan narsalari tufayli ularni xorlik azobining chaqmog'i urdi' (Fussilat surasi, 17-oyat).\r\n    Samud qavmi kasb qilgan kufri va gunohlari tufayli chaqmoqqa uchrab halok bo'ldi. Bu chaqmoq xorlik azobi chaqmog'idir.\r\n    Barcha qavm halok bo'lib, Solih alayhissalom bilan birga taxminan bir yuz yigirma nafar mo'mingina salomat qoldilar. Solih alayhissalom umrlarining oxirigacha mo'minlar bilan Falastinning Ramla nohiyasida tinch-omon yashadilar va ulamolarning rojih (kuchli) qavllariga ko'ra, shu yerga dafn qilindilar.\r\n    Allohning boida arablarga yuborgan uchinchi payg'ambari Shuayb alayhissalomdir."
        ]
    },
    {
        "word": "Solih al-Jijoriy",
        "type": [],
        "definition": [
            "Abu Shuayb Solih ibn Muhammad al-Jijoriy Buxoroning Jijor nomli qishlog'idan bo'lib, bu nisbat bilan mashhur edilar. Bu kishidan qozi va rais Abu Tohir al-Ismoiliy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Solih al-Istoniy",
        "type": [],
        "definition": [
            "Abu Shuayb Solih ibn Umar al-Istoniy Iso ibn Umar al-Istoniyning ukalari. Ishoq ibn Ibrohim ad-Dabariy, Abu Yahyo Zakariyo ibn Yahyo an-Noqid, Muhammad ibn Nasr al-Marvaziydan hadis rivoyat qilganlar. O'zlaridan esa Abul Hasan Muhammad ibn Husayn al-Jurjoniy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Solih al-Xorazmiy",
        "type": [],
        "definition": [
            "Abu Abdulloh Solih ibn Molik al-Xorazmiy Bag'dodda yashaganlar. 'Mustaqim al-hadis' (Ishonchli hadislar roviysi) edilar. Ibrohim ibn Sa'ddan hadis rivoyat qilganlar. O'zlaridan esa Abu Ya'lo al-Mavsiliy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Solih as-Sagʻoniy",
        "type": [],
        "definition": [
            "Solih ibn Hibbon ibn Sulaymon as-Sag'oniy Samarqand ahlidan bo'lib, Jurjonda xalifa edilar. Hijriy 460 (milodiy 1069) yilda tavallud topib, hijriy 532 (milodiy 1138) yilning shavvol oyida vafot etganlar."
        ]
    },
    {
        "word": "Solih as-Sijoriy",
        "type": [],
        "definition": [
            "Abu Shuayb Solih ibn Muhammad as-Sijoriy Buxoroning Sijor qishlog'idan bo'lib, solih shayx, zohid va fozil edilar. Ilm talabida Xuroson, Iroq, Shom va Misrda bo'lib, Abul Qosim Abdulaziz ibn Ali al-Misriy, Horun ibn Muhammad al-Anziy va Abu Bakr Muhammad ibn Abdulloh ar-Roziy hamda boshqa ulamolardan ta'lim olganlar. O'zlaridan esa Abul Qosim Maymun ibn Ali al-Maymuniy hadis rivoyat qilganlar. Hijriy 404 (milodiy 1014) yilda Buxoroda vafot etganlar. Qabrlari Kalobodda."
        ]
    },
    {
        "word": "Solih at-Termiziy",
        "type": [],
        "definition": [
            "Abu Muhammad Solih ibn Muhammad at-Termiziy ko'p ibodat qiluvchi – obid edilar. Hadis ilmi talabida hijriy 345 (milodiy 957) yilda Nishopurga kelganlar. Ta'lim olgandan keyin hajga borganlar. Minoda kasal bo'lib, Makkai Mukarramaga kelganlarida vafot etganlar. Taho degan joyda dafn qilinganlar. Janozalarini Abdulloh al-Hofiz o'qiganlar."
        ]
    },
    {
        "word": "Somad ",
        "type": [],
        "definition": [
            "Somad – behojat hojatbaror"
        ]
    },
    {
        "word": "Soniy – Ikkinchi",
        "type": [],
        "definition": [
            "Imom Abu Yusuf rahmatullohi alayhi."
        ]
    },
    {
        "word": "Sof badan ibodati",
        "type": [],
        "definition": [
            "Masalan, namoz, ro'za kabi ibodatlarda Alloh taologa bo'ysunish, sig'inish insonning badani, ruhi bilan bo'ladi. Molga, pulga hech qanday ehtiyoj yo'q. Bunday badan ibodatlari Har bir insonga birlamchi farz (farzi ayn) bo'ladi. Uni Har bir inson o'zi bajarmog'i lozim, birovning o'rniga boshqa birov namoz o'qib yoki ro'za tutib berolmaydi."
        ]
    },
    {
        "word": "Sof moliyaviy ibodatlar",
        "type": [],
        "definition": [
            "Bunga zakot va sadaqa kabilar kiradi. Bu ibodatlar insonning molu pulini sarflash bilan amalga oshadi. O'sha mol oluvchi kishining foydasi qayd qilingan. Bunday moliyaviy ibodatlarni birovning nomidan ikkinchi odam ado etsa bo'ladi. Misol uchun, mol egasi zakotni hisoblab chiqarib, haqdorlargaga berishni boshqa bir shaxsdan iltimos qilsa joiz. Yoki birovga pul berib, uning nomidan sadaqa qilib qo'yishni so'pash ham mumkin."
        ]
    },
    {
        "word": "Sofar ",
        "type": [],
        "definition": [
            "'Sofar' so'zi ham turlicha izohlangan: a) johiliyat arablarida ochlik tufayli odamning ichida 'sofar' degan bir qurt paydo bo'ladi, u insonga ozor beradi va boshqaga ham o'tadi, yuqadi, degan tushuncha bo'lgan. 'Sofar yo'q' deganda mazkur tushunchaning botilligi nazarda tutilgan; b) johiliyat arablari urush harom qilingan muharram oyi o'rniga sofar oyini qo'yib olishgan, muharram oyida urushni halol sanab, sofar oyida harom sanashardi. Hadisi sharifda mazkur ish taqiqlangan; v) ba'zilarda sofar oyidan shumlanish bo'lgan. Bu oyda falon ishni qilib bo'lmaydi, degan tushunchalar bo'lgan. Hozirgi kunda ham ayrimlarda 'Safar oyida to'y qilib bo'lmaydi, safar qilib bo'lmaydi, ko'chib bo'lmaydi', degan e'tiqodlar bor. Vaholanki, sayohat ma'nosidagi 'safar' so'zi 'sin' harfi bilan, oyning nomi esa 'sod' harfi bilan yoziladi. Shuning o'zi bu tushunchalarning naqadar bema'ni ekanini ko'rsatib turibdi."
        ]
    },
    {
        "word": "Soff surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 14 oyatdan iborat.\r\n    Ushbu surai karimada kofirlar bilan urush bo'lib qolsa, mo'minlar bir saf bo'lib, shijoat ila kurash olib borishlari uqtiriladi. Suraning nomi shundan olingandir.\r\n    Bu sura ham madaniy suralardan biri bo'lib, bu dunyo va u dunyoda saodatga erishish uchun qanday 'tijorat' olib borish zarurligi haqida so'z yuritadi. Bu ulkan ishlarni bajarishning o'zi bo'lmasligi, uni amalga oshirish uchun mo'min-musulmonlarning saflari bir bo'lishi shart ekani uqtirib o'tiladi. Surada Alloh taolo kishilarni hidoyatga boshlash uchun Muso alayhissalomni payg'ambar qilib yuborganini, u kishining vafotlaridan keyin odamlar ilohiy ta'limotlardan uzoqlashib, noto'g'ri yo'lga kirib ketganlari, so'ng Iyso alayhissalomni yuborib, Tavrot ta'limotini yangilagani va u zotga Muhammad alayhissalom haqlarida bashorat berishni topshirganini xabar qiladi.\r\n    Muhammad alayhissalomning risolalari avval o'tgan ilohiy risolatlarni to'ldiruvchi, adolat, haqiqat va tenglik kabi g'oyalarni ilgari suruvchi din ekani ta'kidlanadi.\r\n    Surai karima mo'minlarni Alloh taologa tasbeh, maqtov aytishga, bergan va'dasiga xilof ish qilmaslikka da'vat qilish bilan boshlanadi.\r\n    So'ngra Payg'ambarimizga tasalli berish uchun yahudiylarning Muso va Iyso alayhissalomlarning da'vatlariga nisbatan o'zlarini qanday tutganliklari, u ikki payg'ambarga Allohning yo'lida yetgan ozorlar zikr etiladi. Chunki u zotga ham Makka kofirlaridan ozorlar yetib turgan edi.\r\n    Alloh taolo doimo O'z diniga, payg'ambarlariga va muxlis bandalariga yordam berib kelganligi eslatiladi. Mushriklarning Allohning diniga qarshi urush ochishlari og'zidan puflab, quyoshni so'ndirishga urinayotgan odamning holatiga o'xshatiladi.\r\n    Suraning oxirida iymon ahli Allohning diniga yordam berishda Iyso alayhissalomga yordam bergan kishilarga o'xshashga da'vat etiladilar."
        ]
    },
    {
        "word": "Soffaat surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 182 oyatdan iborat.\r\n    'Soffaat' so'zi 'saf tortib turuvchilar' degan ma'noni anglatadi. Alloh taolo bu surai karimani Allohning amrini bajarish uchun saf tortib turgan farishtalar(as-soffaat)ga qasam ila boshlagan bo'lib, shu so'z suraga nom bo'lib qolgan.\r\n    Boshqa makkiy suralar kabi, bu surada ham kishilar qalbida mustahkam e'tiqodni bino qilish, uni shirkning turli kirlaridan tozalash haqida o'ziga xos uslubda so'z yuritiladi. Ba'zi bir masalalarga alohida e'tibor beriladi. Masalan, arablarda 'Alloh bilan jinlar orasida yaqinlik bor' degan gap keng tarqalgan bo'lib, surada mana shu xurofiy gap muolaja qilinadi.\r\n    Shuningdek, surai karimada tavhid va vahiy masalasi ham alohida tilga olinadi.\r\n    Mushriklarning zalolati bayonidan so'ng ularga o'xshash ummatlarning qissalari keltiriladi. Borliqdagi mavjud narsalardan o'rnak olishga chaqiriladi.\r\n    Surai karima farishtalarning bir necha toifalari bilan qasam ichish ila boshlanadi. So'ngra gap mavzusi jinlarga ko'chadi. Ularning haqiqati bayon qilinadi. Arablarning 'Alloh bilan jinlar o'rtasida yaqinlik bor' degan xurofotlari behuda ekani fosh etiladi.\r\n    So'ngra kofirlarning o'lgandan keyin qayta tirilishga ishonmasliklari masalasiga o'tiladi. Mo'min banda bilan kofir qissasi keltiriladi. Ular o'rtasida bu dunyoda bo'lib o'tgan tortishuv esga olinadi. So'ng natija bayon etiladi. Mo'min jannatga, kofir do'zaxga yo'l olishi aytiladi.\r\n    Keyin esa hozirda kufr keltirayotganlarning ishi yangilik emasligi, bularga o'xshash kofirlar avval ham ko'p bo'lganligi haqida so'z ochilib, o'tgan ummatlar, jumladan, Nuh, Ibrohim, Ismoil, Muso, Horun, Ilyos va Lut alayhissalomlarning qissalari keltiriladi. Xususan, mo'min-musulmonlarni Alloh yo'lida fidokorlikka chorlash uchun Ibrohim alayhissalomning o'z jigarbandlari – Ismoil alayhissalomni qurbonlik qilishga urinishlari qissasi batafsil keltiriladi.\r\n    Suraning oxirida Alloh taolo poklab yod etiladi. U Zot payg'ambarlari va mo'min bandalariga ikki dunyoda ham nusrat berishi aytiladi."
        ]
    },
    {
        "word": "Sohib ",
        "type": [],
        "definition": [
            "Ega"
        ]
    },
    {
        "word": "Sohibi uzrlik",
        "type": [],
        "definition": [
            "Doimiy yel keladigan, burni qonaydigan, jarohat va turli xil toshmalaridan doimiy suv chiqib turadigan, prostatit kasalligiga duchor bo'lib, bavl tomchilab turadigan yoki ayollardagi shamollash tufayli hidli suyuqliklar yoki istihoza kelib turadiganlarni uzr sohiblari, deb aytiladi"
        ]
    },
    {
        "word": "Sohiboni – Ikki Sohib",
        "type": [],
        "definition": [
            "Imom Abu Yusuf va Muhammad rahmatullohi alayhimolar."
        ]
    },
    {
        "word": "Soʻ ",
        "type": [],
        "definition": [
            "So' – yog'ochdan qilingan idish bo'lib, u o'sha davrda o'lchov vazifasini bajargan. So'dan suv idishi sifatida ham foydalanilgan. Hanafiy mazhabiga ko'ra, bir so' hajmda 3,330 litr, og'irlikda 3,250 kilogrammga to'g'ri keladi. Jumhur ulamolar nazdida esa bir so' hajmda 2,750 litr, og'irlikda esa 2,040 kilogrammga to'g'ri keladi. Hanafiylarga ko'ra, bir mudd hajmda 0,84 litr, og'irlikda 812,5 grammga, jumhur nazdida esa hajmda 0,6875 litr va og'irlikda 1020 grammga to'g'ri keladi."
        ]
    },
    {
        "word": "Soʻat ",
        "type": [],
        "definition": [
            "So'at – Qiyomatning nomlaridan biri"
        ]
    },
    {
        "word": "Subizgʻuk",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Subhi kozib",
        "type": [],
        "definition": [
            "Tongda yorug'lik pastdan yuqoriga ko'tarilishi 'subhi kozib' yoki 'fajri kozib' deyiladi. Ya'ni, 'yolg'onchi tong' degani. Subhi kozib vaqtida saharlik vaqti tugamagan bo'ladi."
        ]
    },
    {
        "word": "Subhi sodiq",
        "type": [],
        "definition": [
            "Tongda yorug'likning ufq bo'ylab ko'ndalangiga tarqalishi bilan bo'ladi. Buni 'subhi sodiq' yoki 'fajri sodiq', ya'ni, 'rost tong', deyiladi. Ana shunda og'izni berkitish vaqti kirgan bo'ladi. Undan keyin saharlik qilish mumkin emas. Chunki, Bomdod namozining vaqti kirgan bo'ladi."
        ]
    },
    {
        "word": "Sukk ",
        "type": [],
        "definition": [
            "Sukk – xushbo'ylik turi"
        ]
    },
    {
        "word": "Sulaymon az-Zaraxshiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Dovud Sulaymon ibn Sahl az-Zaraxshiy al-Buxoriy Zaraxsh qishlog'idan. Abu Abdulloh ibn Abu Hafs al-Kabirdan hadis rivoyat qilganlar. Hijriy 328 (milodiy 941) yilda vafot etganlar"
        ]
    },
    {
        "word": "Sulaymon alayhissalom",
        "type": [],
        "definition": [
            "Sulaymon alayhissalom Banu Isroilga yuborilgan nabiylardan biri bo'lib, Dovud alayhissalomning o'g'illaridir. Sulaymon alayhissalomga ham, xuddi otalariga berilganidek, podshohlik bilan payg'ambarlik qo'shib berilgan. Bu haqda Alloh taolo Naml surasida quyidagilarni aytadi:\r\n    'Sulaymon Dovudga voris bo'ldi va: 'Ey odamlar, bizga qush tili o'rgatildi va har bir narsadan berildi. Bu, albatta, ochiq-oydin fazldir', dedi' (16-oyat).\r\n    Ushbu oyatdagi 'vorislik' otaning vafotidan keyin undan qolgan mol-mulkka nisbatan oddiy vorislik emas, balki ilmga vorislikdir.\r\n    Sulaymon alayhissalomga otalaridan mazkur ilm meros qilib berilgan paytda u kishi yosh edilar. Shunga qaramay, o'zlaridagi Alloh taolo tomonidan ato etilgan iqtidor ila otalarining mulkini oqilona idora qila boshladilar. Podshoh bo'lganlaridan so'ng to'rt yil o'tgach, otalarining vasiyatlariga amal qilib, Baytul maqdisni qurishni boshladilar. Katta miqdorda mablag' sarflab, bu qurilishni yetti yilda nihoyasiga yetkazdilar. Shahar atrofiga aylantirib qo'rg'on qurdilar.\r\n    U zot yosh bo'lsalar ham, Alloh taolo bergan fazl va hikmat ila otalarining tiriklik chog'idayoq ko'zga ko'rinib qolgan edilar.\r\n    Bir kuni o'z davrining payg'ambari va podshohi bo'lmish Dovud alayhissalomning huzurlariga ikki kishi oralarida hukm chiqarilishini so'rab kelishdi. Ulardan biri ekinzor sohibi, ikkinchisi qo'ylar suruvining egasi edi.\r\n    Dovud alayhissalom qo'ylarning kechasi tarqalib, ekinzorni payxon qilgani, yeb bitirgani haqidagi ikki tomonning gapini eshitib bo'lgach, qo'ylarning ekinzor egasiga berilishi kerakligi haqida hukm chiqardilar.\r\n    Payxon qilinib, yo'q bo'lgan ekinzor o'rniga uni payxon qilgan qo'ylarni olib berish bir qarashda ayni adolat edi. Ushbu hukm chiqarilgach, qo'ylarning egasi uyiga qaytayotib, yo'lda Sulaymon alayhissalomni uchratib qoldi va bo'lgan voqeani u zotga aytib berdi.\r\n    Shunda Sulaymon alayhissalom otalari Dovud alayhissalomning huzurlariga kirib: 'Ey Allohning nabiysi, hukm siz chiqargan hukmdek bo'lmasligi kerak edi', dedilar. Dovud alayhissalom: 'Qanday bo'lishi kerak edi?' deb so'radilar. Sulaymon alayhissalom: 'Qo'ylarni ekinzorning egasiga bering, u foydalanib tursin. Ekinzorni esa qo'ylarning egasiga bering, uni tuzatib, asl holiga keltirsin. So'ng har kim o'z narsasini qaytarib oladi. Ekinzor egasi ekinzorini eski holiga kelganidan so'ng qaytarib oladi. Qo'ylarning egasi ham ana o'shanda qo'ylarini qaytarib oladi', dedilar. Shunda Dovud alayhissalom: 'Hukm sen chiqargan hukmdir', dedilar.\r\n    Alloh taolo Dovud alayhissalomga bergani kabi Sulaymon alayhissalomga ham ko'pgina fazllarni berdi. Bu fazllar Sulaymon alayhissalom uchun mo''jizalar edi. O'sha fazllarning ba'zilari haqida Sod surasida shunday marhamat qilingan:\r\n    'Unga shamolni beminnat xizmatkor qilib qo'ydik, uning amri bilan u iroda qilgan tomonga mayin esaveradi. Yana barcha binokor va g'avvos shaytonlarni ham. Boshqalarini ham kishanlangan holda to'plab (bo'ysundirdik)' (36–38-oyatlar).\r\n    Sulaymon alayhissalomga Alloh taolo tomonidan berilgan fazllar haqida Saba' surasida quyidagilar aytiladi:\r\n    '...va Sulaymonga shamolni (berdik). Uning (shamolning) ertalab ketishi bir oylik, kechqurun qaytishi bir oylik yo'l edi. Unga mis bulog'ini oqizib qo'ydik va jinlardan Robbining izni ila uning huzurida ishlaydiganlari bor edi. Ulardan kim amrimizdan chiqsa, unga qattiq olov azobini tottiramiz' (12-oyat).\r\n    Ya'ni Sulaymon alayhissalomga berilgan o'sha shamol ertalabdan tushgacha bir oylik yo'lni, tushdan kechqurungacha yana bir oylik yo'lni bosib o'tar, bir kunda ikki oylik yo'lni yurib qo'yar edi.\r\n    'Ular (jinlar) unga mehroblar, haykallar, hovuzlar kabi laganlar va sobit qozonlardan xohlaganini qilib berishar edi. Ey Oli Dovud, shukr qilinglar! Bandalarimdan shukr qiluvchilari ozdir' (13-oyat).\r\n    Ha, bu narsalar Alloh taolo tomonidan Sulaymon alayhissalomga berilgan fazldir.\r\n    Alloh taolo Sulaymon alayhissalomga jinlardan ham, insonlardan ham, qushlardan ham lashkar berdi. Albatta, u zotga dunyodagi hamma odamlar emas, balki o'zlari yashab turgan joydagi ma'lum bir kishilar askar bo'lishgan. Shuningdek, jinlar va qushlardan ham ma'lum miqdori u zotga askarlik qilganlar.\r\n    Ushbu oyatda ana shu askarlarning Sulaymon alayhissalom huzurlarida saf tortib, tizilib turganlari vasf qilinmoqda. Demak, ular muhim bir safar oldidan shu tarzda tizilib, yo'lga tushganlar.\r\n    Sulaymon alayhissalomga berilgan fazllar haqida Naml surasida ham so'z yuritilgani yuqorida aytildi. Ushbu surada u zot bilan bo'lib o'tgan quyidagi hodisalarning bayoni kelgan.\r\n    Sulaymon alayhissalom o'zlarining jin, inson va qushlardan iborat askarlari bilan yurib borayotgan edilar.\r\n    'Ular chumolilar vodiysiga kelganlarida bir chumoli: 'Ey chumolilar, maskanlaringga kiringlar, Sulaymon va uning askarlari bilmasdan sizlarni ezib yubormasin', dedi' (18-oyat).\r\n    Odatda to'p-to'p askarlar saf bo'lib o'tganlarida uncha-buncha narsaga e'tibor bermay, duch kelgan narsani oyoqosti qilib ketaveradilar.\r\n    'Ular chumolilar vodiysiga kelganlarida…'\r\n    Ya'ni chumolilar yashaydigan joyga yetganlarida...\r\n    O'sha chumoli, ehtimol, chumolilar vodiysining xavf-xatardan ogohlantiruvchi mas'uli bo'lgandir. Shu sababli u ularga inlariga kirib turishni maslahat berdi. Uning bu gaplarini Sulaymon alayhissalom ham eshitdilar va\r\n    '...uning so'zidan tabassum qildi va: 'Robbim, menga va ota-onamga bergan ne'matlaringga shukr etishimni va Sen rozi bo'ladigan solih amallar qilishimni nasib qilgin va rahmating ila meni solih bandalaringga qo'shgin', dedi' (19-oyat).\r\n    Sulaymon alayhissalom chumolining so'zlarini eshitib jilmaydilar. Darhaqiqat, kichik bir jonzotning shunchalik ziyrak va hushyor bo'lishi, boshqalarining bu boshliqqa itoat qilishi ajoyib holat edi. Shu bilan birga, chumolilarning gaplarini eshitish, tushunish yana ham ajoyib va kishini quvontiradigan ish. Bu Allohning ne'mati edi. Shuning uchun ham Sulaymon alayhissalom darhol shukr keltirdilar:\r\n    'Robbim, menga va ota-onamga bergan ne'matlaringga shukr etishimni va Sen rozi bo'ladigan solih amallar qilishimni nasib qilgin'.\r\n    Shuningdek, Alloh rozi bo'ladigan solih amallar qilishga muyassar bo'lish ham katta fazldir. Unga ham Allohga sidqidildan shukr qila oladiganlar muyassar bo'la oladilar, xolos.\r\n    '...rahmating ila meni solih bandalaringga qo'shgin'.\r\n    Shundan keyin askarlar yana saf tortishdi. Sulaymon alayhissalom ularni birin-ketin ko'zdan kechira boshladilar.\r\n    'U qushlarni tekshirdi-da, dedi: 'Nega Hudhudni ko'rmayotirman yoki u g'oyiblardan bo'ldimi?' (20-oyat)\r\n    Sulaymon alayhissalom lashkarni tekshirib kelib, qushlar bo'limiga yetganlarida safda Hudhud (popishak) yo'qligini payqab qoldilar.\r\n    'Nega men Hudhudni ko'rmayotirman yoki u g'oyiblardan bo'ldimi?' dedilar.\r\n    So'ng Sulaymon alayhissalom qattiq ohangda dedilar:\r\n    'Yo men uni shiddatli azob-la azoblarman yoki so'yib yuboraman, yo u menga ochiq-oydin hujjat keltiradi' (21-oyat).\r\n    Bu qilgan ishi uchun Hudhudga albatta shiddatli azob beraman. Bir yo'la so'yib yuborishim ham mumkin. Yoki bo'lmasa uzrini tasdiqlovchi arzirli hujjat keltirishi shart.\r\n    'Ko'p o'tmay, u kelib dedi: 'Men sen bilmagan narsani bildim va senga Saba'dan ishonchli bir xabar olib keldim' (22-oyat).\r\n    Saba' Arabiston yarimorolining janubida, Yamanda joylashgan bir mamlakat edi. Hudhud ana o'sha yerdan o'ta muhim – ham payg'ambar, ham podshoh, ham insu jin va qushlardan iborat lashkarga bosh bo'la turib, Sulaymon alayhissalom bilmagan – bir xabarni keltirganini aytdi. So'ng Hudhud to'xtamay, so'zida davom etdi:\r\n    'Men bir ayolni ko'rib qoldim. U ularning malikasi ekan. Unga har narsadan berilgan ekan. Hamda uning ulug' taxti bor ekan. Men uning va qavmining Allohni qo'yib, quyoshga sajda qilayotganlarini va shayton ularga amallarini ziynatlab, yo'ldan to'sayotganini ko'rdim. Bas, ular hidoyat topmaslar' (23–24-oyatlar).\r\n    Hudhud muhim xabarni aytib bo'ldi.\r\n    Sulaymon alayhissalom Hudhudga: 'Sening gaping asosida darhol bir hukm chiqarishga oshiqmaymiz, keltirgan xabaring rostmi yoki yolg'on ekanini tekshirib ko'ramiz', dedilar.\r\n    So'ng bir xat yozib, muhr bosib, Hudhudga berdilar. Hudhud maktubni olib yo'lga chiqdi. Saba' mamlakatiga yetib kelib, saroyga yaqin joyga maktubni tashlab qo'ydi va o'zi chetga chiqib turdi. Bu maktub qanday qilib malikaning qo'liga tushgani surada aytilmagan. Gap malikaning maktubni olib, u haqda a'yonlariga xabar berayotgan joyidan davom etadi.\r\n    Malika a'yonlariga maktub haqida xabar berdi. U odamlari bilan maslahatlashib ish ko'rar edi. Shu bilan birga, malika o'zi sezgan belgilar asosida maktubning karomatli ekanini ham aytib, maslahat so'ragan edi, a'yonlar biror fikr aytishdan o'zlarini olib qochishdi.\r\n    Ana shundan keyin malika o'z qarorini aytdi:\r\n    'Podshohlar biror shahar-qishloqqa kirsalar, uni vayron qilurlar va uning aziz ahllarini xor qilurlar. Ana shunday qilurlar. Men ularga bir hadya yuborurman, ko'ray-chi, elchilar nima bilan qaytar ekanlar' (34–35-oyatlar).\r\n    Saba' malikasining elchisi hadyani olib kelib, Sulaymon alayhissalomga taqdim etdi. Bu ish u zotga yoqmadi. Allohning yo'liga qilgan da'vatlarini qabul qilish o'rniga mol-dunyo bilan ko'ngillarini olishga urinayotganlaridan achchiqlari chiqdi. Elchiga qarab:\r\n    'Menga mol-dunyo ila madad bermoqchimisiz?! Bas, Alloh menga bergan narsa sizga bergan narsadan yaxshidir...' (36-oyat) dedilar.\r\n    Elchi qaytib borib, bo'lgan voqeani aytdi.\r\n    So'ng Sulaymon alayhissalom Saba' malikasining o'z odamlari bilan kelayotganidan xabardor bo'ldilar. Shunda u zot:\r\n    'Ey a'yonlar! Ular menga taslim bo'lib kelishlaridan oldin qaysingiz huzurimga uning taxtini keltira oladi?' dedi' (38-oyat).\r\n    Saba' malikasi o'z odamlari bilan yo'lga chiqibdi. Ular bu yoqqa kelishmoqda. Sizlardan qay biringiz ular menga taslim bo'lib yetib kelishlaridan avval huzurimga malikaning taxtini yetkazib kela oladi?\r\n    'Jinlardan bo'lgan ifrit: 'Men uni senga maqomingdan turguningcha keltirurman. Men bunga quvvatli va ishonchliman', dedi' (39-oyat).\r\n    Arab tilida yomonlikda uchiga chiqqan va quvvatli jin-shayton 'ifrit' deyiladi. Bu so'z shaytonga o'xshash odamga nisbatan ham ishlatiladi. Sulaymon alayhissalomning mazkur gaplaridan keyin u zotning askarlaridan bo'lgan ifrit:\r\n    'Men uni senga maqomingdan turguningcha keltirurman. Men bunga quvvatli va ishonchliman', dedi'.\r\n    Aftidan, uning bu gapi Sulaymon alayhissalomga yoqmadi. Shunda:\r\n    'Kitobdan ilmi bor zot: 'Men uni senga ko'zingni ochib yumguningcha keltirurman', dedi. (Sulaymon) uning o'z huzurida qaror topganini ko'rgach, 'Bu Robbimning fazlidandir. Men shukr qilamanmi yoki noshukrlik qilamanmi, sinash uchundir. Kim shukr keltirsa, o'zi uchungina shukr qilur. Kim noshukrlik qilsa, Robbim g'aniydir, karamlidir', dedi' (40-oyat).\r\n    Ulamolarimiz ushbu oyati karimada zikr qilingan 'kitobdan ilmi bor zot'ning kimligi haqida ko'pgina fikrlarni ilgari surishgan. Jumladan, 'U Tavrotni, Ismul a'zamni biladigan shaxs edi', 'Ismi Osaf ibn Barxiyo edi', 'Lavhul mahfuzdan xabari bor edi' degan gaplarni aytishgan. Lekin Qur'oni Karim yoki Nabiy sollallohu alayhi vasallamning o'zlari biror narsa aytmaganlaridan keyin, boshqa biror ishonchli ilmiy dalil bo'lmagach, Qur'on iborasi bilan kifoyalanib, Alloh o'sha shaxsni 'kitobdan ilmi bor' deb aytibdi, u yog'ini O'zi biladi, deyishimiz to'g'riroqdir.\r\n    Ba'zi bir ulamolar esa: 'Kitobdan ilmi bor zot' Sulaymon alayhissalomning o'zlari', deyishgan. Agar shunday bo'lganida, oyatda zikr qilinar edi. Zikr qilinmabdimi, demak, u boshqa shaxs.\r\n    Xullasi kalom, ifritdan keyin 'kitobdan ilmi bor zot' Sulaymon alayhissalomga:\r\n    'Men uni senga ko'zingni ochib yumguningcha keltirurman', dedi'.\r\n    'Men ifritga o'xshab, ishni cho'zib o'tirmayman'.\r\n    Demak, Alloh taolo Sulaymon alayhissalomga qo'lidan shunchalik ishlar keladigan maxluqotlarni ham askar qilib qo'ygan ekan.\r\n    Darhaqiqat, shunday bo'ldi ham. Malikaning taxti keltirildi.\r\n    '(Sulaymon) uning o'z huzurida qaror topganini ko'rgach: 'Bu Robbimning fazlidandir', dedi.\r\n    Bir zumda ro'y bergan bu hodisa Sulaymon alayhissalomni shoshirib qo'ymadi. O'sha g'aroyib ishni amalga oshirgan ilmli shaxs o'z askarlaridan ekani u zotni g'ururlantirib yubormadi. Huzurlarida Saba' malikasining taxti turganini ko'rib, tug'yonga ham bormadilar. Darhol dillariga, tillariga 'Bu Robbimning fazlidandir' degan fikr, so'z keldi.\r\n    Saba' malikasi yaqinlashganda, Sulaymon alayhissalom dedilar:\r\n    'Uning taxtini tanimaydigan qilib qo'ying. Ko'raylik-chi, (malika) uni tanirmi yoki tanimaydiganlardan bo'lurmi?' (41-oyat)\r\n    Saba' malikasi taxtni ko'rib, o'zinikiga o'xshatdi. Meniki deyin desa, Saba'da qolgan taxt o'zidan oldin qanday qilib bu yerda paydo bo'ladi? Meniki emas deyin desa, o'zinikidan hech farqi yo'q. Shuning uchun: 'Xuddi o'shaning o'zi' (42-oyat) deb ikki tomonga bursa ham bo'laveradigan javob qildi.\r\n    Sulaymon alayhissalom Saba' malikasiga mo''jiza ketidan mo''jiza ko'rsatishda davom etdilar. Bu safar ajoyib saroyni ko'rsatib: 'Unga 'Saroyga kir', deyildi' (44-oyat).\r\n    Malika saroyni ko'rgan chog'ida uning maydonini suv deb o'ylab, kiyimi ho'l bo'lmasligi uchun etaklarini ko'tarib oyoqlarini ochdi. Malikaning bu holini ko'rgan Sulaymon alayhissalom unga izoh berib: 'Bu billurdan silliq qilib yasalgan saroy', dedi' (44-oyat).\r\n    Ana shunda malika ro'y berayotgan hodisalar oddiy emasligiga, balki Alloh yuborgan payg'ambarning mo''jizalari ekaniga ishonch hosil qildi. Alloh taoloning qudratiga tan berdi.\r\n    Qur'oni Karimda qissalari kelgan payg'ambarlardan faqat Sulaymon alayhissalomninggina vafotlari qanday bo'lgani oyat ila bayon qilingan. Bu vafotda ham hamma uchun katta ibrat borligi uchun shunday qilingan bo'lsa, ajab emas.\r\n    Alloh taolo Saba' surasida quyidagilarni aytadi:\r\n    'Biz unga o'limni hukm etganimizda, asosini yeyayotgan yog'och qurtidan boshqa hech bir narsa uning o'limi haqida dalolat qilmadi. Yiqilganida, jinlarga – agar ular g'aybni bilganlarida – xorlovchi azobda qolmagan bo'lishlari ayon bo'ldi' (14-oyat).\r\n    Alloh taolo Sulaymon alayhissalomning jonlarini u zot jinlarni ishlatib qo'yib, asolariga suyanib turganlarida olgan. Jinlar esa 'Sulaymon kuzatib turibdi' deb, qo'rqqanlaridan mashaqqatli ishlarida davom etaverganlar.\r\n    Alloh taoloning irodasi bilan bir yog'och qurti Sulaymon alayhissalom suyanib turgan asoni yeya boshlagan. Qurt asoni ma'lum miqdorda yeganidan keyin asoning tayanch nuqtasiga futur yetib, joyidan surilgan va Sulaymon alayhissalom yerga yiqilganlar. O'shandagina jinlar o'z da'volariga qarshi o'laroq, g'ayb ilmini bilmasliklarini tushunib yetishgan, ana shundagina jinlarga –\r\n    'agar ular g'aybni bilganlarida – xorlovchi azobda qolmagan bo'lishlari ayon bo'ldi'.\r\n    Holbuki, ba'zi odamlar o'sha ojiz jinlarga ibodat qilib, ularni 'G'aybni biladilar' deb ulug'lamoqdalar.\r\n    O'shanda Sulaymon alayhissalom ellik uch yoshda bo'lgan ekanlar (mil. avv. 985–932 yillar). U zot Baytul maqdisga dafn etilganlar.\r\n    Sulaymon alayhissalom qirq yil podshohlik qilib, yer yuzida Allohning shariatini yo'lga qo'ydilar. U zotning vafotlaridan keyin o'rinlariga o'g'illari Rohba'om podshoh bo'ldi. U kishidan so'ng Banu Isroil zaiflashdi, fasodlari yanada ortdi."
        ]
    },
    {
        "word": "Sulaymon ash-Shargʻiy",
        "type": [],
        "definition": [
            "Abu Sa'id Sulaymon ibn Dovud ash-Sharg'iy Abu Hafs al-Kabir va Muhammad ibn Salom al-Paykandiydan ta'lim olganlar. O'zlaridan esa Muhammad ibn Nasr ibn Xalaf hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Sulaymon Aʼmash",
        "type": [],
        "definition": [
            "Sulaymon A'mash – hadisni Abu Voildan rivoyat qilgan roviy"
        ]
    },
    {
        "word": "Sulaymon ibn Yasor",
        "type": [],
        "definition": [
            "Sulaymon ibn Yasor al-Hiloliyning kunyalari Abu Abdulloh al-Madaniy. Bu zot Maymuna onamizning qullari bo'lganlar. Ba'zilar u kishini Ummu Salama onamizning mukotab qullari, deb ham aytishadi. Bu zot fozil, faqih, ibodatli kishilardan edilar. Hadislarni Maymuna, Ummu Salama, Oisha onalarimiz, Zayd ibn Sobit, Ibn Abbos, Ibn Umar, Abu Hurayralardan rivoyat qiladilar. Taqriban hijratning 107-yili 73 yoshda vafot etganlar."
        ]
    },
    {
        "word": "Sulh ",
        "type": [],
        "definition": [
            "'Sulh' so'zi lug'atda oradagi nizodan keyin 'yarashish', kelishish ma'nosini anglatadi. Shar'iy istilohda esa: Sulh nizoni ko'taradigan shartnomadir. Sulhning shariatga kiritilishi oyat va hadislar asosida bo'lgan."
        ]
    },
    {
        "word": "Sunani Abu Dovud",
        "type": [],
        "definition": [
            "Bu hadis to'plami muallifi Imom Abu Dovud Sulaymon al Ash'as ibn Ishoq ibn Bashir ibn Shaddod ibn al Azdiy as-Sijistoniy rohimahulloh mashhur muhaddislardan. Hijriy 202 (milodiy 817) yili Sijistonda (hozirgi Eron hududida) tug'ilgan. Yoshlikdan hadis ilmiga qiziqib, Iroq, Xuroson, Shom, Misr, Arab jazirasiga safar qilgan va hadis eshitib, ularni rivoyat qilgan. Keyinchalik mashhur shayx, roviy, hofiz bo'lib yetishgan. Imom Buxoriy, Imom Ahmad, Imom Termiziy bilan uchrashgan. Imom Abu Dovud besh yuz ming hadisni yozib olib, ular ichidan 4800 tasini tanlab, 'Sunan' kitobiga kiritgan va ularni 35 ta kitob va 1871 bobga ajratgan.\r\n    Abu Dovud: 'Kitobimga sahihlarni, unga o'xshashlarni va unga yaqin hadislarni kiritdim. Bu kitobimda ulamolar tark qilishga ijmo' qilgan hech bir hadisni zikr qilmadim. Kuchli zaiflik bo'lgan biron hadis bo'lsa, uni bayon qildim', degan. 'Sunani Abu Dovud'ning roviylaridan biri Ibn A'robiy: 'Agar biron kishining huzurida ilm kitoblaridan Mushaf va Abu Dovudning kitobi bo'lsa, u boshqa hech narsaga ehtiyoj sezmaydi', degan.\r\n    Ushbu asar 'kutubus-sitta'ning uchinchisi bo'lib, ahamiyati jihatidan faqat Imom Buxoriy va Muslimlarning 'Sahih'idan keyinda turadi. Abu Dovudning 'Sunan'i haqida Zakariyo Soniy bunday degan: 'Qur'on – Islomning asli, 'Sunani Abu Dovud' Islomning ahdidir'. Olimlarning e'tiroficha, bu kitobda hadisi sharif bilan isbot qilinmagan birorta shariat masalasi qolmagan. Unga bir necha sharh va muxtasarlar ham yozilgan. Abu Dovud shunday degan: 'To'rt hadisni bilib, amal qilish odamga dini uchun kifoya qiladi. O'sha to'rt hadis ushbulardir: 'Amallar niyatga ko'radir', 'Behuda narsani tark etish kishi Islomining go'zalligidandir', 'Mo'min o'ziga ravo ko'rgan narsasini birodariga ham ravo ko'rmagunicha mo'min bo'la olmaydi', 'Halol ayon, harom ham ayon, ikkisi o'rtasida shubhali narsalar bordir'.\r\n    Imom Abu Dovud hijriy 275 (milodiy 889) yil shavvol oyining 16 kuni Basrada vafot etgan."
        ]
    },
    {
        "word": "Sunani Dorimiy",
        "type": [],
        "definition": [
            "Mazkur mo''tabar majmua yana bir ulug' hamyurtimiz, mashhur olim imom Dorimiyning qalamiga mansubdir.\r\n    Hofizul-kabir Abu Muhammad Abdulloh ibn Abdurrahmon ibn Fazl ibn Bahrom ibn Abdussamad Tamimiy as-Samarqandiy ad-Dorimiy rohimahulloh Movarounnahrning atoqli allomalaridan bo'lib, yetuk muhaddis edi. U hijriy 182 (milodiy 797) yili Samarqandda tug'ilgan. Bobosi asli arab bo'lib, Xuroson fathidan so'ng Samarqandni vatan tutib qolgan. Olimlarning ta'kidlashlaricha, Imom Dorimiy aqlda, fahmda, dindorlikda, halimlik va zuhdda bemisl bo'lgan. U kishi Makka, Madina, Xuroson, Shom, Iroq, Misrda hadis o'rgangan. Imom Muslim, Abu Dovud, Termiziy, Nasoiylar undan hadis rivoyat qilishgan. Eng mashhur kitobi 'Sunani Dorimiy' 'Olti sahih'ning oltinchisi bo'lishga haqli deb topilgan. Dorimiy unda 3465 ta hadisni jamlagan. Imom Dorimiy hadis ilmi olimi bo'lish bilan bir qatorda, tafsir va fiqh ilmida ham peshqadam bo'lgan. Uning 'Savmu mustahoza val-mutahayyira' degan fiqh kitobi va Qur'oni karimning ba'zi juzlariga yozilgan tafsiri ham bor, lekin tafsir bizgacha yetib kelmagan.\r\n    Shayx Aloiy: 'Dorimiyning kitobi 'Sunani Ibn Moja'ning o'rniga olti kitobning oltinchisi qilinsa, munosibroq bo'lar edi', degan, chunki 'Sunani Dorimiy'da zaif roviylar kam bo'lib, shozz va munkar hadislar juda oz uchraydi, uning sanadi ham oliyroqdir.\r\n    Imom Dorimiy 255 (milodiy 870) yili vafot etgan va juma kuni dafn qilingan, qabri Samarqandda."
        ]
    },
    {
        "word": "Sunani Ibn Moja",
        "type": [],
        "definition": [
            "Mazkur to'plamning muallifi imom Ibn Moja Qazviniydir. Imom Abu Abdulloh Muhammad ibn Yaziyd ibn Abdulloh ibn Moja Rib'iy al Qazviniy rohimahulloh mashhur hadis imomlaridandir. Hijratning 209 (milodiy 824) yili Iroqning Qazvin shahrida tug'ilgan.\r\n    'Sunani Ibn Moja'dagi hadislar soni 4341 ta bo'lib, ular 37 kitob va 1515 fiqhiy boblarga ajratilgan. Imom Ibn Moja ushbu 'Sunan'da faqat sahih hadislarni keltirishni shart qilib qo'ymagan. 'Sunani Ibn Moja'ga jami 3002 ta hadis kiritilgan. Imom Ibn Mojaning 'Sunani Ibn Moja', 'Tafsiri Ibn Moja', 'Tarixi Ibn Moja' asarlari ham mashhurdir.\r\n    'Sunani Ibn Moja' kitobini yuqorida nomi zikr qilingan besh kitob qatoriga oltinchi qilib ilk bor Abul Fazl Maqdisiy kiritgan.\r\n    Imom Ibn Moja hijriy 273 (milodiy 882) yili vafot etgan."
        ]
    },
    {
        "word": "Sunani Termiziy",
        "type": [],
        "definition": [
            "Bu asarning muallifi imom Abu Iso Muhammad ibn Iso az-Zahhok as-Sulamiy al Bug'iy at-Termiziy rohimahullohdir. U zot Movarounnahrning mashhur muhaddislaridan bo'lib, hijriy 209 (milodiy 824) yili Termiz yaqinidagi Bug' qishlog'ida tug'ilgan. Imom Buxoriy, Imom Muslim, Abu Dovudlardan dars olgan. Shogirdlarining yozishicha: 'Imom Buxoriyning vafotlaridan keyin Xuroson yurtida ilm, zehn, taqvo va zuhd borasida Abu Iso at-Termiziydek zot topilmaydi'.\r\n    Imom Termiziyning eng mashhur kitobi 'Al-Kitab al aziym'dir ('Al-Jome' as-sahih'), u 'Sahihi Termiziy', 'Sunani Termiziy' nomlari bilan mashhur bo'lib, 'Olti sahih'ning to'rtinchisi hisoblanadi. Undagi hadislarni to'plash uchun imom Termiziy Xuroson, Iroq, Shom yurtlarida, Makka va Madina shaharlarida ilmiy safarda bo'lgan.\r\n    Imom Termiziy 'Sunan'ida faqat sahih hadislarni keltirishni o'ziga shart qilib qo'ymagan, shuning uchun unda sahih, hasan hadislar bilan bir qatorda zaif va illatli hadislarni ham zikr qilib, ularning zaiflik sabablarini bayon qilgan.\r\n    'Sunani Termiziy'dagi hadislar soni 4000 taga yaqin bo'lib, muallif ularni 42 bobga ajratgan.\r\n    Imom Termiziy: 'Bu kitobni yozib, Iroq ulamolariga ko'rsatdim, unga xayrixohlik bildirishdi, Xuroson ulamolariga ko'rsatdim, ular ham xayrixohlik bildirishdi. Kimning uyida mana shu kitob bo'lsa, o'sha uyda Payg'ambar so'zlayotgandek bo'ladi', degan.\r\n    Bundan tashqari, imom Termiziyning 'Ash-Shamoil an-nabaviyya', 'Kitabul-ilal', 'Kitabut-tarix', 'Kitabuz-zuhd', 'Kitab al asmo val-kuna' va boshqa ko'pgina asarlari bor.\r\n     Imom Termiziy hijriy 279 (milodiy 892) yili vafot etgan, qabri hozirgi Surxondaryo viloyatining Sherobod tumanidadir."
        ]
    },
    {
        "word": "Sunnat ",
        "type": [],
        "definition": [
            "Shariat jazm bo'lmagan holda talab qilgan, uni qilgan odam savob olib, qilmagan mazammat qilinmaydigan amal 'sunnat' deyiladi."
        ]
    },
    {
        "word": "Sunnat roʻza",
        "type": [],
        "definition": [
            "asululloh sollallohu alayhi vasallam bardavom tutib yurgan ixtiyoriy ro'za. Oshuro oyining to'qqizinchi va o'ninchi kunining ro'zasi sunnat hisoblanadi."
        ]
    },
    {
        "word": "Sunnati zoida",
        "type": [],
        "definition": [
            "Sunnati zoida – yeyish-ichish, yurib-turish, uxlash kabi ishlarda Payg'ambarimiz sollallohu alayhi vasallamga iqtido qilish."
        ]
    },
    {
        "word": "Sunnati mashruʼa",
        "type": [],
        "definition": [
            "Sunnati mashru'a – dushanba va payshanba kunlari ro'za tutish va shunga o'xshash amallar"
        ]
    },
    {
        "word": "Sunnati muakkada",
        "type": [],
        "definition": [
            "Sunnati muakkada, ya'ni ta'kidlangan sunnat.\r\n     Misol uchun, jamoat bilan namoz o'qish. Bu darajadagi sunnat vojibdan keyingi o'rinda turadi"
        ]
    },
    {
        "word": "Sunniy aqiydalar",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining 'Sunniy aqiydalar' deb nomlangan kitoblari.\r\n    Ma'lumki, bugungi kunda Ahli sunna va jamoa aqiydaviy mazhabining asl haqiyqatlarini anglab yetishga ehtiyoj kuchaygan. Zero, aqiyda masalasi musulmon insonning yashash tarzi, hayot nizomi bo'lib, diynimizning mohiyatini, e'tiqodimizning asosini belgilab beruvchi poydevordir. Mazkur kitob ana shu muhim va ulkan mavzuni keng ommaga oson va lo'nda tarzda yetkazish maqsadida yozilgan. Ayni paytda, asarda aqiyda bobida yozilgan eski va yangi kitoblarning uslubidan va ma'lumotlaridan foydalanilgan."
        ]
    },
    {
        "word": "Sunniy taloq",
        "type": [],
        "definition": [
            "Taloqning ikkinchi turi hasan taloq bo'lib uni 'sunniy taloq' ham deb ataladi. Bunda ayolning duxul qilingan yoki qilinmaganiga hamda hayzu nifos ko'rish yoki ko'rmaligiga qarab turli holatlar bo'ladi. Agar ayol duxul qilinmagan, ya'ni, aqdi nikohdan ke-yin er unga erlik qilmagan bo'lsa, hayzda bo'lsa ham uch marta alohida-alohida taloq qilishi sunniy bo'ladi. Ayollar yoshi kichik yoki katta bo'lgani uchun va homilador bo'lgani uchun hayz ko'rmaydilar. Ularni uch oyda bittadan taloq qilsa, sunniy taloq qilgan bo'ladi. Sunniy taloqning hayz va nifos ko'radigan ayollarga nisbatan bo'lishi–xotini hayz va nifosdan pok bo'lganidan so'ng, jinsiy yaqinlik qilmay turib bir taloq qo'yishdir."
        ]
    },
    {
        "word": "Sunh ",
        "type": [],
        "definition": [
            "Sunh – Madinai Munavvaraning chekka joylaridan biri. U bilan Masjidi Nabaviyning orasi bir mil (1848 metr) bo'lgan."
        ]
    },
    {
        "word": "Sunya ",
        "type": [],
        "definition": [
            "'Sunya' 'istisno' ma'nosini anglatadi. Voqe'likda esa, bir narsani noma'lum qismini istisno qilgan holda sotishga aytiladi. Misol uchun, 'Senga ushbu kiyimlarning ba'zisidan boshqasini sotdim', deyishlik. Chunki, bunda ham noma'lumlik bor. Uning oqibati bir tomonga zulm bo'lishi, urish-janjal kelib chiqishi mumkin. Agar o'sha istisno qilingan narsa ma'lum bo'lsa, savdo joiz bo'ladi. Payg'ambarimiz sollallohu alayhi vasallam bunga ruxsat berganlar."
        ]
    },
    {
        "word": "Sura ",
        "type": [],
        "definition": [
            "tizma, qator, qo'rg'on, manzil, sharaf; Qur'onning bo'limlari. Qur'oni karimda 114 ta sura bor."
        ]
    },
    {
        "word": "Surayyo ",
        "type": [],
        "definition": [
            "Surayyo – Savr turkumidagi yulduzlar guruhining nomi"
        ]
    },
    {
        "word": "Sutikan ",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Sutifagʻna",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Sutra ",
        "type": [],
        "definition": [
            "Namozxonning oldidan biror narsa o'tmasligi uchun qo'yilgan to'siq tushuniladi. Devor, ustun, nayza, aso, boshqa biror narsa sutra bo'lishi mumkin. Hech narsa topilmasa, bir chiziq chizib qo'ysa ham, bo'ladi. Maqsad, namozxonning oldidan biror narsa o'tib ko'nglini buzmasin, xususan, shayton vasvasa qilmasin."
        ]
    },
    {
        "word": "Sufyon as-Sakbiyoniy",
        "type": [],
        "definition": [
            "Abu Sa'id Sufyon ibn Ahmad as-Sakbiyoniy Buxoro ahlidan bo'lib, Ya'qub ibn Ibrohim va Abu Tohir Asbot ibn Yasa'dan hadis rivoyat qilganlar. O'zlaridan esa Abu Yusuf Ya'qub ibn Yusuf as-Saffor as-Sikijkatiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Sufiy",
        "type": [],
        "definition": [
            "tasavvuf tariqatiga mansub shaxs, murid."
        ]
    },
    {
        "word": "Sufra ",
        "type": [],
        "definition": [
            "Sufra – xushbo'ylikning bir turi. Uning rangi sariq bo'lib, odatda kelin-kuyovlar ishlatishar ekan. Rasululloh sollallohu alayhi vasallam Abdurrahmon ibn Avfning uylanganini kiyimidagi o'sha dog'dan bilgan ekanlar"
        ]
    },
    {
        "word": "Sufrodan",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Suhayb al-Karminiy",
        "type": [],
        "definition": [
            "Abu Muhammad Suhayb ibn Osim al-Karminiy ilm talabida Iroqqa safar qilganlar. Katta bobolarining amakisi Ismat ibn Qays sahoba edilar. Sufyon ibn Uyayna, Fuzayl ibn Iyoz, Bishr ibn Surriy, Vake' ibn Jarrohdan ta'lim olganlar."
        ]
    }
]