[
    {
        "word": "Shaddod ash-Shargʻiy",
        "type": [],
        "definition": [
            "Abu Hakim Shaddod ibn Sa'id ash-Sharg'iy Buxoroning Sharg' nomli qishlog'idan bo'lib, Nazr ibn Shumayl, Ali ibn Husayn, Salama ibn Hafs va Muhammad ibn Qosim al-Asadiydan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Shajara ",
        "type": [],
        "definition": [
            "Shajara – Madina-Makka yo'lidagi joy nomi."
        ]
    },
    {
        "word": "Shayx ",
        "type": [],
        "definition": [
            "keksa, oqsoqol; ustoz, hadis o'rgatuvchi, olim."
        ]
    },
    {
        "word": "Shayx Abdulvahhob Qaraviy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Misrlik ulamo."
        ]
    },
    {
        "word": "Shayx Abu Abdulloh Muhammad ibn Solih Xatib",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Madinai Munavvaralik ulamo. Imom Muhammad ibn Jazariy rahmatullohi alayhi 768 hijriy sanada hajga borganida Madinai Munavvarada imom bo'lib turgan shayx Abu Abdulloh Muhammad ibn Solih Xatibdan 'Kofiy' va 'Taysir' kitoblarini o'qigan."
        ]
    },
    {
        "word": "Shayx Abu Bakr Abdulloh ibn Jundiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Misrlik ulamo."
        ]
    },
    {
        "word": "Shayx Abu Bakr ibn Musbih Hamaviy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Shayx Abu Muhammad Abdurrohman ibn Bagʻdodiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Misrlik ulamo."
        ]
    },
    {
        "word": "Shayx Abulmaoliy Muhamad ibn Ahmad Labbon",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Damashqlik ulamo."
        ]
    },
    {
        "word": "Shayx Ali ibn Ibrohim Ibn Ahmad Solihiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Shayx Ali ibn Muhammad ibn Ali ibn Nafis",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Shayx Ali ibn Husayn ibn Ali Yazdiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Shayx Ahmad ibn Ibrohim Rummoniy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari."
        ]
    },
    {
        "word": "Shayx Ahmad ibn Ibrohim Tohhan",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Damashqlik ulamo."
        ]
    },
    {
        "word": "Shayx Ahmad ibn Mahmud ibn Ahmad Hijoziy Zarir",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari."
        ]
    },
    {
        "word": "Shayx Ahmad ibn Rajab",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmlaridan ustozlari. Damashqlik ulamo."
        ]
    },
    {
        "word": "Shayx Ziyouddin Saʼdulloh Qazviniy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining ustozlari."
        ]
    },
    {
        "word": "Shayx Moʻmin ibn Ali ibn Muhammad Rumiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Shayx Muso Kurdiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Shayx Najibuddin Abdulloh ibn Qutb ibn Hasan Bayhaqiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari."
        ]
    },
    {
        "word": "Shayx Salohuddin Muhammad ibn Ibrohim ibn Abdulloh Maqdisiy Hanbaliy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining ustozlari"
        ]
    },
    {
        "word": "Shayx Usmon ibn Umar ibn Abu Bakr Ali Noshiriy Zubaydiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari."
        ]
    },
    {
        "word": "Shayx Yusuf ibn Ahmad ibn Yusuf Habashiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining shogirdlari"
        ]
    },
    {
        "word": "Shayxoni – Ikki Shayx",
        "type": [],
        "definition": [
            "Imom Abu Hanifa va Abu Yusuf rahmatullohi alayhilar."
        ]
    },
    {
        "word": "Shayxul islom",
        "type": [],
        "definition": [
            "muayyan mamlakatda islom tashkilotlari boshlig'i – oliy diniy unvon"
        ]
    },
    {
        "word": "Shak ",
        "type": [],
        "definition": [
            "gumon, shubha"
        ]
    },
    {
        "word": "Shaqiqa",
        "type": [],
        "definition": [
            "Shaqiqa – boshning yarmi va ikki chekkasi og'riydigan kasallik; migren. Uning chakkadagi tomirlarning lo'qillab og'rishi, ko'ngil aynishi, qusish kabi alomatlari bor."
        ]
    },
    {
        "word": "Shamvil alayhissalom",
        "type": [],
        "definition": [
            "Banu isroilliklar Shamvil alayhissalomdan ularga bir podshoh tayin etishlarini talab qilishdi va o'sha podshohning rahbarligi ostida urushda qatnashishlarini aytishdi. Shunda u zot ularga Tolutni yetakchi sifatida tanladilar. Alloh subhanahu va taolo bu haqda Baqara surasida quyidagilarni aytadi:\r\n    'Nabiylari ularga: 'Albatta, uning podshohligining oyat-belgisi – sizlarga ichida Robbingizdan sandiq kelmog'idir, unda xotirjamlik va Oli Musodan hamda Oli Horundan qolgan qoldiq bor. Uni farishtalar ko'tarib kelur. Agar mo'min bo'lsalaringiz, albatta, bu narsada sizlarga oyat-belgi bor', dedi' (248-oyat).\r\n    Banu Isroilga Tolutning haqiqatda Alloh tomonidan tayin qilingan podshoh ekanini isbot etish uchun ularni qoyil qoldiradigan, odatdan tashqari, Allohdan boshqa hech kim uddalay olmaydigan bir mo''jiza ko'rsatilyapti. Ma'lumki, Muso alayhissalomning vafotlaridan keyin Banu Isroilga Yusha' alayhissalom rahbar bo'lgan edilar. O'sha paytda ularni muqaddas yerlaridan haydab chiqargan dushmanlari bir qancha muqaddas narsalarini tortib olishgan edi. Mazkur tortib olingan narsalar ichida Banu Isroilga xos bir mashhur tobut – sandiq ham bor edi. Muso alayhissalom qachon urushga kirsalar, o'sha tobutning o'z qo'shini oldida borishini ta'minlar edilar. Shunda Banu Isroilning qalbiga xotirjamlik tushib, urushdan qochishmasdi. Keyinchalik mazkur tobutga Muso va Horun alayhissalomlardan qolgan esdalik – tabarruk narsalarni solib qo'yishgan edi. Jumladan, mazkur tobutda Alloh taolo Muso alayhissalomga Tur tog'ida bergan lavhlar, u zotning hassalari, kiyimlari, kavushlari, Horun alayhissalomning sallalari kabi narsalar ham bor edi.\r\n    Shamvil alayhissalom: 'Tobutni farishtalar ko'tarib kelishi Tolutning podshohligiga belgidir, agar haqiqiy mo'min bo'lsangiz, ushbu mo''jizaning o'zi kifoya qiladi', dedilar.\r\n    Keyingi oyatlardagi ma'noga qaraganda, bu ish ro'y berib, Banu Isroilda ishonch hosil bo'lganga o'xshaydi:\r\n    'Tolut lashkarlar bilan chiqqanda, 'Albatta, Alloh sizni daryo bilan sinaydi. Kim undan ichsa, u mendan emas va kim uni tanovul qilmasa, u albatta mendandir. Ammo birov qo'li bilan bir hovuch olsa, mayli', dedi. Ozginalaridan boshqalari undan ichdilar. U va u bilan birga iymon keltirganlar undan (daryodan) o'tganlarida, 'Bugun bizda Jolut va uning lashkarlari bilan jang qilishga toqat yo'q', dedilar. Allohga ro'baro' bo'lishga ishonganlar: 'Qanchadan-qancha oz sonli guruhlar Allohning izni bilan ko'p sonli guruhlarga g'olib kelgan. Alloh sabrlilar bilandir', dedilar' (249-oyat).\r\n    Nihoyat Banu Isroilning urushdan qochmay qolgan odamlari Tolutning Alloh tayin qilgan podshoh ekaniga ishontirilgach, Tolut ulardan qo'shin tayyorladi. So'ng urush qilish vaqti yetib keldi. Ular jangga otlandilar. Shunda Tolutning haqiqiy lashkarboshi ekani namoyon bo'ldi. U askarlarining holatini yaxshi bilardi. Ular avvallari mag'lubiyatga uchrab yurgan, xorlikka ko'nikib qolishgan edi. Dushman esa aksincha, kuchli va g'alabaga odatlanib qolgan. Unday dushmanga g'olib kelish uchun mustahkam irodaga ega bo'lish kerak. Shuning uchun Tolut o'z askarlarining irodasini sinab ko'rmoqchi bo'ldi. Shahardan chiqqanlarida sinov shartini e'lon qildi:\r\n    'Albatta, Alloh sizni daryo bilan sinaydi. Kim undan ichsa, u mendan emas va kim uni tanovul qilmasa, u albatta mendandir. Ammo birov qo'li bilan bir hovuch olsa, mayli', dedi'.\r\n    Yo'lda bir imtihon (daryo) uchraydi, kim irodasi kuchli bo'lib, chanqoqlikka chidab, uning suvidan ichmasa, sinovdan o'tgan bo'ladi – Tolutning haqiqiy askariga aylanadi. Kim irodasizlik qilib, daryoning suvidan ichib olsa, askarlikka qabul qilinmaydi. Biroz suvsizlikka chiday olmagan odam urushning mashaqqatlariga chiday olmasligi turgan gap. Shu bilan birga, Tolut tomoqni ho'llab olish uchun suvdan bir ho'plam ichishga ruxsat berdi.\r\n    Yurib borib, daryoga ham yetishdi.\r\n    'Ozginalaridan boshqalari undan ichdilar'.\r\n    Ko'pchiligi sinovdan o'ta olishmadi. Bundan og'ir ishga kirishishdan oldin odamlarni faqat og'zaki sinov emas, balki amaliy sinovdan ham o'tkazish zarurligi bilib olinadi. Birinchi amaliy sinovdayoq Tolutning qo'shini sarasi saraga, puchagi puchakka ajradi. Sinovdan o'tmaganlar ajralib qolishdi.\r\n    'U va u bilan birga iymon keltirganlar undan (daryodan) o'tganlarida, 'Bugun bizda Jolut va uning lashkarlari bilan jang qilishga toqat yo'q', dedilar'.\r\n    Alhol, iymonlilar ichida ham zaiflar paydo bo'ldi. Dushmanga ro'baro' kelganda o'zlarining ozligi, dushmanning kuchli ekanini sezib, urushda qatnasha olmasliklarini, bunga toqatlari yo'qligini bayon qilishdi. Ular vaziyatni o'z tarozilariga solib ko'rib, g'olib kelishlariga ko'zlari yetmadi. Shunda haqiqiy mo'minlar, hamma narsani ilohiy o'lchov bilan o'lchaydiganlar yuzaga chiqishdi.\r\n    'Allohga ro'baro' bo'lishga ishonganlar: 'Qanchadan-qancha oz sonli guruhlar Allohning izni bilan ko'p sonli guruhlarga g'olib kelgan. Alloh sabrlilar bilandir', dedilar'.\r\n    O'zi asl narsa oz bo'ladi. Haqiqiy mo'minlar ham shular jumlasidandir, chunki ular xatarli so'qmoqlardan qiyinchiliklarni yengib o'tib, maqsadga yetadilar va Alloh tanlagan muqarrab bandalar qatoriga kiradilar. Bu hammaga ham nasib qilavermaydi. Undaylar Parvardigori olamga ro'baro' bo'lishlariga qat'iy ishonadilar. Shuning uchun hamma mashaqqatlarni yengishga tayyor bo'ladilar. Hamma narsa 'Allohning izni bilan' bo'lishiga ishonadilar. Shuning uchun sonlari oz bo'lsa ham, qo'rqmaydilar. Ular Alloh sabr qiluvchilar bilan birga ekanini yaxshi biladilar. Allohning O'zidan sabr tilab, qo'rqmay, ko'p sonli va quvvatli dushmanning ko'ziga tik boqib boraveradilar.\r\n    'Jolut va uning askarlariga ro'baro' kelganlarida: 'Robbimiz, ustimizdan sabr to'kkin, qadamlarimizni sobit qilgin va kofir qavmlar ustidan bizga nusrat bergin', dedilar' (250-oyat).\r\n    Ular dushman bilan to'qnashganlarida, duo qilib Allohdan so'raydigan narsalarini so'rashga oshiqdilar. O'sha payt duo qabul bo'ladigan lahzadir. Haqiqiy mo'minlar Allohni hech qachon esdan chiqarmaydilar. Allohning ko'rsatmasiga binoan kerakli tadbirlarni ishga solib, hamma narsa qo'lida bo'lgan Zotga yolvoradilar.\r\n    'Robbimiz, ustimizdan sabr to'kkin' iborasi sabr xuddi to'kiladigan narsadek tasavvur beradi. Xuddi suvni to'kkandek boshidan to'kib yuborsa, oqib oyog'igacha tushadi. Eng kerakli narsa bo'lgani uchun mazkur mo'minlar eng avval sabrni tilga oldilar.\r\n    '…qadamlarimizni sobit qilgin…' – 'bu ulug' ishda qadamimiz toyilmasin, sobit tursin'. Bu ham Allohning yordami bilan bo'ladigan ish.\r\n    '…va kofir qavmlar ustidan bizga nusrat bergin', dedilar'.\r\n    Mo'minlarning orzusi kofirlar ustidan g'olib chiqishdir. Ularning orzusi ro'yobga chiqdi.\r\n    'Bas, Allohning izni bilan ularni tor-mor qildilar va Dovud Jolutni qatl etdi. So'ngra Alloh unga podshohlik va hikmatni berdi va xohlagan narsasini o'rgatdi. Agar Allohning odamlarni bir-birlari bilan daf qilishi bo'lmaganida, yer yuzi buzilardi. Lekin Alloh olamlarga fazlu marhamatlidir' (251-oyat).\r\n    Tolut va uning askarlari Jolut va uning askarlari ustidan g'alaba qozonishdi. Bu g'alaba, albatta, Allohning izni bilan yuz berdi. Hech bir narsa Uning iznisiz bo'lmaydi. Alloh O'z irodasini mo'minlar orqali yuzaga chiqaradi.\r\n    'Bas, Allohning izni bilan ularni tor-mor qildilar va Dovud Jolutni qatl etdi'.\r\n    Dovud Tolut lashkari ichidagi yosh yigit, Jolut esa katta kuchga ega bo'lgan podshoh, hammaning qalbiga dahshat solib turuvchi lashkarboshi edi. Alloh taolo ushbu zolim podshoh va lashkarboshining yoshgina yigitcha qo'lida o'lim topishini iroda qildi. Bu bilan odamlarga, agar Alloh xohlasa, bir yosh yigit har qanday jabborning o'limiga sabab bo'lishi mumkinligini ko'rsatdi. Shu bilan birga, bu ishning ortida boshqa hikmat ham bor edi:\r\n    'So'ngra Alloh unga podshohlik va hikmatni berdi va xohlagan narsasini o'rgatdi'.\r\n    Dovud Allohning inoyati bilan Tolutdan keyin Banu Isroilga podshoh bo'ldilar. Ularning podshohlik davri 'oltin davr' bo'ldi. Alloh taolo u zotga podshohlikka qo'shib hikmatni, ya'ni payg'ambarlikni ham berdi. Shu bilan birga, unga urush asboblarini yasashni ham o'rgatdi."
        ]
    },
    {
        "word": "Shamla ",
        "type": [],
        "definition": [
            "Shamla – en matoligicha o'ranib olinadigan ustki kiyim."
        ]
    },
    {
        "word": "Shams ",
        "type": [],
        "definition": [
            "Quyosh"
        ]
    },
    {
        "word": "Shams surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 15 oyatdan iborat.\r\n    Ushbu suraning nomi o'zining birinchi oyatidan olingandir. 'Shams' – 'quyosh' deganidir. Alloh taolo ushbu surani quyosh bilan qasam ichib boshlagan. Ana shu qasam so'zida ishlatilgan 'shams' kalimasi suraga nom bo'lib qolgan.\r\n    Bu surai karimada Alloh taolo yaxshini yomondan, savobni gunohdan ajrata olmay qolganlarga bu narsalar orasidagi farqni tushuntiradi. Alloh taoloning insonga barkamol jism, aql-idrok, tafakkur berishidan maqsadi ham o'sha yaxshi-yomonni ajratish uchundir. Inson to'g'ri yo'lni tanlasa, saodatga erishadi, noto'g'ri yo'lni tanlasa, badbaxt bo'ladi, do'zaxga tushadi.\r\n    Suraning ikkinchi qismida Samud qavmining misolida osiylikning oqibati nima bilan tugashi eslatiladi.\r\n    Surai karima Alloh taoloning maxluqotlaridan yettitasi: quyosh va uning yog'dusi, undan so'ng keladigan oy, yorishgan nahor, zulmati ila qoplagan tun, osmon va uning bino qilinishi, yer va uning kengaytirilishi hamda nafs va uning to'g'rilanishi ila qasam ichish bilan boshlanadi. Bu bilan agar inson Alloh taologa taqvo qilsa, najot topishi, tug'yon va isyonga ketsa, xusronga uchrashi ta'kidlanadi.\r\n    So'ngra esa Samud qavmi qissasi keltirilib, ular kufrlari, tug'yon va isyonlari tufayli qanday halok bo'lganlari bayon qilinadi. Ulardan boshqalar o'rnak olishlari lozimligiga ishora qilinadi.\r\n    Shams surasining xotimasida Alloh taolo kofir va osiylarni halok qilish oqibatidan zarracha qo'rqmasligi ta'kidlanadi."
        ]
    },
    {
        "word": "Shamsul aimma",
        "type": [],
        "definition": [
            "imomlar quyoshi. Ilmiy unvon."
        ]
    },
    {
        "word": "Shariat ",
        "type": [],
        "definition": [
            "to'g'ri yo'l; ostona va suv ichish joyi, diniy hukmlar majmui; har bir samoviy dinning barcha axloqiy, e'tiqodiy va huquqiy normalari majmui."
        ]
    },
    {
        "word": "Shariyfiya fiy sharhil Kofiya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Bu kitob Ibn Hojibning nahv ilmi bo'yicha yozgan mashhur 'Kofiya' nomli kitobining fors tilidagi sharhidir. U chop qilingan."
        ]
    },
    {
        "word": "Sharif ",
        "type": [],
        "definition": [
            "olijanob, aslzoda, e'zozli, qadrli."
        ]
    },
    {
        "word": "Sharqo ",
        "type": [],
        "definition": [
            "Qulog'i yorilgan hayvon."
        ]
    },
    {
        "word": "Shart ",
        "type": [],
        "definition": [
            "'Shart' so'zi lug'atda 'alomat' ma'nosini bildiradi. Shariatda, bir narsaning vujudga kelishi unga bog'liq bo'lgan va o'zi o'sha narsadan tashqarida bo'lgan narsa 'shart'dir."
        ]
    },
    {
        "word": "Shart ",
        "type": [],
        "definition": [
            "Bir narsaning vujudga kelishi unga bog'liq bo'lgan va o'zi o'shandan tashqarida bo'lgan narsa shartdir. Misol uchun, toharat namozning shartlaridan biridir. Toharat bo'lmasa, namoz vujudga kelmaydi. Ammo toharat namozdan tashqarida qilinadi."
        ]
    },
    {
        "word": "Shartnoma shirkati",
        "type": [],
        "definition": [
            "Shartnoma shirkati. Buning rukni iyjob va qabuldir. Ya'ni, bu xildagi shirkat bir tarafning 'Men senga falon ishda sherik bo'ldim', deyishi va ikkinchisining 'Qabul qildim' deyishi bilan tuziladi. Uning sharti ikkisidan biriga foydadan mu'ayyan dirham belgilanmasligidir. Chunki, o'sha belgilangan dirhamni olganidan keyin sherikligi qolmaydi.\r\nShartnoma shirkati to'rt turli bo'ladi:\r\n1. Mufovaza shirkati;\r\n2. Inon shirkati;\r\n3. Ishchilar shirkati;\r\n4. Vujuh shirkati."
        ]
    },
    {
        "word": "Sharh ",
        "type": [],
        "definition": [
            "Izoh"
        ]
    },
    {
        "word": "Sharh surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 8 oyatdan iborat.\r\n    Bu surai karima 'Sharh', 'Alam nashroh' va 'Inshiroh' nomlari bilan ataladi. Hammasi ham suraning birinchi oyatidagi 'Alam nashroh' degan ta'birdan olingan. 'Sharh' so'zi 'kengaytirish' ma'nosini bildirib, bu oyatda Alloh taolo Nabiy sollallohu alayhi vasallamning ko'kslarini keng qilib qo'ygani haqida so'z ketadi.\r\n    Keyingi oyatlarda Nabiy alayhissalomga berilgan yana bir ulug' ne'mat – u zotning zimmalaridagi da'vat ishining Alloh taolo tarafidan yengillashtirib qo'yilgani alohida ta'kidlanadi. So'ngra Payg'ambar sollallohu alayhi vasallamning maqomlari bu dunyo va oxiratda yuqori ko'tarib qo'yilgani haqida gapiriladi.\r\n    Keyin esa da'vat yo'lida tortilayotgan mashaqqatlar ham esga olinib, osonlik yaqin ekani haqida bashorat beriladi.\r\n    Nihoyat, Payg'ambar sollallohu alayhi vasallamga Alloh taoloning diniga da'vat qilishdan forig' bo'lgan vaqtlarida ibodatga qattiq berilish haqida tavsiya qilinadi.\r\n    Sharh surasi Zuho surasidan so'ng nozil bo'lgan va xuddi uning uzviy davomiga o'xshaydi. Bu sura ham avvalgisiga o'xshab, Muhammad sollallohu alayhi vasallamning o'zlariga xos bo'lib, u zotga Allohning inoyatidan, rioyasidan xabar beradi, tezda yengillik, xursandchilik bo'lishining bashoratini beradi."
        ]
    },
    {
        "word": "Sharhi Kanzud daqoiq",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu kitobi shayx Abulbarakot Abdulloh ibn Ahmad Hofiziddin Nasafiy rahmatullohi alayhining hanafiy mazhabidagi fiqhiy kitobiga yozgan sharhidir. 'Kanzud daqoiq' juda ham mashhur kitob bo'lganidan uning sharhlari ham ko'p bo'lgan. Sayyid Sharif Jurjoniy rahmatullohi alayhining sharhi o'sha bir necha sharhlardan biridir."
        ]
    },
    {
        "word": "Sharhi qasiydati Bonat Suod",
        "type": [],
        "definition": [
            "'Bonat Suod' mashhur shoir Ka'b ibn Zuhayr ibn Abu Salmaning mashhur qasidasining nomidir. Ka'b ibn Zuhayr ibn Abu Salma Rasululloh sollallohu alayhi vasallamni hajv qilar va U Zot uning qonini halol qilgan edilar. Ammo Ka'b ibn Zuhayr ibn Abu Salma o'zi tavba qilib, musulmon bo'ldi va Nabiy sollallohu alayhi vasallamning huzurlariga kelib, u zotni madh qilib, 'Bonat Suod' nomli qasidasini o'qib berdi. Muhammad sollallohu alayhi vasallam uni afv qildilar. Ushbu qasida juda ham mashhur bo'lganidan uni ko'pchilik ulamolar sharhlaganlar va boshqa tillarga tarjima ham qilganlar. Jumladan, uni Sayyid Sharif Jurjoniy rahmatullohi alayhi ham sharh qilgan."
        ]
    },
    {
        "word": "Sharhi Niqoya",
        "type": [],
        "definition": [
            "Ali Qori rahmatullohi alayhining 'Muxtasari Viqoya' ga yozgan sharhi"
        ]
    },
    {
        "word": "Sharhi sharhil muxtasar ʼala kitobi muntahal suaal val amal fiy ilmay al-usul val jadal",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi Ibn Hojib Molikiy rahmatullohi alayhining kitobiga sharhdir. U Misr va Hindistonda chop etilgan."
        ]
    },
    {
        "word": "Sharhis-Suduri bishar-hi holil mavta val quburi",
        "type": [],
        "definition": [
            "Imom Jaloliddin Suyutiyning kitobi"
        ]
    },
    {
        "word": "Sharhu Aqoidi Nasafiya",
        "type": [],
        "definition": [
            "Alloma Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhining bu kitobi shayx Abu Hafs Najmuddin Umar ibn Muhammad Nasafiyning 'Aqoid' kitobiga yozilgan sharhdir. Allomai Taftazoniy rahmatullohi alayhi uni Xorazmda hijriy 768 yilning sha'bon oyida yozib bo'lgan. 'Sharhu Aqoidi Nasafiya'da alloma Taftazoniy tartibga katta e'tibor bergan va qo'shimchalar kiritgan.\r\n    'Sharhu Aqoidi Nasafiya' kitobi nihoyatda mashhur kitoblardandir. Uning toshbosma nusxalari hozir ham ba'zi ahli ilmlarning shaxsiy kutubxonalarida saqlanib keladi. Ushbu satrlarni yozayotgan faqir banda ham 'Sharhu Aqoidi Nasafiya'ni aynan o'sha nusxalardan biridan o'qigan.\r\n    'ShARHU AQOIDI NASAFIYa' KITOBI HAQIDA\r\n    Alloma Taftazoniy rahmatullohi alayhining bizgacha yetib kelgan va hozirgacha ko'pchilik tomonidan katta e'tibor bilan o'rganib kelinayotgan kitoblaridan biri 'Sharhu Aqoidi Nasafiya' nomli asaridir. Bu kitob boshqa bir ulug' vatandoshimiz tomonidan yozilgan matnning sharhidir.\r\n    Bu matnning sohibi Najmuddin Abu Hafs Samarqandiy Nasafiy rahmatullohi alayhidir (h. 460-537, m. 1068-1142).\r\n    Najmuddin Abu Xafs Nasafiy o'z zamonasi va kelajak davrlarning ham ulug' faqihi, tabiatshunosi, tilshunos va muarrixi edi. Allomaning to'liq ismi – Umar ibn Muhammad ibn Luqmon an-Nasafiy al-Moturidiy as-Samarqandiy.\r\n    Bizning zamonamizga allomaning 'Manzilat an-Nasafiya fil Xilofiyat', 'Aqoidun-Nasafiy', 'Al-yavoqit fil mavoqit', 'Zillat al-Qori' asarlari yetib kelgan.\r\n    Abu Hafs Nasafiyning 'Aqoidu Nasafiy' asari ulamolar orasida katta shuhrat qozondi. 768 yili ulug' olim Taftazoniy 'Aqoidun-Nasafiy'ga sharh bitdi. Bu sharh 'Sharhu Aqoidi Nasafiya' nomi bilan ma'lumdir.\r\n    Alloma Taftazoniy rahmatullohi alayhining bu kitobi o'z davridagi aqiyda ilmiga oid ilmiy bahslarning samarasini aks ettirgan kitobdir. Aqoidga oid kitoblarda har bir kitobning yozilayotgan davrida hukm surayotgan e'tiqodiy masalalar va tortishuvlar aks etishi odat tusiga kirgan narsa.\r\n    Alloma Taftazoniy rahmatullohi alayhi o'z kitobining avvalida aqiyda ilmi tarixi va unga odamlarning hojati tushganligi haqida qisqacha tushuntirish beradi:\r\n    'Avvalda o'tgan sahoba va tobe'in roziyallohu anhum aqiydalari musaffo bo'lgani va Nabiy alayhissalomning suhbatlarining barakasi, u zotning zamonlariga yaqinlik, hodisa va ixtiloflarning ozligi hamda ishonchli zotlardan so'rash imkonlari bo'lgani tufayli aqiyda va fiqh ilmlarini tadviyn qilishga, faslu boblarga solishga hamda furu' va usullarning maqsadlarini aytishga hojatlari tushmagan. Ammo musulmonlar orasida fitnalar, din imomlariga qarshi tajovuzlar, fikrlarda ixtilof va bid'atlarga moyillik zohir bo'lib, fatvolar ko'paydi, ulamolarga murojaat ko'payganidan keyin, ular nazar solishga, dalil topishga, ijtihod qilishga, hukm axtarishga, qoidalar va asoslar ishlab chiqishga, bob va fasllarni tartibga solishga o'tishga majbur bo'ldilar'.\r\n    Alloma Taftazoniy rahmatullohi alayhi o'z sharhining boshida, moturidiy aqiydaviy mazhabidagi boshqa olimlar kabi, ma'rifat hosil qilish vositalarini bayon qilish jarayonida aqlning tutgan o'rni va ahamiyatini tushuntiradi.\r\n    'Sharhu aqoidi Nasafiya' kitobining dastlabki mavzulari juda ham qiyin til va uslubda kelgan. Bu ham o'sha zamon ilmiy muhitining ta'siridir. Muallif mazkur vaqtning uslubi, tili hamda istilohlarini ishlatishga majbur bo'lgan. Ayniqsa, Alloh taoloning borligi va zotu sifatini, olamning qadim emasligini bayon qilish jarayoni ko'proq faylasuflarning iboralari va uslubi ila bo'lgan. Bu boblarda oyat va hadislar deyarli keltirilmagan.\r\n    Ammo keyinroqqa kelib, uslub ham, gap-so'zlar ham osonlashib borgan, oyat va hadislardan hujjat-dalillar keltirish ham ko'paygan.\r\n    Alloma Taftazoniy rahmatullohi alayhi avval faqat aqliy dalillar keltirgan bo'lsa, keyinroq oyat va hadisdan keltirgan dalillarini quvvatlash uchungina aqliy dalillar keltirgan.\r\n    Alloma Taftazoniy rahmatullohi alayhi faylasuflar, mo''taziliylar, jabriylar va qadariylar kabi turli firqa va guruhlarning fikrlarini keltirib, ularga ahli sunna val jamoaning raddiyalarini berib borgan.\r\n    Kitobda boshqa masalalar qatori Alloh taoloni ko'rish masalasi ham bor. Shu masalaga oid matnni sharh qilar ekan, Allomai Taftazoniy rahmatullohi alayhi quyidagilarni yozadi:\r\n    'Batahqiq, ahli haq ko'rish mumkinligiga ikki yo'l – aql va naqldan dalil keltirgan. Birinchining taqriri quyidagicha: Biz a'yon (jism) va a'roz(sifat)larni ko'rish zarurat ekaniga qat'iyan ishonamiz. Biz ko'rish ila jism bilan jism va sifat bilan sifat orasini ajratamiz. Bas, mushtarak hukmga mushtarak illat lozim. O'sha illat – mavjudlik, paydo bo'lish yoki mumkinlikdir. To'rtinchisi bo'lishi mumkin emas. Paydo bo'lish ham yo'qlikdan so'nggi mavjudlikdan iboratdir. Mumkinlik esa mavjudlik va yo'qlikning zarurati yo'qligidan iboratdir. Illat bo'lishga yo'qlikning daxli yo'qdir. Bas, shunday bo'lganidan keyin, faqat vujud qolishi ayon bo'ldi. U esa Yaratuvchi va undan boshqaning orasida mushtarakdir. Shuning uchun, to'g'ri illat mavjudlik bo'lganidan keyin, uning ko'rinishi ham sahih bo'ladi...'\r\n    Muallif yuqorida zikr qilinganga o'xshash bir necha aqliy dalillarni keltirganidan keyin naqliy dalilga o'tib, quyidagilarni aytadi:\r\n    'Mo'minlar Alloh taoloni oxiratda ko'rishlari vojibligiga naqliy dalillar vorid bo'lgandir:\r\n    1. Kitobdan: Alloh taoloning 'U kunda yashnar yuzlar bor – Robbiga nazar soluvchilar', degan qavli ('Qiyomat' surasi, 22-23-oyatlar).\r\n    2. Sunnatdan: U zot alayhissalomning\r\n    'Albatta, sizlar Robbingizni xuddi to'lin oy kechasida oyni ko'rgandek ko'rasizlar', degan qavllari.\r\n    Bu hadis mashhur bo'lib, uni katta sahobalar roziyallohu anhumdan yigirma bir kishi rivoyat qilgan.\r\n    3. Ijmo'ga kelsak, ummatning barchasi oxiratda ko'rishning voqe bo'lishiga jam' bo'lishgan edi...'\r\n    Alloma Taftazoniy qiyomatda amallarni tarozida tortish haqidagi masala bo'yicha mo''taziliylar bilan tortishuv olib boradi.\r\n    'Vazn haqdir. Chunki U Zoti taolo: 'U kunda vazn haqdir', (A'rof surasi, 8-oyat) degan. Mezon amallarning miqdorlarini bilish uchun ishlatiladigan narsadan iboratdir. Uning kayfiyatini idrok qilishga aql qosirlik qiladi. Mo''taziliylar uni inkor qilgan. Chunki ularning fikricha, amallar a'rozlardir. Ularni qaytarish imkoni bo'lsa ham, vaznini o'lchash mumkin emas. Chunki ular Alloh taologa ma'lumdir. Bas, ularni tortish behuda ish bo'ladi. Bunga javob quyidagicha: hadisda amallarning kitobi haqida so'z yuritilgan. Bas, shunday ekan, tushunmovchilik qolmadi'.\r\n    Alloma Taftazoniy rahmatullohi alayhining 'Sharhu aqoidi Nasafiya' kitobi moturidiy aqiydaviy mazhabida yozilgan kitoblar ichida eng mashhurlaridan biri hisoblanadi. Ko'pgina yurtlarda undan darslik sifatida foydalanib kelingan. Bizga yetib kelgan asarlar ichida ko'p uchraydigani ham aynan shu kitobdir. Ammo hozirda bu kitobni darslik sifatida o'rganish deyarli to'xtab qolgan."
        ]
    },
    {
        "word": "Sharhu Faroizi Sajovandiy",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining kitobi. Bu kitob hanafiy mazhabining ulamolaridan bo'lmish imom Sirojuddin Muhammad ibn Mahmud ibn Abdurrashid Sajovandiy Hanafiyning meros ilmiga oid kitobiga yozilgan sharhdir. Ushbu kitob 'Faroizu Sirojiya' nomi bilan ham mashhur bo'lib, hozirgacha darslik sifatida o'qitiladi."
        ]
    },
    {
        "word": "Sharhu Faroizi Sirojiya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Bu kitob shayx Sirojiddin Abu Tohir Sajovandiyning Faroiz – meros ilmi borasidagi kitobining sharhidir. Ushbu kitob 'Sharifiya sharhi Sirojiya' deb ham ataladi. 'Sharhu Faroizi Sirojiya' kitobi chop etilgan."
        ]
    },
    {
        "word": "Sharhul Azziy",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu kitobi Zanjoniyning sarf ilmi bo'yicha yozgan kitobining sharhidir. Bu asar ko'p marta chop qilingan."
        ]
    },
    {
        "word": "Sharhul Aqoidil Azudiya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining asari. Bu kitob shayx Azudiddin Iyjiyning aqiyda ilmi bo'yicha yozgan mashhur kitobining sharhidir."
        ]
    },
    {
        "word": "Sharhul Asmaail Husnaa",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining asari. Bu kitob aqiydaga oid bo'lib, Alloh taoloning go'zal ismlarining sharhidan iboratdir."
        ]
    },
    {
        "word": "Sharhul Viqoya",
        "type": [],
        "definition": [
            "Sodrush shariy'a Ubaydulloh ibn Mas'ud al-Buxoriyning kitobi"
        ]
    },
    {
        "word": "Sharhul Gʻazziy fit tasriyf",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi sarf ilmiga oid bo'lib, shayx Izzuddin Abulfazoil Ibrohim ibn Abdulvahhob Zanjoniyning kitobiga yozilgan sharhdir. Ushbu kitob Allomai Taftazoniy rahmatullohi alayhining ilk kitobi bo'lib, uni ayni o'spirinlik davrida – o'n olti yoshida yozgan.\r\n    'Sharhul G'azziy'da Alloma Taftazoniy matnga ko'pgina foydali ma'lumotlarni qo'shgan. Bu kitobni hijriy 737 yilning sha'bon oyida tugatgan. Imom Suyutiy va Ibn Hilol mazkur kitobga hoshiya yozganlar.\r\n    Bu kitob bizning diyorlarimizda darslik sifatida juda ko'p o'qilgan va o'qib kelinmoqda. Sarf va nahv ilmlariga oid boshqa kitoblar bilan birga majmua sifatida juda ko'p marta chop qilingan."
        ]
    },
    {
        "word": "Sharhul Mavoqif",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu kitoblari shayx Azudiddin Iyjiyning 'Mavoqif' nomli kitobining eng mashhur sharhlaridan biri bo'lib, u kalom ilmiga oiddir. Bir necha bor chop qilingan."
        ]
    },
    {
        "word": "Sharhul Maqosid",
        "type": [],
        "definition": [
            "Alloma Sa'duddin Mas'ud ibn Umar ibn Abdulloh Taftazoniy rahmatullohi alayhi o'zining islomiy asarlar kutubxonasining faxriga aylangan kitoblardan biri bo'lmish ushbu asarini vafotidan bir oz oldin yozib bitirgan. Ushbu kitob tavhid ilmi bo'yicha yozilgan barcha asarlarning to'liq xulosasidir, desak xato bo'lmaydi. Muallif rahmatullohi alayhi ushbu asarda o'zidan oldin o'tgan barcha olimlarning yozganlaridan unumli foydalanib, o'zining salkam yarim asrlik ilmiy faoliyatining samarasini shu kitobga joylagan, degan odam mubolag'a qilmagan bo'ladi.\r\n    Allomai Taftazoniy rahmatullohi alayhi bu kitobni yer yuzining sayqali bo'lmish Samarqand shahrida yozgan. 'Sharhul Maqosid' aqiyda bobidagi mashhur kitoblardan bo'lib, undan ko'pchilik keng ravishda foydalangan, jumladan, 'Al-Azhar' dorilfununida ham uzoq yillar davomida darslik sifatida o'qitilgan va ko'p marta chop qilingan."
        ]
    },
    {
        "word": "Sharhul Miftoh",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi shayx Sirojuddin Abu Yoqub Yusuf ibn Abu Bakr Sakkokiyning kitobiga sharh bo'lib, Allomai Taftazoniy rahmatullohi alayhining oxirgi yozgan kitoblaridandir. Uni Samarqandda, 787 hijriy yilda yozib bitirgan. Bu kitob ilm ahllari ichida juda ham mashhur bo'lgan."
        ]
    },
    {
        "word": "Sharhul Odob li Azududdin Iyjiy",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Bu kitob tasavvufga oid bo'lib, mashhur olim Azududdin Iyjiy rahmatullohi alayhining 'Odob' nomli kitobiga Sayyid Sharif Jurjoniy rahmatullohi alayhi yozgan sharhdan iboratdir."
        ]
    },
    {
        "word": "Sharhul Hidoya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining bu kitobi imom Burhonuddin Marg'iloniy rahmatullohi alayhining hanafiy fiqhiga oid eng muhim kitoblaridan biri bo'lgan, mislsiz shuhrat qozongan kitobi 'Hidoya'ning sharhidir."
        ]
    },
    {
        "word": "Sharhur risolatish shamsiya",
        "type": [],
        "definition": [
            "Bu kitob shayx Najmuddin Umar ibn Ali Qazviniyning kitobiga yozilgan sharhdir. Uni Allomai Taftazoniy rahmatullohi alayhi hijriy 753 yilda yozib bitirgan."
        ]
    },
    {
        "word": "Sharhut Tazkira Nusayriya",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Bu kitob hay'at ilmiga oiddir."
        ]
    },
    {
        "word": "Sharʼiy dalil",
        "type": [],
        "definition": [
            "Qur'oni Karim oyatlari va Payg'ambarimiz Muhammad sollalohu alayhi vasallamning sunnatlari"
        ]
    },
    {
        "word": "Sharʼiy kunduz",
        "type": [],
        "definition": [
            "'Shar'iy kunduz' deganimizdan shar'iy bo'lmagan kunduz ham borligi kelib chiqadi. Shar'iy bo'lmagan kunduz 'lug'aviy kunduz' deb ataladi va u quyosh chiqqandan boshlab botguncha davom etadi. Shar'iy kunduz esa tong otgandan boshlanib quyosh botguncha davom etadi."
        ]
    },
    {
        "word": "Shafoat ",
        "type": [],
        "definition": [
            "himoya qilish; boshqa birovga qo'shilib, unga yordam berish va yonini olib, biror narsani uning uchun so'rash. Payg'ambarlar, siddiqlar, shahidlar, olimlar va qorilarning qiyomat kuni gunohkor bandalarni Allohdan o'tinib kechirim so'rashi."
        ]
    },
    {
        "word": "Shahid ",
        "type": [],
        "definition": [
            "'Shahid' so'zi 'shohid bo'lingan' ma'nosini bildiradi. Ya'ni, o'limiga shohid bo'lingan, degani. Shahidning o'limiga farishtalarning juda ham katta jamoasi hozir bo'lib, guvoh bo'lganidan, uni shahid deyiladi."
        ]
    },
    {
        "word": "Shahodat ",
        "type": [],
        "definition": [
            "guvohlik; biron narsa yuzasidan guvohlik ko'rsatmasi."
        ]
    },
    {
        "word": "Shaʼf ",
        "type": [],
        "definition": [
            "Sha'f – tepa, cho'qqi degani."
        ]
    },
    {
        "word": "Shiyza ",
        "type": [],
        "definition": [
            "Shiyza – yog'ochi qattiq, qoramtir daraxt. Odatda undan taroq va tovoq kabi buyumlar yasalgan. Bu yerda o'sha yog'ochdan qilingan tovoqlar va o'sha tovoqlarda taomlanadigan kishilar nazarda tutilgan."
        ]
    },
    {
        "word": "Shikon ",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan. 'Al-Qand fi ma'rifati ulamoi Samarqand', ya'ni 'Samarqand ulamolarini bilish haqida qand(dek shirin)' kitobida Shikon Kesh qishloqlaridan deb yozilganini o'qiganman. Biroq o'sha kitobning hoshiyasida 'Shikon – Buxoro qishloqlaridan' degan yozuv turibdi. Al-Hofiz al-Qurashiy 'al-Javohir al-maziyya' ('O'tgan javohirlar') kitobida uni Kesh qishloqlaridan emas, balki – Buxoro qishloqlaridan degan. 'Tabsir al-muntabih' ('Ogohlantiruvchi ko'zgu') kitobining 737-sahifasida ham xuddi shunday: 'Albatta, u – Buxoro qishloqlaridan', deb yozilgan."
        ]
    },
    {
        "word": "Shirb ",
        "type": [],
        "definition": [
            "Shirb suvdan bo'lgan nasiybadir. Bu, shirbning lug'atdagi ma'nosidir. Shar'iy istilohda esa, ziroat va hayvonotni sug'orishda suvdan foydalanish shirbdir. Shafatu bani odam va hayvonlarning suv ichish haqqidir. 'Shufa' so'zi 'lab' ma'nosini bildiradi. Odamlar va hayvonlar suvni lablari bilan ichganlari uchun shunday atalgan."
        ]
    },
    {
        "word": "Shirk ",
        "type": [],
        "definition": [
            "Allohning ilohiyotda sherigi bor deb e'tiqod qilish. Ya'ni, Allohga ishonish bilan birga Unga ilohlikda boshqa jonli va jonsiz narsalarni barobar qilish."
        ]
    },
    {
        "word": "Shirkat ",
        "type": [],
        "definition": [
            "'Sharikat' yoki 'shirkat' lug'atda 'aralashib ketish' ma'nosini anglatadi. Shariatda esa, shirkat ra'sulmol va foyda xususida sherik bo'lganlar orasidagi aqddan iboratdir. Shirkat muomalasi Qur'oni Karimda ham zikr qilingandir."
        ]
    },
    {
        "word": "Shis alayhissalom",
        "type": [],
        "definition": [
            "Alloh subhanahu va taolo Odam Atoga o'g'illari Shis alayhissalomni ato qildi. Shis alayhissalom ham nabiy bo'lganlar. U zotga Alloh taolo ko'plab o'g'illar va qizlar berdi. Ulardan insoniyat nasli tarqaldi.\r\n    Allohning nabiysi Odam alayhissalom o'z hayotlari davomida, to vafot etgunlaricha o'z farzandu nabiralarini Allohning yo'liga da'vat qilishda, ularga tavhid aqiydasini o'rgatishda, Allohning ta'limotlarini yetkazishda bardavom bo'ldilar.\r\n    Muhaddislarimizdan Ibn Hibbon rahmatullohi alayh o'zining 'Sahih' nomli kitobida ulug' sahobiy Abu Zarr G'iforiy roziyallohu anhudan rivoyat qiladi:\r\n    'Men: 'Ey Allohning Rasuli, anbiyolar nechta?' dedim. U zot: 'Bir yuz yigirma to'rt ming', dedilar. Men: 'Ulardan rasul bo'lganlari qancha?' dedim, u zot: 'Uch yuz o'n uchta, ko'pchilik', dedilar Men: 'Ularning (nabiylarning) avvali kim bo'lgan?' degan edim, 'Odam', dedilar'.\r\n    Yuqorida ta'kidlanganidek, Shis alayhissalom Odam alayhissalomning farzandlaridan biri bo'lib, u zot ham nabiy bo'lganlar. Shis alayhissalom hayotlari davomida insonlarni Allohga da'vat etib, Allohning shariatini qoim qilish uchun harakat qilib o'tganlar.\r\n    Shis alayhissalomdan keyin Idris alayhissalom keladilar."
        ]
    },
    {
        "word": "Shiʼb ",
        "type": [],
        "definition": [
            "'Shi'b' so'zi aslida ikki tog' orasidagi yo'lni, darani anglatadi. Bu yerda odatda hojilar Arafotdan qaytishda to'xtab o'tishadigan, ikki tog' orasidagi ma'lum joy nazarda tutilgan."
        ]
    },
    {
        "word": "Shom namozi",
        "type": [],
        "definition": [
            "Quyosh botgandan to shafaq yo'qolgunga qadar o'qiladigan namoz."
        ]
    },
    {
        "word": "Shoma ",
        "type": [],
        "definition": [
            "Makkai Mukarramadan o'ttiz mil (55,5 km) uzoqlikda joylashgan, Majanna yaqinidagi tog'"
        ]
    },
    {
        "word": "Shohid ",
        "type": [],
        "definition": [
            "Guvoh"
        ]
    },
    {
        "word": "Shohidlik ",
        "type": [],
        "definition": [
            "'Shohidlik' bizda 'guvohlik' deb ham ataladi. Bu so'zning lug'atdagi ma'nosi bir narsaning ayni o'zini ko'rib yoki bilib turib xabarini aytishni anglatadi. Taxmin va chamalashning teskarisi bo'ladi. Shariat istilohida esa, Guvohlik birovning boshqaning haqqi to'g'risida xabar berishidir. Guvohlikning rukni–shahodat ya'ni, guvohlik lafzini ishlatishdir. Chunki, oyat va hadislarda aynan shu lafz bilan kelgan."
        ]
    },
    {
        "word": "Shuayb alayhissalom",
        "type": [],
        "definition": [
            "Shuayb alayhissalomning nasablari Ibrohim alayhissalomning Madyan ismli o'g'illariga borib tutashadi. Demak, Shuayb alayhissalom ham Ibrohim alayhissalomning sulolalaridandir.\r\n    Shuayb alayhissalomning payg'ambarliklari Lut alayhissalomdan keyin bo'lgan. Buni Hud surasidagi quyidagi oyatda kelgan u zotning o'z qavmlariga aytgan gaplaridan bilib olish mumkin:\r\n    'Ey qavmim, menga muxoliflik qilish sizlarni yo Nuh qavmiga, yo Hud qavmiga, yoki Solih qavmiga yetgan musibatga o'xshash musibat yetishiga olib bormasin. Lut qavmi sizlardan uzoq emas' (89-oyat).\r\n    Ya'ni 'Nuh, Hud va Solihlarning qavmiga yetgan musibatlar sizga ham yetmasligini xohlasangiz, menga xilof qilishni yig'ishtiring.\r\n    Chunki o'sha qavmlar payg'ambarlariga xilof qilishlari oqibatida musibatlar, azob-uqubatlarga duchor bo'lishgan edi. Sizlar ham menga qarshi chiqmoqdasiz, agar shu taxlit davom etaversangiz, o'sha qavmlarga yetgan musibatlar sizlarga ham yetishi turgan gap'.\r\n    Alloh taolo Shuayb alayhissalomni Madyan nomli joyga payg'ambar qilib yuborgan. Bu haqiqat A'rof surasida ta'kidlanadi:\r\n    '...va Madyanga o'z birodarlari Shuaybni (yubordik)' (85-oyat).\r\n    Madyan aslida Ibrohim alayhissalomning o'g'illaridan birining ismi bo'lib, keyinchalik undan tarqagan qabila va ular yashaydigan yurt uning nomi bilan ataladigan bo'lib ketgan. Madyanliklar ham asli arablar bo'lib, ularning yerlari Qizil dengizning shimolidagi Aqaba qo'ltig'idan Turi Siynoga qadar cho'zilgan.\r\n    Shuningdek, Shuayb alayhissalom yashagan joy, ya'ni ¬Madyan o'lkasi 'Ayka', u kishining qavmlari 'ashobul Ayka' deb ham ataladi ('ayka' – arab tilida 'quyuq daraxtzor, daraxtlari bir-biriga kirishib ketgan o'rmon' degan ma'noni bildiradi). Bu ham Qur'oni Karimning ta'biri bo'lib, Alloh taolo bu haqda Shuaro surasida quyidagilarni aytadi:\r\n    'Quyuq daraxtzor sohiblari rasullarni yolg'onchiga chiqardilar. O'shanda ularga Shuayb dedi: 'Qo'rqmaysizlarmi?!' (176–177-oyatlar)\r\n    Madyan o'lkasi Hijoz bilan Falastin o'rtasida, Aqaba ko'rfazining sharqiy tarafida joylashgan."
        ]
    },
    {
        "word": "Shuayb ash-Shargʻiy al-Kogʻaziy",
        "type": [],
        "definition": [
            "Abu Solih Shuayb ibn Lays ash-Sharg'iy al-Kog'aziy Buxoro ahlidan bo'lib, Samarqandda yashaganlar. Ibrohim ibn Munzir al-Hizomiy, Abu Mus'ab Ahmad ibn Abu Bakr, Muhammad ibn Salom al-Paykandiy, Abu Kurayb va Sufyon ibn Vake'dan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abu Hafs Ahmad ibn Hotam ibn Hammod va Muhammad ibn Ahmad ibn Mardak hadis rivoyat qilganlar. Hijriy 272 (milodiy 886) yilning rajab oyida Samarqandda vafot etganlar."
        ]
    },
    {
        "word": "Shuaro surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 227 oyatdan iborat.\r\n    Ushbu surai karimaning nomi uning oxirida kelgan shuaro (shoirlar) haqidagi oyatdan olingan.\r\n    Avvallari ham ko'p ta'kidlanganidek, Islom da'vati o'zining dastlabki bosqichida mushriklar tomonidan qattiq qarshilikka uchradi. Ular Alloh taoloning birligini va hazrati Muhammad sollallohu alayhi vasallamning payg'ambar ekanliklarini mutlaqo tan olgilari kelmas edi. Asrlar davomida vahiydan bexabar, oxiratga ishonmay, bir hovuch ahli kitoblarga istehzoli qaragan johiliyat ahli Islomni qabul qilishni xayoliga ham keltirmadi. Nabiy sollallohu alayhi vasallam ularni qanchalik chin dildan dinga da'vat qilsalar, mushriklar shunchalik u kishini yolg'onchiga chiqarishga, u zotga ozor berish va yomonliklar qilishga intildilar. Mushriklarning dushmanligi kundan-kunga kuchayib, Islomga kirgan oz sonli musulmonlarning shikoyatlari ham kun sari ortib borardi. Bu davrdagi birdan-bir tasalli – umidning o'chmas chirog'i bo'lmish Qur'on oyatlarining nozil bo'lib turishi edi. Bu oyatlar eng asosiy masalaga – e'tiqod mavzusiga juda katta e'tibor berar, kishilarning soniga emas, sifatiga qarab musulmonliklarini shakllantirib borar edi. O'sha davrlarda Islomni qabul qilganlar juda oz bo'ldi. Ammo oz bo'lsa ham, juda soz bo'ldi. O'sha qiyinchilik davrida o'z dinini qo'rqmasdan, cho'g'ni tutgandek mahkam ushlagan kishilarning har biri keyinchalik olamga mashhur musulmonlar bo'lib yetishdilar.\r\n    Shuaro surasi ana shu o'ta qiyin pallada nozil bo'lgani uchun o'sha davr ruhini ham o'zida aks ettiradi. O'sha davrda juda muhim bo'lgan aqiyda masalasi bu suraning ham bosh mavzusidir. Xususan, suradan Alloh taoloning tavhidi, oxiratdan qo'rqish, hazrati Muhammad sollallohu alayhi vasallamga nozil bo'layotgan vahiyga ishonish, Payg'ambarni yolg'onchiga chiqarishdan qo'rqitish kabi masalalar keng o'rin olgan. Surada mushriklarning ozorlari, yomon muomalalari va uydirmalarini keltirish bilan birga, Nabiy alayhissalomga tasalli ham bor. Buning uchun ko'proq o'tgan ummatlarning qissalari o'ziga xos uslub bilan bayon qilingan.\r\n    Shuaro surasining avvalida Qur'oni Karim haqida, mushriklarning Muhammad sollallohu alayhi vasallamga munosabatlari hamda u zot sollallohu alayhi vasallamdan boshqa mo''jiza keltirishni talab etishlari to'g'risida so'z ketadi.\r\n    Keyin Alloh taolo tomonidan insoniyatni hidoyatga boshlash uchun yuborilgan bir guruh payg'ambarlar qissalari zikr etiladi. Bu qissalar silsilasi tug'yonga ketgan Fir'avn va uning qavmiga yuborilgan Muso alayhissalom qissalari bilan boshlanadi. So'ng Ibrohim alayhissalom qissalari esga olinadi. Bu ikki qissadan keyin taqvodoru betavfiq, saodatmandu badbaxtlarning oralarini farqlovchi oyatlar keladi.\r\n    So'ngra Nuh, Hud, Solih, Lut va Shu'ayb alayhissalomlarning qissalari keltiriladi. Payg'ambarlarni yolg'onchiga chiqarganlarning oqibati yomon bo'lishi eslatiladi. Yana Qur'oni Karimning sha'ni ulug'lanadi.\r\n    Suraning oxirida esa mushriklarning 'Qur'onni shaytonlar olib tushadi' degan bo'htonlariga raddiya beriladi."
        ]
    },
    {
        "word": "Shukri vuzuʼ",
        "type": [],
        "definition": [
            "Toharatning shukri - ma'nosini bildiradi. Bu toharat qilgandan keyin o'qiladigan namoz."
        ]
    },
    {
        "word": "Shurayh ibn Honeʼ ",
        "type": [],
        "definition": [
            "Shurayh ibn Hone' ibn Yaziyd al-Horisiy, kunyalari Abu Miqdom. Rasululloh sollallohu alayhi vasallam bu sahobaning haqlariga duo qilganlar.\r\n    Shurayh Ali roziyallohu anhuning eng yaqin kishilaridan edi. Ali roziyallohu anhu bilan barcha janglarda ishtirok etganlar. Jamal voqeasida katta qo'shin ustidan amir bo'lganlar.\r\n    Hadislarni Ali ibn Abu Tolib, Sa'd ibn Abu Vaqqos, Oisha onamiz, Ummu Hone' roziyallohu anhumlardan rivoyat qiladilar.\r\n    Bu zotdan esa o'g'illari Muhammad va Miqdom, Sha'biy, Yunus ibn Abu Ishoq va boshqalar rivoyat qilganlar.\r\n     Shurayh ibn Hone' roziyallohu anhu kuchli, pahlavon, Allohning diyni ravnaqi yo'lida jonini ham ayamaydigan ulug' sahobalardan edilar. Keksayib, yuz yoshdan o'tganlariga qaramay, hijratning 78-sanasida (milodiy 697 yil) SijistongaSijistongaSijistongaSijistongaSijistongaSijistonga ketayotib, kofirlar qurshovida qolib, butun askarlari bilan birga shahid bo'ladilar."
        ]
    },
    {
        "word": "Shuuro surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 53 oyatdan iborat.\r\n    'Shuuro' so'zi 'maslahat', 'mashvarat', 'fikr almashish' degan ma'nolarni bildiradi. Ushbu surai karimada Islomda sho'roning tutgan o'rni, ya'ni musulmonlar o'z hayotlarida paydo bo'ladigan ba'zi muammolarni mashvarat-maslahat yo'li bilan hal qilishlari lozimligi haqida so'z ketgani, unda mo'minlar haqida 'ishlari o'zaro shuuro ila bo'lgan…' degan oyat kelgani uchun ham, 'Shuuro surasi' deb nomlangan.\r\n    Shuuro surasi, Makkada nozil bo'lgan boshqa suralar kabi, aqiyda masalasini muolaja qiladi. Bu surai karimada, ayniqsa, payg'ambarlik va vahiy haqida alohida e'tibor bilan so'z yuritiladi. Shu bilan birga, surada vahdoniyat, qiyomat va unga iymon keltirish, mo'minlarning sifatlari, rizq masalasi va xursandchilik hamda qiyinchilik paytida inson o'zini qanday tutishi kerakligi haqida ham so'z ketadi.\r\n    Sura vahiyning va payg'ambarlikning masdari Alloh taolo ekanini, o'sha Zot payg'ambarlarni yuborib, ularga vahiy tushirganini ta'kidlash bilan boshlanadi.\r\n    So'ngra ba'zi mushriklarning 'Alloh taoloning bolasi bor', deyishlari haqida so'z ochiladi. Ularning bu gapidan osmonlar yorilib ketay deyishi ta'kidlanadi. Mushriklar nobakorlik qilayotgan bir paytda Allohning oliy martabali bandalari bo'lmish muqarrab farishtalarining U Zotga tinmay tasbeh aytishlari, ibodat qilishlari haqida xabar beriladi.\r\n    Sura yana vahiy va payg'ambarlik haqidagi gapni qaytadan boshlaydi. Alloh taoloning dini bir bo'lib, hamma payg'ambarlarni U Zotning O'zi yuborgani aytiladi. Payg'ambarlarning shariatlari turli bo'lib, dinlari bir ekani Allohdandir. O'sha din Islom dini bo'lib, Nuh, Ibrohim, Muso, Iyso va boshqa barcha payg'ambarlarni ham Alloh taoloning O'zi yuborganligi bayon qilinadi.\r\n    Undan keyin esa Qur'onga kufr keltirganlar haqida, qayta tiriltirishni va jazoyu mukofotni inkor qiladiganlar haqida gap ochiladi. Ularga shiddatli azoblar bo'lishi muqarrarligi ko'rsatiladi.\r\n    Suraning davomida Alloh taoloning Biru Borligiga, har bir narsaga qodir Zot ekaniga, ibodatga sazovor yagona Zot ekaniga dalolat qiluvchi oyat-belgilar sanaladi.\r\n    Shu bilan birga, mo'minlarni boshqalardan ajratib turadigan mumtoz sifatlar tilga olinadi.\r\n    Keyin esa qiyomat ko'rinishlari haqida so'z yuritiladi. Qiyomat kuni kofirlarning holi qanday bo'lishi haqida bayon keladi.\r\n    Nihoyat, surai karima yana vahiy va Qur'on haqida bahs yuritish bilan tamom bo'ladi."
        ]
    },
    {
        "word": "Shufʼa ",
        "type": [],
        "definition": [
            "'Shuf'a' lug'atda, 'qo'shish' ma'nosini anglatadi. Shariatda esa, eski sherikka sheriklik narsani sotib olish imtiyozi majburan berilishini anglatadi. Bir kishi sheriklik uyini sherigi bilan kelishib sotdi. Keyin xaridor bilan iqola qilib uyni o'ziga qaytarib olmoqchi bo'ldi. Shunda uchinchi shaxs, ya'ni uning sherigi: 'Iqolada ham men bilan maslahatlashishing kerak' desa, haqqi bor."
        ]
    }
]