[
    {
        "word": "Tabattul ",
        "type": [],
        "definition": [
            "Tabattul – ibodat maqsadida ayollardan chetlanish, uylanmay o'tish"
        ]
    },
    {
        "word": "Tabiiy moneʼlik",
        "type": [],
        "definition": [
            "'Tabiiy mone'lik' deganda, eru xotindan boshqa shaxsning ular bilan birga bo'lishi ko'zda tutilgan."
        ]
    },
    {
        "word": "Tabʼa tobeʼin",
        "type": [],
        "definition": [
            "ergashganga ergashgan. Musulmon holida tobe'inlarni ko'rgan, ergashgan va shu holida vafot etgan kishi."
        ]
    },
    {
        "word": "Tavakkul ",
        "type": [],
        "definition": [
            "biron-bir zotga umid bog'lash; o'zini Alloh irodasiga topshirish, faqat Uning rizq berishiga umid bog'lash."
        ]
    },
    {
        "word": "Tavba ",
        "type": [],
        "definition": [
            "qaytish, pushaymon bo'lish, qayta gunoh qilmaslikka ahd qilish"
        ]
    },
    {
        "word": "Tavba surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 129 oyatdan iborat.\r\n    Ushbu surai karimada tavba haqidagi oyatlar ham borligi uchun u shu nom bilan ataladi. Bu suraning ikkinchi mashhur nomi 'Baroat'dir. Chunki surai karima 'Baroat' so'zi bilan boshlanadi. Shuningdek, ulamolarimiz bu suraning 'Mubosira', 'Musiyra', 'Muxziya', 'Foziha', 'Musharrida', 'Suratul azob' kabi nomlari ham borligini aytganlar.\r\n    Tavba surasining ajralib turadigan yana bir xususiyati – uning avvalida 'Bismillahir rohmanir rohiym' lafzining yozilmaganligidir. Chunki Nabiy sollallohu alayhi vasallam buni aytmaganlar. Ma'lumki, Qur'oni Karimning har bir oyatini qayerga va qay tarzda yozishni Nabiy sollallohu alayhi vasallam o'zlari aytib, tushuntirib borar edilar. Tavba surasining avvaliga 'Bismillahir rohmanir rohiym'ni nima uchun aytmaganlar?' degan savolga ulamolar har xil javob berganlar. Masalan, 'Kashshof' tafsirida keltirilishicha, Ibn Uyayna: 'Allohning ismi Salom (tinchlik) va omonlikdir, urush va uloqtirib tashlash haqida gap borganda yozilmaydi', – degan ekanlar. Ya'ni bu surada kofirlarga qarshi urush qilish haqida so'z ketadi, urush esa ularga nisbatan shafqatsiz bo'lish demakdir. Binobarin, 'Bismillahir rohmanir rohiym' bu yerga to'g'ri kelmaydi, deganidir.\r\n    Tavba surasi nozil bo'lish vaqti jihatidan oxirgi suralardan hisoblanadi. Unda kelgan hukmlar ham nihoiy, so'nggi, ya'ni vaqtinchalik bo'lmagan hukmlardir. Xususan, bu surada islomiy jamiyat bilan boshqa tuzumlar o'rtasidagi aloqalarga alohida e'tibor berilgan. Ayni chog'da, Islom jamiyati ichidagi toifalar va ularning o'zaro aloqalari haqida ham so'z ketadi.\r\n    Tavba surasi boshqa suralar kabi, tarqoq holda nozil bo'lgan, ya'ni oyatlari to'qqizinchi hijriy yilning ichida turli joylarda, turli vaqtlarda bo'linib-bo'linib nozil qilingan.\r\n    Surai karimaning avvalida musulmonlarning Arabiston yarim orolidagi mushriklar bilan aloqalari qanday bo'lishi kerakligi haqida so'z yuritiladi. Ularga bo'ladigan munosabatlarning sababi bayon qilinadi.\r\n    Keyingi qator oyatlarda esa musulmonlarning ahli kitoblar – yahudiy va nasorolar bilan o'zaro aloqalari haqida gap ketadi. Bu aloqalarning sabablari, tarixiy va aqiydaviy jihatlari tilga olinadi. Shuningdek, ulardan musulmonlarning farqi, ular qanday qilib yo'ldan ozib ketganlari ochib tashlanadi.\r\n    Mazkur oyatlardan keyin mushrik va kofirlarga qarshi urushdan bosh tortganlar haqida so'z boradi. Ulardagi qo'rqoqlik, beparvolik va himmatsizlikning oqibatlari aytib o'tiladi.\r\n    Tabuk g'azotida munofiqlar tutgan o'rin va ularning qilmishlarining muolajasi suraning bosh mavzusidir. Munofiqlarning Islom jamiyatidagi kirdikorlari va ikkiyuzlamachiliklari, haqiqiy niyatlari, hiyla-nayranglari ushbu surai karimada o'ziga xos uslub ila fosh etiladi. Munofiqlarning Tabuk urushidan oldingi va keyingi hamda urush paytidagi holatlari ketma-ket bayon qilinadi.\r\n    Ularning urushdan bosh tortib, bahona topishlari, musulmonlar safiga tafriqa, fitna va zaiflik solishga intilishlari haqidagi oyatlar keladi. Munofiqlarning Nabiy sollallohu alayhi vasallamga va muxlis mo'min-musulmonlarga yetkazgan ozorlari batafsil zikr etiladi. Mo'min-musulmonlar munofiqlarning hiyla-nayranglaridan ehtiyot bo'lishga chaqiriladilar. Shu bilan birga, musulmonlar bilan munofiqlarning farqi, har birining o'ziga xos sifatlari va amallari hamda ularning orasidagi aloqalar ko'rsatib beriladi.\r\n    Munofiqlarga oid masalalar bayonidan so'ng boshqa toifalar xususidagi oyatlarga o'tiladi. Jumladan, sahroviy arablar orasida muxlis mo'min-musulmonlar ham, munofiqlar ham borligi, hatto ahli Madina ichida munofiqlar topilishi to'g'risida so'z yuritiladi. Shuningdek, islomiy hayot tarzini to'la qabul etmasdan, yaxshi ishlarga yomon ishlarni aralashtirib qilib yurganlar ham borligi aytiladi. Ba'zi bir asl holi noma'lum toifalarning ishi Allohning O'ziga havola ekani eslatiladi. Ba'zilarning din niqobi ostida musulmonlarga qarshi ish qilishlari ham esga olinadi.\r\n    So'ngra islomiy jihod va uning chegaralari, Madina ahli va uning atrofidagi a'robiylarning jihoddagi vazifalari, ularning jihoddan bosh tortishlari mumkin emasligi, mushriklar bilan munofiqlarni ajrata bilish lozimligi haqida oyatlar keladi. Tabuk urushiga bormay qolgan ba'zi muxlis kishilarga tegishli hukm izhor etiladi. Shuningdek, munofiqlarning ba'zi holatlari, ularning Qur'oni Karimga munosabatlari tilga olinadi.\r\n    Suraning oxirida Rasululloh sollallohu alayhi vasallamning sifatlari zikr etiladi va u zotga doimo Allohga tavakkul qilish buyuriladi.\r\n    'Tavba' – Baroat surasining birinchi oyatlari tafsiriga kirishishdan oldin ushbu oyatlar nozil bo'lguncha, ya'ni Alloh va Uning Rasuli mushriklarga 'baroat' – 'ora ochiqlik' e'lon qilgunlariga qadar bo'lib o'tgan voqealarni qisqacha eslatib o'tish lozim.\r\n    Ma'lumki, Alloh taolo insonlarni shirk va kufr zulmatlaridan iymon nuriga chiqarishni, turli narsa va shaxslarga sig'inishdan ozod etishni, yagona O'zigagina ibodat qilishlarini xohlab, Muhammad sollallohu alayhi vasallamga payg'ambarlik martabasini berib, Qur'oni Karimni indirganida, mushriklar bir ovozdan bunga qarshi chiqdilar. Payg'ambar sollallohu alayhi vasallamni sehrgar, Qur'onni sehr va musulmonlarni sehrlanganlar, dedilar. Jon-jahdlari bilan Islomga qarshi turdilar. Makkada oz sonli musulmonlarga qarshi o'n uch yil davomida qo'llaridan kelgan barcha yomonliklarni qildilar.\r\n    Oxiri musulmonlar Payg'ambarlari Muhammad sollallohu alayhi vasallam boshchiliklarida yurtlarini tashlab, hijrat qilishga majbur bo'ldilar. Chunki insofga chorlash, yolvorish va rahm-shafqat so'rashlar mushriklarga kor qilmadi. Ular musulmonlarni yer yuzidan butunlay yo'qotish niyatida ekanliklarini amalda ko'rsatdilar.\r\n    Hatto Madinaga hijrat qilgan musulmonlar ham mushriklarning ta'qiblaridan qutula olmadilar. Hijratdan keyin, ushbu oyatlar nozil bo'lguncha o'tgan to'qqiz yil davomida musulmonlar bilan mushriklar o'rtasida yigirma marta urush va to'qnashuvlar bo'ldi. Islom yangi kelgan vaqtdan mazkur oyatlar nuzuliga qadar o'tgan yigirma ikki yil ichida musulmonlar mushriklarni oqilona ish yuritishga, hech bo'lmasa, adolatli bo'lishga chaqirib keldilar.\r\n    Ammo mushriklar bu chaqiriqlarga mutlaqo quloq osmadilar. Aksincha, ularning jahllari chiqar va dushmanliklari yanada ortar edi. Bora-bora mushriklar Madinadagi yahudiylarni ham o'z saflariga qo'shib oldilar. Hatto munofiqlarni va atrofdagi sahroviy arablarni musulmonlarga qarshi gij-gijladilar.\r\n    Islom tomonidan aloqalarni yaxshilash uchun hamma choralar ko'rildi. 'Sizga o'z diningiz, bizga o'z dinimiz', deb aytildi, ammo foydasi bo'lmadi. Hijrat qilindi, biroq nafi tegmadi. Oxiri ahdnomalar tuzishga qaror etildi. Madinada yahudiylar, Hudaybiyada mushriklar bilan alohida ahdnoma tuzildi. Shuningdek, boshqalar bilan ham ahdlashildi.\r\n    Lekin ular ahdnomalarni buzib, yana Islomga va musulmonlarga dushmanliklarini davom ettiraverdilar. Ana shundagina chora-tadbir naf bermaganidan keyingina baroat e'lon qilindi"
        ]
    },
    {
        "word": "Tavof ",
        "type": [],
        "definition": [
            "Ka'baning atrofida aylanish jarayoni"
        ]
    },
    {
        "word": "Tavofi ifoza",
        "type": [],
        "definition": [
            "Zulhijja oyining o'ninchi kuni, ya'ni hayit kuni shaytonga tosh otib, Qurbonlikni so'yib, sochni oldirib (yoki qisqartirib) bo'lingandan so'ng Baytulloh tavof qilish. Bu 'Tavofi ziyora' ham deyiladi."
        ]
    },
    {
        "word": "Tavoful vido",
        "type": [],
        "definition": [
            "Bu tavofni 'Tavofus-Sadr' deb ham ataladi. Mazkur tavof yurtga qaytishdan oldin Ka'bai Muazzama bilan vidolashish uchun qilinadi. Undan keyin hech narsaga mashg'ul bo'lmay, yurtiga jo'nab ketish kerak"
        ]
    },
    {
        "word": "Tavr ",
        "type": [],
        "definition": [
            "Tavr – tosh yoki misdan yasalgan, suyuqliklar uchun mo'ljallangan, ichi chuqur idish, tog'oracha"
        ]
    },
    {
        "word": "Tavrot ",
        "type": [],
        "definition": [
            "Muso alayhissalomga nozil qilinshgan ilohiy kitob"
        ]
    },
    {
        "word": "Tavhid",
        "type": [],
        "definition": [
            "Allohni yagona sanash, yolg'iz deb e'tiqod qilish"
        ]
    },
    {
        "word": "Tagʻobun surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 18 oyatdan iborat.\r\n    'Tag'obun' so'zi bahoning pastlashini bildiradi. Bu surada u qiyomat kunining ismi sifatida zikr qilingan va unga nom bo'lib qolgan.\r\n    Tag'obun surasi barcha madaniy suralar kabi, shariat ahkomlariga alohida inoyat bilan qaraydi, lekin siyoqidan makkiy suralarga o'xshaydi. Boshida Alloh taoloning ulug'ligi, Uning qudratining belgilari haqida so'z ketadi. So'ngra o'z Robbini e'tirof etgan mo'min va Allohning ne'matlariga kufr keltirgan kofirlarning bayoni keladi. Ilgarigi ummatlar Alloh taoloning payg'ambarlarini yolg'onchiga chiqarganliklari uchun qanday azob-uqubatlarga duchor bo'lganlari eslatiladi.\r\n    Surada mushriklar iqror bo'lsalar ham, inkor etsalar ham, baribir o'lgandan keyin qayta tirilish haqligi qasam bilan kafolatlanadi. Shu bilan birga, Allohga va Uning Rasuliga itoat qilishga, ilohiy da'vatdan yuz o'girmaslikka chaqiriladi. Ba'zi xotin va farzandlarning dushman bo'lib, mo'minni Alloh taoloning yo'lidan, jihoddan qaytarishga sabab bo'lib qolishidan ogohlantiriladi.\r\n    Va, nihoyat, suraning so'ngida Alloh taoloning yo'lida, Uning dinining rivoji yo'lida mol-dunyoni ayamaslikka chaqirilib, baxillik va qizg'anchiqlikdan hazar qilishga da'vat etiladi. Chunki mo'min kishining sifatlaridan biri Alloh taoloning roziligi uchun Uning yo'lida nafaqa qilish – mol-dunyo sarflashdir."
        ]
    },
    {
        "word": "Tadlis ",
        "type": [],
        "definition": [
            "aldamchilik, tovlamachilik, firibgarlik."
        ]
    },
    {
        "word": "Tajvid ",
        "type": [],
        "definition": [
            "Qur'onni qiroat bilan o'qish"
        ]
    },
    {
        "word": "Tazkirotul ʼulama fiy usulil hadis",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining hadis va hadis ilmi bo'yicha kitoblari"
        ]
    },
    {
        "word": "Tazkiya ",
        "type": [],
        "definition": [
            "'Tazkiya' halol hayvonni so'yishdan oldin 'bismillahi'ni aytishdir."
        ]
    },
    {
        "word": "Tay togʻi",
        "type": [],
        "definition": [
            "Tay tog'i – Madina bilan Shom o'rtasida, dengiz bo'yida joylashgan tog'"
        ]
    },
    {
        "word": "Tayba ",
        "type": [],
        "definition": [
            "Tayba – pok, toza, musaffo degani bo'lib, Rasululloh sollallohu alayhi vasallamning shu so'zlari bilan Madinaning nomlaridan biri bo'lib qolgan"
        ]
    },
    {
        "word": "Tayinli boʻlmagan farz roʻza",
        "type": [],
        "definition": [
            "Ramazonning qazosi va kafforot ro'zasidir"
        ]
    },
    {
        "word": "Tayinli vojib roʻza",
        "type": [],
        "definition": [
            "muayyan nazr ro'zadir"
        ]
    },
    {
        "word": "Tayinli farz roʻza",
        "type": [],
        "definition": [
            "Ramazon ro'zasini ado etishdir"
        ]
    },
    {
        "word": "Tayyib al-Xunomatiy",
        "type": [],
        "definition": [
            "Abu Solih Tayyib ibn Muqotil al-Xunomatiy Buxoro ahlidan bo'lib, Abu Hafs al-Kabir al-Buxoriydan ta'lim olganlar."
        ]
    },
    {
        "word": "Takaasur surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 8 oyatdan iborat.\r\n    Ushbu surai karimaning nomi o'zining birinchi oyatidagi 'takaasur' so'zidan olingan. 'Takaasur' so'zi 'molu dunyo, mansab-martaba va bola-chaqaning ko'pligi bilan faxrlanish' deganidir. Ushbu surada kishilar dunyoning o'tkinchi matohini ko'paytirishga o'zlarini urishlari, ana shu ish bilan mashg'ul bo'lishni jonlari chiqquncha davom ettirishlari haqida gap ketadi.\r\n    Takaasur surasi nihoyatda keskin xitoblar ila odamlarni mazkur ishni qilmaslikka undaydi.\r\n    Va, nihoyat, oxiratda ko'riladigan dahshatlarni eslatish ila suraga xotima yasaladi.\r\n    Bu surai karima tug'yonga ketgan moddaparastlik muammosini muolaja qiladi. Hozirgi hayot insonga turli sarflarni talab qiladigan madaniyatni taqdim etdi. Hoyi-havasga erishaman, deb inson bu narsalarning quli bo'lib qoldi. Shu sababdan hayot rohat o'rniga charchashga aylandi. Inson iloji boricha ko'proq boylik to'playdigan va bu yo'lda har qanday pastkashliklardan qaytmaydigan bo'lib qoldi. Havoyi nafs yo'lida yurish, mol-dunyoga o'chlik insonni insoniy fazilatlaridan judo qildi, insoniyligini unuttirdi va, nihoyat, yaratgan Xoliqini ham esidan chiqartirdi. Oqibatda inson Allohga emas, molu dunyoga sajda qiladigan bo'lib qoldi.\r\n    Takaasur surasi buning oqibati nima bo'lishini bayon qiladi."
        ]
    },
    {
        "word": "Takalluf ",
        "type": [],
        "definition": [
            "Iltifot"
        ]
    },
    {
        "word": "Takbir",
        "type": [],
        "definition": [
            "ulug'lash, Allohni ulug'lash bilan bog'liq bo'lgan ibora"
        ]
    },
    {
        "word": "Takvir surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 29 oyatdan iborat.\r\n    Qiyomat kuni shunchalik katta hajmdagi, butun dunyoni o'z yorug'i bilan tutib turgan quyosh ham osongina buklanib, yorug'i so'nib, hech narsa bo'lmay qoladi. Ana shu ma'noni ifodalovchi 'takvir' so'zi surai karimaga nom qilib olingan."
        ]
    },
    {
        "word": "Takmilatu zaylit-taqyid li maʼrifati ruvatisi sunan val asaniyd",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining kitoblari."
        ]
    },
    {
        "word": "Taqvo ",
        "type": [],
        "definition": [
            "saqlanish, parhezkorlik, Xudodan qo'rqish; do'zaxdan saqlanish; Allohning buyruqlarini bajarish, qaytargan ishlaridan qaytish."
        ]
    },
    {
        "word": "Taqribun-nashr fil-qiroat al ʼashr",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat bo'yicha kitoblari"
        ]
    },
    {
        "word": "Taqrir ",
        "type": [],
        "definition": [
            "Biror narsaga iqror bo'lish, uning to'g'riligini tasdiqlash, ma'qullash 'taqrir' deyiladi. Hadis ilmida taqrir Payg'ambarimiz sollallohu alayhi vasallamning sahobai kiromlar tomonidan sodir bo'lgan ba'zi narsalarni ma'qullashlariga nisbatan qo'llanadi. Misol: Amr ibn Os roziyallohu anhu Payg'ambarimiz alayhissalom yuborgan bir to'p lashkarga bosh edi. Borgan joyida junub bo'lib qoladi va sovuqdan qo'rqib, g'usl qilmay, tayammum bilan namoz o'qiydi. Uning sheriklari buni Rasululloh sollallohu alayhi vasallamga yetkazishadi. Shunda Rasululloh sollallohu alayhi vasallam Amr ibn Os roziyallohu anhuning qilgan ishini ma'qullaganlar. Shuningdek, bir safar habashiylar harbiy o'yinga tushishganda Nabiy sollallohu alayhi vasallam ularning o'yinlarini tomosha qilib turganlar. Ma'qullash 'ma'qul' deb aytish bilan yoki inkor qilmay, indamay qo'ya qolish bilan ham bo'ladi. Bu 'taqririy hadis' deyiladi.\r\n     Rasululloh sollallohu alayhi vasallam hech qachon gunoh va ma'siyatlarga guvoh bo'lgan holda jim turmaganlar va bunday bo'lishi mumkin ham emas. Rasululloh sollallohu alayhi vasallamning biror so'z yoki ishni ma'qullashlari uning shar'an man etilmaganiga dalolat qiladi. Bordiyu, u zot bu borada xato qilgudek bo'lsalar, shu zahoti vahiy tushib, uni to'g'rilar edi. Shu bois u zotning roziliklarini bevosita vahiyning tasdig'i deyish mumkin. Shuning uchun Nabiy sollallohu alayhi vasallamning taqrirlari hadis hisoblanadi va shar'iy hukmlarda hujjat qilinadi."
        ]
    },
    {
        "word": "Taqsiymul ulum",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining kitobi. Ilmlarning taqsimiga oid bu kitobda muallif yashagan davrda mavjud bo'lgan ilmlar va ularning xususiyati haqida so'z borgan."
        ]
    },
    {
        "word": "Taqsimlash",
        "type": [],
        "definition": [
            "'Taqsimlash'–merosni bo'lish uchun haqdorlar yig'ilgan majlisdir."
        ]
    },
    {
        "word": "Talbiya ",
        "type": [],
        "definition": [
            "Labbaykallohymma labbayk, labbayka laa shapiyka laka labbayk. Innal hamda van-ne'mata laka val-mylk laa shapiyka lak"
        ]
    },
    {
        "word": "Talqin ",
        "type": [],
        "definition": [
            "qayta-qayta takrorlab aytib turish."
        ]
    },
    {
        "word": "Taloq ",
        "type": [],
        "definition": [
            "'Taloq' so'zi lug'atda 'moddiy va ma'naviy tugunni yechish' ma'nosini anglatadi. Shar'iy istilohda esa, maxsus lafz ila nikohni ketkazish yoki halolligini nuqsonga uchratishga taloq deb aytiladi. Maxsus lafzdan murod taloq yoki uning ma'nosini anglatuvchi lafzdir."
        ]
    },
    {
        "word": "Taloq surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 12 oyatdan iborat.\r\n    Ushbu suraning 'Taloq' deb atalishining o'zi uning asosiy mavzusidan xabar berib turibdi. Ushbu surada muhim shar'iy ahkomlardan bo'lmish taloq masalasi, er-xotinning o'zaro munosabatlari, taloqdan kelib chiqadigan idda, nafaqa, turar joy, emizuvchiga beriladigan haq va boshqa hukmlar to'g'risida so'z ketadi.\r\n    Surai karimaning avvalida taloq ikki xil (sunniy va bid'iy) bo'lishi aytiladi va mo'minlar, agar muhtoj bo'lsalar, afzalini – sunniy taloqni tanlashga chaqiriladilar. Shu bilan birga, taloq qo'yiladigan bo'lsa, shariatda ko'rsatilganidek munosib vaqtda, ya'ni hayzdan poklangan vaqtda qo'yish tavsiya etiladi.\r\n    Yana surada idda saqlashga, bunda ham boshqa ishlarga o'xshab, Alloh taolo belgilagan chegarada turishga, undan chiqmaslikka chaqiriladi. Iddaning hukmlari bayon qilinadi. Yoshi o'tganligi munosabati ila yoki kasalligi tufayli hayz ko'rmaydigan ayollarning iddasi qancha bo'ladi? Yoshi kichikligi uchun hayz ko'rmaydiganlarning iddasi qanday bo'ladi? Homilador ayollarning iddasi qanaqa va hokazo hukmlarning ochiq-oydin bayoni keladi.\r\n    Ushbularning bayoniga yonma-yon o'laroq, doimo Allohga taqvo qilishga, Undan qo'rqishga da'vat qilib boriladi.\r\n    Bu surai karimaning tafsirini boshlashdan avval bir oz muqaddima qilib o'tilsa, uning oyatlarini tushunishda katta yordam beradi.\r\n    Islom dushmanlari ayollar masalasini dinimizning kuragi ostidan uriladigan zaharli xanjarga aylantirib olganlar. Ular makkor ustozlari tarafidan to'qilgan siyqasi chiqib ketgan diydiyolarni to'tiqushdek takrorlayveradilar. Jumladan, taloq masalasini ham o'z g'arazlari yo'lida qurol qilib olganlar. Dushmanlarimizning gaplariga quloq solsangiz, Islomda oila qurishdan asosiy maqsad taloq qo'yishdek bo'lib tuyuladi. Aslini olganda esa uzoqqa borib o'tirmasdan, hozirgi kundagi hisob-kitoblarga bir nazar solishning o'zi bu da'voning asossizligini isbotlash uchun kifoya. Islomga dushman bo'lgan jamiyatlarda yangi oilalarning yetmish foizi bir yilga bormay, buzilib ketyapti. Ular bilan o'zaro munosabat va suhbatlardan shu narsa ma'lum bo'ladiki, ularning orasida o'z oilasi bilan baxtli hayot kechirayotgan erkak yoki ayolni uchratish amri mahol.\r\n    Islom oilaviy aloqalarni muqaddaslik darajasiga ko'targan. U aloqa mehribonlik, muhabbat aloqasidir. Nikoh sokinlik, barqarorlik aloqasidir. Islomiy oila bir-birining aybini berkitish, go'zallik, o'zaro ehtirom aloqasidir. Islom insondagi tabiiy rag'bat yoki shahvatni qoralamaydi. Balki uni poklaydi va tartibga soladi. Erkagu ayoldagi mavjud xohishlarni hayvoniy darajadan insoniy darajaga ko'taradi. Nikoh orqali ikki jasadning qo'shilishini ikki ruh, ikki qalb, ikki nafsning, qisqa qilib aytganda, ikki insonning qo'shilishiga aylantiradi. Ularni bir-birlarining haq-huquqlarini ado etib, o'zaro hurmat va ehtirom bilan yashashga targ'ib qiladi. Oilani mustahkamlash uchun barcha choralarni ko'radi.\r\n    Shu bilan birga, taloq masalasida boshqa din va tuzumlar qanday yo'l tutganini ham bilib qo'yish kerak. Bu masalada ikki xil yo'l tanlangan:\r\n    Birinchisi – taloqqa ruxsat bermaslik. Bu yo'l ba'zi masihiy mazhablar tutgan yo'ldir.\r\n    Ikkinchisi – taloqqa ruxsat berish. Bu yo'l ko'plarning, shu jumladan, musulmonlarning ham tutgan yo'lidir.\r\n    Taloqqa ruxsat bermaslik inson tabiatiga qarshi hukmdir. Chunki inson o'z hayotida turli holatlarga tushib turadi, ba'zi holatlarda er-xotin oilaviy hayotni birga davom ettirishga hech imkon topa olmay qoladilar. Shuning uchun taloqqa ruxsat berilmagan davlatlarda er-xotinlar rasman ajrashmagan bo'lsalar-da, amalda birga yashamay, o'zlariga o'ynash tutadilar yoki zino bilan mashg'ul bo'lib yuradilar.\r\n    Taloqqa ruxsat berganlar ham o'zaro bir necha toifaga bo'linib ketadilar.\r\n    Ba'zilar 'Taloqni qozi, ya'ni hozirgi til bilan aytganda, sud orqali amalga oshirish kerak', – deydilar.\r\n    Ba'zilar 'Xotinlarga ham taloq qo'yish huquqini berish kerak', – deyishadi.\r\n    Uchinchi toifa esa 'Taloq qo'yish erning huquqi', – deydilar.\r\n    Endi bu yo'nalishlarni qiyoslab ko'raylik.\r\n    Taloq qozi tomonidan bo'lishi umuman mumkin emas. Chunki taloq er-xotinning o'zaro oilaviy sirlari bilan bog'liq narsa. Ko'pgina sabablarni odamlarga, jumladan, qoziga aytishga insoniy odob-axloq yo'l qo'ymaydi. Bu holatda kim yuzsizroq, gapga ustaroq bo'lsa, yolg'onni ko'proq ishlatsa, o'sha yutadi. Buni hozirgi kunda hamma ko'rib, bilib turibdi.\r\n    Xotinga taloq qo'yish huquqining berilishi ham to'g'ri emas. Chunki ayol kishini Alloh taolo alohida xos tabiat bilan yaratgan. U muloyimlik, yumshoqlik, latofat, go'zallik sohibasi va bunday holatlarda o'zini qulay his etadi. Aksincha, qo'pollik, urush-janjal, kuch ishlatish, achchiqni yutish kabi holatlar ularda kam uchraydi.\r\n    Ushbu holatlarni e'tiborga olib, faraz qiling-a: ixtiyor ayol kishida bo'lsa, qisqa muddatda erini necha marta taloq qo'yishi mumkin?\r\n    Uchinchisi Islomiy yechimdir. Bu inson tabiatini e'tiborga olishdan kelib chiqqan ilohiy yechimdir. Odatda oila qurish uchun bo'lg'usi kelin emas, bo'lg'usi kuyov ko'proq yelib-yuguradi. U bu maqsad yo'lida mol-pul sarflaydi, qallig'iga mahr beradi, to'y xarajatlarini ko'taradi. Oilaning obro'si uning shaxsiy obro'sidan ham ustun bo'lib qoladi. Farzandlar unga nisbat beriladi. Xullas, mazkur va yana boshqa sabablarga ko'ra, taloq qilishdan avval er yetti o'lchab, bir kesmog'i shart bo'lib qoladi. Shuning uchun ham Islomda taloq qilish haq-huquqi erga berilgan. Lekin shariat taloq qilishdan avval boshqa yengilroq choralarni ko'rib, ajrashishning oldini olishga da'vat etadi. Ayol kishida eriga nisbatan hurmatsizlik, itoatsizlik paydo bo'lsa, avval va'z-nasihat qilish tavsiya etiladi. U foyda bermasa, joyni boshqa qilib yotish lozim. U ham ta'sir qilmasa, zarar yetkazmasdan urishgacha ruxsat etilgan. Er-xotinning orasi bu bilan ham tuzalmasa, erning qarindoshlaridan bir kishi, xotinning qarindoshlaridan ham bir kishi hakam etib saylanadi va ular er-xotinni yarashtirish choralarini ko'radilar. Bu chora-tadbirlarning hech biri foyda bermay, er-xotinning birga yashashi ikkovlariga ham cheksiz azob-uqubatga aylanib qolgandagina, taloqqa ruxsat beriladi. To'g'ri, Islomda taloqqa ruxsat berilgan, ayni chog'da, Payg'ambarimiz Muhammad alayhissalom: 'O'zi halol-u, lekin Alloh eng yomon ko'rgan narsa taloqdir', – deganlar. Boshqa rivoyatlarda 'Taloq tushganda Allohning arshi larzaga keladi', deyilgan.\r\n    Boshqa hukmlar qatori, taloq masalasida ham Islom dini inson tabiatini e'tiborga olib, ish tutadi. Chunki insonni Alloh taolo yaratgan, unga nima mos kelishini ham Alloh taoloning O'zi yaxshi biladi. Islomdan avval boshqa masalalardagi kabi, taloq masalasida ham ayollar xorlanar edi. Ularni inson o'rnida ko'rmasdilar. Ba'zilar xotinini xohlamay qolsa, boshqaga uylanib, uni qarovsiz qoldirar, na o'zi xotin qilar va na boshqaga erga tegib ketishiga imkon berar edi. Yoki taloq qilib, iddasi yaqin qolganda yana qaytib, uni o'yinchoq qilardi. Shu va shunga o'xshash usullar bilan ayollarni hayvondan battar holga solar edilar.\r\n    Islom bunday xorliklarga chek qo'ydi. Er kishiga faqat uch taloqning huquqini berdi. Ayolni qiynamaslikka buyurdi. Ayni chog'da, ayolga 'xulu'' huquqini berdi. Ya'ni ayol kishi eri bilan yashashni xohlamasa, bunga jiddiy sabab bo'lsa, qoziga arz qilib, ajrab ketishiga imkon berdi. Albatta, bu borada boshqa kitoblarda batafsilroq so'zlarmiz, lekin ushbu sura tafsirida ham qisqacha bo'lsa-da, eslatib o'tish foydadan xoli emas, deb bildik.\r\n    'Taloq' so'zi lug'atda biror narsani bo'shatib qo'yish ma'nosini anglatadi. Shariatda esa er-xotinlik bog'lanishini ochiq yoki kinoya iboralari bilan bo'shatishga aytiladi. 'Sen taloqsan', 'Seni taloq qildim' kabi iboralar er-xotinning ajralishini ochiq anglatgani uchun ularni ochiq iboralar deyapmiz. Kinoya iboralari esa 'Sen menga haromsan' kabi ifodalardir.\r\n    Taloqning shariatda ruxsat berilganiga sabablar ko'p. Shulardan ikkitasini zikr qilib o'taylik.\r\n    1. Faraz qilaylik, bir kishining xotini tug'maslik kasaliga mubtalo. U kishi o'zgalarga o'xshab, ortidan zurriyot qoldirishni xohlaydi. Ikki xotinni ushlab turishga esa imkoni yo'q. Shunda avvalga xotinni taloq qilib, farzand ko'rishga layoqati bor ayolga uylanishi mumkin.\r\n    2. Er-xotinning fe'l-atvorlari bir-birlariga to'g'ri kelmay qolib, bir-birlariga nafratlari kuchayib, birga yashashning sira iloji qolmaganida ham taloq yordamga keladi. Ikkovini bir-biridan qutqaradi. Hozirda taloqni Islomga ayb qilib taqaydigan g'arbiy davlatlarning ko'pida o'z dinlarining ahkomlariga qarshi chiqib, taloqqa ruxsat berilgan.\r\n    Ba'zilar er kishining bir og'iz so'zi bilan taloq tushishini juda ham yengil hukm, hayotga jiddiy qaramaslik deb tushunadilar. Aslini olganda, bunday xavotirga asos yo'q. Islom hayotga jiddiy qaraydi. Islom nuqtai nazaridan qaralganda, balog'atga yetgan har bir inson o'z so'ziga javobgardir. 'Qiyomat kuni bekordan-bekorga o'ldirilgan chumchuq Allohning huzurida tortishib, 'Ey Parvardigor, manavi bandang meni foydalanish uchun emas, balki bekordan-bekorga o'ldirgan edi, endi mening qasosimni olib ber', deydi', – degan edilar mahbub Payg'ambarimiz Muhammad alayhissalom. Demak, hayotga jiddiyat bilan qarash har bir musulmonning burchi. Jumladan, taloq masalasida ehtiyot bo'lish ham har bir musulmon erkakning vazifasidir. Bo'lar-bo'lmas sabablarga ko'ra ayolni taloq qilaverish musulmonchilikka to'g'ri kelmaydi. Suraning tafsiri bayonida yana ko'plab masalalar oydinlashadi. Shuni ham aytish kerakki, bu sura taloq haqidagi hamma oyatlarni o'z ichiga olgan emas."
        ]
    },
    {
        "word": "Talxiysu Kashshof",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhining bu kitobi imom Zamaxshariyning mashhur 'Kashshof' tafsirining muxtasaridan iboratdir. Allomai Taftazoniy rahmatullohi alayhi o'zining bu kitobini Samarqandda hijriy 789 yilning rabi'ul avval oyida boshlab, o'sha yilning o'zida tamomlagan."
        ]
    },
    {
        "word": "Tamattuʼ ",
        "type": [],
        "definition": [
            "'Tamattu'' so'zi arabcha bo'lib, 'foydalanish', 'rohatlanish', 'huzur qilish' ma'nolarini anglatadi. Avval umrani ado etib, haj vaqtigacha ehrom harom qilgan narsalardan Tamattu', ya'ni, foyda, rohat, huzur qilib yurib, vaqti kelganda yana ehromga kirib hajni niyat qilgan odamni 'Tamattu' haj qilgan kishi' deyiladi. Tamattu' haji haj oylarida tashqaridan kelib haj qiladiganlarga joizdir. Makkada yashovchilarga hamda Makkaga haj oylaridan avval kelib, haj mavsumini kutib tupganlarga joiz emas. Tamattu' haj qiluvchi ehromga kirayotganda umra-nigina niyat qiladi."
        ]
    },
    {
        "word": "Tamiym Doriy",
        "type": [],
        "definition": [
            "Tamiym ibn Avs ibn Xorija Doriy, kunyalari Abu Ruqiya, nisbatlari Dor ibn Honiyga. Bu zot oldin nasroniy diynida bo'lib, hijratning to'qqizinchi yilida Islomga kirdilar. Shundan keyin Falastin ahlining obidi, Qur'onni ko'p tilovat qiluvchi, kechalarini tahajjud namozi bilan bedor o'tkazuvchi va masjidga birinchi bo'lib chiroq olib kirgan sifatlari ila ulug' sahobalardan biriga aylandilar.\r\n    Tamiym Doriy roziyallohu anhu hammasi bo'lib, 18ta hadis rivoyat qilganlar. Bu hadislarni Imom Buxoriy va Muslim 'Sahih' kitoblariga kiritishgan. U zotdan Abdulloh ibn Vahb, Sulaymon ibn Omir, Shurahbil ibn Muslim, Qubaysa ibn Zuayb va boshqalar rivoyat qilishgan.\r\n    Rasululloh sollallohu alayhi vasallam bu zotga Falastindagi Aynun qishlog'ini alohida ajratib berdilar. Bu qishloq hozir ham Baytul Maqdisda mashhurdir. So'ngra Madinada istiqomat qildilar. Usmon roziyallohu anhu o'ldirilganlardan keyin Shomga ko'chib ketdilar va hijratning 37-yili Falastinda vafot etdilar."
        ]
    },
    {
        "word": "Tamhid ",
        "type": [],
        "definition": [
            "Hofiz Abu Amr ibn Abdulbarrning kitobi."
        ]
    },
    {
        "word": "Tanʼiym ",
        "type": [],
        "definition": [
            "Oisha onamizning masjidlari"
        ]
    },
    {
        "word": "Tanʼim ",
        "type": [],
        "definition": [
            "Tan'im – Madinaga yurishda Makkaga yaqin bir joyning nomi bo'lgan. U yer hozirda Makka shahrining ichiga kirib ketgan bo'lib, Oisha roziyallohu anho nomidagi masjid shu yerda joylashgan. Bu yer umra uchun ehrom bog'lanadigan miyqot hisoblanadi"
        ]
    },
    {
        "word": "Tarviyha",
        "type": [],
        "definition": [
            "Taroveh namozining har to'rt rak'atidan keyin o'tirishga aytiladi va uning ismidan taroveh namozining nomi olingandir. Ushbu o'tirish paytida har yurtning odamlari o'zlariga odat bo'lib qolgan tasbih va tahlillardan o'qishadi."
        ]
    },
    {
        "word": "Tarviya ",
        "type": [],
        "definition": [
            "Zulhijja oyining sakkizinchi kuni. Bu kun Turkistonda 'yolg'on arafa', arabchada esa, 'tarviya' kuni deyiladi"
        ]
    },
    {
        "word": "Tarviya kuni",
        "type": [],
        "definition": [
            "Tarviya kuni – Zulhijja oyining sakkizinchi kuni"
        ]
    },
    {
        "word": "Tarjiyʼ",
        "type": [],
        "definition": [
            "'Tarjiy'' so'zi lug'atda 'qaytarish' ma'nosini anglatadi. Amalda esa, azondagi 'ashhadu'dan boshlanadigan jumlalarni avval o'zi eshitadigan darajada ichida aytib olib, keyin baland ovoz bilan aytishdir."
        ]
    },
    {
        "word": "Tarjimonul Qurʼon",
        "type": [],
        "definition": [
            "Fors tilida yozilgan bu asarda Sayyid Sharif Jurjoniy rahmatullohi alayhi Qur'oni Karimdagi ba'zi kalimalarning forscha ma'nolarini bayon qilgan. Bu kitob ham chop qilingan"
        ]
    },
    {
        "word": "Tarjih ",
        "type": [],
        "definition": [
            "Bir narsadan boshqasining ustunligini aniqlash"
        ]
    },
    {
        "word": "Tariqat ",
        "type": [],
        "definition": [
            "yo'l, usul, uslub. Allohga yaqinlashish va Uning roziligiga erishishmaqsadida joriy etilgan qoida va rusumlar majmuasi."
        ]
    },
    {
        "word": "Taroveh ",
        "type": [],
        "definition": [
            "hordiq chiqarish, tin olish; ramazon oyi davomida kechalari o'qiladigan qo'shimcha namoz"
        ]
    },
    {
        "word": "Taroveh namozi",
        "type": [],
        "definition": [
            "Ramazonda bedor bo'lib o'qiladigan namoz. 'Taroveh' rohat-istirohat ma'nosidadir. Chunki, mazkur namoz istirohat hisoblanadi, har to'rt rak'atni o'qib bo'lgandan keyin istirohat olinadi."
        ]
    },
    {
        "word": "Taroxiy ",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Tarra ",
        "type": [],
        "definition": [
            "Tarra – bodringning bir turi. Odatda uzunroq, sersuv, serurug' bo'ladi."
        ]
    },
    {
        "word": "Tartil",
        "type": [],
        "definition": [
            "'Tartil' arabcha so'z bo'lib, Qur'onning o'qilish sifatiga, kayfiyatiga va uni o'rgatadigan ilmga nisbatan ishlatiladi. Bu ilm yana 'tajvid', 'tilovat haqqi' kabi nomlar bilan ham atalgan.Tartil ('rotl' o'zagidan olingan) so'zi lug'atda biror narsani dona-dona qilib terishni anglatadi."
        ]
    },
    {
        "word": "Tasavvuf ",
        "type": [],
        "definition": [
            "po'stin kiyish, so'fiylik yo'li; insonning ruhiy olamiga bog'liq qarash va amaliyotlar majmui."
        ]
    },
    {
        "word": "Tasavvuf haqida tasavvur",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining qalamlariga mansub 'Tasavvuf haqida tasavvur' kitobi. Kitobxonlarimiz tomonidan sevib o'qiladigan ushbu kitob tasavvuf ixlosmandlari uchun yanada kengroq ma'lumotlar manbai bo'lib xizmat qiladi.\r\n    Muallif: Shayx Muhammad Sodiq Muhammad Yusuf\r\n    Nomi:        Tasavvuf haqida tasavvur (to'ldirilgan ikkinchi nashr)\r\n    Nashriyot: 'Sharq' NMAK\r\n    Sana:        2010\r\n    Hajmi:     280 bet\r\n    ISBN:        978-9943-00-495-5\r\n    O'lchami:    84×108\/32\r\n    O'zbekiston Respublikasi Vazirlar Mahkamasi huzuridagi Din ishlari bo'yicha qo'mitaning tavsiyasi ila chop etilgan"
        ]
    },
    {
        "word": "Tasarriy ",
        "type": [],
        "definition": [
            "'Tasarriy' cho'risidan xotin o'rnida foydalanishdir. 'Tasarriy' cho'rini uyda o'tiradigan qilib, kechasi birga yotishi bilan bo'ladi. Bunda nikoh bo'lmaydi. Nikohni istagan xoja oldin cho'risini ozod qiladi va keyin nikohiga oladi."
        ]
    },
    {
        "word": "Tasbeh",
        "type": [],
        "definition": [
            "Oisha binti Sa'd ibn Abu Vaqqosdan, u otasidan rivoyat qilinadi:\r\n    'U kishi Rasululloh sollallohu alayhi vasallam bilan bir ayolning oldiga kirdilar. Uning oldida danaklar yoki mayda toshlar bo'lib, o'shalar bilan tasbeh aytayotgan edi. Shunda u zot: 'Men senga undan oson – yoki afzal – narsaning xabarini beraman: Subhanallohi adada maa xolaqa fis-samaai va Subhanallohi adada maa xolaqa fil arzi va subhanallohi adada maa xolaqa bayna zalik, va subhanallohi adada maa xolaqa maa huva xoliqun, vallohu Akbar mislu zalika, valhamdulillahi mislu zalika, va laa ilaaha illallohu mislu zalik, va laa havla va laa quvvata illa billahi mislu zalik', dedilar'.\r\n    Ushbu hadisda zikrni ko'p takrorlash va uni qo'ldan boshqa narsa bilan sanash ham mumkinligiga dalil bor. Xuddi shu ma'noni anglatish uchun mashhur muhaddis imom Abu Dovud o'z kitobida mayda tosh bilan tasbeh aytish bobini ochgan va ushbu biz o'rganayotgan hadisni keltirgan. Mana shundan bizda 'tasbeh' nomini olgan, ma'lum bir adaddagi danak yoki dumaloq narsalarni ipga tizib yasaladigan, arablar 'subha' deb nomlaydigan narsa paydo bo'lgan. Ibn Manzur bu narsani tushuntirish uchun: 'Subha' – tasbeh aytuvchi o'zi aytadigan tasbehlarni sanaydigan donalardir. Bu yangi chiqqan so'z bo'lib, gohida uni 'misbaham' ham deyishadi', degan"
        ]
    },
    {
        "word": "Tasmiya ",
        "type": [],
        "definition": [
            "'Bismillah'ni aytishni anglatadi"
        ]
    },
    {
        "word": "Tafil ",
        "type": [],
        "definition": [
            "Tafil – Makkai Mukarramadan o'ttiz mil (55,5 km) uzoqlikda joylashgan, Majanna yaqinidagi tog'"
        ]
    },
    {
        "word": "Tafoul ",
        "type": [],
        "definition": [
            "Tafoul – yaxshilikka yo'yish, shumlanishning ziddi."
        ]
    },
    {
        "word": "Tafsir ",
        "type": [],
        "definition": [
            "bayon qilish, ochib berish, ravshan qilish, izohlash, sharhlash; Payg'ambar alayhissalomning hadislari, arab tili gramamtikasi qoidalari va balog'at ilmining usullariga tayanib Qur'on oyatlarining mazmunini yoritib beradigan ilm. Mazkur ilmda oyatlardagi so'zlarning ma'nosi, oyatlar nozil bo'lish sabablari, ishoralar, nosix va mansux oyatlarni bir-biridan ajratib olish, turli qissalar tahlili haqida so'z boradi."
        ]
    },
    {
        "word": "Tafsiri Hilol",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining qalamlariga mansub olti jildlik 'Tafsiri Hilol' kitoblari.\r\n    'Tafsiri Hilol' - butun olamga mudarris bo'lgan buyuk ulamolar yurti - Movarounnahr diyorida yozilgan eng yangi tafsirdir. Zamonamizning zabardast olimlaridan biri shayx Muhammad Sodiq Muhammad Yusuf hazratlarining ushbu tafsirlari o'zining sodda va ravon tili, teran va daqiq uslubi bilan ajralib turuvchi shoh asardir. 'Tafiri Hilol' mo''tabar tafsirlarning an'analariga sodiq qolgan holda, bugungi kun kitobxonining saviyasi, dunyoqarashi va ehtityojlarini ham hisobga olib yozilgan bo'lib, o'quvchini Qur'oni karim ma'nolarining bitmas-tuganmas hikmatlariga oshno etadi."
        ]
    },
    {
        "word": "Tafsiriz zahrovayni",
        "type": [],
        "definition": [
            "'Tafsiriz zahrovayni' (al-Baqara va Oli Imron). - Sayyid Sharif Jurjoniy rahmatullohi alayhning kitobi. Qur'oni Karimning Baqara va Oli Imron suralarini qo'shib zahrovayni – ikki nur sochuvchi deb nomlanadi. Quyidagi hadisi sharifga amal qilgan holda ushbu ikki surai karimaga alohida ahamiyat beriladi.\r\n    Abu Umoma Bohiliy roziyallohu anhudan rivoyat qilinadi:\r\n    'Nabiy sollallohu alayhi vasallam dedilar:\r\n    'Qur'onni qiroat qiling. U qiyomat kuni o'z ashoblariga shafoatchi bo'lib keladi.\r\n    Ikki nur sochuvchini: Baqara va Oli Imron suralarini qiroat qiling. Ikkovlari qiyomat kuni xuddi ikki bulutga yoki ikki soyabonga, yoxud ikki qush galasiga o'xshab keladi. Ikkovlari o'z ashoblari haqida tortishurlar'.\r\n    Termiziy rivoyat qilgan.\r\n    Shuning uchun ham Sayyid Sharif Jurjoniy rahmatullohi alayhi bu ikki surani alohida tafsir qilgan."
        ]
    },
    {
        "word": "Taxlil qilish",
        "type": [],
        "definition": [
            "Taxlil qilish barmoqlarni bir-biriga yoki soqolni orasiga kiritish bilan bo'ladi."
        ]
    },
    {
        "word": "Taxrij",
        "type": [],
        "definition": [
            "chiqarmoq (hadis olingan manbalarni chiqarish)"
        ]
    },
    {
        "word": "Taxtakach ",
        "type": [],
        "definition": [
            "'Taxtakach' deganda, aslida, suyak singanda yoki biror joyi chiqqanda ikki tarafdan taxta yoki shunga o'xshash narsani qo'yib bog'lashga aytiladi. Ammo, umuman, jarohatni bog'lash yoki to'sib qo'yishlar ham shunga kiradi. Gipslab qo'yish, yaraga biror narsani yopishtirib qo'yishlar shu jumladandir."
        ]
    },
    {
        "word": "Tahajjud ",
        "type": [],
        "definition": [
            "tunda o'qiladigan nafl namoz, bedor bo'lmoq, bedorlik"
        ]
    },
    {
        "word": "Tahajjud namozi",
        "type": [],
        "definition": [
            "Kechasi bir uxlab turib o'qiladigan namozni 'tahajjud namozi' deb ataladi. Shuningdek, bu namozni 'qiyom namozi' deb ham aytiladi. Avval boshida bu namoz vojib bo'lgan edi. Bir yildan keyin vojibligi nasx qilingan."
        ]
    },
    {
        "word": "Tahbirut-taysir fil-qiroat al ʼashr",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat bo'yicha kitoblari"
        ]
    },
    {
        "word": "Tahziybul mantiq val kalom",
        "type": [],
        "definition": [
            "Allomai Taftazoniy rahmatullohi alayhi bu kitobni 789 yilda yozgan. U juda ham mashhur kitoblardan bo'lib, ko'p marta chop qilingan.\r\n    Bu juda ham pishiq matn bo'lib, o'z sohasida tengi yo'q kitob deb tan olingan. Ushbu kitob o'z vaqtida hamma tarafda shuhrat qozongan va hamma tarafidan ehtimom bilan o'rganilgan. Muhaqqiq ulamolar mazkur kitobni o'qib-o'rganibgina qolmay, unga ko'plab sharhlar ham yozganlar."
        ]
    },
    {
        "word": "Tahiyyati masjid",
        "type": [],
        "definition": [
            "'Masjid salomi' - Masjidga kirgach o'qiladigan ikki rakatli namoz"
        ]
    },
    {
        "word": "Tahlil ",
        "type": [],
        "definition": [
            "“La ilaha illolloh” kalimasi."
        ]
    },
    {
        "word": "Tahorat ",
        "type": [],
        "definition": [
            "tozalik, poklik, ozodalik; ibodat oldidan tozalanish."
        ]
    },
    {
        "word": "Tahrim surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 12 oyatdan iborat.\r\n    Ushbu surai karimaga ism bo'lib qolgan 'tahrim' so'zining lug'aviy ma'nosi 'harom qilish'dir.\r\n    Bu surai karima Nabiy alayhissalomning oilalariga taalluqli masalalar va hukmlarni muolaja qiladi. Nabiy alayhissalomning mo'minlarning onalari bo'lmish pokiza ayollari haqida so'z yuritadi.\r\n    Nabiy alayhissalom ba'zi xotinlarining roziligini o'ylab, o'zlariga Alloh taolo halol qilgan narsani o'zlaricha harom qilgan edilar. Sura mana shu ishning durust bo'lmaganini bayon qilish bilan boshlanadi.\r\n    Undan so'ng juda ham xatarli bo'lgan ish – oilaviy sirni fosh qilish haqida so'z ketadi. Bunga Nabiy alayhissalomning shaxsiy hayotlaridan misol keltiriladi.\r\n    Nabiy alayhissalomning xotinlari oralarida sodir bo'lgan ba'zi kelishmovchiliklar, rashk qilishlar noto'g'ri ekani ularning o'zlariga tushuntiriladi. Ularni qattiq tanqid qilinadi.\r\n    Oxirida esa mo'min er bilan yashagan kofira ayol va kofir er bilan turmush qurgan mo'mina ayolning misoli keltiriladi. Oxiratda hasabu nasab, yaqinlik va qarindoshlik hech foyda bermasligi uqtirib o'tiladi.\r\n    Ko'rinib turibdiki, bu sura Nabiy alayhissalomning shaxsiy-oilaviy hayotlari xususidadir. Unda hatto xotinlari bilan bo'lib o'tgan hissiy tuyg'ular ham tilga olinadi. Bularni Qur'onda zikr qilishning nima foydasi bor, degan savol tug'ilishi mumkin. Javob shuki, Muhammad alayhissalom payg'ambar bo'lganlaridan so'ng u kishining hayotlari faqat o'zlari uchun emas, balki barcha ummatlariga mulk bo'lib qoldi. U kishining hayotlari Qur'oni Karimning hayotga jonli tatbiqiga aylandi. Bu ulkan hayotning har bir lahzasi qiyomat kunigacha mo'min-musulmonlar uchun yaxshi o'rnakdir. Shuning uchun Nabiy alayhissalomning hayotlaridagi nozik va daqiq holatlarni ham kashf etishning hikmati katta. Eng muhimi, bu ajoyib, beqiyos va ulkan hayotning birovdan berkitadigan joyi yo'q. Har bir lahzasi va har bir harakati hidoyat va barakaga to'la. O'zga yo'lboshchilar, dohiylar, rahbarlar o'z hayot yo'llarini bunchalik daqiq joylarigacha oshkor eta olmaydilar. Chunki bunday qilsalar, barchalarining kamchiliklari, ayblari ochilib, 'dohiylik' da'volari chilparchin bo'ladi. Bizlar shuning uchun ham Muhammad alayhissalomning siyratlarini, ya'ni hayot yo'llarini puxtaroq o'rganishga harakat qilishimiz kerak. Raqiblarga ularning 'dohiylari' hayoti va qilgan ishlarini Nabiy alayhissalomning hayotlari va qilgan ishlariga solishtirib ko'rishni taklif qilmog'imiz lozim. O'shanda hamma narsa o'z o'rnini topadi.\r\n    Sura oyatlarining tafsirini boshlashdan avval ularning nozil bo'lish sabablari haqidagi rivoyatlarni keltirib, tadqiq etib, o'rganib chiqaylik.\r\n    Abdulloh ibn Abbosdan qilingan rivoyatda shunday deyiladi:\r\n    'Umar ibn Hattobga:\r\n    – Bu ikki ayol kimlar? – dedim. U kishi:\r\n    – Oisha bilan Hafsa, – dedilar. Gapning boshi Ibrohimning onasi Moriya haqida bo'lgan. Rasululloh Moriyaga Hafsaning uyida yaqinlik qilgan ekanlar. Buni Hafsa bilib qolib:\r\n    – Ey Allohning Nabiysi, menga nisbatan hech bir xotiningizga qilmagan ishni qildingiz, navbat kunimda, uyimda, to'shagimda shu ish bo'ldi, – dedi. Nabiy alayhissalom:\r\n    – Uni o'zimga harom qilsam, yaqinlashmasam, rozi bo'lasanmi? – dedilar. Hafsa:\r\n    – Ha, – dedi. Ul zot Moriyani o'zlariga harom qildilar va Hafsaga:\r\n    – Bu gapni hech kimga aytmagin, – dedilar. Lekin Hafsa bu sirni Oishaga aytib qo'ydi va Alloh quyidagi oyatlarni nozil qildi'.\r\n    Tushunarli bo'lishi uchun rivoyatda ismlari zikr qilingan shaxslar haqida qisqagina ma'lumot beramiz.\r\n    Abdulloh ibn Abbos – mashhur sahobalardan, Nabiy alayhissalomning amakivachchalari, 'Qur'on tarjimoni' nomini olganlar.\r\n    Umar ibn Xattob – eng ulug' sahobiylardan, ikkinchi xalifa. Umari Odil nomi bilan mashhurdirlar.\r\n    Oisha – Nabiy alayhissalomning xotinlaridan birlari. Hazrati Abu Bakrning qizlari.\r\n    Hafsa – Nabiy alayhissalomning xotinlaridan birlari. Hazrati Umari Odilning qizlari.\r\n    Moriya – Misr podshohi tomonidan Nabiy alayhissalomga hadya qilingan cho'ri. Shariat hukmiga binoan, Nabiy alayhissalom Moriya bilan er-xotinlik aloqasida bo'lganlar va u kishidan Ibrohim ismli o'g'il ko'rganlar, shuning uchun Moriya roziyallohu anho 'Ibrohimning onasi' deb nomlanadilar.\r\n    Bu oyatlarning nozil bo'lish sababi haqida umuman boshqa hodisa ham rivoyat qilinadi.\r\n    Imom Buxoriyning rivoyatlarida keladiki:\r\n    'Oisha onamiz aytadilar: 'Nabiy alayhissalom Zaynab binti Jaxshning huzurida asal ichardilar va u bilan uzoq o'tirardilar. Hafsa ikkovimiz kelishib oldik-da, 'U kishi qay birimizning oldimizga kelsalar, 'Asalarining sham'ini yebsizmi, sizdan sham'ning hidi kelyapti', deymiz', – dedik.\r\n    Hafsaning oldiga kirgan ekanlar, u haligi gapni aytibdi. Shunda Nabiy alayhissalom: 'Yo'q, men Zaynab binti Jaxshning oldida asal ichgan edim, endi qaytib bu ishni qilmayman, qasam ichdim, ammo sen bu gapni hech kimga aytmagin', – debdilar'.\r\n    Bu ikki rivoyat va shunga o'xshash boshqa rivoyatlarni sinchiklab o'rgangan ulamolarimiz: 'Rivoyatlardagi qissalar ikki xil bo'lishining hech qanday ajablanarli joyi yo'q. Nabiy alayhissalom Hafsaning uyida Moriya bilan birga bo'lganlaridan so'ng, Zaynab binti Jaxshning oldilariga borib, asal ichganlar va navbati bo'lgani uchun, Hafsaning uyiga qaytib kelganlar', – deydilar.\r\n    Hafsa kelishilgan gaplarni aytgan, so'ng Moriya haqida so'z ketgan va hokazo.\r\n    Ma'lumot uchun aytish lozimki, Zaynab binti Jaxsh ham Nabiy alayhissalomning xotinlaridan biri bo'lib, boshqa onalarimizga: 'Sizlarni Rasulullohga ota-onalaringiz xotin qilib bergan, mening nikohimni esa Alloh taoloning O'zi yetti osmonning ustidan amr qilgan', – der edilar.\r\n    Endi bevosita suraning tafsirini boshlasak."
        ]
    },
    {
        "word": "Tahrima ",
        "type": [],
        "definition": [
            "'tahrima' namozni boshlashda aytiladigan takbirdir. Uni 'takbiri tahrima' deyish odat bo'lib qolgan. Chunki, namoz o'qishni niyat qilib 'Allohu Akbar!' deb takbir aytish bilan namoz o'quvchiga ushbu takbir aytishdan oldin halol bo'lgan ishlar harom bo'ladi. Namozning ichida ulardan hech birini qila olmaydi."
        ]
    },
    {
        "word": "Tahrif ",
        "type": [],
        "definition": [
            "O'zgartirish"
        ]
    },
    {
        "word": "Tashahhud",
        "type": [],
        "definition": [
            "Namozning har ikkinchi rak'atida o'qiladigan 'At-tahiyyaatu'.Agar namoz ikki rak'atli bo'lsa, shu bilan tamom bo'lar edi. To'rt rak'atli yoki uch rak'atli bo'lsa, bu birinchi o'tirish hisoblanib, uchinchi yoki to'rtinchi rak'atdan keyin oxirgi o'tirishga yana o'tirib, yana tashahhud o'qiladi va salom beriladi."
        ]
    },
    {
        "word": "Tashdid ",
        "type": [],
        "definition": [
            "ikkilantirish. Bir harfni ikki marta o'qish. Masalan: katta, obbo.."
        ]
    },
    {
        "word": "Taʼvil ",
        "type": [],
        "definition": [
            "izohlash, asl ma'nosiga qaytarish, ayrim murakkab oyatlar mazmunini o'z bilimi doirasida izohlash."
        ]
    },
    {
        "word": "Taʼdilul ulum",
        "type": [],
        "definition": [
            "Sodrush shariy'a Ubaydulloh ibn Mas'ud al-Buxoriyning kitobi"
        ]
    },
    {
        "word": "Taʼzir",
        "type": [],
        "definition": [
            "'Ta'zir' ham shar'iy jazo bo'lsa ham, hadd bo'la olmaydi. Chunki, u belgilanmagan bo'lib, qozi tomonidan belgilanishi ko'zda tutilgan."
        ]
    },
    {
        "word": "Taʼziya",
        "type": [],
        "definition": [
            "yupatish, hamdardlik bildirish, azador kishiga tasalli berish, ahvol so'rash"
        ]
    },
    {
        "word": "Taʼyinli boʻlmagan vojib roʻza",
        "type": [],
        "definition": [
            "mutlaq nazr ro'za va nafl ro'zani buzgan bo'lsa, qazosini tutishdir."
        ]
    },
    {
        "word": "Taʼliyqatun ʼalaa Avoriful Maorif lis-Suhravardiy",
        "type": [],
        "definition": [
            "Bu kitobning nomi 'Suharvardiyning tasavvuf ilmiga oid 'Avoriful Maorif' nomli mashhur kitobiga ta'liyq' deb tarjima qilinadi. Qadimda shunga o'xshash kitoblar bitish odati ham bo'lgan. Ba'zi kitoblarga ular yana ham tushunarliroq bo'lishi uchun ta'liyqlar yozilgan. Sayyid Sharif Jurjoniy rahmatullohi alayhining bu kitobi ham ana shular jumlasiga kiradi."
        ]
    },
    {
        "word": "Taʼliq ",
        "type": [],
        "definition": [
            "sanadining avvalida bitta yoki undan ko'p roviy ketma-ket tushirib qoldirilgan"
        ]
    },
    {
        "word": "Taʼlif ",
        "type": [],
        "definition": [
            "Yozish"
        ]
    },
    {
        "word": "Taʼlifot ",
        "type": [],
        "definition": [
            "yozilgan asarlar"
        ]
    },
    {
        "word": "Taʼrifot",
        "type": [],
        "definition": [
            "Sayyid Sharif Jurjoniy rahmatullohi alayhining ushbu kitobi u kishining eng mashhur kitoblaridan biridir. Bu kitob o'ziga xos diniy istilohlar qomusidir. Shu bilan birga, u ushbu mavzu bo'yicha arab tilida yozilgan qomuslarning birinchilaridan hisoblanadi. Unda muallifning davrigacha bo'lgan ilm va fanga oid lafzlarning ma'nolari qisqa va tushunarli qilib yoritilgan. Sayyid Sharif Jurjoniy rahmatullohi alayhi o'zining ushbu ajoyib qomusida so'zlarni alifbo harflari tartibi asosida keltirgan. Bu qomus hazirgacha o'zining ahamiyatini yo'qotgani yo'q, balki uning ahamiyati yanada ortib bormoqda. Bu ilmiy haqiqatni ko'plab sharqshunoslar ham tan olganlar.\r\n    Sayyid Sharif Jurjoniy rahmatullohi alayhi o'zining bu kitobida 1647ta istilohning ta'rifini keltirgan bo'lib, ular asosan kalom, falsafa, mantiq, nahv, sarf, aruz, qofiya, fiqh, faroiz, usulul fiqh, hisob, balog'at kabi ilmlarga xos istilohlarni o'z ichiga olgan.\r\n    Bu kitob qadimda ham mashhur bo'lgan, hozirda ham mashhurdir. Qayta-qayta chop qilingan va qilinmoqda."
        ]
    },
    {
        "word": "Taʼtiyl qilish",
        "type": [],
        "definition": [
            "amaldan qoldirish"
        ]
    },
    {
        "word": "Tayammum",
        "type": [],
        "definition": [
            "'Tayammum' so'zi lug'atda 'qasd qilish' ma'nosini bildiradi. Shariatda esa: 'Allohga qurbat niyatida poklovchi tuproq moddasini maxsus sifat ila ikki qo'l hamda yuzga surtish tayammumdir'."
        ]
    },
    {
        "word": "Tiyn surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 8 oyatdan iborat.\r\n    Bu surai karimaning nomi ham o'zining birinchi so'zidan olingan. Alloh taolo bu surani 'Tiyn', ya'ni anjir ila qasam ichish bilan boshlagani uchun o'sha kalima unga nom bo'lib qolgan.\r\n    Alloh taolo avvalgi surada komil inson – Muhammad sollallohu alayhi vasallam haqlarida so'z yuritdi. Ul zot Alloh taolo yaratgan maxluqot ichida eng mukammalidir. Bu surada esa, umuman, insonlar va ularning oqibati haqida, Alloh taolo iymon keltirganlarga nimalar tayyorlab qo'ygani haqida so'z ketadi.\r\n    Tiyn surasi anjir, zaytun, Turi Siyno va eminlik yurti – Makkai Mukarrama ila qasam ichish va Alloh taolo insonni eng go'zal suratda yaratganini ta'kidlash bilan boshlanadi.\r\n    So'ngra esa Alloh taoloning adolati bayon qilinib, mo'minga savob, kofirga iqob berilishini ta'kidlash ila tugaydi."
        ]
    },
    {
        "word": "Tilo ",
        "type": [],
        "definition": [
            "Tilo – musallas. Bu so'z aslida zarhal, lok deganidir. Bu ichimlik tayyor bo'lganda shu rangda bo'ladi, nomi ham shundan olingan. Bu sharob masalliqning uchdan biri qolishi bilan tayyor bo'lgani uchun keyinroq 'musallas', ya'ni 'uchdan bir' deb atalgan. Yarmi qolganini 'munassof' ('teng yarim') deb nomlashgan."
        ]
    },
    {
        "word": "Tilovat ",
        "type": [],
        "definition": [
            "Qur'oni karim suralari yoki oyatlarini yoddan o'qish."
        ]
    },
    {
        "word": "Tilovat sajdasi",
        "type": [],
        "definition": [
            "Qur'oni Karimdagi sajda oyatlarini tilovat qilinganda sajda qilish"
        ]
    },
    {
        "word": "Tihoma ",
        "type": [],
        "definition": [
            "Tihoma – Arabiston yarimorolining Qizil dengizga tutash joylari shunday nomlanadi. Tihoma dengiz sohili bo'ylab Yanbu'dan Najrongacha cho'zilgan tekisliklardan iborat."
        ]
    },
    {
        "word": "Tiyara ",
        "type": [],
        "definition": [
            "'Tiyara' – shumlanish. Bu so'z arabcha 'toyr' so'zidan olingan bo'lib, qush deganidir. Ilgari arablar biror muhim ishni qilmoqchi bo'lsa, masalan, safarga chiqishdan oldin yoki biror ishda ikkilansa, qo'liga qush olib, uchirishardi. Agar qush o'ng tarafga uchsa, o'sha ishni qilishar, cHar tarafga uchsa, qilishmas edi. Mana shu ish 'tiyara' deb atalgan va 'tiyara', 'tatoyyur' ('tiyara qilish') so'zlari umumiy shumlanishga ham ishlatiladigan bo'lib ketgan."
        ]
    },
    {
        "word": "Toba ",
        "type": [],
        "definition": [
            "Toba – yaxshi, oliyjanob, yoqimli. Nabiy alayhissalom Madinani shunday deb ham nomlaganlar"
        ]
    },
    {
        "word": "Tobeʼin ",
        "type": [],
        "definition": [
            "izdosh, ergashgan. Imonli holda sahobiyni ko'rgan, u bilan suhbat qurgan va shunday imonda vafot etgan kishi. Ular sahobiylarning ishlarini davom ettirganlar."
        ]
    },
    {
        "word": "Tobiyx",
        "type": [],
        "definition": [
            "Arablar go'shtdan pishirilgan taomni 'tobiyx' deydilar"
        ]
    },
    {
        "word": "Tobisha ",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Tovus roziyallohu anhu",
        "type": [],
        "definition": [
            "Tovus ibn Haysan Xuloniy al-Hamadoniy, kunyalari Abu Abdurrahmon.\r\n    Bu ulug' tobe'in hijratning 33 yili Yamanda tavallud topib, shu yerda ulg'aydilar. Fiqh va hadis ilmida olim bo'lib yetishdilar.\r\n    Tovus ibn Haysan podshoh va amaldorlarga yaqin bo'lishni xush ko'rmas, yaqin bo'lsalar ham, pand-nasihat qilishdan toymas edilar.\r\n    Bu zot hijratning 102-yili Muzdalifada haj qilib turib, vafot etdilar."
        ]
    },
    {
        "word": "Togʻut ",
        "type": [],
        "definition": [
            "'Tog'ut' so'zining ma'nosi 'juda haddidan oshuvchi' bo'lib, istilohda Allohdan o'zga ibodat qilingan har bir narsani anglatadi. Ba'zi ulamolar tog'utni shayton ham deyishgan ('Qomus'dan)."
        ]
    },
    {
        "word": "Todiza ",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Tojir ",
        "type": [],
        "definition": [
            "savdogar, tijoratchi"
        ]
    },
    {
        "word": "Toyyibatun-nashr fil-qiroat al ʼashr",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat bo'yicha kitoblari"
        ]
    },
    {
        "word": "Toliq ibn Ali",
        "type": [],
        "definition": [
            "Toliq ibn Ali ismli bu sahoba Rasululloh sollallohu alayhi vasallam huzurlariga Yamandan vakil bo'lib kelib, Islomni qabul qilganlardan edi."
        ]
    },
    {
        "word": "Tolut ",
        "type": [],
        "definition": [
            "Tolut – Banu Isroilning payg'ambari tarafidan bir jamoaga saylangan podshoh. Banu Isroil uning boshchiligida Jolut nomli zolim podshohga qarshi jangga otlanadi. Tolut bunday jiddiy kurashdan oldin qo'shinlarni sinovdan o'tkazish va ularning ichidan haqiqiy mo'minlarni ajratib olish maqsadida ularga shunday dedi: 'Hozir bir daryoga duch kelamiz. Kim undan bir kaftdan ortiq suv ichsa, u bizdan emas, jangga qatnashmaydi, shu yerdan qaytadi'. Uzoq safarda qattiq tashna bo'lgan askarlarning ko'pi chanqoqlikka chiday olmay, ko'p suv ichib qo'yadi, faqatgina uch yuzdan ortiq askar Tolut bilan birga daryodan o'tishga muvaffaq bo'ladi. Ularning ichida Allohning Nabiysi Dovud alayhissalom ham bor edi. Bu haqda Baqara surasining 246–251-oyatlarida batafsil hikoya qilingan."
        ]
    },
    {
        "word": "Tolha ibn Ubaydulloh",
        "type": [],
        "definition": [
            "Tolha ibn Ubaydulloh Qurashiy at-Tamimiy. Bu ulug' sahobani Abu Bakr roziyallohu anhu Islomga da'vat qilib, Rasululloh sollallohu alayhi vasallamning huzurlariga olib keladilar. Tolha Islomga birinchilardan bo'lib kiradi.\r\n    Bu zot hijratdan oldin Makkada sahoba Zubayr bilan islomiy birodar edilar. Hijratdan so'ng Abu Ayyub Ansoriy bilan birodar bo'ldilar. Tolha ibn Ubaydulloh jannatga kirishlari bashorat berilgan o'n sahobaning biri edilar.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Tolha va Zubayr mening jannatdagi qo'shnilarim', deb marhamat qilganlar.\r\n    Rasululloh sollallohu alayhi vasallam Badr kunida bu zotni xabarlarni bilib kelish uchun Shomga jo'natganlari sababli, bu jangda ishtirok eta olmadilar. Uhud jangi, Rizvon bay'ati va bulardan keyingi barcha janglarda qatnashdilar.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Kim tirik yuruvchi shahidni ko'rishni xohlasa, Tolhaga qarasin', deganlar.\r\n    Bu zot hammasi bo'lib 38ta hadis rivoyat qildilar. Bu hadislardan ba'zilarini uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Tolha ibn Ubaydulloh Jamal voqeasida Ali roziyallohu anhu bilan birga ishtirok etdilar. Hijratning 36-sanasida 62 yoshlarida ana shu urushda shahid bo'ldilar"
        ]
    },
    {
        "word": "Torafoni – Ikki Taraf",
        "type": [],
        "definition": [
            "Imom Abu Hanifa va Muhammad ibn Hasan Shayboniy rahmatullohi alayhilar."
        ]
    },
    {
        "word": "Toriq ibn Shihob",
        "type": [],
        "definition": [
            "Toriq ibn Shihob ibn Abu Shams ibn Salama al-Bajaliy al-Ahmasiy, kunyalari Abu Abdulloh. Toriq ibn Shihob roziyallohu anhu Rasululloh sollallohu alayhi vasallamni ko'rganlar-u, lekin suhbatlarida bo'lmaganlar.\r\n    Hadislarini to'rtta xalifa va bir nechta sahobalardan rivoyat qilganlar. Abu Bakr va Umar ibn Xattob davrlaridagi o'ttiz uchta g'azotda ishtirok etganlar.\r\n    Toriq ibn Shihob roziyallohu anhu Kufada istiqomat qildilar. Hijratning 83-yili vafot etdilar."
        ]
    },
    {
        "word": "Toriq surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 17 oyatdan iborat.\r\n    Ushbu surai karimaning nomi o'zining birinchi oyatidagi 'vat-toriqi' so'zidan olingandir. 'Toriq' so'zi arab tilida 'qattiq urish' ma'nosida ishlatiladi. Arablar bolg'ani 'mitroqa' ('qattiq uruvchi asbob') deb ataydilar. 'Toriq' so'zi asosan kechasi eshik qoqib, chaqirib keluvchiga nisbatan ishlatiladi. Surai karimadagi 'toriq' lafzi aynan shu ma'noda, 'kechasi keluvchi' degan ma'nosida ishlatilgan.\r\n    Boshqa makkiy suralar qatori, Toriq surasida ham Islom aqiydasiga taalluqli ba'zi ishlar muolaja qilinadi.\r\n    Toriq surasida inson o'lganidan so'ng qayta tiriltirilib, Robbul olamin huzurida sirlari fosh bo'lgan holda nochor turishi, Qur'on Alloh taoloning kalomi ekani, unga hech narsa zarar yetkaza olmasligi haqida so'z ketadi. Insonga xitob qilinib, uni o'ziga bir nazar solishga chaqiriladi. Aslida, inson shahvat paytida ajrab chiqadigan arzimagan suv edi. Lekin Alloh taolo uni tafakkur qiladigan jonli, aqlli zotga aylantirdi. Shunday narsaga qodir Alloh taolo o'lgan odamni tiriltira olmaydimi? Dunyodagi barcha narsa Alloh taoloning irodasi bilan bo'ladi.\r\n    Ushbu surai karima osmon bilan va tunda paydo bo'luvchi yulduz bilan qasam ichish ila boshlanib, har bir jonga muhofiz farishta biriktirilgani alohida ta'kidlanadi.\r\n    So'ngra esa Alloh taoloning o'lgan insonni qayta tiriltira olishga qodir Zot ekanini tasdiqlovchi hujjat va dalillar keltiriladi.\r\n    Keyin, bir kun kelib, barcha sirlar fosh bo'lishi, ana o'shanda kofir va osiylarda na bir quvvat va na bir yordamchi bo'lmasligi ta'kidlanadi.\r\n    Shundan so'ng osmonu yer bilan qasam ichib, Qur'oni Karimning fosil qiluvchi, ya'ni mo'min bilan kofirni ajratuvchi kalom ekani, hazil emasligi ta'kidlanadi.\r\n    Surai karimaning so'ngida esa kofirlarga tahdid oyatlari keladi."
        ]
    },
    {
        "word": "Toharat",
        "type": [],
        "definition": [
            "Poklik degan ma'noni anglatadi."
        ]
    },
    {
        "word": "Tohir as-Sufiy al-Buxoriy al-Voiz",
        "type": [],
        "definition": [
            "Abu Abdulloh Tohir ibn Muhammad as-Sufiy al-Buxoriy al-Voiz Buxoro ahlidan bo'lib, al-Haddodiy nomi bilan tanilgan edilar. Naxshabning Bazda qishlog'ida yashaganlar. Ota-bobolari temirchilik bilan shug'ullanganliklari sababli 'al-Haddodiy' taxallusini olganlar. Bu kishi 'az-Zuhd vat-tazkir' ('Parhezkorlik va zikr') va 'Uyun al-majolis va surur ad-doris' ('Majlislar ko'zi va mudarris shodligi') kitoblarining muallifidirlar. Abu Solih Xalaf ibn Muhammad al-Xayyom, Abu Bakr Ahmad ibn Sa'd az-Zohid va boshqa muhaddislardan hadis ilmidan ta'lim olganlar. O'zlaridan esa Abul Abbos al-Mustag'firiy hadis rivoyat qilganlar. Hijriy 406 (milodiy 1016) yilda zulqa'da oyiga 17 kun qolganda, shanba kuni Naxshabning Bazda qishlog'ida vafot etganlar."
        ]
    },
    {
        "word": "Toho surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 135 oyatdan iborat.\r\n    Ibn Abbos va Jobir ibn Zayd roziyallohu anhumolardan rivoyat qilinishicha, bu surai karima Maryam surasidan keyin nozil bo'lgan. Demak, ular Islom da'vatining paydar-pay bosqichlarida nozil bo'lgan ekan, shunga ko'ra, siyoqlari ham bir-biriga o'xshash bo'lishi, yaqin mavzularni muolaja qilishi turgan gap. Surai karimaning birinchi lafzi o'ziga nom bo'lib qolgan.\r\n    'Toho' lafzi haqida ulamolarimiz turlicha fikr aytadilar. Ba'zilari 'Toho' – hijo (alifbo) harflaridan biri, undan nima murod qilinganini Allohning O'zi biladi, desalar, boshqalari 'Toho' – Allohning go'zal ismlaridan biridir, deydilar. Yana birlari esa 'Toho' – Nabiy sollallohu alayhi vasallamning ismlari, deyishadi. Yana bir qism ulamolar borki, ular 'Toho' so'zini 'Ey kishi!' degani deb ham tushuntiradilar.\r\n    Shundan kelib chiqib, biz 'Toho' lafzidan nima murod qilinganini Allohning O'zi biladi, deymiz.\r\n    Sura Payg'ambarimiz Muhammad sollallohu alayhi vasallamga xitob qilish bilan boshlanadi va Makkada nozil bo'lgan boshqa suralar kabi, aqiyda, mo'minlik sifatlari va axloqlari haqida bahs yuritadi. Suraning bosh maqsadi tavhid, payg'ambarlik va qayta tirilib, mahsharga to'planish kabi diniy asoslarni kishilar qalbiga o'rnatishdir.\r\n    Toho surasida Nabiy sollallohu alayhi vasallamning shaxslari alohida vasf qilingan. U zot sollallohu alayhi vasallamni qo'llab-quvvatlashga, ruhlarini ko'tarishga katta e'tibor beriladi. Surada u zot kofir va mushriklarning hiyla-nayranglariga, yolg'onlariga, istehzo va mazaxlariga ahamiyat bermasdan, o'zlarining asosiy vazifalarini og'ishmay bajarishga undaladilar.\r\n    Ana shu mavzuga mos ravishda Muso alayhissalomning qissalari, aniqrog'i, u zotga payg'ambarlik berilganidan boshlab, Banu Isroil buzoqni o'ziga xudo qilib olganigacha bo'lgan davr batafsil hikoya etiladi. Muso alayhissalom og'alari Horun alayhissalom ila tug'yonga ketgan Fir'avn huzuriga qanday kirib borganlari, u bilan oralarida nima ishlar bo'lib o'tgani, Muso alayhissalomning Alloh taolo bilan roz aytishishlari, u kishining payg'ambar etib tanlanishlari, Fir'avn bilan qilgan mujodalalari, sehrgarlar bilan o'tkazgan muborazalari va boshqa hodisalar keltiriladi. Qissa davomida Alloh O'z payg'ambari va gaplashgan bandasi Muso alayhissalomni doimo hifzu himoyasida saqlayotgani yaqqol sezilib turadi. Shuningdek, qissada Alloh O'z dushmanlari bo'lmish kofirlarni albatta halok etishiga alohida urg'u beriladi. Suraning aksar qismi ushbu qissaga bag'ishlangandir. So'ngra Odam alayhissalomning qissalari ham qisqacha eslab o'tiladi. Alloh taolo O'z rahmati ila Odam xato qilganidan keyin, uni hidoyatga boshlab, to'g'ri yo'lga solgani, zurriyotlariga payg'ambarlar yuborib, haqqa da'vat etgani va qaysi yo'lni tanlash ixtiyorini ularning o'zlariga bergani aytiladi.\r\n    Shuningdek, sura davomida qiyomat tasviriga ham alohida e'tibor qaratiladi. Uning voqe' bo'lishi, mahshar sahnasi, hisob-kitob qay holda ro'y berishi, iymon va taqvo egalari jannatga, kufr va isyon egalari do'zaxga qanday kiritilishi vasf qilinadi.\r\n    Surai karimaning so'ngida yana Nabiy sollallohu alayhi vasallamga xitob qilinadi."
        ]
    },
    {
        "word": "Tosh otish savdosi",
        "type": [],
        "definition": [
            "'Tosh otish savdosi' degani sotiladigan narsani tosh otish bilan belgilash ila bo'ladigan savdodir. Misol uchun, 'Ushbu kiyimlarga falon joydan tosh otamiz, nechtasiga tosh tegsa, mana shu pulingga shuni olasan', deyiladi. Yoki, 'Bu pulingga ushbu yerni otilgan tosh tushgan joyigacha olasan', deyiladi."
        ]
    },
    {
        "word": "Tubbon",
        "type": [],
        "definition": [
            "'Tubbon' avrat joyinigina to'sadigan kalta ishtonga o'xshash kiyim."
        ]
    },
    {
        "word": "Tuvayr ibn Abu Foxita",
        "type": [],
        "definition": [
            "Tuvayr ibn Abu Foxita Sa'iyd ibn Alaqo Hoshimiy al-Kufiy – Ummu Honi' roziyallohu anhaning qullari edilar. Hadislarni otalari Abu Foxitadan, Ibn Umar, Zayd ibn Arqam, Ibn Zubayr, Mujohid, Abu Ja'farlardan rivoyat qilganlar.\r\n    Bu zotdan A'mash, Savriy, Shu'ba, Hajjoj ibn Artotalar rivoyat qilganlar."
        ]
    },
    {
        "word": "Tur surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 49 oyatdan iborat.\r\n    Surai karimaning birinchi so'zi o'ziga ism bo'lib qolgan. Tur – Siynaa yarim orolidagi Alloh taolo Muso alayhissalom bilan gaplashgan tog'ning ismi.\r\n    O'zga makkiy suralar kabi, bu surai karima ham iymon asoslari, payg'ambarlik, qayta tirilish kabi masalalarni muolaja qiladi. Asosan, oxirat dahshatlari, undagi ne'mat va azoblar, baxtiyorlarning va badbaxtlarning oqibati, boradigan joylari, haq ila botil o'rtasidagi kurash, Nabiy alayhissalomning shaxslari va risolatlari haqida mushriklar qo'zg'agan shubhalar haqida so'z ketadi.\r\n    Suraning avvalida botilga va mushriklar qo'zg'agan shubhalarga qarshi qattiq zarba beriladi. Chunki ular qiyomat bo'lishini inkor qilib, unda jazo va mukofotlar bo'lishiga ishonishmagan, Nabiy alayhissalom xabar bergan azoblarga masxara ko'zi bilan qarashgan. Shuning uchun sura muqaddas narsalar ila qasam ichish bilan boshlanadi va avvalgi suralarda ko'rib o'tganimizdek, bu qasamlar quyida katta ahamiyatli masala haqida so'z ketishidan darak beradi.\r\n    So'ngra jinoyatchilarni jahannamga haydab borish manzarasi, u yerdagi azob-uqubatlar zikr qilinib bo'lib, bevosita jannatiylarga ato etiladigan nozu ne'matlar, rohat-farog'at zikr qilinadi.\r\n    Keyingi oyatlarda esa mushriklar Qur'on va Payg'ambar alayhissalom haqlarida qo'zg'agan botil shubhalarga shiddatli savollar tariqasida raddiya keladi. So'ngra har qanday kofirni ham jim va lol qoldiradigan uchta savol beriladi. Albatta, bu savollarga hech kim javob bera olmaydi. Va, nihoyat, g'ofillar yana qo'rqinchli xabarlar bilan ogohlantirilib, suraga xotima yasaladi"
        ]
    },
    {
        "word": "Turnovad",
        "type": [],
        "definition": [
            "– Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Tuhfatul ixvan fil xulfi baynash--shatibiyya val ʼunvan",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    }
]