[
    {
        "word": "Ubay ibn Kaʼb",
        "type": [],
        "definition": [
            "Ulug' sahoba Ubay ibn Ka'bning kunyalari Abu Munzirdir. Umar ibn Xattob bu kishini 'Say-yid al-muslimin' deb chaqirar edilar.\r\n    Bu zot ikkita Aqaba bay'atida, Badr va undan keyingi hamma g'azotlarda ishtirok etdilar.\r\n    Ubay ibn Ka'b roziyallohu anhu Rasululloh sollallohu alayhi vasallamning sahobalaridan bo'lgan olti qozining biri edilar.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Ummatimning qorisi Ubay ibn Ka'bdir', deb marhamat qilganlar.\r\n    Rasululloh sollallohu alayhi vasallam:\r\n    'Alloh menga Qur'onning Bayyina surasini Ubayga o'qib berishga buyurdi', deb aytdilar.\r\n    Ubay ibn Ka'b Islomga kirishlaridan oldin yahudiy bo'lib, ularga nozil bo'lgan kitoblarni o'qib chiqqan va o'zlari ham kitob yozar edilar. Islomga kirganlaridan keyin Rasululloh sollallohu alayhi vasallamning vahiy kotiblaridan biri bo'ldilar.\r\n    Hammasi bo'lib, Rasululloh sollallohu alayhi vasallamdan 164ta hadis rivoyat qildilar. Bu zotdan bir nechta kishilar rivoyat qilganlar.\r\n    Bu zot hijratning 30-sanasida vafot etdilar.\r\n    Ibn Zamra aytdilar:\r\n    'Madinaga kelsam, xalq qo'zg'algan, shov-shuv bo'layotgan ekan. Nima bo'ldi, deb so'rasam, 'Bu shaharlik emasmisan, axir musulmonlar va qorilar sayyidi vafot etdilar-ku', deb aytdi'."
        ]
    },
    {
        "word": "Ubaydulloh al-Buxoriy al-Kalobodiy",
        "type": [],
        "definition": [
            "Abul Qosim Ubaydulloh ibn Muhammad al-Buxoriy al-Kalobodiy Xuroson qozisining a'yonlaridan edilar. Keyinchalik Marv, Hirot, Samarqand, Shosh, Farg'ona, Balxda, so'ng Buxoroda qozi bo'lganlar. 'Qozi al-quzzot' (Qozilar qozisi) unvonini olganlar. Abu Abdulloh al-Hofiz 'Tarixi Nishopur' kitoblarida bu kishi haqlarida ma'lumot berganlar: 'Hijriy 355 (milodiy 967) yili Buxoroga kelganimda, Abul Qosim al-Kalobodiy Buxoroning qozisi edilar. Otalari ham Buxoroda yetti yil qozi lavozimida bo'lganlar. Buxoro xalqidan masjidlarda, majlislarda eshitardim. Ular shunday duo qilishardi: 'Allohummag'fir lil-qozi al-Kalobodiy Muhammad ibn Ahmad ya'nuna abohu' (Allohim, otasining o'rniga yordamchi bo'lgan Kalobodning qozisi Muhammad ibn Ahmadning gunohlarini mag'firat qilgaysan). O'shanda ba'zi boshliqlar bu kishiga hasad etib, har xil bo'hton qilganlar. Hijriy 369 (milodiy 980) yilda Abul Qosim Buxorodan Nishopurga chiqib ketib, u yerda qozi bo'lganlar'."
        ]
    },
    {
        "word": "Ubaydulloh al-Kufiy al-Qozi ad-Dovudiy",
        "type": [],
        "definition": [
            "Abul Qosim Ubaydulloh ibn Ali al-Kufiy al-Qozi ad-Dovudiy Xurosonda o'z asrining faqihlaridan edilar. Iroq va Misr muhaddislaridan ko'p hadis tinglaganlar. Bag'dod, Kufa, Misr va Damashq ulamolaridan ta'lim olganlar. Keyinchalik vafotlariga qadar Buxoroda yashaganlar. Bu kishidan Abu Abdulloh al-G'unjor al-Hofiz va Abul Abbos al-Mustag'firiy al-Hofiz hadis rivoyat qilganlar. Hijriy 376 (milodiy 987) yilning jumodul avval oyida Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Uboda ibn Somit",
        "type": [],
        "definition": [
            "Uboda ibn Somit ibn Qays Ansoriy Xazrajiy, onalari Qurratul'ayni binti Uboda, kunyalari Abulvalid. Madina ulamolarining biri, birinchi va ikkinchi 'Aqaba' bay'atlarida ishtirok etgan. Badr, Uhud, Xandaq, Misr fathi va boshqa jangu fathlarda ishtirok etgan. Shom diyo¬ri fath etilganda Umar Ibn Xattobning buyruqlari bilan Shom ahliga Qur'onni o'rgatish uchun yuborilgan. Falastinga birinchi voliy etib tayinlangan. Alloh yo'lida malomatchining malomatidan qo'rqmaslikka Rasululloh sollallohu alayhi vasallamga bay'at bergan. Muhojir Abu Marsad G'onaviy bilan islomiy birodar bo'lgan, taqvo bilan sifatlangan ulug' sahobalardan edilar.\r\n    Uboda ibn Somit roziyallohu anhu Rasululloh sollallohu alayhi vasallamdan 181ta hadis rivoyat qilganlar. Bu hadislarni uchta 'Sahih' sohiblari o'z kitoblariga kiritishgan. Abu Umoma, Anas ibn Molik, Jobir, Fazola ibn Abid, Abu Idris Huvloniy, Abu Muslim Huvloniy, Abu Ash'as San'oniy, Janoda ibn Umayya va boshqa katta tobe'iynlar ham u kishidan hadis rivoyat qilganlar.\r\n    Uboda ibn Somit Rasululloh sollallohu alayhi vasallamdan:\r\n    'Qaysi sahobalar sizga yaqinroq?' deb so'radilar.\r\n    Shunda Rasululloh sollallohu alayhi vasallam:\r\n    'Abu Bakr, Umar, Usmon, Ali va sen, ey Uboda' deb, yana bir qancha ulug' sahobalarni zikr qildilar.\r\n    Uboda ibn Somit hijratning 34-yili Baytul Maqdisda 72 yoshlarida vafot etdilar."
        ]
    },
    {
        "word": "Uvqiyya ",
        "type": [],
        "definition": [
            "Kumush pulning o'lchovidir. Bir uvqiyya qirq dirhamga teng. Bir dirham 2,975 gr bo'lib, qirq dirhamning vazni 119 grammga teng. Demak, kumush pul ikki yuz dirhamga yetganida nisobga tenglashgan bo'ladi."
        ]
    },
    {
        "word": "Uzrlar ",
        "type": [],
        "definition": [
            "Fiqhiy istiloxda doimo burnidan qon oqib turishi, siydigi oqib turishi, yel chiqib turishi kabi narsalar anglanadi."
        ]
    },
    {
        "word": "Ukka ",
        "type": [],
        "definition": [
            "Ukka – teridan qilingan yumaloq mesh. Unga asosan yog' va asal solingan"
        ]
    },
    {
        "word": "Ulamo ",
        "type": [],
        "definition": [
            "olim so'zining ko'pligi, bilimdon"
        ]
    },
    {
        "word": "Umar al-Anjofiriniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Hafs Umar ibn Jarir al-Anjofiriniy al-Buxoriy - Anjofirin qishlog'idan. Sa'id ibn Mas'ud, Abu Safvon Ishoq ibn Ahmad as-Sulamiy va Abdulloh ibn Abdulvahhob al-Xorazmiydan hadis rivoyat qilganlar. O'zlaridan esa Abul Fazl Abbos ibn Ahmad ar-Rovodiy hadis rivoyat qilganlar. Hijriy 326 (milodiy 939) yilda vafot etganlar."
        ]
    },
    {
        "word": "Umar al-Buxoriy al-Jizoxishtiy",
        "type": [],
        "definition": [
            "Abu Muslim Umar ibn Ali al-Buxoriy al-Jizoxishtiy Buxoroning Jizoxisht qishlog'idan. Bu kishi hadis ilmining hofizlaridan edilar. Ilm talabida Xuroson, Iroq, Jibol va Kur al-Ahvozda bo'lib, u yerdagi ulug' mashoyixlardan, Buxoroda Abdulkarim al-Kalobodiy (Gulobodiy) va boshqa olimlardan ta'lim olganlar. Imom al-Buxoriy va Imom Muslim sahihlari o'rtasidagi hadislarni jamlaganlar. Bu to'plam 40 mashrasa bo'ldi. Bir mashrasa bir jildga yaqindir.\r\n    Hijriy 466 (milodiy 1074) yili Kur ul-Ahvozda vafot etganlar."
        ]
    },
    {
        "word": "Umar al-Buxoriy al-Xushnomiy",
        "type": [],
        "definition": [
            "Imom Umar ibn Muhammad Xushnom al-Buxoriy al-Xushnomiy Buxoro olimlaridan. Bu kishi fozil imom, mashhur faqih va taqvodor edilar. Abu Bakr Muhammad ibn Ali al-Buxoriydan ta'lim olganlar. O'zlaridan esa Abu Hafs Umar ibn Muhammad ibn Ahmad an-Nasafiy ta'lim olganlar. Hijriy 522 (milodiy 1129) yilning zulqa'da oyida Buxoroda vafot etganlar"
        ]
    },
    {
        "word": "Umar al-Lays al-Hofiz al-Laysiy",
        "type": [],
        "definition": [
            "Abu Muslim Umar ibn Ali al-Lays al-Hofiz al-Laysiy Buxoro ahlidan bo'lib, hofiz al-hadis edilar. Hadis ilmi talabida ko'p mamlakatda safarda bo'lib, hadislar jamlab, to'plamlar tuzganlar. Buxoro, Xuroson, Iroq olimlaridan ta'lim olganlar. Qisqa muddat Isfahonda ham yashaganlar. Bu kishidan Abu Abdulloh al-Xallol, Abu Nasr al-Muazzin va boshqalar hadis rivoyat qilganlar. Hijriy 466 (milodiy 1074) yili Xuzistonda vafot etganlar."
        ]
    },
    {
        "word": "Umar al-Madiniy as-Sobuniy",
        "type": [],
        "definition": [
            "Abu Hafs Umar ibn Abu Bakr al-Madiniy as-Sobuniy saxovatpesha shayx edilar. Faqirlarga muruvvat ko'rsatar edilar."
        ]
    },
    {
        "word": "Umar al-Muqri al-Jannotiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Hafs Umar ibn Xalaf al-G'azzol al-Muqri al-Jannotiy al-Buxoriy Buxoro ahlidan bo'lib, Abu Sa'id ar-Roziy va Abu Nasr al-Kalobodiydan ta'lim olganlar. O'zlaridan esa Abdulaziz ibn Muhammad an-Naxshabiy al-Hofiz ta'lim olganlar."
        ]
    },
    {
        "word": "Umar al-Xunjiy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Hafs Umar ibn Abul Horis al-Xunjiy al-Buxoriy Basrada yashab, Bag'dodda hadis ilmidan ta'lim berganlar. Hijriy 250 (milodiy 865) yilda Bag'dodda vafot etganlar."
        ]
    },
    {
        "word": "Umar al-Xushufagʻniy as-Sugʻdiy al-Bujayriy",
        "type": [],
        "definition": [
            "Abu Hafs Umar ibn Muhammad ibn Bujayr al-Xushufag'niy as-Sug'diy al-Bujayriy Samarqandning Ishtixon bilan Kushoniya oralig'ida joylashgan Xushufag'n qishlog'idan. Hozir bu qishloq 'Ra's ul-qantara' deb nomlanadi. Bu kishi – 'al-Jome' as-sahih' ('Ishonchli to'plam') kitobining muallifi. Otalari Muhammad ibn Bujayrdan, Muhammad ibn Abdula'lo as-San'oniydan, Muhammad ibn Bashshor al-Basriy va Muhammad ibn Musanno al-Basriydan hadis rivoyat qilganlar. O'zlaridan esa Abu Nasr al-Karminiy, Muhammad ibn Ahmad va Abu Hotam Muhammad ibn Hibbon al-Bustiy hadis rivoyat qilganlar. Hijriy 213 (milodiy 829) yilda tavallud topib, hijriy 311 (milodiy 924) yilda vafot etganlar."
        ]
    },
    {
        "word": "Umar as-Siboriy",
        "type": [],
        "definition": [
            "Abu Hafs Umar ibn Hafs as-Siboriy Buxoroning Sabiriy qishlog'idan bo'lib, Ali ibn Hajar, Yusuf ibn Iso, Muhammad ibn Hamid ar-Roziy, Salama ibn Shubaybdan hadis rivoyat qilganlar. O'zlaridan esa Muhammad ibn Sobir al-Buxoriy hadis rivoyat qilganlar. Abu Hafs Umar as-Sabiriy hijriy 294 (milodiy 908) yilda vafot etganlar."
        ]
    },
    {
        "word": "Umar ibn Xattob",
        "type": [],
        "definition": [
            "Umar ibn Xattob to'rt xalifaning ikkinchisi, haq bilan botilni ajratib, 'Foruq' laqabini olgan, jannatga kirishi bashorat qilingan o'n sahobaning biri. Ilk bor 'Amiral muminin' laqabini olgan xalifa. Islomga Rasululloh payg'ambar qilib yuborilishining oltinchi yili kirdilar. Oldin bu diynga qarshi bo'lib, bir-ikki bor Rasulullohni o'ldirishga ham qasd qildilar. Lekin Alloh bu kishini Islom diyniga hidoyat qilib qo'ydi. Bu zot Islomga kirishlaridan bir-ikki kun oldin Rasululloh:\r\n    'Allohim, Islomni Umar bilan quvvatlagin', deb duo qildilar. Alloh payg'ambarining duosini qabul qilib, hazrati Umarni Islomga hidoyat qilib qo'ydi. Bu hodisa tarix kitoblarida quyidagicha keltiriladi:\r\n    'Bir kuni Umar ibn Xattob qilichini yalan¬g'ochlab, Rasulullohni o'ldirmoqni qasd qilib ketayotganida, to'satdan Na'im ibn Abdulloh uchrab qoladi. Umarning holini ko'rib, 'Qayerga ketayapsan?' deb so'raydi. Umar ibn Xattob:\r\n    'Qurayshning olihalarini so'kkan, ilohni yagona deb, payg'ambarlikni da'vo qilayotgan Muhammadni o'ldirish uchun ketyapman', deb javob beradi. Na'im:\r\n    'Avval singling va kuyovingga qarasang-chi, ular Muhammadning diyniga kirishdi-ku!' deydi. Umar yo'lidan qaytib, singlisining uyi tomon yuradi. Umar singlisining uyiga kelganida Xabbob ibn Art roziyallohu anhu Fotima va uning eriga Qur'on o'qib berayotgan edi. Umar eshikni taqillatadi. Fotima eshikni ochadi. Umar uyga kirmay turib, avval singlisidan Islomga kirgani haqidagi xabar rost yoki yolg'onligini surishtiradi. Keyin u kuyovini do'pposlab ketadi. Buni ko'rgan singlisi u kishiga yopishadi. Umar singlisini turtib, uni ham qonga belaydi. Shunda singlisi yig'lab:\r\n    'Bizni urib, o'ldirib yubor, lekin bu diyndan qaytmaymiz', deb, qat'iy turib oladi. Shunda Umarning qalbi yumshab, qilgan ishidan afsuslanadi. Singlisidan Qur'on oyatlari bitilgan varaqni tortib olmoqchi bo'lganida, u:\r\n    'Sen nopoksan, g'usl qilmaguningcha buni ushlashing mumkin emas', deydi. Umar g'usl qilib kelib, varaqni qo'liga oladi. Unda Toha surasining quyi¬dagi oyatlari bor edi:\r\n    'Senga Qur'onni baxtsiz bo'lishing uchun nozil qilganimiz yo'q. Faqat (Robbisidan) qo'rquvchi kimsalarga eslatma qilib tushirdik. (Bu Qur'on) yer va buyuk osmonlarni yaratgan Zot tarafidan nozil qilingandir...' (2-4 - oyatlar).\r\n    Umarning qalbida bir narsa shu'lalandi. Bu shu'la Islom nurining uchquni edi. Bu uchqun kelajakda olovga aylanib, butun dunyoni zabt etishi kerak edi.\r\n    Shunda Xabbob berkinib yotgan joyidan chiqib, 'Ey Umar, xursand bo'l, men Rasululloh sollallohu alayhi vasallamning sen haqingda 'Allohim, Islomni Umar bilan quvvatlagin', deb duo qilayotganlarini eshitdim', dedi.\r\n    Umar Rasululloh sollallohu alayhi vasallam bilan ko'rishish niyati borligini aytadi. Xabbob u kishini Rasululloh sollallohu alayhi vasallamning huzurlariga boshlab boradi. Shu kundan boshlab, musulmonlarga bo'layotgan tazyiqu azob-uqubatlar sezilarli darajada kamayadi.\r\n    Tolha ibn Ubaydulloh aytadi:\r\n    'Umar Islomga kirganlaridan keyin mushriklarning zulmidan ancha xalos bo'ldik'.\r\n    Hijratga ruxsat berilganida musulmonlarning ko'pchiligi berkinib, kechasi hijrat qilishni tanlashdi. Lekin Umar kunduzi Ka'ba oldiga kelib, tavof qildilar, so'ngra hijrat qilishlarini e'lon qildilar. Va Qurayshga qarata: 'Kimning onasining bolasiz, xotining beva, bolalarining yetim qolishini xohlasa, menga shu tog'ning orqasida uchrasin', deb aytdilar. Lekin hech kim u kishiga qarshi chiqishga jur'at qila olmadi.\r\n    Umar ibn Xattob Badr, Uhud, Xandaq va bundan boshqa hamma jangu fathlarda ishtirok etdilar.\r\n    Umar ibn Xattob Abu Bakr Siddiqdan so'ng Islom ummatining ikkinchi xalifasi bo'ldilar. Bu vaqt ichida katta harakat qilib, Fors, Misr, Shom, Iroq va boshqa joylar fath etildi. Hazrati Umar davrlarida Islomning 12 ming minbari barpo etildi.\r\n    Abdulloh ibn Mas'ud aytadilar:\r\n    'Umar ibn Xattobning Islomga kirishlari g'alaba bo'lsa, hijrat qilishlari yordam, xalifa bo'lishlari esa rahmat edi'.\r\n    Hazrati Umar o'z xalifaliklari davrida ko'plab islohotlar, yangiliklar qildilar. Musulmonlarning Baytulmollarini ta'sis etdilar. Basra va Kufa shaharlarini qurdilar. Katta obodonchilik ishlarini olib bordilar, xalifalikni yuritish ishlarida katta yangiliklarni amalga oshirdilar. Bu zot xalifalikni nihoyatda adolat bilan yurgizdilar, Islom diynining ravnaqi yo'lida nihoyatda katta xizmat qildilar.\r\n    Hazrati Umar olim, tadbirli, dono, taqvoli, dunyoda zohid, achchiq bo'lsa-da, haq so'z so'zlovchi kishi edilar. U kishi hammasi bo'lib Rasululloh sollallohu alayhi vasallamdan 539ta hadis rivoyat qildilar. Bu zotdan bir nechta sahobalar rivoyat qilganlar. U zot rivoyat qilgan hadislardan uchta 'Sahih' sohiblari o'z kitoblariga kiritishgan.\r\n    Umar ibn Xattob Rasululloh sollallohu alayhi vasallam xabar berganlaridek, shahid bo'ldilar. U zot masjidda musulmonlarga imomlik qilib turganlarida, mushriklar yollagan qotil tomonidan hijratning yigirma uchinchi yili suiqasd tufayli qatl etildilar. Hazrati Umar Rasululloh sollallohu alayhi vasallamning ravzalariga, hazrati Abu Bakr Siddiq roziyallohu anhuning yonlariga dafn qilinganlar."
        ]
    },
    {
        "word": "Ummat ",
        "type": [],
        "definition": [
            "xalq, millat; dinga e'tiqod qiluvchilar jamoasi; Allohning bandalari; Muhammad alayhissalomga imon keltirgan musulmonlar."
        ]
    },
    {
        "word": "Ummu ",
        "type": [],
        "definition": [
            "onasi. Masalan: Ummu Habiba – Habibaning onasi"
        ]
    },
    {
        "word": "Ummu Atiyya",
        "type": [],
        "definition": [
            "Ummu Atiyya al-Ansoriyyaning ismlari Nusayba binti Ka'b. U kishi Islomga kirdilar va Rasululloh sollallohu alayhi vasallamga bay'at qildilar.\r\n    Ismlarining kichraytirilishi, ya'ni, nun harfining zammalashtirilishi (arab tilida ismlar kichik shaklga keltiriladi. Misol uchun, Nasiba – Nusayba kabi) Ummu Imoraning ismlaridan farqli bo'lishi uchun edi. Ikkalalari ham Nasiba, birlari kichik, birlari katta.\r\n    Ummu Atiyya roziyallohu anho Rasululloh sollallohu alayhi vasallamdan ko'p hadislar rivoyat qildilar. U kishi ayol kishi bo'lishlariga qaramay, Rasuli Akram sollallohu alayhi vasallam bilan yettita jangda qatnashganlar: yuklarni qo'riqlar, mo'min birodarlarga taom hozirlar, qorinlarini to'yg'izar, jarohatlarini davolar, askarlarga yordam berar, o'limdan saqlar edilar"
        ]
    },
    {
        "word": "Ummu valad",
        "type": [],
        "definition": [
            "Xojasidan bola ko'rgan cho'ri"
        ]
    },
    {
        "word": "Ummu Qays binti Mihson",
        "type": [],
        "definition": [
            "U kishi mashhur sahobiy Ukosha ibn Mihson roziyallohu anhuning singillari bo'ladilar. Ummu Qays kunyalari bo'lib, ismlari Omina. Qadimda Islomga kirgan, Rasululloh sollallohu alayhi vasallamga eng avval bay'at qilgan sahobiyalardan.\r\n    U kishi Makkadan Madinaga hijrat qilganlik sharafiga ham egalar. Ummu Qays binti Mihson roziyallohu anho uzoq umr ko'rganlar.\r\n    Imom Buxoriy va Imom Muslimlarning 'Sahih' kitoblarida u kishidan yigirma to'rtta hadis rivoyat qilingan."
        ]
    },
    {
        "word": "Ummu Salama",
        "type": [],
        "definition": [
            "Ummu Sulaym hazrati Anas ibn Molik roziyallohu anhuning onalari bo'ladi. U kishi Ummu Sulaym kunyalari ila mashhur bo'lganlar. Shuning uchun ham ismlarini aniqlashda ulamolarimiz bir oz tortishganlar. Ba'zilari Sahla desalar, boshqalari Rumayla, uchinchilari yana boshqa ismni aytganlar.\r\n    Ummu Sulaym binti Milhon Xazrajiya, Najjoriyadirlar. U kishi Abu Talha roziyallohu an¬huga turmushga chiqqanlar. Ummu Sulaym o'ta diyndor, ahli fazl ayollardan bo'lganlar. O'g'illari Anas roziyallohu anhuni kichiklik chog'larida Payg'ambarimiz sollallohu alayhi vasallamning xizmatlariga berganlar. Shu sababdan ham Payg'ambarimizning oilalariga tez-tez kelib turar va turli hodisalarga guvoh bo'lib, savollar so'rab turar edilar. Ummu Sulaym roziyallohu anhoning ism¬lari ko'pgina hadislarda zikr qilinadi"
        ]
    },
    {
        "word": "Ummu Honeʼ",
        "type": [],
        "definition": [
            "Ummu Hone' roziyallohu anho Payg'ambarimiz sollallohu alayhi vasallamning amakilari – Abu Tolibning qizlaridir. U kishi Hazrati Ali roziyallohu anhuning singillari bo'ladilar. Kunyalari bilan mash¬hur bo'lganlar, shuning uchun ham ismlarida ixtilof bor. Ba'zilar Otika desa, boshqalar Fotima deydilar, uchinchilari yana boshqa ismni aytadilar. U kishidan qirq oltita hadis rivoyat qilingan."
        ]
    },
    {
        "word": "Ummul kitob (kitobning onasi)",
        "type": [],
        "definition": [
            "Ummul Kitob (kitobning onasi) – Fotiha surasining nomlaridan biri"
        ]
    },
    {
        "word": "Umra ",
        "type": [],
        "definition": [
            "'Umra' so'zi ziyorat ma'nosini anglatadi. Islom shariatida esa, Baytullohning maxsus ziyoratiga 'umra' deyiladi. Hanafiy mazhab ulamolari umr davomida bir marta umra qilishni sunnati muakkada deyishgan."
        ]
    },
    {
        "word": "Umratan fiy hajjatin",
        "type": [],
        "definition": [
            "hajning ichida umra–qiron niyat qilishga ishora"
        ]
    },
    {
        "word": "Umro ",
        "type": [],
        "definition": [
            "'Umro' – 'umrbod' degani. Istilohda umro deb biror mulkni birovga bir umrga hiba qilishga aytiladi. Masalan, bir kishi birovga 'Mana bu hovlim men o'lguncha (yoki sen o'lguncha) senikidir', desa, hovli hiba berilgan kishiga, undan keyin esa uning merosxo'rlariga o'tadi. Hiba qiluvchining hibasi qabul qilinadi, ammo sharti bekor qilinadi. Shuning uchun mulk hiba qiluvchiga yoki uning merosxo'rlariga qaytmaydi. Umroning bir necha turlari bo'lib, ba'zilari joiz, ba'zilari joiz emas. Batafsil ma'lumot uchun sharhlarga va fiqh kitoblariga murojaat qilinadi."
        ]
    },
    {
        "word": "Urfut ",
        "type": [],
        "definition": [
            "Urfut – uncha baland bo'lmagan, tikanli, butasimon daraxt. Uning shirasi badbo'y bo'ladi. Asalari undan yeb qo'ysa, o'sha yoqimsiz hid asalga ham urib qoladi"
        ]
    },
    {
        "word": "Urfut-taʼrif bil mavlidish-sharif",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari"
        ]
    },
    {
        "word": "Usayd ibn Zuhayr",
        "type": [],
        "definition": [
            "Usayd ibn Zuhayr ansorlardan bo'lib, Avs qabilasidan edilar. Bu sahoba Rasululloh sollallohu alayhi vasallamdan ko'plab hadislar rivoyat qildilar. U kishi Abdulmalik ibn Marvonning xalifalik davrlarida vafot etdilar."
        ]
    },
    {
        "word": "Usmon al-Buxoriy al-Fazliy",
        "type": [],
        "definition": [
            "Abu Amr Usmon ibn Ibrohim al-Buxoriy al-Fazliy Buxoroning imomi, solih olim va chiroyli siyratli edilar. Hijriy 426 (milodiy 1036) yilning ramazon oyida tavallud topib, hijriy 508 (milodiy 1115) yilda Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Usmon al-Paykandiy",
        "type": [],
        "definition": [
            "Abu Amr Usmon ibn Ali al-Paykandiy solih imom va ishonchli muhaddislardan. Otalari paykandlik bo'lib, o'zlari hijriy 465 (milodiy 1073) yilning shavvol oyida Buxoroda tug'ilganlar. Saraxsda Muhammad ibn Ahmad as-Saraxsiydan fiqh ilmidan ta'lim olganlar. Qozi Abul Xattob at-Tabariy va Abu Muhammad Abdulvohid ibn Abdurahmon az-Zubayriydan hadis ilmidan saboq olganlar. Hijriy 552 (milodiy 1158) yilning shavvol oyida vafot etganlar"
        ]
    },
    {
        "word": "Usmon at-Taroziy",
        "type": [],
        "definition": [
            "Abu Amr Usmon ibn Muhammad at-Taroziy Balxning Roum masjidida imom-xatib edilar. Abul Maoliy Muhammad ibn Muhammad ibn Zayd al-Husayniy al-Bag'dodiyning 'Sharaf al-avqot' ('Vaqtlarning ulug'i') kitoblarini rivoyat qilganlar. Hijriy 520 (milodiy 1127) yildan keyin vafot etganlar."
        ]
    },
    {
        "word": "Usmon ibn Abul Oss",
        "type": [],
        "definition": [
            "Usmon ibn Abul Oss ibn Bishr ibn Abdulloh ibn Duhmon. Kunyalari Abu Abdulloh bo'lgan.\r\n    Bu ulug' sahoba Saqif qabilasidan elchi bo'lib kelib, Islomni qabul qildilar. Rasululloh sollallohu alayhi vasallam u kishini qavmlariga boshliq qildilar. Bu zot Islomda faqih bo'lishga, Qur'onni o'rganishga juda ham qiziqar edilar. Rasululloh sollallohu alayhi vasallam hayotlik davrlarida Toifga boshliq bo'ldilar. Nabiy sollallohu alayhi vasallam vafot etganlaridan keyin Toif ahli murtad bo'lishni ixtiyor etishganida bu zot ularni nasihat va hikmatlar aytib, qaytarib qolishga muyassar bo'ldilar.\r\n    Usmon ibn Abul Oss: 'Ey Toif ahli! Islomga kirishda shoshilmay, oxiri kirgan edingiz, endi Islomdan qaytishda shoshilib, birinchilardan bo'lib qaytasizlarmi?' deganlarida xalq u kishining so'zlariga quloq solib, Islom diynida qoldi.\r\n    Abu Bakr roziyallohu anhu bu holatni ko'rgach, Usmon ibn Abul Ossni yana Toifga boshliq qilib tayinladilar. Bu kishi Umar ibn Xattob roziyallohu anhu xalifalik davrlarining ikkinchi yiligacha Toifda boshliq bo'ldilar.\r\n    So'ngra Umar roziyallohu anhu u kishini Ummon va Bahrayn fathiga boshliq qildilar. U yerlarni fath etishda ishtirok etib, Shahrik podshohni o'ldirdilar. Bundan tashqari, Fors va Hind yerlarini fath etishda katta hissa qo'shdilar."
        ]
    },
    {
        "word": "Usmon ibn Hakim",
        "type": [],
        "definition": [
            "Usmon ibn Hakim ibn Dinor al-Avdiy, kunya-lari Abu Amr al-Kufiy.\r\n    Bu zot hammasi bo'lib, 2ta hadisni Hasan ibn Solih va Sharik ibn Abdullohlardan rivoyat qilganlar.\r\n     U kishi hijratning 219-yili vafot etdilar"
        ]
    },
    {
        "word": "Usmon ibn Haniyf",
        "type": [],
        "definition": [
            "Usmon ibn Haniyf Ansoriy al-Avsiy, kunyalari Abu Amr. Bu zot Uhud va undan keyingi janglarda ishtirok etganlar.\r\n    Xalifa Umar ibn Xattob bu zotni 'Savodul Iroq'qa boshliq qilib tayinlaganlar.\r\n    Ali roziyallohu anhuning xalifalik davrlarida Basrada amir bo'lganlar.\r\n    Keyinchalik bu ishdan bo'shab, Kufaga ko'chib kelib, o'sha yerda yashadilar.\r\n    Rasululloh sollallohu alayhi vasallamdan rivoyat qilgan hadislarini o'g'illari Abdurrahmon, jiyani Abu Umoma, shuningdek, Honiy ibn Muoviya va boshqalar rivoyat qilganlar."
        ]
    },
    {
        "word": "Usmon roziyallohu anhu",
        "type": [],
        "definition": [
            "Usmon ibn Affon ibn Abu Oss Umaviy al-Qurashiy, kunyalari Abu Abdulloh. Makkada tavallud topganlar. Islomni avvalgilardan bo'lib qabul qilganlar. Mo'minlarning amiri, xulafoi roshidinlarning uchinchisi, jannatga kirishlariga bashorat berilgan o'nta sahobaning biri bo'lganlar. Ikki hijrat sohibi. Rasululloh sollallohu alayhi vasallamning ikki qizlarini (avval Ruqiyya ismli qizlarini, Ruqiyya vafot etganlaridan so'ng yana bir qizlari – Ummu Kulsum ismli qizlarini) nikohlariga olganliklari uchun 'Zunnurayn' (ikki nur sohibi) laqabini olganlar. Rasululloh sollallohu alayhi vasallam vafot etayotganlarida olti sahobadan rozi ekanliklarini izhor qilganlar. Hazrati Usmon ana shu olti sahobaning biridirlar.\r\n    Johiliyat davrida Usmon roziyallohu anhu sharafli boylardan bo'lganlar. U kishi taqvodor, hayoli sahobalardan edilar. Rasululloh sollallohu alayhi vasallam bilan hamma g'azotlarda birga bo'ldilar. Faqat Badr g'azotida xotinlari Ruqiyya qattiq kasal bo'lganliklari sababli ishtirok eta olmadilar. O'shanda musulmonlar g'alabasi Ruqiyya roziyallohu anhoning vafotlari bilan bir kunga to'g'ri kelgan edi.\r\n    Usmon ibn Affon roziyallohu anhu ko'p ehson qiluvchi sahiy, boy kishilardan edilar. G'azotlarning birida askarlarning yarmini o'z tasarruflariga olgan va ming dinor pulni kambag'allarga Alloh yo'lida ehson qilgan, bundan tashqari, bir yahudiydan 'Ravma' nomli quduqni sotib olib, foydalanishlari uchun musulmonlarga berib yuborgan edilar.\r\n    Hijratning 23-sanasida musulmonlar Usmon ibn Affon roziyallohu anhuga bay'at berishdi. Bu zot xalifalik davrlarida ko'p ishlarni amalga oshirdilar. Shulardan biri – Afrika, Sijiston, Xuroson, Armaniston, Kavkaz, Karmon, Qibris mamlakatlari musulmonlar tarafidan fath etilganligidir. Yana Qur'oni Karim asl nusxali kitob holiga keltirildi. Mana shu davrda zobitlik yo'lga qo'yildi. Masjidi Harom va Rasululloh sollallohu alayhi vasallamning masjidlari kengaytirildi. Iyd namoziga xutba o'qish va jum'a namoziga avvalgi azonni aytish joriy qilindi.\r\n    Usmon ibn Affon roziyallohu anhu hammasi bo'lib, 146ta hadis rivoyat qildilar. Bu kishidan bir necha sahoba va tobe'inlar rivoyat qilganlar va u kishi rivoyat qilgan hadislardan uchta 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n    Usmon ibn Affon roziyallohu anhu hijratning 35-sanasida, Zulhijja oyining 12-kunida 80 yoshdan o'tganlarida vafot etdilar."
        ]
    },
    {
        "word": "Usoma as-Sardariy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Ubayda Usoma ibn Muhammad as-Sardariy al-Buxoriy Buxoroning Sardariy qishlog'idan bo'lib, Solih ibn Hamdon al-Buxoriy va Abdulloh ibn Muhammad al-Marvaziydan hadis rivoyat qilganlar. Abu Sa'd al-Idrisiy al-Hofiz aytadilar: 'Hijriy 357 (milodiy 969) yili Buxoroda u kishidan kitob yozib olganmiz'. Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Usoma ibn Zayd",
        "type": [],
        "definition": [
            "Usoma ibn Zayd ibn Horisa ibn Shurahbil al-Kalbiy, kunyalari Abu Muhammad. Onalari Ummu Ayman, ya'ni Rasululloh sollallohu alayhi vasallamning murabbiyalari.\r\n    Bu zot ulug' sahobalardan bo'lib, Makkada tavallud topdilar. Islomda o'sdilar. Chunki otasi Islomga avvalgi kirgan zotlardan edilar. Rasululloh Usomani xuddi nevaralari Hasan va Husaynlarni yaxshi ko'rgandek qattiq yaxshi ko'rar edilar. Usoma Rasululloh sollallohu alayhi vasallam bilan birga Madinaga hijrat qildilar.\r\n    Rasululloh sollallohu alayhi vasallam vafot etganlarida Usomaning yoshlari hali yigirmadan oshmagan edi. Rasululloh alayhissalom hayotlik paytlarida Usomani askarlar ustidan qo'mondon qilib tayinlagan edilar. Abu Bakr va Umar roziyallohu anhularning xalifalik davrlarida ham u zot mana shu amalda o'tirdilar.\r\n    Rasululloh sollallohu alayhi vasallam vafot etganlaridan so'ng Vodiy al-Quroga ko'chib, mana shu yerda istiqomat qildilar. So'ngra Damashqqa ko'chib o'tdilar. So'ng yana Madinaga ko'chib, vafotlariga qadar mana shu yerda yashadilar.\r\n    Hammasi bo'lib, 128ta hadis rivoyat qildilar. Bu hadislarni otalari, onalari va Ummu Salama onalarimizdan rivoyat qildilar.\r\n    Usoma ibn Zayd roziyallohu anhu hijratning 54-yili Muoviyaning xalifalik davrida vafot etdilar."
        ]
    },
    {
        "word": "Usul ",
        "type": [],
        "definition": [
            "Hanafiy mazhabidagi birinchi darajadagi kitoblar"
        ]
    },
    {
        "word": "Usul ilmi",
        "type": [],
        "definition": [
            "shariat hukmlarini uning asl manbalari – Qur'on, hadis va ijmo'dan olish ilmi."
        ]
    },
    {
        "word": "Usulud din",
        "type": [],
        "definition": [
            "Abdulqodir al-Bag'dodiy al-Ash'ariyning aqoid ilmiga oid kitoblari"
        ]
    },
    {
        "word": "Usulul qiroat",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining qiroat va tajvid ilmi bo'yicha kitoblari."
        ]
    },
    {
        "word": "Usulul-fiqh",
        "type": [],
        "definition": [
            "Fuqaholarimiz Qur'oni Karim va Sunnati mutohhara, ijmo' va qiyos kabi masdarlardan foydalanib, shar'iy hukmlar chiqarish uchun 'Usulul-fiqh' nomli qonun-qoidalar majmui ilmini ijod qilganlar. Bu nihoyatda ulkan ilm bo'lib, undagi nozik qonun-qoidalar yordamida Qur'oni Karim oyatlari va Payg'ambarimiz sollallohu alayhi vasallamning hadislari, ularning nozil bo'lish yoki aytilish sabablari diqqat bilan, sinchiklab tekshiriladi. Ularda kelgan hukmlar umumiymi yoki ma'lum bir shaxs, makon yoki zamonga xosmi – shular erinmay o'rganiladi. Shuningdek, qaysi biri nosux – boshqasini amaldan qoldirganligi va qaysi biri mansux – amaldan qolganligi o'rganiladi. Bunga o'xshash nozik masalalar juda ham ko'p va ularni asosan, mutaxassislar tadqiq qiladilar va yaxshi tushunadilar."
        ]
    },
    {
        "word": "Utorid ibn Hojib",
        "type": [],
        "definition": [
            "Utorid ibn Hojib – o'sha davrdagi mashhur ipakchi"
        ]
    },
    {
        "word": "Utruj, utrujja ",
        "type": [],
        "definition": [
            "Utruj, Utrujja – rutasimonlar oilasiga mansub butasimon daraxt va uning mevasi (sitron, greypfrut). Mevasi limonga o'xshash, yoqimli ta'mli va o'ta xushbo'y hidli bo'ladi. Uni 'shirin limon' ham deyishadi."
        ]
    },
    {
        "word": "Utrunj ",
        "type": [],
        "definition": [
            "Utrunj (utrujja ham deyiladi) – butasimon daraxt va uning mevasi (sitron, greypfrut). Mevasi limonga o'xshash, yoqimli ta'mli va juda xushbo'y bo'ladi. Uni 'shirin limon' ham deyishadi. Mazkur gazlama qalin bo'lgani uchun utrunjga o'xshatilgan"
        ]
    },
    {
        "word": "Uhayd al-Borkatiy",
        "type": [],
        "definition": [
            "Abu Sa'id Uhayd ibn Hakam al-Borkatiy Samarqandning Varasnin mahallasida yashaganlar. Muso ibn Horun al-Faraviy, Abul Qosim Hammod ibn Ahmad as-Sulamiy, Abdulloh ibn Sahl al-Varasniniy va Ibrohim ibn Nasr al-Kabuzanjakasiydan ta'lim olganlar. O'zlaridan esa Abu Nasr Ahmad ibn Muhammad al-Muzohamiy va Hasan ibn Muhammad al-Forisiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Uchmoh ",
        "type": [],
        "definition": [
            "Jannat"
        ]
    },
    {
        "word": "Ushayra ",
        "type": [],
        "definition": [
            "Ushayra – Yanbu'dagi joy. Yanbu' qadimiy shaharlardan bo'lib, Qizil dengiz sohiliga yaqin. U hozir Madina mintaqasiga qaraydi"
        ]
    },
    {
        "word": "Ushmiyun",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan. Bir rivoyatda shahardagi mahallalardan birining nomi deb berilgan"
        ]
    },
    {
        "word": "Ushr ",
        "type": [],
        "definition": [
            "o'ndan bir; chiqqan hosilning o'ndan biridan beriladigan ehson."
        ]
    },
    {
        "word": "Uyayna ibn Abdurrahmon",
        "type": [],
        "definition": [
            "Uyayna ibn Abdurrahmon ibn Juvshan G'atafoniy al-Basrqiy, kunyalari Abu Molik.\r\n    Hadislarni otalaridan va Ibn Abu Rubuy'a ibn Juvshan, Ibn Umarning qullari Nofe', Ayyub ibn Muso, Ali ibn Zayd ibn Jud'onlardan rivoyat qildilar.\r\n     Bu kishidan Ibn Muborak, Iso ibn Yunus, Xolid ibn Horis, Abu Ubayda, Abu Osim, Abu Abdurrahmon Munqariylar rivoyat qildilar."
        ]
    }
]