[
    {
        "word": "Vadiy",
        "type": [],
        "definition": [
            "Siygandan keyin ahyonda chiqadigan quyuq oq suyuqlik."
        ]
    },
    {
        "word": "Vadiyʼa",
        "type": [],
        "definition": [
            "'Vadiy'a' so'zi lug'atda 'tark qilish', 'qoldirish' ma'nosini bildiradi. Shar'iy istilohda esa: U, saqlash uchun qoldirilgan omonatdir. Vadiy'a shariat hukmida mandub ish."
        ]
    },
    {
        "word": "Vazir ",
        "type": [],
        "definition": [
            "davlat ma'muriy boshqaruvi rahbari; shohning yordamchisi."
        ]
    },
    {
        "word": "Vazmin",
        "type": [],
        "definition": [
            "og'ir; bosiq."
        ]
    },
    {
        "word": "Vazn ",
        "type": [],
        "definition": [
            "Vazn' deb tillo va kumushni tarozida tortishga aytiladi"
        ]
    },
    {
        "word": "Vakolat",
        "type": [],
        "definition": [
            "'Vakolat' so'zi 'muhofaza qilish' ma'nosini bildiradi. 'Vakolat' 'vakil', 'namoyanda qilmoq' ma'nolarini anglatadi. Shar'iy istilohda esa: Vakolat tasarruf qilishni boshqaga topshirishdir. Ya'ni, bir kishining boshqa bir kishini mutlaq yoki shartli ravishda o'zining o'rniga tayinlashidan iboratdir. Vakolat Qur'on, Sunnat va Ijmo' bo'yicha joizdir."
        ]
    },
    {
        "word": "Vaqf",
        "type": [],
        "definition": [
            "'Vaqf' so'zi lug'atda 'tutib turish' ma'nosini anglatadi. Shariatda esa, bir molning aslini ushlab turib foydasini Allohga qurbat hosil qilish uchun sarflashga aytiladi. Vaqf qilish orqali bir narsadan keladigan foydani vaqfdan foydalanuvchilar uchun abadiylashtiriladi. Mazkur narsaning o'zi ushlab turiladi, undan keladigan foyda esa bardavom bo'lib turadi."
        ]
    },
    {
        "word": "Valadi zino",
        "type": [],
        "definition": [
            "Zinodan tug'ilgan bola"
        ]
    },
    {
        "word": "Valiy",
        "type": [],
        "definition": [
            "1. Do'st (Allohning do'sti ma'nosida ham keladi). Xudoga yaqin odam. Allohni yaxshi bilgan, uning buyurganlarini bajarib, guno ishlardan o'zini saqlagan kishi.\r\n    2. Egasi; kishining yaqin qarindoshlari."
        ]
    },
    {
        "word": "Valiyma ",
        "type": [],
        "definition": [
            "Valiyma – nikoh munosabati bilan uyushtirilgan ziyofat, to'y."
        ]
    },
    {
        "word": "Vallohu aʼlam",
        "type": [],
        "definition": [
            "Alloh biluvchi"
        ]
    },
    {
        "word": "Valo ",
        "type": [],
        "definition": [
            "Valo – ozod qilish yoki muvolot tufayli hosil bo'ladigan hukmiy qarindoshlikdir. Valo natijasida merosxo'rlik, xun to'lash, nikoh valiyligi kabi huquq va burchlar yuzaga keladi. Hanafiy mazhabiga ko'ra valo ikki xil bo'ladi: a) ozod qilish valosi, ya'ni birovni qullikdan ozod qilish; b) muvolot valosi, ya'ni bir shaxsning ikkinchi shaxs bilan 'Agar sen jinoyat qilsang, tovon mening zimmamda. O'lsang, merosing meniki bo'ladi', deb shartlashishi."
        ]
    },
    {
        "word": "Varaq ",
        "type": [],
        "definition": [
            "Arabchada kumush tanga pulni 'varaq', 'riqqa', deb ataladi."
        ]
    },
    {
        "word": "Varas ",
        "type": [],
        "definition": [
            "'Varas' ham Yamanda o'sadigan sarg'ish qizil o'simlik bo'lib xushbo'y narsa sifatida ishlatilgan. Haj va umra qiluvchi shaxs ehrom kiyimiga bu narsani surtishi mumkin emas."
        ]
    },
    {
        "word": "Vars",
        "type": [],
        "definition": [
            "Vars – Yamanda o'sadigan sariq o'simlik, undan kiyim va yuz bo'yog'i olinadi."
        ]
    },
    {
        "word": "Vasaq",
        "type": [],
        "definition": [
            "130.6 kg og'irlik. Besh vasaq esa 653 kg bo'ladi. Demak, ziroat mahsuloti 653 kilogrammga teng bo'lganda nisobga yetgan bo'ladi."
        ]
    },
    {
        "word": "Vasan",
        "type": [],
        "definition": [
            "Insonga o'xshamagan but"
        ]
    },
    {
        "word": "Vasatiya - hayot yoʻli",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining 'Vasatiya – hayot yo'li' deb nomlangan kitoblari.\r\n    Shayh Muhammad Sodiq Muhammad Yusuf hazratlari 2005 yilning may oyida Kuvayt davlatida bo'lib o'tgan ''Vasatiya (mo'tadillik) - hayot yo'li'' mavzusidagi umumjahon Islom ilmiy anjumanida ishtirok etdilar. Anjumanga ushbu mavzuni tanlashdan maqsad yoshlarning noto'g'ri yo'llarga kirib ketayotganligi, dinda haddan oshishi, diniy mutaassiblikka berilishi kabi dolzarb muammolarni muhokama qilish edi. Shayx hazratlarining shu nomli kitoblarida mazkur anjumanda ko'tarilgan masalalar umumlashtirilib, undagi mavzular batafsil yoritib berilgan."
        ]
    },
    {
        "word": "Vasiyla",
        "type": [],
        "definition": [
            "Jannatdagi oliy maqom manzila"
        ]
    },
    {
        "word": "Vasila",
        "type": [],
        "definition": [
            "Vasila – jannatdagi yagona maqom bo'lib, unga insoniyatdan faqat bir kishi erishadi. O'sha maqomni Rasululloh sollallohu alayhi vasallam uchun so'rash ummatlarning burchidir. Zero, vasila bashariyat sayyidiga berilmasa, kimga ham berilardi."
        ]
    },
    {
        "word": "Vasiyat ",
        "type": [],
        "definition": [
            "'Vasiyat' so'zi bir gapni aytgan kishidan keyin uning talabini ado etishdir. Vasiyat mandub sunnat va shariatda bor qurbatdir. Unga Qur'on, Sunnat va ijmo'dan dalil bordir."
        ]
    },
    {
        "word": "Vatani asliy",
        "type": [],
        "definition": [
            "'Vatani asliy' –'asliy vatan' deganda tug'ilib o'sgan va umrining oxirigacha yashashni niyat qilgan yoki o'ziga vatan tutib, umrining oxirigacha o'sha yerda yashashni niyat qilgan yurt anglanadi. Bunda mazkur yerda oila qurishi shart emas."
        ]
    },
    {
        "word": "Vafd ",
        "type": [],
        "definition": [
            "Vafd – hurmatli tarafning huzuriga kelgan mehmonlar, delegatsiya."
        ]
    },
    {
        "word": "Vahara ",
        "type": [],
        "definition": [
            "Vahara – sahroda yuradigan kalta, malla qizg'ish qurt."
        ]
    },
    {
        "word": "Vahiy",
        "type": [],
        "definition": [
            "Alloh bilan insonlarning payg'ambarlar orqali muloqot yo'li. Vahiyni payg'ambarlarga Jabroil alayhissalom olib tushgan. Shivirlab, pichirlab gapirmoq."
        ]
    },
    {
        "word": "Vashm ",
        "type": [],
        "definition": [
            "Vashm – tanaga igna yoki boshqa vosita bilan rasm yoki so'zni o'yib, naqsh solish, tatuirovka."
        ]
    },
    {
        "word": "Vaʼz",
        "type": [],
        "definition": [
            "xitobat, ma'ruza, mav'iza, nutq; yaxshilik va ezgulikka chaqiruvchi da'vat."
        ]
    },
    {
        "word": "Viqor ",
        "type": [],
        "definition": [
            "salobat, kelishganlik ulug'vorlik."
        ]
    },
    {
        "word": "Vird",
        "type": [],
        "definition": [
            "tark qilmay doim bajarib turiladigan vazifa, duo, zikr, tasbeh, salavot, tilovat."
        ]
    },
    {
        "word": "Vitr",
        "type": [],
        "definition": [
            "Vitr Xufton namozidan so'ng o'qiladigan uch rakatlik namoz. 'Vitr' so'zi bizning tilimizda 'toq' ma'nosini bildiradi. Bizning Xanafiy mazhabimizda Vitr namozi vojibdir."
        ]
    },
    {
        "word": "Vobisa roziyallohu anhu",
        "type": [],
        "definition": [
            "Vobisa ibn Ma'dning kunyalari Abu Solimdir. Kufada istiqomat qilganlar. So'ngra 'Raqqa' degan joyga ko'chib o'tganlar va ana shu yerda vafot etganlar. Bu zotdan ikki o'g'illari Amr va Solim, Ziyod ibn Abu Ja'dlar rivoyat qilganlar."
        ]
    },
    {
        "word": "Vodiy al-Quro",
        "type": [],
        "definition": [
            "Vodiy al-Quro Madinai munavvara bilan Shom orasidagi bir vodiy bo'lib, u yerda Madina ahlining molu mulklari bo'lar edi."
        ]
    },
    {
        "word": "Vodil-quro",
        "type": [],
        "definition": [
            "Vodil-quro – Madina bilan Shom o'rtasidagi ma'lum joy."
        ]
    },
    {
        "word": "Vojib",
        "type": [],
        "definition": [
            "Shariat jazm ila, ammo qat'iy bo'lmagan dalil bilan talab qilgan amal vojibdir"
        ]
    },
    {
        "word": "Voiz",
        "type": [],
        "definition": [
            "targ'ib qiluvchi, notiq, suxandon, va'zxon, xatib, pand-nasihat qiluvchi."
        ]
    },
    {
        "word": "Voil ibn Hujr ",
        "type": [],
        "definition": [
            "Voil ibn Hujr ibn Robi'a al-Hazramiy, kunya¬lari Abu Hunayd.\r\n    Bu sahoba Hazramavt qabilasidan bo'lib, otalari shu qabilaning boshlig'i edilar.\r\n    Otalari Voil ibn Hujrni Rasululloh sollallohu alayhi vasallamga elchi qilib yuborishlaridan oldin Rasululloh sollallohu alayhi vasallam u kishining kelishlarini bashorat berib:\r\n    'Voil ibn Hujr uzoq bo'lgan Hazramavtdan, Alloh va Rasuliga rag'bat bilan, itoat qilgan holda keladi', deb aytdilar.\r\n    U kelganida yonlariga o'tirg'izib:\r\n    'Ey Parvardigoro, Voil va uning zurriyotini barakali qilgin', deb duo qildilar.\r\n    So'ngra Rasululloh sollallohu alayhi vasallam bu kishini qabilalariga imom qilib tayinladilar.\r\n    Keyinchalik Voil ibn Hujr Kufada istiqomat qildilar. Ali roziyallohu anhu bilan Siffiyn urushida ishtirok etdilar."
        ]
    },
    {
        "word": "Voqeʼot",
        "type": [],
        "definition": [
            "Notifiyning kitobi. Shu nomda as-Sodr ash-Shahid ham kitob yozgan."
        ]
    },
    {
        "word": "Voqiʼa surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 96 oyatdan iborat.\r\n    'Voqi'a' qiyomatning nomlaridan biri bo'lib, bu so'z ushbu suraning birinchi oyatida tilga olingan va unga ism bo'lib qolgan. Surai karima asosan qiyomat manzaralari, jannat va do'zax hamda ularning ahllari haqida so'z yuritadi.\r\n    Surada qiyomat manzaralari haqida batafsil bayonotlar ham keladi. O'sha kunda odamlar uch toifaga bo'linadilar: o'ng taraf egalari, cHar taraf egalari va peshqadamlar.\r\n    Surada har bir toifaning oqibati haqida so'z yuritilib, ularga Alloh taolo tomonidan tayyorlab qo'yilgan jazo va mukofotlar haqida xabar beriladi.\r\n    Voqi'a surasida Allohning borligi, yagonaligi va qudratining barkamolligi; Uning insonni yaratishdagi, nabototni o'stirishdagi, yomg'ir yog'dirishdagi va boshqa ishlardagi ajoyib tadbirlari haqida so'z ketadi.\r\n    Umuman, surada Ar-Rohman surasining mavzusi va uslubi davom etadi, desak, xato qilmagan bo'lamiz.\r\n    Sura qiyomatdagi dahshatli voqealar – tog'larning uchishi, yerning qattiq larzaga kelishi, umuman, yerdagi vaziyat ostin-ustun bo'lib ketishi, yaxshilar obro' topib, yomonlar yer bilan yakson bo'lishlari haqidagi tasvirlar bilan boshlanadi."
        ]
    },
    {
        "word": "Voliy ",
        "type": [],
        "definition": [
            "hokim, amir."
        ]
    },
    {
        "word": "Vosil as-Sufiy al-Xunbuniy",
        "type": [],
        "definition": [
            "Abul Qosim Vosil ibn Hamza as-Sufiy al-Xunbuniy - Buxoroning Xunbun nomli qishlog'idan. Hadis ilmi talabida ko'p safarda bo'lganlar. Nihoyatda solih, ishonchli muhaddis edilar, hadislarni yaxshi bilib, yaxshi tushunardilar. Buxoroda Abu Sahl Abdulkarim al-Kalobodiydan, Nasafda Abul Abbos Ja'far al-Mustag'firiydan ta'lim olganlar. Ahmad al-Xatib al-Bag'dodiy 'Tarixi Bag'dod' kitobida yozadilar: 'Vosil ibn Hamza as-Sufiy Buxorodandir, yodlagan hadislari nihoyatda ko'p va xo'bdir'. Hijriy 467 (milodiy 1075) yilda qishloqlarida vafot etganlar."
        ]
    },
    {
        "word": "Vosila ibn al-Asqaʼ",
        "type": [],
        "definition": [
            "Vosila ibn al-Asqa' ibn Abduluzzo al-Laysiy al-Kinoniy suffa ahlidan edilar. Tabuk g'azotidan oldin Islomga kirdilar va bu g'azotda ishtirok etdilar.\r\n    Uch yil Rasululloh sollallohu alayhi vasallamning xizmatlarida bo'ldilar. So'ng Basraga ko'chib o'tdilar. Bu yerda hovlilari bor edi. Damashq fathida ishtirok etdilar. Hayotlarining oxirida ko'zlari ko'r bo'lib qoldi. Hammasi bo'lib, 76ta hadis rivoyat qildilar.\r\n    Hijratning 83-yili 105 yoshda vafot etdilar. Bu zot Damashqda eng oxirgi vafot etgan sahobalardan edilar."
        ]
    },
    {
        "word": "Vudd ",
        "type": [],
        "definition": [
            "Vudd – mashhurrog'i Vadd. Suvo', Yag'us, Ya'uq va Nasr – Nuh alayhissalomning qavmi ibodat qilgan butlarning ismlari. Barchasi Nuh surasida zikr qilingan. Ibn Abbos roziyallohu anhumo mazkur butlarning qaysi qabilalarga tegishli bo'lgani, qaysi qabilalar ularni o'zlariga iloh tutib olgani haqida aytmoqda."
        ]
    },
    {
        "word": "Vujuh",
        "type": [],
        "definition": [
            "'Vujuh' so'zining ma'nosi 'yuzlar' deganidir."
        ]
    },
    {
        "word": "Vujuh shirkati",
        "type": [],
        "definition": [
            "Vujuh shirkati: unda ikki kishi molsiz vajh-(yuzlari)ni o'rtaga qo'yib sheriklikka narsa xarid qiladilar va uni sotadilar. Va shu tarzda foyda ko'radilar. Ular yuzlarini shuvut qilib ish ko'rganlari uchun ham shirkatlarini 'vujuh shirkati' deb nomlangan"
        ]
    },
    {
        "word": "Vuzuʼ",
        "type": [],
        "definition": [
            "'Vuzu'' so'zi lug'atda 'go'zallik' va 'yaltirash' ma'nosini bildiradi. Shariatda esa, Allohga qurbat hosil qilish niyati ila ba'zi a'zolarni yuvishga vuzu'–toharat deb aytiladi."
        ]
    }
]