[
    {
        "word": "Xavf namozi",
        "type": [],
        "definition": [
            "'Xavf namozi' deganda musulmonlarning dushman hujumidan xavfda turganlaridagi, dushman bilan urush holati bo'lib, askar tortilib turgandagi namoz tushuniladi."
        ]
    },
    {
        "word": "Xaz",
        "type": [],
        "definition": [
            "Xaz – yung aralash to'qilgan ipak mato, nimshoyi"
        ]
    },
    {
        "word": "Xazira",
        "type": [],
        "definition": [
            "Xazira – taom turi. Go'shtni mayda to'g'rab, suvda qaynatiladi. Go'sht chala pishganidan so'ng uni un bilan aralashtirib, qovurib pishiriladi."
        ]
    },
    {
        "word": "Xaybar",
        "type": [],
        "definition": [
            "Madina atrofidagi joy nomi"
        ]
    },
    {
        "word": "Xayyot",
        "type": [],
        "definition": [
            "arabcha so'z bo'lib, kiyim (libos) tikuvchi degan ma'noni anglatadi."
        ]
    },
    {
        "word": "Xayr",
        "type": [],
        "definition": [
            "yaxshilik, ezgulik"
        ]
    },
    {
        "word": "Xayriy vaqf",
        "type": [],
        "definition": [
            "Unda vaqf qiluvchi ko'pchilik foydalanishini shart qilib qo'yadi."
        ]
    },
    {
        "word": "Xalaf al-Xayyom al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Solih Xalaf ibn Muhammad al-Xayyom al-Buxoriy Buxoro ahlidan bo'lib, shu nisbat bilan mashhur edilar. Yoddan ko'p hadis bilishlariga qaramay, hadis ilmi talabida safar etardilar. U kishidan Abu Abdulloh al-G'unjor al-Hofiz, Abu Sa'd al-Idrisiy al-Astrobodiy hadis rivoyat qilganlar. Hijriy 361 (milodiy 973) yilning jumodul avval oyida 86 yoshda Buxoroda olamdan o'tganlar."
        ]
    },
    {
        "word": "Xalaf ash-Sharafdaniy",
        "type": [],
        "definition": [
            "Abu Solih Xalaf ibn Solih ash-Sharafdaniy solih shayx va zohid edilar. Sahl ibn Mutavakkil va Xalaf ibn Iyozdan hadis rivoyat qilganlar. Hijriy 346 (milodiy 958) yilda vafot etganlar"
        ]
    },
    {
        "word": "Xalil",
        "type": [],
        "definition": [
            "'Xalil' so'zi aslida qalban birlashib ketgan, dildan bog'langan chin do'stni anglatadi. Uning mazmunini Rasululloh sollallohu alayhi vasallamning 'Agar Allohdan boshqani xalil tutish mumkin bo'lganida, Abu Bakrni xalil tutar edim', degan so'zlaridan ham anglab olish mumkin."
        ]
    },
    {
        "word": "Xalifa",
        "type": [],
        "definition": [
            "o'rinbosar; noib; tarixda musulmonlar jamoasi va musulmonlar davlatining diniy, ayni bir paytda dunyoviy rahbari."
        ]
    },
    {
        "word": "Xaluq sufra",
        "type": [],
        "definition": [
            "Xaluq sufra – sariq rangli xushbo'ylik turi"
        ]
    },
    {
        "word": "Xamiyla",
        "type": [],
        "definition": [
            "Xamiyla – jundan to'qilgan adyolga o'xshash yungli, atroflarida popuklari bor qalin mato. Undan ustki kiyim, to'shak va palos sifatida foydalanilgan."
        ]
    },
    {
        "word": "Xamiysa",
        "type": [],
        "definition": [
            "Xamiysa – ipak yoki jundan to'qiladigan, qalin to'rtburchak en kiyim. Undan ustki kiyim sifatida foydalanilgan va u yotoqda yopinchiq vazifasini ham bajargan."
        ]
    },
    {
        "word": "Xamr",
        "type": [],
        "definition": [
            "Arab tilida 'xamr' so'zi 'to'sish', 'berkitish' ma'nolarini anglatadi. Tanovul qilgan kishining aqliga ta'sir etadigan, uning aqlini to'sadigan, berkitadigan, boshqacha aytganda, mast qiladigan har bir narsaga 'xamr' deyiladi."
        ]
    },
    {
        "word": "Xarqo",
        "type": [],
        "definition": [
            "Qulog'i belgi uchun yirtilgan hayvon."
        ]
    },
    {
        "word": "Xaroj",
        "type": [],
        "definition": [
            "Bir narsani sotib olgan shaxs, uning aybi tufayli aynib qolib, egasiga qaytarib berguncha muddatda keltirgan foydadir."
        ]
    },
    {
        "word": "Xars",
        "type": [],
        "definition": [
            "Xars – kichik halqali sirg'a"
        ]
    },
    {
        "word": "Xatib",
        "type": [],
        "definition": [
            "Xutba qiluvchi imom."
        ]
    },
    {
        "word": "Xatm",
        "type": [],
        "definition": [
            "Qur'onni boshdan oxirigacha batamom o'qish"
        ]
    },
    {
        "word": "Xattiy",
        "type": [],
        "definition": [
            "Xattiy – Bahrayn sohilidagi Xat deb atalgan joydan keltirilgan nayza"
        ]
    },
    {
        "word": "Xattot",
        "type": [],
        "definition": [
            "husnixat sohibi, chiroyli yozuvchi."
        ]
    },
    {
        "word": "Xatfar",
        "type": [],
        "definition": [
            "hozirgi Xayrobod arig'i."
        ]
    },
    {
        "word": "Xafyo",
        "type": [],
        "definition": [
            "Madina yaqinidagi joy nomi. Hadislarda Hafyo bilan Saniyyatul-vado'ning orasi besh yoki olti mil deyilgan."
        ]
    },
    {
        "word": "Xiyor",
        "type": [],
        "definition": [
            "bir kishi biror narsani sotib olsa, o'zaro kelishuvga binoan, ma'lum muddatda savdodan aynib, sotib olgan narsani egasiga qaytarib berish ixtiyori"
        ]
    },
    {
        "word": "Xizr",
        "type": [],
        "definition": [
            "'Xizr' so'zi aslida 'yam-yashil', 'ko'm-ko'k', 'sabza urgan' degan ma'nolarni bildiradi"
        ]
    },
    {
        "word": "Xilvati sahiha",
        "type": [],
        "definition": [
            "'Xilvati sahiha'–'sahih xilvat' deganda aqdi nikohdan keyin eru xotin bir joyda xoliy qolib, ularni jinsiy aloqadan to'suvchi hissiy, shar'iy va tabiiy moneliklar bo'lmasligi ko'zda tutiladi."
        ]
    },
    {
        "word": "Xilof",
        "type": [],
        "definition": [
            "teskari, zid, qarama-qarshi."
        ]
    },
    {
        "word": "Xirqa",
        "type": [],
        "definition": [
            "darveshlar kiyadigan libos"
        ]
    },
    {
        "word": "Xitmiy",
        "type": [],
        "definition": [
            "xushbo'ylik turi"
        ]
    },
    {
        "word": "Xitomiy",
        "type": [],
        "definition": [
            "'Xitomiy' nabotot bo'lib, u bosh va soqol yuvishda ishlatilgan. U bilan soch yoki soqol yuvilsa, ulardagi jonzotlarni o'ldirgan."
        ]
    },
    {
        "word": "Xolid al-Azdiy at-Termiziy",
        "type": [],
        "definition": [
            "Xolid ibn Ziyod ibn Jarv al-Azdiy at-Termiziy Termizning peshqadam olimlaridan. Termizda qozi edilar. Bu kishidan Qutayba ibn Sa'id va Habash ibn Harb al-Paykandiy dars olganlar. 100 yoshga kirib vafot etganlar. O'g'illari Abdulaziz ibn Xolid Marvda qozi edilar."
        ]
    },
    {
        "word": "Xolid as-Samarqandiy at-Taxsijiy al-Abgʻariy",
        "type": [],
        "definition": [
            "Abu Yazid Xolid ibn Kazda as-Samarqandiy at-Taxsijiy al-Abg'ariy Bu kishi olim va hofiz al-hadis edilar. Abdulkarim ibn Habib al-Bag'dodiy va Ishoq ibn Ya'qub as-Samarqandiydan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Xoliy",
        "type": [],
        "definition": [
            "'Xoliy' joy deganda, hamma tomoni yaxshi to'silgan, er va xotinning iznisiz oldilariga birov kira olmaydigan makon ko'zda tutiladi."
        ]
    },
    {
        "word": "Xonaqoh",
        "type": [],
        "definition": [
            "darveshlar, qalandarlar, g'ariblar istiqomat qilgan uy; qalandarxona, darveshxona"
        ]
    },
    {
        "word": "Xos ishchi",
        "type": [],
        "definition": [
            "'Xos ishchi' oylikka mehnat qiladigan shaxs bo'ladi. Oy davomida ish beruvchi unga ish topib bera olmasa ham oyligini berishi kerak."
        ]
    },
    {
        "word": "Xohar",
        "type": [],
        "definition": [
            "fors tilida singil degani."
        ]
    },
    {
        "word": "Xubs",
        "type": [],
        "definition": [
            "'Xubs' so'zi ham kamdan-kam ishlatiladigan so'z. U aslida ifloslik ma'nosini bildiradi. Bu yerda shu ma'noga qo'shimcha, uning qul bo'lishida ifloslik aralashmagan, ya'ni hur odam qul qilib olinmagan yoki shunga o'xshash boshqa qallobliklar yo'q, degan ma'noni ham anglatar ekan."
        ]
    },
    {
        "word": "Xudojoʻy",
        "type": [],
        "definition": [
            "taqvodor, diyonatli"
        ]
    },
    {
        "word": "Xuz",
        "type": [],
        "definition": [
            "Xuz – Ahvoz shaharlaridan biri"
        ]
    },
    {
        "word": "Xuzayma ibn Sobit",
        "type": [],
        "definition": [
            "Xuzayma ibn Sobit ibn Faqiha ibn Sa'laba al-Ansoriy, kunyalari Abu Ammora. Johiliyatda ham, Islomda ham Avs qabilasi boshliqlaridan bo'lganlar. Onalari – Kabsha binti Avs.\r\n    U kishi bir o'zlarining guvohliklari ikki kishining guvohligi bilan barobar bo'lgan sahoba edilar.\r\n    Badr g'azotida va undan boshqa hamma g'azotlarda ishtirok etdilar. Makka fath etilgan kuni Xutoma qabilasi nomidan bayroq ko'tardilar. Xutoma qabilasidagi butlarni sindirgan zot shu kishi edilar.\r\n    Siffiyn urushida Ali roziyallohu anhu bilan ishtirok etdilar. Avvaliga bu urushda ishtirok etmagan edilar. Qachonki Ammor ibn Yosir roziyallohu anhu o'ldirilganidan keyin urushga kirishdilar. Chunki Rasululloh sollallohu alayhi vasallam:\r\n    'Ammor ibn Yosir isyonkorlar tomonidan o'ldiriladi', deb marhamat qilgan edilar.\r\n    Bu zot hammasi bo'lib Rasululloh sollallohu alayhi vasallamdan 38ta hadis rivoyat qildilar. Bu kishidan o'g'illari Ammor, Zuhayr va boshqalar rivoyat qilganlar.\r\n    Bu zot to'plagan hadislardan ba'zilarini uch 'Sahih' sohiblari o'z kitoblariga kiritishgan"
        ]
    },
    {
        "word": "Xulayd al-Asariy al-Hajariy",
        "type": [],
        "definition": [
            "Abul Hison Xulayd ibn Hison al-Asariy al-Hajariy Buxoroda yashaganlar. Hasan al-Basriydan hadis rivoyat qilganlar. O'zlaridan esa Xozim ibn Xuzayma hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Xulafoi roshidin",
        "type": [],
        "definition": [
            "ahoryorlar, to'rt buyuk xalifa – Abu Bakr, Umar, Usmon, Ali"
        ]
    },
    {
        "word": "Xuluʼ",
        "type": [],
        "definition": [
            "'Xulu'' so'zi lug'atda 'kiyim yechish' ma'nosida ko'proq ishlatiladi. Shariatda esa, xotin kishining arz qilib, bir narsa berib eri bilan ajrashishiga 'xulu'' deyiladi. Chunki, eru xotin Qur'on ta'biri ila bir-biriga kiyim o'rnida bo'ladi."
        ]
    },
    {
        "word": "Xumra",
        "type": [],
        "definition": [
            "Xumra – xurmo novdasidan to'qilgan kichik joynamoz, bo'yracha"
        ]
    },
    {
        "word": "Xumus",
        "type": [],
        "definition": [
            "Xumus – o'ljaning beshdan biri"
        ]
    },
    {
        "word": "Xumxisar",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Xunasa",
        "type": [],
        "definition": [
            "Xunasa – xotinchalish yoki ham erkak, ham ayollik sifati bo'lgan kimsa. Xunasaning imomligi makruh sanaladi."
        ]
    },
    {
        "word": "Xunomatiy",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Xurofot",
        "type": [],
        "definition": [
            "bid'at, afsona, behuda gap, safsata, to'qima, uydirma; islomdan oldingi arablarning odatlari."
        ]
    },
    {
        "word": "Xusumatchi",
        "type": [],
        "definition": [
            "dushman, raqib, janjallashgan"
        ]
    },
    {
        "word": "Xufton namozi",
        "type": [],
        "definition": [
            "Shafaq yo'qolgandan to Bomdod namozining vaqti qirgunga qadar o'qiladigan namoz."
        ]
    },
    {
        "word": "Xuffayn",
        "type": [],
        "definition": [
            "Mahsi"
        ]
    },
    {
        "word": "Xushuʼ",
        "type": [],
        "definition": [
            "A'zolarning sukunatda va qalbning Alloh bilan bo'lishidir. 'Xushu'' qo'rquv bilan sukunatning birga qo'shilganidir. Mo'minlar namoz o'qiganlarida Alloh taolo maqomi huzurida qalblarini, vujudlarini, harakatu sakanotlarini qo'rqinch va sokinlik o'rab olishidir."
        ]
    }
]