[
    {
        "word": "Yaziyd ibn Rumo",
        "type": [],
        "definition": [
            "Yaziyd ibn Rumon Asadiy al-Madaniy, kunyalari Abu Ruh. Bu zot Zubayr ibn Afvon oilasining quli bo'lganlar. Hadislarni Ibn Zubayr, Anas, Ubaydulloh va yana boshqa kishilardan rivoyat qildilar. Bu zot rivoyat qilgan hadislar oltita 'Sahih' kitoblarida keltirilgan.\r\n    Ibn Sa'd aytadilar: 'Yaziyd ibn Rumon olim va ko'p ishonchli hadis rivoyat qilgan tobe'inlardan edilar'.\r\n    Bu zot hijratning 130-yili Madinada vafot etganlar."
        ]
    },
    {
        "word": "Yamoma ",
        "type": [],
        "definition": [
            "Yamoma – Arabiston yarim orolida joylashgan qadimiy shaharlardan biri. Hozirda Najd yerlariga to'g'ri keladi. Yamoma jangi hijriy 632 sanada sodir bo'lgan. U ridda urushi sirasiga kiradi. Bu jangda 70 nafar yoki undan ortiq qori halok bo'lgan."
        ]
    },
    {
        "word": "Yarmuk ",
        "type": [],
        "definition": [
            "Yarmuk – hozirgi Suriyaning janubida joylashgan Havron tog'laridan tushib, Falastin va Suriya chegaralari bo'ylab, Urdun vodiysi orqali O'lik dengizga quyiladigan daryo. Yarmuk daryosi Urdun daryosiga qo'shilishidan 45 kilometrcha yuqorida, cHar tomonda uch tarafi tog' bilan o'ralgan keng bir vodiy bor. Bu vodiyda musulmonlar bilan Vizantiya qo'shinlari orasida jang bo'lgan. O'ttiz olti ming kishilik musulmon lashkari Vizantiyaning ikki yuz qirq ming kishilik qo'shinini mag'lub qilgan. Bu jang Yarmuk g'azoti deb nom olgan. Urushni ba'zilar h.15\/m.636 yilda bo'lgan desa, boshqalar h.13\/m.634 yilda bo'lgan, deyishadi."
        ]
    },
    {
        "word": "Yarhamukalloh",
        "type": [],
        "definition": [
            "Alloh sizga rahm qilsin"
        ]
    },
    {
        "word": "Yaxshilik va silai rahm",
        "type": [],
        "definition": [
            "Shayx Muhammad Sodiq Muhammad Yusuf hazratlarining ikki jildlik 'Yaxshilik va silai rahm' deb nomlangan kitob. Mazkur asar buyuk vatandoshimiz, Movarounnahr diyoridan chiqqan qadim ulamolardan biri, hijriy 246 sanada vafot etgan Husayn ibn Hasan Marvaziy rahmatullohi alayhining 'Kitabul birri vas-sila' nomli kitoblarining sharhlangan tarjimasidir.\r\n    Ushbu nodir asar diynimizdagi eng mo''tabar ibodatlardan biri - yaxshilik qilish va qarindosh-urug'lik rishtalarini bardavom qilish, ya'ni silai rahm qilish xaqidadir."
        ]
    },
    {
        "word": "Yahyo alayhissalom",
        "type": [],
        "definition": [
            "Yahyo alayhissalom Zakariyo alayhissalomning o'g'illari ekanini yuqorida aytib o'tdik. Bu ikki zot Banu Isroilning oxirgi nabiylaridan bo'lganlar. Ular o'z qavmlaridan faqat tug'yon, zalolat va sarkashlik ko'rdilar. Shunday bo'lsa ham, Allohga da'vat qilishda davom etdilar. Yahyo alayhissalom va Zakariyo alayhissalom – ikkovlari ham yahudiylar tarafidan vahshiyona qatl etildilar.\r\n    Yahyo alayhissalomning onalari Imronning qizi bo'lib, Maryamning xolasidir. Yahyo alayhissalom Iyso alayhissalomdan olti oy oldin dunyoga kelib, umrlarining ko'p qismini u zot bilan birga o'tkazganlar.\r\n    Maryam surasida Yahyo alayhissalom haqlarida quyidagilar aytiladi:\r\n    'Ey Yahyo, kitobni quvvat-la ol!' (dedik). Unga go'dakligidayoq hikmat berdik' (12-oyat).\r\n    Alloh taolo Yahyo alayhissalomga: 'Tavrotni quvvat bilan ol', demoqda. Aslida Muso alayhissalomga nozil bo'lgan Tavrotni keyin kelgan payg'ambarlar, jumladan, Zakariyo alayhissalom va u zotning o'g'illari Yahyo alayhissalom ham o'qib, unga amal qilganlar. Oyatdagi\r\n    'Unga go'dakligidayoq hikmat berdik', degan jumlani ulamolarimiz ilmu hikmat mazmunida ta'vil qilganlar.\r\n    '...va O'z tomonimizdan mehribonlik va poklik (berdik). Hamda u taqvodor edi' (13-oyat).\r\n    Ya'ni 'Yahyoga kitob, ilmu hikmat bilan birga, mehribonlik va poklik ham berdik'.\r\n    Shuningdek, Yahyo alayhissalom juda taqvodor zot edilar.\r\n    '...va ota-onasiga mehribon bo'lib, dimog'dor va isyonchi emasdi' (14-oyat).\r\n    Yahyo alayhissalomning fazilatlaridan yana biri ota-onaga mehribonliklari edi. Xususan, keksalikda ko'rilgan farzandning ota-onaga mehribon bo'lishi katta fazldir.\r\n    'Unga tug'ilgan kunida ham, o'ladigan kunida ham, qayta tiriladigan kunida ham salomlar bo'lsin' (15-oyat).\r\n    Ibn Atiyyaning aytishlaricha, Alloh taolo Yahyo alayhissalomga inson farzandi eng zaif va yordamga muhtoj bo'ladigan uch holatda: tug'iladigan, o'ladigan va qayta tiriladigan kunlarida salomatlik tiladi. Bu juda ulkan saodatdir.\r\n    Alloh taolo Yahyo alayhissalomni vasf qilib, Oli Imron surasida shunday marhamat qiladi:\r\n    'Mehrobda namoz o'qib turganida farishtalar unga: 'Albatta, Alloh senga Allohdan bo'lgan 'kalima'ni tasdiqlovchi, peshvo, shahvati tiyilgan, nabiy hamda solihlardan bo'lgan Yahyoning xushxabarini bermoqda', deb nido qildilar' (39-oyat).\r\n    Zakariyo alayhissalom mehrobda namoz o'qib turganlarida Allohning farishtalari kelib, u zotga suyunchilik xabarini yetkazdilar.\r\n    Onasi unga hali homilador bo'lmasidan, Alloh taolo Yahyo alayhissalomning vasflarini bayon qilmoqda.\r\n    Ismi – Yahyo.\r\n    Bu farzand Allohdan bo'lgan kalimani tasdiqlaydi.\r\n    Shahvati tiyilgan, ya'ni ayollarga nisbatan bo'ladigan rag'batini jilovlab yuradi.\r\n    Shu joyda ta'kidlab o'tish kerakki, Qur'oni Karim oyatida bu sifat 'hasur' lafzi bilan kelgan. Bu so'z 'erkakligi yo'q' degan ma'noda ham ishlatiladi. Ba'zi yaxshi tushunmagan odamlar Yahyo alayhissalomga ham ushbu ma'noni nisbat berishadi. Ulug' tafsirchilarimiz esa bu fikr mutlaqo noto'g'ri ekanini qayta-qayta ta'kidlaganlar, chunki erkakligi yo'q bo'lish jiddiy nuqson hisoblanib, payg'ambarlar bunday nuqsondan xoli zotlardir. Yahyo alayhissalomda erkaklik xususiyati komil suratda mavjud bo'lgan, biroq Alloh taolo u zotga ayol zotiga nisbatan hosil bo'ladigan shahvatni tiyish qobiliyatini bergan.\r\n    Yana oyatda bo'lajak Yahyo ismli farzand solih payg'ambarlardan bo'lishining bashorati ham qilinmoqda.\r\n    Yahyo alayhissalom taqvo va zohidlik bilan hayot kechirganlar. U zot ko'proq nabotot bilan oziqlanganlar.\r\n    Yahyo alayhissalomning da'vatlari nozik hikmat va mav'izalar asosida bo'lgan.\r\n    Imom Ahmad bu haqda Payg'ambarimiz alayhissalomdan quyidagilarni rivoyat qiladilar:\r\n    'Alloh Yahyo ibn Zakariyoni besh narsaga amr qilgan hamda Banu Isroilni ham o'sha narsalarga amal qilishga buyurishni zimmasiga yuklagan edi. Sal bo'lmasa, u kech qolay dedi. Iyso alayhissalom unga: 'Sen besh narsaga amal qilishga va Banu Isroilni ham ularni qilishga amr etishga buyurilgansan. Ularni yetkazadigan bo'lsang – yetkaz, bo'lmasa – men yetkazay', dedi.\r\n    U: 'Ey birodarim! Agar sen mendan oldin qilsang, azobga qolishdan yoki meni yer yutishidan qo'rqaman', dedi.\r\n    So'ng Yahyo Banu Isroilni Baytul maqdisga jamladi. Masjid to'ldi. U balandga chiqib o'tirdi va dedi: 'Alloh azza va jalla meni besh narsaga amal qilishga amr etdi va sizlarni ham o'shalarga amal qilishga buyurdi. Ular quyidagilar:\r\n    Birinchisi – Allohga ibodat qilishingiz va Unga biror narsani sherik qilmasligingiz. Bu xuddi birov o'zining xos kumushi yoki tillasiga qul sotib olganga o'xshaydi. U qul ishlab topganini boshqa odamga olib kelib bersa, sizdan qay biringiz o'zining quli shunday bo'lishini xohlaydi?! Alloh sizni yaratgan va rizq bergan. Unga ibodat qilingiz va Unga biror narsani sherik qilmangiz.\r\n    Ikkinchisi – sizlarni namoz o'qishga amr qildi. Modomiki banda alanglamasa, Alloh unga yuz tutadi. Qachon namoz o'qisangiz, alanglamang.\r\n    Uchinchisi – sizlarni ro'za tutishga amr qildi. Bu xuddi bir to'p odamlar orasida mushkli xaltani ko'tarib yurgan odamga o'xshaydi. Ularning hammasi mushk hidini payqarlar. Ro'zador og'zining hidi Allohning nazdida mushkning hididan afzaldir.\r\n    To'rtinchisi – sizlarni sadaqa berishga amr qildi. Bu esa xuddi dushman bildirmay ushlab olgan kishining misoliga o'xshaydi. Uning qo'lini bo'yniga bog'lab, chopish uchun olib borishganida: 'O'zimga o'zim to'lov berib, qutqarib olsam, maylimi?' debdi. So'ng oz-ozdan ko'paytirib borib, ko'p mol evaziga olibdi.\r\n    Beshinchisi – sizlarni O'zini ko'p zikr qilishga amr etdi. Buning misoli xuddi ortidan dushman quvib kelayotgan odamga o'xshaydi. U oxiri borib, metin qo'rg'onga kirib, berkinib olibdi. Banda Allohning zikrida bo'lsa, o'zini shaytondan qo'rg'onlab turgan bo'ladi'.\r\n    Tarixchilarning ta'kidlashlaricha, Falastin hukmdori shoh Hirod zolim va fosiq odam bo'lgan. U o'z akasining xotini Hirodiyani yaxshi ko'rib qolib, akasini o'ldirgan va unga uylangan edi. Bu ham yetmagandek, uning qizini, ya'ni o'z jiyanini yaxshi ko'rib qolib, unga ham uylanmoqchi bo'ldi. Qiz va uning onasi ham bu ishga rozi bo'lishdi. Biroq Yahyo alayhissalom bunday nikoh haromligini aytib, qarshi chiqdilar.\r\n    Shunda qizning onasi Yahyo alayhissalomni yo'q qilish payiga tushib qoldi. Qizini yasantirib, hukmdorning oldiga kirgizdi. U raqs tushib, hukmdorning ko'nglini oldi. Shunda u qizga: 'Tila tilagingni', dedi. Qiz: 'Yahyoning boshini ushbu tovoqqa solib, oldirib kel', dedi. U bu ishni bajarishga amr qildi va Yahyo alayhissalomni so'yib, boshini olib kelishdi.\r\n    Yahyo alayhissalomning shogirdlari mash'um xabarni Iyso alayhissalomga yetkazganlarida, u zot qattiq xafa bo'ldilar va odamlarni Yahyo alayhissalomning da'vatlariga chaqira boshladilar. Iyso alayhissalomga ko'plab odamlar ergashdi.\r\n    Yahyo alayhissalomning bu tarzda qatl etilishlariga ko'pchilik ilm ahllari qarshi chiqishdi. Shunda zolim hukmdor ularning ko'pchiligini, jumladan, Yahyo alayhissalomning otalari Zakariyo alayhissalomni ham o'ldirdi."
        ]
    },
    {
        "word": "Yahyo al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Zakariyo Yahyo ibn Yahyo ibn Abdulloh al-Buxoriy Buxoro ahlidan. Xuroson va Iroq muhaddislaridan ta'lim olganlar. Bu kishidan esa Abu Abdulloh al-Hokim al-Hofiz ta'lim olganlar va ustozlari haqida 'Tarix' kitoblarida quyidagicha aytganlar: 'Abu Zakariyo al-Mahmudiy Buxoroda o'z asrining 'Imomu ahl al-hadis'i (Hadis ahlining imomi) edilar. Hijriy 384 (milodiy 995) yilning safar oyida Buxoroda vafot etganlar'."
        ]
    },
    {
        "word": "Yahyo al-Paykandiy",
        "type": [],
        "definition": [
            "Abu Zakariyo Yahyo ibn Ja'far al-Paykandiy hadis ilmining ishonchli muhaddislaridan bo'lib, bular Imom al-Buxoriyga, ya'ni Muhammad ibn Ismoil al-Buxoriyga ta'lim bergan muhaddis ustozlardan."
        ]
    },
    {
        "word": "Yahyo al-Paykandiy al-Bakibuniy",
        "type": [],
        "definition": [
            "Abu Zakariyo Yahyo ibn Ja'far al-Paykandiy al-Bakibuniy Bakibun qishlog'idan. Bu kishi – 'Kitob at-tafsir' ('Tafsir kitobi') va 'Musannafat us-savmi vas-saloti val-manosiki val-buyu'' ('Ro'za, namoz, qurbonlik va savdo-sotiq tasniflari') kitoblarining muallifi. Sufyon ibn Uyayna, Muhammad ibn Fuzayl va Abu Muoviya az-Zarirdan ta'lim olganlar. Bu zot – Muhammad ibn Ismoil al-Buxoriy, Ubaydulloh ibn Vosil va Xalaf ibn Omirning ustozlari."
        ]
    },
    {
        "word": "Yahyo al-Paykandiy an-Naqbuniy",
        "type": [],
        "definition": [
            "Abu Zakariyo Yahyo ibn Ja'far al-Paykandiy an-Naqbuniy Paykand ahlidan. Naqbun qishlog'ida yashar edilar. 'Tafsir' va 'Musannafa fis-savmi vas-saloti val-manosiki val-buyu'' ('Ro'za, namoz, haj va savdo-sotiq haqida kitob') asarining muallifi. Iroq va Hijozda bo'lib, Sufyon ibn Uyayna, Muhammad ibn Fuzayl, Vake' ibn Jarroh al-Kufiydan ta'lim olganlar. Imom al-Buxoriy, Ubaydulloh ibn Vosil va Xalaf ibn Omir shu kishidan hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Yahyo al-Fashniy al-Buxoriy",
        "type": [],
        "definition": [
            "Abu Zakariyo Yahyo ibn Zakariyo al-Fashniy al-Buxoriy Buxoroning Fashna nomli qishlog'idan bo'lib, Sufyon ibn Abdulhakim, Ibrohim ibn Muhammad, Ahmad ibn Lays, Asbot ibn Yasa' al-Buxoriy, Abu Abdulloh ibn Abu Hafs al-Buxoriydan hadis rivoyat qilganlar. O'zlaridan Ja'far ibn Muhammad al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Yahyo ibn Asad",
        "type": [],
        "definition": [
            "Nuh ibn Asadning ukalari Abul Abbos Yahyo ibn Asad hijriy 241 (milodiy 856) yil rabi'ul oxir oyiga 5 kun qolganda payshanba kuni vafot etganlar."
        ]
    },
    {
        "word": "Yahudiy ",
        "type": [],
        "definition": [
            "Muso alayhissalomga imon keltirgan ummat."
        ]
    },
    {
        "word": "Yahʼyo ibn Yaziyd al-Hunoiy",
        "type": [],
        "definition": [
            "Yah'yo ibn Yaziyd al-Hunoiy roziyallohu anhu ulug' tobe'inlardan bo'lib, hadislarni Anas ibn Molik, Farzadaq va boshqa kishilardan rivoyat qildilar.\r\n    Bu kishidan Muhammad ibn diynor, Xalf ibn Xalifa, Utba ibn az-Zobiy, Sho''ba va boshqalar rivoyat qildilar."
        ]
    },
    {
        "word": "Yaʼqub alayhissalom",
        "type": [],
        "definition": [
            "Ya'qub alayhissalom Ibrohim alayhissalomning nabiralari, ya'ni Ishoq alayhissalomning o'g'illaridir. 'Ya'qub'ning ma'nosi 'ortdan keluvchi'dir.\r\n    Ya'qub alayhissalomning laqablari Isroil bo'lgan. Muhaqqiq ulamolar 'Isroil' so'zi Abdulloh (Allohning quli, bandasi) degan ma'noni anglatishini aytadilar.\r\n    Ya'qub alayhissalom Falastin yerlarida dunyoga keldilar. Otalari Ishoq alayhissalomning tarbiyalarini olib o'sdilar.\r\n    Alloh taolo Ya'qub alayhissalomga o'n ikki o'g'il ato qildi. Bu o'n ikki o'g'ilning har biri Banu Isroil asbotidan bir 'sibt'ga ota bo'lgan. 'Asbot' so'zi 'sibt'ning ko'plik shakli bo'lib, 'avlod' degan ma'noni bildiradi.\r\n    Alloh taolo Ya'qub alayhissalomni Oli Imron surasida Isroil nomi ila zikr qilgan:\r\n    'Tavrot tushishidan oldin Isroil o'ziga harom qilgandan boshqa hamma taom Banu Isroilga halol edi. 'Agar rostgo'ylardan bo'lsangiz, Tavrotni keltirib o'qinglar', deb ayt!' (93-oyat)\r\n    'Isroil'dan murod, avval bayon qilinganidek, Ya'qub alayhissalomdir. Rivoyatlarda kelishicha, Ya'qub alayhissalom og'ir kasal bo'lib yotganlarida, agar Alloh shifo bersa, eng yaxshi ko'rgan taomlarini – tuya go'shtini yemaslik va sutini ichmaslikni nazr qilgan ekanlar. Alloh bu nazrni qabul qildi. Shuningdek, Alloh taolo Banu Isroildan sodir bo'lgan gunohlar sababli ularga iqob-jazo suratida ba'zi hayvonlarni hamda mol bilan qo'yning charvisini harom qildi. Holbuki, bular Tavrot nozil bo'lishidan oldin Banu Isroilga halol edi.\r\n    Ushbu oyatdan Ya'qub alayhissalomning shariatlarida ham taomlarning halol-haromligi, nazr atash kabi hukmlar bo'lganini bilib olamiz.\r\n    'Islom' so'zida bo'ysunish, toat, ixlos ma'nolari bor. Barcha payg'ambarlarning, jumladan, Ibrohim alayhissalom va u zotning nabiralari Ya'qub alayhissalomning ham dinlari Islomdir. Ibrohim alayhissalom va Ya'qub alayhissalomlar o'zlari musulmon bo'lishlari bilan kifoyalanib qolmadilar, balki ushbu Islom dinini mahkam tutishni vasiyat qildilar. Ushbu vasiyat Baqara surasida keladi:\r\n    'Ibrohim o'z o'g'illariga va Ya'qub ham: 'Ey o'g'illarim, Alloh sizlarga dinni tanladi, musulmon bo'lgan holingizdagina o'ling', deb buni (millatni) vasiyat qildilar' (132-oyat).\r\n    Shunday ekan, musulmon bo'lib yashab, musulmon bo'lib o'lishga harakat qilishdan boshqa yo'l yo'q.\r\n    O'g'illari Yusuf alayhissalomning yo'qolishlaridan qattiq kuyungan Ya'qub alayhissalomning ko'zlari ko'rmay qolgan edi. O'g'illarini topgandan so'ng ko'zlari ham tuzaldi va barcha oila a'zolari bilan birga Yusuf alayhissalom hukmdorlik qilayotgan Misrga kelib yashay boshladilar. O'sha paytda Ya'qub alayhissalom 130 yoshda edilar. U zot Misrda o'n yetti yil yashaganlaridan keyin 147 yoshlarida vafot etdilar. Ya'qub alayhissalom vafotlaridan oldin Yusuf alayhissalomga o'zlarini otalari Ishoq alayhissalomning yonlariga dafn etishlarini vasiyat qilgan edilar. U zot Falastinning Xalil shahridagi Makfila nomli g'or ichiga dafn qilindilar."
        ]
    },
    {
        "word": "Yaʼqub al-Biloliy",
        "type": [],
        "definition": [
            "Abu Solih Ya'qub ibn Yusuf al-Biloliy Xorazmning qozisi bo'lganlar. Tabiatan og'ir, sabrli, qo'rqmas, shijoatli va harakatchan edilar. Marvda qozi Muhammad ibn Husayn al-Arsobandiydan fiqh ilmidan ta'lim olganlar. U kishini Xorazmda uchratdim va otalari Abu Ya'qub Yusuf ibn Solihning hovlilarida o'n to'rt kun mehmon bo'ldim. Otalari nihoyatda saxiy, muruvvatli, bag'rikeng va qalblari yaxshilikka moyil kishi edilar. Mendan o'zlari va o'g'illari Abu Mas'ud Ahmad ibn Yusuf al-Biloliy hadis ilmidan ta'lim oldilar. Abu Solih Ya'qub al-Biloliy hijriy 470 (milodiy 1078) yilda tug'ilganlar."
        ]
    },
    {
        "word": "Yaʼqub al-Bordiziy",
        "type": [],
        "definition": [
            "Abu Ishoq Ya'qub ibn Isroil al-Bordiziy - Buxoroning Bordiza qishlog'idan bo'lib, ilm talabida Xurosonga borganlar. Ali ibn Xushrum va Abu Dovud Sulaymon ibn Muabbid as-Sanjiydan ta'lim olganlar. O'zlaridan esa Abu Bakr Ahmad ibn Muabbid az-Zohid al-Buxoriy hadis rivoyat qilganlar. Hijriy 309 (milodiy 922) yilning jumodul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Yaʼqub al-Vibavdiy",
        "type": [],
        "definition": [
            "Adib Abu Yusuf Ya'qub ibn Ishoq al-Vibavdiy Abu Abdulloh Muhammad ibn Yusuf al-Farabriy va Muhammad ibn Yusuf ibn Osimdan hadis rivoyat qilganlar. Hijriy 375 (milodiy 986) yilda vafot etganlar."
        ]
    },
    {
        "word": "Yaʼqub al-Vobkaniy",
        "type": [],
        "definition": [
            "Abu Yusuf Ya'qub ibn G'armul al-Vobkaniy Xuroson olimlaridan ta'lim olganlar. Musayyab ibn Ishoq, Muhammad ibn Salom al-Paykandiy, Abu Hafs Ahmad ibn Hafs al-Buxoriy, Abu Muhammad Hibbon ibn Muso al-Kushmihaniy, Homid ibn Odam al-Marvaziy, Ali ibn Hajar as-Sa'diy va boshqa ko'p ustozdan ta'lim olganlar. O'zlaridan esa Shohid ibn Muhammad al-Buxoriy, Abu Hafs Ahmad ibn Hotam al-Buxoriy va Ahmad ibn Mahmud as-Sarrom al-Vobkaniy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Yaʼqub al-Jandiy",
        "type": [],
        "definition": [
            "Ya'qub ibn Shirin al-Jandiy Bu zot qozi, fozil va qat'iyatli kishilardan edilar. Chiroyli she'rlar ham yozganlar. Hijriy 348 (milodiy 960) yilda Abdulkarim As-Sam'oniy bilan birga Xorazmdan Buxoroga elchi bo'lib kelganlar. Keyinchalik Samarqandga ketganlar."
        ]
    },
    {
        "word": "Yaʼqub al-Osimiy al-Buxoriy ",
        "type": [],
        "definition": [
            "Abul Fazl Ya'qub ibn Yusuf al-Osimiy al-Buxoriy Buxoro ahlidan bo'lib, o'z shahrining shayxi, o'z asrining muhaddisi edilar. Hadis ahliga nihoyatda sadoqatli bo'lganlar. Iroqda Muhammad ibn Ubaydulloh al-Munodo, Muhammad ibn Sinon al-Qazzoz, Abdulmalik ibn Muhammad ar-Raqoshiy va Abbos ibn Muhammad ad-Duriydan ta'lim olganlar. O'zlaridan qozi Yahyo ibn Mansur, Ali ibn Iso va Abdulloh ibn Muhammad al-Hiro hadis rivoyat qilganlar. Hijriy 314 (milodiy 927) yilda Nishopurga kelib katta majlis (yig'in) o'tkazganlar. Hijriy 325 (milodiy 938) yili Buxoroda vafot etganlar."
        ]
    },
    {
        "word": "Yaʼqub al-Xorazmiy",
        "type": [],
        "definition": [
            "Abu Yusuf Ya'qub ibn Jarroh al-Xorazmiy peshqadam olimlardan. Ahmad ibn Abu Tayyibdan hadis rivoyat qilganlar. Xorazmning ko'p ahli ilmlari bu kishidan ta'lim olganlar."
        ]
    },
    {
        "word": "Yaʼqub as-Saffor as-Sikichkatiy",
        "type": [],
        "definition": [
            "Abu Yusuf Ya'qub ibn Yusuf as-Saffor as-Sikichkatiy - Buxoroning Sikichkat qishlog'idan bo'lib, bu nisbat bilan mashhur edilar. Abu Sa'id Sufyon ibn Ahmad as-Sakbiyoniy al-Buxoriydan hadis rivoyat qilganlar. O'zlaridan esa Abu Abdulloh Muhammad ibn Ahmad al-G'unjor al-Hofiz al-Buxoriy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Yaʼlo roziyallohu anhu",
        "type": [],
        "definition": [
            "Ya'lo ibn Murra as-Saqafiy Rasululloh sollallohu alayhi vasallamning faziylatli sahobalaridandirlar. Hudaybiya, Xaybar, Makka fathi, Havazon, Toifdagi janglarda ishtirok etganlar. Rasululloh sollallohu alayhi vasallam Toifga borganlarida uzum keltirgan sahoba shu kishi edilar.\r\n    Ya'lo Ali roziyallohu anhuning ashoblaridan bo'lib, Kufa, Basra shaharlarida istiqomat qildilar.\r\n    Rasululloh sollallohu alayhi vasallamdan hadislar rivoyat qildilar. Bu zotdan o'g'illari Abdulloh, Said ibn Abu Rashid va boshqalar rivoyat qilganlar.\r\n    Bu kishi rivoyat qilgan hadislardan ba'zilarini uch 'Sahih' sohiblari o'z kitoblariga kiritganlar."
        ]
    },
    {
        "word": "Yengil najosat ",
        "type": [],
        "definition": [
            "Yengil najosatning 'yengil' deb atalishiga sabab ularning najasligi haqida rivoyatlar har xil kelganidir. Ba'zilari 'najas' desa, boshqalari 'najas emas' degan. Najasligi g'olib bo'lgan. Shuning uchun, uni 'yengil najosat' deyilgan."
        ]
    },
    {
        "word": "Yogʻiy ",
        "type": [],
        "definition": [
            "dushman, yov, g'anim"
        ]
    },
    {
        "word": "Yosin surasi ",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 83 oyatdan iborat.\r\n    Suraga uning avvalidagi 'ya' va 'sin' muqattaot harflaridan tashkil topgan 'ya sin' kalimasi nom bo'lib qolgan. Bu surai sharifaning fazli haqida ko'pgina hadislar rivoyat qilingan. Ularning aksariyatida Yosin surasi Qur'onning qalbi ekani ta'kidlangan. Shuning uchun 'Qur'on qalbi' degan nom suraga ikkinchi nom bo'lib qolgan.\r\n    Imom Bazzor Abdulloh ibn Abbos roziyallohu anhudan rivoyat qilgan hadisda Rasululloh sollallohu alayhi vasallam: 'Har bir narsaning qalbi bor. Qur'onning qalbi Yosindir. Men uning ummatimdan har bir insonning qalbida bo'lishini istardim', – deganlar.\r\n    Imom Molik va imom ibn Hibbonlar Jundab ibn Abdulloh roziyallohu anhudan rivoyat qilgan hadisda Nabiy sollallohu alayhi vasallam: 'Kim Yosinni kechasi Allohning roziligi talabida o'qisa, uni mag'firat qiladi', – deganlar.\r\n    Imom Ahmad, imom Abu Dovud, imom Nasaiy, imom ibn Moja va Imom Hokimlar Ma'qal ibn Yasor roziyallohu anhudan rivoyat qilgan hadisda Nabiy sollallohu alayhi vasallam: 'Yosin Qur'onning qalbidir. Kim uni Allohni va oxirat kunini umid qilib o'qisa, albatta, mag'firat qilinadi. Uni o'liklaringizga o'qinglar', – deganlar.\r\n    Mazkur hadisi shariflar va shunga o'xshash boshqa hadislarga amal qilaroq, musulmonlar ichida bu surai karimani yodlash, uni doimo o'qib yurish keng odat tusiga kirgan. Agar bu amalga suraning ma'nolarini anglab yetish va tadabbur qilish ham qo'shilsa, ayni murod hosil bo'lar edi. Zero, Yosinni o'qishga bunchalar targ'ib qiluvchi hadislar bekorga kelmagan.\r\n    Makkada nozil bo'lgan boshqa suralar kabi, Yosin surasida ham asosiy e'tibor e'tiqod masalasiga qaratiladi. Xususan, qayta tirilish, payg'ambarlik hamda Alloh taoloning vahdoniyati masalalariga alohida e'tibor beriladi.\r\n    Surai karimaning boshida Qur'oni Hakim bilan qasam ichilib, Muhammad sollallohu alayhi vasallamning haqiqiy payg'ambar ekanliklari ta'kidlanadi. Jaholatga botgan Quraysh kofirlarining hadlaridan oshib, Muhammad sollallohu alayhi vasallamni yolg'onchiga chiqarganlari haqida so'z yuritiladi.\r\n    Shundan so'ng bir qishloqqa yuborilgan payg'ambarlar va ular bilan o'sha qishloq aholisi orasida bo'lib o'tgan hodisalar keltiriladi. Payg'ambarlikni inkor etganlarning oqibati nima bilan tugaganiga urg'u beriladi. Iymonga kelgan bir odamning o'zini qanday tutgani va uning oqibati nima bo'lgani ham ajoyib uslub bilan bayon etiladi.\r\n    Keyin esa Alloh taoloning borliqdagi vahdoniyatiga va cheksiz qudratiga dalolat qiluvchi hodisalar haqida so'z ketadi. Qurib-qaqrab yotgan yerga hayot kirishi, kecha bilan kunduzning almashinuvi, quyoshning ziyo sochib, o'z o'rnida aylanishi, oyning burjlarga chiqib-botib turishi va boshqa jarayonlar haqida so'z yuritiladi.\r\n    Shuningdek, surada qiyomat kuni va uning dahshatlari, sur chalinib, o'liklarning qayta tirilishi, ularning mahsharga to'planishi, kishilarning mo'min va kofirga ajralishi, ularga mukofot va jazo berilishi kabi mavzularga ham o'rin berilgan."
        ]
    },
    {
        "word": "Yulgun ",
        "type": [],
        "definition": [
            "Yulgun – patsiz o'q."
        ]
    },
    {
        "word": "Yunus alayhissalom",
        "type": [],
        "definition": [
            "Alloh subhanahu va taolo Iroqning Movsil viloyati yaqinidagi Niynavo degan joyga o'z nabiysi Yunus alayhissalomni payg'ambar qilib yubordi. Yunus alayhissalom Banu Isroilning nabiylaridandirlar. Nasablari Yusuf alayhissalomning tug'ishgan ukalari Binyominga yetib boradi. U zot Yunus ibn Matto ismi bilan mashhurdirlar. Matto u zotning onalarining ismi bo'lgan. Payg'ambarlar ichida faqat Yunus va Iyso alayhissalomlar onalariga nisbat berilganlar.\r\nO'sha davrda Yunus alayhissalom nabiy etib yuborilgan yerlarning aholisi turli sanamlarga ibodat qilar, turfa gunoh ishlar bilan shug'ullanishardi. Yunus alayhissalom ularni Alloh taologa iymon keltirishga, gunoh ishlarni tark etishga da'vat qildilar. Lekin ular bu da'vatni qabul qilishmadi, fisqu fasod ishlarida davom etishdi.\r\nYunus alayhissalom ma'lum muddatdan so'ng ularni Allohning azobi nozil bo'lishidan ogohlantirdilar. Ko'nishmagach, achchiqlari chiqib, 'Men o'z vazifamni ado etdim, endi gunohkorlar ichida qolmasligim kerak', degan to'xtamga keldilar. Shaharni tashlab, chiqib ketdilar. Bu ishni o'zlaricha, shunisi to'g'ri degan fikrda, Allohning iznisiz qildilar. Yurib-yurib, nihoyat dengiz sohiliga yetib bordilar. Jo'nashga shaylanib turgan bir kemaning egalaridan o'zlarini birga olib ketishlarini so'ragan edilar, ular rozi bo'lishdi.\r\nKema dengizga chiqqanda birdan shamol turib, dovul boshlandi. To'lqin kuchayib, kemaning g'arq bo'lish xavfi tug'ildi. Kema boshqaruvchilar ham, yo'lovchilar ham qo'rqib, dahshatga tushishdi. To'planib maslahat qilishdi. Ba'zilar: 'Ichimizda gunohkor kishi bor, shuning uchun noqulay ahvolda qoldik', deyishdi. Maslahatdan so'ng qur'a tashlab, qur'a kimning chekiga tushsa, o'sha odamni qurbonlik uchun dengizga tashlab yuborishga qaror qilishdi. Qur'a qayta-qayta Yunus alayhissalomga chiqdi va u zotni dengizga tashlab yuborishdi. Alloh taoloning amri bilan u zotni ulkan baliq yutib yubordi va hazm qilmasdan, qornida olib yurdi. Shunda Yunus alayhissalom xatolarini tushunib yetdilar. Baliqning qornida yolvorib, zorlanib, Alloh taologa duo qildilar. Alloh taolo duolarini ijobat qilib, baliqqa amr qildi va u Yunus alayhissalomni ozor yetkazmasdan, ochiqlik joyga olib chiqib tashladi. Badanlari baliqning ichida oq yem bo'lib ketgan Yunus alayhissalom behush yotib qoldilar. Alloh taolo rahm qilib, oftobdan zarar yetmasligi uchun ustilariga soya solib turuvchi serbarg oshqovoqni o'stirib qo'ydi. Ushbu holatda bir muddat yotib, sog'ayib, o'zlariga keldilar.\r\nAlloh taolo u zotga qavmlarining oldiga borishlari uchun farmon berdi. Yunus alayhissalom ketib qolgach, azobning boshlanishi zohir bo'lgandan so'ng ular xatolarini tushunib, Allohga azobni qaytarishini so'rab, yolvorib, tavba qilishgan edi. Ularning soni yuz mingdan ko'proq edi. Yunus alayhissalom ularning huzuriga qaytib, barchalarini iymonga chaqirdilar va Alloh taolo ularni hidoyatga boshladi.\r\nQuyidagi oyati karimada Alloh taolo Yunus alayhissalomni 'ulul azm' ('sabot-matonatli') payg'ambarlar bilan bir qatorda zikr qilgan:\r\n'Biz senga xuddi Nuh va undan keyingi nabiylarga vahiy yuborganimizdek vahiy yubordik. Biz Ibrohim, Ismoil, Ishoq, Ya'qub va uning avlodlari, Iyso, Ayyub, Yunus, Horun va Sulaymonga vahiy yubordik. Dovudga esa Zaburni berdik' (Niso surasi, 163-oyat).\r\nAlloh taolo Qalam surasida Yunus alayhissalomning qissalarini quyidagicha bayon qiladi:\r\n'Robbingning hukmiga sabr qil va bir vaqtlar g'amga to'lgan holda nido qilgan 'baliq sohibi' singari bo'lma' (48-oyat).\r\n'Baliq sohibi'dan murod Yunus alayhissalomdir. U zot qavmiga achchiq qilib, ularni tashlab chiqib ketganlari, kemada ketayotib, qur'aga tushganlari va dengizga otilganlari, baliq yutib yuborganda uning qornida Allohga yolvorganlari haqida salgina yuqorida ma'lumotlar oldik.\r\nKeyingi oyatlarda Yunus alayhissalomning qissalari bayoni davom etadi.\r\n'Agar Robbining ne'mati uni topmaganida, mazammatga qolgan holida ochiq sahro joyga tashlangan bo'lardi. Robbi uni tanlab oldi va solih bandalaridan qildi' (49–50-oyatlar).\r\nYa'ni agar Yunus alayhissalomni Allohning ne'mati izlab topmaganida, u zot o'zlarini yutib yuborgan baliq tomonidan ochiq sahroga mazammatli holda tashlangan bo'lar edilar.\r\nLekin Alloh taolo u zotga rahm ko'rsatdi. Baliq ozor yetkazmay qornidan qirg'oqqa chiqarib qo'ydi. Behush yotganlarida, ustlarida serbarg oshqovoq soya solib turdi. Alloh taolo u zotni O'zining solih bandalaridan qildi.\r\nYunus alayhissalom qavmining najot topishi\r\nYunus alayhissalom qavmining najoti haqida Alloh taolo Yunus surasida quyidagilarni aytadi:\r\n'Qani endi, biron qishloq iymon keltirganda, unga iymoni manfaat bersa edi. Faqat Yunus qavmi iymon keltirganlarida, ulardan dunyo hayotidagi xorlik azobini kushoyish qildik va ularni ma'lum vaqtgacha bahralantirdik' (98-oyat).\r\nBundan boshqa hech bir qavm boshiga ilohiy azob kelib qolganda tavba qilib, najot topmagan. Balki Fir'avnga o'xshab oxirgi lahzada keltirgan iymoni foyda bermay, halokatga uchragan."
        ]
    },
    {
        "word": "Yunus al-Faqih al-Usrushaniy",
        "type": [],
        "definition": [
            "Abu Sa'id Yunus ibn Fazl al-Faqih al-Usrushaniy fozil, faqih, mumtoz olim edilar. Samarqandga kelib, Abdulloh ibn Ayyub al-Mahzumiydan hadis ilmidan ta'lim olganlar. O'zlaridan esa faqih Abu Nasr Muhammad ibn Ubaydulloh as-Samarqandiy hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Yunus surasi ",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 109 oyatdan iborat.\r\nUshbu surai karima Yunus alayhissalom haqlarida ham hikoya qilganligi sababli shu nom bilan atalgandir. Makkada nozil bo'lgan boshqa suralar kabi, bu sura ham iymon-e'tiqod masalalarini muolaja qiladi\r\nYunus surasining avvalida Makka mushriklarining Payg'ambarimiz Muhammad sollallohu alayhi vasallamga nozil bo'layotgan vahiyga munosabatlari zikr qilinib, vahiydan ajablanishning hech hojati yo'qligi aytiladi. Shu bilan birga, mushriklarning vahiyga ishonish uchun qo'yayotgan shartlari noto'g'ri ekani bayon qilinadi. Ular Payg'ambar sollallohu alayhi vasallamdan, agar nozil bo'layotgan vahiy haqiqat bo'lsa, bir moddiy mo''jiza ko'rsatishni talab qilgan edilar. Ana o'sha talab nohaq ekani surai karimaning eng munosib joyida bayon etiladi. Har qancha mo''jiza bo'lsa, Qur'oni Karimning o'zi kifoya qilishi ta'kidlanadi.\r\nSo'ngra mushriklarning ilohiylik va ibodat xususidagi noto'g'ri tushunchalari muolaja etiladi. Chunki ular Qur'on Allohning huzuridan ekaniga ishonmay, shubhalanishar va turli butu sanamlarga sig'inishar edi. O'sha but va sanamlar 'katta Xudo'ning oldida shafoatchi bo'ladi, degan buzuq e'tiqodlari ham bor edi. Shuning uchun surada haqiqiy ibodatga loyiq ilohning sifatlari bayon etiladi. Mushriklar xudo qilib olgan but-sanamlar aslida nima ekani tushuntiriladi.\r\nUndan keyin oxiratga bo'lgan iymon haqida bahs ketadi. Chunki odamlar shu ishonchning yo'qligidan dunyo hoyi-havaslariga berilib, oqibatni yoddan chiqarishar, natijada turli noma'qulchiliklar kelib chiqar edi. Shuning uchun ham qiyomatning haq ekani, uni qoim qilish Alloh taolo uchun qiyin emasligi oyatlarda ketma-ket bayon etiladi. Qiyomat sahnasi jonlantiriladi. U Kunda nimalar ro'y berishi – iymonli bo'lib, Allohga ibodat qilib o'tganlarning jannatga kirishlari, kofir, munofiq va osiylarning esa qilmishlariga yarasha jazo olishlari uchun do'zaxga tushishlari tasvirlanadi.\r\nShuningdek, Yunus surasida Alloh taoloning cheksiz qudratli Zot ekaniga dalolat qiluvchi maxluqotlariga nazar solishga da'vat etadigan oyatlar ham ko'p uchraydi.\r\nBu suraning yana ko'pgina o'rinlarida o'tgan ummatlarning qissalari ham keltirilib, ulardan ibrat olishga chaqiriladi."
        ]
    },
    {
        "word": "Yusuf az-Zaranjariy",
        "type": [],
        "definition": [
            "Abu Ya'qub Yusuf ibn Talha az-Zaranjariy - Buxoroning Zaranjariy nomli qishlog'idan bo'lib, Abu Ahmad Buhayr ibn Nazrdan hadis rivoyat qilganlar. O'zlaridan esa Abu Tayyib Tohir ibn Muhammad hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Yusuf al-Kamoriy",
        "type": [],
        "definition": [
            "Abu Ya'qub Yusuf ibn Fazl al-Kamoriy Buxoroning Kamoriy nomli qishlog'idan. Iso ibn Muso al-G'unjor va Ka'b ibn Sa'iddan hadis rivoyat qilganlar. U kishidan esa Sahl ibn Shozavayh hadis rivoyat qilganlar."
        ]
    },
    {
        "word": "Yusuf al-Fagʻdiniy",
        "type": [],
        "definition": [
            "Abu Yahyo Yusuf ibn Ya'qub al-Fag'diniy Buxoroning Fag'din nomli qishlog'idan bo'lib, Ali ibn Xushrum, Sa'd ibn Muoz va Abu Abdulloh ibn Abu Hafsdan hadis rivoyat qilganlar. Hijriy 300 (milodiy 913) yilning rabi'ul avval oyida vafot etganlar."
        ]
    },
    {
        "word": "Yusuf ibn Abu Solih al-Bobiy",
        "type": [],
        "definition": [
            "Yusuf ibn Abu Solih al-Bobiy - Buxoroning Boba qishlog'idan. 'Men bilan birga hadisdan dars olganlar'. (Abu Komil al-Basiriy.) Bu kishi haqlarida Ibn Mokulo 'Kitob ul-ikmol' ('Mukammal kitob') asarlarida zikr qilganlar."
        ]
    },
    {
        "word": "Yusuf surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 111 oyatdan iborat.\r\nUlamolarimizning ta'kidlashlaricha, bu surai karima Hud surasidan keyin nozil bo'lgan.\r\nHud surasi qanday og'ir vaziyatda, Islom va musulmonlar uchun naqadar nozik, hassos va qiyin paytda nozil bo'lganini ko'rib o'tdik. Mushriklarning Payg'ambar sollallohu alayhi vasallamga va u kishiga ergashgan oz sonli musulmonlarga tazyiqlari nihoyatda kuchaygan bir payt edi. Payg'ambar sollallohu alayhi vasallamga eng yaqin va suyanchiq bo'lib turgan zotlar – amakilari Abu Tolib va Bibi Xadiyja onamiz birin-ketin vafot etib, bandalardan kelayotgan so'nggi ko'maklar ham bitgan, musibat ortidan musibat kelavergan, o'sha yil musulmonlar uchun 'mahzunlik yili'ga aylangan bir payt. Musulmonlarning najot istab, Allohning O'ziga iltijo qilishdan boshqa choralari qolmagan payt. Payg'ambar sollallohu alayhi vasallam ham, qiynoqda siqilib qolgan musulmonlar ham bir og'iz bo'lsa-da, daldaga muhtoj payt. Ana shu holatda haqiqiy yordamchi bo'lmish Alloh taoloning O'zidan dalda keldi. Payg'ambar sollallohu alayhi vasallamga va mo'min-musulmonlarga bundan-da qattiqroq musibatlarga yo'liqqan, sinovlarning har turlisiga uchragan bir bandaning – payg'ambar Yusuf alayhissalomning qissalari keldi. Bu qissa Payg'ambar sollallohu alayhi vasallamga ham, musulmonlarga ham ulkan tasalli va buyuk dars edi.\r\nShu bilan birga, boshqa makkiy suralar kabi, bu surada ham aqiyda masalalari, Allohning qudrati, Islom da'vati haqida so'z yuritiladi. Iymon yo'lida tinmay harakat qilish, bu yo'ldagi turli to'siqlarga bardosh berish lozimligi va boshqa masalalar qissa davomida muolaja qilinadi.\r\nYusuf surasi bitta qissani avvalidan oxirigacha, boshqa narsalarni aralashtirmay, hikoya qilgan yagona suradir. Yusuf alayhissalomning ismlari bu suradan boshqa yana bir joyda zikr qilinadi, xolos. Bu surai karimada, boshqalaridan farqli o'laroq, ko'proq oilaviy munosabatlardagi salbiy o'rinlarga, hukmron doiralar ichidagi ixtiloflarga, ularning atrofidagilarning holatlariga e'tibor berilgan. Diniy-ma'naviy tarbiya bo'lmagani tufayli boy-zodagon oilalarning ba'zi a'zolari 'to'qlikka sho'xlik' qilishlaridan namunalar keltirilgan.\r\nUlug' payg'ambarlar – Ibrohim, Ishoq va Ya'qub alayhissalomlarning sulolasi bo'lmish yosh va go'zal yigit Yusuf o'z akalarining fitnasiga uchraydi. Akalari uni otalari Ya'qub alayhissalomdan qizg'anib, yo'qotmoqchi bo'ladilar, maslahatlashib, Yusufni quduqqa tashlaydilar va otalariga kelib: 'Biz musobaqa qilib, o'ynab ketib qolibmiz, Yusufni bo'ri yeb qo'yibdi', – deydilar. Yusuf esa nochor holda quduqda o'tiribdi. Lekin u kelajakda erishadigan oliy martabalari uchun sinov kunlarini o'tamoqda, ba'zi tajribalarni boshidan kechirmoqda, xolos. Hamma ishni hikmat ila qiladigan Alloh uni qutqarish yo'lini ham O'zi yaxshi biladi. Ana, yo'lovchilar suv olib kelish uchun suvchilarini quduq tomon yo'lladilar. Bittasi chelagini suvga tashlamoqchi edi, qarasa, quduq ichida chiroyli bir yigit o'tiribdi. Uni quduqdan chiqarib olishdi va qul qilib sotishdi. Ha, ulkan payg'ambarlarning farzandini, bo'lajak payg'ambarni qul qilib sotishdi. Bahosiga uncha qiziqishmadi ham. Yo Alloh, bu naqadar dahshat! Lekin hakiym sifatli Zot hamma ishni hikmat ila amalga oshiradi. Yusufning hozircha qul bo'lib sotilishining ham hikmati bor, bu ish kelajakda ilohiy irodaning yuzaga chiqishi sari bir pog'onadir.\r\nUni sotib olgan kimsa oddiy odam emas, Misrdek katta yurtning Azizi – bosh vaziri bo'lgan bir kishisidir. U odam Yusufdagi odob, axloq, oliyjanoblik, yuqori saviyadagi tarbiya va boshqa yaxshi xulqlarni ko'rib, yoqtirib qoldi. Ahli baytiga 'Bunga yaxshi qaranglar, ehtimol, o'g'il qilib olarmiz', – deb tayinladi. Alloh taolo O'z tadbiri ila Yusufni quduqdan va qullikdan qutqarib, Misr bosh vazirining qasriga, qarorgohiga olib keldi va uni alohida e'tiborga sazovor etdi. Ammo bu yerda ham Yusufni imtihon, nihoyatda katta imtihon – fitna kutar edi. Boylik, ayshu ishrat, hoyi-havas ichida yashab o'rgangan Azizning xotini yosh va go'zal Yusufga oshiq bo'lib qoldi. Oshiq bo'lganda ham, ashaddiy oshiq bo'ldi. Birdan-bir niyati Yusufga erishish bo'lib qoldi. To'qlikka sho'xlik, deb shuni aytadilar-da! Lekin tarbiya ko'rgan komil bir erkak bo'lish bilan birga, Robbidan qo'rqishni-da o'rniga qo'yadigan, haromdan hazar qiladigan Yusuf bu imtihon-sinovdan ham muvaffaqiyatli o'tdi. Azizning xotinining harom xohishi amalga oshishiga vosita bo'lmadi. Balki undan, uning siymosidagi xiyonatdan, fahsh ishdan, haromdan qochdi. Lekin bu holda ham yana tuhmatga uchradi. Yana sinov, yana imtihon, yana musibat va yana kulfat. Ularning bu holatlari ustiga kirib qolgan erini ko'rishi bilanoq xotin Yusufga tuhmat toshlarini ota boshladi. 'U sening ahlingga tajovuz qilmoqchi bo'ldi, uni hibsga ol yoki alamli azob ber!' – deya da'vo qildi. Lekin da'voni isbot qilish kerak edi. Tekshirish jarayonida ashyoviy dalillar xotinning ziddiga, Yusufning foydasiga bo'lib chiqdi. Er xotinining makr qilganini tushundi. Xotinlarning makri zo'r ekanini yana bir bor anglab yetdi.\r\nBo'lib o'tgan voqea haqida shahar ayollari o'rtasida turli mish-mishlar tarqaldi. Ular Azizning xotinini malomat qila boshladilar. Bu mish-mishlarni eshitgan Azizning xotini sergap ayollardan qasos olmoqchi bo'ldi. Ularni ziyofatga chaqirdi. Hammalariga taom ulashib, qo'llariga bittadan pichoq berdi. Yusufga ularning oldiga chiqishni buyurdi. Yusuf ularning huzuriga chiqqanda, mehmon ayollar uning husniga mahliyo bo'lib qolishdi, taomni kesaman deb, qo'llarini kesaverdilar va: 'Bu bashar emas, malak ekan-ku!' – deyishdi. Yusufning oshiqlari ko'paydi. Endi avvalgidan ham kattaroq baloga, sinovga, imtihonga yo'liqdi. Oxiri Alloh harom qilgan yo'lga yurishdan ko'ra hibsda o'tirishni afzal ko'rdi. Qamoq ham uning uchun sinov, imtihon va kelajakka tayyorgarlik bosqichi bo'ldi. U yerda ham Allohning diniga da'vat qilishni davom ettirdi. Qamoqdagilar uning fazli, ilmi, axloq-odobini ko'rib, undan hatto tushlarining ta'birini so'raydigan bo'ldilar. Alloh bergan ilm asosida tushga ta'bir aytar ekan, Yusuf da'vat ishlarini ham olib bordi. Va kelajakda bo'ladigan ishlarning ehtiyotini qilib, najot topib chiqishi umid etilgan kishiga gap tayinladi. Bir qancha muddat o'tib, xuddi kutganidek bo'lib chiqdi. Tushi o'ngidan kelib, qamoqdan chiqqan odam podshohning tushini ta'bir qilish qiyinlashib qolganda, Yusufni eslab qoldi va podshohga uni eslatdi. Qamoqdan chiqqan Yusufning ta'biri, ilmi, tadbirkorligi podshohga yoqib qoldi va uni o'ziga vazir qilib oldi.\r\nAsosiy imtihon va sinov endi boshlandi. O'ldirish uchun quduqqa tashlangan, qul qilib sotilgan, tuhmatga uchrab, qamalgan Yusuf alayhissalom Misrdek katta yurtga vazir bo'ldilar. Vazir bo'lganda ham, eng qiyin vaqtda – bir necha yil ocharchilik hukm surib, odamlarni oziq-ovqat bilan ta'minlash og'irlashgan va boshqa nozik ishlarni amalga oshirish zarurati tug'ilgan vaqtda bo'ldilar.\r\nOcharchilik faqatgina Misrga kirmagan edi. Boshqa yurtlarda, jumladan, Yusuf alayhissalomning ona yurtlarida ham o'z hukmini o'tkazardi. Shuning uchun ham Yusuf alayhissalomning akalari Misrdagi muvaffaqiyatli iqtisodiy holatdan xabar topib, najot izlab keldilar. Vazirga tahsinlar aytib, yordam so'rashdi. Lekin ular bu vazir o'zlari bir paytlar quduqqa tashlagan ukalari Yusuf ekanini bilmadilar. Yusuf alayhissalom esa ularni darhol tanidilar va yaxshi muomalada bo'ldilar. Yanagi safar kelishlarida uyda qolgan ukalarini ham birga olib kelsalar, bir tuya qo'shimcha oziq-ovqat olib ketishlari mumkinligini aytdilar. Akalari qaytib borib, otalari Ya'qub alayhissalomga bo'lgan hodisalarni gapirib berdilar va kelgusi safar kichik ukalarini qo'shib berishini so'radilar. Ammo farzand dog'i hamon qalbini o'rtayotgan ota 'Yusufni sizga ishonib topshirib, pand yeganman, endi ukasini ham so'raysizlarmi?' – dedi. Uzoq tortishuvlardan keyin ahdu paymon olib, kichik o'g'lini ham akalariga qo'shib berdi. Misr vaziri – Yusuf alayhissalom tadbir ishlatib, ukalarini o'zlari bilan birga olib qoldilar. Ya'qub alayhissalomning dardlariga dard qo'shildi. Lekin bu vaqtinchalik edi. Oldindagi katta xursandchilikka 'debocha' edi.\r\nNihoyat, Yusuf alayhissalom o'zlarining kim ekanliklarini oshkor qildilar. Akalariga ota-onalarini ham olib kelishni tayinladilar. Shunday bo'ldi ham. Hammalari – ota-ona va o'n bir o'g'il Misr vaziri Yusuf alayhissalomning huzurlariga kirib, ehtiromlarini bildirdilar. Ul zotning yoshlikda ko'rgan tushlari o'ngidan keldi.\r\nQissaning so'ngida Nabiy sollallohu alayhi vasallamga xitob qilinadi.\r\nYusuf alayhissalom qissasining muxtasar bayoni shundan iborat. Bu qissada xayoliy gaplar yo'q, lirik chekinishlar ham, o'quvchilarni qiziqtirish uchun to'qilgan yolg'onlar ham yo'q. Zero, bu Allohning vahiy qilib yuborgan Qur'onidir. Bu qissani o'qish ham, eshitish ham ibodat. Boshidan oxirigacha ibrat, va'z-nasihat. Keling, Qur'oni Karimda bu qissa qanday hikoya qilinganini o'rganib chiqaylik."
        ]
    },
    {
        "word": "Yut ",
        "type": [],
        "definition": [
            "Yut ‒ don-g'alla unmagan yil; ocharchilik, qahatchilik"
        ]
    },
    {
        "word": "Yushaʼ ibn nun alayhissalom",
        "type": [],
        "definition": [
            "Ba'zi payg'ambarlar borki, ismlari Qur'oni Karimda kelmagan bo'lsa ham, hadisi shariflarda yoki nabiylar qissalari yozilgan mo''tabar kitoblarda kelgan.\r\nShunday nabiylardan biri Yusha' ibn Nun alayhissalomdir. U zot Banu Isroilga Muso alayhissalomdan keyin rahbar bo'lganlar. Tarixchilar orasida Alloh taoloning 'Muso o'z xizmatkoriga: 'Ikki dengiz jamlangan joyga yetmagunimcha, hatto uzoq muddat sarflasam ham yuraveraman', deganini esla' (Kahf surasi, 60-oyat) degan so'zidagi xizmatkor yigit Yusha' alayhissalomdir, deganlar bor.\r\nHorun alayhissalom vafot etgach, Banu Isroil sahrodagi ma'lum hududda zoye, sargardon bo'lib, 'tiyh' holatida, ya'ni adashib-uloqib yurdi. Alloh taolo ularni jazolab, Siyno sahrosida adashib yurishni taqdir etdi. Muso alayhissalom ham o'sha paytda vafot etdilar. Mazkur holat qirq yil davom etdi. Buning zikri Muso alayhissalomning Misrda kechirgan hayotlari haqidagi qissada batafsil keladi. Muhimi shuki, Banu Isroildan kim tirik qolgan bo'lsa, Yusha' alayhissalom bilan birga 'tiyh' holatidan chiqdi. Ular Baytul maqdisga borishdi. U yerda Yusha' alayhissalom Banu Isroildan qo'shin tuzdilar. Ularni o'n ikki urug' asosida o'n ikki qismga bo'ldilar. Yusha' alayhissalom ular bilan birga borib Ariyho, so'ng Baytul maqdisni fath qilmoqchi bo'ldilar. Yusha' alayhissalom ularning ichida taxminan 27 yil Allohning kitobi – Tavrot bilan hukm yuritdilar. Yusha' alayhissalomning vafotlaridan keyin Banu Isroil yana zalolat va fisqu fasodlariga qaytishdi.\r\nUshbu oraliq davrda Arabiston yarimorolidan ko'plab kan'oniy jamoatlar kelib, Suriyada qaror topishdi. Ular Damashq, Hamo va boshqa mamlakatlarni tuzib, u yerlarga mustahkam o'rnashib qolishdi. Ular but-sanamlarga ibodat qilishgan. Eng mashhur sanamlari Ishtor ma'budasi va Adunis ma'budi bo'lgan."
        ]
    }
]