[
    {
        "word": "Zabagʻduvon",
        "type": [],
        "definition": [
            "('Sabag'duvon' deb ham aytiladi) – Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Zabur",
        "type": [],
        "definition": [
            "Dovud alayhissalomga nozil bo'lgan ilohiy kitob"
        ]
    },
    {
        "word": "Zabh ",
        "type": [],
        "definition": [
            "Bo'yni qisqa hayvonlarni boshiga yaqin joyidan pichoq solinadi va uni 'zabh' deyiladi"
        ]
    },
    {
        "word": "Zavd ",
        "type": [],
        "definition": [
            "Zavd – uchtadan o'ntagacha bo'lgan tuyalar to'pi"
        ]
    },
    {
        "word": "Zavoib",
        "type": [],
        "definition": [
            "Zavoib (birligi – zuoba) deb sochning o'sib, osilib tushib turgan qismiga aytiladi"
        ]
    },
    {
        "word": "Zavol ",
        "type": [],
        "definition": [
            "ketish, yo'qolish, behuda, abas"
        ]
    },
    {
        "word": "Zavroʻ",
        "type": [],
        "definition": [
            "Madiynai Munavvaraning bozori ichidagi shu nom bilan atalgan joy nomi. 'Zavro'' dagi bir uyning tomida azon aytilar edi."
        ]
    },
    {
        "word": "Zajnon",
        "type": [],
        "definition": [
            "Zajnon – Makkadan bir barid masofada joylashgan tog'ning nomi. Imom Zamaxshariyning aytishicha, u bilan Makka orasida yigirma besh mil masofa bor. 1 mil = 1848 metr."
        ]
    },
    {
        "word": "Zaif ",
        "type": [],
        "definition": [
            "“Zaif” so'zi lug'atda “Qoviy” – “kuchli”ning ziddi, ya'ni, “kuchsiz” deganidir. Zaif – hasan sifatini uning shartlaridan birining yo'qolishi tufayli o'zida to'liq jamlamagan narsaga aytiladi"
        ]
    },
    {
        "word": "Zayd ibn Amr ibn Nufayl",
        "type": [],
        "definition": [
            "Zayd ibn Amr ibn Nufayl – mashhur sahobiy Sa'd roziyallohu anhuning otasi, Umar ibn Xattob roziyallohu anhuning amakivachchasi. U fitrati buzilmagan, tavhidni istagan odam bo'lgan. U Rasululloh sollallohu alayhi vasallamga vahiy kelishidan besh-olti yil oldin vafot etib ketgan. U tarixiy nodir shaxslardan bo'lgani bois, hadis kitoblarida uning manoqiblari zikr qilinadi. Ibn Abu Shayba rivoyat qilgan hadisda qiyomat kuni uning o'zi bir ummat o'laroq tiriltirilishi aytilgan"
        ]
    },
    {
        "word": "Zayd ibn Arqam",
        "type": [],
        "definition": [
            "Zayd ibn Arqam Xazrajiy al-Ansoriy, kunyalari Abu Umar. Rasululloh sollallohu alayhi vasallam bilan o'n yettita jangda ishtirok etganlar. Handaq kunida avvalgilardan bo'lib qatnashganlar. Siffiyn urushida Hazrati Ali bilan bir safda kurashgan ulug' sahobalardan edilar.\r\n    Bu zot Rasululloh sollallohu alayhi vasallamdan 70ta hadis rivoyat qildilar. Hijratning 68-yilida, Imom Husayn o'ldirilgandan ko'p o'tmay, Kufada vafot etdilar."
        ]
    },
    {
        "word": "Zayd ibn Iloqa",
        "type": [],
        "definition": [
            "Zayd ibn Iloqa ibn Molik as-Sa'labiy, kunya-lari Abu Molik Kufiy. Hijratning 36-yilida tavallud topdilar.\r\n    Hadis ilmida ishonchli bo'lganlar. Hadis olimlari bu zot rivoyat qilgan hadislarni sahih, deb tan olganlar. Bu zot tobe'inlardan bo'lib, hadislarni amakilaridan, Usoma ibn Sharik, Jariyr ibn Abdulloh, Mug'iyra ibn Samuralardan rivoyat qildilar. Bu kishidan Sufyon, A'mash, Simok ibn Harb, Shayboniylar rivoyat qilganlar.\r\n    Zayd ibn Iloqa hijratning 135-yili vafot etdilar"
        ]
    },
    {
        "word": "Zayd ibn Sobit",
        "type": [],
        "definition": [
            "Zayd ibn Sobit ibn Zahhok Ansoriy al-Xazrajiy, kunyalari Abu Sa'iyddir. Rasululloh sollallohu alayhi vasallam Payg'ambar qilib yuborilganlarida bu kishi 6 yoshda edilar. O'sha yili u kishining otalari vafot etadi. Badr g'azotida qatnashmoqchi bo'lganlarida yoshlari kichkina bo'lgani sababli Rasululloh sollallohu alayhi vasallam qaytarib yuboradilar. Uhud g'azotida qatnashganlari to'g'risida ixtiloflar bor. Xandaq g'azotida qatnashib, xandaq qazish, tuproq tashish kabi ishlar bilan mashg'ul bo'ladilar. Rasululloh sollallohu alayhi vasallam buni ko'rib, 'Bu bola muncha ham yaxshi', deb marhamat qiladilar.\r\n    Zayd ibn Sobit roziyallohu anhu Rasululloh sollallohu alayhi vasallamning vahiy kotiblaridan edilar. Vahiylarni yozib olish bilan birga, yodlab ham borar edilar. Qur'onning hammasini yodlab, Rasululloh sollallohu alayhi vasallamdan o'tkazib chiqqan uch nafar ansorlarning biri edilar.\r\n    Abu Bakr va Usmon roziyallohu anhumlarga Qur'oni Karimni mushaf holatiga keltirib, yozib bergan kishi ham shu zot edilar.\r\n    Bu kishi fiqh, meros, qiroat ilmlarida yetuk olimlardan edilar. Shuning uchun Rasululloh sollallohu alayhi vasallam: 'Zayd bu ummatning ilm dengizidir', deb marhamat qilganlar.\r\n    Shuningdek, yana Rasululloh sollallohu alayhi vasallam: 'Faroiz ilmlarini ichlaringizda Zayd ibn Sobit yaxshi biladi', deb aytganlar.\r\n    Xalifa Umar roziyallohu anhu agar Madinadan haj qilishga yoki biror safarga otlansalar, Zaydni o'z o'rinlariga xalifa qilib ketar edilar. Usmon roziyallohu anhu ham shunday qilganlar.\r\n    Abdulloh ibn Abbos roziyallohu anhu u kishidan dars olar edilar. Bir kuni Zayd ibn Sobit roziyallohu anhu chiqib, otlariga minmoqchi bo'l¬sa¬lar, Ibn Abbos otning jilovidan ushlab turgan ekanlar. Zayd bundan qaytaribdilar. Shunda Ibn Abbos: 'Ulamolarimizni shunday hurmat qilishga buyurilganmiz', debdilar. Zayd esa Ibn Abbosning kaftlaridan ushlab, o'pib: 'Rasululloh sollallohu alayhi vasallamning oilalariga shunday muomalada bo'lishga buyurilganmiz', degan ekanlar.\r\n    Zayd vafot etganlarida Abu Hurayra roziyallohu anhu: 'Bugun ummatning olimi vafot etdi, shoyadki, Alloh taolo uning o'rniga Ibn Abbosni o'rinbosar qilsa edi', deb duo qilgan ekanlar.\r\n    Zayd ibn Sobit roziyallohu anhu hammasi bo'lib 92ta hadis rivoyat qildilar. Bu zotdan Ibn Umar, Ibn Abbos, Abu Hurayra, Anas ibn Molik, Sahl ibn Hunayf, Abu Sa'iyd al-Xudriy va bosh¬qa ulug' sahoba roziyallohu anhumlar rivoyat qilganlar.\r\n     Bu zot hijratning 45-yili vafot etdilar. Vafotlari munosabati bilan Rasululloh sollallohu alayhi vasallamning shoirlari Hasson ibn Sobit bu kishiga marsiya o'qidilar."
        ]
    },
    {
        "word": "Zayd ibn Xolid",
        "type": [],
        "definition": [
            "Zayd ibn Xolid Juhaniy al-Madaniy, kunyalari Abu Abdurrahmon. Madinada istiqomat qildilar. Hudaybiya kunida Rasululloh sollallohu alayhi vasallam bilan ishtirok etdilar.\r\n    Makka fath etilgan kuni Juhayni qabilasi nomidan bayroq ko'tardilar.\r\n    Zayd ibn Xolid Juhaniy Rasululloh sollallohu alayhi vasallamdan 81ta hadis rivoyat qildilar. Bu zotdan Soib ibn Yaziyd, Soib ibn Homid, Abu Harb, Ubaydulloh ibn Abdulloh ibn Utba, Ibn Musayyib va bosh¬qalar rivoyat qilganlar. Bu sahoba to'plagan hadislardan ba'zilarini uch 'Sahih' sohiblari o'z kitoblariga kiritganlar.\r\n     Zayd ibn Xolid roziyallohu anhu hijratning 78-sanasida 85 yoshlarida Madinada vafot etdilar"
        ]
    },
    {
        "word": "Zayd ibn Horisa",
        "type": [],
        "definition": [
            "Zayd ibn Horisa ibn Shurahbil al-Kalbiy, kunyalari Abu Usoma. Zayd johiliyat davrida o'g'irlanib, sotiladi. Keyinchalik uni Xadicha onamiz sotib olib, Rasululloh sollallohu alayhi vasallamga turmushga chiqqanlarida u zotga hadya qiladilar.\r\n    Rasululloh sollallohu alayhi vasallam Zayd ibn Horisani ozod qilib, o'g'il qilib oladilar va ammalarining qizlari – Zaynab binti Jahshga uylantirib qo'yadilar. Zayd Zaynabni taloq qilganlaridan keyin Rasululloh sollallohu alayhi vasallam u kishini cho'rilari Ummu Aymanga uylantirib qo'yadilar. Bu xotinlaridan Usoma ibn Zayd tug'iladilar.\r\n    Zayd ibn Horisa Islomga avvalgilardan bo'lib kiradilar. Badr, Uhud, Handaq, Xaybar janglarida ishtirok etadilar. Badr jangidagi musulmonlarning g'alabasi haqidagi xabarni Madinaga olib kelgan zot shu kishi edilar. Rasululloh sollallohu alayhi vasallam bu kishini hammasi bo'lib, yettita sariyya (qo'shin)ga amir qilib tayinlaganlar.\r\n    Rasululloh sollallohu alayhi vasallamning sahobalari ichida yolg'iz Zayd ibn Horisaning ismigina Qur'onda zikr qilingandir.\r\n    Bir kuni Zaydning otalari bilan amakilari Rasululloh sollallohu alayhi vasallamning huzurlariga o'g'illarini so'rab kelishganida Rasululloh sollallohu alayhi vasallam ixtiyorni Zaydning o'ziga tashlaydilar. Zayd esa ular bilan ketishga rozi bo'lmaydi va Rasululloh sollallohu alayhi vasallamning huzurlarida qolishni ixtiyor etadi.\r\n    Zayd ibn Horisa hijratning 8-yili, Shomda¬gi Mu'ta g'azotida 55 yoshlarida shahid bo'ldilar.\r\n    Nabiy sollallohu alayhi vasallamning mavlosi degani — ozod qilingan qullari ma'nosidadir. Zayd ibn Horisa roziyallohu anhu juda mashhur sahobiy bo'lsalar ham, faqat bitta hadisni rivoyat qilganlar, xolos."
        ]
    },
    {
        "word": "Zaulu tobaqotil qurroi liz-Zahabiy",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari"
        ]
    },
    {
        "word": "Zakariyo alayhissalom",
        "type": [],
        "definition": [
            "Zakariyo alayhissalom Horun alayhissalomning zurriyotlaridan bo'lib, Banu Isroilning nabiylaridan hisoblanadilar. Alloh taolo u zotni befarzandlik bilan sinagan edi. Ammo Zakariyo alayhissalom noumid bo'lmadilar. O'zlari va juftlarining yoshlari o'tib qolgan bo'lsa ham, sabr ila Allohdan farzand so'rayverdilar.\r\n    Alloh taolo Anbiyo surasida marhamat qiladi:\r\n    '...va Zakariyoni esla. O'shanda u Robbiga nido qilib: 'Robbim, meni yolg'iz tashlab qo'yma, Sen vorislarning eng yaxshisisan', degan edi. Bas, uni (duosini) ijobat qildik va unga Yahyoni hadya etdik hamda juftini o'nglab qo'ydik. Albatta, ular yaxshiliklarga shoshilishar edi va Bizga rag'bat ila va qo'rqib duo qilishar edi. Ular Bizga ta'zim ila bo'ysunuvchi edilar' (89–90-oyatlar).\r\n    Yahudiylarning 'Haykal' deb nomlangan asosiy ibodatxonasi xizmatlarini qilish shu avlodga nasib etgan bo'lib, Zakariyo alayhissalom o'z davrlarida ushbu ibodatxonaning boshlig'i bo'lganlar. Bu haqda Oli Imron surasida muhim xabarlar kelgan.\r\n    'Bas, uni Robbi juda yaxshi qabul qilib, nihoyatda go'zal o'stirdi va Zakariyoni unga kafil qildi. Zakariyo har qachon uning oldiga – mehrobga kirganida, uning huzurida rizq ko'rdi. 'Ey Maryam, senga bu qayerdan?' dedi. 'Bu Allohning huzuridan. Albatta, Alloh xohlagan kishisiga behisob rizq berur', dedi' (37-oyat).\r\n    Maryam ibodatxona boshlig'i Zakariyo alayhissalomning kafilliklarida alohida e'tibor ostida, izzat-ikrom bilan o'sib-ulg'aydi. Alloh taolo unga O'zi inoyat ko'rsatib turdi.\r\n    Tabiiyki, Zakariyo alayhissalom Maryamning kafili sifatida uning oziq-ovqati, rizqidan doimo xabardor bo'lib turishlari lozim. Lekin ibodatxona mehrobida ibodat bilan mashg'ul bo'lib turgan Maryamning oldiga qachon kirsalar, uning huzurida rizq turar edi. Bu rizqni o'zi keltirmaganini yaxshi bilgan Zakariyo alayhissalom ajablanib, Maryamga: 'Ey Maryam, senga bu qayerdan?' dedi'.\r\n    Payg'ambar Zakariyo alayhissalomni-ki taajjubga solibdimi, demak, u rizqning manbai albatta e'tiborga loyiqdir.\r\n    Maryam esa bu manbadan xabardor, shuning uchun bamaylixotir:\r\n    'Bu Allohning huzuridan. Albatta, Alloh xohlagan kishisiga behisob rizq berur', dedi'.\r\n    Bu manzarani ko'rib turib, befarzand yurgan Zakariyo alayhissalomda farzandli bo'lish havasi yangidan uyg'ondi:\r\n    'Shu choqda Zakariyo Robbiga duo qilib: 'Robbim, menga O'z huzuringdan pokiza zurriyot hadya et. Albatta, Sen duoni eshituvchisan', dedi' (38-oyat).\r\n    Zakariyo alayhissalom Alloh taoloning duolarni eshituvchi Zot ekaniga to'la ishonch, chin ixlos bilan duo qildilar. Shuning uchun ham, odatda befarzand katta yoshdagi kishilarning farzand ko'rishi ehtimoldan yiroq bo'lsa-da, Alloh taolo bu duoni qabul etdi.\r\n    'Mehrobda namoz o'qib turganida farishtalar unga: 'Albatta, Alloh senga Allohdan bo'lgan 'kalima'ni tasdiqlovchi, peshvo, shahvati tiyilgan, nabiy hamda solihlardan bo'lgan Yahyoning xushxabarini bermoqda', deb nido qildilar' (39-oyat).\r\n    Zakariyo alayhissalomning chin dildan qilgan duolari qabul bo'ldi. Allohning farishtalari kelib, u zotga suyunchilik xabarini yetkazdilar.\r\n    Alloh taolo Zakariyo alayhissalomga o'g'il farzand berishni iroda qildi. Oyatda Yahyo ismli bo'lajak farzand solih payg'ambarlardan bo'lishining bashorati qilinmoqda.\r\n    Abu Hurayra roziyallohu anhudan rivoyat qilinadi:\r\n    'Nabiy sollallohu alayhi vasallam: 'Zakariyo alayhissalom najjor (duradgor) bo'lgan edi', dedilar'.\r\n    Muslim rivoyat qilgan.\r\n    Tarixchilarning ta'kidlashlaricha, Zakariyo alayhissalomni Banu Isroilning hukmdorlari arralab o'ldirishgan."
        ]
    },
    {
        "word": "Zakot ",
        "type": [],
        "definition": [
            "'Zakot' so'zi lug'atda 'poklik' va 'o'sish' ma'nolarini bildiradi. Shar'iy istilohda: 'Zakot maxsus moldan, maxsus juzni maxsus shaxsga Allohning roziligi uchun shariatda tayin qilinganidek mulk qilib berishdir'. Endi ushbu umumiy ta'rifdagi istilohlar bilan tanishib olaylik; 'Maxsus mol' deyilgani nisobga yetgan moldir. 'Maxsus juzni' deyilgani o'sha berilayotgan mol beruvchining mulkidan ajrab chiqishi kerakligidir. Misol uchun, bir kishiga 'Ushbu uyda bir yil o'tirib turishing senga zakot', deb bo'lmaydi. 'Maxsus shaxs' 'zakot olishga haqli shaxs' degani. 'Allohning roziligi uchun' degani ibodat niyati bilan zakot berilishi kerakligidir. 'Shariat tayin qilgan' deyilganning ma'nosi shuki, zakot chiqarish miqdori shariatda ko'rsatilgan miqdorga to'g'ri kelishi kerak. Ozgina sadaqa berib, shu zakot, deb bo'lmaydi. 'Mulk qilib berish', deyilgani o'sha berilayotgan mol oluvchiga mulk bo'lmaguncha zakot hisoblanmaydi, deganidir."
        ]
    },
    {
        "word": "Zalzala surasi",
        "type": [],
        "definition": [
            "Madinada nozil bo'lgan. 8 oyatdan iborat.\r\n    Ushbu surai karimaning ismi ham uning birinchi oyatidan olingan. 'Zalzala' – 'zilzila' deganidir. Bu yerda qiyomat qoim bo'lgandagi ulkan zilzila haqida so'z ketadi.\r\n    Bu surai karima qiyomat kunidagi ba'zi voqealarning vasfi bilan boshlanadi. So'ng odamlarning qayta tirilishi va hisob-kitob haqida so'z ketadi. Imom Termiziy rivoyat qilgan hadisda Nabiy sollallohu alayhi vasallam: 'Izaazulzilat surasi Qur'onning yarmiga teng keladi', – deganlar."
        ]
    },
    {
        "word": "Zalolat ",
        "type": [],
        "definition": [
            "haqiqatdan yuz o'girish, gumrohlik, haqiqiy e'tiqoddan adashish, aynish. Hidoyatning qarama-qarshisi."
        ]
    },
    {
        "word": "Zam sura qilish",
        "type": [],
        "definition": [
            "'Zam qilish' degani 'ortidan qo'shish' ma'nosini bildiradi. Bu ibora namozda 'Fotiha' surasi qiroati ortidan yana bir sura yoki ba'zi oyatlarni o'qishga ishlatiladi. Ana shu amal namozdagi vojib amallardan biridir."
        ]
    },
    {
        "word": "Zamzam",
        "type": [],
        "definition": [
            "Makka shahridagi Masjidi Harom sahnidagi, Ka'ba yonidagi muqaddas buloq."
        ]
    },
    {
        "word": "Zamma",
        "type": [],
        "definition": [
            "arab harflarining tepa qismiga qo'yiladigan harakat. “U” tovushi bilan o'qiladi"
        ]
    },
    {
        "word": "Zandarmitan",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan."
        ]
    },
    {
        "word": "Zaranjariy",
        "type": [],
        "definition": [
            "('Zarangariy' deb ham aytiladi) – Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Zarvon ",
        "type": [],
        "definition": [
            "'Zarvon' – quduqning nomi. Shorihlarning aytishicha, aslida uning nomi 'Zu Arvon' bo'lgan, keyin tilga moslashib, 'Zarvon' bo'lib ketgan"
        ]
    },
    {
        "word": "Zarira",
        "type": [],
        "definition": [
            "Zarira – xushbo'ylikning bir turi. U shu nomli o'simlikdan olingan. Zarira qamishi (calamus) Hindistonda yetishtiriladigan boshoqdoshlarga mansub, qamishsifat dorivor o'simlik va uning hosili bo'lib, o'zidan xushbo'y hid taratadi va xushbo'ylik sifatida ishlatiladi, sovun, atirlarga qo'shiladi. Kukuni ham xushbo'ylik sifatida ishlatilgan"
        ]
    },
    {
        "word": "Zarnab ",
        "type": [],
        "definition": [
            "Zarnab – xushbo'y o'simlik"
        ]
    },
    {
        "word": "Zarʼayna",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Zatush-shifa fiy sirotil mustofa va man baʼdahu minal xulafa",
        "type": [],
        "definition": [
            "Imom Muhammad ibn Jazariy rahmatullohi alayhining tarix va manoqib bo'yicha kitoblari"
        ]
    },
    {
        "word": "Zafor ",
        "type": [],
        "definition": [
            "Zafor – Yaman qishloqlaridan biri, ba'zi rivoyatlarda Azfor deb ham kelgan"
        ]
    },
    {
        "word": "Zaʼfaron",
        "type": [],
        "definition": [
            "'Za'faron' sariq rangli o'simlik bo'lib, u ko'proq xushbo'y narsa sifatida kiyimlarga surtilgan."
        ]
    },
    {
        "word": "Zehk",
        "type": [],
        "definition": [
            "Kulganda ovozni o'zi eshitib boshqa eshitmasa 'zehk' deyiladi va bunday kulgu ila namoz buziladi-yu, toharat buzilmaydi."
        ]
    },
    {
        "word": "Zibadvon",
        "type": [],
        "definition": [
            "Buxoro qishloqlaridan"
        ]
    },
    {
        "word": "Ziyorat",
        "type": [],
        "definition": [
            "biror yerga, muqaddas joylarga, mozor va qabristonlarga yoki shaxs huzuriga borish"
        ]
    },
    {
        "word": "Ziyouddin Abdulloh ibn Saʼdulloh ibn Muhammad ibn Usmon Qazviniy",
        "type": [],
        "definition": [
            "Bu zot ham katta olim bo'lgan, juda ko'plab shogirdlarni tarbiyalagan. Ularning ichida Allomai Taftazoniy rahmatullohi alayhi ham bo'lgan."
        ]
    },
    {
        "word": "Zikr",
        "type": [],
        "definition": [
            "Xudoni esga olish, yodga olish, eslash, yodlash; xotira"
        ]
    },
    {
        "word": "Zimmadorlik shirkati",
        "type": [],
        "definition": [
            "Moli ham, ishi ham yo'q shaxslar sherik bo'lib barobar narsani nasiyaga olib, o'shani ishlatib tushgan foydasini bo'lib olish bilan shug'ullanadi."
        ]
    },
    {
        "word": "Zimmiy ",
        "type": [],
        "definition": [
            "Islom davlati soyasida yashayotgan musulmon bo'lmagan odam 'zimmiy' deb ataladi"
        ]
    },
    {
        "word": "Zindiq ",
        "type": [],
        "definition": [
            "Allohga ishonmaydigan, mo'minning ziddi"
        ]
    },
    {
        "word": "Zino",
        "type": [],
        "definition": [
            "buzuqlik, fahsh, zinokorlik, erkak va ayolning shar'iy nikohsiz jinsiy aloqada bo'lishi."
        ]
    },
    {
        "word": "Ziroʻ",
        "type": [],
        "definition": [
            "Ziro' – qadimgi uzunlik o'lchovlaridan bo'lib, o'rta bo'yli odamning tirsagidan barmoq uchigacha bo'lgan oraliqqa qiyosan olingan. Ziro' bugungi o'lchovda 46,2 smga to'g'ri keladi."
        ]
    },
    {
        "word": "Zirr ibn Abdulloh",
        "type": [],
        "definition": [
            "Zirr ibn Abdulloh – asli kufalik. U kishi Qutayba ibn Muslim al-Bohiliy bilan birga Buxoroga kelib qolganlar va shu yerda yashab, bola-chaqali bo'lganlar"
        ]
    },
    {
        "word": "Zirr ibn Hubaysh",
        "type": [],
        "definition": [
            "Zirr ibn Hubaysh ibn Habasha ibn Avs al-Asadiy. Ulug' tobe'inlardan bo'lib, johiliyatda ham, Islomda ham yashadilar, lekin Rasululloh sollallohu alayhi vasallamni ko'rmadilar.\r\n    U kishi Qur'on olimi va fozil zotlardan edilar. Hatto Ibn Mas'ud ham arab tili haqida shu zotdan so'rar edilar.\r\n    Zirr ibn Hubaysh roziyallohu anhu Kufada istiqomat qildilar. 120 yil umr ko'rdilar.\r\n    U zot hijratning 83-yili Jamojim voqeasida vafot etdilar.\r\n    Zirr ibn Hubaysh roziyallohu anhu hadislarni Umar ibn Xattob, Usmon ibn Affon, Ali ibn Abu Tolib, Abu Zarr, Ibn Mas'ud, Abdurrahmon ibn Avf, Abbos, Ubay ibn Ka'b, Safvon ibn Assol, Oisha onamiz roziyallohu anhumolardan rivoyat qildilar."
        ]
    },
    {
        "word": "Zihor",
        "type": [],
        "definition": [
            "'Zihor' so'zi 'zohr' o'zagidan olingan bo'lib, insonning orqa (bel) tomoniga aytiladi. Shariatda esa erning o'z xotiniga: 'Sen men uchun onamning orqa (bel) tomoni kabisan', deyishiga zihor deyiladi. Bu gap 'Xotinim onamdek bo'lsin', to'g'rirog'i, 'Xotinim menga onam kabi harom bo'lsin', degan ma'noni anglatadi. 'Muxtasari Viqoya'ning sohibi zihorni quyidagicha ta'riflaydi: Xotinning taloq nisbat bersa bo'ladigan narsasini (a'zosini) o'z mahramining qarash harom bo'lgan bir ¬a'zosiga o'xshatish zihordir. Musulmon erkak o'z xotinini yoki uning asosiy a'zolaridan birini nasab, qudachilik va emikdoshlik yo'li bilan nikohi o'ziga abadiy harom bo'lgan ayolning nazar solish harom bo'lgan a'zolaridan biriga o'xshatsa, zihor qilgan bo'ladi. Zihor kafforat berilguncha ayolga yaqinlikni va shunga oid ishlarni harom qiladi. Ya'ni xotinidan zihor qilgan odam kafforat bermay turib uni ushlashi, quchoqlashi, o'pishi va u bilan jinsiy yaqinlik qilishi haromdir. Bu hukmning dalili va sharhi Qur'oni Karimda bayon qilingan."
        ]
    },
    {
        "word": "Zobb",
        "type": [],
        "definition": [
            "Zobb – sudralib yuruvchi o'txo'r hayvonlardan bo'lib, issiq o'lkalarda yashaydi. Echkemarga o'xshash bo'lgani uchun uning nomi ba'zi tarjimalarda xato ravishda echkemar yoki kaltakesak deb o'girilgan. Zobb Arabiston yarim orolida ko'p uchraydi. Uzunligi 85 sm.gacha bo'ladi. Ko'rinishi va shakli xunuk, boshi kichkina, bo'yni kalta, dumi uzun, rangi qoramtir kulgang. Semirsa, ko'kragi sarg'ayadi. Tuxumini qumga ko'yadi. Tuxum qo'yganidan qirq kun o'tib, bola ochadi. O'simliklar bilan oziqlanadi. Arablar uni ovlashga va tanovul qilishga o'ch bo'lishadi. Hozirda Arabiston yarim orolidagi ba'zi bozorlarda zobb tirigicha kilolab sotiladi. Uning go'shti tansiq taomlardan sanaladi. Uning ilmiy nomi – uromastyx aegyptia"
        ]
    },
    {
        "word": "Zobt",
        "type": [],
        "definition": [
            "'Zobt' so'zi lug'atda bir narsani mahkam ushlab qolishni ifoda etadi. Ulamolar istilohida esa, 'Roviy o'zi rivoyat qilgan hadisni g'oyat mahkam ushlashi lozim' deganidir. Bu esa, ikki yo'l bilan hosil bo'ladi.\r\n    Birinchisi – xohlagan vaqtda hadisni aniq va ravshan, bir xilda aytib bera olishi kerak.\r\n    Ikkinchisi – hadisni turli kamchiliklardan saqlagan bo'lishi kerak."
        ]
    },
    {
        "word": "Zod",
        "type": [],
        "definition": [
            "'Zod' deganda hajga borib kelguncha yetadigan maiyshat(yeyish-ichish va kiyish) uchun kerakli sarf-xarajat tushuniladi."
        ]
    },
    {
        "word": "Zoriyot surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 60 oyatdan iborat.\r\n    Bu surai karima o'ziga xos uslubga va nozil bo'lish sharoitiga ega. Uning boshlanishida Alloh taolo to'rt narsa bilan qasam ichadi. Odatda, bu narsalar, ularning ushbu oyatlarda zikr qilinayotgan nomlari tanilgan emas. Shuning o'zi ajoyib bir holatni vujudga keltiradi, o'quvchi va eshituvchida sirlilik va ahamiyati beqiyos bir ishning ostonasida turganlik hissini uyg'otadi. Bu sura Makkiy suralardan bo'lgani uchun, o'zida ularning vasflarini va maqsadlarini mujassamlashtirgan. U Islom aqiydasi asoslarini bayon qiladi. Iymonning mustahkam bo'lishini ta'kidlaydi. Shuningdek, vahiy, payg'ambarlik, qiyomatdagi hisob-kitoblar haqida so'z ketadi.\r\n    Suraning asosiy mavzusi Allohning yagonaligi, yaratuvchi, rizq beruvchi, borliqdagi har bir ishning tasarrufini qiluvchi Zot ekani to'g'risidadir. Shu bilan birga, ushbu sura Allohning qudratiga dalolat beruvchi ba'zi narsalar haqida ham so'z yuritadi.\r\n    Zoriyot surasida payg'ambarlar – Ibrohim, Lut, Muso, Nuh, Hud va Solih alayhissalomlarning qissalari juda ham muxtasar holda beriladi. Bu bilan hamma payg'ambarlarning da'vatlari bir bo'lganiga, ya'ni odamlarga Allohni tanitish, qalblarini Uning ibodati uchun poklash ekaniga ishora qilinadi.\r\n    Surai karima insonlaru jinlarning yaratilishidan haqiqiy murod Allohga ibodat qilish ekanini qat'iy ta'kidlash hamda dinsizlarning oxir-oqibat ko'rajak azoblari to'g'risidagi xabar bilan tugallanadi."
        ]
    },
    {
        "word": "Zotiljam",
        "type": [],
        "definition": [
            "Zotiljam – 'Zotul janb' atamasi ilgari ikki xil kasallikka nisbatan ishlatilgan. Birinchisi: hozirda tushuniladigan, o'pkaning qattiq shamollashi, ya'ni pnevmoniya. Ikkinchisi esa: ko'krak qismida noxush hid hosil qiladigan, og'riqli kasallik. Tabiblar tilida zotiljam deganda birinchi tur, ya'ni pnevmoniya tushuniladi. Ushbu boblarda kelgan hadislarda esa ikkinchi tur nazarda tutilgan."
        ]
    },
    {
        "word": "Zotuljaysh ",
        "type": [],
        "definition": [
            "Zotuljaysh – Madina bilan Xaybar oralig'idagi joyning nomi"
        ]
    },
    {
        "word": "Zotun-nitoq",
        "type": [],
        "definition": [
            "'Zotun-nitoq' – 'belbog' sohibasi' degani. Rasululloh sollallohu alayhi vasallam Abu Bakr Siddiq roziyallohu anhu bilan hijratga otlanganlarida Asmo roziyallohu anho ozuqa xurjunining og'zini o'z belbog'i bilan bog'lab bergan va shuning uchun mazkur laqabni olgan. Bu haqda oldingi hadislarda ham aytib o'tilgan"
        ]
    },
    {
        "word": "Zohid",
        "type": [],
        "definition": [
            "Alloh roziligi uchun dunyoni tark qiluvchi, tarkidunyo qilgan kishi; bee'tibor, moddiy manfaatga befarq bo'luvchi"
        ]
    },
    {
        "word": "Zohir",
        "type": [],
        "definition": [
            "ochiq-oydin, aniq"
        ]
    },
    {
        "word": "Zohir al-Mugʻkoniy",
        "type": [],
        "definition": [
            "Abu G'olib Zohir ibn Abdulloh al-Mug'koniy - to'g'ri va ishonchli hadislarni rivoyat qiluvchi olimlardan edilar. Tafsir ilmini Abd ibn Humayd al-Keshiydan to'liq o'rganganlar. Iroq, Kufa, Xuroson, Movarounnahr olimlaridan ta'lim olganlar. O'zlaridan esa Ali ibn Hasan al-Faqih as-Samarqandiy hadis rivoyat qilganlar. Hijriy 321 (milodiy 934) yilda vafot etganlar."
        ]
    },
    {
        "word": "Zohiriy",
        "type": [],
        "definition": [
            "tashqi belgilar; tashqaridagi, tashqi, sirtqi. Qur'on ta'limotini aynan tushunuvchi va so'zma-so'z talqin qiluvchi oqim tarafdorlari"
        ]
    },
    {
        "word": "Zohirur rivoya",
        "type": [],
        "definition": [
            "Imom Abu Hanifa, Abu Yusuf va Muhammad ibn Hasan Shayboniyning kuchli qavllari;\r\n    Hanafiy mazhabidagi birinchi darajadagi kitoblar"
        ]
    },
    {
        "word": "Zu tuvo",
        "type": [],
        "definition": [
            "Zu Tuvo – Makka yaqinidagi vodiy"
        ]
    },
    {
        "word": "Zulkifl alayhissalom",
        "type": [],
        "definition": [
            "Zulkifl alayhissalom Ayyub alayhissalomning o'g'illaridir. Bu zot haqlarida Qur'oni Karimning ikki joyida qisqagina ma'lumot kelgan. Qur'onda ham, hadisda ham Zulkifl alayhissalom haqlarida bundan boshqa hech qanday ma'lumot yo'q.\r\n    Shuning uchun o'sha ma'lumotlar joy olgan Qur'oni Karim oyatlarini o'rganish ila kifoyalanamiz.\r\n    Alloh taolo Anbiyo surasida quyidagilarni aytadi:\r\n    '...va Ismoil, Idris va Zulkiflni (esla). Ularning har biri sabr qiluvchilardandir' (85-oyat).\r\n    Ta'kidlaganimizdek, Zulkifl alayhissalom haqlarida ma'lumotlar oz. Anbiyo surasida mashhur payg'ambarlar bilan birga zikr etilishlari u zotning payg'ambarlardan bo'lganlarini ko'rsatadi. Shu bilan birga, ushbu oyatda u zot ham sabr qiluvchilar qatoriga qo'shilmoqdalar.\r\n    '...va ularni O'z rahmatimizga kiritdik. Ular solihlardandir' (86-oyat).\r\n    Sabrlari tufayli Alloh taolo ularni O'z rahmatiga kiritdi, yaxshiliklar ato etdi. Ular ahli solihlardan bo'ldilar. Shuning uchun ham Qur'onda zikr qilinmoqdalar.\r\n    Alloh taolo Sod surasida marhamat qiladi:\r\n    'Ismoil, Al-Yasa' va Zulkiflni ham esla. Barchalari axyorlardandir' (48-oyat).\r\n    Bu uch payg'ambarning hayotlarida ham eslashga loyiq ibratli hodisalar bo'lib o'tgan. Ular ham Allohning huzurida axyorlardan – eng yaxshi bandalardan bo'lganlar.\r\n    Ana shu payg'ambarlarning hayotlarida, din yo'lidagi fidokorliklarida, balo-ofatlarga, mashaqqatlarga sabrlarida, turli sinovlarga bardosh berishlarida, mushriklar va munofiqlardan kelgan ozorlarni ko'tara bilishlarida ko'plab ibratlar bor"
        ]
    },
    {
        "word": "Zulxalasa",
        "type": [],
        "definition": [
            "'Zulxalasa' Yamandagi Xas'am, Bajila, Davs va yana boshqa bir qator qabilalarning ibodatxonasi bo'lib, uni 'Yamaniy Ka'ba' deb da'vo qilishar va u yerda 'Xalasa' degan sanamga ibodat qilishar edi (hozir bu yer Saudiya Arabistoni hududiga kiradi). Uni nasroniylarning ko'rsatmasiga ko'ra qurishgan bo'lib, ular Yamanni bosib olishgach, arablarning Ka'baga borib haj qilayotganlarini ko'rib, uning o'rniga shu yerning o'ziga ibodatxona qurishni maslahat berishgan edi. Bu ibodatxonadagilar juda ko'p odamlarni turli xil hiyla-nayranglar bilan yo'ldan adashtirar, kishilarni aldab pullarini o'zlashtirar, folbinlik bilan shug'ullanar edi. Qolaversa, Zulxalasa oddiy ibodatxona emas, balki 'Ka'ba' degan da'vo bilan qilingan, biror ilohiy topshiriq olgan shaxs tarafidan emas, balki uydirmachi qalloblar o'zlaricha qurib olgan ibodatxona edi va jamiyat sofligiga, birdamligiga rahna solib turgan edi. Shu bois, Rasululloh sollallohu alayhi vasallam o'sha yurtning kattalaridan bo'lgan Jarir roziyallohu anhuga uni buzib tashlashni buyurganlar. U kishi borib, ularni Islomga, insofga chaqiradi, ko'nishmagach, ularni o'ldiradi"
        ]
    },
    {
        "word": "Zulhulayfa",
        "type": [],
        "definition": [
            "Zulhulayfa – Madinai Munavvara yaqinidagi joy. Hozirda 'Abyaru Aliy' deb ataladi. Madina tarafidan keladigan hojilar uchun miyqot hisoblanadi. Makka bilan Zulhulayfaning orasi 410 km."
        ]
    },
    {
        "word": "Zul-yadayn",
        "type": [],
        "definition": [
            "Zul-yadayn' – ikki qo'l sohibi, ya'ni uzunqo'l"
        ]
    },
    {
        "word": "Zumar surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 75 oyatdan iborat.\r\n    'Zumar' so'zi 'zumra' so'zining ko'pligi bo'lib, 'guruhlar' degan ma'noni anglatadi. Ushbu suraning oxirrog'ida farishtalarning mo'minlarni jannatga, kofirlarni do'zaxga zumralar holida, ya'ni jamoa-jamoa qilib olib borishlari tavsiflanadi. O'sha vasfda kelgan 'zumar' so'zi suraga nom bo'lib qolgan.\r\n    Tavhid – Alloh taoloning yakkayu yolg'izligi masalasi surai karimaning avvalidan oxirigacha batafsil va turli uslublar ila muolaja qilinadi. Sura o'zining xitoblari, nidolari, misollari va boshqa uslublari bilan inson qalbini larzaga soladi, unga tavhidni jo etadi. Shuningdek, tavhid haqidagi har bir shubhani rad qilishga urinadi. Chunki tavhid iymonning ham, har bir solih amalning ham asosidir.\r\n    Surai karimaning avvalida Payg'ambarimiz Muhammad sollallohu alayhi vasallamning ulkan mo''jizalari – Qur'oni Karim haqida so'z ketadi. Shuningdek, Rasuli Akram sollallohu alayhi vasallamga Allohning dinida ixlos ila bardavom bo'lish buyuriladi. Alloh subhanahu va taoloni maxluqotlarga o'xshatishdan uzoqda bo'lish lozimligi ta'kidlanadi. Mushriklarning 'Alloh huzurida bizga shafoatchi bo'ladi', deb butlarga sig'inishlari noto'g'ri ish ekani bayon etiladi.\r\n    So'ngra Alloh subhanahu va taoloning vahdoniyatiga hujjat va dalillar keltiriladi. Jumladan, osmonlaru yerning yaratilishi, kechayu kunduzning almashinishi va sayyoralarning sayr etib yurishi haqida gap ketadi.\r\n    Keyin esa mazkur dalil keltirish borasida borliqdan insonga o'tiladi, uning onasi rahmida yaratilish jarayoni Alloh taoloning vahdoniyati va qudratiga dalil sifatida keltiriladi.\r\n    Keyin surada aqiyda masalasi muolaja qilinib, kofirlar oxiratning turli azoblarini totishlari ta'riflanadi.\r\n    Zumar surasi yagona Allohga ibodat qilish lozimligini ochiq-oydin ko'rsatib beradi va kishilarni fursat borida Alloh taologa tavba qilib qolishga chaqiradi.\r\n    Suraning oxirida qiyomat qo'pganda, dudga bir puflash bilan hamma o'lib, yana bir puflash bilan yana hamma qayta tirilishi, undan keyingi bo'ladigan dahshatlar, hashr maydoni voqealari haqida so'z ketadi. Mo'minlarni jamoat-jamoat qilib jannatga, kofirlarni esa to'p-to'p qilib, do'zaxga olib borish vasf qilinadi. Nihoyat, payg'ambarlar, siddiqlar, shahidlar, yaxshi bandalar va butun mavjudot Allohga xushu' va xuzu' ila hamdu sano aytishi keltiriladi."
        ]
    },
    {
        "word": "Zutt",
        "type": [],
        "definition": [
            "Zutt – bo'ydor, qoramag'iz kishilar toifasi"
        ]
    },
    {
        "word": "Zuxruf surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 89 oyatdan iborat.\r\n    'Zuxruf' so'zi 'bezak', 'ziynat'degan ma'nolarni anglatadi. Ushbu surai karimaning oyatlaridan birida bu dunyo hayotining bor-yo'q matohi 'zuxruf'ga – behuda bezak, zebu ziynatga o'xshatiladi. Suraning nomi o'sha oyatdan olingan.\r\n    Ma'lumki, Qur'oni Karim nozil bo'lishi paytida insoniyat turli-tuman bid'at-xurofot, buzuq aqiydalar va noto'g'ri tasavvurlar botqog'ida yashar edi. Alloh taolo Payg'ambarimiz hazrati Muhammad sollallohu alayhi vasallamga Qur'oni Karimni nozil qila boshlagach, ya'ni kishilarni tavhid dini bo'lmish Islomga amal qilishga, sof iymon va ixlos ila yolg'iz Alloh taologa bo'ysunishga amr etganidan so'ng mazkur bid'atlarning yo'li to'sildi. Alloh taolo O'zi nozil qilgan oyatlar vositasi ila o'sha xurofotlarni asta-sekin muolaja qilishga kirishdi. Albatta, yillar, avlodlar davomida kishilar ongiga o'rnashib qolgan bid'atlarni ko'chirib tashlab, o'rniga yangisini qo'yish oson emas edi. Mushriklar ota-bobolaridan meros qolgan e'tiqod va urf-odatlariga mahkam yopishib olib, qur'oniy aqiydalarga qarshi jon-jahdlari bilan kurashar edilar. Qur'on esa, o'z navbatida ularning noto'g'ri tasavvurlarini mantiq asosida, turli misollar bilan fosh etar, ilohiy amr zaminidagi e'tiqodning sodda va ravshan ekanini bayon qilardi.\r\n    Zuxruf surasi ham boshqa makkiy suralar kabi, iymon, e'tiqod masalalarini muolaja etib, mazkur noto'g'ri tushunchalarni o'nglashga urinadi.\r\n    Suraning avvalida vahiyning haqiqiy masdari bo'lgan Qur'onning ilohiy kalom ekani aytiladi.\r\n    So'ngra Alloh taoloning Biru Borligiga, har bir narsaga qodirligiga dalolat qiluvchi – osmonlaru yer, tog'u toshlar, dengizlar, osmondan tushgan suv, suv ustida yuruvchi kemalar, insonga beminnat berib qo'yilgan hayvonlarning yaratilishi haqida so'z ketadi. Qizig'i shundaki, ularni kim yaratganligi borasidagi savolga mushriklar ham 'Alloh yaratgan', deb javob berganlar. Lekin, ayni chog'da, ular Allohga emas, o'z qo'llari bilan yasab olgan haykal va but-sanamlarga ibodat qilganlar. Bu esa aqliy jihatdan bir-biriga mutlaqo zid holatdir. Zuxruf surasi aynan ushbu holatni muolaja qiladi. Bunga mushriklarning 'Farishtalar Allohning qizlaridir' degan e'tiqodlari misol qilib olinadi va bu aqiydaning naqadar esipastlik ekani batafsil tushuntiriladi.\r\n    So'ngra o'tgan payg'ambarlardan Ibrohim alayhissalomning risolatlari eslatiladi. Ma'lumki, Makka mushriklari, biz Ibrohim alayhissalomning dinidamiz, millatidamiz, u kishining merosxo'rimiz, deb da'vo qilar edilar. Xo'sh, ular Ibrohim alayhissalomga ergashayotgan bo'lsalar, u zot chaqirgan yo'lda yuryaptilarmi? Surada Ibrohim alayhissalomning hech qachon mushrik bo'lmaganlari, butu sanamlardan birinchi bo'lib voz kechgan, ularga qarshi kurashgan zot bo'lganliklari ta'kidlanadi.\r\n    Zuxruf surasida mushriklarning Payg'ambar shaxsi xususidagi noto'g'ri tasavvurlari ham muolaja qilinadi. Mushriklar Muhammad sollallohu alayhi vasallamdek faqir va kamtar insonning payg'ambar bo'lishlarini tasavvurlariga sig'dira olmas edilar. Ularning fikricha, payg'ambar boy-badavlat va as'asayu dabdabali odam bo'lishi kerak edi. Surada Alloh taolo kimni payg'ambar qilib tanlashini O'zi bilishi bayon qilinadi. Shuningdek, mushriklar mezonidagi molu dunyo, turli dabdabalar inson qadrining o'lchovi bo'la olmasligi, Allohningg nazdida dunyo va uning jamiki zebu ziynatlari sariq chaqachalik turmasligi, uni Alloh taolo hammaga, hatto kofir, osiy va munofiqlarga ham beraverishi ta'kidlanadi.\r\n    Ushbu haqiqatning dalili sifatida Muso alayhissalom va Fir'avn qissasi keltiriladi. Molu dunyosi, saltanati va martabasi ila kerilib, Muso alayhissalomdan o'zini yuqori tutgan zolim Fir'avnning oqibati esga olinadi.\r\n    Suraning oxirida qiyomat shiddatlari, oxirat azoblari va do'zaxiylarning holi bayon qilinadi."
        ]
    },
    {
        "word": "Zuhd ",
        "type": [],
        "definition": [
            "tarki dunyo qilmoq"
        ]
    },
    {
        "word": "Zuho – choshtgoh namozi",
        "type": [],
        "definition": [
            "Bu namoz ikki rak'atdan sakkiz rak'atgacha bo'ladi. Ammo Rasululloh sollallohu alayhi vasallam ko'pincha to'rt rak'at o'qiganlar. Uning vaqti quyosh nayza bo'yi ko'tarilgandan boshlab to zavolga yaqin qolgunchadir. Eng afzal vaqti nahorning to'rtdan biri o'tgandan keyindir."
        ]
    },
    {
        "word": "Zuho surasi",
        "type": [],
        "definition": [
            "Makkada nozil bo'lgan. 11 oyatdan iborat.\r\n    Ushbu surai karimaga ham o'zining birinchi so'zi nom bo'lib qolgan. 'Zuho' – 'choshgoh payti' degan ma'noni anglatadi. Alloh taolo bu surani zuho ila qasam ichib boshlab, O'z Payg'ambari Muhammad sollallohu alayhi vasallamga g'azab ham qilmaganini va u zotni tark ham etmaganini ta'kidlaydi.\r\n    Ushbu surai karimaning nozil bo'lish sababi haqidagi rivoyatlarda kelishicha, Payg'ambarimizdan bir muddat vahiy uzilib qolgan. Ya'ni Jabroil alayhissalom Qur'on oyatlarini olib kelmay qolganlar. Bundan Nabiy alayhissalom tashvishga tushib, mahzun bo'lganlar. Dushmanlar esa darrov 'Muhammadning Robbi unga g'azab qildi, uni tark etdi', deb gap tarqatishgan. Shunda Alloh taolo bu surai karimani Muhammad alayhissalamning o'zlariga xos qilib nozil etgan. Bu surada avvalidan oxirigacha Nabiy alayhissalomga xitobni, u zotga Alloh taolo qilgan marhamatlarning sanog'ini, u zotning sharaflanishini va ulug'lanishini ko'ramiz.\r\n    Alloh taolo Zuho surasini choshgoh va tunning sukunatga cho'mishi ila qasam ichib boshlaydi va O'z Payg'ambari Muhammad sollallohu alayhi vasallamning qadr-qiymatlari ulug'ligini alohida ta'kidlaydi.\r\n    So'ngra Nabiy sollallohu alayhi vasallamga oxiratda beriladigan narsalarning bashorati beriladi.\r\n    Keyin esa u zot sollallohu alayhi vasallam kichikliklarida yetim va faqir bo'lganlari, Alloh taolo O'z rioyati va inoyati ila u zotni bu hollardan olib chiqqani eslatiladi.\r\n    Suraning nihoyasida esa u zot sollallohu alayhi vasallamga mazkur uch narsa muqobiliga uch narsa: yetimga mehribonlik qilish, soilga qo'pol muomala qilmaslik va O'z Robbi ne'mati haqida so'zlash tavsiya etiladi."
        ]
    }
]