[
    {
        "word": "Abak",
        "type": [],
        "definition": [
            "Qadimgi greklar va rimliklarning, tasmalarga ajratilgan taxtacha ko‘rinishidagi sanoq vositasi. Sanashda toshchalar yoki tayoqchalar tasmalar bo‘ylab siljitilib, sonlarning razryadlari aniqlanardi. Cho‘tlar kashf qilinishi bilan ahamiyatini yo‘qotdi."
        ]
    },
    {
        "word": "Abonent",
        "type": [],
        "definition": [
            "Kompyuter tarmog‘i xizmatlaridan foydalanish huquqi va imkoniyati bo‘lgan odam yoki tashkilot."
        ]
    },
    {
        "word": "Absolyut kattalik (modul)",
        "type": [],
        "definition": [
            "Quyidagicha tarzda a haqiqiy son uchun aniqlanadigan funksiya (|a| qilib belgilanadi): |a|=a, agar a > 0 bo‘lsa; |a|=-a, agar a < 0 bo‘lsa. Ko‘plab dasturlash tillarida arifmetik ifodaning absolyut kattaligini hisoblash uchun standart funksiyalar mavjud: jumladan, Paskal va BASIK tillarida − abs(), Si tilida − abs() butun sonli argument uchun va fabs() − suriladigan nuqtali (vergulli) son ko‘rinishidagi argument uchun."
        ]
    },
    {
        "word": "Abstrakt hisoblash mashinasi",
        "type": [],
        "definition": [
            "Algoritmning matematik tavsifi bayon qilinadigan nazariy tuzilish. Tyuring, Post mashinalari, Kolmogorov mashinasi ma’lum."
        ]
    },
    {
        "word": "Avtomat",
        "type": [],
        "definition": [
            "Odamning bevosita ishtirokisiz qandaydir ishlarni bajaradigan qurilma yoki qurilmalar yig‘indisi."
        ]
    },
    {
        "word": "Avtomatlashtirish",
        "type": [],
        "definition": [
            "Odamning moddiy, energetik va axborot jarayonlarida bevosita qatnashishining ahamiyatini kamaytirishga qaratilgan tizimlar, qurilmalar, asboblar va metodlarni ishlab chiqish va qo‘llash. Izoh – Ishlab chiqarishni, texnologik jarayonlarni boshqaruvni, loyihalashni, o‘qitishni, dasturlashni avtomatlashtirish va kompleks avtomatlashtirish farqlanadi."
        ]
    },
    {
        "word": "Avtomatlashtirilgan dasturlash",
        "type": [],
        "definition": [
            "Amaliy dasturlarni loyihalash va qo‘llash uchun mo‘ljallangan metodlar hamda instrumental vositalar jami. Izoh – Avtomatlashtirilgan dasturlashda amalda dasturiy ta’minotning barcha turlarini ishlab chiqishda ko‘maklashadigan CASE texnologiyasi (CASE – Computer Aided Software Engineering – dasturiy vositalarning avtomatlashtirilgan injiniringi) keng ma’lum."
        ]
    },
    {
        "word": "Avtomatlashtirilgan ish joyi",
        "type": [],
        "definition": [
            "Mutaxassis ish joyiga xizmat ko‘rsatadigan texnik, dasturiy va metodik vositalar kompleksi. Mustaqil, alohida avtomatlashtirilgan ish joylari unchali samarador emas, ularning keyingi rivojlanishi kompyuter tarmoqlari tarkibida ishlab chiqish bilan bog‘liq."
        ]
    },
    {
        "word": "Avtomatika",
        "type": [],
        "definition": [
            "Odamning bevosita ishtirokisiz ishlaydigan tizimlar va qurilmalar yaratish masalalarini qamrab oladigan ilmiy va texnik fan."
        ]
    },
    {
        "word": "Avtonom rejim",
        "type": [],
        "definition": [
            "Jismonan o‘zaro bog‘langan bo‘lsa ham, bir-biridan mustaqil hisoblanadigan bir nechta tizimning ishlash rejimi. Ko‘pincha, «off-line» (tizimdan tashqari) rejim deb ataladi."
        ]
    },
    {
        "word": "Agent",
        "type": [],
        "definition": [
            "Foydalanuvchiga ko‘rinmaydigan (odatda fon reji-mida ishlaydigan), hodisalar bilan boshqariladigan dastur (ya’ni, biror hodisa yuzaga kelganda qan-daydir harakatni amalga oshiradigan). *nix-operatsi-on tizimlarda ular demon deb ataladi."
        ]
    },
    {
        "word": "Adapter",
        "type": [],
        "definition": [
            "Kompyuterning periferik qurilmalarini va markaziy protsessorni birlashtirish qurilmasi, ba’zida periferik qurilmani boshqarish funksiyasini ham amalga oshiradi. Odatda, mikrosxema ko‘rinishida bo‘ladi va asosiy plataga joylashtiriladi, alohida plata ham bo‘lishi mumkin."
        ]
    },
    {
        "word": "Adreslash",
        "type": [],
        "definition": [
            "1 Nomerlarini ko‘rsatish yo‘li bilan kompyuter port-lariga yoki xotiraning alohida yacheykalariga, tez kirishni (foydalanishni) ta’minlash usuli. 2 Kompyuter tarmoqlarida abonent joylashgan yerni aniqlash usuli."
        ]
    },
    {
        "word": "Akkumulyator",
        "type": [],
        "definition": [
            "Hisoblash natijalarini saqlash uchun mo‘ljallangan xotira yacheykasi; protsessorning arifmetik-mantiqiy qurilmasidagi registrlardan biri."
        ]
    },
    {
        "word": "Aksessuar",
        "type": [],
        "definition": [
            "Kompyuter yoki dasturiy muhit elementi; faqat butun tizim bilan birgalikda ishlatilishi mumkin, lekin uni alohida sotib olish va o‘rnatish mumkin. Masalan, kompyuterning multimedia aksessuarlariga kompakt- disklar, tovush adapterlari, kolonkalar kiradi; Windows tizimida Soat, Kalkulyator, Yon daftarcha kabi ilovalar kiradigan Aksessuarlar guruhi bor."
        ]
    },
    {
        "word": "Aktiv qurilma",
        "type": [],
        "definition": [
            "Berilgan vaqt onida tizim ishlaydigan fizik yoki mantiqiy qurilma. Ba’zi dastur, yoki ma’lumotlar bazasi ham aktiv bo‘lishi, ya’ni berilgan onda ular ma’lumotlarni kiritish\/chiqarish uchun tayyor bo‘lishi mumkin."
        ]
    },
    {
        "word": "Aktuallashtirish",
        "type": [],
        "definition": [
            "Ma’lumotlar bazasi, tizimni aktual holatda ushlab turish jarayoni, ya’ni barcha o‘zgartirishlarni muntazam, to‘liq va o‘z vaqtida kiritish."
        ]
    },
    {
        "word": "Algoritm",
        "type": [],
        "definition": [
            "Oldindan belgilangan, aniq ko‘rsatma. Muayyan tarzda boshlanadigan va qadamlarning qat’iy soni ichida natijaga olib keladigan diskret (qadamma-qa-dam) jarayonni belgilaydi. Birmuncha sodda tushunchalar orqali aniqlab bo‘lmaydigan boshlang‘ich matematik tushunchalarga kiradi. Har bir algoritm yo‘l qo‘yiladigan boshlang‘ich ma’lumotlarning ko‘pligi bilan, boshlang‘ich holat bilan, yo‘l qo‘yiladigan oraliq holatlarning ko‘pligi bilan, bir holatdan boshqa holatga o‘tish qoidalari bilan, oxirgi natijalarning ko‘pligi bilan, oxirgi holat bilan berilishi mumkin. Bu parametrlarning muayyan vazifasiga bog‘liq ravishda, algoritmlarning klasslari aniqlanadi, masalan, chiziqli, siklik algoritmlar, sa-ralash algoritmlari va h.k. Algoritmni ishlab chiqish-da har doim uni bajaruvchi ko‘zda tutilishi kerak. «Algoritm» so‘zi IX asrda yashagan O‘rta Osiyolik olim al-Xorazmiy nomidan olingan."
        ]
    },
    {
        "word": "Algoritmik til",
        "type": [],
        "definition": [
            "Simvollar to‘plami va algoritmlarni berish uchun bu simvollardan konstruksiyalar tuzish va ularni talqin qilish qoidalari tizimi."
        ]
    },
    {
        "word": "Alfavit",
        "type": [],
        "definition": [
            "Berilgan til yoki tizimda ma’lum bir ma’noda tartib-lashtirilgan simvollar yig‘indisi. Bu simvollar harflar deb ataladi. Muayyan alfavitga tegishli bo‘lgan simvollardangina so‘zlarni tuzishda foydalanish mumkin. Masalan, Paskal tilining alfaviti lotin harflaridan (aytish kerakki, katta va kichik harflar ajratilmaydi), raqamlar va maxsus simvollardan tuzilgan."
        ]
    },
    {
        "word": "Axborot almashinish uchun Amerika standart kodi",
        "type": [],
        "definition": [
            "Lotin alfaviti harflarini, sonlarni, tinish belgilarini mashinada taqdim etish uchun, 128 ta koddan va har biriga 7-bitli aniq ikkilik son to‘g‘ri keladigan maxsus simvollardan iborat to‘plam."
        ]
    },
    {
        "word": "Analog hisoblash mashinasi",
        "type": [],
        "definition": [
            "Analog ko‘rinishda taqdim etilgan ma’lumotlar bilan ishlaydigan hisoblash mashinasi, raqamli mashina-lardan dasturlashning soddaligi va operatsiyalarni bajarish tezligi katta bo‘lishi bilan ajralib turadi. Analog hisoblash mashinalari amalda har doim qattiq ixtisoslashtirilgan bo‘ladi. Analog hisoblash mashina-larini neyrokompyuterni yaratishda yanada rivojlantirish ko‘zda tutiladi."
        ]
    },
    {
        "word": "Animatsiya",
        "type": [],
        "definition": [
            "Displey ekranida harakatlanadigan grafik tasvirlarni yaratish jarayoni. Turli obyektlarni loyihalashtirish-da, tabiiy hodisalarni modellashtirishda, o‘qitish tizimlarida va o‘yin dasturlarida foydalaniladi. Har qanday hajmiy obyektni chizish, uni turli xil tezlik bilan turli yo‘nalishlarda harakatlantirish va aylantirish imkonini beradigan maxsus animatsion dasturiy komplekslar (paketlar) ishlab chiqilgan."
        ]
    },
    {
        "word": "Antivirus",
        "type": [],
        "definition": [
            "Operatsion tizim va uning dasturlarini ishdan chiqaruvchi (virus) dasturlarga qarshi dastur."
        ]
    },
    {
        "word": "Applet",
        "type": [],
        "definition": [
            "HTML-sahifalarda joylashtirilgan Java tilidagi uncha katta bo‘lmagan amaliy dastur. Appletlar lokal kompyuterning ma’lum resurslaridan foydalanish bo‘yicha cheklovlar bo‘lishligi va tarmoqdagi boshqa kompyuterlar bilan aloqa taqiqlanganligi bilan to‘liq Java-ilovalardan farqlanadi."
        ]
    },
    {
        "word": "Arifmetik amal",
        "type": [],
        "definition": [
            "Sonlar ustida bajariladigan sodda hisoblash amali. Ko‘plab dasturlash shkalalarida ikki o‘rinli qo‘shish (+), ayirish (-), ko‘paytirish (*), bo‘lish (\/), butunga bo‘lish (div, \\), modul bo‘yicha bo‘lish (mod) arifmetik amallari; bir o‘rinli belgi (+, -) berish amallari belgilangan."
        ]
    },
    {
        "word": "Arifmetik ifoda",
        "type": [],
        "definition": [
            "Ustida arifmetik amallar bajariladigan obyektlar ope-randlar bo‘lib hisoblanadigan ifoda."
        ]
    },
    {
        "word": "Arxivlash",
        "type": [],
        "definition": [
            "Vaqtinchalik kerak bo‘lmaydigan ma’lumotlarni saqlash va ma’lumotlarning rezerv nusxalarini yara-tish jarayoni. Arxivlash paytida fayllar xotirani tejash maqsadida zich qilib yoziladi. Ko‘pincha, ma’lumotlarni joylashtirish yoki siqish jarayonining o‘zi ham arxivlash deb ataladi."
        ]
    },
    {
        "word": "Arxitektura",
        "type": [],
        "definition": [
            "Kompyuter, kompyuter tarmog‘i, ma’lumotlar bazasi murakkab tizimini qurishning asosiy prinsiplari. Odatda, tizimning ishlashini ta’minlaydigan protokollar va interfeyslarni ichiga oladi."
        ]
    },
    {
        "word": "Asinxron uzatish rejimi",
        "type": [],
        "definition": [
            "Kompyuter tarmoqlaridagi ma’lumotlar uzatish standarti, yuqori o‘tkazish qobiliyatini (bir necha Gbit\/s) ta’minlaydi. Tarmoq bo‘ylab turli xil ma’lumotlar, shu jumladan, nutq va tasvirlar uzatilishini ta’minlash uchun mo‘ljallangan, kompyuter tarmoqlarining yangi avlodlari yaratilishini ta’minlaydi."
        ]
    },
    {
        "word": "Assembler",
        "type": [],
        "definition": [
            "Mashina-yo‘naltirilgan dasturlash tili bo‘lib, quyi darajali til hisoblanadi. Protsessorlarning har bir turidagi o‘zining mashina komandalari to‘plamiga ega bo‘lganligi tufayli, ular asosida yagona assembler tuziladi."
        ]
    },
    {
        "word": "Assemblerlash",
        "type": [],
        "definition": [
            "Dasturni assembler tilidan mashina kodiga translyatsiya qilish jarayoni."
        ]
    },
    {
        "word": "AT - komandalar",
        "type": [],
        "definition": [
            "Hayes Microcomputer Product firmasi tomonidan ishlab chiqilgan Hayes tipidagi modemlarni bosh-qarish tili. De-fakto standart hisoblanadi. Tilning har bir komandasi «AT» dan boshlanadi. Inglizcha «at-tention» − «diqqat» so‘zidan olingan."
        ]
    },
    {
        "word": "Atom",
        "type": [],
        "definition": [
            "LISP dasturlash tilida atomlar – bu, simvollar va sonlar to‘plami, ya’ni birmuncha murakkab strukturalarni tashkil qiladigan eng oddiy elementlardir. Ro‘yxatlar atomlardan iborat bo‘ladi. Masalan, «Men musiqa tinglayapman» ifodasi – bu, uch atomdan iborat ro‘yxatdir."
        ]
    },
    {
        "word": "Atribut",
        "type": [],
        "definition": [
            "Obyektning zarur, ahamiyatli xossasi. Fayllarda atribut tushunchasi ularni faqat o‘qish uchun, yashirish, arxivlash, indekslash, siqish va shifrlashda qo‘llash alomatini anglatadi. Active Directory da esa obyektlar va ularning ma’lumotlar turlari xususiyatlarini bildiradi. Obyektning shart bo‘lgan va qo‘shimcha atributlari ro‘yxati obyektlarning mos klasslari sxemasi orqali aniqlanadi."
        ]
    },
    {
        "word": "Analog kattalik",
        "type": [],
        "definition": [
            "Qiymatlari to‘xtovsiz o‘zgaradigan kattalik; uning aniq qiymati o‘lchashni amalga oshiradigan asbobning aniqligiga bog‘liq."
        ]
    },
    {
        "word": "Amaliy dasturlar generatori",
        "type": [],
        "definition": [
            "Ma’lumotlar bazalarini boshqarish tizimiga kiradigan muayyan ma’lumotlar bazasini boshqarish dasturlarini tuzishni avtomatlashtirish uchun mo‘ljallangan dasturlar. Dasturlar generatoridan foydalanish uchun yuqori malaka talab qilinmaydi. Shu sababli, ma’lumotlar bazasi strukturasini yaratish, ma’lumotlar kiritilishini va tuzatilishini, hisobotlar tuzishni oxirgi foydalanuvchi bajarishi mumkin."
        ]
    },
    {
        "word": "Asosiy yuklash yozuvi",
        "type": [],
        "definition": [
            "Qattiq diskning birinchi sektorida (maxsus qismida) bo‘lgan axborot. Asosiy yuklash yozuvi disk bo‘limlari jadvalini ichiga oladi va aktiv bo‘limni belgilaydi (operatsion tizimni yuklash uchun foydalaniladigan bo‘lim), shuningdek, keyinchalik operatsion tizimni yuklash uchun, BIOS boshqarishni topshiradigan kodni ham ichiga oladi. Asosiy yuklash yozuvi diskni bo‘limlarga ajratish vaqtida yaratiladi."
        ]
    },
    {
        "word": "Asosiy fayl jadvali",
        "type": [],
        "definition": [
            "NTFS fayl tizimi tomning tarkibi haqida ma’lumotlarni saqlaydigan relyatsion ma’lumotlar bazasi."
        ]
    },
    {
        "word": "Asboblar majmui",
        "type": [],
        "definition": [
            "Asosiy vazifaga nisbatan yordamchi dasturiy vositalar to‘plami. Foydalanuvchining instrumentariysi, masalan, antivirus dasturlarni, fayllarni arxiv-lash va qurilmalar holatini tekshirish dasturlarini ichiga olishi mumkin. Dasturchi instrumentariysiga, shuningdek, standart protseduralar bibliotekasini ham kiritish mumkin. Rivojlangan operatsion tizimlarda va qobiqlarda instrumentariy katta miqdorda yetkazib beriladi."
        ]
    },
    {
        "word": "Amaliy dasturlash  interfeysi",
        "type": [],
        "definition": [
            "Dasturning ichki funksionallaridan dasturiy yo‘l bilan foydalanish imkonini beradigan dastur ichki komponenti."
        ]
    },
    {
        "word": "Axborotlashtirish",
        "type": [],
        "definition": [
            "Axborot resurslarini shakllantirish va ulardan foydalanish asosida fuqarolarning, davlat hokimiyat organlarining, mahalliy o‘zini-o‘zi boshqarish organlarining, jamoat birlashmalarining huquqlarini amalga oshirish va axborotga bo‘lgan ehtiyojlarini qondirish uchun optimal sharoitlarni yaratishning tashkiliy, ijtimoiy-iqtisodiy va ilmiy-texnik jarayoni. Axborot-kommunikatsiya texnologiyalaridan foydalanishga asoslangan, ishlab chiqarishni jadallashtirish va bilimlar, axborot tarqatish jarayoni."
        ]
    },
    {
        "word": "Axborot tizimi",
        "type": [],
        "definition": [
            "1 Muayyan tarzda o‘zaro bog‘langan va qandaydir yaxlitlikni hosil qiladigan (moddiy yoki ideal) elementlar yig‘indisi. Tizim sifatida voqelikning istalgan obyekti qarab chiqilishi mumkin. Har qanday tizim o‘z mohiyatiga ko‘ra, axborot hosiladir, chunki uning elementlarining o‘zaro aloqasi axborotning bir joydan boshqa joyga uzatilishi vositasida amalga oshiriladi. Axborot tizimi, axborot bu tizimning kirish va chiqish mahsuloti bo‘lishligi bilan tavsiflanadi. Bunday tizimda texnologik jarayon axborot xarakterida bo‘ladi, energetik va moddiy jarayonlar ta’minlovchi rolini bajaradi.\r\n 2 Tashkiliy jihatdan tartiblashtirilgan hujjatlar (huj-jatlar to‘plamlari), shu jumladan, axborot jarayonlarini amalga oshiradigan hisoblash texnikasi va aloqa vositalaridan foydalanilgan, axborot texnologiyalari yig‘indisi."
        ]
    },
    {
        "word": "Axborot sohasi",
        "type": [],
        "definition": [
            "1 Subyektlar faoliyatining axborot yaratish, uni o‘zgartirish va iste’mol qilish bilan bog‘liq sohasi. O‘z ichiga zamonaviy jamiyatda odamlarni o‘rab turgan barcha belgilar muhitini oladi.\r\n 2 Iqtisodiyotning axborot va bilimlar ishlab chiqarish, qayta ishlash, saqlash va tarqatish bilan band sohasi.\r\n 3 Axborot, axborot infrastrukturasi, axborot to‘plash, shakllantirish, tarqatish va undan foydalanishni amalga oshiradigan subyektlar, shuningdek, bunda yuzaga keladigan ijtimoiy munosabatlarni tartibga solish tizimi yig‘indisi."
        ]
    },
    {
        "word": "Axborot texnologiyalari",
        "type": [],
        "definition": [
            "Axborot resurslaridan foydalanish jarayonlarining mehnat sig‘imini kamaytirish, ishonchlilik va operativlikni oshirish uchun, axborotni to‘plash, saqlash, qayta ishlash, chiqarish va tarqatish ta’minlanadigan texnologik zanjirga birlashtirilgan ishlab chiqarish vositalari, dasturiy-texnologik vositalar, metodlar yig‘indisi. Axborot texnologiyalari tushuncha sifatida ikki jihatga ega: 1) amaliy jihat – real tizimlarning axborot texnologiyalari bilan bog‘liq; 2) nazariy jihat samaradorligi yuqori bo‘lgan axborot tizimlarini yaratish uchun xizmat qiladigan axborot texnologiyalarini ishlab chiqish va tavsiflash (modellash) masalalari bilan bog‘liq."
        ]
    },
    {
        "word": "Axborot",
        "type": [],
        "definition": [
            "Qandaydir predmet sohadagi hodisalar, jarayonlar, voqealar, faktlar to‘g‘risidagi, axborotni qayta ishlash tizimiga kiritilgan yoki turli tashuvchilarda taqdim etishning turli shakllarida uning natijasi bo‘lgan va berilgan predmet soha obyektlarini boshqarish jarayonida qabul qilinadigan qarorlarni optimallash uchun foydalaniladigan (zarur bo‘lgan) ma’lumotlar; turli obyektlar va ular o‘rtasidagi o‘zaro aloqalar to‘g‘risidagi bilimlar jami. Birmuncha tor ma’noda elektron hisoblash mashinasining xotirasiga kiritiladigan, u yerda saqlanadigan, keyinchalik qayta ishlash va foydalanish uchun mumkin bo‘ladigan ma’lumotlarni o‘zida ifodalaydi. Zamonaviy fan va amaliyotdagi eng dolzarb, fundamental va munozarali tushunchalardan biri hisoblanadi. Umumiy ta’rifning yo‘qligi tufayli, turli predmet sohalarda turlicha talqin qilinadi."
        ]
    },
    {
        "word": "Aloqa kanali",
        "type": [],
        "definition": [
            "Ma’lumotlar uzatilishini ta’minlaydigan tabiiy muhit va texnik qurilmalar. Aloqa kanallari analog va raqamli, telefon, telegraf, radiochastota, televizion, infraqizil hamda optik aloqa kanallariga bo‘linadi. Shuningdek, ajratilgan va kommutatsiyalanadigan aloqa kanallari ham bor. Kanalning asosiy xarakteristikasi uning o‘tkazish qobiliyatidir."
        ]
    },
    {
        "word": "ANSI kodi",
        "type": [],
        "definition": [
            "Simvollarni sakkiz razryadli ikkilik sonlar (1 byte) bilan kodlash standarti. Windows da foydalaniladi."
        ]
    },
    {
        "word": "ASII kodi",
        "type": [],
        "definition": [
            "Bir baytli (1 byte=8 bit) ikkilik kod ko‘rinishida lotin alifbosi simvollarini, raqamlar, yordamchi simvollar yoki amallarni kodlash standarti. Dastlab standart 7 bitdan foydalanib (0 dan 127 gacha bo‘lgan) 128 simvolnigina belgilagan edi. Barcha sakkiz bitdan foydalanish yana 128 simvolni kodlash imkonini beradi. Qo‘shimcha simvollar har qanday bo‘lishi mumkin. Ularga 128 dan 255 gacha bo‘lgan kodlar ajratiladi."
        ]
    },
    {
        "word": "Aloqa tarmogʻi",
        "type": [],
        "definition": [
            "Hisoblash tizimining, ma’lumotlar uzatilishini ta’minlaydigan, aloqa kanali va ma’lumotlar uzatish apparaturasidan tuzilgan qismi."
        ]
    },
    {
        "word": "Avtomatlashtirilgan loyihalash tizimi",
        "type": [],
        "definition": [
            "Ayrim buyumga, bino va inshootga tegishli barcha zarur konstruktorlik va texnologik hujjatlarni tuzish imkonini beradigan texnik va dasturiy vositalar kompleksi."
        ]
    },
    {
        "word": "ACPI spetsifikatsiyasi",
        "type": [],
        "definition": [
            "Intel, Microsoft va Toshiba korporatsiyalari tomonidan 1996 yilda ishlab chiqilgan ochiq standart. Kompyuterlarning energiyaga bo‘lgan etiyojini BIOS tomonidan emas, balki operatsion tizim tomonidan to‘liq boshqarilishini (alohida qurilmalarni yoqish va o‘chirib qo‘yish) amalga oshirishga imkon beradi."
        ]
    },
    {
        "word": "Ada",
        "type": [],
        "definition": [
            "Protsedura turidagi murakkab va kuchli universal dasturlash tili; turli boshqaruv tizimlarini ishlab chiqish uchun mo‘ljallangan. Buyuk ingliz shoiri Jon Bayronning qizi, dastlabki dasturiy boshqariladigan hisoblash mashinasi – Bebbijning analitik mashinasi uchun dasturlar ishlab chiqishda qatnashgan Ada Lavleys sharafiga nomlangan."
        ]
    },
    {
        "word": "ActiveX",
        "type": [],
        "definition": [
            "COM modeli asosidagi obyekt komponent ilovalarini dasturlash uchun Microsoft tomonidan ishlab chiqilgan texnologiyalar guruhining nomi. Dasturiy ta’minot komponentlarining bir-birlari bilan, ularning yaratilishi uchun bevosita ishlatiladigan dasturlash tillariga bog‘liq bo‘lmagan holda, tarmoq muhitida o‘zaro ishlashlariga imkon yaratuvchi texnologiyalar to‘plami."
        ]
    },
    {
        "word": "Algol",
        "type": [],
        "definition": [
            "Ilmiy-texnik masalalarni hal qilish uchun foydalaniladigan, ma’lumotlarni qayta ishlashning protsedura tili; ilmiy hisoblashlar uchun mo‘ljallangan yuqori darajali til."
        ]
    },
    {
        "word": "ALPHA",
        "type": [],
        "definition": [
            "RISC turidagi, 64 razryadli ma’lumotlar shinasi, 64 razryadli adres shinasi, operativ xotira va protsessor o‘rtasida ma’lumotlar uzatish uchun mo‘ljallangan 128 razryadli shinaga ega bo‘lgan mikroprotsessor. DEC firmasi tomonidan 1992 yilda ishlab chiqilgan. Takt chastotasi 300 MHz ga yetadi."
        ]
    },
    {
        "word": "Amal",
        "type": [],
        "definition": [
            "Dasturlash tili obyektlari, ma’lumotlar, o‘zgaruvchilar, konstantalar, funksiyalar – ope-randlar ustida bajariladigan ish. Operandlarning turiga bog‘liq ravishda, arifmetik, satrli (simvolli), mantiqiy, faylli amallar farqlanadi. Operandlarning soniga bog‘liq ravishda, bir o‘rinli (unar), ikki o‘rinli (binar) va ko‘p o‘rinli (n-ar) amallar farqlanadi. Umuman olganda, amallar dasturlash tili bilan belgilanadi."
        ]
    },
    {
        "word": "Asosiy plata",
        "type": [],
        "definition": [
            "Apparatning, masalan kompyuterning asosiy bloklari joylashtiriladigan tutib turadigan («ona») plata-shassi."
        ]
    },
    {
        "word": "Amaliy dasturiy kompleks",
        "type": [],
        "definition": [
            "Yagona kompleksga birlashtirilgan ilovalar. Amaliy dasturiy kompleksga kiradigan har bir ilova mustaqil ishlashi mumkin. Ilovalarni yagona kompleksga birlashtirish, foydalanuvchi bilan ularning o‘rtasida bir xil interfeyslar mavjudligini bildiradi. Masalan, Microsoft Office amaliy dasturiy kompleks keng ma’lum. Uning tarkibiga quyidagi ilovalar kiradi: Word – matn protsessori, Excel – elektron jadvallar, Access – ma’lumotlar bazasi, PowerPoint – prezentatsiya. Integratsiyalashgan tizimlardan farqi shundaki, amaliy dasturiy kompleksning har bir elementi imkoniyatlari bo‘yicha integratsiyalashgan ti-\r\n zimlardagi analogiga qaraganda birmuncha kuchli, amaliy dasturiy kompleksda maxsus umumiy muhit yo‘q. Har bir ilova ishlaydigan muhit Windows hisoblanadi."
        ]
    },
    {
        "word": "Aylantirish",
        "type": [],
        "definition": [
            "Kompyuter xotirasida bo‘lgan ma’lumotlarni qarab chiqish usuli, agar bu ma’lumotlar displey ekranida ajratilgan oynada sig‘masa. Usul ma’lumotlarni vertikal va\/yoki gorizontal yo‘nalishda ketma-ket va boshqariladigan tarzda ko‘chirishdan iborat."
        ]
    },
    {
        "word": "Ajratkich",
        "type": [],
        "definition": [
            "Dasturlash tili alfavitining elementi, uning yordamida ma’lumotlar yoki dasturlarda til strukturalari ajratiladi. Masalan, Pascal tilida konstruksiya ichidagi ajratkich – bo‘sh joy, operatorlar o‘rtasida – tire; dasturning oxiri nuqta bilan belgilanadi."
        ]
    },
    {
        "word": "Apparat taʼminot kengayadigan interfeys",
        "type": [],
        "definition": [
            "Operatsion tizim va uskunaning past sath funksiyalarini boshqaradigan mikrodasturlar o‘rtasidagi interfeys, uning asosiy vazifasi tizim ulanganda uskunani ohista initsiallash va boshqaruvni operatsion tizim yuklagichiga berish. EFI ning dastlabki spetsifikatsiyasi Intel tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Assembler tili",
        "type": [],
        "definition": [
            "Mashinaga yo‘naltirilgan dasturlash tili bo‘lib, quyi darajali til hisoblanadi. Protsessorlarning har bir turi o‘zining mashina komandalari to‘plamiga ega bo‘lganligi uchun, ular asosida yagona assembler tuziladi."
        ]
    }
]