[
    {
        "word": "Bilimlarni avtoformallashtirish",
        "type": [],
        "definition": [
            "Mutaxassis bilimlarini kompyuter uchun dastur ko‘rinishida formallashtirish jarayoni. Bilimlarning avtomatlashtirilishini ta’minlash uchun maxsus metodlar va vositalar (masalan, shaxsiy kompyuterlar) talab qilinadi."
        ]
    },
    {
        "word": "Bebbejning analitik mashinasi",
        "type": [],
        "definition": [
            "Ch.Bebbej tomonidan ishlab chiqilgan universal mexanik hisoblash qurilmasi. Kompyuterning pro-obrazi. Amalda hozirgi kompyuterlardagi qurilmalar: xotira, arifmetik qurilma, boshqarish qurilmasi, kiritish\/chiqarish qurilmalariga ega bo‘lgan, mashina dastur bilan boshqarilgan. Loyiha 1834 yilda ishlab chiqilgan, lekin to‘la qurilmagan."
        ]
    },
    {
        "word": "Bilimlar bazasi",
        "type": [],
        "definition": [
            "Muayyan predmet soha to‘g‘risida natijaga olib keladigan xulosalar tizimi, taxminlar, faktlar ko‘rinishidagi bilimlarni ichiga oladigan maxsus ma’lumotlar bazasi. Bilimlar bazasi ekspertlarning bilimlariga asoslanadi."
        ]
    },
    {
        "word": "Bayt",
        "type": [],
        "definition": [
            "Xotiraning eng kichik adreslanadigan birligi (birgalikda qayta ishlanadigan bitlar ketma-ketligi). 8 ta ikkilik razryad (bit ni) o‘zida saqlaydi. Xotira hajmining o‘lchov birligi hisoblanadi."
        ]
    },
    {
        "word": "Banner",
        "type": [],
        "definition": [
            "Web-sahifada joylashtiriladigan, reklama qilinadigan saqifaga giperhavola bo‘lgan grafik fayl. Shuningdek, serverga murojaat qilinganda tabrik satrini ham belgilaydi."
        ]
    },
    {
        "word": "Biblioteka",
        "type": [],
        "definition": [
            "Dasturlash tillarida klaviaturali, foydalanish tizimlarida cho‘ntak kompyuteri. Protseduralar, kichik dasturlar, funksiyalar, makrotavsiflar saqlanadigan fayllar jami.  Izoh – Tizim yoki til translyatori bilan birga yetkazib beriladigan standart bibliotekalar va foydalanuvchilarning o‘zlari tomonidan yaratiladigan foydalanish bibliotekalari farqlanadi. Masalan, Turbo C tilida kataloglar va fayllar bilan ishlash uchun funksiyalar taqdim etilgan «dir.h» standart biblioteka bor."
        ]
    },
    {
        "word": "Bit",
        "type": [],
        "definition": [
            "Ikkilik sanoq tizimidagi, 0 va 1 qiymatini olishi mumkin bo‘lgan eng kichik axborot birligi; karrali birliklari: kb (kbit) – kilobit (10³ bit), Mb (Mbit) megabit (10³ bit) va boshqalar."
        ]
    },
    {
        "word": "Blok",
        "type": [],
        "definition": [
            "1 Funksional bog‘langan elementlar va qurilmalar, masalan, ta’minot bloki.\r\n 2 Dasturning, ma’lum bir tugallangan funksiyani belgilaydigan qismi. Masalan, Pascal tilida blok – bu dastur, protsedura, funksiyaning asosiy qismidir.\r\n 3 Kompyuter tarmog‘ida uzatish uchun mo‘ljallangan ma’lumotlar to‘plami."
        ]
    },
    {
        "word": "Bloknotli kompyuter",
        "type": [],
        "definition": [
            "Statsionar shaxsiy kompyuterning keng funksional imkoniyatlariga ega bo‘lgan portativ kompyuter. So‘nggi modellari Pentium 4 protsessoriga, 256 Mbyte gacha operativ xotiraga, 40 Hbyte gacha qattiq diskka, ichiga o‘rnatilgan DVD, kompakt-disk va faks-modemga ega. Kompyuterning ba’zi qurilmalari statsionar qurilmalardan farq qiladi: displey odatda, suyuq kristalli, monoxrom yoki rangli (passiv yoki aktiv matritsali); protsessor unumliligi bo‘yicha statsionar protsessorlardan farq qilmaydi, biroq energiya iste’moli kam; klaviaturada klavi-shalar soni kam. O‘zining ta’minot manbai yordamida ishlash vaqti 2 soatdan 8 soatgacha. Bloknotli kompyuterlarda statsionar qurilmalar – display, klaviaturadan foydalanilishi mumkin. Og‘irligi 1,5 kg dan 3-4 kg gacha, kompyuter quvvatiga bog‘liq. Bunday kompyuterlardan yo‘lda, xizmat safarida, ilmiy, jurnalistik, pedagogik va boshqa faoliyatda foydalanish mumkin. O‘lchamlari yanada kichikroq, og‘irligi yanada kamroq bo‘lgan subbloknotli kompyuterlar chiqarilmoqda."
        ]
    },
    {
        "word": "Blok sxema",
        "type": [],
        "definition": [
            "1 Algoritmning grafik tarzda taqdim qilinishi. Algoritm ko‘rgazmaliligini oshiradi. Blok-sxemalar tuzish ayniqsa, boshlovchi dasturchilar uchun foydali. 2.Tizim strukturasi yoki texnik vositalar tarkibining grafik tarzda taqdim qilinishi."
        ]
    },
    {
        "word": "Bod",
        "type": [],
        "definition": [
            "Ma’lumotlar uzatish apparaturasida signalni modu-lyatsiyalash tezligini o‘lchash birligi. Sekundiga bir necha bitga teng. Telegraf apparat ixtirochisi bo‘lgan fransuz muhandisi E.Bodo sharafiga atalgan."
        ]
    },
    {
        "word": "Brauzer",
        "type": [],
        "definition": [
            "Mijozning server bilan birga ishlashini ta’minlay-digan dasturiy kompleks. Internet tarmog‘ining WWW texnologiyasida brauzer axborot sahifalarini ko‘rib chiqish, ma’lumotlar olish imkonini beradi. Ba’zi bir brauzerlar o‘z ichiga Java tili vositalarini oladi."
        ]
    },
    {
        "word": "Bul algebrasi",
        "type": [],
        "definition": [
            "Matematik mantiqning, mulohazalar va ular ustida bo‘ladigan amallarni o‘rganadigan bo‘limi. Mantiq algebrasining xususiy holi. Mulohaza – bu, har qanday tasdiq; chin yoki yolg‘on bo‘lishi mumkin. Mulohazalar ustida muayyan amallar bajariladi: «va» & bilan belgilanadi, konyunksiya deb ataladi; «yoki» V bilan belgilanadi, dizyunksiya deb ataladi, «agar ..., u holda» > bilan belgilanadi, implikatsiya deb ataladi; «ekvivalentlik» «yo‘q» bilan belgilanadi, inkor deb ataladi. Aniqlanish (tavsif) sohasi mulohaza, qiymatlar sohasi 1 deb belgilanadigan haqiqat (chin) yoki 0 deb belgilanadigan yolg‘on bo‘lgan funksiya tushunchasi kiritilgan. Funksiyalar, ko‘pincha, haqiqiylik jadvallari deb ataladigan jadvallar bilan berilishi mumkin."
        ]
    },
    {
        "word": "Bufer",
        "type": [],
        "definition": [
            "Qurilmalar o‘rtasida ma’lumotlar almashinishda taktlash yoki tezliklar farqini kompensatsiyalash uchun foydalaniladigan, ma’lumotlar vaqtinchalik saqlanadigan soha. Buferlashdan, shuningdek, titrashlarni bostirish uchun ham foydalaniladi. Bufer sifatida ko‘pincha, markaziy protsessor va periferik qurilmalar o‘rtasida uzatiladigan ma’lumotlarni vaqtinchalik saqlash uchun rezervlangan qo‘shimcha xotiradan foydalaniladi."
        ]
    },
    {
        "word": "Buzilishgacha ishlash vaqti",
        "type": [],
        "definition": [
            "Hisoblash tizimi yoki qurilmaning ikkita texnik ketma-ket buzilishlari orasidagi o‘rtacha vaqt tizimning ishonchlilik ko‘rsatkichlaridan biri."
        ]
    },
    {
        "word": "Butunjahon «oʻrgimchak toʻri» (WWW)",
        "type": [],
        "definition": [
            "Internet tarmog‘i qo‘llab-quvvatlaydigan ko‘plab texnologiyalardan biri. Gipermatnli hujjatlar izlab topilishini ta’minlaydi. WWW ning asosini Internet ga kiradigan, gipermatnning adreslangan sahifalari saqlanadigan kompyuter, server; HTML, VRML, Java kabi maxsus tillar yordamida tuzilgan gipermatn; brauzer, foydalanuvchi\/mijozning server va gipermatn bo‘lgan kompyuterlar bilan birgalikda ishlashini ta’minlaydigan dastur tashkil qiladi."
        ]
    },
    {
        "word": "Butunga boʻlish",
        "type": [],
        "definition": [
            "Arifmetik amal. Uning natijasi – xususiyning butun qismi, kasr qismi tashlab yuboriladi. Deyarli barcha dasturlash tillarida bor. A div b yozuv bilan, ba’zi tillarda a\/b qilib belgilanadi"
        ]
    },
    {
        "word": "Boʻyash",
        "type": [],
        "definition": [
            "Grafik ekranning ba’zi sohasini rang yoki standart ornament bilan to‘ldirish protsedurasi. Bo‘yash gra-fik redaktorlarda yoki amaliy dasturlarda dasturlash tillarining tegishli protseduralari bilan amalga oshirilishi mumkin."
        ]
    },
    {
        "word": "Belgi",
        "type": [],
        "definition": [
            "Til alfavitining elementi."
        ]
    },
    {
        "word": "Bilim",
        "type": [],
        "definition": [
            "Tizimlashtirilgan va predmetlar, jarayonlar, hodisalar to‘g‘risida aniq tasavvur beradigan obyektiv va aniq faktlar, metodlar, usullar hamda texnologiyalar jami. Intuitiv tushuncha."
        ]
    },
    {
        "word": "Bajaruvchi",
        "type": [],
        "definition": [
            "Algoritm yozilgan tilni tushunadigan, bu algoritmni juda aniq bajara oladigan odam va\/ yoki avtomatik qurilma. Kompyuter axborot algoritmlarini universal bajaruvchidir. Bajaruvchi komandalar haqiqatda bajarilayotganda real bo‘lishi, komandalar modellashtirilayotganda shartli bo‘lishi mumkin."
        ]
    },
    {
        "word": "Boshlangʻich kod",
        "type": [],
        "definition": [
            "Hisoblash tizimida qabul qilingan kodda yozilgan dastur matni (odatda, fayl shaklida). Boshlang‘ich kod bajariladigan kodga butunlay, dastur kompilyator yordamida ishga tushirilgunga qadar translyatsiya qilinadi yoki interpretator yordamida darhol bajarilishi mumkin."
        ]
    },
    {
        "word": "Bir jinsli boʻlmagan tarmoq",
        "type": [],
        "definition": [
            "Turli topologiya fragmentlaridan va turli xil texnik vositalardan tuzilgan kompyuter tarmog‘i."
        ]
    },
    {
        "word": "Bir rangdagi tarmoq",
        "type": [],
        "definition": [
            "Barcha kompyuterlar teng huquqli bo‘lgan, ajratilgan server talab qilinmaydigan kompyuter tarmog‘i."
        ]
    },
    {
        "word": "Bayroq",
        "type": [],
        "definition": [
            "1 Operatsion tizimlarda, dasturlash tillarida ma’lumotlarni qayta ishlash paytida foydalaniladigan, qiymatiga dasturning keyingi ishi bog‘liq bo‘lgan belgi.\r\n 2 Ma’lumotlar uzatish tarmoqlarida kadrlarni ajratish uchun foydalaniladigan belgi."
        ]
    },
    {
        "word": "BASIC",
        "type": [],
        "definition": [
            "Dastlabki eng oddiy dasturlash tillaridan biri. 1964 yilda ishlab chiqilgan mazkur dasturlash tili professional bo‘lmagan dasturchilarga mo‘ljallangan. BASIC tili konstruksiyasining tuzilishi oddiyligi, shuningdek, kompyuter bilan dialog rejimda ishlash imkoniyati mavjudligi bilan ajralib turadi."
        ]
    },
    {
        "word": "BeOS",
        "type": [],
        "definition": [
            "Dastlab BeBox uchun bazaviy operatsion tizim sifatida ishlab chiqilgan operatsion tizim. Ko‘p oqimlilik, mikroyadrolik, ko‘p protsessorli arxitekturaning, 64 bitli jurnallashtiriladigan fayl tizimining qo‘llanilishi, juda qulay va oddiy foydalanuvchi interfeysi BeOS ning ajratib turadigan afzal jihatlaridir."
        ]
    },
    {
        "word": "Bosma plata",
        "type": [],
        "definition": [
            "Dielektrik material (masalan, shisha tekstolit) dan qi-lingan plastina. Bu plastinada maxsus metodlar (masalan, kimyoviy usul bilan ishlov berish yoki elek-trokimyoviy cho‘ktirish) bilan, plastinada mah-kamlangan elektron qurilmalar (tranzistorlar, integral sxemalar) ni birlashtiradigan o‘tkazgichlar hosil qilinadi. Tizim platalari va kengayish platalari bosma platalar hisoblanadi."
        ]
    },
    {
        "word": "Boshlangʻich shart",
        "type": [],
        "definition": [
            "Haqiqatligi protsedura yoki sikl jismi bajarilishining boshlanishida tekshiriladigan shart. Bu, sikl yoki protsedura faqat shart chin bo‘lgan holdagina bajarilishini bildiradi."
        ]
    },
    {
        "word": "Boʻlim",
        "type": [],
        "definition": [
            "Dasturning maxsus ma’noga ega bo‘lgan qismi. Masalan, Pascal tilida dasturiy blok umumiy ko‘rinishda belgilar, konstantalarni tavsiflash boʻlimlaridan, ma‘lumotlar turlarini aniqlash, o‘zgaruvchilarni, protseduralar, funksiyalar, operatorlarni tavsiflash bo‘limlaridan tuzilgan."
        ]
    },
    {
        "word": "Boshqarish",
        "type": [],
        "definition": [
            "Aniq bir maqsadni ta’minlash uchun, obyektga ta’sir ko‘rsatish jarayoni. Boshqarishda boshqariladigan obyekt; boshqarishni amalga oshiradigan blok; boshqarish obyektidan boshqaruvchi blokka kelib tushadigan, teskari aloqani amalga oshiradigan ma’lumotlar; boshqarishning o‘zini ta’minlaydigan signallar yoki ma’lumotlar qatnashadi. Fan sifatida boshqarish bilan kibernetika shug‘ullanadi."
        ]
    }
]