[
    {
        "word": "Diskret kattalik",
        "type": [],
        "definition": [
            "Qiymatlari sakrab-sakrab o‘zgaradigan kattalik. Masalan, elektr zanjirda tok borligini yoki yo‘qligini tavsiflaydigan kattalik diskret kattalik bo‘lib, «ha» yoki «yo‘q» (0 va 1) qiymat olishi mumkin."
        ]
    },
    {
        "word": "Damp",
        "type": [],
        "definition": [
            "Xotira bo‘lagi yoki fayl mazmunini ekranga chiqarish, faylga olish yoki chop etish. Odatda, kompyuterning «qotib qolish» sababini aniqlash maqsadida matnli xabarlarni izlashda, shuningdek, tuzilayotgan dasturni tekshirishda ham damp olinadi. Mutaxassislar uchun ma’lumotlarni o‘z ichiga oladi."
        ]
    },
    {
        "word": "Datchik",
        "type": [],
        "definition": [
            "Qandaydir fizik kattalikning qayd etilishini, uning signallarga o‘zgartilishini va bu signallarning, qayta ishlash uchun boshqarish tizimga uzatilishini ta’minlaydigan qurilma"
        ]
    },
    {
        "word": "Deinstallyator",
        "type": [],
        "definition": [
            "Qandaydir ilovani deinstallyatsiya qilish (chiqarib tashlash) uchun mo‘ljallangan kompleks dastur. Deinstallyatorlarni qo‘llash zarurati, ko‘plab zamonaviy ilovalar o‘rnatish paytida o‘z dastur fayllarini turli adreslar bo‘yicha yozishi, shuningdek, o‘z ma’lumotlarini tez-tez tizim reestrida qayd etishi bilan izohlanadi"
        ]
    },
    {
        "word": "Deytagramma",
        "type": [],
        "definition": [
            "Oldindan virtual kanal tuzilmasdan va ulanish o‘rnatilmasdan, protokol uzatadigan axborot bloki. Oldindan ulanish o‘rnatilmaydigan (shuningdek, paketlarni qabul qilish – uzatish va takrorlash tartibi nazorat qilinmaydigan) har qanday protokol deytagrammali protokol deb ataladi"
        ]
    },
    {
        "word": "Dekatenatsiya",
        "type": [],
        "definition": [
            "Simvollar satrlarini alohida qismlarga ajratish ope-ratsiyasi; konkatenatsiyaga teskari bo‘lgan operatsiya. Dasturlash tillarida bu operatsiyani bajaradigan maxsus funksiyalar mavjud"
        ]
    },
    {
        "word": "Deklarativ dasturlash tili",
        "type": [],
        "definition": [
            "Ma’lumotlarni dastlab tavsiflash asosiga qurilgan va natijani qanday olish mumkinligi ko‘rsatiladigan protseduraga yo‘naltirilgan tillardan farqli ravishda, natijada nima olinishi ko‘rsatiladigan dasturlash tili. Deklarativ tillarni, o‘z navbatida, funksional va mantiqiy tillarga bo‘lish mumkin"
        ]
    },
    {
        "word": "Dasturlarning koʻrsatish uchun belgilangan paketlari",
        "type": [],
        "definition": [
            "Ma’lum bir axborotni auditoriyaga samarali yetkazish uchun mo‘ljallangan aniq maqsadga yo‘naltirilgan dasturiy komplekslar. Asosan, prezentatsiya va reklama maqsadida qo‘llaniladi. O‘qitish-o‘rgatish maqsadlarida qo‘llanilishi foydaliroq bo‘ladi"
        ]
    },
    {
        "word": "Daraxt",
        "type": [],
        "definition": [
            " Daraxtni eslatadigan struktura. Uning asosida bir qancha element (tana) bog‘langan bitta element (il-diz) bo‘ladi. Bu elementlar (tanalar) o‘z navbatida yana bir qancha (shoxlar) bilan bog‘langan va h.k, shu tarzda so‘nggi elementlargacha (yaproqlargacha). Natijada ko‘p pog‘onali daraxt hosil bo‘ladi. Daraxt – bu, bog‘langan yo‘naltirilmagan siklsiz grafdir"
        ]
    },
    {
        "word": "Deskriptor",
        "type": [],
        "definition": [
            "Axborot tizimida saqlanadigan ma’lumotlarni topish va tavsiflash imkonini beradigan so‘z yoki so‘z birik-masi (kod bo‘lishi mumkin). Ba’zan, kalit so‘z deb ataladi. Tizimni ishlab chiqishda deskriptorlarni aniqlash va ularning mavjudligini hisobga olish zarur"
        ]
    },
    {
        "word": "Defragmentatsiya",
        "type": [],
        "definition": [
            "Fayllarni uzluksiz ketma-ket klasterlarda saqlanishini ta’minlash maqsadida disk bo‘limining mantiqiy strukturasini optimallash va yangilash jarayoni. Asosan FAT va NTFS fayl tizimlarida ishlatiladi. Defragmentatsiyadan so‘ng fayllarni o‘qish va yozish, shuningdek, dastur ishlari ham tezlashadi. Defragmentatsiyaning boshqa vazifasi: diskda fayllarni uzluksiz maydonda joylashadigan qilib taqsimlash"
        ]
    },
    {
        "word": "Diagramma",
        "type": [],
        "definition": [
            "O‘lchanadigan kattaliklar va ularning nisbatlarini grafik tarzda shartli tasvirlash. Amaliy grafikaning ko‘pgina tizimlarida diagrammalar ikki o‘lchamli va uch o‘lchamli ko‘rinishda ustunlar va doiralar ko‘rinishida taqdim qilinadi"
        ]
    },
    {
        "word": "Dialekt",
        "type": [],
        "definition": [
            "Ba’zi bir dasturlash tilining xususiy versiyasi. Masalan, Apple firmasining kompyuterlarida dasturlash uchun BASIC dialektlari mavjud"
        ]
    },
    {
        "word": "Dialogli rejim",
        "type": [],
        "definition": [
            "Odam va tarmoqdagi kompyuter(lar) bilan yoki kompyuter va periferik qurilma o‘rtasidagi bevosita birgalikda ishlash rejimi, bunda birga ishlaydigan ti-zimlar o‘rtasida aloqa uzilmaydi. Ko‘pincha, interaktiv yoki «on-line» rejimi deb ataladi"
        ]
    },
    {
        "word": "Digitayzer",
        "type": [],
        "definition": [
            "Turli texnik prinsiplarga asoslangan, grafik ma’lumotlarni kompyuterga kiritish uchun xizmat qiladigan qurilma"
        ]
    },
    {
        "word": "Dizassemblirlash",
        "type": [],
        "definition": [
            "Mashina kodlaridagi dasturdan assemblerdagi dasturning boshlang‘ich matnini olish jarayoni va\/yoki usuli. Dasturning o‘zining kodlarini gene-ratsiyalashda translyatorning optimallik darajasini belgilashda foydali. Dastlabki matnlari bo‘lmagan dasturlarni tuzish metodi va\/yoki algoritmini tushunish imkonini beradi. Bu jarayonni bajaradigan maxsus dasturlar – dizassemblerlar mavjud"
        ]
    },
    {
        "word": "Dizyunksiya",
        "type": [],
        "definition": [
            "Mantiqiy amal. R va Q mulohazalardan juda bo‘lmaganda bittasi chin bo‘lgan holatda chin bo‘ladigan va har ikki mulohaza yolg‘on bo‘lganda yolg‘on bo‘ladigan yangi mulohaza, R va Q mulohazalar dizyunksiyasi deb ataladi. (P V Q kabi belgilanadi, «yoki R yoki Q» deb o‘qiladi). Ba’zida P or Q (inglizcha or – yoki) deb belgilanadi"
        ]
    },
    {
        "word": "Dinamik komponovka",
        "type": [],
        "definition": [
            "Dinamik komponovka qilinadigan maxsus bibliotekadan DLL (Dynamic Link Library) chaqirib olish yordamida murojaat qilish paytida ma’lumotlar va\/yoki standart funksiyalarni bajariladigan dasturga qo‘shish metodi. Dinamik komponovka Windows ga moslashtirilgan ilovalar bilan ishlaydi. Statik komponovkaga alternativ hisoblanadi"
        ]
    },
    {
        "word": "Dinamik operativ xotira",
        "type": [],
        "definition": [
            "Yarimo‘tkazgichli operativ xotiraning bir turi. Xar bir ikkilik razryad (bit) tranzistor va kondensatordan iborat sxemada saqlanadi. Agar, kondensator za-ryadlangan bo‘lsa, 1 ga mos keladi, zaryadsizlangan kondensator 0 ga mos keladi. Tranzistor kondensatordan foydalanishni boshqaradi. Dinamik operativ xotiraning mikrosxemasi odatda, 1 048 576 bit ni ichiga oladi, ulardan operativ xotira yig‘iladi"
        ]
    },
    {
        "word": "Dinamik joylashtiriladigan biblioteka",
        "type": [],
        "definition": [
            "Maxsus ravishda Windows ostida ishlash uchun yozilgan dasturlar-ilovalarda foydalaniladigan ma’lumotlar va funksiyalarni ichiga oladigan fayllar jami. Ma’lumotlar deganda, piktogrammalar, shriftlar va menyu tushuniladi. DLL bajariladigan dasturga kerak bo‘ladigan funksiyalar va\/yoki ma’lumotlar ishga, ishlaydigan dasturga standart kirishdan farqli ravishda, ularga murojaat qilish paytida jalb qilingan paytda, Windows ostida ishlash metodini ta’minlaydi"
        ]
    },
    {
        "word": "Dinamik maʼlumotlar almashinishi",
        "type": [],
        "definition": [
            "Windows muhitidagi dasturlararo birgalikda ishlash protokoli. OLE mexanizmi asta-sekin siqib chiqarmoqda. Uning amal qilishining mohiyati, ikki dastur o‘rtasida doimiy aloqa o‘rnatishdan iborat, natijada bir ilovadagi hujjat yangilanganda, u bilan bog‘liq bo‘lgan boshqa ilova hujjatlaridagi axborot ham yangilanadi"
        ]
    },
    {
        "word": "Disk",
        "type": [],
        "definition": [
            "Dumaloq plastina ko‘rinishidagi ma’lumotlar ombori. Ko‘pincha, disk deganda, paketga birlashtirilgan bir nechta disk tushuniladi. Disk – bu, ma’lumotlar tashuvchidir. Ma’lumotlarni diskka yozadigan (diskdan o‘qiydigan) qurilma ma’lumotlarni to‘plagich deb nomlanadi. Disklar ma’lumotlarni yozish\/o‘qish usuli bo‘yicha, ularni almashtirish mumkinligiga ko‘ra, yozuv zichligiga ko‘ra xotirada qoladi. O‘qish\/yozish usuliga ko‘ra, disklar magnit, lazer (optik), magnitooptik disklarga bo‘linadi. Magnit disklar, o‘z navbatida egiluvchan va qattiq magnit disklarga bo‘linadi. Lazer disklar asosan, faqat ma’lumotlarni o‘qish uchun mo‘ljallangan. Magnitooptik disklardan ma’lumotlarni yozish va o‘qish uchun foydalanilishi mumkin"
        ]
    },
    {
        "word": "Dispetcher",
        "type": [],
        "definition": [
            "Operatsion tizimning, dasturlarning bajarilishini boshqarish ta’minlanadigan moduli. Tizimda muvofiqlashtirish va boshqaruv rolini bajaradigan dastur"
        ]
    },
    {
        "word": "Dispetcher ustuvorligi",
        "type": [],
        "definition": [
            "Topshiriqlarga beriladigan va multidastur rejimda, topshiriq markaziy protsessor tomonidan qayta ishlanadigan tartibni aniqlash uchun foydalaniladigan raqam"
        ]
    },
    {
        "word": "Displey",
        "type": [],
        "definition": [
            "Ma’lumotlarni vizual aks ettirish qurilmasi. Displeydan ma’lumotlarni kiritish va chiqarish uchun foydalaniladi. Displeyning ishlash prinsiplari turlicha. Shaxsiy kompyuterlarda elektron-nurli trubkalardan foydalanilgan displeylar juda keng tarqalgan. Shuningdek, plazma panellar, suyuq kristallar, yorug‘lik diodlari asosidagi displeylar ham bor. Displeyni kompyuterga ulash uchun tegishli adapter zarur. Displeydan, shuningdek, kompyuterni boshqarish uchun ham foydalaniladi, shu sababli ko‘pincha monitor deb ham ataladi"
        ]
    },
    {
        "word": "Displeyli panel",
        "type": [],
        "definition": [
            "Plazma yoki suyuq kristall texnologiya asosida qurilgan displey. Asosida suyuq kristall bo‘lgan displey – bu, suyuq kristallar va mikroo‘tkazgichlardan iborat to‘r joylashgan yassi ekrandir. Mikroo‘tkazgichlar kristallarga elektr toki uzatadi, kristallar kuchlanish ostida tasvir hosil qilgan holda, yorisha boshlaydi. Nuqta qadami 0,26-0,3mm. Maksimal ajrata olish: 1280x1024, 75 Hz"
        ]
    },
    {
        "word": "Domen nomi",
        "type": [],
        "definition": [
            "Internet ga ulangan har bir kompyuterning ramziy nomi. Nomlar iyerarxiyasi quriladi. Bu iyerarxiyaning har bir darajasi domen deb ataladi va qo‘shni darajadan nuqta bilan ajratiladi. Nom o‘ngdan chapga qarab belgilanadi"
        ]
    },
    {
        "word": "Drayver",
        "type": [],
        "definition": [
            "Operatsion tizim va periferik qurilma o‘rtasida aloqani ta’minlaydigan, qurilmani boshqaradigan va qurilma orqali o‘tadigan ma’lumotlar oqimini tar-tibga soladigan dastur. Drayverni operatsion tizim-ning bir qismi deb hisoblash mumkin. Kompyuterga yangi qurilma ulanayotganda bu qurilmaning ishlashini ta’minlaydigan drayver bo‘lishi zarur. Drayverni, agar u qurilma bilan birga yetkazib berilmasa. dasturchi ishlab chiqishi mumkin"
        ]
    },
    {
        "word": "Dasturning bajarilishi",
        "type": [],
        "definition": [
            "Mashina kodlaridagi dastur boshlang‘ich ma’lumotlarning kiritilishi va natijalar olinishi bilan bajariladigan jarayon. Sozlash rejimida dastur qadamlab bajarilishi mumkin. Agar dastur operatsion tizim boshqaruvida bajarilsa, qadamlab bajarish dasturlash muhiti boshqaruvida amalga oshiriladi."
        ]
    },
    {
        "word": "Diskni keshlash",
        "type": [],
        "definition": [
            "Fayl tizimining unumdorligini oshirish uchun foydalaniladigan metod. O‘qish va yozish operatsiyalarini bajarish uchun diskka muntazam murojaat qilishlar o‘rniga, fayllar operativ xotira keshida saqlanadi. Barcha o‘qish\/yozish operatsiyalari xotiraga murojaat qilish tezligi bilan bajariladi, bu diskka murojaat qilishga qaraganda ancha tez."
        ]
    },
    {
        "word": "Disk sektori",
        "type": [],
        "definition": [
            "Diskli xotirlovchi qurilmalarda axborot saqlashning minimal adreslanadigan birligi. Disk yo‘lkasining bir qismi hisoblanadi. Ko‘pgina qurilmalarda sektorning o‘lchami 512 byteni (masalan, qattiq va egiluvchan disklarda) yoki 2048 byteni (masalan, optik disklarda) tashkil qiladi. Yangi qattiq disklarda kengaytirilgan format sifatida ma’lum bo‘lgan 4096 byte sektor o‘lchamidan foydalaniladi."
        ]
    },
    {
        "word": "DBASE",
        "type": [],
        "definition": [
            "Relyatsion ma’lumotlar bazasini boshqarish tizimi. Aihton-Tate firmasi (AQSh) tomonidan ishlab chiqilgan. Tizim muntazam ravishda takomillashtirilib boriladi, dBASE II, dBASE III, dBASE III Plus versiyalari o‘zini yaxshi ko‘rsatdi. Hozirgi vaqtda Borland firmasi tomonidan tizimni takomillashtirish davom ettirilmoqda, dBASE IV va dBASE V versiyalar chiqarildi. Foydalanuvchi bilan rivojlangan interfeysga ega, lekin Fox tizimidan ishlash tezligi bo‘yicha orqada."
        ]
    },
    {
        "word": "DDR2 SDRAM",
        "type": [],
        "definition": [
            "Hisoblash texnikasida operativ hamda videoxotira sifatida foydalaniladigan operativ xotira turi."
        ]
    },
    {
        "word": "DELPHI",
        "type": [],
        "definition": [
            "Windows boshqaruvida ishlaydigan ilovalarni tez ishlab chiqishning dasturiy vositasi. Ilovalarda Oracle, Informix vositalari bilan saqlanadigan ma’lumotlardan foydalanilishi mumkin. «Mijoz – server» ilovalarni yaratish uchun foydalaniladi. Unumdorligi yuqori bo‘lgan 32 bitli kompilyatorni, ma’lumotlar bazalari bilan ishlaydigan masshtablanadigan vositalar va tez ishlab chiqish vizual vositalari bibliotekasini ichiga oladi. Borland firmasining ishlanmasi."
        ]
    },
    {
        "word": "Display Port",
        "type": [],
        "definition": [
            "Raqamli displeylar uchun belgilangan signal interfeys standarti. VESA (Video Electronics Standart Association) tomonidan 2006 yilning mayida qabul qilingan. Versiya 1.1 2007 yil 2 aprelda, 1.2 versiya 2010 yil 7 yanvarda qabul qilingan. Display Port dan audio-videoapparaturani, birinchi navbatda, kompyuterni displey bilan yoki kompyuter va uy kinoteatri tizimlarini ulash uchun eng zamonaviy interfeys sifatida foydalanish ko‘zda tutiladi."
        ]
    },
    {
        "word": "DOS Navigator",
        "type": [],
        "definition": [
            "Moldovaning Ritlabs kompaniyasi tomonidan ishlab chiqilgan, OS\/2 va DOS uchun mo‘ljallangan kon-solli fayl menejeri."
        ]
    },
    {
        "word": "Dasturni sozlash",
        "type": [],
        "definition": [
            "Dasturlarni ishlab chiqish bosqichlaridan biri; dastur yozilishining to‘g‘riligi tekshiriladi, xatolar aniqlanadi va to‘g‘rilanadi. Odatda, sozlash ma’lum natijalar bo‘lgan real namunalarga yaqin nazorat namunalarda bajariladi. Hozirgi dasturlash tillarida soz-lash jarayonini soddalashtiradigan sozlovchi dasturlar mavjud."
        ]
    },
    {
        "word": "Doimiy xotirlovchi qurilma",
        "type": [],
        "definition": [
            "Kompyuterni boshqarish uchun dasturlar doimiy saqlanadigan, bir yoki bir nechta mikrosxemadan iborat qurilma. Doimiy xotirlovchi qurilma energiyaga bog‘liq bo‘lmagan xotiradir, ya’ni kompyuter o‘chirilganda xotira ichidagi o‘zgarmaydi. Doimiy xotirlovchi qurilma shaxsiy kompyuterlarning apparat xususiyatlari va operatsion tizimning tayanch kiritish\/chiqarish tizimi to‘g‘risidagi ma’lumotlarni joylashtirish uchun xizmat qiladi. Ba’zi mashinalarda doimiy xotirlovchi qurilmaga bundan tashqari, dasturlash tilidan translyator yoziladi. Ko‘pincha, doimiy xotira deb ataladi."
        ]
    },
    {
        "word": "Dastur",
        "type": [],
        "definition": [
            "Muayyan vazifani bajarishga yo‘naltirilgan biron-bir dasturlash tilidagi komandalar ketma-ketligi yoki protsessor komandalari."
        ]
    },
    {
        "word": "Dasturlash",
        "type": [],
        "definition": [
            "Dasturiy ta’minot yaratish bo‘yicha nazariy va amaliy faoliyat. Dasturlashning nazariy masalalari yangi dasturlash tillarini ishlab chiqishga, dasturlarning to‘g‘riligini dalillash usullarini ishlab chiqishga, murakkabliklarni kamaytirishga taalluqli. Dasturlash amaliyoti translyatorlar, qulay dasturlash muhiti, aniq ma’lumotlar bazalari va boshqarish tizimlarni loyihalash, o‘qitishni ishlab chiqish bilan shug‘ullanadi. Dasturlash jarayoni – bu, nafaqat qandaydir tilda dastur tuzish, balki vazifaning qo‘yilishida, algoritmni ishlab chiqishda, ssenariyni yaratishda ishtirok etish hamdir. Dasturlashning o‘zi iteratsion jarayon bo‘lib, vazifani tushunishdan, algoritm, modullar ishlab chiqishdan, modullarni sozlashdan, test topshiriqni yechishdan, natijalarni solishtirishdan, vazifalar qo‘yilishini aniqlashtirishdan va keyingi iteratsiyadan iborat. Sifatli dasturlashni ta’minlash uchun, strukturaviy dasturlash texnologiyasi mavjud."
        ]
    },
    {
        "word": "Dasturiy mahsulot",
        "type": [],
        "definition": [
            "Bevosita foydalanishga tayyor, ilova qilinadigan hujjatlar bilan birgalikdagi dasturiy kompleks."
        ]
    },
    {
        "word": "Dasturlash tili",
        "type": [],
        "definition": [
            "Odam tomonidan ta’riflanadigan va kompyuter yordamida hal qilinadigan muayyan muammolarning qulay tavsiflanishini ta’minlaydigan formal til. Dasturlash tili sintaksis va semantika kabi ikkita tashkil etuvchidan iborat. Til konstruksiyalaridan mashina komandalariga o‘tishni til translyatori amalga oshiradi. Dasturlash tillari masalani qanday atamalarda ta’riflash kerakligiga ko‘ra, yuqori va quyi daraja tillariga ajratiladi. Agar, til tabiiy tilga yaqin bo‘lsa, yuqori daraja tili deb, mashina komandalariga yaqin bo‘lsa, quyi daraja tili deb ataladi."
        ]
    }
]