[
    {
        "word": "Egiluvchan magnit disk",
        "type": [],
        "definition": [
            "Plastmassa himoya o‘ramidagi egiluvchan plastmassadan qilingan disk. Disk magnit tarkib bilan qoplangan. O‘lchamlari diametrda 5,25 va 3,5 dyuym (inch) bo‘lgan disklar keng tarqalgan. Egiluvchan magnit disk bilan ishlash uchun egiluvchan magnit diskdagi to‘plagich zarur. Ma’lumotlarni uzoq vaqt saqlash uchun mo‘ljallangan, rezerv kopiyalarni saqlash va ma’lumotlarni bir kompyuterdan boshqasiga ko‘chirish uchun ishlatiladi. O‘qish\/yozish uchun tegishli diskovodlar talab qilinadi. Ma’lumotlar yo‘lkalar yoki treklar deb ataladigan konsentrik aylanalar bo‘ylab yoziladi."
        ]
    },
    {
        "word": "Elektron-nurli trubka asosidagi displey",
        "type": [],
        "definition": [
            "Ekranida tasvir elektron-nurli trubka yordamida yaratiladigan displey. Ishlash uchun, displeydan tashqari tegishli adapter yoki karta zarur bo‘ladi. Rangli tasvirni yaratish uchun va grafikadan foydalanish mumkin bo‘lishi uchun grafik adapter zarur. Elektron-nurli trubka asosidagi displeyda tasvir fluoressensiyalanadigan ekranni elektron nur bilan bombardimon qilish orqali yaratiladi. Nur ekran bo‘ylab chapdan o‘ngga, yuqoridan pastga harakatlanadi, bitta o‘tish ichida barcha gorizontal satrlar shakllantiriladi. Displeyning satr chastotasi – displey 1 s ichida shakllantiradigan satrlar soni; kadrlarning yangilanish chastotasi (kadr chastotasi) muhim ko‘rsatkichlar hisoblanadi. Raqamli boshqariladigan displeylar keng tarqalgan. Yaqin vaqtda displeyli panellarga ommaviy o‘tish kutilmoqda"
        ]
    },
    {
        "word": "Erkin foydalanish",
        "type": [],
        "definition": [
            "Xotiraning har qanday turida ma’lumotlarni o‘qish\/yozish mumkinligi. To‘g‘ridan-to‘g‘ri (ixtiyoriy) va ketma-ket erkin foydalanish metodlari ajratiladi, ular qurilma bilan qattiq bog‘langan. To‘g‘ridan-to‘g‘ri erkin foydalanish, ma’lum bir ma’lumotlarni o‘qish\/yozish, boshqa ma’lumotlarni o‘qimasdan\/yozmasdan turib mumkin bo‘lishligini bildiradi. Ketma-ket erkin foydalanish, zarur ma’lumotlarni o‘qish\/yozish uchun, barcha ma’lumotlar bo‘lmasa ham, ulardan ko‘pi ko‘rib chiqilishini bildiradi. Foydalanish huquqi administrator yoki resurs egasi tomonidan belgilanadi"
        ]
    },
    {
        "word": "E-praktikum",
        "type": [],
        "definition": [
            "O‘quvchilarni o‘qish-o‘rgatish uchun mo‘ljallangan dasturiy mahsulot. «Korvet», «UKNS», «Yamaxa» turidagi kompyuterlarda maktab informatika kursini qo‘llaydi. Tarkibida Pascal tiliga juda o‘xshash bo‘lgan ruscha leksikali til interpretatori bor; algoritmlar tushunchasini kiritish imkonini beradigan «chizmachi», «vezdexod» va boshqa bajaruvchilar to‘plami mavjud. Akademik P. Ershov sharafiga nomlangan."
        ]
    },
    {
        "word": "Eslep qalıwshı qurılma",
        "type": [],
        "definition": [
            "Ma’lumotlarni yozish, saqlash va berish uchun mo‘ljallangan qurilma. Xotirlovchi qurilmalarni ko‘plab parametrlar bo‘yicha tasniflash mumkin. Ma’lumotlarni uzoq muddatli va operativ saqlash, energiyaga bog‘liq bo‘lmagan va energiyaga bog‘liq; faqat ma’lumotlarni o‘qish (doimiy xotirlovchi qurilma, kompakt-disklar) va ham o‘qish, ham yozish uchun mo‘ljallangan qurilmalar farqlanadi. Ma’lumotlarni saqlashning fizik prinsiplariga bog‘liq ravishda, magnit, magnitooptik va yarimo‘tkazgichli qurilmalar farqlanadi. Xotirlovchi qurilmaning asosiy texnik xarakteristikalari ularning sig‘imi va tez ishlashi. Xotirlovchi qurilma ko‘pincha xotira deb ataladi."
        ]
    },
    {
        "word": "Ebtables",
        "type": [],
        "definition": [
            "Linux dasturiy ko‘priklar uchun belgilangan paket-larni filtrlash vositasi. Ebtables Iptables ga o‘xshay-di, lekin tarmoq sathida emas, balki tarmoq stekining kanal sathida ishlashligi bilan farq qiladi."
        ]
    },
    {
        "word": "Energy star",
        "type": [],
        "definition": [
            "Kompyuter iste’mol qiladigan energiya miqdorini kamaytirish hisobiga atrof muhitni muhofaza qilish dasturi. Enegy star belgisi bo‘lgan kompyuterlar kutish rejimida 60 W dan kam, monitor va tizim bloki 30 W dan kam energiya iste’mol qilishi kerak."
        ]
    },
    {
        "word": "ER modeli",
        "type": [],
        "definition": [
            "Real tizimlarda ma’lumotlar oqimlarini tavsiflash modeli. Bu modelda ma’lumotlar ma’nosi va ular o‘rtasidagi bog‘lanish nuqtai nazaridan tavsiflanadi."
        ]
    },
    {
        "word": "Ethernet",
        "type": [],
        "definition": [
            "Kompyuter tarmoqlarining paketli texnologiyasi. Tarmoq uzellari koaksial yoki optik tolali kabel yoki o‘ralgan juft orqali bog‘langan. Axborot boshqaruvchi va adresli, shuningdek, 1500 byte gacha ma’lumotni o‘zida saqlovchi o‘zgaruvchan uzunlikdagi kadrlar orqali uzatiladi. Ethernet standarti ma’lumotlar yuqori chastotali modulyatsiyalarsiz, sekundiga 10 Mbit\/s tezlik bilan uzatilishini ta’minlaydi."
        ]
    },
    {
        "word": "Excel",
        "type": [],
        "definition": [
            "Hisoblashlarni amalga oshirish uchun mo‘ljallangan dasturiy kompleks, kuchli elektron jadvallarni o‘zida ifodalaydi. Do‘stona interfeysga ega, Windows muhitida va Macintosh kompyuterlarida ishlaydi. Professional bo‘lmagan foydalanuvchilar tomonidan ishlatiladi. Exsel Microsoft Offic tizimi tarkibiga kiradi."
        ]
    },
    {
        "word": "Express Card",
        "type": [],
        "definition": [
            "Kompyuterga periferik qurilmalarni ulash imkonini beradigan interfeys."
        ]
    },
    {
        "word": "EyeOS",
        "type": [],
        "definition": [
            "Desktop Operating System prinsipiga asoslangan, ochiq kodli krossplatformali tarmoq operatsion tizimi. («Ishchi stol» yechimi qo‘llanilgan operatsion tizim) bazaviy komplekt operatsion tizim va bir qancha ofis ilovalarini: matn redaktori, kalendar, fayllar menejeri, messenjer, brauzer, kalkulyator va boshqalarni o‘z ichiga oladi."
        ]
    },
    {
        "word": "Ekranni himoyalash dasturi",
        "type": [],
        "definition": [
            "Klavish oxirgi marta bosilgandan yoki sichqoncha surilgandan keyin ma’lum vaqt o‘tgach, ekranni umuman o‘chiradigan yoki vaqtda o‘zgaradigan rasmni ko‘rsatadigan dastur. Bunday dasturlar ekran lyuminofori tez yonib tugashining oldini olish uchun mo‘ljallangan."
        ]
    },
    {
        "word": "Ekspert tizimi",
        "type": [],
        "definition": [
            "Malakali ekspertlarning bilimi, tajribasi hamda kompyuterlarning imkoniyatlari asosida vazifalarni hal qilish uchun yaratilgan sun’iy intellekt tizimi. Ekspert tizimi – bu, kompyuter uchun dastur bo‘lib, uning yordamida formal, absolyut aniq yechimlar olish mumkin bo‘lmagan vaziyatda maqbul yechim olish mumkin bo‘ladi. Ekspert tizimi odatda, uchta blokdan, ya’ni bilimlar bazasi, mantiqiy xulosa bloki, foydalanuvchi bo‘lgan interfeysdan iborat bo‘ladi."
        ]
    },
    {
        "word": "Elektron eʼlonlar taxtasi",
        "type": [],
        "definition": [
            "Terminal kira olish interfeysi orqali elektron pochtadan foydalanish, kerakli fayllarni ko‘chirib olish va alohida Internet-xizmatlaridan foydalanish tizimi. Uning asosini turli foydalanuvchilar joylashtirgan e’lonlar va ularni boshqa foydalanuvchilarga namoyish qilish maqsadida yuborilgan xabarlardan iborat maxsus ma’lumotlar bazasi tashkil qiladi."
        ]
    },
    {
        "word": "Elektron pochta",
        "type": [],
        "definition": [
            "Kompyuter tarmoqlarining maxsus ish rejimi, bir abonentdan boshqa biriga xabarlar uzatilishini va qabul qilinishini amalga oshirish imkonini beradi. Mazmuniga ko‘ra, bu oddiy pochtaga o‘xshash, lekin xabarning yetkazilish tezligida sezilarli ustunlik bor. Kompyuterdan kompyuterga uzatiladigan xat – fayl (odatda, matnli) shifrlanishi va bir qancha adresatga yuborilishi mumkin. Xatlar tarmoqning barcha abonentlari ega bo‘lgan elektron adreslar bo‘yicha avtomatik tarzda uzatiladi. Elektron pochtadan Internet, Realcom da keng foydalaniladi."
        ]
    },
    {
        "word": "Elektron jadval",
        "type": [],
        "definition": [
            "Har xil hisoblash vazifalari uchun mo‘ljallangan dasturiy mahsulot. Foydalanuvchiga yacheykalarida matnli va sonli ma’lumotlar, shuningdek, formulalar saqlanadigan jadval ko‘rinishida taqdim qilinadi. Qo‘yilgan formulalar bo‘yicha operativ hisoblash mumkin, ma’lumotlar o‘zgarganda avtomatik qayta hisoblash bajariladi. Elektron jadvallar ‒ boshqarish tizimi bilan birgalikdagi spetsifik ma’lumotlar bazasidir. Dasturchi bo‘lmagan foydalanuvchi uchun mo‘ljallangan."
        ]
    },
    {
        "word": "Elektron disk",
        "type": [],
        "definition": [
            "Operativ xotiraning qismidan dasturiy tarzda yaratilgan psevdodiskli to‘plagich. Operatsion tizim u bilan real mavjud bo‘lgan disk bilan ishlagandek ishlaydi. Ma’lumotlardan foydalanishni tezlatish maqsadida fizik mavjud diskdan ma’lumotlarni vaqtinchalik takrorlash uchun foydalaniladi, chunki operativ xotira diskli xotiraga nisbatan birmuncha tez ishlaydi. Ko‘pincha, virtual disk deb ataladi."
        ]
    },
    {
        "word": "Elektron kalit",
        "type": [],
        "definition": [
            "Dasturiy mahsulotlarni noqonuniy ko‘paytirish va foydalanishdan muhofaza qilish qurilmasi. Elektron kalit – bu qandaydir parol yozilgan xotirali mikrosxemadan iborat, kichik o‘lchamdagi blokdir. Blok kompyuterning parallel portiga ulanadi, printer yoki boshqa qurilmani ulashga xalaqit bermaydi. Himoyalangan dastur ishga tushirilganda elektron kalitda yozilgan parol tekshiriladi."
        ]
    },
    {
        "word": "Emulyator",
        "type": [],
        "definition": [
            "Emulyatsiya amalga oshiriladigan dastur, apparat-dasturiy tizim yoki mikrodastur. Emulyator yordamida kompyuter boshqa mashina, qurilma yoki operatsion tizim uchun yozilgan dasturlarni bajarishi mumkin. Ular ichki sxemali, shinali va dasturiy emulyatorlarga bo‘linadi. Odatda, biror-bir tashqi qurilma tomonidan amalga oshiriladigan funksiyani bajaradigan dastur."
        ]
    },
    {
        "word": "Emulyatsiya",
        "type": [],
        "definition": [
            "Apparat yoki dasturiy vositalar yoki ularning birikmasi bilan boshqa qurilmalar yoki dasturlar ishini qayta takrorlash."
        ]
    },
    {
        "word": "Energiyaga bogʻliq boʻlgan xotira",
        "type": [],
        "definition": [
            "Faqat kompyuter yoqilgandagina ma’lumotlarni (dasturlarni, o‘zgaruvchilarni) saqlash uchun mo‘ljallangan xotira qurilmasi. Kompyuter o‘chirilishi bilan (elektr energiya kelmaydi), xotira ichidagi yo‘qoladi, uni tiklash mumkin bo‘lmaydi. Operativ xotirlovchi qurilma bunday xotiraga misol bo‘ladi."
        ]
    },
    {
        "word": "Energiyaga bogʻliq boʻlmagan xotira",
        "type": [],
        "definition": [
            "Elektr ta’minoti mavjudligiga bog‘liq bo‘lmagan magnit, optik yoki har qanday boshqa yozuv prinsiplariga asoslangan, ma’lumotlarni saqlash uchun mo‘ljallangan xotira qurilmasi. Masalan, elektron disklardan tashqari, har qanday diskli xotira."
        ]
    },
    {
        "word": "Entropiya",
        "type": [],
        "definition": [
            "1 Axborot tizimi, masalan, Internet ichki tartibsizligi o‘lchovi. Entropiya tarmoq makonida axborot resurslari xaotik taqsimlanganda oshadi va tartiblashtirilganda kamayadi.\r\n 2 Bitta simvolga to‘g‘ri keladigan axborotning o‘rtacha miqdori."
        ]
    },
    {
        "word": "Estafetali halqa",
        "type": [],
        "definition": [
            "Halqa topologiyasiga mo‘ljallangan lokal kompyuter tarmog‘i turi. IBM firmasi tomonidan 1986 yilda ishlab chiqilgan. Ma’lumotlar uzatish tezligi 16 Mbyte\/s ga yetadi."
        ]
    }
]