[
    {
        "word": "Faylning yaratilish sanasi",
        "type": [],
        "definition": [
            "Ma’lum bir fayl yaratilgan kun, oy, yil. Bu sana fayl sarlavhasida saqlanadi, faylni to‘g‘rilashda joriy sanaga o‘zgartiriladi. Faylning yaratilish sanasini istalgan operatsion tizimda yoki qobiqda ko‘rish mumkin"
        ]
    },
    {
        "word": "Fayllar katalogi",
        "type": [],
        "definition": [
            "Disk xotirasini fayllar va boshqa kataloglar saqlanishi mumkin bo‘lgan qismlarga mantiqiy bo‘lish. Kataloglar yig‘indisi o‘zak katalogli kataloglar daraxtini hosil qiladi. Har bir katalogda boshqa kataloglar va fayllar bo‘lishi mumkin. Har bir katalog foydalanuvchi tomonidan beriladigan nomga ega; o‘zak katalog diskli operatsion tizimda «\/» (teskari slesh) standart nomga ega. Disk egasining o‘zi kataloglar daraxtini tuzishi mumkin, xususan, bu faqat, barcha fayllarni ichiga oladigan o‘zak katalog bo‘lishi mumkin."
        ]
    },
    {
        "word": "Fayl",
        "type": [],
        "definition": [
            "Yozuvlarning tartiblashtirilgan to‘plami yoki umumiy nom ostida kompyuter tizimida saqlanadigan ma’lumotlarning boshqacha bir yig‘indisi.\r\n Izoh ‒ Barcha fayllar ikkita katta klassga bo‘linadi – dastur fayllari (bajariladigan fayllar) va ma’lumotlar fayllari (bajarilmaydigan fayllar). Saqlanadigan ma’lumotlarning turiga ko‘ra, fayllar matnli, grafik, ikkilik, komanda, ma’lumotlar bazasining fayllari, video va audiofayllarga bo‘linadi."
        ]
    },
    {
        "word": "Fayl tizimi",
        "type": [],
        "definition": [
            "1 Operatsion tizimning bir qismi bo‘lib, diskdagi katalog va fayllar boshqarilishini ta’minlaydi.\r\n 2 Operatsion tizimda fayllarni nomlash, saqlash, va joylashni belgilovchi umumiy struktura. NTFS, FAT va FAT32 tizimlari fayl tizimlarining har xil turlari bo‘lib hisoblanadi."
        ]
    },
    {
        "word": "Fayl serveri",
        "type": [],
        "definition": [
            "Shaxsiy va ajratiladigan kataloglarda lokal tarmoq foydalanuvchilarining, ularning ishchi stansiyalaridan kira olish mumkin bo‘lgan fayllarini saqlaydigan server turi. Fayl-serverdan foydalanish tizimni boshqarishni yengillashtiradi va disk xotirasiga bo‘lgan ehtiyojni kamaytiradi. Fayl-server funksiyalari Novell NetWare va NFS operatsion ti-zimlarida mavjud."
        ]
    },
    {
        "word": "Faks-modem",
        "type": [],
        "definition": [
            "Faksimil xabarlarni qabul qilish imkoniga ega bo‘lgan kompyuterning dial-up-modemi. Faks-dastur bilan (masalan Venta Fax and Voice) kompyuter faks funksiyalarini bajarishi mumkin bo‘ladi."
        ]
    },
    {
        "word": "Filtr",
        "type": [],
        "definition": [
            "Kiruvchi ma’lumotlarni standart kiritishdan oladigan, ularni aniq bir tartib bo‘yicha qayta ishlaydigan va standart chiqarishga yo‘naltiradigan dastur. Indekslash xizmatida – hujjatlarni indekslash uchun ulardan mazmuni, xossalari qiymatini ajratib oladigan dasturiy vosita."
        ]
    },
    {
        "word": "Flops",
        "type": [],
        "definition": [
            "Kompyuterning tez ishlashini o‘lchash birligi; protsessor sekundiga bajaradigan siljiydigan nuqta (vergul) li operatsiyalar sonini bildiradi."
        ]
    },
    {
        "word": "Flesh-xotira",
        "type": [],
        "definition": [
            "Intel kompaniyasi tomonidan ishlab chiqilgan yarimo‘tkazgichli xotiraning energiyaga bog‘liq bo‘lmagan turi. Flesh-xotira elektr usul bilan o‘chirilishi mumkin, bu uni kompyuterdan olmay turib qayta dasturlash imkonini beradi. Xotiraning bu turi alohida baytlar bilan emas, balki faqat bloklar bilan o‘chirib bo‘lishligi sababli, operativ xotirlovchi qurilmaning asosiy komponenti sifatida yaroqsiz, biroq, flesh-xotiradan ko‘pincha RS-kartalarda, modemlarda va boshqa qurilmalarda, shuningdek, portativ kompyuterlarda qo‘shimcha xotira sifatida foydalaniladi."
        ]
    },
    {
        "word": "Fon jarayoni",
        "type": [],
        "definition": [
            "Asosiy harakatlar bilan bir vaqtda bajariladigan jarayon."
        ]
    },
    {
        "word": "Formallashtirish",
        "type": [],
        "definition": [
            "Tadqiqot obyektini, mumkin qadar, bu obyekt har xil ma’noda talqin qilinishligi istisno qilinadigan ko‘rinishda ta’riflash jarayoni."
        ]
    },
    {
        "word": "Formatlash",
        "type": [],
        "definition": [
            "Diskni foydalanish uchun tayyorlash – axborotlarni joylashtirish va o‘qib olish strukturasi va usullarini o‘rnatish jarayoni. Xotiraning diskli fazosi – ma’lumotlar kolleksiyasi ‒ «bo‘limlar» orqali tashkil qilinib, ularning har biri operatsion tizimga shunday joylashtiriladiki, bunda ma’lumotlarni tartiblash, izlash va tiklash imkoni mavjud bo‘ladi. Foydalanilayotgan disk formatlansa, unda oldin mavjud bo‘lgan axborot o‘chiriladi."
        ]
    },
    {
        "word": "Funksional klavishlar",
        "type": [],
        "definition": [
            "Klaviaturadagi F1 dan F10 (ba’zan F12) gacha belgilangan, dasturlashtiriladigan va har bir dasturda maxsus vazifasi bo‘lgan klavishlar guruhi."
        ]
    },
    {
        "word": "Funksional dasturlash tili",
        "type": [],
        "definition": [
            "Deklarativ turdagi dasturlash tili. Funksional tur tildagi dastur ma’lum funksiyalar yig‘indisi ko‘rinishida taqdim etiladi. Amalda barcha funksiyalar rekursiv. LISP va Logo funksional tillarning o‘ziga xos vakillaridir."
        ]
    },
    {
        "word": "Funksiya",
        "type": [],
        "definition": [
            "Dastur yoki tizim tomonidan hal qilinadigan masala yoki maqsad, shuningdek, qandaydir qurilmaning belgilangan vazifasi. Masalan, printerning funksiyasi ‒ bosib chiqarish, o‘qitish kompyuterning funksiyalaridan biri, matn redaktorining funksiyasi hujjatni tayyorlash."
        ]
    },
    {
        "word": "FIDONET",
        "type": [],
        "definition": [
            "Global notijorat kompyuter tarmog‘i. Telefon aloqa kanallari orqali ishlaydi. Tarmoqqa ulanish va unda ishlash bepul amalga oshiriladi (faqat telefon tarmog‘i xizmatlarining haqi to‘lanadi). Tarmoqdan pochta xabarlarini yuborish, telekonferensiyalar va e’lonlar taxtasi uchun foydalaniladi. Yoshlar orasida mashhur."
        ]
    },
    {
        "word": "Fire Wire",
        "type": [],
        "definition": [
            "Yuqori tezlikli periferik qurilmalar uchun belgilangan shina. 63 tagacha qurilma, shu jumladan, raqamli videoni ulash imkoniyatini beradi. Apple firmasi tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Fort",
        "type": [],
        "definition": [
            "Personal tizimlar bilan samarali ishlash uchun mo‘ljallangan dasturlash tili. Protseduraga yo‘naltirilgan tillarga kiradi, assembler tiliga yaqin. XX asr 70-yillarining boshida AQShda Ch.Mur tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Fortran",
        "type": [],
        "definition": [
            "1956 yilda yaratilgan dasturlash tili. Matematik, ilmiy va muhandislik masalalarini yechishga mo‘ljallangan. Fortran hozirga qadar ishlatilmoqda, Fortran 2003 standartning oxirgi versiyasi hisoblanadi."
        ]
    },
    {
        "word": "Free Radius",
        "type": [],
        "definition": [
            "Ochiq boshlang‘ich kodli Radius server. Bu boshqa tijorat Radius serverlar muqobilidir, chunki u bugungi kunda modulli va funksionaldir. Bundan tashqari, yoyish va foydalanuvchilarning soni nuqtai nazaridan qaralganda, dunyo Radius serverlari beshligiga kiradi. Free Radius tez, moslashuvchan, sozlanadigan, shuningdek, ko‘plab tijorat serverlariga nisbatan ko‘proq autentifikatsiyalash protokollarini qo‘llaydi. Hozirgi paytda tijorat Radius serverlarini ishlab chiqish uchun asos sifatida foydalaniladi."
        ]
    },
    {
        "word": "Foydalanuvchi",
        "type": [],
        "definition": [
            "O‘zining ishida u yoki bu darajada tarmoqdan, ma’lumotlar bazasidan, hisoblash tizimidan, kompyuterdan foydalanadigan tizim, tashkilot, odam. Juda keng tushuncha; operator, dasturchi, abonent tushunchalarining o‘rnini bosishi mumkin. Oxirgi foydalanuvchi tushunchasini ajratish zarur. Bu, odatda, tizim bilan bevosita ishlamaydigan, lekin uning ishlash natijasidan foydalanadigan foydalanuvchidir."
        ]
    },
    {
        "word": "Fayllarni uzatish protokoli",
        "type": [],
        "definition": [
            "IP protokollari to‘plamiga kiradigan, TCP\/IP tarmog‘i orqali ikkita turli xildagi mashinalar orqali fayllarni qidirish va jo‘natishni ta’minlovchi mijoz-server protokoli. Internet da FTP-serverlar bilan ishlashda qo‘llaniladi."
        ]
    }
]