[
    {
        "word": "Grafik adapter",
        "type": [],
        "definition": [
            "Shaxsiy kompyuterning, displeyli qurilma (odatda, monitor)ning grafik funksiyalarini ta’minlaydigan kengayish platasi. Grafik adapterlar, shuningdek, «displey adapterlari» va «videokartalar» deb ham ataladi."
        ]
    },
    {
        "word": "Grafik akselerator",
        "type": [],
        "definition": [
            "Markaziy protsessordan foydalanmasdan, grafik ma’lumotlar bilan ko‘plab operatsiyalarni bajarish imkonini beradigan qurilma. Grafik akseleratorlar shartli ravishda uch turga bo‘linadi: grafik qobiqlar uchun mo‘ljallangan, uch o‘lchamli grafikani yaratish uchun mo‘ljallangan (3D akseleratorlar), dinamik tasvirlarni tiklash uchun mo‘ljallangan grafik akseleratorlar."
        ]
    },
    {
        "word": "Geoinformatsion tizim",
        "type": [],
        "definition": [
            "Ma’lumotlar fizik obyektlarni va ularning fazoda joylashishi sxemalarini tavsiflaydigan informatsion tizim."
        ]
    },
    {
        "word": "Gigabayt (Gbyte)",
        "type": [],
        "definition": [
            "Kompyuter tizimlari xotira sig‘imini o‘lchash birligi 230 yoki 1.073.741.824 byte ga teng."
        ]
    },
    {
        "word": "Gipervizor",
        "type": [],
        "definition": [
            "Ayni bir xost-kompyuterda bir vaqtda bir qancha yoki ko‘plab operatsion tizimlar parallel bajarilishini ta’minlaydigan yoki bajarilishiga imkon yaratadigan dasturiy yoki apparat sxema. Gipervizor, shuningdek, operatsion tizimlarning bir-biridan izolyatsiya qilinishini, muhofazasini va xavfsizligini, ishga tushirilgan turli operatsion tizimlar o‘rtasida resurslar ajratilishini va bu resurslar boshqarilishini ham ta’minlaydi. Gipervizor qandaydir ma’noda minimal operatsion tizim (mikroyadro yoki nanoyadro) hisoblanadi."
        ]
    },
    {
        "word": "Giperkard",
        "type": [],
        "definition": [
            "Macintosh kompyuterida, 6-9 versiyalar MAC OS tizimida gipermedia ilovalar yaratish imkonini beradigan vizual dasturlash muhiti. Giperkardni, foydalanuvchiga qulay, interaktiv ko‘rinishda taklif etgan holda, matnlar, rasmlar, tovushlar, animatsiyani birga to‘plash imkonini beradigan «axborot tashkilotchisi» deb atash mumkin."
        ]
    },
    {
        "word": "Giperhavola",
        "type": [],
        "definition": [
            "Matndagi, dastur (brauzer) aniqlaydigan maxsus belgilar. Dastur berilgan matnning ko‘rsatilgan bo‘lagiga yoki umumiy holda boshqa kompyuterda joylashgan boshqa faylga o‘tishni amalga oshiradi. Giperhavolalar brauzer talablariga ko‘ra, matnni ishlab chiquvchi tomonidan qo‘yib chiqiladi."
        ]
    },
    {
        "word": "Gipermatn tavsiflash tili",
        "type": [],
        "definition": [
            "Web-brauzerning dizayn matnini loyihalash imkonini beradigan, maxsus simvollar (teglar)dan tarkib topgan, Web-hujjat matnini yozish tili. HTML tili shakllarni formatlash va qayta ishlash, shriftlarni boshqarish, ma’lumotlarni grafik ko‘rinishda uzatish, gipermatnli aloqalarni tashkil etish va Java appletlarni qo‘llab-quvvatlash imkonini beradi."
        ]
    },
    {
        "word": "Global oʻzgaruvchi",
        "type": [],
        "definition": [
            "Dasturlash tillaridagi o‘zgaruvchi; lokal o‘zgaruvchidan farqli ravishda, dasturning barcha protseduralarida va bloklarida foydalanilishi mumkin."
        ]
    },
    {
        "word": "Golografiya",
        "type": [],
        "definition": [
            "Fan va texnikaning, tabiati turlicha bo‘lgan to‘lqin maydonlarni yozish va qayta ishlash uchun mo‘ljallangan qurilmalar va usullar yaratish, ularni o‘rganish bilan shug‘ullanadigan bo‘limi."
        ]
    },
    {
        "word": "Graf",
        "type": [],
        "definition": [
            "Graflar nazariyasining asosiy tushunchasi, nuqtalar ko‘pligidan va nuqtalar juftining ba’zi turkumidan iborat struktura. Ilovalarda graf tarmoq ko‘rinishida ko‘rsatiladi, bu yerda uzellar nuqtalar ko‘pligi, uzellar birikmasi esa, qirralar deb ataladigan nuqtalar jufti. Yo‘naltirilgan va yo‘naltirilmagan graflar ajratiladi. Graflardan informatikada keng foydalaniladi."
        ]
    },
    {
        "word": "Grafika",
        "type": [],
        "definition": [
            "Matnli ma’lumotlar va grafik timsollar birlashtirilgan kompyuterda ma’lumotlarni vizual taqdim etishning eng umumiy usuli. Mashina tashuvchilarda grafik tasvirning o‘zini taqdim etishning rastrli va vektorli grafika kabi ikki turi bor."
        ]
    },
    {
        "word": "Grafik foydalanuvchi interfeysi",
        "type": [],
        "definition": [
            "Ma’lumotlarni vizuallashtirish imkonini beruvchi dastur. Grafik foydalanuvchi interfeysiga misollar: OSF\/Motif, Windows, OS\/2 Presentation Manager."
        ]
    },
    {
        "word": "Grafik redaktor (muharrir)",
        "type": [],
        "definition": [
            "Kompyuter yordamida ikki o‘lchovli tasvirlarni tuzish va tahrir qilish imkonini beradigan dastur (yoki dasturlar paketi).\r\n Izoh ‒ Grafik redaktorlarning turlari: 1 Rastrli grafik redaktorlar. Nisbatan ommalashgan redaktorlar: Microsoft Windows va MAC OS X operatsion tizimlari uchun Adobe Photoshop. GNU\/Linux va boshqa POSIX standartiga muvofiq operatsion tizimlari uchun GIMP redaktori. 2 Vektorli grafik redaktorlar. Nisbatan ommalashgan redaktorlar: Corel Draw, Macromedia Free Hand − Windows uchun, Inkscape − barcha operatsion tizimlar uchun."
        ]
    },
    {
        "word": "Grafik almashinish formati",
        "type": [],
        "definition": [
            "Aniq nomlanishi − GIF89A; grafik tasvirni siqish usuli va grafik fayllar formati, Internet sahifalarida ko‘proq ishlatiladigan format hisoblanadi; ma’lumotlarni yo‘qotmasdan siqishni ta’minlaydi."
        ]
    },
    {
        "word": "GeForce",
        "type": [],
        "definition": [
            "Iste’mol bozoriga yo‘naltirilgan, NVIDIA kompaniyasi asosiy platalarining grafik protsessorlari va chipsetlari oilasi brendi. GeForce grafik protsessorlaridan asosan, shaxsiy va ko‘tarib yuriladigan kompyuterlar uchun mo‘ljallangan videoadapterlarda foydalaniladi."
        ]
    },
    {
        "word": "Gipermatnni uzatish protokoli",
        "type": [],
        "definition": [
            "Gipermatnni uzatish uchun foydalaniladigan protokol. Protokolning asosiy vazifasi Web-server bilan aloqa oʻrnatish va HTML sahifalarini mijozning Web-brauzeriga yetkazilishini ta’minlash hisoblanadi. Protokol ishlashi uchun IP bogʻlanish orqali Internet ga ulanish talab etiladi. Web-hujjat olinadigan kompyuter adresi oldidan http:\/\/ prefiksi qoʻyiladi."
        ]
    }
]