[
    {
        "word": "Hisoblash mashinasi",
        "type": [],
        "definition": [
            "Matematik, asosan axborot bilan bog‘liq vazifalarni hal qilishda ma’lumotlarni avtomatik qayta ishlash uchun mo‘ljallangan dasturiy vositalar va qurilmalar kompleksi. Mashinani boshqarish ma’lumotlarni qayta ishlash, dasturlar ko‘rinishida mashinaga kiritiladigan algoritmlar bo‘yicha amalga oshiriladi. Dasturlar va ma’lumotlar mashina xotirasida saqlanadi. Asosiy qurilmasi markaziy protsessor."
        ]
    },
    {
        "word": "Hisoblash tarmogʻi",
        "type": [],
        "definition": [
            "Ma’lumotlarni tarmoq elementlari o‘rtasida uzatish uchun mo‘ljallangan kompyuterlar, yordamchi uskuna, aloqa kanallari va maxsus dasturiy ta’minot kompleksi. Hisoblash tarmoqlari vazifalarga, uskuna turiga hamda aloqa liniyalariga bog‘liq ravishda, lokal bo‘lmagan, korporativ, hududiy va global tarmoqlarga bo‘linadi. Tarmoqlar resurslardan yanada to‘liqroq foydalanish yoki ularni qayta taqsimlash uchun, katta hajmdagi ma’lumotlar uzatilgan holda, tez va avtomatik aloqa uchun yaratiladi."
        ]
    },
    {
        "word": "Hisoblash texnikasi",
        "type": [],
        "definition": [
            "Texnikaning, hisoblash mashinalari va ular bilan bog‘liq barcha qurilmalarni ishlab chiqish, ularni ishlab chiqarish va ulardan foydalanish masalalari bilan shug‘ullanadigan sohasi."
        ]
    },
    {
        "word": "Hisoblash eksperimenti",
        "type": [],
        "definition": [
            "Kompyuter modeli ishlab chiqilgan hodisa, jarayon, mashinani o‘rganish metodi. Hisoblash eksperimentining sifati, modelning real obyektga o‘xshashligiga va hisoblanadigan parametrlarni belgilaydigan eksperimentatorga bog‘liq. Hisoblash eksperimentining boshqa har qanday eksperimentdan afzalligi, tezligi-ning yuqori bo‘lishligida va xarajatlarning nisbatan kamligida. Texnika va informatikada, matematika, fizika, ximiya, biologiya, ekologiyada keng foydalaniladi."
        ]
    },
    {
        "word": "Hujjat",
        "type": [],
        "definition": [
            "1 Qayd etilgan ko‘rinishda belgilangan tartibda rasmiylashtirilgan axborotni ichiga oladigan, amaldagi qonunchilikka muvofiq huquqiy ahamiyatga ega bo‘lgan moddiy obyekt.\r\n 2 Qandaydir kompyuter dasturida ish natijalari saqlangan paytda yaratiladigan fayl. Matn redaktorlari fayllari, elektron jadvallar, rasmlar va boshqalar hujjatlarga misol bo‘lishi mumkin"
        ]
    },
    {
        "word": "Hujjatlashtirilgan axborot",
        "type": [],
        "definition": [
            "Moddiy tashuvchida qayd qilingan va identifikatsiya qilish imkonini beradigan rekvizitlarga ega bo‘lgan axborot"
        ]
    },
    {
        "word": "Hujjatlarni indekslash",
        "type": [],
        "definition": [
            "Axborot – qidiruv tili atamalarida so‘rovlar va hujjatlar mazmunini tavsiflash jarayoni; hujjatga, uning ma’naviy mazmunini aks ettiradigan asosiy so‘zlar to‘plamini belgilash."
        ]
    },
    {
        "word": "HDDSCan",
        "type": [],
        "definition": [
            "Axborot to‘plagichlarni testlash uchun belgilangan utilita (HDD, RAID, Flash). Dastur axborot to‘plagichlarni BAD-bloklar mavjudligiga diagnostikalash, to‘plagichning S.M.A.R.T – atributlarini ko‘rib chiqish, maxsus sozlashlarni (ta’minotni boshqarish, shpindelning start\/stop, akustik rejimni rostlash) o‘zgartirish uchun mo‘ljallangan."
        ]
    },
    {
        "word": "HFS+",
        "type": [],
        "definition": [
            "Apple Inc tomonidan, oldin foydalanilgan HFS ni, Macintosh kompyuterlaridagi asosiy fayl tizimni almashtirish uchun ishlab chiqilgan fayl tizimi. HFS+ MAC OS imkoniyatlarini kengaytirish uchun, HFS ning takomillashtirilgan versiyasi sifatida qarab chiqilishi mumkin. Ishlab chiqish vaqtida bu tizim Sequoia deb atalgan."
        ]
    },
    {
        "word": "Hot Java",
        "type": [],
        "definition": [
            "Internet tarmog‘ida WWW texnologiyasi bilan ishlash uchun belgilangan brauzer. Java tilida til imkoniyatlarini ko‘rsatish uchun ishlab chiqilgan, lekin mustaqil ahamiyatga ham ega."
        ]
    },
    {
        "word": "Huper Transport",
        "type": [],
        "definition": [
            "Yuqori o‘tkazish qobiliyatiga va kichik kechikish-larga ega bo‘lgan, ikki yo‘nalishli ketma-ket\/parallel kompyuter shinasi. To‘liq o‘lchamli, to‘liq tezlikli 32 bitli shina ikki yo‘nalishli rejimda o‘tkazish qobiliyatini 51600 Mbyte\/s gacha ta’minlashi mumkin."
        ]
    },
    {
        "word": "Hisobotlar va koʻchirmalar amaliy tili",
        "type": [],
        "definition": [
            "Umumiy shlyuz interfeysi ssenariylarini yaratish uchun mo‘ljallangan dasturlash tili. Talqin qiluvchi turdagi kuchli til. XX asrning 80-yillarida Lari Uoll tomonidan yaratilgan."
        ]
    }
]