[
    {
        "word": "Joystik",
        "type": [],
        "definition": [
            "Tizimga koordinatalar kiritishga mo‘ljallangan qurilma. Joystik plastmass g‘ilof shaklida yasalgan bo‘lib, unga tik ravishda dastak o‘rnatilgan. U hech bo‘lmaganda ikkita harakat erkinligi darajasiga ega. Boshqarish tugmachalari g‘ilofning ustida va qo‘l ushlagichning yuqori qismida joylashadi. Dastakning har tomonga harakatlanishi monitor ekranidagi kursorni boshqaradi. Joystik avtomatlashtirishning turli sohalarida va kompyuter o‘yinlarida ishlatiladi"
        ]
    },
    {
        "word": "JEIDA standarti",
        "type": [],
        "definition": [
            "Kompyuterga «kredit kartochkasi» turidagi har qanday qurilmalarni, jumladan, xotira kartalari, qattiq diskdagi to‘plagichlar, modemlarni ulash ta’minlanadigan standart."
        ]
    },
    {
        "word": "JIT-kompilyatsiya",
        "type": [],
        "definition": [
            "Bevosita dasturning ishlash vaqtida bayt-kodni mashina kodiga kompilyatsiya qilish yo‘li bilan, bayt-koddan foydalaniladigan dasturiy tizimlarning unumdorligini oshirish texnologiyasi."
        ]
    },
    {
        "word": "Java tili",
        "type": [],
        "definition": [
            "Operatsion tizimlardan tortib tarmoq ilovalarigacha bo‘lgan dasturiy mahsulotlarni yaratish uchun mo‘ljallangan, obyektga yo‘naltirilgan dasturlash tili. Java tili – tarkibiga o‘zining komandalar tizimiga ega virtual mashina kiradigan tizimning qismlaridan biridir. Java tilidagi dastur virtual mashina tilidagi dasturga kompilyatsiya qilinadi. Binobarin, Java-ilova virtual mashina interpretatori bo‘lgan har qanday mashinada bajarilishi mumkin."
        ]
    },
    {
        "word": "Java Script tili",
        "type": [],
        "definition": [
            "Ham server tomonda, ham mijoz tomonda bajariladigan ssenariylarni ishlab chiqish uchun mo‘ljallangan, obyektga yo‘naltirilgan til. Mijoz ilovalar HTML hujjatlarga o‘rnatiladi va ko‘rib chiqish paytida brauzer tomonidan talqin qilinadi, server ilovalar esa, bayt-kodlarga kompilyatsiya qilinadi. Java Script tili Netscape firmasi tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Joylashtirish",
        "type": [],
        "definition": [
            "Ma’lumotlarni, ularni qayta ishlash uchun mo‘ljallangan standart shakldan, saqlash va aloqa kanallari orqali uzatish uchun ixcham holda taqdim etiladigan shaklga o‘zgartirish jarayoni. Bu operatsiyani turli algoritmlar va turli siqish koeffitsiyentlari bilan amalga oshiradigan ko‘plab dasturlar mavjud. Joylashtirish mustaqil operatsiya, lekin arxivlashda ham foydalanilishi mumkin. Ba’zan, arxivlash yoki siqish deb ataladi."
        ]
    }
]