[
    {
        "word": "Kompyuter tarmogʻi adminstratori",
        "type": [],
        "definition": [
            "Tarmoqni joriy boshqarish va uni rivojlantirish istiqboli bilan shug‘ullanadigan shaxs yoki shaxslar guruhi. Asosiy vazifalari: ishonchli ishlashni ta’minlash, foydalanish (kirish) parollari va adreslarini aniqlash va berish, boshqa tarmoqlar bilan birgalikda ishlashni ta’minlash, ma’lumotlar baza-larining administratorlari bilan birgalikda ishlash. Boshqarish vositasi – tarmoq boshqaruv tizimi."
        ]
    },
    {
        "word": "Klaviaturasi boʻlmagan choʻntak kompyuteri",
        "type": [],
        "definition": [
            "Ma’lumotlarni kiritish uchun plastik perodan foydalaniladigan cho‘ntak kompyuteri turi. Pero bosilishga sezgir bo‘lgan displey sirtiga tekkiziladi. Matn yozma tarzda kiritiladi yoki virtual klaviaturada teriladi. Protsessorning takt chastotasi 200 MHz. Operativ xotira - 16\/32 Mbyte. Operatsion tizim asosan, MS Word va MS Excel portativ versiyalar kiritilgan Windows CE. Ma’lumotlarni uzatish uchun infraqizil port bilan jihozlangan, uning yordamida stol kompyuterlariga va sotkali telefonlarga ulanadi."
        ]
    },
    {
        "word": "Katta ikkilik obyekt",
        "type": [],
        "definition": [
            "Ba’zi dasturlash tillaridagi va ma’lumotlar bazalarini boshqarish tizimidagi, ixtiyoriy ikkilik axborotni saqlash uchun mo‘ljallangan, ma’lumotlar turi."
        ]
    },
    {
        "word": "Kompyuterning tez ishlashi",
        "type": [],
        "definition": [
            "Aniq bir kompyuterning ma’lumotlarni qayta ishlash tezligi. Ko‘pgina omillarga, jumladan, tashqi qurilmalarning tez ishlashiga bog‘liq. Kompyuterning tez ishlashini odatda, protsessorning tez ishlashi belgilaydi."
        ]
    },
    {
        "word": "Kiritish",
        "type": [],
        "definition": [
            "Ma’lumotlarni protsessorga, operativ xotiraga yoki tashqi qurilmaga yozish jarayoni. Foydalanuvchi tomonidan klaviaturadan, ovoz orqali; avtomatik tarzda tashqi qurilmadan amalga oshirilishi mumkin. Komandalarni (hajmi katta bo‘lmagan) joystik, sichqoncha, trekbol, perolar, trekpoint va sensor pa-nel yordamida kiritish mumkin."
        ]
    },
    {
        "word": "Kattalik",
        "type": [],
        "definition": [
            "O‘z nomi yoki qiymat bilan yoki ham unisi, ham bunisi bilan belgilanadigan ma’lumotlar elementi. Xotiraning bir qismi, nom (identifikator) va xotirada saqlanadigan qiymat bilan beriladi."
        ]
    },
    {
        "word": "Kompyuter virusi",
        "type": [],
        "definition": [
            "1 Hisoblash tizimiga, ma’lumotlarni buzish, o‘zgartirish yoki yo‘q qilish maqsadida kiritiladigan anonim dastur.\r\n 2 Quyidagi xususiyatlarga: o‘zini boshqa fayllarga, diskka, elektron hisoblash mashinasiga ko‘chirish; aniq chaqiruvsiz bajarish; axborotdan ruxsat etilmagan tarzda foydalanishni amalga oshirish; aniqlashga urinishdan maskirovka qilish imkoniyatiga ega dastur.\r\n 3 O‘zining nusxasini yoki boshqa zararli dasturlar yarata oladigan va ularni kompyuter fayllariga, tizim sohalariga kiritadigan, shuningdek, boshqa destruktiv harakatlarni amalga oshiradigan zararli dastur."
        ]
    },
    {
        "word": "Koʻrsatish uchun belgilangan versiya",
        "type": [],
        "definition": [
            "Dasturiy mahsulotning varianti; haqiqiy versiya to‘g‘risida maksimal darajada to‘liq tasavvur berishi kerak bo‘ladi. Bu versiyaga, odatda, ma’lumotlarning aniq namunalari qo‘yiladi, foydalanuvchining sharoitlariga sozlash uchun mo‘ljallangan dasturlar undan chiqarib tashlanadi. Odatda, bepul yetkazib beriladi, lekin undan amalda qo‘llash uchun foydalanishning imkoni yo‘q"
        ]
    },
    {
        "word": "Kompyuter oʻyini",
        "type": [],
        "definition": [
            "Kompyuter imkoniyatlaridan, uning interaktiv imkoniyatlaridan, video, audio effektlardan foydalanib tuzilgan o‘yin. O‘yinlar amaliy, rivojlantiruvchi, o‘qitadigan va ko‘ngil ochadigan o‘yinlarga bo‘linadi. Kompyuter tarmoqlaridan foydalanilgan virtual borliqni yaratadigan o‘yinlar ishlab chiqilgan. O‘yinlarning rivojlantirilishi butun bir yo‘nalish – o‘yin informatikasini yuzaga keltirdi."
        ]
    },
    {
        "word": "Kichik hisoblash tizimlari interfeysi",
        "type": [],
        "definition": [
            "Shaxsiy kompyuterlarning periferik qurilmalar (masalan, qattiq magnit disk, printer, lokal tarmoq) bilan birgalikda ishlashi uchun belgilangan standart. Yuqori tezlikli parallel interfeysni ta’minlaydi."
        ]
    },
    {
        "word": "Kadr",
        "type": [],
        "definition": [
            "Telekommunikatsiyada va kompyuter tarmoqlarida: aloqa kanali orqali uzatish uchun ma’lum bir formatdagi ma’lumotlar paketi; videografikada: videooqimdagi alohida kadr; NTML tili va Web-dizaynda: alohida Web-sahifani ko‘rsatuvchi brauzer oynasining sohasi; dasturlashda (asosan quyi darajali tillarda): funksiyaning lokal o‘zgaruvchilarini saqlash uchun ajratiladigan xotira sohasi."
        ]
    },
    {
        "word": "Kartrij",
        "type": [],
        "definition": [
            "Qurilmaning almashtiriladigan qismi. Odatda, bu, printer uchun bo‘yaydigan tasma, lazer printerlar yoki ko‘paytiruvchi apparatlar uchun toner, purkagichli printerlar uchun siyoh saqlanadigan kasseta."
        ]
    },
    {
        "word": "Kilobayt (Kbyte)",
        "type": [],
        "definition": [
            "Xotira hajmini yoki ma’lumotlar miqdorini o‘lchash birligi. 210=1024 byte ga teng."
        ]
    },
    {
        "word": "Klaviatura",
        "type": [],
        "definition": [
            "Ma’lumotlarni kompyuterga qo‘lda kiritish uchun xizmat qiladigan qurilma. Klaviaturalar klavishlar soni bilan ajralib turadi. IBM o‘xshash kompyuterlar uchun 101 ta klavishli klaviatura standart hisoblanadi, bu klaviaturada funksional klavishlar, harflar, raqamlar va yordamchi simvollar bloklari, kursorni boshqarish klavishlari; raqamli klaviatura (kiritish oson bo‘lishi uchun takrorlanadi) bloklari ajratilgan. Klavishlar har gal bosilganda protsessorga klavishda chizilgan simvol kodi emas, balki keyin dasturiy yo‘l bilan simvol bilan bog‘lanadigan kla-vish kodi yuboriladi. Bunday yondashuv teriladigan simvollarni tez o‘zgartirish imkonini beradi."
        ]
    },
    {
        "word": "Klaster",
        "type": [],
        "definition": [
            "Ma’lumotlarni saqlash tizimlarida – qayd etilgan sonli sektorlardan tashkil topgan, operatsion tizimlarda ma’lumotlarni o‘qish va yozish uchun ishlatiladigan diskning butun qismi. Disk fazosining fayllarni joylashtirish uchun ajratiladigan minimal qismi. Klasterning o‘lchami qanchalik kichik bo‘lsa, disk xotirasidan shunchalik samarali foydalaniladi."
        ]
    },
    {
        "word": "Klon",
        "type": [],
        "definition": [
            "Avval yaratilgan boshqa vositalarga funksional jihatdan o‘xshash bo‘lgan texnik yoki dasturiy vositalar."
        ]
    },
    {
        "word": "Kalit",
        "type": [],
        "definition": [
            "Ma’lumotlar bazasini boshqarish tizimidagi kalit. Baza faylida xabarni identifikatsiya qilish va unga tez kira olishni ta’minlash uchun ishlatiladigan belgilar ketma-ketligi."
        ]
    },
    {
        "word": "Kod",
        "type": [],
        "definition": [
            "Simvollar to‘plami. Kompyuter o‘yinlarida, kom-pyuter dasturining dastlabki matnida yoki klavia-turaning taqsimlanishida parol bo‘lishi mumkin."
        ]
    },
    {
        "word": "Kodek",
        "type": [],
        "definition": [
            "Videoma’lumotlar va tovushni kompres-siya\/dekompressiyalaydigan qurilma. Videokonfe-rensiya o‘tkazilganda, u mikrofon va kameradan analog signallarni qabul qiladi. Bu signallar diskret shaklga o‘zgartiriladi va tarmoq orqali boshqa tizimga yuboriladi. Kodek tarmoq orqali boshqa tizimning diskret signallarini qabul qilib, ularni analog signallarga o‘zgartiradi va radiokarnaylar hamda monitorlar orasida taqsimlaydi."
        ]
    },
    {
        "word": "Kod jadvali",
        "type": [],
        "definition": [
            "Klaviaturada simvollar to‘plamini operativ o‘zgartirish uchun mo‘ljallangan simvollarni kodlash jadvali. Windows va OS\/2 operatsion tizimlarda qo‘llaniladi."
        ]
    },
    {
        "word": "Komanda",
        "type": [],
        "definition": [
            "Bajaruvchiga, uning uchun tushunarli tilda berilgan va bajaruvchining harakatini qat’iy belgilaydigan ko‘rsatma. Komanda turli usullar bilan berilishi mumkin; kompyuterda bu simvollarning ma’lum bir to‘plami, agar kiritish klaviatura orqali amalga oshirilsa, va\/yoki elektr signallar, agar kiritish portlar orqali (masalan, modem bo‘ylab) amalga oshirilsa."
        ]
    },
    {
        "word": "Kompakt-disk",
        "type": [],
        "definition": [
            "Ma’lumotlarni doimiy saqlash uchun mo‘ljallangan disk, himoyalovchi shaffof plyonka bilan qoplangan alyumin qotishmadan qilingan doirani o‘zida ifodalaydi."
        ]
    },
    {
        "word": "Kompilyator",
        "type": [],
        "definition": [
            "Ishlab chiqiladigan dasturning boshlang‘ich kodining dasturlash tilidan mashinaga tushunarli bo‘lgan bajariladigan kodga o‘zgartirilishini amalga oshiradigan dastur."
        ]
    },
    {
        "word": "Kompilyatsiya",
        "type": [],
        "definition": [
            "Biror-bir dasturlash tilida yozilgan dasturni unga ekvivalent bo‘lgan tilga (mashina tili yoki oraliq til) o‘girish. Kompilyatsiya jarayoni mantiqan boshlang‘ich matnni tahlil qilish, sintezlash yoki kodni generatsiya qilishga asoslangan bosqichlardan iborat. Fizik jihatdan – har bir bosqichda kompilyator boshlang‘ich matnni boshdan oxirigacha tekshirib chiqadi."
        ]
    },
    {
        "word": "Komponovkachi",
        "type": [],
        "definition": [
            "Dasturlash tizimining bir qismi yoki mustaqil dastur, obyekt modullardan va bibliotekadan olinadigan standart qismlardan bajariladigan dasturni yig‘adi."
        ]
    },
    {
        "word": "Kompyuter",
        "type": [],
        "definition": [
            "Komandalarni bajara oladigan raqamli (diskret) hisoblash mashinasi. Kompyuterning asosiy vazifasi – dasturlar yordamida ma’lumotlarni qayta ishlashdir. Kompyuterda apparatura qism va dasturiy ta’minot ajratiladi. Apparatura qismning asosini mikroprotsessor tashkil qiladi. Dasturiy ta’minot asosi – operatsion tizim."
        ]
    },
    {
        "word": "Kompyuter tarmogʻi",
        "type": [],
        "definition": [
            "Resurslardan birgalikda foydalanish va ma’lumotlar almashinish uchun, aloqa kanallari bilan o‘zaro bog‘langan kompyuterlar va tarmoq uskunasi jami. Resurslar – bu uskuna, dasturlar va ma’lumotlar bazasidir."
        ]
    },
    {
        "word": "Konveyer",
        "type": [],
        "definition": [
            "Dasturlar yoki modullarni bir-biriga ketma-ket ulash metodi."
        ]
    },
    {
        "word": "Konversiyalash",
        "type": [],
        "definition": [
            "Bir formatda yozilgan ma’lumotlarni boshqa bir formatga o‘zgartirish jarayoni."
        ]
    },
    {
        "word": "Konkatenatsiya",
        "type": [],
        "definition": [
            "Simvollarning bir nechta satrini bitta satrga birlashtirish operatsiyasi. Dasturlash tillarida bu ope-ratsiyani bajaradigan maxsus funksiyalar mavjud. Masalan, Pascal tilida konkatenatsiya operatsiyasi + bilan belgilanadi."
        ]
    },
    {
        "word": "Konsol",
        "type": [],
        "definition": [
            "Foydalanuvchi tomonidan kompyuter ishini boshqarish uchun mo‘ljallangan qurilma. Masalan, klaviatura, displey, sichqoncha konsol qurilmalardir."
        ]
    },
    {
        "word": "Konstanta",
        "type": [],
        "definition": [
            "Xotirada joy egallaydigan, nom va muayyan turga ega bo‘lgan, ma’lumotlar elementi; o‘zgaruvchidan farqli ravishda, uning qiymati hech qachon o‘zgarmaydi. Dasturlashda foydalaniladi."
        ]
    },
    {
        "word": "Konteyner",
        "type": [],
        "definition": [
            ""
        ]
    },
    {
        "word": "Kontekst",
        "type": [],
        "definition": [
            "Matnning, qandaydir so‘z yoki jumlaning ahamiyatini aniqlash imkonini beradigan qismi."
        ]
    },
    {
        "word": "Kontroller",
        "type": [],
        "definition": [
            "Periferik uskunani boshqarish va ma’lumotlarni markaziy protsessor uchun oldindan qayta ishlash uchun mo‘ljallangan qurilma. Alohida qurilmalar uchun protsessor komandalari interpretatsiya qilinishini bajaradi."
        ]
    },
    {
        "word": "Konfiguratsion fayl",
        "type": [],
        "definition": [
            "Tizimning tarkibiy qismlari, tizimning muayyan sozlanishini belgilaydigan yordamchi parametrlar tavsiflanadigan fayl. Konfiguratsion fayllar deyarli barcha kuchli tizimlarda bor. Odatda, bu, tizimning o‘zi interpretatsiya qiladigan matnli fayllardir."
        ]
    },
    {
        "word": "Konfiguratsiya",
        "type": [],
        "definition": [
            "Texnik va\/yoki dasturiy tizimning tarkibi. Ba’zan, konfiguratsiya deyilganda nafaqat tizimning tarkibi, balki topologiyasi ham tushuniladi."
        ]
    },
    {
        "word": "Kontsentrator",
        "type": [],
        "definition": [
            "1 Ko‘plab abonent liniyalari, stansiyalari yoki boshqa konsentratorlar ulanadigan aktiv yoki passiv qurilma. Bunday qurilmaning chiqish uchlari kirish uchlariga qaraganda ancha kam. Qo‘llash sohasiga bog‘liq ravishda konsentrator funksiyalari an’anaviy kanallar konsentratori funksiyalaridan farq qilishi mumkin. Jumladan, lokal aloqa tarmoqlarida u ko‘p portli takrorlagich funksiyasini bajaradi.\r\n 2 Markaziy stansiya. Tarmoqning, «yulduz» topologiyali tarmoqlarda radial bog‘lanishlarni tashkil qilish uchun mo‘ljallangan kommutatsion yadrosi.\r\n 3 Markaziy kross (strukturalangan kabelli tizimlarda)."
        ]
    },
    {
        "word": "Konyunksiya",
        "type": [],
        "definition": [
            "Mantiqiy amal. P va Q mulohazalar chin bo‘lgandagina chin bo‘ladigan, boshqa barcha hollarda yolg‘on bo‘ladigan yangi mulohaza P va Q mulohazalarning konyunksiyasi deb ataladi. (P&Q kabi belgilanadi, «ham P ham Q» deb o‘qiladi)."
        ]
    },
    {
        "word": "Kriptografiya",
        "type": [],
        "definition": [
            "1 Ma’lumotlarning semantik mazmunini yashirish, ulardan ruxsat etilmagan tarzda foydalanish yoki ularning aniqlab bo‘lmaydigan o‘zgartirilishini oldini olish maqsadida, ma’lumotlarni o‘zgartirish prinsiplari, vositalari va metodlarini, qamrab oluvchi fan.\r\n 2 Telekommunikatsiyalar kanallari orqali uzatishda yoki saqlashda, ma’lumotlarning maxfiyligi va\/yoki haqiqiyligini ta’minlash metodlari haqidagi fan.\r\n 3 Axborotni tushunarsiz ko‘rinishga keltirish prinsiplari, vositalari va metodlari, shuningdek, uni qabul qilish uchun yaroqli ko‘rinishga qayta tiklash."
        ]
    },
    {
        "word": "Krossplatformali dasturiy taʼminot",
        "type": [],
        "definition": [
            "Bittadan ko‘p apparat platformada va\/yoki operatsion tizimda ishlaydigan dasturiy ta’minot. Bir vaqtda Linux hamda Windows operatsion tizimlarida ishlash uchun mo‘ljallangan dasturiy ta’minot bunga tipik misol bo‘la oladi."
        ]
    },
    {
        "word": "Kross-tizim",
        "type": [],
        "definition": [
            "Dasturlar yaratish imkoniyati bo‘lmagan va tayyor dastur «tikiladigan» ixtisoslashtirilgan kompyuterlar uchun dasturlar ishlab chiqish imkonini beradigan dasturiy vosita (universal kompyuterdagi)."
        ]
    },
    {
        "word": "Kursor, koʻrsatkich",
        "type": [],
        "definition": [
            "Kompyuter tizimi monitoriga chiqariladigan va berilgan onda foydalanuvchi ishlaydigan joyni ko‘rsatadigan maxsus belgi."
        ]
    },
    {
        "word": "Kesh-xotira",
        "type": [],
        "definition": [
            "Ma’lumotlarni vaqtinchalik saqlash uchun xizmat qiladigan xotira. Kompyuterning ishlash samaradorligini oshirish uchun foydalaniladi. Operativ xotira va qattiq magnit disk o‘rtasidagi kesh-xotira ikki turda bo‘ladi; apparat va dasturiy kesh-xotira. Apparat kesh-xotiradan odatda, tarmoq serverlarida, diskli adapterlarda (kontrollerlarda) foydalaniladi, u yarimo‘tkazgichli, energiyaga bog‘liq, juda tez ishlaydigan xotirani o‘zida ifodalaydi. Dasturiy kesh-xotira operativ xotiraning bir qismidir, odatda, stol tizimlarida tashqi xotira bilan ishlash samaradorligini oshirish uchun foydalaniladi."
        ]
    },
    {
        "word": "Kirishlarni hisoblagich",
        "type": [],
        "definition": [
            "Web-sahifa yoki saytga kiruvchilar va\/yoki kirishlar sonini hisoblash imkonini beradigan skrip."
        ]
    },
    {
        "word": "Komponentlarning obyekt modeli",
        "type": [],
        "definition": [
            "Microsoft kompaniyasining har biri bir vaqtning o‘zida bir nechta dasturda ishlatilishi mumkin bo‘lgan, o‘zaro birga ishlaydigan taqsimlangan komponentlar asosida dasturiy ta’minot yaratish uchun mo‘ljallangan texnologik standarti."
        ]
    },
    {
        "word": "Kengayish platasi",
        "type": [],
        "definition": [
            "Kiritish\/chiqarish qurilmalari (diskovodlar, modemlar, tarmoq) adapterlari o‘rnatilgan bosma plata."
        ]
    },
    {
        "word": "Kichik katalog",
        "type": [],
        "definition": [
            "Boshqa katalogga kiradigan fayllar katalogi."
        ]
    },
    {
        "word": "Kichik dastur",
        "type": [],
        "definition": [
            "Dasturning maxsus ravishda rasmiylashtirilgan qismi; unga zarur bo‘lganda boshqa dasturlardan murojaat qilish mumkin. Ko‘plab dasturlash tillarida protsedura tushunchasi bilan mos tushadi. Dastur-ning tez-tez takrorlanadigan fragmentlarini almashtirish va uning kompaktligiga erishish uchun foydalaniladi."
        ]
    },
    {
        "word": "Ketma-ket port",
        "type": [],
        "definition": [
            "Ma’lumotlar o‘tish tartibiga ko‘ra bitma-bit uzatiladigan port; ma’lumotlar parallel portga qaraganda birmuncha sekin uzatiladi. Odatda, ketma-ket portga modem ulanadi."
        ]
    },
    {
        "word": "Kompakt-diskdagi doimiy xotirlovchi qurilma",
        "type": [],
        "definition": [
            "1 Kompyuter va boshqa kompyuterlashtirilgan qurilmalar uchun mo‘ljallangan, kompakt-diskda joylashtirilgan tashqi doimiy xotira. Foydalanuchi-ning ma’lumotlar bloki diskda 2048 byte ni egallaydi. Har bir blokdagi 304 byte dan qo‘shimcha axborot va xatolarni to‘liq kuzatib borish va tuzatish uchun foydalaniladi. To‘la fizik blok 2352 byte ni egallaydi.\r\n 2 Kompakt - disklarni o‘qish uchun mo‘ljallangan qurilma."
        ]
    },
    {
        "word": "Kengayish",
        "type": [],
        "definition": [
            "Fayl nomining bir qismi; uning yordamida fayllarni tasniflash amalga oshiriladi. Masalan, MS-DOS da kengayish, agar bor bo‘lsa, nuqtadan keyingi (bittadan uchtagacha) simvoldan iborat bo‘lishi mumkin; kengayishdan bajariladigan fayllarni (.COM, .EXE, .BAT), turli dasturlash tillari dasturlarining matnlarini ajratish uchun (BAS – BASIC, PAS – Pascal) foydalaniladi."
        ]
    },
    {
        "word": "Kengaytirilgan fayllarning joylashish jadvali",
        "type": [],
        "definition": [
            "Asosan, flesh-to‘plagichlar uchun mo‘ljallangan proprietar fayl tizimi. Birinchi marta Microsoft firmasi tomonidan Windows Embedded CE 6.0.da o‘rnatilgan qurilmalar uchun taqdim etilgan."
        ]
    },
    {
        "word": "Kengayadigan belgilash tili",
        "type": [],
        "definition": [
            "WWW tarmog‘ida gipermatnli hujjatlarni tayyorlash, saqlash va uzatish uchun mo‘ljallangan til."
        ]
    },
    {
        "word": "Kiritish\/chiqarish qurilmalari",
        "type": [],
        "definition": [
            "Turli ish prinsiplariga asoslangan, lekin funksional jihatdan ma’lumotlar, komandalar kiritilishini va ma’lumotlar chiqarilishini bajaradigan fizik qurilmalar. Ma’lumotlarni kiritish qurilmalari: manipulyatorlar (klaviatura, sichqoncha, joystik, trekbol, trekpoint, skaner, pero, sensorli panel), datchiklar, mikrofon, videokamera. Ma’lumotlarni chiqarish qurilmalari: printer, plotter, radiokarnay, televizor. Kiritish\/chiqarish qurilmalari: telefon, teletayp, teletekst, telefaks, displey."
        ]
    }
]