[
    {
        "word": "Maʼlumotlar bazasi administratori",
        "type": [],
        "definition": [
            "Ma’lumotlar bazasini joriy boshqarish bilan shu-g‘ullanadigan va uning ishlash texnologiyasi uchun mas’ul bo‘lgan shaxs yoki shaxslar guruhi. Asosiy vazifalari: ishonchli ishlashni ta’minlash, yaxlitlikni ushlab turish, ruxsat etilgan tarzda foydalanishni ta’minlash, ma’lumotlarni restrukturalizatsiyalash, aktuallashtirish. Boshqarish vositasi – maxsus das-turlar."
        ]
    },
    {
        "word": "Maʼlumotlarni asinxron uzatish",
        "type": [],
        "definition": [
            "Uzluksiz xabarlar oqimidan ma’lumotlarni olish metodi va uzatish usuli; uzatuvchi tomon har bir ma’lumotga, ma’lumot qaerda tugashini ko‘rsatadigan start va stop bitlarini kiritadi. Bu, ma’lumotlar uzatishning, modemli aloqada qo‘llaniladigan ancha ishonchli usulidir."
        ]
    },
    {
        "word": "Maʼlumotlar bazasi",
        "type": [],
        "definition": [
            "Amaliy dasturlarga bog‘liq bo‘lmagan, ma’lumotlarni tavsiflash, saqlash va ular bilan ishlashning umumiy prinsiplarini ko‘zda tutadigan ma’lum bir qoidalar bo‘yicha tashkillashtirilgan ma’lumotlar jami; o‘zaro bog‘langan ma’lumotlarni, izlab topishni soddalashtirish maqsadida, bitta yoki bir nechta jadvalga to‘plash metodi, shuningdek, ma’lumotlarning yangilanishini va axborotdan erkin foydalanishni ta’minlaydigan dastur – ma’lumotlar bazasini boshqarish tizimining boshqaruvida foydalaniladigan, o‘zaro bog‘langan ma’lumotlar (axborot) jami."
        ]
    },
    {
        "word": "Maʼlumotlar banki",
        "type": [],
        "definition": [
            "Muayyan tarzda tashkillashtirilgan axborotdan (ma’lumotlardan) jamoaviy foydalanish va markazlashtirilgan tarzda saqlashning avtomatlashtirilgan axborot tizimi. Uning tarkibiga bitta yoki bir nechta ma’lumotlar bazasi, ma’lumotlar bazasi spravochnigi, ma’lumotlar bazasini boshqarish tizimi, shuningdek, amaliy dasturlar va so‘rovlar bibliotekalari kiradi."
        ]
    },
    {
        "word": "Mulohaza",
        "type": [],
        "definition": [
            "Matematik mantiqning, darak gap sifatida aniqlanadigan tushunchasi; chin yoki yolg‘on bo‘lishi mumkin, lekin bir vaqtda chin yoki yolg‘on bo‘lishi mumkin emas. Informatikada bu tushuncha, mulohaza – bu mantiqiy ifoda degan tavsifgacha torayadi. Mulohazalar ustida mantiqiy amallar bajarilishi mumkin. Oddiy mulohazalardan murakkab mulohazalar quriladi."
        ]
    },
    {
        "word": "Maʼlumotlar",
        "type": [],
        "definition": [
            "Axborotning, sonlar, harflar, simvollar kabi, odam, kompyuter yoki mashina yaratadigan va qayta ishlaydigan, bazaviy elementlari, unga raqamli (ikkilik) ko‘rinishda saqlanadigan va muayyan maqsadlar uchun tayyorlangan axborot ham kiradi. Nutq, matn, faksimil xabarlarni, dinamik tasvirlarni ichiga olishi mumkin"
        ]
    },
    {
        "word": "Modul boʻyicha boʻlish",
        "type": [],
        "definition": [
            "Arifmetik amal. Uning natijasi ‒ butunga bo‘lish qoldig‘i. Deyarli barcha dasturlash tillarida bor. a mod b ko‘rinishida belgilanadi"
        ]
    },
    {
        "word": "Masofadan taʼlim",
        "type": [],
        "definition": [
            "1 Masofadan o‘qitish usullaridan foydalanish asosida aholining keng qatlamlariga taqdim etiladigan ta’lim xizmatlarining zamonaviy kompleksi.\r\n 2 Ta’lim xizmatlarini taqdim etadigan o‘quv yurtidan geografik jihatdan olisda bo‘lgan o‘quvchilarga ta’lim olish imkonini beradigan vositalar va chora-tadbirlar yig‘indisi"
        ]
    },
    {
        "word": "Masofadan oʻqish-oʻqitish",
        "type": [],
        "definition": [
            "O‘qituvchi va o‘quvchi o‘rtasida bevosita, shaxsiy muloqotsiz masofadan turib o‘qish-o‘qitishni amalga oshirish imkonini beradigan zamonaviy axborot hamda telekommunikatsiya texnologiyalaridan foydalanishga asoslangan, o‘qish-o‘qitish jarayonini amalga oshirish usuli. «Ochiq o‘qish-o‘qitish» tushunchasiga yaqin"
        ]
    },
    {
        "word": "Muhofaza qilish",
        "type": [],
        "definition": [
            "Ma’lumotlarning saqlanishligini ta’minlash, tizimdan va ma’lumotlardan ruxsat etilmagan tarzda (ataylab yoki tasodifan) foydalanishni bartaraf etish uchun mo‘ljallangan vositalar, metodlar, usullar. Tasodifiy to‘xtab qolishlardan, tizimda yo‘l qo‘yib bo‘lmaydigan harakatlardan, viruslardan muhofaza qilish mavjud. Ko‘pgina ma’lumotlar ochiq aloqa kanallari orqali uzatiladi, shuning uchun, xabarlarni muhofaza qilish uchun maxsus shifrlardan foydalaniladi."
        ]
    },
    {
        "word": "Manba",
        "type": [],
        "definition": [
            "Ma’lumotlar ko‘chiriladigan yoki nusxa olinadigan disk, fayl, hujjat yoki xotira maydoni."
        ]
    },
    {
        "word": "Mijoz",
        "type": [],
        "definition": [
            "«Mijoz ‒ server» arxitekturasiga taalluqli tushuncha. Boshqa kompyuterlar va dasturlarning resurslaridan foydalanadigan kompyuter yoki dastur. Masalan, kompyuter tarmog‘ida ma’lumotlar bazasi saqlanadigan kompyuter server deb, serverdan ba’zi ma’lumotlarni so‘raydigan boshqa bir kompyuter esa mijoz deb ataladi. Bunday ishni ta’minlaydigan dasturlar mos ravishda, server dastur va mijoz dastur deb ataladi."
        ]
    },
    {
        "word": "Maʼlumotlar bazasini boshqarish tizimi (MBBT)",
        "type": [],
        "definition": [
            "Rivojlangan so‘rovlar tili yordamida ma’lumotlar bazasi ma’lumotlari tuzilmasini hosil qilish, saqlash, yangilash, yangi ma’lumotlar qo‘shish, izlash amallarining bajarilishini ta’minlaydigan dasturiy ta’minot. Zamonaviy MBBTlari tranzaksiya mexa-nizmi orqali ma’lumotlardan bir vaqtda ko‘plab foydalanuvchilarning erkin foydalanishlarini ta’minlaydi. Bunda bir foydalanuvchining olgan natijasi boshqasinikiga ta’sir qilmaydi. Ma’lumotlar bazalarini boshqarish tizimi tarkibiga dasturlash tili; dasturlar generatorlari – dasturlar tuzilishini, ma’lumotlar bazasi (MB) yaratilishini va ularning qayta ishlanishini osonlashtiradi; kompilyatorlar – mashina kodlaridagi boshqarish dasturlarini, dasturlarning ishlashini tezlashtirish va ularning muhitga bog‘liq bo‘lmasligi uchun generatsiyalaydi; hisobot generatorlari – foydalanuvchiga chiqish hujjatlarini operativ yaratish, tanlab olish, saralash va hisoblashlarni bajarish imkonini beradi; hujjatlashtirish vositalari – MB ni yaratish bilan bir vaqtda, matn va grafik ko‘rinishlarda uning tavsifini yaratish, listinglar bo‘lgan dasturlarni tavsiflash imkonini beradi. Ma’lumotlar bazalarining turlariga ko‘ra, ierarxik, tarmoq va relyatsion MBBT mavjud. Amalda barcha MBBT «mijoz ‒ server» arxitekturali tarmoqda ishlashni ta’minlaydi."
        ]
    },
    {
        "word": "Maʼlumotlar uzatish tezligi",
        "type": [],
        "definition": [
            "Ma’lumotlar xotiradan operativ xotiraga uzatiladigan tezlik. Bu tezlik tashqi xotira bo‘lgan lokal shina turiga, periferik qurilmalar bo‘lgan interfeys turiga bog‘liq. Kompyuter tarmoqlarda ma’lumotlar almashinish tezligi. Kanalning holati va ma’lumotlar uzatish apparaturasi bilan belgilanadi."
        ]
    },
    {
        "word": "Muhit",
        "type": [],
        "definition": [
            "Tizim (obyekt) ishlaydigan texnik va dasturiy vositalar jami."
        ]
    },
    {
        "word": "Maʼlumotlar uzatish muhiti",
        "type": [],
        "definition": [
            "Ma’lumotlar uzatiladigan fizik muhit. Bu simli yoki simsiz liniya bo‘lishi mumkin. Simli liniya – mis yoki optik tolali kabel. Simsiz liniya – radio-, televizion, infraqizil kanallar."
        ]
    },
    {
        "word": "Maʼlumotlar uzatish vositalari",
        "type": [],
        "definition": [
            "Aloqa kanali va ma’lumotlar uzatish apparaturasining yig‘indisi."
        ]
    },
    {
        "word": "MAC OSX",
        "type": [],
        "definition": [
            "Apple firmasining Macintosh kompyuterlari uchun mo‘ljallangan operatsion tizimi. MAC OSX – bu, intuitiv grafik interfeysli o‘xshash operatsion tizimdir. Darvin deb nomlanadigan yadro (operatsion tizimning, yadroning adres fazosida bajariladigan dasturiy modullarni ichiga oladigan asosiy qismi) o‘n mingdan ortiq dasturchi tomonidan ishlab chiqilgan. Tizim foydalanish uchun 2001 yilda qabul qilingan."
        ]
    },
    {
        "word": "MAC adres",
        "type": [],
        "definition": [
            "Noyob 48 razryadli son, ishlab chiqaruvchi tomonidan tarmoq adapteriga qo‘yiladi, u adapterning fizik adresi bo‘lib hisoblanadi va TCP\/IP tarmoqlarida ishlatiladi."
        ]
    },
    {
        "word": "Microsoft",
        "type": [],
        "definition": [
            "Dasturiy maxsulotlar ishlab chiqarish bo‘yicha dunyodagi eng yirik firma. Dasturlardan tashqari, texnik vositalar: sichqonchalar, klaviaturalar va ularga adapterlar ham chiqaradi. Uilyam Geyts va Pol Allen tomonidan 1975 yilda tashkil qilingan. Firmaning asosiy yutuqlari: MS-DOS, Windows operatsion tizimlari, Internet da ishlash uchun MS Office, MS Explorer dasturiy vositalari; BASIC, Quick C, Visual BASIC, Visual C++ dasturlash tillari."
        ]
    },
    {
        "word": "MS OFFICE",
        "type": [],
        "definition": [
            "Hujjatga yo‘naltirilgan ko‘p funksiyali dasturiy mahsulot. Microsoft firmasi tomonidan ko‘plab tashkiliy masalalarni avtomatlashtirish uchun ishlab chiqilgan. MS Office tarkibiga quyidagi ilovalar kiradi: Word – matn redaktori, Excel – elektron jadvallar, Access – ma’lumotlar bazalarini boshqarish tizimi, Power Point – taqdimotlarni tayyorlash va o‘tkazish tizimi. Barcha ilovalar amalda yagona interfeysga ega bo‘lib, har qanday foydalanuvchi o‘rganishi uchun qulay. Har bir ilovadan mustaqil foydalanilishi mumkin. Agar, standart vositalar bilan ilovani aniq bir vazifa uchun sozlash imkoni bo‘lmasa, MS Office ga o‘rnatilgan Visual BASIC for Application. Dasturlash tilidan foydalanilishi mumkin. MS Office Windows operatsion tizimi boshqaruvida va Apple firmasining kompyuterlarida ishlaydi."
        ]
    },
    {
        "word": "MS-DOS",
        "type": [],
        "definition": [
            "Diskli operatsion tizim, Microsoft firmasi tomonidan 1981 yilda ishlab chiqilgan. Matn rejimida ishlaydigan qat’iy va bir foydalanuvchi operatsion tizimi boshqarish «yodimda va bajaraman» prinsipi bo‘yicha komandalar yordamida amalga oshiriladi. Dastlabki ishlanma Tim Peterson tomonidan bajarilgan."
        ]
    },
    {
        "word": "Murakkab tizimlarni loyihalash va obyektga yoʻnaltirilgan tahlil qilish",
        "type": [],
        "definition": [
            "XX asrning 80-90 yillarida yuzaga kelgan, murakkab tizimlarni loyihalash va tahlil qilish metodologiyasi, dasturiy mahsulotlarni, texnik, iqtisodiy, ijtimoiy tizimlarni, shuningdek, ularni boshqarish tizimlarini ishlab chiqishda asosiy metodologiya hisoblanadi. Tadqiq qilinadigan yoki ishlab chiqiladigan tizim modellarining ketma-ketligi: informatsion model, holatlar modeli va jarayonlar modelini tuzish meto-dologiyaning asosini tashkil etadi."
        ]
    },
    {
        "word": "Maʼlumotlar bazalari bilan birgalikda ishlash ochiq interfeysi",
        "type": [],
        "definition": [
            "Strukturalangan so‘rovlar tili (SQL) dan foydalaniladigan ma’lumotlar bazalarini boshqarish tizimlarida ma’lumotlardan erkin foydalanish imkonini beradigan dasturiy kompleks. Microsoft firmasi tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Mashina tarjimasi",
        "type": [],
        "definition": [
            "Matn yoki nutqni, kompyuterdan foydalanib bir tabiiy tildan boshqa bir tabiiy tilga o‘zgartirish. Tarjima jarayoni to‘la avtomatlashtiriladigan dasturni yaratish bo‘yicha ishlar o‘nlab yillardan buyon olib borilmoqda. Texnik matnlarni tarjima qilishda eng yaxshi natijaga erishilmoqda, lekin olingan tarjimani tekshirish va tuzatishda odamning ishtiroki baribir taqozo qilinmoqda. Bu muammoni hal qilish yuzasidan ko‘plab yondashuvlar mavjud; shunday yondashuvlardan biri IBM firmasi tomonidan taklif qilingan: natijalar solishtiriladigan bir tildan boshqa tilga va aksincha, tarjima qiladigan, mustaqil ravishda o‘rgatadigan tizim yaratilmoqda."
        ]
    },
    {
        "word": "Maydon",
        "type": [],
        "definition": [
            "Kompyuter xotirasining sohasi. Yozuv elementi, xotirada o‘ringa, tur va nomga ega, yozuvdan alohida qayta ishlanishi mumkin, biroq tashqi tashuvchiga yozuv tarkibida yoziladi va o‘qiladi."
        ]
    },
    {
        "word": "Maʼlumotlarni taqdim etish",
        "type": [],
        "definition": [
            "Ma’lumotlar saqlanadigan, qayta ishlanadigan va uzatiladigan shakl. Kompyuterda barcha ma’lumotlar ikkilik kodda taqdim qilinadi. Shuning uchun, kompyuterda «odam ‒ kompyuter» interfeysini ta’minlash uchun, ma’lumotlarni har doim kodlash va dekodlash yuz beradi. Bundan tashqari, egallanadigan xotira o‘lchamini kamaytirish maqsadida, ma’lumotlarni joylashtirish metodlaridan foydalaniladi."
        ]
    },
    {
        "word": "Muammoga yoʻnaltirilgan dasturlash tili",
        "type": [],
        "definition": [
            "Til tuzilishining o‘zi va\/yoki ma’lumotlar strukturasi ishlab chiqiladigan masalalarning o‘ziga xos xususiyatlarini aks ettiradigan dasturlash tili. Deyarli barcha ma’lum bo‘lgan universal dasturlash tillari ixtisoslashtirilgan, muammoga yo‘naltirilgan tillar sifatida ishlab chiqilgan. Masalan; Fortran tili ilmiy hisoblashlar uchun mo‘ljallangan til sifatida, Pascal ‒ o‘qitish uchun, Si ‒ tizim dasturlarini ishlab chiqish uchun, COBOL ‒ iqtisodiy masalalarni hal qilish uchun, LISP‒ sun’iy intellekt masalalarini hal qilish uchun, Fox ‒ ma’lumotlar bazalarini boshqarish tizimlari bilan bog‘liq vazifalar uchun ishlab chiqilgan."
        ]
    },
    {
        "word": "Masofadan boshqarish dasturi",
        "type": [],
        "definition": [
            "Bir kompyuterning boshqa kompyuter bilan aloqasini ta’minlaydigan va unda amaliy dasturni ishga tushiradigan dastur. Kompyuterlar tarmoqqa ulangan bo‘lishi kerak."
        ]
    },
    {
        "word": "MNP protokoli",
        "type": [],
        "definition": [
            "Modemli aloqada ma’lumotlar uzatish sxemasini belgilaydigan protokol. Bu protokol bo‘yicha ishlaydigan modem xatolar tuzatilishini va ma’lumotlar siqilishini amalga oshiradi. Protokol Microcom firmasi tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Murakkab komandalar toʻplamiga ega protsessor",
        "type": [],
        "definition": [
            "RISC-protsessorlariga teskari bo‘lgan to‘la komandalar to‘plamiga ega an’anaviy protsessorlar arxi-tekturasi. Mashina komandalari to‘plami keng, turli, o‘zgaruvchan uzunlik va bajarish vaqtiga ega bo‘lgan ommabop protsessorlar. 80×86 va 680×0 guruhiga mansub protsessorlar CISC-protsessorlari qatoriga kiradi, ammo CISC-protsessorlarining ichida ko‘pincha RISC-arxitekturasidan foydalaniladi."
        ]
    },
    {
        "word": "Matn redaktori",
        "type": [],
        "definition": [
            "Matnli hujjatlar yaratilishi va ularning to‘g‘rilanishi ta’minlanadigan dastur yoki uning bir qismi. Matnli hujjatlar – bu, oddiy maqolalar, dasturlarning matnlari, operatsion tizim komandalaridir. Har qanday foydalanuvchi interfeysi matn bilan ishlashni ta’minlashi, demak, tarkibida matn redaktori bo‘lishi kerak. Dunyoda barcha kompyuterlar ishlash vaqtining 80 foizga yaqini matnlar bilan ishlashga ketadi. Turli maqsadlar uchun ko‘plab yaxshi redaktorlar ishlab chiqilgan. Universal va keng foydalaniladigan redaktorlardan Microsoft firmasining Word va Leksikon matn redaktorlarini ko‘rsatish mumkin. Matn redaktorlarining asosiy funksiyalari segmentlarni ajratish, ulardan nusxa olish va ko‘chirish, orqaga qaytarish mumkinligi, so‘zlarni avtomatik ko‘chirish, orfografiyani tekshirish, formatlash, turli shriftlardan foydalanib bosish hisoblanadi. Redaktorlar matnga grafik redaktorlar yordamida tayyorlangan grafik material va jadvallarni kiritish imkonini beradi."
        ]
    },
    {
        "word": "Maʼlumotlarning yaxlitligi",
        "type": [],
        "definition": [
            "1 Amalga oshiriladigan o‘zgartirishlardan qat’i nazar, ma’lumotlarning aniqlikni va zid kelmaslikni saqlash qobiliyati.\r\n 2 Ma’lumotlarni ruxsat etilmagan usulda o‘zgartirib, o‘rnini almashtirib yoki yo‘q qilish mumkin bo‘lmasligini kafolatlaydigan xususiyat.\r\n Izoh – Ma’lumotlarning yaxlitligi tizimning buzilishlarga chidamliligini va avtomatik tiklanishini ichiga oladi."
        ]
    },
    {
        "word": "Markazlashtirilgan tarmoq",
        "type": [],
        "definition": [
            "Boshqarilishi, tarmoqning barcha resurslari tegishli bo‘lgan yagona serverdan amalga oshiriladigan kompyuter tarmog‘i."
        ]
    },
    {
        "word": "Maʼlumotlarni shifrlash",
        "type": [],
        "definition": [
            "Ma’lumotlarni, ularning yashirin uzatilishini ta’minlovchi maxsus algoritmlardan foydalanib, qayta ishlash usuli. Axborotning o‘zgartirilishi kodlash birliklari, odatda, mazmunli so‘z yoki jumlalar bo‘lgan kriptografik metodlardan farqli o‘laroq, bitlar yoki ularning ketma-ketligi darajasida amalga oshiriladi."
        ]
    },
    {
        "word": "Maʼlumotlar ombori",
        "type": [],
        "definition": [
            "Ma’lumotlarni saqlash konseptsiyasi. Ma’lumotlar bazasidan birinchidan, ma’lumotlarni aktuallashtirish ma’lumotlar yangilanishini emas, balki mavjudlariga qo‘shilishini bildirishligi bilan; ikkinchidan, boshqarish tizimining holatini aks ettiradigan ma’lumotlardan tashqari, ma’lumotlar omborida metama’lumotlar ham (omborning strukturasi to‘g‘risidagi ma’lumotlar, ma’lumotlar o‘rtasidagi bog‘lanish) saqlanishligi bilan ajralib turadi."
        ]
    }
]