[
    {
        "word": "Neyman arxitekturasi",
        "type": [],
        "definition": [
            "Kompyuter qurishning, ham ma’lumotlar, ham dasturning o‘zi saqlanadigan operativ, ketma-ket adreslanadigan xotira ajratilgan klassik arxitekturasi. Hozirgi vaqtda ko‘pchilik kompyuterlar shunday ar-xitekturaga ega. Nomi bu arxitekturani ishlab chiquvchilardan biri bo‘lgan mashhur matematik Jon fon Neyman sharafiga berilgan."
        ]
    },
    {
        "word": "Nutqiy kiritish",
        "type": [],
        "definition": [
            "Ma’lumotlarni foydalanuvchining ovozi bilan kiritish jarayoni. Nutqiy kiritishni ta’minlash uchun, mikrofon bilan; tovush tebranishlarini raqamli kod-larga aylantirish uchun maxsus plata bilan; aniqlanadigan so‘zlar yig‘ilgan ma’lumotlar bazalari (lug‘atlar) bilan va talaffuz qilingan so‘zni lug‘atdagi so‘zga moslaydigan dasturlar bilan jihozlangan kompyuter zarur bo‘ladi."
        ]
    },
    {
        "word": "Nvidia tizim vositalari",
        "type": [],
        "definition": [
            "Kompyuter tizimi komponentlarini sozlash, monitoring qilish, erkin foydalanish, jumladan, Windows dagi qulay boshqarish panellari yordamida kuchlanish va temperaturani nazorat qilish."
        ]
    },
    {
        "word": "Net news",
        "type": [],
        "definition": [
            "Internet global kompyuter tarmog‘ining tarmoq yangiliklari xizmati. «Mijoz ‒ server» arxitekturasiga ega. Foydalanuvchilarning turli mavzular bo‘yicha elektron konferensiyalarda ishtirok etishini ta’minlaydi."
        ]
    },
    {
        "word": "Net Ware",
        "type": [],
        "definition": [
            "Lokal hisoblash tizimlari uchun Novell firmasi tomonidan ishlab chiqilgan tarmoq operatsion tizimi. Markazlashtirilgan, taqsimlangan va bir rangdagi tarmoqlar uchun chiqarilgan versiyalari mavjud. Eng keng tarqalgan tizimlardan biri. Net Ware 3-x va 4-x versiyalari ajratilgan serverli tarmoqlar uchun mo‘ljallangan. 3-x va 4-x versiyalar asosan periferik qurilmalardan birgalikda ishlash imkoniyati bo‘lgan, tez ishlaydigan fayl-serverli tizimlar sifatida lohilashtirildi va rivojlantirildi."
        ]
    },
    {
        "word": "NetBurst",
        "type": [],
        "definition": [
            "Protsessorlarning yuqori takt chastotalariga erishish maqsadida ishlab chiqilgan arxitektura. NetBurst arxitekturasining o‘ziga xos xususiyatlari giperkonveyerlash va an’anaviy instruksiyalar keshi o‘rniga mikrooperatsiyalar ketma-ketligi keshining qo‘llanilishi hisoblanadi. NetBurst arxitekturasining protsessorlari to‘rtta asosiy strukturaviy blokdan iborat: instruksiyalar bajarilishini amalga oshiradigan, bajaruvchi qurilmalar, shuningdek, bajaruvchi qurilmalarning birgalikda ishlashini ta’minlaydigan qurilmalar. Ma’lumotlar oldindan tanlanishi, tarmoqlanishlarni oldindan prognozlash va instruksiyalarni dekodlash (x86 murakkab instruksiyalarni ichki oddiy instruksiyalar – mikrooperatsiyalarga o‘zgartirish) uchun javob beradigan kirish bloki. Mikrooperatsiyalar bajarilishining optimal tartibini tashkil qilish qurilmalari. Protsessorning xotira kichik tizimi bilan birgalikda ishlashini (o‘zaro bog‘lanishini) ta’minlaydigan qurilmalar guruhini o‘zida ifodalaydigan xotira interfeysi."
        ]
    },
    {
        "word": "NVIDIA ION",
        "type": [],
        "definition": [
            "NVIDIA kompaniyasi chipsetlari oilasi, netbuklar va nettoplar uchun platforma. Intel Atom (shu jumladan, ikki yadroli) protsessorlaridan va Ge Force 9400 M tizim logikasidan iborat. Chipsetlar DirectX 10 qo‘llanilgan birgalikda integratsiyalangan videoyadro bilan jihozlangan. Chipsetlar bor-yo‘g‘i bitta mikrosxemani ichiga oladi, bu yechimlar sxemotexnikasini soddalashtiradi, energiya iste’moli va issiqlik ajralishini kamaytiradi."
        ]
    },
    {
        "word": "Navbat",
        "type": [],
        "definition": [
            "Obyektlarning kelib tushishiga qarab tashkil qilingan chiziqli ro‘yxat. Ro‘yxat yangi element kelishi va\/yoki elementning chiqarilishi bilan o‘zgaradi. Protsessorning vazifalarni bajarish navbati, fayllarni printerga chiqarish navbati bo‘ladi."
        ]
    },
    {
        "word": "NLSP protokoli",
        "type": [],
        "definition": [
            "Ma’lumotlarning Netware muhitida uzatilishini ta’minlaydigan, tarmoqda optimal marshrut tanlash imkonini beradigan protokol. Novell firmasi tomonidan Netware tarmog‘i uchun ishlab chiqilgan."
        ]
    },
    {
        "word": "Nutqli kiritish",
        "type": [],
        "definition": [
            "Ma’lumotlarni kompyuterga ovoz yordamida (klaviaturasiz) kiritish texnologiyasi. Nutqli kiritishdan foydalanish uchun, operativ xotirasi kamida 8 Mbyte bo‘lgan Pentium yoki i486 protsessorga ega katta quvvatli shaxsiy kompyuter va lug‘atli dasturiy ta’minot bo‘lishi zarur. Dastur nutqni raqamlashtiradi, har bir so‘zni ajratadi va aniq ta’riflash uchun uni o‘zining lug‘atidan topishni bajaradi."
        ]
    }
]