[
    {
        "word": "Oxirgi avtomat",
        "type": [],
        "definition": [
            "Holatlarning oxirgi ko‘pligiga hamda oxirgi kirish va chiqish alifbolariga ega bo‘lgan avtomat."
        ]
    },
    {
        "word": "Ochiq arxitektura",
        "type": [],
        "definition": [
            "Shaxsiy kompyuterlar uchun IBM firmasi tomnidan ishlab chiqilgan arxitektura. Uning asosiy xarakteristikalari: kengayish razyomlari orqali turli qo‘shimcha qurilmalar ulanadigan umumiy axborot shinasining mavjudligi; kompyuterning modulli tuzilishi; barcha yangi qurilmalar va dasturiy vositalarning «yuqoridan pastga» prinsipi bo‘yicha oldingi versiyalar bilan mosligi, ya’ni keyingi ishlanmalar birmuncha avvalgi ishlanmalarni quvvatlashi kerak."
        ]
    },
    {
        "word": "Osiris serversiz portal tizimi",
        "type": [],
        "definition": [
            "Markazlashtirilgan serverlarga bog‘liq bo‘lmagan va P2P vositasida tarqatiladigan Web-portallarni yaratish va ko‘rib chiqish uchun belgilangan bepul dastur."
        ]
    },
    {
        "word": "Optik tolali kabel",
        "type": [],
        "definition": [
            "Ma’lumotlar yorug‘lik yordamida uzatiladigan kabel, bu uzatish sifati va tezligini oshiradi. Kompyuter tarmoqlarida ishlatiladi. Kvarts shisha asosida qilingan va sindirish ko‘rsatkichi o‘zakdagiga nisbatan kichik bo‘lgan qobiq bilan o‘ralgan tolali (egiluvchan) dielektrik."
        ]
    },
    {
        "word": "Operatsion tizim yuklagichi",
        "type": [],
        "definition": [
            "Bevosita kompyuter ulangandan so‘ng operatsion tizimning yuklanishini ta’minlaydigan tizimli dasturiy ta’minot."
        ]
    },
    {
        "word": "Operatsiyalarni tadqiq qilish",
        "type": [],
        "definition": [
            "Odam faoliyatining turli sohalarida eng yaxshi yechimlarni topish metodlarini ishlab chiqish va qo‘llash bilan shug‘ullanadigan matematik fan. Ope-ratsiyalarni tadqiq qilishning asosiy prinsiplari haqiqiy muammoning modelini tuzishdan iborat. Bunda natijada erishilishi kerak bo‘lgan maqsad; qanoatlantirilishi kerak bo‘lgan cheklashlar; boshqarilishi maqsadga erishish imkonini beradigan parametrlar ajratiladi. Operatsiyalarni tadqiq qilishning ko‘plab masalalarini hal qilish imkonini beradigan dasturiy komplekslar ishlab chiqilgan."
        ]
    },
    {
        "word": "Olisdagi uzellar serveri",
        "type": [],
        "definition": [
            "Olisdagi shaxsiy kompyuterning lokal kompyuter tarmog‘i bilan ishlashini ta’minlaydigan maxsus dasturlar va kompyuter. Server va olisdagi shaxsiy kompyuter modemlar bilan ta’minlanishi kerak. Asosiy vazifalari – ruxsat etilmagan tarzda erkin foydalanishga yo‘l qo‘ymaslik, ma’lumotlar uzatish va birlashtirish ishonchliligini ta’minlashdir."
        ]
    },
    {
        "word": "Obyekt",
        "type": [],
        "definition": [
            "Tizim yoki muhit elementi. Obyektga yo‘naltirilgan dasturlash tushunchasi, ma’lumotlar bilan ishlaydigan dasturlar va ma’lumotlarni bir butun yaxlit qilib birlashtiradigan dasturiy modul. Obyekt, obyektning parametrlari bo‘lgan xossalar, obyektga va uning xossalariga ta’sir ko‘rsatadigan metodlar bilan tavsif-lanadi. Obyekt protseduraga yo‘naltirilgan dasturlash tillarining ajralmas elementi hisoblanadi."
        ]
    },
    {
        "word": "Obyektga yoʻnaltirilgan dasturlash",
        "type": [],
        "definition": [
            "Asosiga obyekt tushunchasi qo‘yilgan dasturlash. Uchta asosiy xossa: inkapsulyatsiya, vorislik va polimorfizm bilan tavsiflanadi."
        ]
    },
    {
        "word": "Obyekt fayli",
        "type": [],
        "definition": [
            "Kompilyator bilan boshlang‘ich kodni qayta ishlash natijasida olingan, dasturning alohida moduli oraliq taqdim etilgan fayl. Obyekt fayli o‘z ichiga alohida tarzda tayyorlangan (ko‘pincha, ikkilik yoki binar kod deb ataladigan) kodni oladi. Bu kod, tayyor bajariladigan modulni yoki bibliotekani olish uchun, bog‘lanishlar redaktori (komponovkachi) yordamida boshqa obyekt fayllari bilan birlashtirilishi mumkin."
        ]
    },
    {
        "word": "Oyna",
        "type": [],
        "definition": [
            "Displey ekranining to‘rtburchakli qismi, u orqali ilova yoki uning qismi bilan birga ishlash amalga oshiriladi. Grafik foydalanuvchi interfeyslarida va barcha mumkin bo‘lgan qobiqlarda keng qo‘llaniladi, status satri, sarlavha va menyu kabi standart elementlarni o‘z ichiga oladi. Ekranning dastur va jarayonlar bajarilishi mumkin bo‘lgan qismi. Bir vaqtda bir nechta oyna ochilishi mumkin. Masalan, bir oynada elektron pochta dasturini ochish, boshqasida elektron jadval bilan ishlash, uchinchisida raqamli kamerada tasvirni yuklash, to‘rtinchisida esa Internet-magazinda buyurtmani rasmiylashtirish mumkin. Oynani yopish, hajmini o‘zgartirish, vazifalar panelida tugmalarni burish yoki ekranda to‘laligicha aks ettirish mumkin."
        ]
    },
    {
        "word": "Operand",
        "type": [],
        "definition": [
            "Ustida amallar bajariladigan dasturlash tili obyekti. Bu konstantalar, o‘zgaruvchilar, funksiyalar, ifodalar bo‘lishi mumkin."
        ]
    },
    {
        "word": "Operativ xotira qurilmasi",
        "type": [],
        "definition": [
            "Ma’lumotlarni yozish va o‘qish uchun mo‘ljallangan yarimo‘tkazgichli qurilma. Oddiy kompyuterlarda dastur bajarilishi uchun yuklanadigan joy."
        ]
    },
    {
        "word": "Operator",
        "type": [],
        "definition": [
            "Operandlar ustida bajariladigan bir yoki bir nechta amalni belgilaydigan, dasturlash tili konstruksiyasi."
        ]
    },
    {
        "word": "OS\/2 operatsion tizimi",
        "type": [],
        "definition": [
            "IBM korporatsiyasi tomonidan ishlab chiqilgan ope-ratsion tizim. Bir vaqtning o‘zida ko‘plab amaliy dasturlarni ishlatish, bitta amaliy dasturning bir necha vazifasi parallel bajarilishini, tashqi xotiraga ma’lumotlarni yozishda ularning zichlashtirilishini, zaхira nusxalar tashkillashtirilishini, xotira himoya-sini, milliy tillarning qo‘llanilishini ta’minlaydi."
        ]
    },
    {
        "word": "Operatsion tizim",
        "type": [],
        "definition": [
            "Elektron-hisoblash mashinasi resurslarini boshqarish, amaliy dasturlarni ishga tushirish va ularning tashqi qurilmalar, boshqa dasturlar bilan o‘zaro aloqasini amalga oshiradigan, shuningdek, foydalanuvchining kompyuter bilan muloqotini ta’minlaydigan dasturiy vositalar yig‘indisi."
        ]
    },
    {
        "word": "Optik disk",
        "type": [],
        "definition": [
            "O‘qish optik nurlanish yordamida boradigan disk ko‘rinishidagi axborot tashuvchi. Disk odatda, yassi bo‘lib, asosi polikarbonatdan qilingan. Polikarbonat asosga axborotni saqlash uchun xizmat qiladigan maxsus qatlam surtilgan. Axborotni o‘qish uchun maxsus qatlamga yo‘naltiriladigan va undan qaytadigan lazer nuridan foydalaniladi."
        ]
    },
    {
        "word": "Optik toʻplagich",
        "type": [],
        "definition": [
            "Lazer texnologiyasiga asoslangan ma’lumotlarni saqlash qurilmasi. Optik to‘plagichlar «faqat o‘qish uchun» (CD-ROM), «o‘qish va bir marta yozish uchun» (CD-R, Compact Disk-Recordable), «o‘qish va ko‘p marta yozish uchun» (CD-RW, Compact Disk-Re Writable) kabi turlarga bo‘linadi. Bu turlardan tashqari, magnitooptik to‘plagichlar va DVD qurilmalari bor."
        ]
    },
    {
        "word": "Optik tolali taqsimlangan maʼlumotlar interfeysi",
        "type": [],
        "definition": [
            "Optik tolali kompyuter tarmoqlarida ma’lumotlarni 100 Mbit\/s tezlik bilan uzatish tizimlari uchun mo‘ljallangan standart."
        ]
    },
    {
        "word": "Optoelektronika",
        "type": [],
        "definition": [
            "Elektronikaning, optik diapazondagi elektromagnit nurlanishlarni ma’lumotlarni saqlash, qayta ishlash, uzatish va aks ettirish qurilmalarida qo‘llanish masalalari bilan shug‘ullanadigan bo‘limi. Asosiy optoelektron qurilmalar: yarimo‘tkazgichli lazerlar (kogerent optik nurlanish manbalari), yorug‘lik diodlari (nokogerent optik nurlanish manbalari), fotodiodlar (optik nurlanishni qabulqilgichlar)."
        ]
    },
    {
        "word": "Optsiya",
        "type": [],
        "definition": [
            "Bajarish uchun tanlab olinishi mumkin bo‘lgan menyu elementi."
        ]
    },
    {
        "word": "Ochiq tizim",
        "type": [],
        "definition": [
            "Ishlab chiquvchilar tomonidan ishlab chiqilgan tizimning barcha zarur standartlaridan umumfoydalanib bo‘ladigan tizim. Bu, boshqa bir ishlab chiquvchiga o‘xshash tizimni yaratish, uning xarakteristikalarini yaxshilash, o‘z qurilmalari yoki dasturiy vositalarini qo‘shish, ularnnig birgalikda ishlashini tashkil qilish imkonini beradi. Ochiq tizimlarga misollar: IBM firmasining shaxsiy kompyuterlari, dBASE turidagi ma’lumotlar bazalari, Internet."
        ]
    },
    {
        "word": "Ochish",
        "type": [],
        "definition": [
            "Ma’lumotlarni saqlash va uzatish uchun qulay bo‘lgan shakldan qayta ishlash uchun qulay shaklga o‘zgartirish jarayoni. Joylashtirish jarayoniga teskari jarayon."
        ]
    },
    {
        "word": "Operatsion tizim yadrosi",
        "type": [],
        "definition": [
            "Operatsion tizimning markaziy, asosiy qismi bo‘lib, operativ xotirada doimo bo‘ladi, operatsion tizimni boshqaradi; qurilmalar drayverlari, xotirani boshqaruvchi kichik dasturlar, vazifalarni rejalovchidan tashkil topgan."
        ]
    },
    {
        "word": "Olislashtirilgan foydalanish",
        "type": [],
        "definition": [
            "Kompyuter tarmog‘ining elementlari o‘rtasida birgalikda ishlashning uchta variantini ta’minlaydigan foydalanish: masofadan boshqarish – olisdagi abonent va\/yoki server dasturlarining ishga tushirilishini amalga oshirish imkonini beradi; tizimning uzoq muddatli xotirasidan foydalanish; elektron pochta rejimida ishlash."
        ]
    }
]