[
    {
        "word": "Protsessorning tez  ishlashi",
        "type": [],
        "definition": [
            "Protsessorning operatsiyalarni bajarish tezligi. Protsessorda alohida operatsiyalarni bajarish tezligi turlicha, shuning uchun butun protsessorning ishlash tezligi sifatida, «registr ‒ registr» komandalarini bajarish tezligi yoki suzuvchi vergulli sonlar ustidagi komandalarni bajarish tezligi olinadi. Uning maxsus nomi – flops."
        ]
    },
    {
        "word": "Pentium",
        "type": [],
        "definition": [
            "Intel firmasining ishlanmasi bo‘lgan mikroprotsessorlar oilasi, 32 razryadli adres shinasi va 64 razryadli ma’lumotlar shinasiga ega."
        ]
    },
    {
        "word": "Pentium IV",
        "type": [],
        "definition": [
            "Intel firmasining protsessori. 2001 yilda chiqarilgan. 0,18 µm  va 0,13 µm texnologiya bo‘yicha tayyorlangan. Ishchi chastota 1,3 HHz dan 2,4 HHz gacha bo‘lgan versiyalar chiqariladi. Protsessor chastotasi 400 MHz bo‘lgan «chipset-protsessor» shinadan (tizim shinasi) foydalanadi. Birinchi sath kesh-xotira 8 kbyte, ikkinchi sath kesh-xotira – 256 kbyte. Protsessorning ta’minot kuchlanishi 1,7 V va 1,3 V. Tranzistorlar soni – 42 mln."
        ]
    },
    {
        "word": "Pentium III",
        "type": [],
        "definition": [
            "Intel firmasining protsessori. 1999 yilda chiqarilgan. Commermine yadrosi bilan 0,18 µm texnologiya bo‘yicha, Tualatin yadrosi bilan 0,13 µm  texnologiya bo‘yicha tayyorlangan. Ishchi chastota 533 MHz dan 1260 MHz gacha bo‘lgan versiyalar chiqariladi. Protsessor chastotasi 100-133 MHz bo‘lgan «chipset ‒ protsessor» shinasidan (tizim shinasi) foydalanadi. Birinchi sath keshi xotira 32 kbyte, ikkinchi sath kesh-xotira 256 kbyte. Protsessorning ta’minot kuchlanishi 1,7 V. Tranzistorlar soni – 28 mln."
        ]
    },
    {
        "word": "Pentium mover drive",
        "type": [],
        "definition": [
            "Pentium arxitekturasiga ega bo‘lgan integral sxema. i486 protsessorli kompyuterlarni modernizatsiyalash uchun mo‘ljallangan."
        ]
    },
    {
        "word": "Power PC",
        "type": [],
        "definition": [
            "Kompyuterlar uchun markaziy protsessor sifatida foydalaniladigan mikroprotsessor. Intel protsessorlariga muqobil sifatida IBM, Motorola va Apple firmalari tomonidan birgalikda ishlab chiqilgan."
        ]
    },
    {
        "word": "Prolog",
        "type": [],
        "definition": [
            "Sun’iy intellekt masalalari uchun deklarativ dasturlash tili bo‘lib, tabiiy va boshqa tillarga ishlov beradi."
        ]
    },
    {
        "word": "Paketli qayta ishlash",
        "type": [],
        "definition": [
            "Operatsion tizim yordamida ma’lum bir izchillikda bir nechta dasturning bajarilishini tashkil qilish. Paketli qayta ishlash paketli fayllar yordamida tashkil qilinadi."
        ]
    },
    {
        "word": "Paketli fayl",
        "type": [],
        "definition": [
            "Har bir satrini operatsion tizim o‘zining komandalari sifatida talqin qiladigan matnli fayl. Paketli qayta ishlashni tashkil qilish uchun foydalaniladi. Bajariladigan fayl turlaridan biri. Fayl nomida kengayish tizimi orqali aniqlanadi."
        ]
    },
    {
        "word": "Panel",
        "type": [],
        "definition": [
            "Oynaning, menyu yoki tugmalar to‘plami joylashgan, to‘g‘riburchakli ajratilgan sohasi."
        ]
    },
    {
        "word": "Papka",
        "type": [],
        "definition": [
            "Obyektga yo‘naltirilgan dasturlash nuqtai nazaridan qaraganda, kompyuter resurslari va fayllar uchun konteyner hisoblanadigan obyekt."
        ]
    },
    {
        "word": "Parallel qayta ishlash",
        "type": [],
        "definition": [
            "Kompyuterda bir nechta jarayonning bir vaqtda bajarilishi. Umumiy holda, bu jarayonning bajarilishi uchun ko‘p protsessorli tizimlar zarur. Parallel qayta ishlash vazifalar bajarilishini tezlashtiradi."
        ]
    },
    {
        "word": "Parallel port",
        "type": [],
        "definition": [
            "Ma’lumotlarning baytlar bilan (barcha bitlar bir vaqt-da) kiritilishi\/chiqarilishi amalga oshiriladigan port. Parallel port ma’lumotlarni ketma-ket portga nisbatan tezroq uzatadi, odatda unga printer ulanadi."
        ]
    },
    {
        "word": "Parametr",
        "type": [],
        "definition": [
            "Qiymati kichik dasturga (protseduraga, funksiyaga) tashqi muhitdan beriladigan o‘zgaruvchan kattalik. Formal va faktik parametrlar ajratiladi. O‘z nomi bilan ko‘rsatilgan o‘zgaruvchilar formal parametrlar deb ataladi. Ular ustida kichik dasturlarni yozishda umumiy ko‘rinishda barcha zarur ishlar amalga oshiriladi. Kichik dasturlardan formal parametrlar o‘rniga foydalanishda taqdim etilgan o‘zgaruvchilar yoki ularning qiymatlari faktik parametrlar deb ataladi."
        ]
    },
    {
        "word": "Parol",
        "type": [],
        "definition": [
            "1 Yopiq (himoyalangan) tizimga kira olish uchun foydalaniladigan kod (belgilar ketma-ketligi).\r\n 2 Foydalanuvchilarning tizimga kirishida foydalaniladigan himoya vositasi, shuningdek, tashkilotlarda kompyuterlar va resurslarga kirish uchun qo‘llaniladi."
        ]
    },
    {
        "word": "Peyjerli aloqa",
        "type": [],
        "definition": [
            "Alifbo-raqamli bir tomonlama radioaloqa tizimi. Tizim uzelida o‘ta yuqori chastotalarda ishlaydigan radiouzatkich o‘rnatiladi. Tizim abonentlari har doim o‘zlari bilan xabarlarni qabul qiluvchi qurilma ‒ peyjer olib yuradilar. Peyjer ‒ bu, xabar aks etadigan displeyli qabulqilgichdir. Xabarni peyjerga uzatish uchun, peyjerli aloqa tizimi operatorining telefon raqamini va peyjer raqamini bilish zarur. Operator telefon orqali uzatiladigan xabarni olgach, uni kompyuterga kiritadi. Kompyuter peyjerga alifbo-raqamli radioxabar jo‘natadi."
        ]
    },
    {
        "word": "Periferik qurilmalar",
        "type": [],
        "definition": [
            "Kompyuterga kiritish\/chiqarish portlari orqali ulanadigan va keng ko‘lamdagi vazifalar hal qilinishini ta’minlaydigan qurilmalar."
        ]
    },
    {
        "word": "Pero",
        "type": [],
        "definition": [
            "Kiritish qurilmasi; ko‘rinishiga qarab, displey ekranida yoza oladigan avtoruchkani o‘zida ifodalaydi. Juda qulay kiritish vositasi, ayniqsa grafik ma’lumotlar uchun. Pero bilan qo‘lyozma matnni ham kiritish mumkin, agar simvollarni optik aniqlash dasturi bo‘lsa."
        ]
    },
    {
        "word": "Piktogramma",
        "type": [],
        "definition": [
            "Qandaydir harakatning, ogohlantirishning, obyektning (dastur, fayl) yoki tushunchaning grafik tasviri. Grafik interfeyslarda tezda tushunish va o‘zlashtirish uchun foydalaniladi, bunda eng umumiy, tushunarli obrazlar tanlanadi."
        ]
    },
    {
        "word": "Platforma",
        "type": [],
        "definition": [
            "Oddiy kompyuterlarda yoki mobil telefonlarga o‘rnatilgan operatsion tizim turi. Zamonaviy smartfonlar uchun 4 ta asosiy turdagi platforma mavjud: Palm OS, Symbian, Linux va Pocket PC\/Windows Mobile."
        ]
    },
    {
        "word": "Plotter",
        "type": [],
        "definition": [
            "Grafik axborotni qog‘oz tashuvchiga yoki boshqa bir tashuvchiga chiqarish qurilmasi.\r\n Izoh ‒ Peroli, qalamli, purkagichli, elektrostatik graftuzgichlar, tasvir to‘g‘ridan-to‘g‘ri chiqariladigan plotterlar, termoplotterlar va lazer graftuzgichlar ajratiladi."
        ]
    },
    {
        "word": "Pozitsion sanoq tizimi",
        "type": [],
        "definition": [
            "Sonlarni yozishda raqamlarning joylashgan o‘rni ahamiyatga ega bo‘ladigan sanoq tizimi. Har bir pozitsion sanoq tizimida asos bo‘ladi. Har qanday son asos raqamlardan tuzilgan ketma-ketlik ko‘rinishida yoziladi. Asos raqamlari soni asosning o‘ziga teng bo‘ladi. Asos, har bir raqamning salmog‘i katta qo‘shni razryadda turgan raqam salmog‘idan necha marta kichikligini ko‘rsatadi. Qurilgan pozitsion sanoq tizimlarining soni har qanday bo‘lishi mumkin. Informatikada asosan to‘rtta tizimdan: o‘nlik, ikkilik, sakkizlik va o‘n oltitalik tizimdan foydalaniladi. Pozitsion sanoq tizimlari hisoblashlar, ham butun, ham kasr sonlarni ko‘rsatish uchun juda qulay."
        ]
    },
    {
        "word": "Polimorfizm",
        "type": [],
        "definition": [
            "Kichik dasturlar (protseduralar, funksiyalar)ning, ma’lumotlarni ularning turiga bog‘liq holda turli algoritm bo‘yicha qayta ishlash xususiyati; obyektga yo‘naltirilgan dasturlashda keng foydalaniladi."
        ]
    },
    {
        "word": "Port",
        "type": [],
        "definition": [
            "Kompyuterning, periferik qurilmalarni kompyuter ichki shinasiga ulash amalga oshiriladigan qurilmasi."
        ]
    },
    {
        "word": "Portal",
        "type": [],
        "definition": [
            "Internet dan foydalanuvchiga bir Web-sayt doirasida ishlaydigan, pochta, izlash, ob-havo, yangiliklar, forumlar, muhokama qilish, ovoz berish kabi turli interaktiv xizmatlar taqdim etiladigan Web-sayt."
        ]
    },
    {
        "word": "Portativ kompyuter",
        "type": [],
        "definition": [
            "Foydalanuvchi har doim o‘zida olib yurishi mumkin bo‘lgan ko‘tarib yuriladigan shaxsiy kompyuter.\r\n Izoh ‒ Portativ kompyuterlarning turlari ularning quvvati va o‘lchamlariga bog‘liq ravishda farqlanadi: elektron yon daftarcha, shaxsiy raqamli sekretar, cho‘ntak kompyuteri, bloknotli kompyuter, laptop."
        ]
    },
    {
        "word": "Postuslovie",
        "type": [],
        "definition": [
            "Haqiqatligi protsedura yoki sikl jismi bajarilgandan keyin tekshiriladigan shart."
        ]
    },
    {
        "word": "Postfiks",
        "type": [],
        "definition": [
            "Asosiy element orqasidan yoziladigan, operator, komandani tavsiflash elementi; o‘zining operandidan keyin yoziladigan operatsiya. Masalan, Si tilida x++."
        ]
    },
    {
        "word": "Predikat",
        "type": [],
        "definition": [
            "O‘zining mulohaza argumentlariga ega bo‘lgan va («chin» yoki «yolg‘on») mantiqiy qiymatni qaytaradigan funksiya. Predikat – mulohazaga o‘xshash, lekin o‘zgaruvchi bo‘lganligi uchun mulohaza hisoblanmaydigan gapdir. Predikat mulohaza bo‘ladi, agar o‘zgaruvchi o‘rniga aniq bir qiymat qo‘yilsa."
        ]
    },
    {
        "word": "Preprotsessor",
        "type": [],
        "definition": [
            "Kirish ma’lumotlarining asosiy dasturga oldindan qayta ishlanishini ta’minlaydigan dastur."
        ]
    },
    {
        "word": "Printer",
        "type": [],
        "definition": [
            "Ma’lumotlarni kompyuterdan qog‘ozda, plyonkada o‘qish uchun qulay ko‘rinishda berish uchun xizmat qiladigan qurilma. Printerlar bosish usuli, vazifasi va bosma ranglari soni bo‘yicha farqlanadi. Bosish usuliga ko‘ra, matritsali, termik, purkagichli va lazer printerlarga bo‘linadi; vazifasiga ko‘ra, ko‘tarib yuriladigan (bloknotli shaxsiy kompyuterlar uchun) shaxsiy, muassasa, mini tipografiyalar; ranglar soniga ko‘ra, bir rangli, rangli. Asosiy xarakteristikalari: bosish tezligi (sekundiga belgi, minutiga sahifa, varaq); bosish sifati (nuqta\/dyuym)."
        ]
    },
    {
        "word": "Programmator",
        "type": [],
        "definition": [
            "Ma’lumotlarni, shu jumladan, dasturlarni doimiy xotirlovchi qurilmaga yozish qurilmasi.Ma’lumotlar doimiy xotirlovchi qurilmada elektron sxemalar ko‘rinishida saqlanadi. Programmator qattiq ultrabinafsha nurlanish vujudga keltiradi, uning yordamida elektron sxemalar o‘zgaradi."
        ]
    },
    {
        "word": "Programmofon",
        "type": [],
        "definition": [
            "Shaxsiy kompyuterdan telefon sifatida foydalanish imkonini beradigan dasturiy mahsulot. Programmofondan foydalanish uchun modem, mikrofon va radiokarnay bilan jihozlangan kompyuter zarur bo‘ladi."
        ]
    },
    {
        "word": "Proksi server",
        "type": [],
        "definition": [
            "Lokal kompyuter tarmog‘i va Internet o‘rtasida uzatiladigan paketlar filtratsiyasini amalga oshiradigan dasturiy ta’minot. Eng ko‘p so‘raladigan hujjatlarni keshlash hisobiga, tarmoq trafigini kamaytirish va lokal tarmoq xavfsizligini oshirish uchun mo‘ljallangan."
        ]
    },
    {
        "word": "Protokol",
        "type": [],
        "definition": [
            "Kompyuterlar yoki tizimlar o‘rtasida ma’lumotlar almashinuvini ta’minlaydigan uzatiladigan ma’lumotlar formati, kelishuvlar va qoidalar. Bu qoidalar, tarmoq qurilmalari almashinadigan xabarlar mazmunini, formatini, vaqt parametrlarini, ketma-ketligini va xatolar tekshirilishini aniqlaydi."
        ]
    },
    {
        "word": "Protsedura",
        "type": [],
        "definition": [
            "Dasturning, umumiy holda kirish parametrlariga bog‘liq bo‘lgan ba’zi standart amallarni bajaradigan qismi. Protsedurani kichik dastur deb hisoblash mumkin.\r\n Izoh ‒ Protseduralar standart protseduralar va foydalanuvchi protseduralariga, dasturga nisbatan tashqi va ichki protseduralarga bo‘linadi. Standart protsedura dasturlash tili tarkibiga kiradi va tegishli biblioteka tarkibida yetkaziladi, foydalanuvchi protsedurasini har bir ishlab chiquvchi mustaqil yaratadi. Tashqi protsedura dasturga bog‘liq bo‘lmagan tarzda saqlanadi, ichki protsedura dastur tarkibiga kiradi."
        ]
    },
    {
        "word": "Protseduraga yoʻnaltirilgan dasturlash tili",
        "type": [],
        "definition": [
            "Asosiga «masalani hal qilish uchun nima qilish kerak» ish prinsipi qo‘yilgan yuqori daraja dasturlash tili. Ishlar operatorlar tomonidan yoziladi va bajariladi. Pirovard natijani olish uchun bajarilishi zarur bo‘lgan operatorlar ketma-ketligi to‘planadi. Bunday ketma-ketlik dastur deb ataladi. Protsedura tillarini oddiy (BASIC, Fortran, COBOL) va blokli (modulli) (Pascal, Modula-2 va Si) tillarga ajratish mumkin. Protsedura tillari shuningdek, operator tillari yoki imperativ tillar deb ham ataladi."
        ]
    },
    {
        "word": "Protsessor",
        "type": [],
        "definition": [
            "Operatsion tizim dasturlari belgilagan arifmetik ope-ratsiyalarning bajarilishiga javob beradigan va kompyuterning boshqa barcha qurilmalari ishini muvofiqlashtiradigan apparat ta’minoti."
        ]
    },
    {
        "word": "Proshivka",
        "type": [],
        "definition": [
            "Kompyuter yoki har qanday raqamli hisoblash qurilmasi – mikrokalkulyator, sotali telefon, GPS navigatorning, ichida mikrodasturi bo‘lgan energiyaga bog‘liq bo‘lmagan xotirasining ichidagi. «Proshivka» so‘zi bilan ba’zan, xotiraga tegishli qurilmani, uning mikrodasturini yangilash maqsadida yozish uchun mo‘ljallangan doimiy xotirlovchi qurilmaning obrazi, shuningdek, bu obrazni qurilmaning energiyaga bog‘liq bo‘lmagan xotirasiga yozish jarayonining o‘zi nomlanadi."
        ]
    },
    {
        "word": "Psevdografika",
        "type": [],
        "definition": [
            "Klaviatura klavishlariga biriktirilgan simvollar yordamida matn rejimida displey ekranida olingan grafik tasvir."
        ]
    },
    {
        "word": "Psevdotasodifiy sonlar",
        "type": [],
        "definition": [
            "Qandaydir algoritm bo‘yicha olingan, lekin tasodifiy sonlar sifatida foydalaniladigan sonlar. Bir xil taqsimlangan psevdotasodifiy sonlarni olish metodlaridan biri. J.fon Neyman tomonidan taklif qilingan: Ixtiyoriy ikkilik son olinadi va kvadratga oshiriladi, keyin o‘rtasi ajratiladi va jarayon boshidan takrorlanadi; qandaydir qadamdan boshlab sonning o‘rtasi tasodifiy son bo‘ladi."
        ]
    },
    {
        "word": "Pascal dasturlash tili",
        "type": [],
        "definition": [
            "Keng ko‘lamli masalalarga mo‘ljallangan yuqori darajadagi dasturlash tili. Pascal tili strukturali dasturlash tili hisoblanadi. 1960 yil oxirlarida Niklaus Virt tomonidan yaratilgan. Bu til, XVII asrda yashab o‘tgan fransuz matematigi Blaz Pascal sharafiga qo‘yilgan. Blaz Pascal sonlarni qo‘shish uchun yaratilgan dastlabki mexanik mashinalardan birining ixtirochisi bo‘lgan."
        ]
    }
]