[
    {
        "word": "Qoʻsh mustaqil shina arxitekturasi",
        "type": [],
        "definition": [
            "Protsessorni qurish arxitekturasi, bunda ma’lumotlar bir vaqtda bir-biriga bog‘liq bo‘lmagan holda ikkita shina orqali parallel uzatiladi. Kompyuter platformalar o‘tkazish qobiliyatining ko‘pgina muammolarini hal qiladi. Amaliy dasturlarning talablarini qondirish va protsessorlarning yangi avlodlarini yanada rivojlantirish imkoniyatlarini ta’minlash uchun, Intel firmasi tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Qogʻozsiz texnologiya",
        "type": [],
        "definition": [
            "Ma’lumotlar bilan qog‘oz tashuvchilardan foydalanmasdan ishlash texnologiyasi. Qog‘ozsiz texnologiyada kompyuterlardan, magnit va optik ma’lumotlar tashuvchilardan foydalanish ko‘zda tutiladi, buning hisobiga boshqarish samaradorligi oshadi."
        ]
    },
    {
        "word": "Qoʻyilganlik",
        "type": [],
        "definition": [
            "O‘xshash yoki boshqa bir konstruktsiyaga kirish yuz beradigan algoritm, dastur, komanda strukturasi. Masalan, sikldagi sikl, shartli operatordagi shartli operator."
        ]
    },
    {
        "word": "Qalqib chiqadigan menyu",
        "type": [],
        "definition": [
            "Iyerarxiyaning keyingi sathida paydo bo‘ladigan va tanlab olinadigan momentgacha yashirin menyu."
        ]
    },
    {
        "word": "Qoʻshimcha",
        "type": [],
        "definition": [
            "Qandaydir tartiblashtirilgan strukturaga (massivga, ro‘yxatga, faylga) tegishli joyga yangi elementni qo‘shish protsedurasi. Mantiqiy va fizik darajalarda qilinishi mumkin."
        ]
    },
    {
        "word": "Qaynoq start",
        "type": [],
        "definition": [
            "Operatsion tizimni kompyuterni uzib qo‘ymasdan\/ulamasdan turib qayta yuklash. MS-DOS operatsion tizimli kompyuterlarda bu – uchta, Ctrl, Alt, Delete klavishalarini bir vaqtda bosish (Ctrl+Alt+Delete ko‘rinishda yoziladi)."
        ]
    },
    {
        "word": "Qattiq magnit disk",
        "type": [],
        "definition": [
            "Ma’lumotlar saqlash uchun mo‘ljallangan disk. Olinadigan egiluvchan diskdan farqli ravishda, qattiq magnit disk hech qachon olinmaydi, diskovod bilan bir butun yaxlitni tashkil qiladi. Disk alyumin qotishma va magnit qoplamadan qilingan. Disklar yuqori tezlikli dvigatel va yupqa plyonkali o‘qish\/yozish kallaklari bilan birga germetik korpusga joylashtiriladi. Qattiq disklarning sig‘imi turlicha – 20 Mbyte dan 9,1 Gbyte gacha bo‘ladi."
        ]
    },
    {
        "word": "Qotib qolish",
        "type": [],
        "definition": [
            "Dasturiy ta’minotning noto‘g‘ri ishlashi operatorning noto‘g‘ri harakatlari yoki texnik vositalarning ishlamay qolishi tufayli yuzaga keladigan kompyuterning holati. Bunda kompyuter ishning keyingi qadamini bajarmaydi va standart uzilishlarga javob bermaydi. Turli darajadagi «qotib qolishlar» ajratiladi. Dastur «qotib qolganda», odatda, bir vaqtda Ctrl va Break klavishalari bosiladi; operatsion tizim «qotib qolganda», «qaynoq» start (ishga tushirish) bajariladi; klaviatura o‘chib qolganda, Reset klavishasi bosiladi, agar bu klavisha bo‘lsa, yoki kompyuter o‘chirib-yoqiladi."
        ]
    },
    {
        "word": "Qiymat",
        "type": [],
        "definition": [
            "Ifoda yoki o‘zgaruvchining aniq bir mazmuni; har doim yo‘l qo‘yiladigan qiymatlar sohasiga tegishli bo‘lishi kerak."
        ]
    },
    {
        "word": "Q-Bus",
        "type": [],
        "definition": [
            "Digital Equipment Corporation firmasining Micro VAX va PDP-11 kompyuterlarida qo‘llaniladigan shinalarning bir turi. Unibus shinasining arzonlashtirilgan varianti bo‘lgan Q-Bus da multipleksirlashdan foydalaniladi, shu sababli, ma’lumotlar liniyalari va adreslarda ham ayni shu kontaktlardan foydalaniladi. Bu, amalda funksionallik saqlangan holda, o‘lchamni kichraytirish, konstruktsiyani arzonlashtirish imkonini berdi. Birmuncha vaqt o‘tgandan keyin, shinaning adres fazosi 16 bit dan 18 bit gacha, keyin 22 bit gacha oshirildi. Shuningdek, ma’lumotlar bloklarini yuborish rejimi qo‘shildi."
        ]
    },
    {
        "word": "Qobiq",
        "type": [],
        "definition": [
            "Asosiy dastur bilan ishlashni soddalashtiradigan dastur (dasturlar kompleksi). Qobiqlardan dasturlash muhitini yaratish uchun keng foydalaniladi. Masalan, Borland firmasi Paskal, Si, Prolog tillari bilan ishlash uchun qobiq ishlab chiqdi va uni dasturlash tili tarkibiga kiritdi, bu dasturlash jarayonini ancha soddalashtiradi. Qobiqlarga ehtiyoj bo‘lmaydigan tizimlarni ishlab chiqishga yo‘naltirilgan tendensiya bor. Ba’zida o‘rab turgan muhit nomidan foydalaniladi."
        ]
    },
    {
        "word": "Qayta yoziladigan kompakt-disk",
        "type": [],
        "definition": [
            "Kompakt - disklardagi ma’lumotlarni o‘qish va yozish uchun xizmat qiladigan qurilma."
        ]
    }
]