[
    {
        "word": "Real vaqtda analitik qayta ishlash",
        "type": [],
        "definition": [
            "Muhim qarorlar qabul qilinishini ta’minlash uchun ma’lumotlarni operativ tahlil qilish. Ma’lumotlar ustidagi operatsiyalarni OLAP-mashina amalga oshiradi. Atama E.Kodd tomonidan 12 qoida bilan birga 1993 yilda taklif qilingan."
        ]
    },
    {
        "word": "Roʻyxat",
        "type": [],
        "definition": [
            "1 Tartiblashtirilgan elementlar to‘plami.\r\n 2 Dasturlashda – faqat kompyuter xotirasi bilan chegaralangan, ixtiyoriy uzunlikdagi turli elementlarni birlashtiradigan ma’lumotlar strukturasi. Uzunligi nolga teng ro‘yxat bo‘sh ro‘yxat deb ataladi. Ro‘yxatning kamchiligi, uning elementiga ro‘yxatdagi pozitsiyasidan kelib chiqib to‘g‘ridan-to‘g‘ri murojaat eta olmasligidadir."
        ]
    },
    {
        "word": "RADIX-50",
        "type": [],
        "definition": [
            "Bitta 16 bitli so‘zda uchta simvolni yozish imkonini beradigan simvol kodi. Asosan, mini kompyuterlarda, RT-11 va RSX-11 operatsion tizimlarning fayl tizimlarida fayllar nomini, obyekt modullari va bibliotekalarda o‘zgaruvchilar modullar nomlarini saqlash uchun foydalanilgan."
        ]
    },
    {
        "word": "RAM SSD",
        "type": [],
        "definition": [
            "Energiyaga bog‘liq xotiradan foydalanish asosiga qurilgan to‘plagichlar, axborotni o‘ta tez o‘qish, yozib olish va izlab topish bilan tavsiflanadi. Asosan, katta quvvatli grafik stansiyalarning va yirik ma’lumotlar bazalarini boshqarish tizimlarining ishini tezlashtirish uchun foydalaniladi. Bunday to‘plagichlar, odatda, ta’minot yo‘qolganda ma’lumotlarni saqlash uchun akkumulyatorlar bilan, birmuncha qimmat turadigan modellar – rezerv va\/yoki operativ nusxa ko‘chirish tizimlari bilan ta’minlangan."
        ]
    },
    {
        "word": "RDRAM",
        "type": [],
        "definition": [
            "Rambus kompaniyasi tomonidan Intel bilan hamkorlikda 1996 yilda ishlab chiqilgan operativ xotira standarti. Xotiraning o‘tkazish qobiliyati 1 Gbite\/s, keyinchalik 4 Gbite\/s."
        ]
    },
    {
        "word": "RS - 232",
        "type": [],
        "definition": [
            "Asinxron interfeys uchun fizik sath. RS - 232 kommunikatsion qurilma va terminal o‘rtasida 15 m gacha bo‘lgan masofaga ma’lumotlar va ba’zi bir maxsus signallar uzatilishini ta’minlaydi."
        ]
    },
    {
        "word": "RTLinux",
        "type": [],
        "definition": [
            "Mikroyadroli qat’iy real vaqt operatsion tizimi. RTLinux ustidagi ishlar 2007 yilda tugallangan."
        ]
    },
    {
        "word": "Raqamlashtirish",
        "type": [],
        "definition": [
            "Analog signalni diskret, raqamli signalga aylantirish jarayoni. Kompyuter analog qurilmalardan olinadigan tovush signallari va tasvirlar bilan ishlashida foydalaniladi."
        ]
    },
    {
        "word": "Radiochastotali maʼlumotlar uzatish vositalari",
        "type": [],
        "definition": [
            "Fayllarni radiokanal orqali (to‘g‘ri ko‘rinishsiz) kompyuterdan printerga, ma’lumotlar to‘plagichga 9-12 m ga uzatish uchun xizmat qiladigan elektron qurilmalar va dasturiy vositalar. Ishlashda qulaylik yaratadi, ulardan foydalanilganda qurilmalarni o‘zaro birlashtiradigan kabellar kerak bo‘lmaydi. Fayllardı radiokanal arqalı (tuwrı kórinissiz) kompyuterden printerge, maǵlıwmatlar toplaǵıshqa 9-12 m ge uzatıw ushın xızmet etetuǵın elektron qurılmalar hám baǵdarlamalıq qurallar. Islewde qolaylılıq jaratadı, olardan paydalanılǵanda qurılmalardı ózara birlestiretuǵın kabeller kerek bolmaydı."
        ]
    },
    {
        "word": "Razryad",
        "type": [],
        "definition": [
            "Pozitsion sanoq tizimida raqam egallaydigan, tartib raqamiga ega joy. So‘zda har qanday simvolning joyi. Razryad raqami birdan boshlab chapdan o‘ngga hisoblanadi. Razryadlarning umumiy soni so‘zning uzunligini belgilaydi."
        ]
    },
    {
        "word": "Ranjlash",
        "type": [],
        "definition": [
            "Obyektlar yoki ma’lumotlarni, tasniflash maqsadida darajalar bo‘yicha qandaydir belgilarga ko‘ra taqsimlash. Tasniflanadigan obyektlar yoki ma’lumotlar taqsimlanadigan darajalar ranglar deb ataladi."
        ]
    },
    {
        "word": "Rastrli grafika",
        "type": [],
        "definition": [
            "Tasvir nuqtalar to‘plami ko‘rinishida taqdim etiladigan grafika. Har bir nuqta rastr elementi deyiladi, uning tavsifi maxsus rastrli fayllarda saqlanadi. Rastrli fayllarning bir nechta formati bor, masalan, Windows da foydalaniladigan, apparat jihatdan mustaqil rastrli format DIB (Device Independent Bitmap)."
        ]
    },
    {
        "word": "Registr",
        "type": [],
        "definition": [
            "Jismonan protsessorda joylashgan va katta bo‘lmagan ma’lumotlarni vaqtincha saqlash, ulardan tez foydalanish imkonini beradigan qurilma."
        ]
    },
    {
        "word": "Real vaqt rejimi",
        "type": [],
        "definition": [
            "Hisoblash tizimining ishlash rejimi, bunda tashqi muhitda yuz beradigan jarayonlar to‘g‘risidagi ma’lumotlarni qayta ishlash, jarayonlar o‘zi kechadigan sur’atda kechadi."
        ]
    },
    {
        "word": "Rezident dastur",
        "type": [],
        "definition": [
            "Kompyuterning ishlash vaqtida operativ xotiraga joylashtiriladigan dastur, bajarilgandan so‘ng undan avtomatik ravishda olinmaydi, zaruratga qarab bajariladi va boshqa dasturlar ishiga xalaqit bermaydi."
        ]
    },
    {
        "word": "Rekursiv funksiya",
        "type": [],
        "definition": [
            "O‘ziga-o‘zi murojaat qiladigan funksiya. Rekursiv funksiyalardan funksional dasturlash tillarida, xususan, LISP tilida keng foydalaniladi."
        ]
    },
    {
        "word": "Relyatsion maʼlumotlar bazasi",
        "type": [],
        "definition": [
            "O‘zaro bog‘langan ikki o‘lchamli (relyatsion) jadvallar yig‘indisi. Har bir jadval bitta mohiyatni aks ettiradi. Relyatsion ma’lumotlar bazasida ikkita jadval orasidagi aloqalar aloqa kaliti (bosh jadval kaliti) orqali ta’minlanadi. Ma’lumotlar bazasi bilan ishlash uchun, jadvallardan, shakllar, so‘rovlar, hisobotlar, makroslar va modullardan foydalaniladi. Jadvallar ma’lumotlar bazasida axborotni saqlash uchun foydalanuvchilar tomonidan tuziladi, bunda har bir mohiyatga bitta jadval mos keladi. Jadval (maydon) ustunlari rekvizitlarning qiymatlarini, jadval (yozuv) satrlari esa, mohiyat nusxalarini ichiga oladi."
        ]
    },
    {
        "word": "Relyatsion model",
        "type": [],
        "definition": [
            "Ma’lumotlar strukturasini, ma’lumotlar ustidagi yo‘l qo‘yiladigan operatsiyalar, ma’lumotlarning yaxlitligi ta’minlanadigan maxsus qoidalar tavsiflangan ma’lumotlar modeli. Edgar Kodd tomonidan IBM firmasida 1970 yilda ishlab chiqilgan. An’anaviy nazariy ko‘plik amallar (birlashtirish, kesishish, farq va dekart ko‘paytmasi) va maxsus relyatsion amallar (seleksiya, proeksiya, birlashtirish va bo‘lish) yo‘l qo‘yiladigan ikki o‘lchamli jadvallar ko‘rinishida taqdim etiladi. Modeldan foydalanish, relyatsion ham ma’lumotlar bazalarini, ham relyatsion ma’lumotlar bazalarini boshqarish tizimini yaratish imkonini berdi."
        ]
    },
    {
        "word": "Relyatsion maʼlumotlar bazasini boshqarish tizimi (RMBBT)",
        "type": [],
        "definition": [
            "Relyatsion model asosida tuzilgan, relyatsion ma’lumotlar bazasini boshqarish tizimi. Har bir relyatsion ma’lumotlar bazasini boshqarish tizimi – bu, jadvallarni qayta ishlashga spetsifik yetarlicha kuchli dasturlash tilidir. Bu tizimlarning oxirgi versiyalari na faqat yaxshi tezlik sifatlariga, balki qulay foydalanuvchi interfeysiga ham ega. Bu tizim tarkibiga odatda strukturalangan so‘rovlar (SQL) tili kiradi. Shaxsiy kompyuterlar uchun belgilangan ko‘plab relyatsion ma’lumotlar bazalarini boshqarish tizimi tarkibiga uchta modul: komanda tili, talqin qiladigan va\/yoki kompilyatsiyalovchi tizim va foydalanuvchi qobig‘i kiradi."
        ]
    },
    {
        "word": "Raqamli videointerfeys",
        "type": [],
        "definition": [
            "Interfeys standarti va videotasvirlarni suyuq kristalli monitor, televizor, proyektor kabi raqamli aks ettirish qurilmalariga uzatish uchun mo‘ljallangan tegishli razyom. Digital Display Working Group konsorsiumi tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Raqamli universal disk",
        "type": [],
        "definition": [
            "Texnologiya va tashqi xotira qurilmasi. Lazer texnologiyalarga kiradi. CD-ROM dagiga qaraganda, to‘lqin uzunligi birmuncha qisqa bo‘lgan lazerlardan foydalaniladi, shu sababli, 5 dyuymli diskka 4,7Gbyte ma’lumot yozish mumkin; disk ikki qatlamli va ikki tomonlama bo‘lishi mumkin, bu disk sig‘imini 17 Gbyte gacha yetkazish imkonini beradi. Bunday disklardan multimedia ilovalarda keng foydalaniladi."
        ]
    }
]