[
    {
        "word": "Sokol tarmoq adapteri",
        "type": [],
        "definition": [
            "Kompyuterni lokal kompyuterlar tarmog‘iga ulash uchun mo‘ljallangan adapter"
        ]
    },
    {
        "word": "Simsiz belgilash tili",
        "type": [],
        "definition": [
            "Simsiz tizimlarni belgilash tili. XML spetsifikatsiyasiga mos keluvchi sintaksisli WWW sahifalarini yaratish tili. Soddalashtirilgan HTML ga o‘xshaydi."
        ]
    },
    {
        "word": "Sakkizlik sanoq tizimi",
        "type": [],
        "definition": [
            "Asosi 8 bo‘lgan pozitsion sanoq tizimi. Sonlarni yozish uchun, 0, 1, 2, 3, 4, 5, 6, 7 raqamlaridan foydalaniladi."
        ]
    },
    {
        "word": "Sana",
        "type": [],
        "definition": [
            "Kompyuterning CMOS-xotirasida saqlanadigan sana. Hujjat yaratilgan vaqtni aniqlash uchun xizmat qiladi va sinxronlashda yordam beradi"
        ]
    },
    {
        "word": "Sigʻim",
        "type": [],
        "definition": [
            "Kompyuter xotirasida saqlanishi mumkin bo‘lgan ma’lumotlarning maksimal hajmi. Barcha turdagi xotira sig‘imi bitlarda, baytlarda va ularning hosilalarida o‘lchanadi."
        ]
    },
    {
        "word": "Soʻroq",
        "type": [],
        "definition": [
            "Tizimga topshiriq, uning bajarilishi natijasida javob shakllanadi. Masalan, printer bosish uchun ma’lumotlarning yangi bir ulushini so‘raydi; foydalanuvchi ma’lumotlar bazasidan ma’lumotlar oladi. Ma’lumotlar bazalariga so‘roqlarni shakllantirish va tegishli javoblar olish uchun maxsus dasturlash tillari mavjud; ulardan eng ommaviy tarqalgani – strukturalangan so‘roqlar tilidir."
        ]
    },
    {
        "word": "Sunʼiy intellekt",
        "type": [],
        "definition": [
            "1 Odamning intellektual faoliyatini ma’lum darajada haqiqatga o‘xshash tarzda imitatsiya qilish uchun mo‘ljallangan vositalar hamda metodlar ishlab chiqish, eksperimentlar, ilmiy tadqiqotlar uchun umumiy nom, shuningdek, amaliy jarayonning odamning oqilona xulq-atvori bilan birlashib ketadigan xususiyatlarni aniqlay olish qobiliyati.\r\n 2 Avtomat va avtomatlashtirilgan tizimlarning odam intellektining ayrim funksiyalarini o‘ziga olish xususiyati, masalan, tashqi ta’sirlarni oqilona tahlil qilish va oldin olingan tajriba asosida optimal qarorlar qabul qilish va tanlash."
        ]
    },
    {
        "word": "Sayt",
        "type": [],
        "definition": [
            "Umumiy nom, mavzu va navigatsiya tizimi bilan bog‘langan Web-sahifalar to‘plami. Matn, grafika, animatsiya, tovush sifatida talqin qilinadigan dastur. Saytni rasmiylashtirish HTML, Java tillari yordamida amalga oshiriladi."
        ]
    },
    {
        "word": "Segment",
        "type": [],
        "definition": [
            "Operativ xotiraning, dastur, ma’lumotlar yoki ma’lumotlar stekini saqlash uchun operatsion tizim ajratadigan sohasi."
        ]
    },
    {
        "word": "Sektor",
        "type": [],
        "definition": [
            "Egiluvchan yoki magnit qattiq disk yo‘lkasining, ma’lumotlar yozilgan qismi. Sektor – xotiraning o‘z adresiga ega bo‘lgan eng kichik birligi."
        ]
    },
    {
        "word": "Semantika",
        "type": [],
        "definition": [
            "Til yoki tizimdagi har bir sintaktik konstruksiyaning ma’nosi. Dasturlash tillarida translyator sintaktik tuzilishlarni operatsion tizim va protsessor tushunadigan komandalarga aylantiradi. Ma’noviy xatolarni translyator aniqlamaydi, ularni qidirib topish bilan testlash, sozlash va hatto ekspluatatsiya jarayonida odam shug‘ullanadi."
        ]
    },
    {
        "word": "Semafor",
        "type": [],
        "definition": [
            "Ba’zi dasturlash tillarida ma’lumotlarning maxsus turi. Kompyuterning, turli jarayonlar intiladigan ba’zi resurslaridan foydalanishni boshqaradi, ya’ni jarayonlar bajarilishini sinxronlashtiradi."
        ]
    },
    {
        "word": "Sensorli panel",
        "type": [],
        "definition": [
            "Barmoqning harakatlanishi paytida qurilma yuzasidagi elektr maydonning o‘zgarishidan ishlaydigan manipulyator."
        ]
    },
    {
        "word": "Server",
        "type": [],
        "definition": [
            "Mijoz dasturi yoki komyuter resurslari va ma’lumotlariga xizmat ko‘rsatuvchi dastur yoki kompyuter. Mijoz dastur serverga so‘rovni OLE, DDE yoki boshqa formatlarda uzatadi."
        ]
    },
    {
        "word": "Siqish",
        "type": [],
        "definition": [
            "Tarmoqda ishlash vaqtida uzatiladigan ma’lumotlar hajmini kamaytirish va saqlash uchun zarur bo‘lgan xotira hajmini kamaytirish maqsadida ma’lumotlarni o‘zgartirish. Ma’lumotlarni siqish metodlari kodlash yo‘li bilan ortiqchalikni kamaytirishga asoslangan. Siqish darajasi fayl turiga bog‘liq, bajariladigan fayllar amalda kamaymaydi, grafik ma’lumotlar bo‘lgan fayllar 4 marta siqiladi."
        ]
    },
    {
        "word": "Simvol",
        "type": [],
        "definition": [
            "Alfavitning muayyan qiymatiga ega bo‘lgan elementi. Odatda, kompyuter xotirasida 8 ta bit yoki bayt bilan yoziladi."
        ]
    },
    {
        "word": "Simpleks ulanish",
        "type": [],
        "definition": [
            "Orasida faqat bir yo‘nalishda ma’lumotlarning uzatilishi amalga oshirilishi mumkin bo‘lgan ikki nuqtaning mantiqiy va fizik birikishi."
        ]
    },
    {
        "word": "Sinaps",
        "type": [],
        "definition": [
            "Neyron tarmoqlar tushunchasi. Sinaps – neyronlar o‘rtasidagi bog‘lanishdir. Bir neyrondan chiqadigan chiqish signali, bu signalni boshqa neyronga uzatadigan sinapsga kelib tushadi. Bunda signal o‘zgartirilishi mumkin. Murakkab sinapslarda xotira bo‘lishi mumkin."
        ]
    },
    {
        "word": "Sinergetika",
        "type": [],
        "definition": [
            "Fizik, ximik va biologik ochiq tizimlarda yuqori tartiblashtirilgan strukturalarning spontan (o‘z-o‘zidan) hosil bo‘lishini o‘rganadigan fan."
        ]
    },
    {
        "word": "Sintaksis",
        "type": [],
        "definition": [
            "Til yoki tizimda matn so‘zlari, konstruksiyalari va strukturalarini qurish qoidalari to‘plami. Ba’zi mualliflar sintaksisga alifboni ham kiritadilar. Til sintaksisini tavsiflashning ko‘plab usullari mavjud, ularning ichida eng ko‘p tarqalganlari – sintaktik diagrammalar va kengaytirilgan Bekus-Naur shakli. Dasturni yozishda paydo bo‘ladigan va faqat sintaksisga taalluqli xatolar, translyator amalga oshiradigan sintaktik tahlil paytida aniqlanadi."
        ]
    },
    {
        "word": "Sintaktik diagramma",
        "type": [],
        "definition": [
            "Dasturlash tili sintaksisining grafik ko‘rsatilishi. Sintaktik diagrammalar kengaytirilgan Bekus-Naur shakliga to‘g‘ri keladi va dasturlash tilini tavsiflashda foydalaniladi."
        ]
    },
    {
        "word": "Sinxronlash",
        "type": [],
        "definition": [
            "Biror - bir ish (xabar) ning vaqt, chastota yoki signal bo‘yicha moslashtirilishi. Kompyuter yoki boshqa qurilmaning aloqasini tasdiqlovchi signallar ketma-ketligi. Apparat sinxronlash – bu qurilmani ma’lumotlarni uzatish yoki qabul qilishga tayyorligi-ni ko‘rsatuvchi signallarni aniq bir tarmoq (ma’lumotlar tarmog‘idan farqli ravishda) orqali almashinuvi. Dasturiy sinxronlashda signallar xuddi modemlar orasida telefon kanali bo‘yicha aloqa qilish singari, ma’lumotlarni uzatish uchun qo‘llaniladigan tarmoq orqali yuboriladi."
        ]
    },
    {
        "word": "Sanoq tizimi",
        "type": [],
        "definition": [
            "Sonlarni aks ettirish usuli va ular ustida bo‘ladigan amallar qoidalari. Pozitsion va nopozitsion sanoq tizimlari farqlanadi. Kompyuterda hisoblashlarda pozitsion sanoq tizimlaridan foydalaniladi."
        ]
    },
    {
        "word": "Skaner",
        "type": [],
        "definition": [
            "Tasvirni ikki o‘lchamli sirtdan kompyuterga kiritish qurilmasi.\r\n Izoh ‒ To‘rt turdagi skaner farqlanadi: qo‘l skaneri; varaqli skaner; planshetli skaner; barabanli skaner."
        ]
    },
    {
        "word": "Skrembler",
        "type": [],
        "definition": [
            "Xabarlardan ruxsat etilmagan tarzda foydalanishning oldini olish maqsadida ma’lumotlarni kodlash\/dekodlash uchun mo‘ljallangan qurilma yoki dekoder."
        ]
    },
    {
        "word": "Skript",
        "type": [],
        "definition": [
            "Operatsion tizim yoki dastur muayyan holatda ishga tushiradigan komandalar va\/yoki harakatlar ketma-ketligi, kichik dastur yoki makros. Ssenariylar ko‘pincha matnli fayllarda saqlanadi."
        ]
    },
    {
        "word": "Soʻz",
        "type": [],
        "definition": [
            "1. Berilgan alifboda simvollarning muayyan ma’noga ega bo‘lgan tartiblashtirilgan to‘plami.\r\n 2. Protsessorda ma’lumotlarni qayta ishlash va uzatishda bir butun deb qaraladigan ma’lumotlar birligi. Odatda, bitlarda yoki ikkilik razryadlarda o‘lchanadi. Qoidaga ko‘ra, mashina so‘zi deb ataladi."
        ]
    },
    {
        "word": "Smaylik",
        "type": [],
        "definition": [
            "His-tuyg‘ularni ifodalaydigan, asosiy va yordamchi simvollardan tuzilgan belgi. Internet tarmog‘ida muloqot chog‘ida (elektron pochtada, chatlarda) foydalaniladi. Uchta simvol: «:» ikki nuqta, «-» defis va yopadigan qavs «)» dan iborat."
        ]
    },
    {
        "word": "Smartfon",
        "type": [],
        "definition": [
            "Cho‘ntak shaxsiy kompyuterining funksionalligi qo‘shilgan mobil telefon."
        ]
    },
    {
        "word": "Soprotsessor",
        "type": [],
        "definition": [
            "Asosiy protsessorning funksional imkoniyatlarini oshiradigan qo‘shimcha protsessor."
        ]
    },
    {
        "word": "Spam",
        "type": [],
        "definition": [
            "Foydalanuvchining so‘rovisiz, majburiy tarzda jo‘natiladigan keraksiz ma’lumotlar. Bunga misol tariqasida turli telekonferensiyalarda ro‘yxatdan o‘tgan ishtirokchilarga diskussiya olib borish qoidalarini ma’lum qilish, yoki reklamalar va boshqalar kiradi. Yana bu turli xildagi «elektron chiqindi»ni atashda xam ishlatiladi. Spamni yashirish yo‘llari mavjud bo‘lib, stealth spam deb ataladi."
        ]
    },
    {
        "word": "Spetsifikatsiya",
        "type": [],
        "definition": [
            "Tizimning maqsadi va funksional imkoniyatlarini belgilaydigan tavsif. Qoidaga ko‘ra, tizimni ishlab chiqish paytida foydalaniladi. Dastur spetsifikatsiyasi kirish va chiqish ma’lumotlari tavsiflanishini ko‘zda tutadi."
        ]
    },
    {
        "word": "Splayn",
        "type": [],
        "definition": [
            "Kompyuter grafikasida – bir nechta nuqta bo‘yicha tuzilgan egri chiziq. Egri chiziqning tavsifi qandaydir darajadagi polinom bilan beriladi."
        ]
    },
    {
        "word": "Spravochnik",
        "type": [],
        "definition": [
            "Ma’lumotlar elementlari va ularning kompyuter xotirasida joylashishi o‘rtasidagi muvofiqlikni belgilaydigan havolalar to‘plami."
        ]
    },
    {
        "word": "Sprayt",
        "type": [],
        "definition": [
            "Foydalanuvchi tomonidan aniqlanadigan, tavsiflanadigan obyekt; ekran bo‘ylab dastur komandalari boshqaruvida ekran (matn, grafika) ning boshqa elementlaridan mustaqil ravishda harakatlanishi mumkin. Ba’zi dasturlash tillarida, masalan, BASIC da foydalaniladi."
        ]
    },
    {
        "word": "Standart",
        "type": [],
        "definition": [
            "Tizimlarning birgalikda ishlash va birikish imkoniyatini yaratish maqsadida, texnik, dasturiy, axborot ta’minotiga ko‘rsatiladigan talablar.\r\n Izoh ‒ Standartlar ikki turda bo‘ladi: de-yure, standartlar rasman e’lon qilinadi va ma’qullanadi; de-fakto, ko‘pchilik standartlardan haqiqatda foydalanadi, lekin rasmiy ravishda ular rasmiylashtirilmagan bo‘ladi. Ba’zan, firma ichida foydalanish uchun ishlab chiqilgan standart umumqabul qilingan standart bo‘ladi."
        ]
    },
    {
        "word": "Standart PCMCIA",
        "type": [],
        "definition": [
            "Tashqi qurilmalar (xotira, modemlar) ni bloknotli kompyuterlarga ulash uchun kartalar interfeysi va o‘lchamlarini belgilaydigan standart. PCMCIA standartining yangi versiyasi. Uzatish tezligini 133 Mbyte\/s gacha ta’minlay oladigan 32-razryadli shina interfeysi – CardBus qo‘llaniladi; energiya iste’molini boshqarish vositalariga ega, xotiradan to‘g‘ridan-to‘g‘ri foydalanish mumkin, ko‘p funksional kartalarni qo‘llaydi.\r\n Izoh ‒ O‘zaro yuqoridan pastga moslashtirilgan PCMCIA –I,II,III kartalar (platalar) turi mavjud. I turdagi platalardan xotiraning turli xillarini ulash uchun foydalaniladi, qalinligi 3,3 mm II turdagi platalardan turli xil kiritish\/chiqarish qurilmalarini, egiluvchan magnit diskdagi to‘plagichlarni, modemlar, tarmoq platalarini ulash uchun foydalaniladi, qalinligi chetlarida 3,3 mm, o‘rtasida 5 mm III turdagi platalardan qattiq diskovodlarning turli xillarini, peyjerlarni ulash uchun foydalaniladi, qalinligi chetlarida 3,3 mm, o‘rtasida 10 mm."
        ]
    },
    {
        "word": "Statistik paket",
        "type": [],
        "definition": [
            "Ma’lumotlarni statistik qayta ishlash uchun belgilangan dasturiy mahsulot, qabul qilinadigan qarorlar sifatini oshirishning ishonchli vositasi. Paketga amaliy grafika, dispersion tahlil, regression tahlil, vaqt qatorlari tahlili va boshqalar kiradi."
        ]
    },
    {
        "word": "Statik kompanovka",
        "type": [],
        "definition": [
            "Bajariladigan dasturga bibliotekalardan olingan standart funksiyalarni, dasturning bajariladigan faylga ularni joylashtirish yordamida qo‘shish metodi, ya’ni statik komponovkada biblioteka obyekti bevosita dasturning bir qismiga aylanib ketadi. Diskli operatsion tizim boshqaruvidagi tillarda foydalaniladi."
        ]
    },
    {
        "word": "Statik operativ xotira",
        "type": [],
        "definition": [
            "Yarimo‘tkazgichli operativ xotiraning bir turi. Har bir ikkilik razryad (bit) to‘rtta tranzistor va ikkita rezistordan iborat sxemada saqlanadi. Sxemada kondensator yo‘q, shuning uchun zaryadlash kerak emas. Statik operativ xotira dinamik operativ xotiraga qaraganda tezroq ishlaydi. Lekin qimmat va ko‘p joyni egallaydi."
        ]
    },
    {
        "word": "Stek",
        "type": [],
        "definition": [
            "Xotiraning, protseduralar va funksiyalardan qaytish adreslari, ularning parametrlari va chaqirilgan protsedura yoki funksiya ekzemplyariga taalluqli bo‘lgan boshqa ma’lumotlar saqlanadigan, ya’ni dasturda ma’lumotlarni vaqtinchalik saqlash uchun foydalaniladigan qismi. Stekka joylashtiriladigan oxirgi element u yerdan birinchi bo‘lib olinadi."
        ]
    },
    {
        "word": "Strimer",
        "type": [],
        "definition": [
            "Ma’lumotlarni magnit tasmada uzoq muddat saqlash uchun mo‘ljallangan qurilma. Ma’lumotlarning rezerv nusxalarini tuzish uchun qo‘llaniladi. Sig‘imi 80 Mbyte dan boshlab (siqishsiz), saqlanishlik muddati katta, saqlash qiymati nisbatan arzon"
        ]
    },
    {
        "word": "Satr",
        "type": [],
        "definition": [
            "Simvollarning tartiblashtirilgan ketma-ketligi. Dasturlash tillarida – tegishli operatsiyalar – konkatenatsiya, nisbatlar belgilangan ma’lumotlar turi. Satrni simvollarning bir o‘lchamli massivi sifatida ham ta’riflash mumkin."
        ]
    },
    {
        "word": "Struktura",
        "type": [],
        "definition": [
            "Bir yoki bir nechta, balki har xil turdagi elementlardan iborat ma’lumotlar elementi."
        ]
    },
    {
        "word": "Strukturaviy dasturlash",
        "type": [],
        "definition": [
            "Jiddiy dasturiy komplekslarni ishlab chiqish metodologiyasi va texnologiyasi. Quyidagi prinsiplarga asoslangan: dasturlash yuqoridan pastga tomon amalga oshirilishi kerak; butun loyiha bitta kirish va bitta chiqish bo‘lgan modullarga bo‘linishi kerak (modulning optimal o‘lchami – displey ekranidagi satrlar soni); dastur va algoritm logikasi faqat uchta asosiy strukturaga – ketma-ket bajarish, tarmoqlanish va takrorlanishga yo‘l qo‘yishi kerak. Dasturning har qanday nuqtasiga boshqarishni topshirish operatoriga yo‘l qo‘yilmaydi, ishlab chiqish vaqtida hujjatlar dasturlash bilan bir vaqtda, dasturga sharhlar ko‘rinishida tuzilishi kerak, strukturaviy dasturlashning maqsadi – dasturlarning ishonchliligini oshirish, o‘zgartirish va qo‘llashni ta’minlash, ishlab chiqishni osonlashtirish va tezlashtirishdir."
        ]
    },
    {
        "word": "Summator",
        "type": [],
        "definition": [
            "Kompyuter protsessoridagi registr, uning yordamida sonlarni qo‘shish amali bajariladi. Neyron tarmoqlar tushunchasi. Summator – sinapslar orqali neyronlardan keladigan signallar jamlanadigan blok. Umumiy holda, sigallarni o‘zgartirishi va ularni yana sinapslar orqali summatorlarga yoki neyronlarga uzatish mumkin."
        ]
    },
    {
        "word": "Supervizor",
        "type": [],
        "definition": [
            "Operatsion tizimda resurslardan foydalanishni muvofiqlashtiradigan va markaziy protsessor orqali operatsiyalarning bajarilishini ta’minlaydigan dasturlar yoki dastur; operatsion tizimning, ma’lumotlarni avtomatik qayta ishlash tizimida boshqa dasturlarning bajarilishini boshqarish uchun mo‘ljallangan qismi."
        ]
    },
    {
        "word": "Sandy Bridge",
        "type": [],
        "definition": [
            "Intel firmasi tomonidan ishlab chiqilgan markaziy protsessorlar mikroarxitekturasi. 32 razryadli texnologik jarayonga asoslangan, o‘rnatilgan videotezlatkichni ichiga oladi."
        ]
    },
    {
        "word": "S-Bus",
        "type": [],
        "definition": [
            "Yuqori tezlikli SPARC protsessorlari uchun mo‘ljallangan yuqori tezlikli shina. 1989 yilda Sun Microsystems tomonidan taqdim qilingan. Hozirgi kunda S-Bus dan foydalanilmaydi."
        ]
    },
    {
        "word": "Sozlovchi",
        "type": [],
        "definition": [
            "Ishlab chiqiladigan dasturni sozlash jarayonini soddalashtiradigan dastur. Dasturning qadamlab bajarilish, nazorat nuqtalarini o‘rnatish, trassalashtirish, o‘zgaruvchilar qiymatlarini ko‘rib chiqish imkoniyatini beradi."
        ]
    },
    {
        "word": "Sikl parametri",
        "type": [],
        "definition": [
            "Sikl bajarilishini boshqaradigan o‘zgaruvchi. Dasturning har bir siklida o‘z qiymatini sikl jismining har bir o‘tishida o‘zgartiradigan parametr bor. Agar bunday parametr bo‘lmasa, sikl noto‘g‘ri tuzilgan va sikllanish imkoniyati yuzaga keladi. Dasturlashda ba’zan «abadiy» sikllar quriladi, ulardan chiqib ketish maxsus komandalar orqali amalga oshiriladi. Bunday sikllarda sikl parametrlari bo‘lmaydi, bu esa, dasturlash uslubini buzadi."
        ]
    },
    {
        "word": "Saralash",
        "type": [],
        "definition": [
            "Qandaydir ko‘plikdagi kerakli elementni izlab topish usuli. To‘la saralash metodlari real vazifalarda juda ko‘p mashina vaqtini talab qiladi, shuning uchun, imkoni bo‘lsa, yo‘naltirilgan izlab topish metodlaridan foydalanish maqsadga muvofiq."
        ]
    },
    {
        "word": "Simvollarni optik aniqlash dasturi",
        "type": [],
        "definition": [
            "Simvolning (mashinada yoki qo‘lda yozilgan) grafik obrazini kompyuterdagi simvol kodi bilan muvofiqlikka keltiradigan dastur. Odatda, skanerlar bilan birga yoki pero yordamida kiritilgan matnni qayta ishlashda foydalaniladi. Hozirgi vaqtda mashinada yozilgan matnni talqin qilish aniqligi 95%dan ko‘proq."
        ]
    },
    {
        "word": "Simsiz erkin foydalanish protokoli",
        "type": [],
        "definition": [
            "Barcha turdagi mobil radioaloqa tizimlarini, portativ kompyuterlarni Internet tarmog‘iga ulash uchun belgilangan spetsifikatsiyalar to‘plami. Mobil qurilmalarda WWW resurslarini qarab chiqish imkonini beradigan ilovalarni yaratish uchun qilinadi. Bu protokol negizida WAP tarmoqlar quriladi. WAP protokoli 1997 yilda kompaniyalar guruhi (200 dan ortiq, shu jumladan, Motorola, Nokia, Ericsson va boshq.) tomonidan ishlab chiqilgan."
        ]
    },
    {
        "word": "Sikl",
        "type": [],
        "definition": [
            "Algoritmning qismini bajarish sxemasi, bunda ba’zi harakatlar takrorlanadi. Grafdagi, uzellarning biridan boshlanadigan va unda tugaydigan yo‘l. Protseduraga yo‘naltirilgan dasturlash tilidagi (\/) operator, dastur qismi qanchadir marta bajarilishini ta’minlaydi. Deklarativ turdagi dasturlash tillarida siklik konstruksiyalar rekursiv tuzilishlar yordamida bajariladi."
        ]
    },
    {
        "word": "Sichqoncha tugmachasini bosish",
        "type": [],
        "definition": [
            "Kompyuterga tegishli komandani berish uchun sichqoncha tugmachasini bosish."
        ]
    },
    {
        "word": "Si til",
        "type": [],
        "definition": [
            "Umumiy maqsadlardagi dasturlash tili, o‘zining samaradorligi, tejamliligi va ko‘chirib bo‘lishligi bilan ma’lum. Bu, dasturiy mahsulotning deyarli har qanday turini ishlab chiqishning yaxshi sifatini ta’minlaydi. Si tilidan instrumental til sifatida foydalanish, tez va ixcham dasturlar olish imkonini beradi."
        ]
    },
    {
        "word": "Strukturalangan soʻrovlar tili",
        "type": [],
        "definition": [
            "Ma’lumotlar bazalari bilan ishlash uchun mo‘ljallangan yuqori daraja tili. Ma’lumotlarni o‘zgartirish, so‘rovlar tuzish va bajarish, hisobotlar ko‘rinishida natijalarni chiqarish imkonini beradi. IBM firmasi tomonidan XX asrning 80 - yillari boshida ishlab chiqilgan. Hozirgi vaqtda relyatsion turdagi ma’lumotlar bazalarini boshqarish tizimlari uchun umumqabul qilingan standart hisoblanadi."
        ]
    },
    {
        "word": "Soddalashtirilgan modellash tili",
        "type": [],
        "definition": [
            "Dasturiy ta’minot ishlab chiqish sohasida, obyektlarni modellashtirish uchun grafik tasvirlash tili. UML ko‘p sohalarda foydalanish uchun mo‘ljallangan til hisoblanadi, bu UML model deb ataluvchi, tizimning abstrakt modelining grafik ko‘rinishini tasvirlovchi ochiq standartdir. UML dasturiy tizimda aniqlik kiritish, tasvirlash, loyihalash va hujjatlashtirish uchun yaratilgan. UML dasturiy ta’minotda foydalanish bilan cheklanib qolmaydi. Uni shu kabi biznes-jarayonlarni modellashtirish, tizimli loyihalash va tashkilotlar strukturasini tasvirlashda qo‘llash mumkin. UML dasturiy ta’minot dasturchilariga umumiy tushunchalarni (klass, komponent, umumlashtirish, birlashtirish va o‘zini tutish kabi) tasvirlashni grafik izohlashda kelishuvga erishish hamda loyihalash va arxitekturada ko‘proq e’tibor qaratishga imkon beradi."
        ]
    }
]