[
    {
        "word": "Shriftni oʻrnatish",
        "type": [],
        "definition": [
            "True Type shriftlarining biri bilan tayyorlangan matn, bunday shrift bo‘lmagan boshqa kompyuterga ko‘chirilganda, baribir ayni shunday shriftli printerda o‘qiladigan, bosiladigan texnologiya. Shrift matn bilan birga uzatiladi, undan faqat shu matn va matn tayyorlangan muhit (ilova) bilan foydalanish mumkin. Windows muhitida ishlaydi."
        ]
    },
    {
        "word": "Sharh",
        "type": [],
        "definition": [
            "Dasturlashda til konstruksiyasi bo‘lib, dasturga yoki komanda fayliga uni hujjatlashtirish maqsadida tushuntiruvchi matn sifatida qo‘shiladi. Dastur boshlang‘ich matni translyatsiya qilinganda va komandalar fayli bajarilishi paytida sharhlar tashlab ketiladi."
        ]
    },
    {
        "word": "Shiddatli oqim",
        "type": [],
        "definition": [
            "Fayllarni Internet orqali kooperativ almashinish uchun belgilangan tarmoq protokoli. Protokol Brem Koen tomonidan yaratilgan. Fayllarni alohida fragmentlarga bo‘lish va ularni tarmoqning turli uzellarida saqlash hisobiga, ayrim foydalanuvchilar o‘rtasida trafikning taqsimlanishini ko‘zda tutadi (aynan bitta faylga qancha ko‘p odam murojaat qilsa, uni shuncha tez ko‘chirib olish mumkin bo‘ladi)."
        ]
    },
    {
        "word": "Shaxsiy kompyuter",
        "type": [],
        "definition": [
            "Individual foydalanish uchun mo‘ljallangan kompyuter. Kompyuterni shaxsiy kompyuterlar klassiga kiritishning asosiy kriteriylari: o‘lchamlarining kichikligi, ularga xizmat ko‘rsatish zaruratining yo‘qligi, narxining pastligi, funksional universalligi va modernizatsiyalashning soddaligi. Shaxsiy kompyuterlarning yaratilish tarixi 1974 yildan boshlanadi. Shu yili MTTS (AQSh) firmasi Intel 8080 mikroprotsessori asosida Altair kompyuterini ishlab chiqdi. 1975 yilda Stefan Voznyak va Stiv Jobs Apple nomi ostida kompyuter ishlab chiqdilar va dastlabki 200 ta kompyuterni yig‘dilar. 1976 yilning oxirida ular shaxsiy kompyuterlar ishlab chiqarishga ixtisoslashtirilgan Apple firmasini tuzdilar."
        ]
    },
    {
        "word": "Shaxsiy raqamli sekretar",
        "type": [],
        "definition": [
            "Odatda, klaviaturasi bo‘lmaydigan portativ kompyuterning bir turi. Ma’lumotlarni sensorli pa-nelga kiritish\/chiqarish maxsus ruchka yordamida amalga oshiriladi. Shuning uchun, ba’zan qo‘lda yozish bilan kiritiladigan kompyuter deb ham ataladi. Shaxsiy raqamli sekretar katta operativ va doimiy xotiraga ega. Parallel yoki ketma-ket interfeys orqali boshqa kompyuter bilan ma’lumotlar almashinish mumkin. Maxsus operatsion tizim boshqaruvi ostida ishlaydi. Shaxsiy raqamli sekretarning eng mashhuri Apple firmasining Newton idir."
        ]
    },
    {
        "word": "Shina",
        "type": [],
        "definition": [
            "Kompyuterlarda – protsessorni kompyuterning barcha elementlari bilan bog‘lash uchun belgilangan o‘tkazgichlar va yordamchi elementlar jami. Kompyuter tizimining asosiy komponentlari, jumladan, markaziy protsessor, xotira, kontrollerlar, tashqi qurilmalar ulanadigan parallel o‘tkazgichlar to‘plamini o‘zida ifodalaydi."
        ]
    },
    {
        "word": "Shina kontrolleri",
        "type": [],
        "definition": [
            "Standartga muvofiq, shina bo‘ylab uzatiladigan ma’lumotlar oqimi tuzilishini ta’minlaydigan va shina bo‘ylab signallar uzatilishini boshqaradigan kontroller."
        ]
    },
    {
        "word": "Shifr",
        "type": [],
        "definition": [
            "Kalitlardan foydalangan holda alohida qoidalar bo‘yicha amalga oshiriladigan, mumkin bo‘lgan ochiq (dastlabki) ma’lumotlar to‘plamini mumkin bo‘lgan shifrlangan ma’lumotlar to‘plamiga qayta o‘zgartirishlar jami."
        ]
    },
    {
        "word": "Shlyuz",
        "type": [],
        "definition": [
            "1 Bir tizimda foydalaniladigan axborot taqdim etish, qayta ishlash yoki uzatish standartlarini tegishli, lekin boshqa bir tizimda qo‘llaniladigan standartlarga o‘zgartirish maqsadida, dasturiy ta’minot va uskuna birikmasi bilan birgalikda amalga oshiriladigan funksiya.\r\n 2 Ma’lumotlar uzatishning turli protokollari bo‘yicha ishlaydigan elektron tizimlar o‘rtasida ma’lumotlar jo‘natish imkonini beradigan va tarmoqlararo aloqani ta’minlaydigan apparat yoki dasturiy vositalar."
        ]
    },
    {
        "word": "Shrift",
        "type": [],
        "definition": [
            "Yozilish shakli va o‘lchami bir bo‘lgan belgilarning to‘liq to‘plami.\r\n Izoh ‒ Kompyuterlarda foydalaniladigan shriftlarning katta soni mavjud. Printerlar uchun ichiga o‘rnatilgan va ta’minlanadigan shriftlar bo‘ladi. Ichiga o‘rnatilgan shriftlar printerning doimiy xotirasida saqlanib, foydalanishga doim tayyor turadi. Ta’minlanadigan shriftlar mashinaning operativ xotirasi orqali ishlaydi, protsessor resurslarini va xotirasini band etadi, ularning soni faqat tegishli dasturlarning mavjudligi bilan cheklanadi."
        ]
    },
    {
        "word": "Shrift kartriji",
        "type": [],
        "definition": [
            "Turli xil shriftlarni ichiga oladigan, printerga o‘rnatilgan doimiy xotirlovchi qurilma. Kartrij bilan komplektda stol noshirlik tizimlari va ma’lum redaktorlar uchun drayverlar yetkazib beriladi."
        ]
    },
    {
        "word": "Shart",
        "type": [],
        "definition": [
            "Sikl va tramoqlanish tuzilishlarda foydalaniladigan, «chin» yoki «yolg‘on» qiymat oladigan mantiqiy ifoda. Masalan, a=2 shart, a 2 qiymatga ega bo‘lsagina «chin» qiymat oladi, boshqa har qanday qiymatlarda a shart «yolg‘on» bo‘ladi."
        ]
    }
]