[
    {
        "word": "Tayanch kiritish-chiqarish tizimi",
        "type": [],
        "definition": [
            "Shaxsiy kompyuterlarda ishga tushish vaqtida qurilmalarni tekshirish, operatsion tizimni ishga tushirish hamda qurilmalar o‘rtasidagi ma’lumot almashinuvini ta’minlash uchun kerak bo‘lgan asosiy dasturiy ta’minot. Tayanch kiritish-chiqarish tizimi doimiy xotira qurilmasi mikrosxemasiga yozilgan dastur."
        ]
    },
    {
        "word": "Toʻplagichning tez ishlashi",
        "type": [],
        "definition": [
            "To‘plagichdagi ma’lumotlarni o‘qish\/yozish tezligi. Ikkita parametr bilan: o‘rtacha foydalanish vaqti hamda ma’lumotlar uzatish tezligi bilan belgilanadi."
        ]
    },
    {
        "word": "Tezkor fayl tizimi",
        "type": [],
        "definition": [
            "OS\/2 operatsion tizimining fayl tizimi bo‘lib, fayllarni nomlashda 254 ta belgidan foydalanish va fayllarni minimal fragmentlashni ta’minlaydi."
        ]
    },
    {
        "word": "Tarmoqlanish",
        "type": [],
        "definition": [
            "Algoritmlarni tuzishda foydalaniladigan uchta asosiy strukturadan biri. Sharoitga bog‘liq holda, algoritm turli tarmoqlarini bajarish imkonini beradi. Ba’zi manbalarda bu struktura tanlash deb ataladi. Tarmoqlanishga yuqori daraja dasturlash tillaridagi if… then… else; case… of kabi komandalar kiradi."
        ]
    },
    {
        "word": "Tashqi xotirlovchi qurilma",
        "type": [],
        "definition": [
            "Konstruktiv jihatdan alohida qilingan, ma’lumotlarni uzoq muddat saqlash uchun mo‘ljallangan qurilma; energiyaga bog‘liq bo‘lmagan xotira."
        ]
    },
    {
        "word": "Tashqi qurilma",
        "type": [],
        "definition": [
            "Kompyuterning markaziy protsessori bilan bevosita ishlamaydigan qurilma."
        ]
    },
    {
        "word": "Tanlab-tanlab olish",
        "type": [],
        "definition": [
            "Saralash maqsadida, ma’lumotlarni qandaydir belgilariga ko‘ra bir joydan boshqa bir joyga ko‘chirish yoki ulardan nusxa olish jarayoni, natijalovchi hujjatlarni tuzish."
        ]
    },
    {
        "word": "Tasodifiy sonlar generatori",
        "type": [],
        "definition": [
            "Tasodifiy sonlar ishlab chiqadigan qurilma yoki dastur. Haqiqatda tasodifiy sonlarni olish juda qiyin, amalda natijada doim psevdotasodifiy sonlar paydo bo‘ladi."
        ]
    },
    {
        "word": "Takt chastota generatori",
        "type": [],
        "definition": [
            "Teng vaqt oraliqlaridan so‘ng impulslar ketma-ketligini ishlab chiqaradigan qurilma. Ikkita ketma-ket impuls orasidagi vaqt takt deb ataladi. Protsessorning ba’zi komandalari bir nechta takt ichida chiqariladi. Kompyuterning barcha elementlari orqali o‘tadigan impulslar ularni yagona taktda – sinxron ishlashga majbur qiladi. Takt impulslarning gene-ratsiya chastotasi kompyuterning tez ishlashini belgilaydi."
        ]
    },
    {
        "word": "Tizimning doʻstonaligi",
        "type": [],
        "definition": [
            "Tizimning, foydalanuvchi bu tizim bilan ishlash paytida qulaylik yaratilishini aks ettiradigan sifat xarakteristikasi. Bu xarakteristika ham tizim uskunasiga, ham dasturiy vositalarga taalluqli. Masalan, odatdagi klaviatura o‘rniga qo‘lni tutib turadigan va har bir qo‘l uchun alohida bo‘lgan: ikki qismdan iborat klaviatura ishlab chiqilgan; suzib chiqadigan menyu oddiy menyudan qulayroq"
        ]
    },
    {
        "word": "Tiqin",
        "type": [],
        "definition": [
            "Strukturaviy dasturlashda (dasturni normal bajarish va kompilyatsiyalash mumkin bo‘lishi uchun) amalda dasturlashning har bir qadamida dasturga kiritiladigan ahamiyatsiz protsedura."
        ]
    },
    {
        "word": "Toʻxtatish",
        "type": [],
        "definition": [
            "Jarayon to‘xtatib turiladigan vaqt. Dasturlash tillari-dagi navbatdagi operator bajarilishini to‘xtatib turish protsedurasi."
        ]
    },
    {
        "word": "Talqin qiluvchi dastur",
        "type": [],
        "definition": [
            "Dasturni dasturlash tilida, uni darhol bajarmasdan mashina tilidagi dasturga o‘giradigan kompilyatordan farqli ravishda, dasturlash tilida yozilgan komandalarni darhol bajaradigan va rasshifrovka qiladigan dastur."
        ]
    },
    {
        "word": "Tarmoq maʼlumotlar bazasi",
        "type": [],
        "definition": [
            "Elementlari o‘zaro ixtiyoriy ravishda bog‘langan ma’lumotlar bazasi. Nazariy jihatdan har bir element bazaning istalgan boshqa bir elementi bilan bog‘langan bo‘lishi mumkin. Graf yordamida tavsiflanadi."
        ]
    },
    {
        "word": "Tarmoq operatsion tizimi",
        "type": [],
        "definition": [
            "Tarmoqning ishini ta’minlaydigan operatsion tizim. Asosiy funksiyalari: xabarlar uzatilishini boshqarish, ma’lumotlarni ruxsatsiz foydalanishdan himoyalash, kataloglarni boshqarish, elektron pochta. Lokal tarmoqlarda Novell firmasining NetWare tarmoq operatsion tizimidan keng foydalaniladi."
        ]
    },
    {
        "word": "Tarmoq kompyuteri",
        "type": [],
        "definition": [
            "Terminal sifatida global yoki korporativ tarmoqlarda ishlash uchun mo‘ljallangan kompyuter. An’anaviy shaxsiy kompyuterlardan tarmoqqa ulash uchun mo‘ljallangan o‘rnatiladigan vositalar va qattiq diskning bo‘lmasligi bilan farqlanadi. Tarmoq kompyuterini IBM, Apple, Sun kabi mashhur firmalar kiradigan konsorsium ishlab chiqadi. Tarmoq kompyuterlari asosan uyda qo‘llanish uchun yaratiladi, Internet tarmog‘i standartlariga asoslanadi."
        ]
    },
    {
        "word": "Tarmoq",
        "type": [],
        "definition": [
            "Texnik vositalar, ma’lumotlar, dasturlar tashkil qilish strukturasi. Graflar yordamida tavsiflanadi va tadqiq qilinadi. Qurilmalar o‘rtasidagi ulanishlar bo‘lib, foydalanuvchilarga ma’lumotlarni saqlash, ular bilan almashinish, ularga murojaat qilish imkonini yaratadi. Tarmoqqa asosan mikrokompyuterlar, minikompyuterlar, meyn-freymlar, terminallar, printerlar, fakslar, peyjerlar va turli ma’lumot saqlaydigan qurilmalar ulanadi."
        ]
    },
    {
        "word": "Tizim",
        "type": [],
        "definition": [
            "Qo‘yilgan vazifa (vazifalar) ni birgalikda hal etish maqsadida bog‘langan dasturlar, modullar, obyektlar yig‘indisi. Masalan, operatsion tizim foydalanuvchi bilan shaxsiy kompyuter o‘rtasidagi bog‘lanishni ta’minlash uchun mo‘ljallangan."
        ]
    },
    {
        "word": "Tarmoq boshqaruv tizimi",
        "type": [],
        "definition": [
            "Tarmoqni boshqarish va nazorat qilishning apparat va dasturiy vositalari jami, tarmoqni boshqaradigan kompyuterda joylashtirilgan dasturdan; tarmoq abonentlarining kompyuterlarida joylashtirilgan apparat va dasturiy agentlardan iborat. Tarmoqlarni boshqarishning umumqabul qilingan protokoli – SNMP (Simple Network Management Protokol – oddiy tarmoqni boshqarish protokoli) mavjud, bu protokol hatto turli xil abonentlar bo‘lgan tarmoqni ham boshqarish imkonini beradi. Tarmoqni boshqarishning asosiy funksiyalari: tarmoqni skanerlash va SNMP protokoli bo‘lgan qurilmalar mavjudligini aniqlash; tarmoq holatini aniqlash, portlar darajasida abonentlarni masofadan diagnostika qilish, parol bo‘yicha foydalanishga cheklashlar belgilash, 7\/0I tarmoq jurnalini yuritish va boshqalar, ya’ni tarmoq administratorini ma’lumotlarni boshqarish uchun barcha zarur narsalar bilan ta’minlash."
        ]
    },
    {
        "word": "Tizimli dasturiy taʼminot",
        "type": [],
        "definition": [
            "Foydalanuvchilarga kompyuter bilan ishlash imkoniyatini beradigan va bu ishni osonlashtiradigan dasturiy ta’minot. Operatsion tizim tizimli dasturiy ta’minotning asosiy qismi hisoblanadi. Tizimli dasturiy ta’minotga translyatorlar, qobiqlar, ma’lumotlar bazalarini boshqarish tizimlari kiradi."
        ]
    },
    {
        "word": "Tizimli blok",
        "type": [],
        "definition": [
            "Shaxsiy kompyuterning, ta’minot bloki, asosiy plata, kengayish platasi, magnit va optik disklardagi to‘plagichlar joylashgan qismi."
        ]
    },
    {
        "word": "Tizimli yondashuv",
        "type": [],
        "definition": [
            "Har bir masala, vazifa, hodisa, obyektni birmuncha keng yaxlit va ajralmas butunning – o‘zaro bog‘lagan tarkibiy elementlar tizimining bir qismi sifatida qarab chiqish metodi. Tizim ishlashining maqsadlari aniqlanishini, uning boshqa tizimlar bilan aloqalari ajratib ko‘rsatilishini ko‘zda tutadi; vazifaning hal etilishi o‘zaro bog‘langan vazifalar va yuqoriroq darajadagi muammolar hal etilishiga bog‘liq qilib qo‘yiladi."
        ]
    },
    {
        "word": "Tushadigan menyu",
        "type": [],
        "definition": [
            "Barcha oynalarga qo‘llaniladigan komandalar menyusi; displey ekranining yuqori burchagida joylashgan sarlavhasi ko‘rsatilgan holda chaqiriladigan, bevosita shu sarlavha ostida paydo bo‘ladigan va komanda tanlangandan so‘ng yo‘qo‘ladigan menyu. Shuningdek, «global menyu» deb ham ataladi."
        ]
    },
    {
        "word": "Teredo",
        "type": [],
        "definition": [
            "IPv6 paketlarni IPv4 tarmoq orqali, xususan, NAT texnologiyasi bo‘yicha ishlaydigan qurilmalar orqali, ularni UDP-deytagrammalarga inkapsullash yo‘li bilan uzatish uchun mo‘ljallangan tarmoq protokoli."
        ]
    },
    {
        "word": "Taʼminot",
        "type": [],
        "definition": [
            "Faoliyatning qandaydir turlarini amalga oshirish uchun xizmat qiladigan metodlar, vositalar to‘plami. Tizimning texnik ta’minoti – bu, tizimga kiradigan texnik vositalar to‘plamidir. Dasturiy ta’minot – dasturlar va ularni qo‘llash yuzasidan yo‘l-yo‘riqlar yig‘indisi. Tizim dasturiy ta’minoti – operatsion tizim va ma’lumotlar muhofaza qilinishini, ularni arxivlash va dearxivlashni amalga oshiradigan yordamchi dasturlar to‘plami, har xil testlar, ma’lumotlarni tiklash dasturlaridir."
        ]
    },
    {
        "word": "Teskari aloqa",
        "type": [],
        "definition": [
            "Tizim chiqish parametrlarining tizimning ishlashiga ta’sir ko‘rsatishi. Teskari aloqa prinsipi kibernetika tizimlaridagi asosiy prinsipdir. Masalan, odam – kompyuter teskari aloqa bo‘lgan tizimdir: odam kompyuterdagi o‘z ishining natijasini ko‘radi va natijaga bog‘liq ravishda keyingi ishni amalga oshiradi."
        ]
    },
    {
        "word": "Tizimni optimallash",
        "type": [],
        "definition": [
            "Optimallash kriteriysi, optimallash parametrlari va cheklashlar belgilanadigan, tizimni takomillashtirish jarayoni."
        ]
    },
    {
        "word": "Tizim platasi",
        "type": [],
        "definition": [
            "Kompyuterning asosiy komponentlari: mikroprotsessor, xotira (doimiy, operativ, video), kiritish\/chiqarish adapterlari o‘rnatilgan bosma plata. Tizim platasi shaxsiy kompyuterda foydalaniladigan shinalarni belgilaydi. Ba’zan, «ona» yoki asosiy plata deb ham ataladi."
        ]
    },
    {
        "word": "Takrorlanish",
        "type": [],
        "definition": [
            "Algoritmlarni tuzishda foydalaniladigan uchta asosiy strukturadan biri; sharoitga bog‘liq ravishda, algoritmning ayrim qadamlarini bir necha marta bajarish imkonini beradi. Ba’zi manbalarda bu struktura sikl deb ataladi."
        ]
    },
    {
        "word": "Takrorlagich",
        "type": [],
        "definition": [
            "Tarmoq elementlari orasida kabel uzunligi oshganda, kompyuter tarmog‘idagi signalni kuchaytiradigan va regeneratsiyalaydigan elektron qurilma."
        ]
    },
    {
        "word": "Toʻxtatish",
        "type": [],
        "definition": [
            "Boshqa bir dasturni yoki kiritish\/chiqarishni bajarishga o‘tish uchun, joriy dastur bajarilishini vaqtinchalik to‘xtatib turish. Apparat va dasturiy to‘xtatishlar bor. To‘xtatishlarni operatsion tizim boshqaradi. To‘xtatishlarni boshqarish uchun, maxsus to‘xtatishlar kontrolleri mavjud.\r\n Basqa bir baǵdarlamanı yaki kirgiziw\/shıǵarıwdı orınlawǵa ótiw ushın, ámeldegi baǵdarlamanıń orınlanıwın waqtınsha toqtatıp turıw. Apparat ham baǵdarlamalıq toqtatıwlar bar. Toqtatıwlardı operaciyalıq sistema basqaradı. Toqtatıwlardı basqarıw ushın, arnawlı toqtatıwlar kontrolleri bar."
        ]
    },
    {
        "word": "Taqsimlangan maʼlumotlar bazasi",
        "type": [],
        "definition": [
            "Ikki yoki undan ortiq kompyuterda joylashtiriladigan, foydalanuvchi tomonidan yaxlit, bir butun ma’lumotlar bazasi sifatida tushuniladigan ma’lumotlar bazasi."
        ]
    },
    {
        "word": "Taqsimlangan qayta ishlash",
        "type": [],
        "definition": [
            "Ma’lumotlarni qayta ishlash uchun, hisoblash tarmoqlariga ulangan katta miqdordagi kompyuterlarning qo‘llanilishi; ikki yoki undan ko‘p kompyuterni, yagona dastur boshqaruvi ostida shart emas, aynan bir topshiriq ustida birgalikda ishlaydigan qilib ulash. Barcha qayta ishlash bitta katta kompyuterda bajariladigan markazlashtirilgan qayta ishlashdan farqli ravishda, taqsimlangan qayta ishlashda topshiriq bitta tarmoqqa birlashtirilgan ko‘plab meynfreymlar, mini-kompyuterlar, shaxsiy kompyuterlar, serverlar va ishchi stansiyalar o‘rtasida bo‘linadi."
        ]
    },
    {
        "word": "Taqsimlangan tarmoq",
        "type": [],
        "definition": [
            "Boshqarish barcha serverlar o‘rtasida taqsimlangan, resurslar (apparat, dasturiy resurslar, ma’lumotlar) va foydalanuvchilar alohida serverlarga biriktirilmagan, balki butun tarmoqqa tegishli bo‘lgan kompyuter tarmog‘i."
        ]
    },
    {
        "word": "Taqsimlangan tizim",
        "type": [],
        "definition": [
            "Tizimni tashkil qilish, bunda kompyuterda qayta ishlash quvvatlari markazlashtirish o‘rniga taqsimlanadi."
        ]
    },
    {
        "word": "Tarmoq resurslari",
        "type": [],
        "definition": [
            "Tarmoq abonentlari foydalanishlari mumkin bo‘lgan ma’lumotlar bazalari, dasturlar, alohida qurilmalar (masalan, printer, diskli to‘plagichlar)."
        ]
    },
    {
        "word": "Til",
        "type": [],
        "definition": [
            "Xabarlar uzatish uchun belgilangan qoidalar va belgilashlar tizimi. Odamlar muomala qiladigan tabiiy tillar va odam – mashina, mashina – mashina tizimlarining birgalikda ishlashini ta’minlash uchun belgilangan sun’iy (yoki formal) tillar farqlanadi. Formal tillarga dasturlash tillari kiradi. Formal til alifbo, sintaksis va semantika bilan belgilanadi."
        ]
    },
    {
        "word": "Tezlashtirilgan grafika porti",
        "type": [],
        "definition": [
            "Videoadapter va tizim platasi mikrosxemalari o‘rtasidagi interfeys. PSI shinasiga asoslanadi. 1997 yilning ikkinchi yarmida ishlab chiqilgan. AGP ning bir nechta realizatsiyalari mavjud: AGP 1x, AGP 2x, AGP 4x lar mos ravishda 266, 533 va 1066 Mbyte\/s uzatish tezligiga ega. Ayni vaqtda PCI-Express grafi-ka porti ularning o‘rnini egallagan."
        ]
    },
    {
        "word": "Takomillashtirish",
        "type": [],
        "definition": [
            "Avvalgi mahsulotni takomillashtirish uchun belgilangan qurilma va\/yoki dasturiy mahsulot. Avvalgi versiyani to‘ldiradi. O‘rnatilgandan so‘ng tizim yangi mahsulotning funksional imkoniyatlarini oladi."
        ]
    }
]