[
    {
        "word": "Uzoq muddatli xotira",
        "type": [],
        "definition": [
            "Uzoq muddat mobaynida ma’lumotlarni saqlash uchun mo‘ljallangan kompyuter xotirlovchi qurilmasi. Saqlash vaqtida energiya ta’minoti bo‘lishiga bog‘liq emas. Ma’lumotlarni saqlashning turli fizik: magnit, optik, magnitooptik prinsiplariga ega"
        ]
    },
    {
        "word": "Uy kompyuteri",
        "type": [],
        "definition": [
            "Uyda foydalaniladigan, universal, ko‘p funksiyali, muomala qilish oson bo‘lgan, ishonchli, yuqori unumli, arzon, zamonaviy dizaynga ega kompyuter"
        ]
    },
    {
        "word": "Uz - faks",
        "type": [],
        "definition": [
            "Faksimil xabarlar, hujjatlarni kommutatsiya liniyalari (odatda, telefon liniyalari) orqali masofaga uzatish hamda masofadan qabul qilish qurilmasi."
        ]
    },
    {
        "word": "Ultra Sparc",
        "type": [],
        "definition": [
            "Umumiy qo‘llanishdagi, 64 razryadli, qisqartirilgan komandalar to‘plamiga ega mikroprotsessor. 143, 167, 182, 200 MHz takt chastotasi bilan chiqariladi, 0,5 mikronli SMOS texnologiya bo‘yicha qilingan, 5,2 mln tranzistorni ichiga oladi. Komandalar tizimi grafik ma’lumotlarni qayta ishlash uchun ko‘rsatmalarni ichiga oladi."
        ]
    },
    {
        "word": "USB – flesh-toplaǵısh",
        "type": [],
        "definition": [
            "Flesh-xotira tashuvchisi sifatida foydalaniladigan va USB interfeys orqali kompyuterga yoki boshqa o‘qish qurilmasiga ulanadigan xotirlovchi qurilma."
        ]
    },
    {
        "word": "Umumiy shina",
        "type": [],
        "definition": [
            "Periferik qurilmalar ulanadigan kompyuterda elektr signallarni uzatish uchun mo‘ljallangan yagona kanal. Kompyuter tarmog‘ining sxemasi – barcha kompyuterlar va tarmoq qurilmalari ma’lumotlar uzatiladigan yagona tarmoq kanaliga ulanadi."
        ]
    },
    {
        "word": "Umumiy arxitektura standarti",
        "type": [],
        "definition": [
            "Mikrosxemalar ishlab chiqaruvchilar guruhi tomonidan ishlab chiqilgan asosiy platalar arxitekturasining umumiy standarti; asosiy plataning funksional bloklarga ajratilishini tartiblashtiradi. Standartning asosini PCI shinasi tashkil qiladi."
        ]
    },
    {
        "word": "Umumiy shlyuz interfeysi",
        "type": [],
        "definition": [
            "HTTP-server dasturlarini yaratish uchun mo‘ljallangan, NCSA tomonidan ishlab chiqilgan tarmoq standarti. Web-serverlarda ssenariylar va dasturlar orasida ma’lumotlar almashinishda, keyin web-sahifa yoki brauzerga ma’lumotlarni uzatishda qo‘llaniladi. CGI ssenariylari odatda, PERL tilida yoziladi va web-sahifaning dinamik mazmunini ishlab chiqadi (masalan, elektron tijoratda buyurtmalar savatini hosil qiladi)."
        ]
    },
    {
        "word": "UNIX operatsion tizimi",
        "type": [],
        "definition": [
            "Ko‘p foydalanuvchili ochiq operatsion tizim. Asosiy versiyalari Amerikaning AT&T, UNIX Systems Laboratories, Sun Soft, NeXTComputer firmalari, shuningdek, Stendford va Berkli universitetlarining kompyuter tizimlarini tadqiq qilish guruhi tomonidan ishlab chiqilgan. Tizim konseptsiyasining aniqligi, uning ko‘chirib bo‘lishliligi va ko‘lamliligi, o‘rnatish va qo‘llashning soddaligi, tarmoq komponentlarining operativ tizimga o‘rnatib bo‘lishlik, yuqori unumdorlik (tarmoq almashinish tezligi 1 Mbyte\/s ga yetadi) tizimning afzalliklariga kiradi. Tizim to‘xtashlarga chidamli."
        ]
    },
    {
        "word": "Unix Ware operatsion tizimi",
        "type": [],
        "definition": [
            "Grafik, 32 bitli operatsion tizim, UNIX ga asoslangan, Novell firmasi tomonidan ishlab chiqilgan. Bu tizimda UNIX, MS-DOS, Windows uchun mo‘ljallangan ilovalar bilan ishlash mumkin."
        ]
    },
    {
        "word": "Uzelni dinamik konfiguratsiyalash protokoli",
        "type": [],
        "definition": [
            "32-razryadli IP-adreslarning yetishmaslik muammosini yengillashtirish uchun ularning Internet dagi ish vaqtida IP- adreslarni lokal tarmoqning uzellariga (ishchi stansiyalariga) dinamik tayinlash uchun uzelni dinamik kongfiguratsiyalash protokoli. Uzellarga adreslarni o‘zlashtirish adreslarning markazlashtirilgan pulida amalga oshirilishi sababli, ularning noyobligi va nizoli adreslarning bo‘lmasligi kafolatlanadi."
        ]
    },
    {
        "word": "Uzel",
        "type": [],
        "definition": [
            "1 Tarmoqqa ulanish nuqtasi, tarmoqqa ulangan qurilma; kompyuter tarmog‘idagi yoki ma’lumotlar uzatish tarmog‘idagi bir xil protokoldan foydalanadigan ikkita tarmoqni bog‘laydigan kompyuterni o‘zida ifodalaydigan uzel. Ikkita o‘xshash tarmoqdagi ikki mos dasturning bog‘lanishini ta’minlaydi. Uzatiladigan paketlarda bo‘ladigan adresli axborotdan foydalanadi. Tarmoq uzellari marshrutizatorlar kabi, ko‘priklardan farqli ravishda, tarmoq darajasidagi qurilmalar hisoblanadi.\r\n 2 Iyerarxik strukturada: struktura elementi, masalan, «gipermatn uzeli».\r\n 3 Ikki komponent o‘rtasidagi bog‘lovchi nuqta.\r\n 4 Windows 2000\/XP operatsion tizimida: boshqarish konsoliga tatbiqan, har qanday boshqariladigan obyekt, topshiriq yoki tur: masalan, kompyuterlar, foydalanuvchilar, Web sahifalar."
        ]
    },
    {
        "word": "Universal ketma-ket shina",
        "type": [],
        "definition": [
            "1995 yili yettita yetakchi kompyuter va telekommunikatsiya firmalari (Compaq, IBM, Intel, NEC, Micrisoft, Digital, Northern Telecom) konsorsiumi tomonidan taklif etilgan, shaxsiy kompyuter va o‘rtacha tezlikli periferik qurilmalar o‘rtasida uncha qimmat bo‘lmagan shina orqali ma’lumotlar almashinish uchun belgilangan standart. Qurilmani ulash, kompyuter qayta yuklanishini, tizim qayta konfiguratsiyalanishini yoki interfeysli karta o‘rnatilishini talab qilmaydi. Qurilmani aniqlash va tegishli drayverni o‘rnatish kompyuterda avtomat ravishda odamning aralashuvisiz bajariladi."
        ]
    },
    {
        "word": "Universal resurs identifikatori",
        "type": [],
        "definition": [
            "Qandaydir resurs: hujjat, tasvir, fayl, xizmat, elektron pochta qutisini identifikatsiya qilish imkonini beradigan simvolli satr."
        ]
    },
    {
        "word": "Universal resurslar joyini aniqlagich",
        "type": [],
        "definition": [
            "Web brauzerning Internet tarmog‘idan resurs qidirishida ishlatiladigan URL-adres. Tim Berners-Li tomonidan kiritilgan. URL resurs, hujjat yoki uning qismining Internet dagi joylashgan o‘rnini ko‘rsatuvchi simvollarning standartlashtirilgan satrini ifodalaydi. U odatda protokolning tipini ko‘rsatish bilan boshlanadi (masalan, FTP:\/\/, agar hujjat FTP-serverda yoki http:\/\/ agar hujjat Web-uzelda bo‘lsa), keyin aniq axborot identifikatori keladi, masalan, server taalluqli bo‘lgan domen nomi, tashkilot nomi yoki shu serverdagi fayl nomining yo‘li. Suffiks tashkilotning turini ko‘rsatadi."
        ]
    },
    {
        "word": "Uzluksiz taʼminot qurilmasi",
        "type": [],
        "definition": [
            "Tarkibida akkumulyatorlar bo‘lgan va asosiy elektr ta’minot kuchlanishi tushib ketganda yoki sakrashlarida kompyuter va periferiyaning ta’minoti va himoyasini ta’minlaydigan, shuningdek, kuchlanish yo‘qolganda ma’lumotlarni avtomatik ravishda saqlash imkoniyatiga ega qurilma."
        ]
    },
    {
        "word": "Utilita",
        "type": [],
        "definition": [
            "Kompyuter va kompyuter dasturlariga texnik xizmat koʻrsatadigan xizmat dasturi. Utilita kompyuter tizimlarini sinovdan oʻtkazish, operatsion tizim yoki uning qismlarini testlash va qayta tiklash, buzilgan yoki yoʻqotilgan fayllarni qayta tiklash uchun xizmat qiladi."
        ]
    }
]