[
    {
        "word": "Vektor",
        "type": [],
        "definition": [
            "Tartib bo‘yicha raqamlangan elementlarning oxirgi ketma-ketligi. Bir o‘lchamli massiv. Elementlar turli xil: butun, simvolli bo‘lishi mumkin. Ba’zi dasturlash tillarida (Pascal, C) vektorda barcha elementlar bir turda bo‘lishi kerak, boshqa tillarda (FOX) vektorda turli xil elementlar bo‘lishi mumkin."
        ]
    },
    {
        "word": "Vektorli grafika",
        "type": [],
        "definition": [
            "Tasvirni, har qanday usul bilan, shu jumladan, grafik komandalar bilan tavsiflangan grafik elementlar yig‘indisi sifatida taqdim etish usuli. Ko‘pincha, ikkilik koddagi fayllar sifatida taqdim qilinadi."
        ]
    },
    {
        "word": "Versiya",
        "type": [],
        "definition": [
            "Dasturiy mahsulotning, ba’zi o‘zgartirishlar kiritilgan varianti. Turli versiyalar quyidagicha tarzda indekslanadi: jiddiy o‘zgartirishlar nuqtagacha raqam bilan oraliq variantlar nuqtadan keyingi raqamlar bilan ko‘rsatiladi. Masalan, MS-DOS ning versiyalari bor: MS-DOS 6.2 va MS-DOS 6.22. Oxirgisi chiqarilgan 6.22 DOS versiya (dos-olti-nuqta-ikki-ikki deb o‘qiladi) 6.2 versiyadan birmuncha farq qilishligini bildiradi."
        ]
    },
    {
        "word": "Videoxotira",
        "type": [],
        "definition": [
            "Displeyda sifatli tasvirni ta’minlash uchun mo‘ljallangan qo‘shimcha xotira. Videoadapterning qismi hisoblanadi, bir necha megabaytgacha hajmga ega. Videoxotirada bir yoki bir nechta ekranning tasviri shakllanadi, displeyga uzatiladi. Ba’zi kompyuterlarda videoxotira operativ xotiradan ajratiladi."
        ]
    },
    {
        "word": "Vizual dasturlash",
        "type": [],
        "definition": [
            "Ko‘rgazmali vositalar yordamida ilovalar yaratish ko‘zda tutiladigan dasturlash. Dasturchi dastur matnini yaratmaydi, balki natijada nima bo‘lishini ko‘rsatadi. Dastur matni vizual prototip yordamida avtomatik tarzda yuzaga keladi. Vizual dasturlash obyektga yo‘naltirilgan dasturlashga va OLE texnologiyalarga yoki unga o‘xshash texnologiyalarga asoslanadi. Vizual dasturlash elementlaridan Visual C ++ dan tortib DELPHI gacha bo‘lgan ilovalarni yaratish vositalarida va ma’lum bir dasturlash tillarida keng foydalaniladi."
        ]
    },
    {
        "word": "Vinchester",
        "type": [],
        "definition": [
            "Ma’lumotlarni saqlash qurilmasi, qattiq magnit diskdagi to‘plagichning o‘zi IBM firmasi tomonidan 1973 yilda ishlab chiqilgan. Diskning xarakteristikalari quyidagicha edi: sig‘imi 30 Mbyte, foydalanish vaqti 30 ms. Boshqa versiyaga ko‘ra, to‘plagich har biri 30 Mbyte bo‘lgan ikkita diskdan iborat bo‘lgan."
        ]
    },
    {
        "word": "Virtual mashina",
        "type": [],
        "definition": [
            "Kompyuterda dasturiy ta’minot yaratadigan, fizik qurilma modellashtiriladigan muhit. Windows da virtual mashinalar, har biri o‘zining xususiy xizmatlariga, jumladan, xotira resurslariga, fayl tizimi serverlariga, qurilmalar drayverlariga, periferiyadan foydalanish huquqiga ega bo‘lgan alohida kompyuterlarni modellashtiradi. Windows virtual mashinalarning ikkita asosiy turini ichiga oladi: Windows ilovalarini ishga tushirish uchun foydalaniladigan System VM va Windows da bajariladigan MS-DOS ning har bir ilovasi uchun yaratiladigan DOS VM."
        ]
    },
    {
        "word": "Virtual xotira",
        "type": [],
        "definition": [
            "Kompyuterning qattiq diskdagi xotira bilan bo‘lgani kabi ishlash metodi. Katta hajmdagi ma’lumotlarni qayta ishlash imkonini beradi va ko‘p vazifali ishlash rejimini ta’minlaydi."
        ]
    },
    {
        "word": "Virtual borliq",
        "type": [],
        "definition": [
            "Zamonaviy texnik va dasturiy vositalar bilan real dunyoni imitatsiya qilish."
        ]
    },
    {
        "word": "Virtual disk",
        "type": [],
        "definition": [
            "Operativ xotira qismidan dasturiy tarzda yaratilgan, psevdodiskli to‘plagich. Operatsion tizim u bilan, haqiqatda mavjud bo‘lgan disk bilan ishlagandek ishlaydi. Ikki holatda, moddiy mavjud bo‘lgan diskni vaqtinchalik takrorlash uchun va ma’lumotlardan foydalanishni tezlashtirish maqsadida foydalaniladi, chunki operativ xotira diskli xotiraga nisbatan ancha tez. Ko‘pincha elektron disk deb ataladi."
        ]
    },
    {
        "word": "Voqea",
        "type": [],
        "definition": [
            "Foydalanuvchining harakati yoki operatsion tizim yuzaga keltiradigan xabar, masalan, tugmachani bosish, oynani yopish. Har qanday voqea obyekt bilan, uning xususiyatlari va metodlari bilan bog‘liq. Murakkab tizimlarni loyihalash va obyektga yo‘naltirilgan tahlil tushunchasi."
        ]
    },
    {
        "word": "Voqea - boshqariladigan dasturlash",
        "type": [],
        "definition": [
            "Dastur turli voqealarga (foydalanuvchining harakatlariga) qanday javob berishi tavsiflanadigan dasturlash. Obyektga yo‘naltirilgan dasturlashning bir turi."
        ]
    },
    {
        "word": "VMware ESX Server",
        "type": [],
        "definition": [
            "VMware kompaniyasi tomonidan VMware vSphere (oldin VMware Infrastructure) komponenti sifatida taqdim etiladigan, faoliyat darajasini virtuallashtirish uchun belgilangan dasturiy mahsulot. ESX 5.0 versiyadan boshlab ESXi mahsuloti bilan almashtirilgan. ESX va ESXi o‘rnatilgan gipervizorlar hisoblanadi, o‘rnatish paytida mashinada belgilangan operatsion tizim bo‘lishligi talab qilinmaydi. ESX\/ESXi fizik kompyuterni virtual mashinalar deb ataladigan mantiqiy bo‘limlarga ajratish imkonini beradi. O‘z ichiga virtual resurslarni boshqarish vositalarini oladi. ESXi o‘rnatilishi uchun kamida 2 Gbite operativ xotira talab qilinadi."
        ]
    },
    {
        "word": "Vaqtni taqsimlash",
        "type": [],
        "definition": [
            "Kompyuterning bitta markaziy protsessor bilan ishlash rejimi, bunda protsessor muntazam ravishda bir vazifani hal qilishdan boshqasiga o‘tib turadi. Vaqtning taqsimlanishini operatsion tizim amalga oshiradi. Bu rejimdan ko‘p dasturli «bir vaqtda» ishlash uchun foydalaniladi. Protsessor barcha ishlarni izchil, lekin juda tez bajaradi. Shuning uchun, har bir vazifaga juda qisqa muddatga protsessor resurslari ajratilsa, foydalanuvchiga ishlar parallel bajarilayotgandek tuyuladi. Vaqtni taqsimlash rejimi UNIX va Windows tizimlarida yaxshi amalga oshirilgan. Masalan, vaqtni taqsimlash rejimida bir vaqtda matn redaktori bilan ishlash, qandaydir faylni bosishga chiqarish va ma’lumotlarni tarmoq orqali qabul qilish mumkin."
        ]
    },
    {
        "word": "Virtual voqelikni modellashtiradigan til",
        "type": [],
        "definition": [
            "HTML tilining uch o‘lchamli analogi hisoblanadigan til; WWW texnologiyasida ilovalar yaratish uchun foydalaniladi. Silicon Graphics kompaniyasi tomonidan ishlab chiqilgan."
        ]
    }
]