[
    {
        "word": "Web ‒ brauzer",
        "type": [],
        "definition": [
            "Web sahifalarni ko‘rish va tasvirlash uchun dastur. Gipermatnli hujjatlarni ko‘rish va Web resurslararo harakatlanish imkonini beradi. Web brauzer tarmoqdagi server yoki boshqa kompyuterlardan o‘zida gipermatn, audio va video fayllarni saqlovchi Web hujjatlarni so‘rashi va lokal kompyuterda ko‘rsatishi mumkin. Bugungi kunda eng ko‘p qo‘llaniladigan Web brauzerlar Microsoft Internet Explorer va Mozilla Firefox hisoblanadi."
        ]
    },
    {
        "word": "Web-server",
        "type": [],
        "definition": [
            "Internet va Intranet tarmoqlaridan foydalanuvchilarga WWW sahifalaridan va xizmatlaridan foydalanish imkonini beradigan kompyuter. Kontekstga bog‘liq holda termin apparat qismini ham, dastur qismini ham ko‘zda tutishi mumkin."
        ]
    },
    {
        "word": "WHDI",
        "type": [],
        "definition": [
            "Videooqimni simsiz uzatish raqamli standarti. Asosiy ishlab chiquvchi va chiplarni yetkazib beruvchi Isroilning Amimon firmasidir. Translyatsiya 5 HHz chastotada, 3 Gbyte\/s tezlikda olib boriladi. Standartning asosiy xususiyati – videoni kodlashning yagona texnologiyasi «video-modem» dir, u tufayli yuqori darajada xalaqitdan himoyalanganlik, qabul qilish va uzatishda xatolardan xoli bo‘lishlik, binobarin, uzatiladigan tasvirning yuqori sifati ta’minlanadi."
        ]
    },
    {
        "word": "Wi-Fi",
        "type": [],
        "definition": [
            "Simsiz qurilmalar uchun IEEE 802.11b standartga mos keladigan protokol va uskunaning umumiy nomi. Wi-Fi simsiz lokal tarmoqlar yartaish va Internet ga yuqori tezlikda simsiz ulanishlarni tashkillashtirish uchun mo‘ljallangan."
        ]
    },
    {
        "word": "Win 32API",
        "type": [],
        "definition": [
            "Windows 95\/NT operatsion tizimlarida ishlaydigan 32 razryadli ilovalarni yaratish uchun belgilangan amaliy dasturlash interfeysi. Ikki mingdan ortiq funksiya, makros, xabar, oldindan belgilangan konstantadan iborat to‘plamni o‘zida ifodalaydi. Dinamik komponovka bibliotekalari ko‘rinishida rasmiylashtirilgan."
        ]
    },
    {
        "word": "Windows",
        "type": [],
        "definition": [
            "Microsoft korporatsiyasining ommaviy operatsion tizimlari va grafik qobiqlari turkumi. Fayllar bilan bajariladigan operatsiyalarda foydalaniladigan grafik interfeys – operatsion muhitni o‘zida ifodalaydi. Zamonaviy Windows tizimi belgilangan ehtiyojlarga ko‘ra, bir vaqtda ko‘rish va foydalanish mumkin bo‘lgan turli qog‘ozlar va ko‘plab papkalar joylashgan ish joyi ko‘rinishida tasavvur qilinadi. Bu tizimning birinchi versiyasi Windows 1.0 bozorga 1983 yilning noyabrida chiqarilgan."
        ]
    },
    {
        "word": "WINTEX-platforma",
        "type": [],
        "definition": [
            "Intel firmasining protsessoriga va Windows operatsion tizimiga asoslangan kompyuter platformasi."
        ]
    },
    {
        "word": "Word",
        "type": [],
        "definition": [
            "MS Office dasturiy mahsulotga ilova sifatida kiradigan matn redaktori. Windows operatsion tizimida ishlaydigan eng ommaviy matn protsessorlaridan biri."
        ]
    },
    {
        "word": "WYSIWYG printsipi",
        "type": [],
        "definition": [
            "Displey ekranida teriladigan bilan printer bosadiganning to‘la mos kelish prinsipi. Noshirlik tizimlarida va matn redaktorlarida foydalaniladi. Inglizcha WYSIWYG – What You See Is What You Get – «nimani ko‘rayotgan bo‘lsangiz, o‘sha narsani olasiz»."
        ]
    }
]