[
    {
        "word": "Xavfsiz kompyuter",
        "type": [],
        "definition": [
            "Ishlash paytida odamlar salomatligiga xavf tug‘dirmaydigan kompyuter. Asosiy zararli ta’sirni elektron-nurli trubka bazasidagi monitor, kompyuter vujudga keltiradigan elektromagnit maydonlar ko‘rsatadi. Kompyuterning zararli ta’sirini cheklash maqsadida, MPR I standarti (Shvetsiya) qabul qilingan, 1990 yilda yanada qat’iyroq MPR II standarti qabul qilindi. Bu standartlar ko‘plab mamlakatlarda qabul qilingan. Ushbu standartlarni qanoatlantiradigan monitorlar LR (Low Radiation – past nurlanish) markasiga ega. Qoidalarga ko‘ra, katta yoshdagi kompyuterdan foydalanuvchining uzluksiz ishlash davomiyligiga 2 soatdan oshmasligi bolani – yoshga bog‘liq ravishda, 10 minutdan 20 minutgacha bo‘lishi kerak. Eng kam tanaffus 15 minut qilib belgilangan. Foydalanuvchi ko‘zidan monitor ekranigacha bo‘lgan masofa kamida 50 sm, optimal 60-70 sm bo‘lishi kerak. Monitor ekranidan qo‘shni qator monitori orqa devorigacha bo‘lgan masofa kamida 2 m, yon devorlar orasidagi masofa esa, kamida 1,2 m bo‘lishi kerak. Katta yoshdagi bitta foydalanuvchiga to‘g‘ri keladigan maydon 6 m2 dan kam bo‘lmasligi kerak."
        ]
    },
    {
        "word": "Xulosa chiqarish",
        "type": [],
        "definition": [
            "Mavjud faktlar va qoidalar asosida natija olish jarayoni. Sun’iy intellekt va mantiqiy xulosa tizimlarida foydalaniladi."
        ]
    },
    {
        "word": "Xotira kartasi",
        "type": [],
        "definition": [
            "Operativ yoki doimiy xotiraning taqsimlanish sxemasi."
        ]
    },
    {
        "word": "Xizmatga oid soʻz",
        "type": [],
        "definition": [
            "Dasturlash tillarida yoki boshqa tizimlarda maxsus qiymatga ega bo‘lgan so‘z (\/). Xizmatga oid so‘zdan vazifasiga ko‘ra foydalanilmaslikka ruxsat etilmaydi."
        ]
    },
    {
        "word": "Xabar",
        "type": [],
        "definition": [
            "«Xabarlar navbati» tizimi ishlayotgan kompyuterlar o‘rtasida axborot almashinish birligi. Xabar nimani o‘z ichiga olishini (ikkilik yoki matnli ma’lumotlar) jo‘natayotgan dastur aniqlaydi. Barcha xabarlar, ularning holati haqidagilar ham kompyuterlar navbatida joylashadi."
        ]
    },
    {
        "word": "XENIX operatsion tizimi",
        "type": [],
        "definition": [
            "UNIX operatsion tizimining shaxsiy kompyuterlar uchun mo‘ljallangan bir foydalanuvchili versiyasi. Microsoft korporatsiyasi tomonidan ishlab chiqilgan. 1980 yilning avgustida chiqarilgan."
        ]
    },
    {
        "word": "Xotiradan toʻgʻridan-toʻgʻri foydalanish",
        "type": [],
        "definition": [
            "Protsessordan foydalanmasdan (uni chetlab o‘tib) umumiy shina bo‘yicha operativ xotirlovchi qurilma va periferik qurilmalarga (masalan, qattiq diskka) ma’lumotlarni yuqori tezlikda uzatish metodi. Bu vaqtda protsessor barcha shinalardan uziladi."
        ]
    },
    {
        "word": "Xotirani taqsimlash",
        "type": [],
        "definition": [
            "Xotira resurslarini ayrim vazifalarni hal qilish uchun biriktirish."
        ]
    },
    {
        "word": "Xizmatlari integratsiyalashgan raqamli tarmoq",
        "type": [],
        "definition": [
            "Kommutatsiyalanadigan telefon liniyasi bo‘ylab o‘tadigan raqamli aloqa xalqaro standarti, kompyuter va multimedia (ovoz, video) trafikini uzatishda foydalaniladi. Odatda, foydalanuvchining ISDN liniyasi ikkita 64 kbit\/s tezlikli kanal orqali ma’lumotlar uzatilishini ta’minlaydi, 16 kbit\/s tezlikli kanaldan boshqaruvchi axborotni uzatish uchun foydalaniladi. Lokal tarmoqlar ISDN kanalga marshrutizator orqali, alohida foydalanuvchilar esa, ISDN modem orqali ulanadi. Tashkilotlar uchun, 23×64 kbit\/s ISDN kanalni – boshqaruvchi kanalni ulash imkoniyati mavjud."
        ]
    },
    {
        "word": "Xit, mos kelish",
        "type": [],
        "definition": [
            "1 Sahifani qayta yuklash mustasno qilinganda, foydalanuvchining Web-sahifaga murojaat qilishi.\r\n 2 Fayl ichidagini tiklashda va profilaktik tekshirishda – asosiy yozish va joriy yozish oʻrtasida muvofiqlikni topish."
        ]
    },
    {
        "word": "Xost-kompyuter",
        "type": [],
        "definition": [
            "Iyerarxik kompyuter tarmog‘i cho‘qqisidagi yoki quyi tarmoqdagi kompyuter. Ba’zan, «bosh kompyuter» atamasidan foydalaniladi."
        ]
    },
    {
        "word": "Xeshlash",
        "type": [],
        "definition": [
            "1 Xesh-funksiya qiymatlarini hisoblash jarayoni.\r\n 2 Ba’zi bir matn bo‘laklarida dastlabki massivning o‘rnini bosishga xizmat qiladigan ixtiyoriy o‘lchamdagi ma’lumotlar massivini belgilangan o‘lchamdagi ma’lumotlar blokiga almashtirish."
        ]
    }
]