[
    {
        "word": "Yoʻlka",
        "type": [],
        "definition": [
            "Ma’lumotlarning konsentrik aylana ko‘rinishidagi disk xotirasida o‘rni va joylashishi. Magnit yozish usulida ma’lumotlar bu konsentrik aylana bo‘ylab ketma-ket joylashadi. Kompakt - disklarda ma’lumotlar bitta spiralsimon yo‘lka bo‘ylab yoziladi. Ba’zan trek deb ataladi"
        ]
    },
    {
        "word": "Yuklash",
        "type": [],
        "definition": [
            "Tizimni ishga tayyorlash jarayoni; dasturni tashqi xotiradan operativ xotiraga yuborishdan, qo‘shimcha fayllarni ulagan holda, dasturning bajarilishidan iborat. Yuklash vaqti tizimning hajmiga va kompyuterning imkoniyatlariga bog‘liq."
        ]
    },
    {
        "word": "Yuklash sektori",
        "type": [],
        "definition": [
            "Qattiq diskdagi, disketdagi yoki axborot saqlashning boshqa diskli qurilmasidagi alohida sektor. Disketa uchun bu, birinchi fizik sektor, qattiq disk uchun – har bir bo‘lim uchun birinchi fizik sektor. Kompyuterni disketadan yuklash jarayonida, u xotiraga POST dasturi bilan yuklanadi, unga long jump komandasini boshqarish topshiriladi."
        ]
    },
    {
        "word": "Yulduz",
        "type": [],
        "definition": [
            "Kompyuterlarni tarmoqqa birlashtirish usuli: bitta kompyuter ajratiladi va u asosiy (bosh) kompyuter ataladi, qolgan barcha kompyuterlar u bilan bevosita ulanadi. Ma’lumotlar bitta periferik kompyuterdan boshqasiga faqat bosh kompyuter orqali uzatilishi mumkin. Bosh kompyuter ishlamay qolsa, butun tarmoq ishlash qobiliyatini yo‘qotadi."
        ]
    },
    {
        "word": "Yangi texnologiya fayl tizimi",
        "type": [],
        "definition": [
            "Microsoft Windows NT operatsion tizimlar oilasi uchun belgilangan standart fayl tizimi."
        ]
    },
    {
        "word": "Yoʻnaltirilgan graf",
        "type": [],
        "definition": [
            "Har bir qirrasi yo‘nalishga ega bo‘lgan graf."
        ]
    },
    {
        "word": "Yoʻl koʻrsatish",
        "type": [],
        "definition": [
            "Kompyuter yoki tizimning, berilgan onda bajariladigan dastur foydalanuvchidan nima kutishligi to‘g‘risida foydalanuvchiga yuboradigan xabari. Xabar qisqa va tushunarli bo‘lishi kerak, ba’zida u shartli bo‘lishi mumkin."
        ]
    },
    {
        "word": "Yordam",
        "type": [],
        "definition": [
            "Har qanday kompyuter tizimining funksiyasi, foydalanuvchiga ma’lum bir tizim to‘g‘risida zarur va qo‘shimcha ma’lumotlar olish imkonini beradi. Ko‘pgina tizimlarda kontekstli yordam mavjud, bunda tizim mavjud vaziyatda yuzaga kelgan muayyan savolga javob berishga harakat qiladi. Hozirgi vaqtda dastur (tizim) bo‘yicha barcha zarur hujjatlarni yordam ko‘rinishida rasmiylashtirish tendensiyasi yuzaga keldi. Yordam, odatda asosiy dasturdan murojaat qilinadigan fayl ko‘rinishida taqdim qilinadi."
        ]
    },
    {
        "word": "Yoʻl",
        "type": [],
        "definition": [
            "Diskda fayl, katalog yoki papkaning joylashgan o‘rnini belgilaydigan satrli ifoda."
        ]
    },
    {
        "word": "Yunikod",
        "type": [],
        "definition": [
            "Barcha milliy alifbolar simvollarining ISO 10646 kodlashtirish standarti. Bunda har bir simvol uchun 16-bitli (ikki baytli) yagona kombinatsiyadan foydalaniladi."
        ]
    },
    {
        "word": "Yadro",
        "type": [],
        "definition": [
            "Operatsion tizimning, ilovalarga protsessor vaqti, xotira, tashqi apparat ta’minoti, axborotni kiritish va chiqarish tashqi qurilmasi kabi kompyuter resurslaridan foydalanishni ta’minlaydigan markaziy qismi. Yadro, shuningdek, fayl tizimi va tarmoq protokollari servislarini ham ifodalaydi."
        ]
    },
    {
        "word": "Yacheykasimon topologiya-",
        "type": [],
        "definition": [
            "Kompyuterlarni tarmoqqa birlashtirish sxemasi, bunda fizik aloqa liniyalari yonma-yon turgan barcha kompyuterlar bilan o‘rnatilgan bo‘ladi. Bu topologiyaning afzalligi, uning o‘ta yuklanishlarga chidamliligida."
        ]
    },
    {
        "word": "Yashirish",
        "type": [],
        "definition": [
            "Foydalanuvchi hali oshkora boshqa qiymatlarni bermagan holatda, tizim ishlaydigan alohida parametrlarning aniq qiymatlarini oldindan belgilash prinsipi. Yashirishdan tez-tez foydalaniladi, chunki standart harakatlarda ishlashni osonlashtiradi."
        ]
    }
]