[
    {
        "word": "ACID",
        "type": [],
        "definition": [
            "Stands for \"Atomicity, Consistency, Isolation, Durability.\"  The ACID acronym defines four characteristics a database must have to ensure data integrity.  Specifically, these qualities apply to database operations that write data to the database.  Examples include inserting, updating, and removing records.\nThe four ACID elements are described below:\n1. Atomicity\nAtomicity guarantees each transaction is an \"all-or-nothing\" event.  In other words, it succeeds or fails completely.  Atomic operations prevent data corruption by disallowing partial transactions.  If an operation cannot be completed, it is \"rolled back\" to the previous state, as if it never happened.\nSome database management systems may require a specific configuration to be ACID-compliant.  For example, MySQL meets ACID standards, but only when using tables that support atomic operations.  InnoDB tables are ACID-compliant since they support transactions, including COMMIT and ROLLBACK statements.  MyISAM tables, which do not support transactions, are not ACID-compliant.\n2. Consistency\nConsistency is the assurance that only valid data is written to a database.  For example, a database will not accept invalid transactions or unrecognizable data.  Additionally, it may use a \"doublewrite buffer\" that temporarily stores new transactions.  If the database or host system crashes unexpectedly, the data can be restored from the buffer.\n3. Isolation\nIsolation ensures each transaction is handled individually.  Some databases read and write data several times per second, which may require concurrent transactions.  Even when transactions take place at the same time, they can still be isolated from each other.  For example, if one operation fails, it will not affect others taking place at the same time.  Isolation is also essential for database security since it prevents the data in one transaction from being visible to another.\n4. Durability\nDurability guarantees data will be stored once a transaction has been processed or \"committed\" to the database.  It requires that data is written to non-volatile memory so that transactions are not lost if an application crashes or a power outage occurs.\nWhile database software can help ensure database durability, hardware is also important.  For example, a RAID storage configuration can provide redundancy if a storage device fails.  A UPS battery backup can prevent data loss by maintaining electrical power if the primary power source is unavailable.\n\nNOTE: \"Acid\" (lowercase) is a web browser test that checks browser support for specific HTML tags and CSS rules.  The most recent test, Acid3, was produced by the Web Standards Project group in 2008."
        ]
    },
    {
        "word": "ACL",
        "type": [],
        "definition": [
            "Stands for \"Access Control List.\"  An ACL is a list of user permissions for a file, folder, or other object.  It defines what users and groups can access the object and what operations they can perform.  These operations typically include read, write, and execute.  For example, if an ACL specifies read-only access for a specific user of a file, that user will be able open the file, but cannot write to it or run the file.\nAccess control lists provide a straightforward method of managing file and folder permissions.  They are used by most operating systems, including Windows, Mac, and Unix systems.  While ACLs are typically hidden from the user, they can often be modified using a graphical interface.  For example, in Mac OS X 10.5, ACL settings can be edited by selecting a file or folder and choosing \"Get Info.\"  The access control settings can be modified within the \"Sharing and Permissions\" section of the window.  On Unix systems, ACLs can be edited using the chmod() command."
        ]
    },
    {
        "word": "ADC",
        "type": [],
        "definition": [
            "Stands for \"Analog-to-Digital Converter.\"  Since computers only process digital information, they require digital input.  Therefore, if an analog input is sent to a computer, an analog-to-digital converter (ADC) is required.  This device can take an analog signal, such as an electrical current, and digitize it into a binary format that the computer can understand.\nA common use for an ADC is to convert analog video to a digital format.  For example, video recorded on 8mm film or a VHS tape is stored in an analog format.  In order to transfer the video to a computer, the video must be converted to a digital format.  This can be done using an ADC video conversion box, which typically has composite video inputs and a Firewire output.  Some digital camcorders that have analog inputs can also be used to convert video from analog to digital.\nADCs may also be used to convert analog audio streams.  For example, if you want to record sounds from a microphone, the audio must be converted from the microphone's analog signal into a digital signal that the computer can understand.  This is why all sound cards that have an analog audio input also require an ADC that converts the incoming audio signal to a digital format.  The accuracy of the audio conversion depends on the sampling rate used in the conversion process.  Higher sampling rates provide a better estimation of the analog signal, and therefore produce a higher-quality sound.\nWhile ADCs convert analog inputs into a digital format that computers can recognize, sometimes a computer must output an analog signal.  For this type of conversion, a digital-to-analog converter (DAC) is used.\nNOTE: ADC can also stand for \"Apple Display Connector,\" which was a proprietary video connector developed by Apple.  It combined DVI, USB, and AC power into a single cable.  Apple stopped producing computers with ADC ports in 2004 in favor of the standard DVI connection."
        ]
    },
    {
        "word": "ADF",
        "type": [],
        "definition": [
            "Stands for \"Automatic Document Feeder.\"  An ADF is used in copiers and scanners to feed pages into the machine.  It allows multiple pages to be copied or scanned at one time without the need to place each individual page in the copier or scanner.\nA flatbed scanner, on the other hand, requires each page to be individually placed on the scanning surface.  While this is convenient for single pages, copying 80 pages would require a lot of manual page-loading!  Some copy machines include both an automatic document feeder and a flatbed scanning surface so that either method can be used."
        ]
    },
    {
        "word": "ADSL",
        "type": [],
        "definition": [
            "Stands for \"Asymmetric Digital Subscriber Line.\"  ADSL is a type of DSL, which is a method of transferring data over copper telephone lines.  While symmetrical DSL (SDSL) uploads and downloads data at the same speed, ADSL has different maximum data transfer rates for uploading and downloading data.\nFor example, an ADSL connection may allow download rates of 1.5Mbps, while upload speeds may only reach 256Kbps.  Since most users download much more data than they upload, this difference usually does not make a noticeable impact on Internet access speeds.  However, for Web servers or other computers that send a lot of data upstream, ADSL would be an inefficient choice."
        ]
    },
    {
        "word": "AFP",
        "type": [],
        "definition": [
            "Stands for \"Apple Filing Protocol.\"  AFP is a protocol developed by Apple for sharing files over a network.  It was used in early versions of Apple's Macintosh operating systems and is also supported in macOS 10.  However, AFP has mostly been replaced by the standard SMB (Server Message Block) protocol.\nApple introduced AFP (originally the \"AppleTalk Filing Protocol\") with Macintosh System 6 in the late 1980s.  It was part of the AppleTalk networking suite, which allowed Macs to communicate over a local network.  AFP was also the foundational protocol used by AppleShare, a file server application.  For several decades, AFP was the primary protocol used to share files between Macs.\nYou can connect to an AFP server from the macOS Finder by selecting Go &rarr; Connect to Server...  Then choose or manually type in the server's address beginning with afp:\/\/\nIn 2001, Apple released Mac OS X 10.0 and updated AFP to version 3.0 with significant changes.  AFP 3 was the first version to support Unix privileges, files over 2 gigabytes, and UTF-8 filenames.  The last update to the protocol was AFP 3.4, introduced with Mac OS 10.8 \"Mountain Lion.\"  Later versions of macOS have prioritized SMB as the primary protocol for file sharing.\nNOTE: While modern versions of macOS and macOS Server still support AFP, the protocol does not work with storage devices formatted using the APFS file system."
        ]
    },
    {
        "word": "AGP",
        "type": [],
        "definition": [
            "Stands for \"Accelerated Graphics Port.\"  AGP is a type of expansion slot designed specifically for graphics cards.  It was developed in 1996 as an alternative to the PCI standard.  Since the AGP interface provides a dedicated bus for graphics data, AGP cards are able to render graphics faster than comparable PCI graphics cards.\nLike PCI slots, AGP slots are built into a computer's motherboard.  They have a similar form factor to PCI slots, but can only be used for graphics cards.  Additionally, several AGP specifications exist, including AGP 1.0, 2.0, and 3.0, which each use a different voltage.  Therefore, AGP cards must be compatible with the specification of the AGP slot they are installed in.\nSince AGP cards require an expansion slot, they can only be used in desktop computers.  While AGP was popular for about a decade, the technology has been superseded by PCI Express, which was introduced in 2004.  For a few years, many desktop computers included both AGP and PCI Express slots, but eventually AGP slots were removed completely.  Therefore, most desktop computers manufactured after 2006 do not include an AGP slot."
        ]
    },
    {
        "word": "AIFF",
        "type": [],
        "definition": [
            "Stands for \"Audio Interchange File Format.\"  AIFF is a file format designed to store audio data.  It was developed by Apple Computer, but is based on Electronic Arts' IFF (Interchange File Format), a container format originally used on Amiga systems.\nA standard AIFF file contains 2 channels of uncompressed stereo audio with a sample size of 16 bits, recorded at a sampling rate of 44.1 kilohertz.  This is also known as \"CD-quality audio,\" since CDs use the same audio specifications.  AIFF audio takes up just over 10MB per minute of audio, which means a 4 minute song saved as an AIFF will require just over 40MB of disk space.  This is nearly identical to a .WAV file (which uses the same sample size and sampling rate as an AIFF file.  However, it is about ten times the size of a similar MP3 file recorded at 128 kbps, or five times the size of an MP3 file recorded at 256 kbps.\nSince compressed and uncompressed audio files sound nearly the same, most digital audio distributed over the Internet is saved in a compressed format, such as an .MP3 or .M4A file.  This makes downloading audio from websites or the iTunes Store much faster and more efficient.  However, AIFF files are still commonly used for audio recording, since it is important to save the original audio data in an uncompressed format.  By working with uncompressed AIFF files, audio engineers can ensure that the sound quality is maintained throughout the mixing and mastering process.  Once the final version of a song or other audio project is saved, it can then be exported in a compressed format.\nNOTE: While the standard AIFF format does not support compressed audio data, Apple developed a variation of the AIFF format, called AIFF-C, which supports audio compression.  This format is also based on the original IFF format, but includes extra space in the file structure to define the type of the compression.  Therefore, the AIFF-C format can store audio generated from multiple compression algorithms.\nFile extensions: .AIF, .AIFF, .AIFC"
        ]
    },
    {
        "word": "AIX",
        "type": [],
        "definition": [
            "Stands for \"Advanced Interactive Executive,\" though some Linux fans have been known to refer to it as \"Ain't UNIX.\"  AIX is an operating system developed by IBM and is in fact Unix-based.  It is typically used for enterprise servers and comes with a robust set of security options such as Kerberos V5 network authentication and dynamic secure tunnel authentication.  AIX allows the system administrator to divide memory, CPU, and disk access between various jobs.  The system supports IBM's 64-bit POWER processor and is backwards-compatible with 32-bit applications.  It also runs most Linux applications (after recompiling them) and has full support for Java 2.  If all that jargon makes no sense to you, relax -- AIX is not your typical consumer operating system.  It is mainly used for servers in large businesses where IT geeks get to work with it."
        ]
    },
    {
        "word": "ALU",
        "type": [],
        "definition": [
            "Stands for \"Arithmetic Logic Unit.\"  An ALU is an integrated circuit within a CPU or GPU that performs arithmetic and logic operations.  Arithmetic instructions include addition, subtraction, and shifting operations, while logic instructions include boolean comparisons, such as AND, OR, XOR, and NOT operations.\nALUs are designed to perform integer calculations.  Therefore, besides adding and subtracting numbers, ALUs often handle the multiplication of two integers, since the result is also an integer.  However, ALUs typically do not perform division operations, since the result may be a fraction, or a \"floating point\" number.  Instead, division operations are usually handled by the floating-point unit (FPU), which also performs other non-integer calculations.\nWhile the ALU is a fundamental component of all processors, the design and function of an ALU may vary between different processor models.  For example, some ALUs only perform integer calculations, while others are designed to handle floating point operations as well.  Some processors contain a single ALU, while others include several arithmetic logic units that work together to perform calculations.  Regardless of the way an ALU is designed, its primary job is to handle integer operations.  Therefore, a computer's integer performance is tied directly to the processing speed of the ALU."
        ]
    },
    {
        "word": "ANR",
        "type": [],
        "definition": [
            "Stands for \"Application Not Responding.\"  ANR is an abbreviation that describes an unresponsive Android app.  When an app is running on an Android device and stops responding, an \"ANR\" event is triggered.  Two conditions may cause an ANR error on an Android device:\n\nAn active app does not respond to an input event within 5 seconds.\nThe BroadcastReceiver class does not finish executing after a long period of time.\n\nIf an ANR error happens on your Android device, a dialog box will appear on the screen.  The message will inform you the application is not responding and will ask if you want to close the app. You have two options: Wait or OK.  Choosing \"Wait\" will allow you to keep waiting if you want to give the app more time.  Choosing \"OK\" will close the app and you may lose unsaved activity.\nANRs are different than crashes.  A crash causes a program to quit unexpectedly.  An ANR causes a program to \"hang\" in an unresponsive state for a few seconds, but it may recover.\nANR errors happen for many different reasons.  Some are developer-related, such as a poorly written function that loops more times than necessary.  Others are device-related, meaning the hardware cannot keep up with the demands of the app.  For example, if an app is rendering a large document, it may take several seconds to load the data and render the image on the screen.  This could produce an ANR message, though the process might complete a few seconds later.\nDevelopers\nBecause ANRs create a poor user experience, developers aim to avoid them or at least reduce the number of occurrences as much as possible.  The Android operating system records ANRs and the corresponding activities to help developers debug their apps.  If an app is distributed via Google Play, the ANR data is automatically sent to Google.  Developers can review the ANR data in the Android Vitals section of the Developer Console.\nNOTE: No personal data is transmitted with ANR data.  Only the app version, Android version, device type, and activity data (such as the current process) are recorded."
        ]
    },
    {
        "word": "ANSI",
        "type": [],
        "definition": [
            "Stands for \"American National Standards Institute.\"  ANSI is a U.S.-based non-profit organization that works to develop and promote standards in the United States and around the world.  By standardizing new products and technologies, ANSI both strengthens the United States' position in the global marketplace and helps ensure product integrity and safety.\nANSI was originally called the \"American Engineering Standards Committee\" (AESC), which was formed in 1918.  The AESC worked with the American Institute of Electrical Engineers (now the IEEE) and several other organizations to develop engineering standards.  In 1928, AESC was reorganized and renamed the \"American Standards Association\" (ASA).  The ASA began to develop partnerships with global organizations, such as the ISO and helped promote U.S. standards internationally.  In 1969, the ASA was renamed to ANSI.  For the past several decades, ANSI has continued to promote both national and international standards.\nBy standardizing new technologies, ANSI helps both corporations and government agencies create compatible products and services.  For example, when ANSI standardizes a specific type of hardware port, computer manufacturers can build machines with the standardized port and know it will be compatible with third-party devices.  When ANSI standardizes a file format, software developers can support the format in their programs, since information about the format is publicly available.\nWhen a new standard is accredited by ANSI, it means that the standard has met the organization's requirements for openness, balance, and consensus.  In other words, only standards that pass a due process of rigorous approval guidelines become accredited standards.  This ensures that all standards accredited by ANSI are worthwhile for manufacturers and consumers alike.\nAdditional information about ANSI can be found at the official ANSI website."
        ]
    },
    {
        "word": "APFS",
        "type": [],
        "definition": [
            "Stands for \"Apple File System.\"  APFS is a file system developed by Apple specifically for flash memory storage devices.  It was released with iOS 10.3 in March, 2017 and for macOS 10.13 (High Sierra) in September, 2017.\nThe Apple File System is the successor to Apple's previous file system HFS+, which has been used for decades in Apple products.  APFS is designed to provide a more efficient means of storing and accessing files on flash storage devices, such as smartphone and SSDs.  It supports over 9 quintillion files on a single storage device, compared to the roughly 4.3 billion files supported by HFS+.  APFS natively supports full disk encryption, while HFS+ does not.\nAPFS provides a number of significant performance improvements over HFS+.  It requires less memory overhead and has lower latency than HFS+.  This means reading and writing files is faster, speeding up common operations such as opening documents and browsing large numbers of files.  Copying is much more efficient since file clones are created by simply adding a pointer to the original file rather than duplicating the file.  This creates copies instantly without requiring additional disk space.  When a copied file is modified, the updates are recorded as \"deltas\" or changes to the file.\nLike its predecessor, the Apple File System supports TRIM to improve the lifespan of SSDs.  It also adds \"Space Sharing,\" which allows multiple APFS volumes to share the same free space on a physical storage device, or \"container.\"  This allows APFS-formatted volumes to grow (or shrink) as needed without repartitioning.  Instead of journaling (implemented by HFS+), APFS tracks changes using a copy-on-write metadata scheme to record changes to the file system.  This prevents file corruption caused by unexpected crashes and reduces the overhead of journaling.\nNOTE: APFS is automatically used in Macs with flash memory drives running macOS 10.13 High Sierra or later.  Updating a flash-based Mac to High Sierra will automatically update the file system from HFS+ to APFS.  Macs with HDDs or Fusion Drives will not be updated to APFS."
        ]
    },
    {
        "word": "API",
        "type": [],
        "definition": [
            "Stands for \"Application Programming Interface.\"  An API is a set of commands, functions, protocols, and objects that programmers can use to create software or interact with an external system.  It provides developers with standard commands for performing common operations so they do not have to write the code from scratch.\nAPIs are available for both desktop and mobile operating systems.  The Windows API, for example, provides developers with user interface controls and elements, such as windows, scroll bars, and dialog boxes.  It also provides commands for accessing the file system and performing file operations, such as creating and deleting files.  Additionally, the Windows API includes networking commands that can be used to send and receive data over a local network or the Internet.\nMobile APIs, such as the iOS API, provide commands for detecting touchscreen input, such as tapping, swiping, and rotating.  It also includes common user interface elements, such as a pop-up keyboard, a search bar, and a tab bar, which provides navigation buttons the bottom of the screen.  The iOS API also includes predefined functions for interacting with an iOS device's hardware, such as the camera, microphone, or speakers.\nOperating system APIs are typically integrated into the software development kit for the corresponding program.  For example, Apple's Xcode IDE allows developers to drag and drop elements into an application's interface.  It also provides a list of available functions and includes syntax highlighting for known elements and commands.\nWhile operating system APIs have a robust set of features, other types of APIs are much more basic.  For example, a website may provide an API for web developers that allows them to access specific information from the site.  A website API may be as simple as a set of XML elements with a few basic commands for retrieving the information.  "
        ]
    },
    {
        "word": "APM",
        "type": [],
        "definition": [
            "Stands for \"Actions Per Minute.\"  APM is a video game metric that measures how many actions a player performs per minute.  For example, if a player averages one action each second, his or her APM is 60.  If a player averages 2.5 actions per second, he or she has an APM of 150.\nAPM applies to several different games, but it is most beneficial in real-time strategy (RTS) games.  For example, games like StarCraft and Age of Empires require players to multitask in real-time.  A player with a high APM will be able to accomplish more in a given time than a player with a lower APM.  This provides a significant advantage when competing against players online or in eSports competitions.\nWhat is an \"Action?\"\nAn action is a single mouse click or keystroke entered during gameplay.  For example, clicking the cursor on a unit, pressing \"A\" to attack, then clicking the cursor on the attack location is three actions.  Mouse movements are generally not considered actions.\nA high or \"fast\" APM in StarCraft 2 is 400 to 500 actions per minute.  During peak moments of gameplay, professional players may exceed 800 APM.\nWhile APM is an important metric in RTS gaming, it is not the only ability that matters.  Other important skills include:\n\nStrategy - understanding the game and creating effective methods to win\nDecision-making - knowing when to defend, when to attack, and how to adapt in the middle of a game\nMicro - controlling individual units, especially during combat\nMacro - continuously making units and structures, and using resources efficiently\n\nAPM is most important in RTS games, but it can apply to other video games as well.  For example, it helps to have a high APM in first-person shooter (FPS) games like Call of Duty and Overwatch.  Being \"fast\" is also advantageous in fighting games like Street Fighter and Super Smash Bros.  However, accuracy is often more critical than speed in these games, so APM is not as important.\nNOTE: APM may be inflated by redundant actions, such as repeatedly pressing a key or mouse button.  An example is clicking is right-clicking the same location several times in a row when only one click is needed.  Some games include an algorithm that calculates \"effective APM\" or EPM, by removing redundant actions."
        ]
    },
    {
        "word": "APU",
        "type": [],
        "definition": [
            "An APU is a processor that includes both the CPU and GPU on a single chip.  The name “APU” was coined by AMD, which released the first APU in January, 2011.\nFor many years, CPUs handled all non-graphics calculations, while GPUs were only used for graphics operations.  As GPU performance increased, hardware manufacturers and software programmers realized GPUs had a lot of unused potential.  Therefore, they began to find ways to offload certain system calculations to the GPU.  This strategy, called “parallel processing,” enables the GPU to perform calculations alongside the CPU, improving overall performance.\nThe APU takes parallel computing one step further by removing the bus between the CPU and GPU and integrating both units on the same chip.  Since the bus is the main bottleneck in parallel processing, an APU is more efficient than a separate CPU and GPU.  While this strategy may not make sense for desktop computers with dedicated video cards, it can provide significant performance gains for laptops and other mobile devices that have integrated graphics chips.\nNOTE: While Intel processors are not called APUs, modern Intel architectures, such as Sandy Bridge and Ivy Bridge are designed with integrated CPUs and GPUs.  These chips are sometimes called “hybrid processors,” since they contain both the central processing unit and the graphics processing unit."
        ]
    },
    {
        "word": "ARP",
        "type": [],
        "definition": [
            "Stands for \"Address Resolution Protocol.\"  ARP is a protocol used for mapping an IP address to a computer connected to a local network LAN.  Since each computer has a unique physical address called a MAC address, the ARP converts the IP address to the MAC address.  This ensures each computer has a unique network identification.\nThe Address Resolution Protocol is used when information sent to a network arrives at the gateway, which serves as the entrance point to the network.  The gateway uses the ARP to locate the MAC address of the computer based on the IP address the data is being sent to.  The ARP typically looks up this information in a table called the \"ARP cache.\"  If the address is found, the information is relayed to the gateway, which will send the incoming data to the appropriate machine.  It may also convert the data to the correct network format if necessary.\nIf the address is not found, the ARP broadcasts a \"request packet\" to other machines on the network to see if the IP address belongs to a machine not listed in the ARP cache.  If a valid system is located, the information will be relayed to the gateway and the ARP cache will be updated with the new information.  By updating the ARP cache, future requests for that IP address will be much quicker.  While this may seem like a complex process, it usually takes only a fraction of a second to complete.  If only it was just as easy to find old receipts when you need them."
        ]
    },
    {
        "word": "ASCII",
        "type": [],
        "definition": [
            "Stands for \"American Standard Code for Information Interchange.\"  ASCII is a character encoding that uses numeric codes to represent characters.  These include upper and lowercase English letters, numbers, and punctuation symbols.\nStandard ASCII\nStandard ASCII can represent 128 characters.  It uses 7 bits to represent each character since the first bit of the byte is always 0.  For instance, a capital \"T\" is represented by 84, or 01010100 in binary.  A lowercase \"t\" is represented by 116 or 01110100 in binary.  Other keyboard keys are also mapped to standard ASCII values.  For example, the Escape key (ESC) is 27 in ASCII and the Delete key (DEL) is 127.\nASCII codes may also be displayed as hexadecimal values instead of the decimal numbers (0 to 127) listed above.  For example, the ASCII value of the Escape key (27) in hexadecimal is 1B.  The hexadecimal value of the Delete key (127) is 7F.\nExtended ASCII\nThe 128 (27) characters supported by standard ASCII are enough to represent all standard English letters, numbers, and punctuation symbols.  However, it is not sufficient to represent all special characters and characters from other languages.  Extended ASCII helps solve this problem by adding an extra 128 values, for a total of 256 (28) characters.  The additional binary values start with a 1 instead of a 0.  For example, in extended ASCII, the character \"é\" is represented by 233, or 11101001 in binary.  The capital letter \"Ö\" is represented by 214, or 11010110 in binary.\nWhile extended ASCII doubles the character set of standard ASCII, it does not include nearly enough characters to support all languages.  Some Asian languages, for example, require thousands of characters.  Therefore, other character encodings, such as Latin-1 (ISO-8859-1) and UTF-8 are now more commonly used than ASCII for documents and webpages.  UTF-8 supports over one million characters."
        ]
    },
    {
        "word": "ASO",
        "type": [],
        "definition": [
            "Stands for \"App Store Optimization.\"  ASO is the process of optimizing the listing of an app in an online app store, such as Apple's App Store, the Microsoft Store, or Google Play.  It is similar to search engine optimization (SEO) but is targeted towards apps rather than websites.\nThe goal of ASO is to improve an app's visibility within an app store.  One of the top ways an app can gain prominence is to rank highly in the search results for specific keywords.  For example, the developer of a racing game might aim to have the app appear in the top results for searches like \"racing,\" \"cars,\" and \"racing game.\"  The developer of a photo editing app might want the app to rank highly for searches such as \"photos,\" \"photo editor,\" and \"image adjustment.\"\nWhile ASO might seem straightforward, there are often hundreds or even thousands of apps competing for the same top rankings.  Additionally, each app store uses a different alogorithm, similar to a web search engines).  The algorithms are frequently updated, which makes ASO an ongoing process.\nBasic app store optimization strategies include:\n\nChoosing a descriptive app name or title\nPublishing an accurate and helpful app description in the app store\nSelecting appropriate keywords for the app store listing\nProviding useful and attractive screenshots\n\nAdvanced ASO strategies that may require more time to implement include:\n\nBuilding a large user base, increasing the popularity of the app\nGenerating a large number of positive ratings and reviews\nHaving other websites or apps link to the app listing\nEnsuring the app is up-to-date and stable.\n\nSome app stores allow developers to advertise their apps within the store.  Similar to paid search advertising, this provides developers with an alternative way to improve their app visibility by paying for a top search result.  Paid placement is not \"organic ASO,\" but is commonly used to boost app downloads, especially when a new app is launched.\nNOTE: ASO may also aim to improve an app's ranking in the Browse section of an app store.  For example, if an app is listed as featured or trending, it may significantly increase the app's visibility and number of downloads."
        ]
    },
    {
        "word": "ASP",
        "type": [],
        "definition": [
            "ASP has two different meanings in the IT world: 1) Application Service Provider, and 2) Active Server Page.\n1) Application Service Provider\nAn Application Service Provider is a company or organization that provides software applications to customers over the Internet.  These Internet-based applications are also known as \"software as a service\" (SaaS) and are often made available on a subscription basis.  This means ASP clients often pay a monthly fee to use the software, rather than purchasing a traditional software license.  Some SaaS applications can be accessed via a web browser, while others operate over a proprietary secure port.\n2) Active Server Page\nAn Active Server Page, commonly called an \"ASP page,\" is a webpage that may contain scripts as well as standard HTML.  The scripts are processed by an ASP interpreter on the web server each time the page is accessed by a visitor.  Since the content of an ASP page can be generated on-the-fly, ASP pages are commonly used for creating dynamic websites.\nASP is similar to other scripting platforms, like PHP and JSP, but supports multiple programming languages.  While the default ASP language is VBScript, ASP pages can include other programming languages as well, such as C# and JavaScript.  However, alternative languages must be defined before the script code using the following declaration:\n \nASP pages are part of the ASP.NET web application framework developed by Microsoft.  Therefore, ASP pages are most often found on Windows-based web servers that run Microsoft Internet Information Services, or IIS.  You can tell if you are accessing an ASP page in your browser if the URL has an \".asp\" or \".aspx\" suffix.\nFile extensions: .ASP, .ASPX"
        ]
    },
    {
        "word": "ASP.NET",
        "type": [],
        "definition": [
            "ASP.NET is a set of Web development tools offered by Microsoft.  Programs like Visual Studio .NET and Visual Web Developer allow Web developers to create dynamic websites using a visual interface.  Of course, programmers can write their own code and scripts and incorporate it into ASP.NET websites as well.  Though it often seen as a successor to Microsoft's ASP programming technology, ASP.NET also supports Visual Basic.NET, JScript .NET and open-source languages like Python and Perl.\nASP.NET is built on the .NET framework, which provides an application program interface (API) for software programmers.  The .NET development tools can be used to create applications for both the Windows operating system and the Web.  Programs like Visual Studio .NET provide a visual interface for developers to create their applications, which makes .NET a reasonable choice for designing Web-based interfaces as well.\nIn order for an ASP.NET website to function correctly, it must be published to a Web server that supports ASP.NET applications.  Microsoft's Internet Information Services (IIS) Web server is by far the most common platform for ASP.NET websites.  While there are some open-source options available for Linux-based systems, these alternatives often provide less than full support for ASP.NET applications."
        ]
    },
    {
        "word": "ATA",
        "type": [],
        "definition": [
            "Stands for \"Advanced Technology Attachment.\"  It is a type of disk drive that integrates the drive controller directly on the drive itself.  Computers can use ATA hard drives without a specific controller to support the drive.  The motherboard must still support an ATA connection, but a separate card (such as a SCSI card for a SCSI hard drive) is not needed.  Some different types of ATA standards include ATA-1, ATA-2 (a.k.a. Fast ATA), ATA-3, Ultra ATA (33 MBps maximum transfer rate), ATA\/66 (66 MBps), and ATA\/100 (100 MBps).\nThe term IDE, or \"Integrated Drive Electronics,\" is also used to refer to ATA drives.  Sometimes (to add extra confusion to people buying hard drives), ATA drives are labeled as \"IDE\/ATA.\"  Technically, ATA uses IDE technology, but the important thing to know is that they refer to the same thing."
        ]
    },
    {
        "word": "ATM",
        "type": [],
        "definition": [
            "Stands for \"Asynchronous Transfer Mode.\"  Most people know of ATMs as automated teller machines -- those friendly boxes that allow you to withdraw cash from your bank or credit account while charging you a ridiculous surcharge for the service.  In the computer world, however, ATM has a different meaning.  Asynchronous Transfer Mode is a networking technology that transfers data in packets or cells of a fixed size.\nATM uses 53-byte cells (5 bytes for the address header and 48 bytes for the data).  These extremely small cells can be processed through an ATM switch (not an automated teller machine) fast enough to maintain data transfer speeds of over 600 mbps.  The technology was designed for the high-speed transmission of all forms of media from basic graphics to full-motion video.  Because the cells are so small, ATM equipment can transmit large amounts of data over a single connection while ensuring that no single transmission takes up all the bandwidth.  It also allows Internet Service Providers (ISPs) to assign limited bandwidth to each customer.  While this may seem like a downside for the customer, it actually improves the efficiency of the ISP's Internet connection, causing the overall speed of the connection to be faster for everybody."
        ]
    },
    {
        "word": "ATX",
        "type": [],
        "definition": [
            "Stands for \"Advanced Technology eXtended.\"  ATX is a motherboard specification that defines the board's physical dimensions, connector placement, I\/O ports, and supported power supplies.  It was introduced by Intel in 1995 and was designed to replace the previous \"AT\" standard for desktop PCs.  Since then, many variations of the original ATX standard have been developed and some are still used in today's desktop computers.\nThere are several distinct differences between ATX and the AT form factor it superseded.  For example, ATX has an I\/O panel that is twice the height of the AT panel and allows for flexible interface layouts.  It also has different processor, memory, and drive I\/O locations.  These changes provide the following benefits:\n\nFewer cables\nImproved reliability\nSupport for modern I\/O standards like USB\nSupport for integrated graphics\nLarger expansion slots\nEasier processor and memory upgrades\nReduced cost\n\nA full size ATX motherboard is 12 inches wide and 9.6 inches deep (305 x 244 mm).  There are also several variants of ATX, which have slightly different form factors.  This include the following:\n\nFlexATX – 9 × 7.5 in (229 × 191 mm) \nMicroATX – 9.6 × 9.6 in (244 × 244 mm)\nMini ATX – 11.2 × 8.2 in (284 × 208 mm)\nExtended ATX (EATX) – 12 × 13 in (305 × 330 mm)\nWorkstation ATX (WTX) – 14 × 16.75 in (356 × 425 mm)\n\nThe ATX specification defines the mounting hole locations, which means any standard ATX motherboard can be attached to any standard ATX case.  Smaller boards (such as FlexATX, MicroATX, and Mini ATX) have several of the same mounting hole locations, so they can be placed in a standard ATX case as well.  The universal compatibility of ATX boards and components make them a popular choice for hobbyists who build their own PCs."
        ]
    },
    {
        "word": "AUP",
        "type": [],
        "definition": [
            "Stands for \"Acceptable Use Policy.\"  An AUP is list of rules you must follow in order to use a website or Internet service.  It is similar to a software license agreement (SLA), but is used specifically for Internet services.\nMost well-known, high traffic websites include an AUP, which may also be called Terms of Service (TOS) or Terms of Use (TOU).  You can often find a link to the to the website's AUP in the footer of the home page.  Many web services, such as cloud applications require you to agree to an AUP in order to use the online service.  ISPs often provide an AUP with each account, which states specific guidelines you must follow.\nThe specifics of an AUP vary depending on the service offered.  Even website AUPs may differ greatly based on the purpose of the website and the website's content.  However, most AUPs include a list of general dos and don'ts while using the service, such as the following:\n\nDo not violate any federal or state laws.\nDo not violate the rights of others.\nDo not distribute viruses or other malware.\nDo not try to gain access to an unauthorized area or account.\nRespect others' copyrights and intellectual property.\nFamiliarize yourself with the usage guidelines and report violations.\n\nAn AUP serves as an agreement between the user and the company offering the online service.  Some rules are basic netiquette, while others may have legal ramifications.  If you fail to comply with a policy in a AUP, the company has the right to suspend or terminate your account or take legal action if necessary.  Therefore, it is wise to familiarize yourself with the AUPs of the Internet services you use."
        ]
    },
    {
        "word": "AVR",
        "type": [],
        "definition": [
            "Stands for \"Audio\/Video Receiver.\"  An AVR, often called a receiver, is the central routing and processing component in a home theater.  It can receive signals from connected components and route them to different devices.  AVRs are also sometimes referred to as \"amplifiers,\" since one of their primary functions is to amplify an audio signal before sending it to the speakers.\nIn a typical home theater setup, all devices are connected to the HDMI ports on the back of the AVR.  The audio is routed to speakers, such as Dolby 5.1 surround system (five speakers plus one subwoofer).  The video is typically output to a television.  In a modern home theater, the TV may serve as a monitor since the audio is processed by the AVR and video input is handled by a cable box, Apple TV, or another device.  Smart TVs are an exception since they are both an input device (sending audio and video data to the AVR) and an output device (displaying video from built-in apps or other devices.\nHistory of AVRs\nEarly receivers were not called AVRs since they only handled audio signals.  The inputs and outputs were primarily analog, except for a optical audio connection such as a Toslink or S\/PDIF port.  Eventually, receivers were built to route video signals as well as audio.\nAs digital devices became more common, receivers started to serve a more primary role as the central digital controller of a home theater system.  Since HDMI enables bidirectional communication, devices can now communicate with each other.  For example, an AVR can tell a television to turn on or off and a TV can tell an AVR to change the volume.\nDigital device commands can be synced through an AVR using an HDMI standard called HDMI Consumer Electronics Control or \"HDMI-CEC.\"  Different manufacturers use different names for this technology, including Bravia Sync (Sony), Anynet+ (Samsung), and SimpLink (LG), but most brands work with components made by other manufacturers.\nModern AVRs\nModern AVRs are far more functional than older receivers that simply amplified signals from radio transmissions, audio tapes, and CD players.  They now serve as the control center for most home theaters.  Many AVRs also support wireless technologies such as Wi-Fi and Bluetooth, which allows you to stream music wirelessly to speakers connected to the receiver."
        ]
    },
    {
        "word": "Abend",
        "type": [],
        "definition": [
            "Short for \"Abnormal end.\"  An abend is an unexpected or abnormal end to a process.  In computer software, it typically refers to a software crash when a program unexpectedly quits.  For example, an error in a program's code may cause it to freeze or crash while running a certain command.  The result is an unexpected (and often inconvenient) end to the program.\nThe term \"ABEND\" was initially used by IBM OS\/360 systems as an error message.  It is now used by Novell Netware systems and also as a general programming term."
        ]
    },
    {
        "word": "Abstraction",
        "type": [],
        "definition": [
            "An abstraction is a general concept or idea, rather than something concrete or tangible.  In computer science, abstraction has a similar definition.  It is a simplified version of something technical, such as a function or an object in a program.  The goal of \"abstracting\" data is to reduce complexity by removing unnecessary information.\nAt some level, we all think of computers in abstract terms.  When we type a document in a word processor, we don't think of the CPU processing each letter we type and the data being saved to memory.  When we view a webpage, we don't think of the binary data being transferred over the Internet and being processed and rendered by the web browser.  We simply type our documents and browse the web.  This is how we naturally abstract computing concepts.\nEven highly technical people, such as software developers can benefit from abstraction.  For instance, one of the key benefits of object-oriented programming is data abstraction.  It transforms complex entities into simplified objects, which can be accessed and altered within a program.  These objects, which are often called classes, may have multiple attributes and methods.  By consolidating these items into a single object, it makes it easier for programmers to access and manage data within a program."
        ]
    },
    {
        "word": "Access",
        "type": [],
        "definition": [
            "Microsoft Access, often abbreviated \"MS Access,\" is a popular database application for Windows.  Access allows users to create custom databases that store information in an organized structure.  The program also provides a visual interface for creating custom forms, tables, and SQL queries.  Data can be entered into an Access database using either visual forms or a basic spreadsheet interface.  The information stored within an Access database can be browsed, searched, and accessed from other programs, including Web services.\nWhile Access is a proprietary database management system (DBMS), it is compatible with other database programs since it supports Open Database Connectivity (ODBC).  This allows data to be sent to and from other database programs, such as MS SQL, FoxPro, Filemaker Pro, and Oracle databases.  This compatibility also enables Access to serve as the back end for a database-driven website.  In fact, Microsoft FrontPage and Expression Web, as well as ASP.NET have built-in support for Access databases.  For this reason, websites hosted on Microsoft Windows servers often use Access databases for generating dynamic content.\nFile Extension: .MDB"
        ]
    },
    {
        "word": "Access Point",
        "type": [],
        "definition": [
            "An access point is a device, such as a wireless router, that allows wireless devices to connect to a network.  Most access points have built-in routers, while others must be connected to a router in order to provide network access.  In either case, access points are typically hardwired to other devices, such as network switches or broadband modems.\nAccess points can be found in many places, including houses, businesses, and public locations.  In most houses, the access point is a wireless router, which is connected to a DSL or cable modem.  However, some modems may include wireless capabilities, making the modem itself the access point.  Large businesses often provide several access points, which allows employees to wirelessly connect to a central network from a wide range of locations.  Public access points can be found in stores, coffee shops, restaurants, libraries, and other locations.  Some cities provide public access points in the form of wireless transmitters that are connected to streetlights, signs, and other public objects.\nWhile access points typically provide wireless access to the Internet, some are intended only to provide access to a closed network.  For example, a business may provide secure access points to its employees so they can wirelessly access files from a network server.  Also, most access points provide Wi-Fi access, but it is possible for an access point to refer to a Bluetooth device or other type of wireless connection.   However, the purpose of most access points is to provide Internet access to connected users.\nThe term \"access point\" is often used synonymously with base station, though base stations are technically only Wi-Fi devices.  It may also be abbreviated AP or WAP (for wireless access point).  However, WAP is not as commonly used as AP since WAP is the standard acronym for Wireless Access Protocol."
        ]
    },
    {
        "word": "Accessibility",
        "type": [],
        "definition": [
            "Accessibility refers to the design of products and environments for people with disabilities.  Examples include wheelchairs, entryway ramps, hearing aids, and braille signs.  In the IT world, accessibility often describes hardware and software designed to help those who experience disabilities.\nHardware\nAccessibility hardware may refer to a custom computer system designed for a specific person or simply an accessory that helps an individual with a computer.  Examples of accessibility accessories include keyboards with large letters on the keys, oversized mice and trackballs, and pillow switches that can be activated with only a small amount of force.  These and other devices can make it possible for users with disabilities to use computers in ways they would not be able to otherwise.\nSoftware\nModern operating systems include standard accessibility options that can make them easier to use without the need for specialized hardware.  For example, Windows and macOS both provide display modification options, such as magnification and inverting colors, which helps those with difficulty seeing.  Text-to-speech can also be turned on to provide audible descriptions of objects and text on the screen.  Dictation can be used to perform common tasks with vocal commands.\nAccessibility options can be found in the following locations for common operating systems:\n\nWindows: Settings &rarr; Ease of Access\nmacOS: System Preferences &rarr; Accessibility\niOS: Settings &rarr; General &rarr; Accessibility\nAndroid: Settings&rarr; Accessibility\n\nView the related images to see examples of accessibility settings."
        ]
    },
    {
        "word": "Activation Key",
        "type": [],
        "definition": [
            "A software activation key is a string of letters and\/or numbers used to register or activate a software application.  You may receive an activation key when you purchase a commercial software program.\nThe purpose of an activation key is to prevent software piracy by ensuring only users who have purchased a program can use it.  Some software programs will not function without a valid activation key, while other programs will run in \"trial mode\" or with restricted functionality.  Registering or activating the software with the activation key removes these limitations.\nThere is no standard activation key format, but most include both letters and numbers.  They often contain groups of characters separated by dashes for readability.  Most license keys contain at least 10 characters, and some may have over 30.  Below is an example of a typical activation key:\nFA50F-3B7E6-754C2-B3F12-F279E\nDevelopers can implement software activation keys in several different ways.  The most basic method is to simply check a key against a database or list of keys.  If a user enters an activation key that matches one in the list, the software is successfully activated.  A more advanced method is to generate activation keys dynamically based on a user's registration information (such as an email address).  An algorithm in the program can then check the key to see if it corresponds with the email address used to register the software program.  Modern software programs often use online activation, which verifies the key on a remote server.  This allows the developer to limit the number of uses for each key and revoke keys if necessary.\nSoftware activation keys may be found inside retail software boxes or order confirmation emails.  You can typically open the activation window in a software program by locating the \"Activate\" or \"Register\" option in the program.\nNOTE: An activation key may also be called a product key, software key, license key, registration code, or serial number."
        ]
    },
    {
        "word": "Active Cell",
        "type": [],
        "definition": [
            "An active cell refers to the currently selected cell in a spreadsheet.  It can be identified by a bold (typically blue) outline that surrounds the cell.  The standard way to reference the location of an active cell is with a column\/row combination, such as A2 (first column, second row) or B5 (second column, fifth row).\nWhenever you click on a specific cell within a spreadsheet, it becomes the active cell.  Once a cell is selected, you can enter values or a function into the cell.  Most spreadsheet programs will display the value of the active cell both inside the cell itself and within a long text field in the spreadsheet toolbar.  The text field is helpful for viewing or modifying functions and for editing long text strings that don't fit in the active cell.\nMost spreadsheet applications allow you to define a specific data type for individual cells.  Therefore, you can use the cell formatting option in the toolbar or select Format &rarr; Cells… from the menu bar to choose the data type for the active cell.  For example, if the active cell contains the price of an item, you may want to select \"Currency\" as the data type.  You can also format the appearance of an active cell by selecting the font, text color, background color, and text styles.\nIn most cases, a spreadsheet only has one active cell at a time.  However, it is possible to select multiple cells by dragging the cursor over a group of cells.  In this case, all of the selected cells may be considered active cells.  If you change the cell formatting options while multiple cells are selected, the changes will affect all of the active cells.\nNOTE: When writing a function in Microsoft Excel, the ActiveCell property can be used to reference the active cell.  The value of the active cell can be accessed using ActiveCell.Value."
        ]
    },
    {
        "word": "Active Directory",
        "type": [],
        "definition": [
            "Active Directory (AD) is a Microsoft technology used to manage computers and other devices on a network.  It is a primary feature of Windows Server, an operating system that runs both local and Internet-based servers.\nActive Directory allows network administrators to create and manage domains, users, and objects within a network.  For example, an admin can create a group of users and give them specific access privileges to certain directories on the server.  As a network grows, Active Directory provides a way to organize a large number of users into logical groups and subgroups, while providing access control at each level.\nThe Active Directory structure includes three main tiers: 1) domains, 2) trees, and 3) forests.  Several objects (users or devices) that all use the same database may be grouped into a single domain.  Multiple domains can be combined into a single group called a tree.  Multiple trees may be grouped into a collection called a forest.  Each one of these levels can be assigned specific access rights and communication privileges.\nActive Directory provides several different services, which fall under the umbrella of \"Active Directory Domain Services,\" or AD DS.  These services include:\n\nDomain Services – stores centralized data and manages communication between users and domains; includes login authentication and search functionality\nCertificate Services – creates, distributes, and manages secure certificates\nLightweight Directory Services – supports directory-enabled applications using the open (LDAP) protocol\nDirectory Federation Services – provides single-sign-on (SSO) to authenticate a user in multiple web applications in a single session\nRights Management – protects copyrighted information by preventing unauthorized use and distribution of digital content\n\nAD DS is included with Windows Server (including Windows Server 10) and is designed to manage client systems.  While systems running the regular version of Windows do not have the administrative features of AD DS, they do support Active Directory.  This means any Windows computer can connect to a Windows workgroup, provided the user has the correct login credentials.\n"
        ]
    },
    {
        "word": "Active-Matrix",
        "type": [],
        "definition": [
            "Active-matrix is a technology used in LCD displays, such as laptop screens, and flat screen monitors.  It uses a matrix of thin film transistors (TFTs) and capacitors to control the image produced by the display.  The brightness of each pixel is controlled by modifying the electrical charge of the corresponding capacitors.  Each pixel's color is controlled by altering the charge of individual capacitors that emit red, green, and blue (RGB) light.\nThe term \"active-matrix\" refers to the active nature of the capacitors in the display.  Unlike a passive-matrix display, which must charge full rows of wires to alter individual pixels, an active-matrix display can control each pixel directly.  This results in a significantly faster response time, meaning the pixels can change state much more rapidly.  In practical terms, an active-matrix monitor can display motion and fast-moving images more clearly than a passive-matrix display can.  The fast switching of TFTs also prevents the \"ghosting\" of the cursor that is common on passive-matrix screens.\nSince active-matrix technology provides individual control of each pixel, active-matrix screens typically exhibit more even brightness and color across the screen than passive-matrix displays.  Because of the multiple advantages of active-matrix technology, most modern computer monitors, laptop screens, and LCD televisions use active-matrix screens."
        ]
    },
    {
        "word": "ActiveX",
        "type": [],
        "definition": [
            "ActiveX is a technology introduced by Microsoft in 1996 as part of the OLE framework.  It includes a collection of prewritten software components that developers can implement within an application or webpage.  This provides a simple way for programmers to add extra functionality to their software or website without needing to write code from scratch.\nSoftware add-ons created with ActiveX are called ActiveX controls.  These controls can be implemented in all types of programs, but they are most commonly distributed as small Web applications.  For example, a basic ActiveX control might display a clock on a webpage.  Advanced ActiveX controls can be used for creating stock tickers, interactive presentations, or even Web-based games.\nActiveX controls are similar to Java applets, but run through the ActiveX framework rather than the Java Runtime Environment (JRE).  This means you must have ActiveX installed on your computer in order to view ActiveX controls in your Web browser.  Additionally, when loading a custom ActiveX control within a webpage, you may be prompted to install it.  If this happens, you should only accept the download if it is from a trusted source.\nWhile ActiveX provides a convenient way for Web developers to add interactive content to their websites, the technology is not supported by all browsers.  In fact, ActiveX is only officially supported by Internet Explorer for Windows.  Therefore, ActiveX controls are rarely used in today's websites.  Instead, most interactive content is published using Flash, JavaScript, or embedded media."
        ]
    },
    {
        "word": "Ad Hoc Network",
        "type": [],
        "definition": [
            "\"Ad Hoc\" is actually a Latin phrase that means \"for this purpose.\"  It is often used to describe solutions that are developed on-the-fly for a specific purpose.  In computer networking, an ad hoc network refers to a network connection established for a single session and does not require a router or a wireless base station.\nFor example, if you need to transfer a file to your friend's laptop, you might create an ad hoc network between your computer and his laptop to transfer the file.  This may be done using an Ethernet crossover cable, or the computers' wireless cards to communicate with each other.  If you need to share files with more than one computer, you could set up a mutli-hop ad hoc network, which can transfer data over multiple nodes.\nBasically, an ad hoc network is a temporary network connection created for a specific purpose (such as transferring data from one computer to another).  If the network is set up for a longer period of time, it is just a plain old local area network (LAN)."
        ]
    },
    {
        "word": "Adapter",
        "type": [],
        "definition": [
            "An adapter is a device that allows a specific type of hardware to work with another device that would otherwise be incompatible.  Examples of adapters include electrical adapters, video adapters, audio adapters, and network adapters.\nAn electrical adapter, for instance, may convert the incoming voltage from 120V to 12V, which is suitable for a radio or other small electronic device.  Without regulating voltage through an adapter, the incoming electrical surge could literally fry the internal components of the device.  Most consumer electronics have adapters attached to the plug at the end of the electrical cord.  Whenever you see an plug surrounded by a large box, it is most likely an electrical adapter.  You can typically find the input and output voltage printed directly on the adapter.  A device that does not have an adapter on the end of its electrical cable typically has a built-in voltage adapter.  For example, desktop computers typically have the adapter built into the internal power supply.\nVideo adapters and audio adapters adapt one type of interface to another type of connector.  For example, a DVI to VGA adapter allows you to connect theDVI output of a laptop to the VGA input of a projector.  Most professional audio devices use 1\/4\" audio jacks, while most computers have 1\/8\" \"minijacks\" for audio input and output.  Therefore, 1\/4\" to 1\/8\" audio adapters are often used to import audio into computers.  Likewise, an 1\/8\" to 1\/4\" adapter can used to output audio from a computer to a professional audio system.  Since a large number of audio and video interfaces exist, there are hundreds of audio and video adapters available.\nNetwork cards, or NICs, are also called network adapters.  These include Ethernet cards, internal Wi-Fi chips, and external wireless transmitters.  While these devices don't convert connections like audio or video adapters, they enable computers to connect to network.  Since the network card makes it possible to connect to an otherwise incompatible network, the card serves as an adapter.  Similarly, video cards are sometimes called video adapters because they convert a video signal to an image that can be displayed on a monitor."
        ]
    },
    {
        "word": "Adaptive Content",
        "type": [],
        "definition": [
            "Adaptive content is digital content that is optimized for multiple devices.  It may include text, images, video, and other types of multimedia.  The content may simply adapt to your screen size or may appear differently depending on the device on which it is accessed.\nThe most popular way to display adaptive content on the web is through responsive web design.  By using CSS media queries and fluid layouts, web developers can create websites that adjust to the size of your browser window.  When you load a responsive webpage, a media query detects your window size and your browser displays the corresponding layout.  Media queries are often used in combination with fluid layouts, which define sections of a page in percentages rather than fixed pixels.  This allows the content to fill different screen sizes more evenly.\nAnother way to display adaptive web content is to detect what device a person is using.  For example, when you access a website on your mobile phone, it may direct you to a separate mobile site that is designed specifically for smartphones.  The layout may include larger text, more simple navigation, and larger buttons to make it easily accessible with a touchscreen.  Mobile sites often use unique URLs, such as m.example.com.\nWhile websites are the most common example of adaptive content, they are not the only kind.  Software, for instance, can be adapted to multiple devices and screen sizes.  Many productivity programs, such as Microsoft Office and Apple's iWork applications are now developed as mobile apps alongside the traditional desktop versions.  Many games that used to only run on desktop computers are now available for mobile devices as well.  Some programs now come in three different versions – for desktops, tablets, and smartphones.\nAdaptive content extends other mediums as well.  For example, a smart home thermostat may have a digital interface that displays temperature and humidity information as well as outside weather data downloaded from the Internet.  You might be able to access this data by logging into your account thorough the web or an app.  Similarly, the information displayed on your automobile's LCD panel might also be accessible through the web or a mobile app interface.  In each case, developers must create adaptive content that displays the information correctly on each device."
        ]
    },
    {
        "word": "Add-on",
        "type": [],
        "definition": [
            "An add-on is a software extension that adds extra features to a program.  It may extend certain functions within the program, add new items to the program's interface, or give the program additional capabilities.  For example, Mozilla Firefox, a popular Web browser, supports add-ons such as the Google toolbar, ad blockers, and Web developer tools.  Some computer games support add-ons that provide extra maps, new characters, or give the player game-editing capabilities.\nMost add-ons are available as self-installing packages.  This means the user can simply double-click the add-on package to install the files for the corresponding program.  Other add-ons may require the user to manually move files into specific directories.  While not all programs support add-ons, many programs are now developed with add-on support, since it provides a simple way for other developers to extend the functions of the program.\nHowever, not all software programs refer to these extra features as \"add-ons.\"  For example, Dreamweaver supports \"extensions,\" which add extra Web development features, while Excel can import \"Add-Ins\" that provide the user with extra spreadsheet tools.  Many programs also support plug-ins, which may be considered a type of add-on."
        ]
    },
    {
        "word": "Address Bar",
        "type": [],
        "definition": [
            "An address bar is a text field near the top of a Web browser window that displays the URL of the current webpage.  The URL, or web address, reflects the address of the current page and automatically changes whenever you visit a new webpage.  Therefore, you can always check the location of the webpage you are currently viewing with the browser's address bar.\nWhile the URL in the address bar updates automatically when you visit a new page, you can also manually enter a web address.  Therefore, if you know the URL of a website or specific page you want to visit, you can type the URL in the address bar and press Enter to open the location in your browser.\nNOTE: The URL typically begins with \"http:\/\/\", but most browsers will automatically add the HTTP prefix to the beginning of the address if you don't type it in.\nThe appearance of the address bar varies slightly between browsers, but most browsers display a small 16x16 pixel icon directly to the left of the URL.  This icon is called a \"favicon\" and provides a visual identifier for the current website.  Some browsers also display an RSS feed button on the right side of the address bar when you visit a website that offers RSS feeds.  In the Safari web browser, the address bar also doubles as a progress bar when pages are loading and includes a refresh button on the right side.  Firefox includes a favorites icon on the right side of the address bar that lets you add or edit a bookmark for the current page.\nThe address bar is sometimes also called an \"address field.\"  However, it should not be confused with a browser toolbar, such as the Google or Yahoo! Toolbar.  These toolbars typically appear underneath the address bar and may include a search field and several icons."
        ]
    },
    {
        "word": "Adware",
        "type": [],
        "definition": [
            "Adware is free software that is supported by advertisements.  Common adware programs are toolbars that sit on your desktop or work in conjunction with your Web browser.  They include features like advanced searching of the Web or your hard drive and better organization of your bookmarks and shortcuts.  Adware can also be more advanced programs such as games or utilities.  They are free to use, but require you to watch advertisements as long as the programs are open.  Since the ads often allow you to click to a Web site, adware typically requires an active Internet connection to run.\nMost adware is safe to use, but some can serve as spyware, gathering information about you from your hard drive, the Web sites you visit, or your keystrokes.  Spyware programs can then send the information over the Internet to another computer.  So be careful what adware you install on your computer.  Make sure it is from a reputable company and read the privacy agreement that comes with it."
        ]
    },
    {
        "word": "Affiliate",
        "type": [],
        "definition": [
            "An Internet affiliate is a company, organization, or individual that markets another company's products through their website.  In exchange for marketing their products, companies pay affiliates a commission for each sale they generate.\nAffiliate programs exist for many different industries, such as travel, clothing, technology, and online services.  This allows web publishers to promote specific products or services related to the content of their websites.  For example, the webmaster of a fashion website may publish affiliate banners for a clothing store.  The owner of a software review website may include affiliate links to different software programs.\nAffiliate marketing is a type of PPS advertising, since affiliates are only paid for sales they produce (unlike PPC advertising).  Therefore, merchants must offer affiliates high enough commissions to make it worthwhile for the publishers to run their ads.  Affiliate commissions vary widely between industries and also depend on average sale amounts.  Low-margin products, such as consumer electronics, may offer commissions as low as 2%, while high-margin products, such as computer software, may offer commissions as high as 75%.  Most affiliate commissions fall in the range of 5 to 20%.\nAffiliate programs provide free marketing for merchants and an extra source of revenue for web publishers.  While it is a win-win partnership, setting up an affiliate system to track sales and generate payments is a complex process.  Therefore, many companies run their affiliate programs through a third party e-commerce platform, such as Commission Junction or DirectTrack."
        ]
    },
    {
        "word": "Ajax",
        "type": [],
        "definition": [
            "Ajax is a combination of Web development technologies used for creating dynamic websites.  While the term \"Ajax\" is not written in all caps like most tech acronyms, the letters stand for \"Asynchronous JavaScript And XML.\"  Therefore, websites that use Ajax combine JavaScript and XML to display dynamic content.\nThe \"asynchronous\" part of Ajax refers to the way requests are made to the Web server.  When a script sends a request to the Web server, it may receive data, which can then be displayed on the Web page.  Since these events happen at slightly different times, they are considered to be asynchronous.  Most Ajax implementations use the XMLHttpRequest API, which includes a list of server requests that can be called within JavaScript code.  The data is usually sent back to the browser in an XML format, since it is easy to parse.  However, it is possible for the server to send data as unformatted plain text as well.\nWhat makes Ajax so powerful is that scripts can run on the client side, rather than on the server.  This means a JavaScript function can make a request to a server after a webpage has already finished loading.  The data received from the server can then be displayed on the page without reloading the other content.  If a server-side scripting language like PHP or ASP was used, the entire page would need to be reloaded in order for the new content to be displayed.\nWhile you may not realize it, you have probably seen Ajax at work on several different websites.  For example, search engines that provide a list of search suggestions as you type are most likely using Ajax to display the suggestions.  Image searches that produce more thumbnails as you scroll through the results typically use Ajax to retrieve the continual list of images.  When you click \"Older Posts\" at the bottom of a Facebook page, Ajax is used to display additional postings.\nAjax has helped make the Web more dynamic by enabling webpages to retrieve and load new content without needing to reload the rest of the page.  By using Ajax, Web developers can create interactive websites that use resources efficiently and provide visitors with a responsive interface."
        ]
    },
    {
        "word": "Alert Box",
        "type": [],
        "definition": [
            "An alert box, sometimes called a message box, is a small window that pops up on your screen to warn you that your computer is about to perform an operation with potentially damaging consequences.  For example, when you choose to empty the Trash or Recycle Bin on your computer, an alert box may pop up, saying \"Are you sure you want to permanently remove these items?\"  You are then given the choice to select \"OK,\" to delete the items, or \"Cancel,\" to prevent the items from being removed.\nAlert boxes act as a safeguard for users, preventing us from doing things we wish we hadn't.  Perhaps the most common alert box is the one that pops up when you try to close a document without saving it.  You'll mostly likely see an alert box with the message, \"Save changes to this document before closing?\"  You can select \"Don't Save,\" to discard the changes, \"Save,\" to save the changes before closing the document, or \"Cancel,\" to cancel closing the document and continue working on it.\nMost alert boxes include the standard alert icon -- a triangle with an exclamation point in the middle -- to get your attention.  However, not all alert boxes have multiple options, such as \"Cancel\" and \"OK.\"  For example, an alert box may show up on your screen saying a program performed an illegal operation and has unexpectedly quit.  When that happens, your only option is to select \"OK\" and then kick your computer for quitting the program before you had a chance to save your work."
        ]
    },
    {
        "word": "Algorithm",
        "type": [],
        "definition": [
            "An algorithm is a set of instructions designed to perform a specific task.  This can be a simple process, such as multiplying two numbers, or a complex operation, such as playing a compressed video file.  Search engines use proprietary algorithms to display the most relevant results from their search index for specific queries.\nIn computer programming, algorithms are often created as functions.  These functions serve as small programs that can be referenced by a larger program.  For example, an image viewing application may include a library of functions that each use a custom algorithm to render different image file formats.  An image editing program may contain algorithms designed to process image data.  Examples of image processing algorithms include cropping, resizing, sharpening, blurring, red-eye reduction, and color enhancement.\nIn many cases, there are multiple ways to perform a specific operation within a software program.  Therefore, programmers usually seek to create the most efficient algorithms possible.  By using highly-efficient algorithms, developers can ensure their programs run as fast as possible and use minimal system resources.  Of course, not all algorithms are created perfectly the first time.  Therefore, developers often improve existing algorithms and include them in future software updates.  When you see a new version of a software program that has been \"optimized\" or has \"faster performance,\" it most means the new version includes more efficient algorithms."
        ]
    },
    {
        "word": "Alpha Software",
        "type": [],
        "definition": [
            "Alpha software is computer software that is still in the early testing phase.  It is functional enough to be used, but is unpolished and often lacks many of the features that will be included in the final version of the program.  The \"alpha phase\" of software development follows the early programming and design stages, but precedes the \"beta phase\" in which the software closely resembles the final version.\nSince the alpha phase is an early part of the software development cycle, alpha software typically includes significant bugs and usability issues.  Therefore, while beta software may be provided to the public, alpha software is only tested internally.  The alpha stage is also important for competitive reasons, as the developer may not want to disclose the new features of a software program until shortly before the release date.\nIf a developer is building a small application, he may be the only person who ever tests the alpha version.  Larger programs, however, are often tested internally by a team of developers during the alpha phase.  In some cases, multiple teams may work together on the alpha version of a software program.  Once the programmers have built a working version with all the necessary features, the lead developer may decide to implement a \"feature freeze,\" which means no additional features are planned for the current version of the program.  This often signals the end of the alpha phase and the beginning of the beta stage of development."
        ]
    },
    {
        "word": "Analog",
        "type": [],
        "definition": [
            "Analog is an adjective that describes a continuous measurement or transmission of a signal.  It is often contrasted with digital, which is how computers store and process data using ones and zeros.\nWhile computers are digital devices, human beings are analog.  Everything we perceive, such as what we see and hear, is a continuous transmission of information to our senses.  This continuous stream of input is not estimated, but received and processed by our brains as analog data.\nAnalog vs Digital Equipment\nThough we live in an era called the \"digital age,\" many analog devices still exist.  For example, a turntable (or record player) is an analog device, since the needle continuously reads the bumps and grooves on a record.  Conversely, a CD player is digital since it reads binary data that represents an audio signal.  A thermometer that displays the temperature using a mercury level or needle is considered analog, while one that displays the temperature on a screen is digital.\nDigital audio\/video equipment and software programs approximate audio or video signals using a process called sampling.  While they may \"sample\" an analog signal several thousand times per second, the digital version is still an estimation.  The analog signal has an infinite number of data points and therefore is more accurate than a digital one.\nWhile analog data has its advantages, digital data is far easier to manage and edit.  Since computers only process digital data, most information today is stored digitally.  Digital data is also easier to duplicate and preserve.  An exact copy of a CD or hard drive can be created over and over again, while copying an analog tape will eventually degrade the quality.\nConverting between Analog and Digital\nIt is possible to convert analog data to digital and vice versa.  For example, you can use an analog-to-digital converter (ADC), to convert analog VHS tapes into digital movies that can be played on your PC.  Similarly digital audio data can be converted to an analog signal that can be played through a speaker.  This is done using a digital-to-analog converter (DAC), which may exist in either the playback device (such as a computer) or the speaker.\nNOTE: If a speaker receives a digital input (such as a USB or Toslink connection), it must use a built-in DAC to convert the signal to analog.  If it receives an analog input, such as a 1\/8\" audio cable, RCA jack, or speaker wire, the analog signal can be output directly through the speaker."
        ]
    },
    {
        "word": "Android",
        "type": [],
        "definition": [
            "Android is a mobile operating system developed by Google.  It is used by several smartphones and tablets.  Examples include the Sony Xperia, the Samsung Galaxy, and the Google Nexus One.  \nThe Android operating system (OS) is based on the Linux kernel.  Unlike Apple's iOS, Android is open source, meaning developers can modify and customize the OS for each phone.  Therefore, different Android-based phones often have different graphical user interfaces GUIs even though they use the same OS.\nAndroid phones typically come with several built-in applications and also support third-party programs.  Developers can create programs for Android using the free Android software developer kit (SDK).  Android programs are written in Java and run through a Java virtual machine JVM that is optimized for mobile devices.  The \"Dalvik\" JVM was used through Android 4.4 and was replaced by Android Runtime or \"ART\" in Android 5.0.  Users can download and install Android apps from Google Play and other locations.\nIf you are unsure what operating system your phone or tablet uses, you can view the system information by selecting \"About\" in the Settings menu.  This is also a good way to check if your device meets an app's system requirements.  The name \"Android\" comes from the term android, which is robot designed to look and act like a human."
        ]
    },
    {
        "word": "Animated GIF",
        "type": [],
        "definition": [
            "An animated GIF is a GIF file that includes multiple images or \"frames.\"  These frames are played back in sequence when the file is opened or displayed in a web browser.  The result is an animated clip or a short movie.\nThe GIF file format includes a Graphics Control Extension (or \"GCE block\"), which enables a single GIF file to store multiple frames.  This section also specifies the delay between frames, which can be used to set the frame rate or insert pauses at certain points within the animation.  Another section, called the Netscape Application Block (NAB), specifies how many times the animation will repeat (a setting of \"0\" is used for infinite repetitions).\nIn the early years of the Web, animated GIFs were a popular way to display motion and liven up websites.  They were commonly used for advertisements, such as banners and leaderboards.  As Flash animations became more popular, animated GIFs became less prominent.  However, animated GIFs have recently seen a resurgence on the web since they are supported by all platforms.  For example, Apple's iOS does not support Flash animations, but can display animated GIFs.\nSeveral image editing programs, such as Adobe Photoshop and GIMP, can be used to create animated GIFs.  Other graphics programs can merge multiple image files into a single GIF.  Some video utilities can even convert short videos to animated GIFs.  While this can be useful for sharing small videos on the web, the GIF format is not as efficient as the MPEG format for storing videos longer than a few seconds."
        ]
    },
    {
        "word": "Anti-Aliasing",
        "type": [],
        "definition": [
            "Image anti-aliasing is the smoothing of edges and colors in digital images and fonts.  It makes edges appear less jagged and helps blend colors in a natural-looking way.\nTo understand anti-aliasing, it important to first understand what aliasing is.  Image aliasing is the \"jagged edge\" effect caused by mapping curved and diagonal shapes onto square pixels.  Horizontal and vertical lines can be mapped perfectly onto square pixels, but angled and curved lines must be estimated.  If pixels along the edge are either on or off, the result is a jagged edge, also called \"stair-stepping\" or aliasing.\nAnti-aliasing smoothes edges by estimating the colors along each edge.  Instead of pixels being on or off, they are somewhere in between.  For example, a black diagonal line against a white background might be shades of light and dark grey instead of black and white.  A blue circle on a yellow background might have shades of blue, yellow, and green along the edges instead of solid blue and yellow.\nThe goal of an anti-aliasing algorithm is to make a digital image look natural when viewed from a typical viewing distance.  When zoomed in, anti-aliased images and text may appear fuzzy because of the estimated pixels.\nAliasing is most noticeable on screens with a low DPI (dots per inch).  Modern HiDPI screens have a denser grid of pixels that can represent edges more accurately.  However, even HiDPI screens still benefit from anti-aliasing.\nNOTE: Anti-aliasing in digital audio is the removal of unwanted frequencies from sampled audio."
        ]
    },
    {
        "word": "Antivirus",
        "type": [],
        "definition": [
            "Antivirus software is a type of utility used for scanning and removing viruses from your computer.  While many types of antivirus (or \"anti-virus\") programs exist, their primary purpose is to protect computers from viruses and remove any viruses that are found.\nMost antivirus programs include both automatic and manual scanning capabilities.  The automatic scan may check files that are downloaded from the Internet, discs that are inserted into the computer, and files that are created by software installers.  The automatic scan may also scan the entire hard drive on a regular basis.  The manual scan option allows you to scan individual files or your entire system whenever you feel it is necessary.\nSince new viruses are constantly being created by computer hackers, antivirus programs must keep an updated database of virus types.  This database includes a list of \"virus definitions\" that the antivirus software references when scanning files.  Since new viruses are frequently distributed, it is important to keep your software's virus database up-to-date.  Fortunately, most antivirus programs automatically update the virus database on a regular basis.\nWhile antivirus software is primarily designed to protect computers against viruses, many antivirus programs now protect against other types of malware, such as spyware, adware, and rootkits as well.  Antivirus software may also be bundled with firewall features, which helps prevent unauthorized access to your computer.  Utilities that include both antivirus and firewall capabilities are typically branded \"Internet Security\" software or something similar.\nWhile antivirus programs are available for Windows, Macintosh, and Unix platforms, most antivirus software is sold for Windows systems.  This is because most viruses are targeted towards Windows computers and therefore virus protection is especially important for Windows users.  If you are a Windows user, it is smart to have at least one antivirus program installed on your computer.  Examples of common antivirus programs include Norton Antivirus, Kaspersky Anti-Virus, and ZoneAlarm Antivirus."
        ]
    },
    {
        "word": "Apache",
        "type": [],
        "definition": [
            "Apache is the most popular Web server software.  It enables a computer to host one or more websites that can be accessed over the Internet using a Web browser.  The first version of Apache was released in 1995 by the Apache Group.  In 1999, the Apache Group became the Apache Software Foundation, a non-profit organization that currently maintains the development of the Apache Web server software.\nApache's popularity in the Web hosting market is largely because it is open source and free to use.  Therefore, Web hosting companies can offer Apache-based Web hosting solutions at minimal costs.  Other server software, such as Windows Server, requires a commercial license.  Apache also supports multiple platforms, including Linux, Windows, and Macintosh operating systems.  Since many Linux distributions are also open-source, the Linux\/Apache combination has become the most popular Web hosting configuration.\nApache can host static websites, as well as dynamic websites that use server-side scripting languages, such as PHP, Python, or Perl.  Support for these and other languages is implemented through modules, or installation packages that are added to the standard Apache installation.  Apache also supports other modules, which offer advanced security options, file management tools, and other features.  Most Apache installations include a URL rewriting module called \"mod_rewrite,\" which has become a common way for webmasters to create custom URLs.\nWhile the Apache Web server software is commonly referred to as just \"Apache,\" it is technically called \"Apache HTTP Server,\" since the software serves webpages over the HTTP protocol.  When Apache is running, its process name is \"httpd,\" which is short for \"HTTP daemon.\""
        ]
    },
    {
        "word": "App",
        "type": [],
        "definition": [
            "App is short for \"application,\" which is the same thing as a software program.  While an app may refer to a program for any hardware platform, it is most often used to describe programs for mobile devices, such as smartphones and tablets.\nThe term \"app\" was popularized by Apple when the company created the \"App Store\" in 2008, a year after the first iPhone was released.  As the iPhone and App Store grew in popularity, the term \"app\" became the standard way to refer to mobile applications.  Programs for Android and Windows Phone are now called \"apps\" as well.\nUnlike applications for traditional PCs (often called \"desktop applications\"), mobile apps can only be obtained by downloading them from an online app store.  Most devices automatically install apps when downloaded, which creates a seamless installation process for the user.  Some apps are free, while others must be purchased.  However, mobile apps are typically much cheaper than PC applications, and many are available for only 99 cents.  In fact, most paid apps are less than $10.\nPart of the reason mobile apps are cheaper than desktop applications is because they are often less advanced and take less resources to develop.  Apps are limited to the capabilities of the mobile operating system (such as iOS or Android) and therefore may not offer as much functionality as a desktop program.  For example, a word processor for Android will most likely have significantly less features than a word processing application for Windows.  Most apps are designed to be small, fast, and easy-to-use.  Unlike desktop applications, apps are intended to be used on-the-go and are developed to advantage of a small touchscreen interface.\nNOTE: Apple released the Mac App Store in January, 2011, which offers downloadable applications for Mac OS X.  In this case, the term \"app\" refers to desktop applications."
        ]
    },
    {
        "word": "Apple",
        "type": [],
        "definition": [
            "Apple is a technology company based in Cupertino, California.  It was founded in 1976 by Steve Jobs, Steve Wozniak, and Ronald Wayne.  The company makes Macintosh computers, such as the iMac, Mac mini, MacBook, MacBook Pro, and Mac Pro.  Apple also manufactures several personal electronic devices, including the iPhone, iPad, iPod, and Apple Watch.\nWhile Apple is most known for its hardware devices, it also develops a wide range of software programs.  Examples include the macOS operating system, the Safari web browser, and the iWork apps (Pages, Numbers, and Keynote).  Apple also develops a few professional media applications, including Final Cut Pro and Logic Pro.\nIn addition to hardware and software, Apple offers several subscription services.  Examples include iCloud, Apple Music, Apple TV+, Apple News+, and Apple Fitness+.  Apple also has over 500 retail stores worldwide, which offer Apple products and provide Apple product support.\nNOTE: In 2007, Apple changed the company name from \"Apple Computer\" to just \"Apple,\" which reflected the broadening product lines.  Apple launched the first iPhone on June 29, 2007."
        ]
    },
    {
        "word": "Apple Silicon",
        "type": [],
        "definition": [
            "Apple silicon is a series of Mac processors developed by Apple.  For several decades, Apple built Macintosh computers with CPUs from third-party manufacturers, including Motorola, IBM, and Intel.  On June 22, 2020, Apple announced it would be transitioning its Mac lineup to \"Apple silicon,\" a proprietary processor technology.\nSimilar to Apple-developed processors found in iPhones and iPads, Apple silicon processors use a System on a Chip (SoC) architecture.  The SoC design includes a CPU, GPU, and several application-specific processors.  Examples of additional processors include:\n\nA media engine for media playback\nA neural engine for machine learning applications\nEfficiency cores for low-power computing\n\nMost processors within an Apple silicon SoC are multi-core, meaning they have multiple processing cores.  The M1, Apple's first \"Apple silicon\" chip, was released in November 2020 with the MacBook Air and Mac mini.  It has 4 performance cores (primary CPU processors), 4 efficiency cores, 8 GPU cores, and a 16-core neural engine.\nThe M1 Pro, released in October 2021 with the MacBook Pro, has 8 performance cores, 2 efficiency cores, 16 GPU cores, and a 16-core neural engine.  The M1 Max, released alongside the M1 Pro, has 8 performance cores (primary CPU processors), 2 efficiency cores, 32 GPU cores, and a 16-core neural engine.  Future Apple silicon chips are expected to have even more processing cores."
        ]
    },
    {
        "word": "Applet",
        "type": [],
        "definition": [
            "An applet is a small application designed to run within another application.  While the term \"applet\" is sometimes used to describe small programs included with a computer's operating system, it usually refers to Java applets, or small applications written in the Java programming language.\nUnlike ordinary applications, Java applets cannot be run directly by the operating system.  Instead, they must run within the Java Runtime Environment (JRE), or within another program that includes a Java plug-in.  If there is no JRE installed, Java applets will not run.  Fortunately, Java is freely available for Windows, Mac, and Linux systems, which means you can easily download and install the appropriate JRE for your system.  Since Java applets run within the JRE and are not executed by the operating system, they are crossplatform, meaning a single applet can run on Windows, Mac, and Linux systems.\nWhile applets can serve as basic desktop applications, they have limited access to system resources and therefore are not ideal for complex programs.  However, their small size and crossplatform nature make them suitable for Web-based applications.  Examples of applets designed to run in web browsers include calculators, drawing programs, animations, and video games.  Web-based applets can run in any browser on any operating system and long as the Java plug-in is installed.\nDuring the early years of the Web, Java applets provided a way for webmasters to add interactive features that were not possible with basic HTML.  However, in recent years, applets have been slowly replaced by newer technologies such as jQuery and HTML 5.  Some browsers, like Google Chrome, no longer support the &lt;applet&gt; tag, and others, like Apple Safari, do not even enable Java by default.  Since web developers cannot fully rely on Java support from web browsers, applets are no longer a common way to provide interactive content on the Web."
        ]
    },
    {
        "word": "Application",
        "type": [],
        "definition": [
            "An application, or application program, is a software program that runs on your computer.  Web browsers, e-mail programs, word processors, games, and utilities are all applications.  The word \"application\" is used because each program has a specific application for the user.  For example, a word processor can help a student create a research paper, while a video game can prevent the student from getting the paper done.\nIn contrast, system software consists of programs that run in the background, enabling applications to run.  These programs include assemblers, compilers, file management tools, and the operating system itself.  Applications are said to run on top of the system software, since the system software is made of \"low-level\" programs.  While system software is automatically installed with the operating system, you can choose which applications you want to install and run on your computer.\nMacintosh programs are typically called applications, while Windows programs are often referred to as executable files.  This is why Mac programs use the .APP file extension, while Windows programs use the .EXE extension.  Though they have different file extensions, Macintosh and Windows programs serve the same purpose and can both be called applications."
        ]
    },
    {
        "word": "Application Server",
        "type": [],
        "definition": [
            "An application server is a server specifically designed to run applications.  The \"server\" includes both the hardware and software that provide an environment for programs to run.\nApplication servers are used for many purposes.  Several examples are listed below:\n\nrunning web applications\nhosting a hypervisor that manages virtual machines\ndistributing and monitoring software updates\nprocessing data sent from another server\n\nSince the purpose of an application server is to run software programs, the most important hardware specifications are CPU and RAM.  On the software side, the operating system is most important, since it determines what software the server can run.\nWhy Use an Application Server?\nA web server is designed – and often optimized – to serve webpages.  Therefore, it may not have the resources to run demanding web applications.  An application server provides the processing power and memory to run these applications in real-time.  It also provides the environment to run specific applications.  For example, a cloud service may need to process data on a Windows machine.  A Linux-based server may provide the web interface for the cloud service, but it cannot run Windows applications.  Therefore, it may send input data to a Windows-based application server.  The application server can process the data, then return the result to the web server, which can output the result in a web browser."
        ]
    },
    {
        "word": "Archie",
        "type": [],
        "definition": [
            "Archie is a program that allows you to search for files available on one or more FTP servers.  It was commonly used in the early 1990s, but has been replaced by standard web-based search engines and peer-to-peer (P2P) file sharing services.\nIn the early days of the Internet, large files were often available only through FTP servers.  In order to download a specific file, users would have to navigate to the appropriate directory and then find the correct file before downloading it.  This made it difficult for people to locate files unless they knew exactly where they were stored on the server.  Archie made it possible for users to actually search FTP servers rather than browsing through all the directories.\nWhile Archie is rarely used today, some websites still offer an Archie search feature.  You can often identify an Archie search engine by a URL that begins with \"archie\" rather than \"www.\"  Most Archie search engines allow you to search for filenames based on either substrings or exact matches.  You can also specify if a search should be case sensitive or not.  Additionally, you can use boolean operators such as AND and OR to search for multiple filenames at once."
        ]
    },
    {
        "word": "Architecture",
        "type": [],
        "definition": [
            "The word \"architecture\" typically refers to building design and construction.  In the computing world, \"architecture\" also refers to design, but instead of buildings, it describes the design of computer systems.  Computer architecture is a broad topic that includes everything from the relationship between multiple computers (such as a \"client-server\" model) to specific components inside a computer.\nThe most important type of hardware design is a computer's processor architecture.  The design of the processor determines what software can run on the computer and what other hardware components are supported.  For example, Intel's x86 processor architecture is the standard architecture used by most PCs.  By using this design, computer manufacturers can create machines that include different hardware components, but run the same software.  Several years ago, Apple switched from the PowerPC architecture to the x86 architecture to make the Macintosh platform more compatible with Windows PCs.\nThe architecture of the motherboard is also important in determining what hardware and software a computer system will support.  The motherboard design is often called the \"chipset\" and defines what processor models and other components will work with the motherboard.  For example, while two motherboards may both support x86 processors, one may only work with newer processor models.  A newer chipset may also require faster RAM and a different type of video card than an older model.\nNOTE: Most modern computers have 64-bit processors and chipsets, while earlier computers used a 32-bit architecture.  A computer with a 64-bit chipset supports far more memory than one with a 32-bit chipset and can run software designed specifically for 64-bit processors."
        ]
    },
    {
        "word": "Archive",
        "type": [],
        "definition": [
            "An archive is a single file that contains multiple files and\/or folders.  Archives may be created by several different file archiving utilities and can be saved in one of several different formats.  They may also be compressed to reduce the file size or encrypted for security purposes.  The term \"archive\" can also be used as a verb, which refers to the process of creating an archive.\nArchives are useful for consolidating multiple files and folders into a single file.  They are commonly used for backing up data and transferring multiple files between users.  For example, a Web developer may save all the HTML, CSS, and image files for a website in a single archive to share with a graphic designer.  By consolidating all the files in an archive, the developer only needs to send one file to the designer.  If the archive is compressed, it will also take less time to transfer online.\nIn order to open the files in an archive, they must first be extracted from the archive.  Compressed archives must also be decompressed before the files can be extracted.  Both of these processes can be performed using a compatible file decompression utility, such as WinZip, StuffIt Expander, WinRAR, or 7-Zip.  These programs support multiple standard archive formats, as well as their own proprietary compressed file types.\nSome common archive formats include Zip files, StuffIt archives, and TAR files.  Zip files use a standard archive format that is supported by several file decompression programs.  StuffIt archives are saved in a proprietary format that can only be opened using StuffIt Expander on Macintosh and Windows systems.  TAR files are uncompressed archives that are typically created on Unix systems.\nFile Extensions: .ZIP, .ZIPX .SIT, .SITX, .TAR, .TGZ, .RAR"
        ]
    },
    {
        "word": "Archive Bit",
        "type": [],
        "definition": [
            "An archive bit is a single bit within a file that indicates whether the file has been backed up or not.  A value of 0 indicates the current version of the file has been backed up, while a 1 indicates it has not.  Various backup utilities use the archive bit to determine which files to back up and which files to skip.\nThe archive bit is a file attribute supported by several operating systems, including Windows and OS\/2.  It is typically not visible to the user but is part of the file's metadata.  Setting the archive bit modifies the file itself, so the feature cannot be used on operating systems such as macOS and Unix.  These operating systems use file timestamps to track the last modified dates of files and compare them with the last backup time to determine what files need to be backed up.\nWhile the archive bit provides an easy way to label files for backup, it is not always accurate.  For example, if more than one backup program is running on a computer, the archive bit may be turned off by one program when it has not been backed up by another one.  For this reason, many modern programs use their own backup system, such as a journal of backed up files.  Advanced backup systems may also support incremental backups, which back up multiple versions of a file over time.\nNOTE: Since archive bits are used exclusively for backup purposes, they are sometimes called \"backup bits.\""
        ]
    },
    {
        "word": "Array",
        "type": [],
        "definition": [
            "An array is a data structure that contains a group of elements.  Typically these elements are all of the same data type, such as an integer or string.  Arrays are commonly used in computer programs to organize data so that a related set of values can be easily sorted or searched.\nFor example, a search engine may use an array to store Web pages found in a search performed by the user.  When displaying the results, the program will output one element of the array at a time.  This may be done for a specified number of values or until all the values stored in the array have been output.  While the program could create a new variable for each result found, storing the results in an array is much more efficient way to manage memory.\nThe syntax for storing and displaying the values in an array typically looks something like this:\n\narrayname[0] = \"This \";\narrayname[1] = \"is \";\narrayname[2] = \"pretty simple.\";\nprint arrayname[0];\nprint arrayname[1];\nprint arrayname[2];\n\n\nThe above commands would print the first three values of the array, or \"This is pretty simple.\"  By using a \"while\" or \"for\" loop, the programmer can tell the program to output each value in the array until the last value has been reached.  So not only do arrays help manage memory more efficiently, they make the programmer's job more efficient as well."
        ]
    },
    {
        "word": "Artificial Intelligence",
        "type": [],
        "definition": [
            "Artificial Intelligence, or AI, is the ability of a computer to act like a human being.  It has several applications, including software simulations and robotics.  However, artificial intelligence is most commonly used in video games, where the computer is made to act as another player.\nNearly all video games include some level of artificial intelligence.  The most basic type of AI produces characters that move in standard formations and perform predictable actions.  More advanced artificial intelligence enables computer characters to act unpredictably and make different decisions based on a player's actions.  For example, in a first-person shooter (FPS), an AI opponent may hide behind a wall while the player is facing him.  When the player turns away, the AI opponent may attack.  In modern video games, multiple AI opponents can even work together, making the gameplay even more challenging.\nArtificial intelligence is used in a wide range of video games, including board games, side-scrollers, and 3D action games.  AI also plays a large role in sports games, such as football, soccer, and basketball games.  Since the competition is only as good as the computer's artificial intelligence, the AI is a crucial aspect of a game's playability.  Games that lack a sophisticated and dynamic AI are easy to beat and therefore are less fun to play.  If the artificial intelligence is too good, a game might be impossible to beat, which would be discouraging for players.  Therefore, video game developers often spend a long time creating the perfect balance of artificial intelligence to make the games both challenging and fun to play.  Most games also include different difficulty levels, such as Easy, Medium, and Hard, which allows players to select an appropriate level of artificial intelligence to play against."
        ]
    },
    {
        "word": "Aspect Ratio",
        "type": [],
        "definition": [
            "An aspect ratio describes the relationship of an object's width to its height.  It is commonly used in computing to describe the proportions of a rectangular screen.\nAspect ratios are written as mathematical expressions, using the following format:\nwidth:height\nFor instance, a monitor that is 20 inches wide by 15 inches tall has an aspect ratio of 20:15.  After reducing the fraction (dividing each number by the lowest common denominator – in this case, 5), the aspect ratio is 4:3, or \"four by three.\"  4:3 was the aspect ratio used by standard definition (SD) televisions, before HDTV.\nA square screen or image has an aspect ratio of 1:1.  A screen that is twice as tall as it is wide has an aspect ratio of 1:2.  If a screen 50% wider than it is tall, its aspect ratio is 3:2.  Both HDTVs and 4K televisions have aspect ratios of 16:9 (\"sixteen by nine\"), meaning they are almost twice as wide as they are tall.  An HDTV, for example, has a resolution of 1920x1080 pixels.  The 16:9 aspect ratio of HD resolution can be verified using the math below.\n1920 ÷ 16 = 120.  120 x 9 = 1080.\nAlternatively, 1920 ÷ 120 = 16.  1080 ÷ 120 = 9.\n4K is simply twice the width and height of HD, or 3840x 2160.  Therefore, 3840 ÷ 240 = 16.  2160 ÷ 240 = 9.\nWhile most modern televisions have 16:9 aspect ratios, other types of screens may be longer or taller.  For example, many tablets and computer monitors have 16x10 (or 8x5) aspect ratios, which means they are slightly taller relative to a standard HD display.  Smartphones often have extra long screens when held sideways (a.k.a. landscape view).  For example, the Samsung Galaxy S8 has an aspect ratio of 18.5:9 and the iPhone X has an aspect ratio of 19.5:9.  When watching HD video on these devices, the video does not fit the full width of the screen.  Instead, black bars are displayed on the sides because the aspect ratio of the video is not as wide as the aspect ratio of the screen.\nNOTE: HD (16:9) is 25% wider than SD (4:3 or 12:9).  That is why modern flatscreen displays appear wider than older CRT televisions."
        ]
    },
    {
        "word": "Assembler",
        "type": [],
        "definition": [
            "An assembler is a program that converts assembly language into machine code.  It takes the basic commands and operations from assembly code and converts them into binary code that can be recognized by a specific type of processor.\nAssemblers are similar to compilers in that they produce executable code.  However, assemblers are more simplistic since they only convert low-level code (assembly language) to machine code.  Since each assembly language is designed for a specific processor, assembling a program is performed using a simple one-to-one mapping from assembly code to machine code.  Compilers, on the other hand, must convert generic high-level source code into machine code for a specific processor.\nMost programs are written in high-level programming languages and are compiled directly to machine code using a compiler.  However, in some cases, assembly code may be used to customize functions and ensure they perform in a specific way.  Therefore, IDEs often include assemblers so they can build programs from both high and low-level languages."
        ]
    },
    {
        "word": "Assembly Language",
        "type": [],
        "definition": [
            "An assembly language is a low-level programming language designed for a specific type of processor.  It may be produced by compiling source code from a high-level programming language (such as C\/C++) but can also be written from scratch.  Assembly code can be converted to machine code using an assembler.\nSince most compilers convert source code directly to machine code, software developers often create programs without using assembly language.  However, in some cases, assembly code can be used to fine-tune a program.  For example, a programmer may write a specific process in assembly language to make sure it functions as efficiently as possible.\nWhile assembly languages differ between processor architectures, they often include similar instructions and operators.  Below are some examples of instructions supported by x86 processors.\n\nMOV - move data from one location to another\nADD - add two values\nSUB - subtract a value from another value\nPUSH - push data onto a stack\nPOP - pop data from a stack\nJMP - jump to another location\nINT - interrupt a process\n\nThe following assembly language can be used to add the numbers 3 and 4:\nmov eax, 3 - loads 3 into the register \"eax\"\nmov ebx, 4 - loads 4 into the register \"ebx\"\nadd eax, ebx, ecx - adds \"eax\" and \"ebx\" and stores the result (7) in \"ecx\"\nWriting assembly language is a tedious process since each operation must be performed at a very basic level.  While it may not be necessary to use assembly code to create a computer program, learning assembly language is often part of a Computer Science curriculum since it provides useful insight into the way processors work."
        ]
    },
    {
        "word": "Assistive Technology",
        "type": [],
        "definition": [
            "Assistive technology refers to hardware and software designed to help people with disabilities.  Some types of assistive technology provide physical assistance, while others provide helpful aids for individuals with learning disabilities.\nExamples of common assistive devices include hearing aids, wheelchairs, and prosthetics.  Hearing aids amplify sound, helping individuals who have difficulty hearing.  Modern hearing aids even filter out background noise and clarify speech, making conversation easier.  Wheelchairs provide mobility for individuals who are unable to walk.  Motorized wheelchairs provide a means of transportation for people with limited upper body function.  Prosthetics can replace missing body limbs, such as arms or legs.  Some modern prosthetics even allow people to control appendages, such as the fingers on a prosthetic hand.\nSoftware designed to help individuals with physical limitations is often called \"Accessibility\" software.  Popular operating systems, such as Windows, OS X, and iOS include several accessibility features.  Some examples include:\n\nText to Speech - A computer can speak text for people with visual impairments.  It also provides a way for mute individuals to communicate with others.\nSpeech to Text - Also called dictation, this feature translates spoken words into text for people who have difficulty using a keyboard.  Some operating systems allow users to speak common commands such as opening or quitting programs.\nVoiceover - Some operating systems can speak descriptions of items when the user selects them or moves the cursor over them.\nScreen Zoom - Keyboard shortcuts can be used to zoom into different areas of the screen, increasing the size of text and images.\nDisplay Enhancements - Inverting colors and increasing contrast can make it easier for individuals with limited vision to see the screen.\n\nAssistive software may also be designed for educational purposes.  For example, a specialized reading program may help students with dyslexia.  Math tutor programs can provide a way for students to learn mathematical concepts at a comfortable pace.  Memory applications can help individuals with brain injuries restore their memorization capabilities.\nNOTE: While not designed as assistive technology, touchscreen devices such as tablets are commonly used as assistive devices since they provide a natural user interface."
        ]
    },
    {
        "word": "Attachment",
        "type": [],
        "definition": [
            "An attachment, or email attachment, is a file sent with an email message.  It may be an image, video, text document, or any other type of file.\nMost email clients and webmail systems allow you to send and receive attachments.  To send an attachment along with your email, you can use the \"Attach\" command, then browse to the file you want to attach.  In some email interfaces, you can simply drag a file into the message window to attach it.  When you receive an attachment, most email programs allow you to \b\u0006view the attachment in place or save it to your local storage device.\nWhile modern email programs make it easy to send and receive attachments, the original email system (SMTP) was actually not designed to handle binary files.  Therefore, attachments must be encoded as text in order to be transferred with an email message.  The most common encoding type is MIME (Multi-Purpose Internet Mail Extensions).  While MIME encoding makes it possible to send messages with emails, it typically increases the file size of the attachment about 30%.  That's why when you attach a file to an email message, the file size of the attachment appears larger than the original file.\nYou can attach multiple files to a single email message.  However, the maximum size of the combined attachments is limited by the sending and receiving mail servers.  In other words, the size of the attachment(s) after being encoded cannot be larger than the limit of either the outgoing or incoming mail server.  In the early days of email, attachments were limited to one megabyte (1 MB).  Today, many mail servers allow attachments larger than 20 MB.  However, to protect against viruses and malware, many mail servers will not accept executable file types, such as .EXE or .PIF files.  If you need to send an executable file to someone, you can compress the file as a .ZIP archive before attaching it to the email message.\nNOTE: Even a large amount of text takes up a small amount of space compared to most binary files.  Therefore, attaching a document to an email may increase the size substantially.  For example, a typical email may only require one kilobyte (1 KB) of disk space.  Attaching a single 1 MB file will make the message 1,000 times larger.  Therefore, it is best to share large files using another method like FTP or DropBox.  Additionally, if you have almost reached your email quota on your mail server, you can free up a lot of space by deleting old attachments."
        ]
    },
    {
        "word": "Augmented Reality",
        "type": [],
        "definition": [
            "Augmented reality, commonly abbreviated \"AR,\" is computer-generated content overlaid on a real world environment.  AR hardware comes in many forms, including devices that you can carry, such as handheld displays, and devices you wear, such as headsets, and glasses.  Common applications of AR technology include video games, television, and personal navigation, though there are many other uses as well.\nPokémon Go is a popular video game that uses augmented reality.  The app, which runs on iOS and Android devices, uses your smartphone's GPS signal to detect your location.  As you walk around, your avatar is overlaid on a real-world map, along with in-game content, such as Pokéstops, gyms, and Pokemon that appear.  When you attempt to catch a Pokémon, it shows up with a real-word background created by your smartphone's camera.  The camera can be turned on or off using the \"AR\" toggle switch.\nAugmented reality is also used in television, especially in sports.  For example, golf broadcasts sometimes display a line on the screen that tracks the flight of the ball.  NFL games display a first down line overlaid on the field.  Major league baseball games often display dynamically generated ads behind home plate.  In olympic races, a world record (WR) line is displayed during some races to show how close an athlete is to a record time.\nIn navigation, AR is used to display location information in real-time.  This is typically done through a heads-up display (HUD) that projects images in front of you like a hologram.  For instance, HUD in an automobile might display your speed, engine RPMs, and other useful data.  Google Glass, a head-mounted display, can overlay directions from Google Maps and identify locations using the built-in camera.\nAR vs VR\nWhile augmented reality and virtual reality share some things in common, they are two different technologies.  AR augments reality, but doesn't replace it.  VR completely replaces your surroundings with a virtual environment.  Therefore, any hardware that combines digital content with your actual surroundings is an AR device.  Hardware that operates independently from your location and encompasses your vision is a VR device."
        ]
    },
    {
        "word": "Authentication",
        "type": [],
        "definition": [
            "In computing, authentication is the process of verifying the identity of a person or device.  A common example is entering a username and password when you log in to a website.  Entering the correct login information lets the website know 1) who you are and 2) that it is actually you accessing the website.\nWhile a username\/password combination is a common way to authenticate your identity, many other types of authentication exist.  For example, you might use a four or six-digit passcode to unlock your phone.  A single password may be required to log on to your laptop or work computer.  Every time you check or send email, the mail server verifies your identity by matching your email address with the correct password.  This information is often saved by your web browser or email program so you do not have to enter it each time.\nBiometrics may also be used for authentication.  For example, many smartphones have a fingerprint sensor that allows you to unlock your phone with a simple tap of your thumb or finger.  Some facilities have retinal scanners, which require an eye scan to allow authorized individuals to access secure areas.  Apple's Face ID (introduced with the iPhone X) authenticates users by facial recognition.\nTwo-Factor Authentication\nAuthentication is a part of everyday life in the digital age.  While it helps keep your personal information private, it is not foolproof.  For example, if someone knows your email address, he or she could gain access to your account by simply guessing your password.  This is why it is important to use uncommon, hard-to-guess passwords, especially for your email accounts.  It is also a good idea to use two-factor authentication when available, as this provides an extra security check when accessing your account.\nTwo-factor authentication (also \"2FA\") typically requires a correct login plus another verification check.  For example, if you enable 2FA for your online bank account, you may be required to enter a temporary code sent to your phone or email address to complete the login process.  This ensures that only you (or someone with access to your phone or email account) can access your account, even after entering the correct login information.\nNOTE: In many cases, you can select the \"Remember Me\" checkbox when logging in to a secure website.  This will store a cookie on your device (computer, phone, tablet, etc.), which indicates the device is trusted, or previously authenticated, for that website.  The cookie may keep you logged in over multiple browser sessions or may prevent the need for two-factor authentication when using that device in the future."
        ]
    },
    {
        "word": "Autocomplete",
        "type": [],
        "definition": [
            "Autocomplete, also known as autosuggest or search suggest, is a feature that provides predictions as you type in a text box.  It is commonly associated with search engines, though it may be used for other purposes as well.\nOne of the most common places you will see autocomplete is in the address bar of your web browser.  Since most browsers allow you to perform searches directly from the address bar, you will likely see search suggestions appear as you begin typing.  However, since you can also type URLs in the address bar, your browser may also suggest webpages from your browsing history or bookmarks, or other popular websites.\nIf you visit a search engine website, like Google or Bing, you'll most likely be presented with a list of search suggestions immediately as you start typing in the search box.  These suggestions come primarily from a history of aggregate users searches recorded by the search engine.  However modern autocomplete algorithms may use other information as well.  For example, a search engine may use your location to provide relevant queries to your surroundings.  It may take into account the current time or day to provide suggestions relevant to the time of your search.  If you are logged in or allow cookies to store your browsing information, the search engine may use your browsing or search history to provide more targeted search suggestions.\nAutocomplete provides helpful search ideas, but it is also a time-saver.  You can simply click on the suggestion you want to use instead of typing the full search phrase.  You can also press the down arrow on your keyboard to scroll through the list of suggestions, then press Enter to choose one.  If you are using a mobile device, you can simply tap the suggestion you want to use.\nWhile autocomplete is a popular feature for web search, many other websites use it as well.  For example, websites like Amazon and Best Buy provide suggestions as you search, which are relevant to your browsing or purchase history.  Even this website, TechTerms.com, uses autocomplete to provide a list of commonly searched tech terms as you type.  You can try it for yourself by typing in the search field at the top of the page!\nNOTE: The boxes that display word suggestions as you type in Android and iOS are similar to autocomplete, but they are used for more general purposes, such as texting and composing documents.  In Android, this feature is called predictive text, while in iOS, it is called QuickType."
        ]
    },
    {
        "word": "Autocorrect",
        "type": [],
        "definition": [
            "Autocorrect is a software feature that corrects misspellings as you type.  It is integrated into mobile operating systems like Android and iOS and is therefore a standard feature on most smartphones and tablets.  It is also supported by modern desktop operating systems, such as Windows and macOS.\nAutocorrect makes it easier to type words on a mobile device with a touchscreens.  Since these devices often have tiny onscreen keyboards, it is easy to make mistakes as you type.  Autocorrect can fix these mistakes on the fly, helping you type faster without having to go back and correct your typos.  Each autocorrect algorithm is different, but the goal is the same — to replace misspellings with what you intended to type.  In some cases, the algorithm may simply match the closest word (such as replacing  \"mispeling\" with \"misspelling\").  In other cases, it may use guess what letter(s) you intended to type based on nearby keys on the keyboard.  For example, when you are typing a text message, your phone might replace \"see you latet\" with \"see you later.\"\nWhile autocorrect is often associated with mobile devices, it is also found in modern desktop operating systems.  Since the technology is included at the OS level, most applications, such as text editors and word processors include autocorrect support.  While the algorithm on a desktop computer may be different than the one a smartphone, they both work to correct errors as you type.\nAutocorrect can improve your typing efficiency and has the added benefit of teaching you the correct spellings of words that you spell incorrectly.\nMost of the time, autocorrect fixes legitimate errors.  However, sometimes it may try to spell a word differently than you would like.  Before your device autocorrects the text, it will usually display the suggested replacement.  If you prefer to use your own spelling, you can click the \"x\" next to the suggestion to prevent the autocorrection of the word.  Otherwise autocorrect will override your version when you press space bar, Enter, or a punctuation mark.\nIf you prefer not to be autocorrected all, you can turn off the autocorrect feature in your device settings.  Below are a few examples:\n\nWindows 10 - Settings &rarr; Devices &rarr; Typing &rarr; Spelling &rarr; Turn off \"Autocorrect misspelled words\"\nmacOS - System Preferences &rarr; Keyboard &rarr; Text &rarr; Uncheck \"Correct spelling automatically\"\niOS - Settings &rarr; General &rarr; Keyboards &rarr; Turn off \"Auto-Correction\"\nAndroid - Settings &rarr; Language & input &rarr; Google Keyboard &rarr; Text-correction &rarr; Turn off \"Auto-correction\"\n"
        ]
    },
    {
        "word": "Autofill",
        "type": [],
        "definition": [
            "Autofill is a software function that automatically enters data in web forms and spreadsheets.  It should not be confused with autocomplete or autocorrect, which perform separate functions.  Autocomplete finishes words or phrases while typing, and autocorrect automatically fixes spelling mistakes.\nWhile both web browsers and spreadsheet applications support autofill, the functionality is different.  Below is an explanation of how autofill works in each type of application.\nWeb Browser Autofill\nAny time you enter information on a website, you fill out a form.  Some forms, such as login forms, only have two fields (for a username and password).  Others have several fields that you must complete before submitting the form.\nMost online registration and purchase forms require standard information, such as your name, email address, phone number, and home address.  Autofill saves this information in your browser and allows you to fill in common form fields with a single click.\nAutofill can also save other types of information, such as website logins and credit card numbers.  Most browsers securely store usernames and passwords for different websites.  Once your login information has been saved, you can use autofill to fill in the username and password fields with a single click.\nSpreadsheet Autofill\nAutofill in spreadsheet applications, such as Microsoft Excel, provides an easy way to fill in empty cells.  After entering information in one or two cells, you can drag the fill handle (the small box in the lower-right corner of the current selection) across multiple cells to automatically fill them in with similar data.  Autofill can be used for both rows (horizontally) and columns (vertically).\nFor example, if you enter \"1\" in cell A1, then drag the fill handle downwards, autofill will automatically fill in the selected cells with the number 1.  If you enter  \"1\" in A1 and \"2\" in A2, then select both A1 and A2, then drag the fill handle downwards, it will increment the values in the cells.  A3 will become \"3,\" A4 will become \"4,\" etc.  If you enter \"2\" in A1 and \"4\" in A2, the values will increment by two.  For example, A3 will become \"6,\" A4 will become \"8,\" etc.\nAutofill can detect several different patterns, which can save time when creating new spreadsheets.  For example, if you need to enter years as rows and months as column headers, you can use autofill to complete most of the cells.  Simply type the first year, e.g., \"2001,\" in the first cell, followed by \"2002\" below it.  Select the two cells, then drag the fill handle downwards to add as many years as you want.  To enter months, type \"January\" in one cell, followed by \"February\" in the cell next to it.  Then select both cells and drag the fill handle to the right to fill in all twelve months.  Most spreadsheet applications will wrap from December to January if you continue dragging to the right.\nNOTE: Autofill is also called \"AutoFill\" in Apple Safari and \"Auto Fill\" in some versions of Microsoft Excel.\n"
        ]
    },
    {
        "word": "Autoresponder",
        "type": [],
        "definition": [
            "An autoresponder is a script that automatically replies to emails sent to a specific email address.  It may be used for away messages, email confirmations, or for several other purposes.\nAutoresponders can be configured on a mail server or using an email client.  When configured on a mail server, the server automatically sends response emails while the autoresponder is active.  Server-based autoresponders are often configured using a webmail interface.  For example, Gmail provides a \"vacation reply\" for this purpose.  They can also be created by a server administrator for one or more email addresses.  cPanel, a popular web hosting platform for Linux, allows admins to manage autoresponders by logging into the control panel for a specific account and selecting Email &rarr; Autoresponders.\nTo set up an autoresponder using a mail client, you typically create a \"rule.\"  For example, you can add a rule that automatically replies to messages sent to a specific email address.  This type of rule works well once it has been configured, but the mail client must be open in order for the autoresponder to work.  If you set up a vacation reply in your mail program on your home computer, then turn off your computer before you leave, the autoresponder will not work.\nWhen setting up an auto-reply on a server, you may be able to enter a date range for when it is active.  If the autoresponder does not turn off automatically, it is a good idea to set a reminder for yourself to turn it off when you return.\nNOTE: Email \"bounce\" messages are sent automatically, but are not considered autoresponders since they are not configured by users."
        ]
    },
    {
        "word": "Avatar",
        "type": [],
        "definition": [
            "Generally speaking, an avatar is the embodiment of a person or idea.  However, in the computer world, an avatar specifically refers to a character that represents an online user.  Avatars are commonly used in multiplayer gaming, online communities, and web forums.\nOnline multiplayer role-playing games (MMORPGs) such as World of Warcraft and EverQuest allow users to create custom characters.  These characters serve as the players' avatars.  For example, a World of Warcraft player may choose a Paladin with blue armor as his avatar.  As the player progresses in the game, his character may gain items and experience, which allows the avatar to evolve over time.\nAvatars are also used in online communities, such as Second Life and The Sims Online.  These avatars can be custom-designed to create a truly unique appearance for each player. Once a user has created an avatar, he or she becomes part of an online community filled with other users' avatars.  Players can interact with other avatars and talk to them using text or voice chat.  It's no surprise that \"Second Life\" refers to a virtual life that players live through their avatars.\nFinally, avatars are common in web forums.  Online discussion boards typically require users to register and provide information about themselves.  Many give users the option to select an image file that represents the user's persona.  This image, combined with a made-up username, serves as a person's avatar.  For example, a user may select a picture of a Pac-Man and choose the name \"pac32\" for his avatar.  This avatar typically appears next to each posting the user contributes in an online forum.\nRegardless of the application, avatars allow people to represent themselves online in whatever way they want.  They may be considered alter-egos, since users can customize characters that are completely different than their actual personas.  Of course, what's the point of having a \"second life\" if it's the same as reality?"
        ]
    },
    {
        "word": "Azure",
        "type": [],
        "definition": [
            "Azure is a cloud computing platform built and operated by Microsoft.  It allows companies to run applications and host content in the cloud.  While Microsoft designed Azure to support enterprise computing requirements, the service is also available to small businesses and individuals.\nThe Azure infrastructure consists of multiple data centers distributed around the world.  The global network of computers provides low latency and high reliability regardless of where users access the service.  Azure includes multiple types of servers, including Windows Server, Linux, and SAP HANA machines.\nBelow are a few examples of the 200+ Azure solutions:\n\nSaaS - running web applications and Internet-based services\nCDN - delivering websites and streaming content from edge nodes around the world\nE-commerce - providing customized shopping cart experiences localized for each visitor\nDatabase storage - enabling high-speed data storage and access\nSoftware testing - providing access to virtual machines that run different operating systems\n\nBecause of the benefits of a globally-distributed computing network, many businesses have moved locally-hosted data to a cloud service like Azure.  While migrating data and applications to Azure may require several steps, starting the process is simple.  Developers can sign up for an Azure account, create a new cloud computing \"instance,\" and start using the service immediately."
        ]
    }
]