[
    {
        "word": "BASIC",
        "type": [],
        "definition": [
            "Stands for \"Beginner's All-purpose Symbolic Instruction Code.\"  BASIC is a computer programming language that was developed in the mid-1960s to provide a way for students to write simple computer programs.  Since then, the language has evolved into a more robust and powerful language and can be used to create advanced programs for today's computer systems.\nBASIC originally used numbers at the beginning of each instruction (or line) to tell the computer what order to process the instructions.  Lines would be numbered as 10, 20, 30, etc., which would allow additional instructions to be placed between commands later on if needed.  \"GOTO\" statements enabled programs to loop back to earlier instructions during execution.  For example, line 230 of a BASIC program may have an \"if\" clause that tells the computer to jump back to line 50 if a variable is less than 10.  This instruction might look something like this:\n230 IF (N < 10) THEN GOTO 50\nMore modern BASIC implementations use \"while loops,\" which perform a series of instructions as long as a certain case is true.  Newer BASIC development software also supports more data types, such as integers, strings, and arrays, for storing variables and other data.  While the first BASIC development environments were strictly text-based, today's BASIC programming software allows developers to design much of their programs visually, using a graphical user interface.  Some of the more popular BASIC development programs used today include REALbasic and Microsoft Visual Basic."
        ]
    },
    {
        "word": "BGP",
        "type": [],
        "definition": [
            "Stands for \"Border Gateway Protocol.\"  BGP is a protocol used for routing data transmissions over the Internet.  It helps determine the most efficient path, whether sending data down the street or across the globe.\nBGP manages the flow of data similar to how the post office handles the delivery of physical mail.  For example, when a user in Los Angeles accesses a website in New York, BGP first routes the data from the New York-based server to the Internet backbone.  The data travels through large fiber optic cables across state lines, then through smaller networks until it arrives at the user's ISP in Los Angeles.  The ISP then routes the data locally to the user's device.\nEach router along the data transmission route is called a \"hop.\"  You can view the hops between your location and a server using a traceroute command, such as the ones below:Unix - traceroute techterms.comDOS -  tracert techterms.com\nFundamental to the Border Gateway Protocol are routing tables, which are plain text files that list available routers by IP address.  BGP routers use these tables to determine the best path for each data transmission.  Routing tables are frequently updated since the fastest route can change based on network traffic and outages.  High-traffic routers may request updates once a minute or even every few seconds.\nBenefits of BGP\n\nA standard means of communication between routers\nEfficient routing of data over the Internet\nAdaptability for network congestion\nRedundancy when network outages occur\nScalability to add or remove routers\nAutonomous operation\n\nNOTE: While BGP enables efficient routing of data across long distances, CDNs provide an even greater benefit by hosting data at \"edge nodes\" around the world."
        ]
    },
    {
        "word": "BIOS",
        "type": [],
        "definition": [
            "Stands for \"Basic Input\/Output System.\"  Most people don't need to ever mess with the BIOS on a computer, but it can be helpful to know what it is.  The BIOS is a program pre-installed on Windows-based computers (not on Macs) that the computer uses to start up.  The CPU accesses the BIOS even before the operating system is loaded.  The BIOS then checks all your hardware connections and locates all your devices. If everything is OK, the BIOS loads the operating system into the computer's memory and finishes the boot-up process.\nSince the BIOS manages the hard drives, it can't reside on one, and since it is available before the computer boots up, it can't live in the RAM.  So where can this amazing, yet elusive BIOS be found?  It is actually located in the ROM (Read-Only Memory) of the computer.  More specifically, it resides in an eraseable programmable read-only memory (EPROM) chip.  So, as soon as you turn your computer on, the CPU accesses the EPROM and gives control to the BIOS.\nThe BIOS also is used after the computer has booted up.  It acts as an intermediary between the CPU and the I\/O (input\/output) devices.  Because of the BIOS, your programs and your operating system don't have to know exact details (like hardware addresses) about the I\/O devices attached to your PC.  When device details change, only the BIOS needs to be updated.  You can make these changes by entering the BIOS when your system starts up.  To access the BIOS, hold down the DELETE or F2 key as soon as your computer begins to start up."
        ]
    },
    {
        "word": "BLE",
        "type": [],
        "definition": [
            "Stands for \"Bluetooth Low Energy.\"  BLE (also \"Bluetooth LE\") is a variation of the Bluetooth wireless standard designed for low power consumption.  It was introduced by the Bluetooth Special Interest Group (Bluetooth SIG) in December 2009 as part of the Bluetooth 4.0 specification.\nSome Bluetooth applications, such as audio streaming and data transfers, require a strong consistent signal and large bandwidth.  Other applications do not need a strong signal and require less electrical power.   BLE is was developed for these types of applications.  Examples include:\n\nwearable devices, such as fitness trackers\nsmart home appliances\nproximity sensors\n\nA proximity sensor, such as a Google Beacon or Apple iBeacon, only needs to transmit a small signal every second or so to detect nearby Bluetooth devices.  This requires significantly less power than streaming high-fidelity stereo audio to a Bluetooth speaker or headset.  Developers can use BLE-specific communication in their apps to significantly reduce the electrical power used by a smartphone, smartwatch, or other device.\nBLE Advantages\nThe primary advantage of BLE compared to \"Classic Bluetooth\" is lower power consumption, which translates to longer battery life.  For example, BLE can run for multiple years on a single coin-cell battery, such as a CR2032 battery used in wristwatches.  Bluetooth LE can also communicate over a longer range than the 100-meter distance Classic Bluetooth supports.  It also supports fast connection setup with a latency of 3 ms compared to the 100 ms latency of Classic Bluetooth.\nNOTE: BLE is supported by all Bluetooth 4.0 devices as long as the device software also supports it."
        ]
    },
    {
        "word": "BMP",
        "type": [],
        "definition": [
            "Short for \"Bitmap.\"  It can be pronounced as \"bump,\" \"B-M-P,\" or simply a \"bitmap image.\"  The BMP format is a commonly used raster graphic format for saving image files.  It was introduced on the Windows platform, but is now recognized by many programs on both Macs and PCs.\nThe BMP format stores color data for each pixel in the image without any compression.  For example, a 10x10 pixel BMP image will include color data for 100 pixels.  This method of storing image information allows for crisp, high-quality graphics, but also produces large file sizes.  The JPEG and GIF formats are also bitmaps, but use image compression algorithms that can significantly decrease their file size.  For this reason, JPEG and GIF images are used on the Web, while BMP images are often used for printable images.\nFile Extension: .BMP"
        ]
    },
    {
        "word": "BSOD",
        "type": [],
        "definition": [
            "Stands for \"Blue Screen of Death.\"  The BSOD is an error message displayed by Windows when a non-recoverable error occurs.  The \"blue screen\" refers to the blue background color that fills the entire screen behind the error message.  It is called the \"blue screen of death\" because it is displayed when the computer has encountered a \"fatal error\" and must be restarted.\nTechnically, the BSOD is caused by a Windows STOP error.  STOP errors are critical system-level errors that cause the computer to stop responding in order to prevent data corruption or damage to the hardware.  Several different problems can cause a STOP error, including kernel crashes, boot loader errors, driver malfunctions, and hardware faults.  When a STOP error occurs, the BSOD is displayed, along with a message that provides information about the specific error that has occurred.\nThe good news is that the BSOD protects your data and prevents damage to your PC.  The bad news is that it halts the entire system, which may cause you to lose unsaved files that you were currently working on.  In some cases, the BSOD will produce a \"memory dump\" of the current data stored in RAM, which is saved to the primary storage device.  This dump can be opened and analyzed after the computer is restarted, though it is often difficult to extract usable data from this file.  Your best chance of recovering work after a BSOD is if the application you were using includes an \"autosave\" feature that saves a temporary version of your work at regular intervals.  If your computer crashes while you are working, the program should automatically open the temporary file the next time you launch the program.\nNOTE: In Windows 8, the blue screen of death has a softer \"aqua\" blue background and often provides more readable error messages than in previous versions of Windows.  However, the computer still must be restarted when the BSOD is displayed."
        ]
    },
    {
        "word": "Backbone",
        "type": [],
        "definition": [
            "Just like the human backbone carries signals to many smaller nerves in the body, a network backbone carries data to smaller lines of transmission.  A local backbone refers to the main network lines that connect several local area networks (LANs) together.  The result is a wide area network (WAN) linked by a backbone connection.\nThe Internet, which is the ultimate wide area network, relies on a backbone to carry data over long distances.  The Internet backbone consists of several ultra-high bandwidth connections that link together many different nodes around the world.  These nodes route incoming data to smaller networks in the local region.  The fewer \"hops\" your data needs to make before reaching the backbone, the faster it will get sent to the destination.  This is why many Web hosts and ISPs have direct connections to the Internet backbone."
        ]
    },
    {
        "word": "Backdoor",
        "type": [],
        "definition": [
            "A backdoor is a security vulnerability in a computer system, such as a web server or home PC.  It is a hidden way to access a system that bypasses typical authentication methods.  The term may be used as a noun or an adjective, such as \"backdoor hack\" or \"backdoor access.\"\nSecurity holes can exist in operating systems and individual applications.  Operating system vulnerabilities are the most serious because once a hacker gains system-level access, he may have full access to all programs and data on the system.  Application security holes are also serious since they may allow hackers to view or alter data on a computer and may more difficult to detect.\nExamples of malware that may facilitate backdoor access include:\n\nViruses\nRootkits\nTrojans\nSpyware\n\nIn some cases, backdoor hacks are immediately apparent since they affect the functionality of the system.  In other cases, they may go undetected for hours, days, or even months.  Long-term access is especially problematic since it provides hackers extra time to access, alter, and download data.  For this reason, servers often have monitoring software that checks for unrecognized processes running on the system.  Most antivirus software runs similar security checks.\nBackdoor Attacks vs Other Cyberattacks\nA backdoor attack is the opposite of a brute force attack, which attempts to gain access to a system through the standard login interface.  Backdoor access bypasses the typical username and password authentication and gains access to the underlying system.\nViruses and other malware are not considered backdoor hacks, but instead, they facilitate backdoor access.  For example, a malware program may install a script that provides a hacker with admin access to the system, even after the malware has been removed.  Hackers can also gain backdoor access through a command-line interface, using SSH or other text-based commands."
        ]
    },
    {
        "word": "Backend",
        "type": [],
        "definition": [
            "In the computer world, the \"backend\" refers to any part of a website or software program that users do not see.  It contrasts with the frontend, which refers to a program's or website's user interface.  In programming terminology, the backend is the \"data access layer,\" while the frontend is the \"presentation layer.\"\nMost modern websites are dynamic, meaning webpage content is generated on-the-fly.  A dynamic page contains one or more scripts that run on the web server each time the page is accessed.  These scripts generate the content of the page, which is sent to the user's web browser.  Everything that happens before the page is displayed in a web browser is part of the backend.\nExamples of backend processes include:\n\nprocessing an incoming webpage request\nrunning a script (PHP, ASP, JSP, etc.) to generate HTML\naccessing data, such as an article, from a database using an SQL queries\nstoring or updating records in a database\nencrypting and decrypting data\nhandling file uploads and downloads\nprocessing user input via JavaScript\n\nAll of the examples above, besides the last one, are server-side processes that run on the web server.  JavaScript is a client-side process, meaning it runs in the web browser.  JavaScript may be considered a backend or a frontend process, depending on if the code affects the user interface or not.\nThe backend and frontend work together to create the full user experience.  Data generated in the backend is passed to the frontend and presented to the user.  While some organizations have separate backend and frontend development teams, the line between the two layers is rarely black and white.  Therefore, many developers write code for both the backend and frontend.  This is known as full-stack development.\nNOTE: Backend may also be written \"back end\" (as a noun) or \"back-end\" (as an adjective).  For simplicity, \"backend\" (the closed compound word) has become an acceptable term for both."
        ]
    },
    {
        "word": "Backlink",
        "type": [],
        "definition": [
            "A backlink is an incoming link from an external website to specific webpage.  For example, if you publish a webpage and 20 other websites link to it, your webpage has 20 backlinks.  Links to the page from within your own website are not included in the backlink total.\nWeb developers benefit from backlinks (or \"inlinks\") in two different ways — direct traffic and search result placement.  As more links to a specific webpage are published on external sites, there is greater potential for traffic to be generated from other websites.  This is called direct traffic.  By increasing direct traffic, a website can gradually grow its presence on the Web and generate a steady stream of visitors from other websites.\nWhile direct traffic is helpful, most websites generate the majority of their traffic through search engines.  Since search engines use backlinks as an important part of the their algorithms for search result placement, external links are important for good search ranking.  Therefore, generating backlinks has become common practice for search engine optimization, or SEO.  The more backlinks a webpage has, the better the chance that the page will rank highly in search results for relevant keywords.  If a website has many pages that have backlinks, the overall number of incoming links may help increase the ranking of all pages within the website.  While most backlinks point to a website's home page, incoming links to other pages within the website are beneficial as well."
        ]
    },
    {
        "word": "Backside Bus",
        "type": [],
        "definition": [
            "There are two types of buses that carry data to and from a computer's CPU.  They are the frontside bus and backside bus.  Surprisingly, there is no correlation between these and the backside and frontside airs that snowboarders talk about.\nWhile the frontside bus carries data between the CPU and memory, the backside bus transfers data to and from the computer's secondary cache.  The secondary, or L2 cache stores frequently used functions and other data close to the processor.  This allows the computer's CPU to work more efficiently since it can repeat processes faster.\nWhen the processor needs information from the L2 cache, it is sent over the backside bus.  Because this process needs to be extremely fast, the clock speed of the backside bus cannot afford to lag behind.  For this reason, the backside bus is often as fast as the processor.  The frontside bus, on the other hand, is typically half the speed of the processor or slower."
        ]
    },
    {
        "word": "Backup",
        "type": [],
        "definition": [
            "Backup is the most important computer term you should know.\nA backup is a copy of one or more files created as an alternate in case the original data is lost or becomes unusable.  For example, you may save several copies of a research paper on your hard drive as backup files in case you decide to use a previous revision.  Better yet, you could save the backups to a USB flash disk, which would also protect the files if the hard drive failed.\nHard drives are meant to run for many years without crashing.  But just like all electronic devices, they are not immune to problems.  Because they are not solid state devices, hard drives rely on moving parts to access data, which can malfunction and cause your data to become unrecoverable.  If you need proof of how fragile hard drives really are, go to your local computer store and have someone show you an open hard drive.  When you realize all your data is stored in such a small, delicate device, you may have a new understanding of why you need to backup your data.\nBut it's not just hardware malfunctions you have to worry about.  Software corruption can also damage your files.  Directory structures can become damaged and cause entire folders to disappear.  Files can be mistakenly deleted or corrupted by viruses or other software attacks.  Program installation conflicts can make applications or files unusable.  There are unfortunately many ways for your data to become damaged or disappear.\nThat is why it is so important to backup your data.  Most people don't realize the importance of having a backup until it is too late.  Of course, when you have lost years of photos, school papers, business documents, e-mail archives, music, movies, or any other data that you cannot recover, the importance of having a backup becomes all too real.\nSo how do you backup your data?  The best way is to use an external storage device, such as an external hard drive, flash memory device, or even another computer.  You can also create permanent backups using optical media, such as CD-R and DVD-R discs.  Backing up individual folders and files is as easy copying them from the source media (your computer's hard disk) to the destination (an external hard drive).  If you want to backup your entire system or would like to have regular backups automatically performed, you can use backup software that will backup your data for you.  Many programs are available for both Mac and Windows that provide automatic backups and system restore capabilities.\nIf you have not yet backed up your hard drive, now is a good time to do so.  It's much better to back up your data now than once it is too late."
        ]
    },
    {
        "word": "Bandwidth",
        "type": [],
        "definition": [
            "Bandwidth describes the maximum data transfer rate of a network or Internet connection.  It measures how much data can be sent over a specific connection in a given amount of time.  For example, a gigabit Ethernet connection has a bandwidth of 1,000 Mbps (125 megabytes per second).  An Internet connection via cable modem may provide 25 Mbps of bandwidth.\nWhile bandwidth is used to describe network speeds, it does not measure how fast bits of data move from one location to another.  Since data packets travel over electronic or fiber optic cables, the speed of each bit transferred is negligible.   Instead, bandwidth measures how much data can flow through a specific connection at one time.\nWhen visualizing bandwidth, it may help to think of a network connection as a tube and each bit of data as a grain of sand.  If you pour a large amount of sand into a skinny tube, it will take a long time for the sand to flow through it.  If you pour the same amount of sand through a wide tube, the sand will finish flowing through the tube much faster.  Similarly, a download will finish much faster when you have a high-bandwidth connection rather than a low-bandwidth connection.\nData often flows over multiple network connections, which means the connection with the smallest bandwidth acts as a bottleneck.  Generally, the Internet backbone and connections between servers have the most bandwidth, so they rarely serve as bottlenecks.  Instead, the most common Internet bottleneck is your connection to your ISP.\nNOTE: Bandwidth also refers to a range of frequencies used to transmit a signal.  This type of bandwidth is measured in hertz and is often referenced in signal processing applications."
        ]
    },
    {
        "word": "Banner Ad",
        "type": [],
        "definition": [
            "Whether you like it or not, much of the Web is run by advertising.  Just like television or radio, websites can offer free content by generating revenue from advertising.  While you may get tired of Web ads from time to time, most people would agree that seeing a few advertisements here and there is better than paying a usage fee for each website.\nPerhaps the most prolific form of Web advertising is the banner ad.  It is a long, rectangular image that can be placed just about anywhere on a Web page.  Most banner ads are 468 pixels wide by 60 pixels high (468x60).  They may contain text, images, or sometimes those annoying animations that make it hard to focus on the page's content.  Regardless of the type of banner ad, when a user clicks the advertisement, he or she is redirected to the advertiser's website."
        ]
    },
    {
        "word": "BarCraft",
        "type": [],
        "definition": [
            "A BarCraft is an event in which people gather to watch live StarCraft 2 competitions.  Most BarCraft gatherings take place in sports bars, though the term can be used to describe any event in which a group of people watch StarCraft 2 together.\nStarCraft 2 (also \"SC2\") is a popular real-time strategy (RTS) game in which players choose to control one of three races.  When a game starts, each player begins with a base at a fixed location on a map.  Players then build structures, create units, and attempt to attack and defeat other players on the map. 1v1, 2v2, 3v3, 4v4, and FFA (free for all) games are possible, though 1v1 games are the most common.\nSince StarCraft 2 is one of the most popular eSports games, professional tournaments are held on a regular basis.  Most BarCrafts are organized around prominent StarCraft 2 tournaments, such as MLG, NASL, or GSL competitions.  These tournaments are streamed live over the Internet and often require a subscription to watch, similar to pay-per-view TV.  Venues that host BarCrafts typically cover the viewing fee, but may charge patrons an admittance fee to watch the games.  Most BarCraft venues stream the SC2 matches live on one or more screens."
        ]
    },
    {
        "word": "Bare Metal",
        "type": [],
        "definition": [
            "A bare metal system is a computer that does not include any software.  This means the user must install an operating system in order for the hardware to be functional.\nThe term \"bare metal\" is commonly used to refer to custom-built PCs and barebones systems.  These types of computers are ideal for PC enthusiasts, who may prefer to install their own software rather than paying extra for pre-loaded programs.  A bare metal system also allows advanced users to choose a non-mainstream OS, such as a specific Linux distribution.\nWeb hosting companies may also offer bare metal systems to clients who wish to customize their web server from the ground up.  For instance, a client may purchase a dedicated or co-located server with a specific hardware configuration.  The server administrator can then install a specific operating system and web server software on the computer.\nNOTE: Bare metal is sometimes used to refer to a \"bare metal restore,\" which refers to restoring a complete computer software configuration."
        ]
    },
    {
        "word": "Bare Metal Restore",
        "type": [],
        "definition": [
            "A bare metal restore is a type of computer restoration process that restores the full software configuration from a specific system.  It may be used to restore a computer system from a backup or simply migrate the software configuration from one machine to another.\nThe terms \"restore\" and \"bare metal restore\" are often used interchangeably, since they both refer to bringing a computer back to a specific state.  However, a bare metal restore is unique in that it can be used to restore a specific software configuration to a dissimilar hardware configuration.  For example, a bare metal restore may used to restore a Linux system to a new computer made by a different manufacturer.  I can also be used to restore a complete system to a new hard drive with different partition sizes.\nA bare metal restore is similar to a disk image restore, since both types of restores are used to rebuild a computer's software from scratch.  However, a disk image restore simply copies the data bit-for-bit to a specific storage device.  This may cause problems if the new hardware does not support certain configurations contained in the disk image.  Therefore, web hosting companies and network admins often create \"bare metal backups\" for their clients, which can be used to perform a bare metal restore."
        ]
    },
    {
        "word": "Barebones",
        "type": [],
        "definition": [
            "A barebones PC is a computer that has minimal components.  A typical barebones system includes a case, motherboard, CPU, hard drive, RAM, and power supply.  Most barebones systems are sold as kits, in which the components must be assembled by the user.\nSince barebones PCs usually do not come preassembled, they are not designed for the average computer user.  Instead, barebones kits are aimed at computer enthusiasts and users who prefer to build their own PCs.  By purchasing only specific components, a user can fully customize his computer system and avoid paying for unwanted extras.  For example, if you buy a barebones kit, you can choose your own keyboard and mouse, since they are not included.  Also, no software is bundled with barebones systems, so you avoid paying for software you don't need.  Additionally, most barebones systems do not come with an operating system, so you can choose to install any operating system that is compatible with the hardware.\nNearly all barebones PCs are desktop computers since they are the most customizable.  However, some companies also offer barebone laptop systems, or \"barebooks,\" which can be homebuilt.  While Macintosh computers now use most of the same components as PCs, the Mac OS X operating system requires proprietary hardware to run.  Therefore, barebones systems are generally built to run either Windows or Linux."
        ]
    },
    {
        "word": "Base Station",
        "type": [],
        "definition": [
            "The term \"base station\" was first used to refer to the towers you see on the side of the road that relay cell phone calls.  These stations handle all cellular calls made within their area, receiving information from one end of the call and transmitting it to the other.\nIn the computer world, however, a base station refers to the wireless access point for computers with wireless cards.  It is basically a router that communicates with devices based on the Wi-Fi standard.  Some common Wi-Fi configurations include 802.11b and 802.11g.  Wireless base stations are made by companies such as Netgear, Linksys, D-Link, Apple Computer, and other manufacturers.  Fortunately, as long as the hardware is based on the Wi-Fi standard, all wireless cards can communicate with base stations from any manufacturer."
        ]
    },
    {
        "word": "Baseband",
        "type": [],
        "definition": [
            "Baseband refers to the original frequency range of a transmission signal before it is converted, or modulated, to a different frequency range.  For example, an audio signal may have a baseband range from 20 to 20,000 hertz.  When it is transmitted on a radio frequency (RF), it is modulated to a much higher, inaudible, frequency range.\nSignal modulation is used for radio broadcasts, as well as several types of telecommunications, including cell phone conversations and satellite transmissions.  Therefore, most telecommunication protocols require original baseband signals to be modulated to a higher frequency before they are transmitted.  These signals are then demodulated at the destination, so the recipient receives the original baseband signal.  Dial-up modems are a good example of this process, since they modulate and demodulate signals when they are transmitted and received.  In fact, the word \"modem\" is short for modulator\/demodulator.\nWhile most protocols require the modulation of baseband signals, some can transmit in baseband without any signal conversion.  A common example is the Ethernet protocol, which transfers data using the original baseband signal.  In fact, the word \"BASE\" in \"10BASE-T,\" \"100BASE-T,\" and \"1000BASE-T\" Ethernet refers to baseband transmission.  These Ethernet protocols do not require signal modulation.  However, unlike broadband networks, baseband Ethernet networks are limited to single transmission channel."
        ]
    },
    {
        "word": "Bash",
        "type": [],
        "definition": [
            "Bash, though typically not capitalized, is an acronym for \"Bourne-Again Shell\" and is named after Stephen Bourne, the creator of the Unix shell \"sh.\"  It is a command language interpreter derived from sh that can execute commands entered at a command prompt and process text file input.\nBash (bash) supports all the commands of the original Bourne shell (sh), as well as many others.  It also includes features from the Korn shell (ksh) and C shell (csh), such as command line editing, command substitution syntax, and command history.  Bash also supports \"brace expansion,\" which is used to generate related text strings.  This operation provides an efficient way to search for filenames and rename multiple files.  Newer versions of Bash support regular expressions (Bash 3.0) and associative arrays (Bash 4.0).\nBash was originally developed by Brian Fox for the GNU Project and was released in 1989.  The bash shell was initially distributed with the GNU operating system and later became the default shell for multiple Linux distributions and Mac OS X.  Recent versions of Bash (versions 3 and 4) were developed by Chet Ramey and are currently published by the Free Software Foundation, the same organization that distributes the GNU operating system."
        ]
    },
    {
        "word": "Batch File",
        "type": [],
        "definition": [
            "A batch file is a type of script that contains a list of commands.  These commands are executed in sequence and can be used to automate processes.  For example, some programs may include a batch file that executes a number of commands as the program starts up.  A user can also create a custom batch file to automate tedious processes such as copying multiple directories or renaming several files at once.\nBatch files are run by the COMMAND.COM program, which is part of DOS and Windows.  Therefore, batch files can only be run within the Windows operating system.  Macintosh and Unix have other scripting tools, such as AppleScript and Unix shell commands, that can be used for similar tasks.  Because batch files contain executable commands, it is important not to open unknown batch files on your hard disk or in e-mail attachments.\nFile Extensions: .BAT, .CMD"
        ]
    },
    {
        "word": "Batch Process",
        "type": [],
        "definition": [
            "As most computer users know, some computing tasks can be tedious and repetitive.  Fortunately, if a task is indeed repetitive, a batch process can be used to automate much of the work.\nA batch process performs a list of commands in sequence.  It be run by a computer's operating system using a script or batch file, or may be executed within a program using a macro or internal scripting tool.  For example, an accountant may create a script to open several financial programs at once, saving him the hassle of opening each program individually.  This type of batch process would be executed by the operating system, such as Windows or the Mac OS.  A Photoshop user, on the other hand, might use a batch process to modify several images at one time.  For example, she might record an action within Photoshop that resizes and crops an image.  Once the action has been recorded, she can batch process a folder of images, which will perform the action on all the images in the folder.\nBatch processing can save time and energy by automating repetitive tasks.  While it may take awhile to write the script or record the repetitive actions, doing it once is certainly better than having to do it many times."
        ]
    },
    {
        "word": "Baud",
        "type": [],
        "definition": [
            "Baud, or baud rate, is used to describe the maximum oscillation rate of an electronic signal.  For example, if a signal changes (or could change) 1200 times in one second, it would be measured at 1200 baud.  While the term was originally used to measure the rate of electronic pulses, it has also become a way to measure data transmission speeds of dial-up modems.\nIf a modem transfers a single bit per electronic pulse, one baud would be equal to one bit per second (bps).  However, most modems transfer multiple bits per signal transition.  For example, a 28.8 Kbps modem may send nine bits per second.  Therefore, it would only require a baud rate of 2100 (28,800 \/ 9).  56K modems often use a baud rate of 8000.  This means they send seven bits per signal transition, since 7 x 8000 = 56,000.\nModems typically select the most efficient baud rate automatically (sometimes called the \"autobaud\" setting).  However, many dial-up modems allow you to override the default baud setting and manually enter the baud rate using a software interface.  This can be useful if a dial-up ISP requires a specific baud rate for communication.  However, reducing the baud rate of a modem may also reduce the maximum data transmission rate.\nBaud rates above 8000 are not very reliable on analog telephone lines, which is why most modems do not offer higher baud settings.  Additionally, at such a high baud rate, only seven bits can be sent consistently with each pulse, which is why dial-up modem speeds maxed out at 56 Kbps many years ago.  Fortunately, newer technologies such as DSL and cable modems offer much faster data transfer rates.  Since DSL and cable modems communicate over digital lines, baud rate is irrelevant to these devices."
        ]
    },
    {
        "word": "Bcc",
        "type": [],
        "definition": [
            "Stands for \"Blind Carbon Copy.\"  Bcc is an email field that allows you to \"blind\" copy one or more recipients.  It is similar to the Cc field, but email addresses listed in the Bcc field are hidden from all recipients.\nWhen you Bcc someone, that person receives a single copy of the email.  He or she will not receive any replies to the message.  Therefore, blind carbon copying is a useful way to share an email with one or more users who don't need to follow the email thread.\nIt is good netiquette to use the Bcc field when sending an email to a large group of people.  Hiding the recipient list protects users' privacy and prevents the email addresses from being shared unintentionally.  However, if recipients should know who else received the message, it is best to use the Cc field.\nTo vs. Cc vs. Bcc\nGenerally, you should use the To field for the primary recipient(s) — the people to whom the message is addressed.  Secondary recipients who should follow the email thread belong in the Cc field.  If you want to send a copy of the email to others for reference, the Bcc field makes sense.\nNOTE: Bcc'd recipients can still see the email addresses listed in the To and Cc fields."
        ]
    },
    {
        "word": "Bespoke",
        "type": [],
        "definition": [
            "The term \"bespoke\" comes from England where it originally referred to custom or tailor-made clothing.  In recent years, however, the term has been applied to information technology (IT), and refers to custom services or products.\nFor example, bespoke software is software customized for a specific purpose.  Bespoke programs may include custom accounting software for a certain company or a network monitoring tool for a specific network.  Because bespoke software is custom-made for a specific purpose, bespoke programs are also considered vertical market software.\nAnother area where bespoke is used in the computer industry is in reference to websites.  A bespoke website is one that is custom-built, often from scratch, to suit the needs of a business or organization.  This may include a custom layout, custom database integration, and other extra features the client may require.  Because bespoke websites must be individually tailored to a client's needs, they often take longer to develop and are more expensive than websites built from templates.\nFinally, bespoke can also be used to refer to hardware.  Computer companies, such as Dell, HP, and Apple may provide customers with custom options for the systems they buy.  For example, one person may choose to build his system with a high-end graphics card for video production, while another person may choose a basic graphics card, but may add additional RAM so her computer will be able to run several programs at once.  These custom configurations are sometimes referred to as bespoke systems."
        ]
    },
    {
        "word": "Beta Software",
        "type": [],
        "definition": [
            "Beta software refers to computer software that is undergoing testing and has not yet been officially released.  The beta phase follows the alpha phase, but precedes the final version.  Some beta software is only made available to a select number of users, while other beta programs are released to the general public.\nSoftware developers release beta versions of software in order to garner useful feedback before releasing the final version of a program.  They often provide web forums that allow beta testers to post their feedback and discuss their experience using the software.  Some beta software programs even have a built-in feedback feature that allows users to submit feature requests or bugs directly to the developer.\nIn most cases, a software developer will release multiple \"beta\" versions of a program during the beta phase.  Each version includes updates and bug fixes that have been made in response to user feedback.  The beta phase may last anywhere from a few weeks for a small program to several months for a large program.\nEach beta version is typically labeled with the final version number followed by a beta version identifier.  For example, the fifth beta release of the second version of a software program may have the version number \"2.0b5.\"  If a developer prefers not to list the specific version of a beta program, the version number may simply have the term \"(beta)\" after the program name, e.g. \"My New App (beta).\"  This naming convention is commonly used for beta versions of websites or web applications.\nSince beta software is a pre-release version of the final application, it may be unstable or lack features that will be be included in the final release.  Therefore, beta software often comes with a disclaimer that testers should use the software at their own risk.  If you choose to beta test a program, be aware that it may not function as expected."
        ]
    },
    {
        "word": "Bezel",
        "type": [],
        "definition": [
            "The term \"bezel\" comes from the jewelry industry, in which case a bezel is a groove that holds a gemstone or watch crystal in place.  The term is also used to describe the rim around gauges, such as the speedometer in a car.  In the computer industry, a bezel may refer to either the edge around a monitor or the front of a desktop computer case.\nA monitor bezel, or screen bezel, is the area of a display that surrounds the screen.  For example, if a monitor has a one inch bezel, the screen is surrounded by one inch of plastic or metal.  If a monitor's bezel width is different on the sides than the top and bottom of the screen, the bezel specification will include individual measurements for each side.  As displays have evolved, bezel widths have generally gotten smaller.  For example, old CRT monitors often had bezel widths of two inches or more, while modern LCD displays often have bezels that are less than one inch thick.  Thinner bezels help maximize the screen real estate of a laptops and make multiple desktop displays look more like a single screen when placed side by side.\nA computer bezel is the front face of a system unit or \"tower.\"  Most PC bezels include have openings for one or more drive bays.  These slots allow you to add devices such as an optical drive or an additional internal hard drive.  When extra drives are not installed, these bays are usually covered by plates that are the same color as the bezel, but are not technically part of the bezel."
        ]
    },
    {
        "word": "Big Data",
        "type": [],
        "definition": [
            "The phrase \"big data\" is often used in enterprise settings to describe large amounts of data.  It does not refer to a specific amount of data, but rather describes a dataset that cannot be stored or processed using traditional database software.\nExamples of big data include the Google search index, the database of Facebook user profiles, and Amazon.com's product list.  These collections of data (or \"datasets\") are so large that the data cannot be stored in a typical database, or even a single computer.  Instead, the data must be stored and processed using a highly scalable database management system.  Big data is often distributed across multiple storage devices, sometimes in several different locations.\nMany traditional database management systems have limits to how much data they can store.  For example, an Access 2010 database can only contain two gigabytes of data, which makes it infeasible to store several petabytes or exabytes of data.  Even if a DBMS can store large amounts of data, it may operate inefficiently if too many tables or records are created, which can lead to slow performance.  Big data solutions solve these problems by providing highly responsive and scalable storage systems.\nThere are several different types of big data software solutions, including data storage platforms and data analytics programs.  Some of the most common big data software products include Apache Hadoop, IBM's Big Data Platform, Oracle NoSQL Database, Microsoft HDInsight, and EMC Pivotal One."
        ]
    },
    {
        "word": "Big Sur",
        "type": [],
        "definition": [
            "Big Sur (macOS 11) is the 17th version of Apple's macOS (formerly Mac OS X) operating system.  It followed macOS Catalina and was released on November 12, 2020.\nmacOS 11 Big Sur includes major user interface updates.  The overall appearance of the operating system is lighter, more colorful, and more spacious.  The application and Finder windows have a full-height sidebar, the Dock has a new \"floating\" look, and the menu bar is more translucent.  Most app icons have been completely redesigned.\nBig Sur is the first version of macOS to include Control Center, which consolidates common settings, such as Wi-Fi, Bluetooth, display, and sound options into a single area.  It also includes an updated version of Notification Center, which supports interactive notifications, grouping notifications, and custom widgets, such as Calendar, Weather, and Notes.  Big Sur maintains most of the utilities bundled with previous versions of macOS, but removes the Network Utility app.\nApple made significant updates to several bundled applications in Big Sur, including Safari, Mail, Messages, Music, and Maps.  Many updates are designed to provide a more seamless user experience between iOS and macOS.  For example, Messages in Big Sur supports pinned conversations, \"mentions\" of individual users, inline replies, animated GIFs, and message effects.\nNOTE: Unlike the previous 16 versions of OS X or macOS, which carried the \"Mac OS 10\" name, Big Sur is \"macOS 11.\"  In Big Sur, minor point updates now use the standard \"minor point number\" in the version, such as 11.1, 11.2, etc.  Previous versions of macOS used the \"patch number\" for minor point updates, such as (OS X Mavericks 10.9.1, 10.9.2, etc."
        ]
    },
    {
        "word": "Binary",
        "type": [],
        "definition": [
            "Binary (or base-2) a numeric system that only uses two digits — 0 and 1.  Computers operate in binary, meaning they store data and perform calculations using only zeros and ones.\nA single binary digit can only represent True (1) or False (0) in boolean logic.  However, multiple binary digits can be used to represent large numbers and perform complex functions.  In fact, any integer can be represented in binary.\nBelow is a list of several decimal (or \"base-10\") numbers represented in binary.\n\nDecimalBinaryBase-2 Calculation\n00n\/a\n1120\n21021\n31121 + 20\n410022\n510122+ 20\n611022 + 21\n711122 + 21 + 20\n8100023\n9100123 + 20\n10101023 + 21\n64100000026\n25610000000028\n102410000000000210\n\nOne bit contains a single binary value — either a 0 or a 1.  A byte contains eight bits, which means it can have 256 (28) different values.  These values may be used to represent different characters in a text document, the RGB values of a pixel within an image file, or many other types of data.\nLarge files may contain several thousand bytes (or several megabytes) of binary data.  A large application may take up thousands of megabytes of data.  No matter how big a file or program is, at its most basic level, it is simply a collection of binary digits that can be read by a computer processor.\nNOTE: The term \"binary\" may also be used to describe a compiled software program.  Once a program has been compiled, it contains binary data called \"machine code\" that can be executed by a computer's CPU.  In this case, \"binary\" is used in contrast to the text-based source code files that were used to build the application."
        ]
    },
    {
        "word": "Bing",
        "type": [],
        "definition": [
            "Bing is a search engine developed by Microsoft.  It provides a standard web search, as well as specialized searches for images, videos, shopping, news, maps, and other categories.\nBing originated from MSN Search, which later became Windows Live Search (or simply \"Live Search\").  Microsoft renamed the search engine to \"Bing\" in June of 2009.  The name change also reflected Microsoft's new direction with the search engine, which the company branded as a \"decision engine.\"  Bing is designed to help users make important decisions faster.  This focus is summarized in the search engine's slogan, \"Bing and decide.\"\nBing differentiates itself from other search engines like Google and Yahoo in several different ways.  For instance, Bing's home page includes a background image or video that is updated every day.  You can click on different areas of the background to learn more about the daily topic.  Bing also uses Microsoft's proprietary search algorithm to provide relevant search results.  These results may include \"instant answers,\" which provide helpful information at the top of the search results page for specific types of queries.  The search results may also include images, videos, shopping information, or news stories that are relevant to the keywords you entered.\nYou can choose to sign into Bing using your Windows Live ID or your Facebook login.  When you are logged into Facebook, Bing displays which of your friends \"Like\" specific webpages in the search results.  If you want even more Facebook integration, you can download the \"Bing Bar,\" which provides News Feed updates directly from the toolbar in Internet Explorer.  The Bing Bar also provides one-click access to weather, maps, videos, stock quotes, and other information.\nTry Bing for yourself."
        ]
    },
    {
        "word": "Biometrics",
        "type": [],
        "definition": [
            "Biometrics refers to technologies used to detect and recognize human physical characteristics.  In the IT world, biometrics is often synonymous with \"biometric authentication,\" a type of security authorization based on biometric input.\nThere are several types of biometric authentication.  Common examples include fingerprint scanning, retinal scanning, facial recognition, and voice analysis.  A facial recognition system, for instance, uses a camera to capture an image of a person's face.  The photograph is then recorded and processed using biometrics software.  The software attempts to match the scanned image with an image from a database of users' photos.  If the scan is close enough to a specific user, the person will receive authorization to continue.\nIn many cases, a biometric scan is similar to a login.  For example, some computers have a finger scanner that allows you to authenticate yourself by swiping your finger across a sensor.  Instead of entering a username and password, the finger scan provides your authorization.  Some retail outlets now use finger scanners to verify people's identity as an alternative to entering a unique pin number.  High-security government and office buildings may even require retinal scans in order to access certain areas of the building.  In some cases, a keycard, passcode, or login is required in addition to a biometric scan in order to provide extra security."
        ]
    },
    {
        "word": "Biotech",
        "type": [],
        "definition": [
            "Biotech, or \"biotechnology,\" is technology based on biology, the study of living organisms.  It covers all technologies related to biological systems, including humans, animals, and the environment.\nThe primary goal of biotechnology is to improve the health of people and the planet.  Examples include:\n\ntreating and curing diseases\nformulating optimal nutrition plans\nreducing waste through recycling\ncreating renewable energy sources\ngenerating higher crop yields\n\nWhile not all scientific research requires computer technology, most modern biotech processes involve computers.  For example, scientists often use electronic instruments to perform measurements, which are sent (via a cable or wirelessly) to one or more computer systems.  Researchers use computers to record data, compare results over time, and run simulations.  \nAdvancements in processor technology provide corresponding improvements in biotech research.  For instance, complex operations like DNA sequencing and chemical compound modeling no longer require specialized computer systems or computing clusters.  Simulations that may have taken weeks to run on older systems may now complete in a few minutes.\nBiotech vs Medtech\nMedtech (medical technology) is a subset of biotech.  While biotech covers all facets of biology, medtech is specific to the medical field.  Medical technologies such as vaccines and digital x-rays also fall within the biotech umbrella.  Biotechnologies, such as plastic recycling and ethanol enrichment, are not considered medtech."
        ]
    },
    {
        "word": "Bit",
        "type": [],
        "definition": [
            "A bit (short for \"binary digit\") is the smallest unit of measurement used to quantify computer data.  It contains a single binary value of 0 or 1.\nWhile a single bit can define a boolean value of True (1) or False (0), an individual bit has little other use.  Therefore, in computer storage, bits are often grouped together in 8-bit clusters called bytes.  Since a byte contains eight bits that each have two possible values, a single byte may have 28 or 256 different values.\nThe terms \"bits\" and \"bytes\" are often confused and are even used interchangeably since they sound similar and are both abbreviated with the letter \"B.\"  However, when written correctly, bits are abbreviated with a lowercase \"b,\" while bytes are abbreviated with a capital \"B.\"  It is important not to confuse these two terms, since any measurement in bytes contains eight times as many bits.  For example, a small text file that is 4 KB in size contains 4,000 bytes, or 32,000 bits.\nGenerally, files, storage devices, and storage capacity are measured in bytes, while data transfer rates are measured in bits.  For instance, an SSD may have a storage capacity of 240 GB, while a download may transfer at 10 Mbps.  Additionally, bits are also used to describe processor architecture, such as a 32-bit or 64-bit processor."
        ]
    },
    {
        "word": "BitTorrent",
        "type": [],
        "definition": [
            "BitTorrent is a peer-to-peer (P2P) file sharing protocol designed to reduce the bandwidth required to transfer files.  It does this by distributing file transfers across multiple systems, thereby lessening the average bandwidth used by each computer.  For example, if a user begins downloading a movie file, the BitTorrent system will locate multiple computers with the same file and begin downloading the file from several computers at once.  Since most ISPs offer much faster download speeds than upload speeds, downloading from multiple computers can significantly increase the file transfer rate.\nIn order to use the BitTorrent protocol, you need a BitTorrent client, which is a software program that accesses the BitTorrent network.  The client program allows you to search for files and begin downloading torrents, which are in-progress downloads.  Most BitTorrent clients allow you to resume torrents that have been paused or stopped.  This can be especially helpful when downloading large files.\nFor a list of BitTorrent clients, view the .TORRENT file extension entry."
        ]
    },
    {
        "word": "Bitcoin",
        "type": [],
        "definition": [
            "Bitcoin is a digital currency that was introduced in 2009.  There is no physical version of the currency, so all Bitcoin transactions take place over the Internet.  Unlike traditional currencies, Bitcoin is decentralized, meaning it is not controlled by a single bank or government.  Instead, Bitcoin uses a peer-to-peer (P2P) payment network made up of users with Bitcoin accounts.\nBitcoins can be acquired using two different methods: 1) exchanging other currencies for bitcoins, and 2) bitcoin mining.  The first method is by far the most common and can be done using a Bitcoin exchange like Mt. Gox or CampBX.  These exchanges allow users to trade dollars, euros, or other currencies for bitcoins.\nThe other method, bitcoin mining, involves setting up a computer system to solve math problems generated by the Bitcoin network.  As a bitcoin miner solves these complex problems, bitcoins are credited to the miner.  While this seems like an easy way to earn bitcoins, the Bitcoin network is designed to generate increasingly more difficult math problems, which ensures new bitcoins will be generated at a consistent rate.   Additionally, the Bitcoin protocol and software are open source to make sure the network isn't controlled by a single person or entity.\nWhen you obtain bitcoins, your balance is stored in a secure “wallet” that is encrypted using password protection.  When you perform a bitcoin transaction, the ownership of the bitcoins is updated in the network and the balance in your wallet is updated accordingly.  Bitcoin transactions are verified by the bitcoin mining systems connected to the network, so there is no need for a central bank to authorize transactions.\nSince bitcoins are transferred directly from person to person, the transaction fees are small (around $0.01 per transaction).  Additionally, there are no prerequisites for creating a Bitcoin account and no transaction limits.  Bitcoins can be used around the world, but the currency is only good for purchasing items from vendors that accept Bitcoin."
        ]
    },
    {
        "word": "Bitmap",
        "type": [],
        "definition": [
            "A bitmap (or raster graphic) is a digital image composed of a matrix of dots.  When viewed at 100%, each dot corresponds to an individual pixel on a display.  In a standard bitmap image, each dot can be assigned a different color.  Together, these dots can be used to represent any type of rectangular picture.\nThere are several different bitmap file formats.  The standard, uncompressed bitmap format is also known as the \"BMP\" format or the device independent bitmap (DIB) format.  It includes a header, which defines the size of the image and the number of colors the image may contain, and a list of pixels with their corresponding colors.  This simple, universal image format can be recognized on nearly all platforms, but is not very efficient, especially for large images.\nOther bitmap image formats, such as JPEG, GIF, and PNG, incorporate compression algorithms to reduce file size.  Each format uses a different type of compression, but they all represent an image as a grid of pixels.  Compressed bitmaps are significantly smaller than uncompressed BMP files and can be downloaded more quickly.  Therefore, most images you see on the web are compressed bitmaps.\nIf you zoom into a bitmap image, regardless of the file format, it will look blocky because each dot will take up more than one pixel.  Therefore, bitmap images will appear blurry if they are enlarged.  Vector graphics, on the other hand, are composed of paths instead of dots, and can be scaled without reducing the quality of the image.\nFile extensions: .BMP, .DIB"
        ]
    },
    {
        "word": "Bitrate",
        "type": [],
        "definition": [
            "Bitrate, as the name implies, describes the rate at which bits are transferred from one location to another.  In other words, it measures how much data is transmitted in a given amount of time.  Bitrate is commonly measured in bits per second (bps), kilobits per second (Kbps), or megabits per second (Mbps).  For example, a DSL connection may be able to download data at 768 kbps, while a Firewire 800 connection can transfer data up to 800 Mbps.\nBitrate can also describe the quality of an audio or video file.  For example, an MP3 audio file that is compressed at 192 Kbps will have a greater dynamic range and may sound slightly more clear than the same audio file compressed at 128 Kbps.  This is because more bits are used to represent the audio data for each second of playback.  Similarly, a video file that is compressed at 3000 Kbps will look better than the same file compressed at 1000 Kbps.  Just like the quality of an image is measured in resolution, the quality of an audio or video file is measured by the bitrate."
        ]
    },
    {
        "word": "Black Box Testing",
        "type": [],
        "definition": [
            "Black box testing is a type of software testing in which the application design and source code is not known to the tester.  It allows developers to receive external feedback, such as feature requests and bugs that may have been overlooked by the development team.\nWhile white box testing is useful for stress-testing apps, black box testing is useful for improving the user experience.  For this reason, a software company may provide a beta version to a group of outside beta testers.  These users, who may be using the app for the first time, can provide objective feedback about the user interface and overall functionality.\nBlack box testers may also uncover bugs that the original programmers did not find.  A large number of beta testers can discover errors and incompatibilities more quickly than a small group of developers.  Therefore, large software companies often release beta versions of their apps before releasing them.  Testers can submit bug reports and other feedback during the beta stage of development, which may last few months.\nMany software programs go through both white box and black box testing.  White box testing is more common in the alpha stage, while black box testing is usually performed in the beta stage.  Running both types of tests at the same time is called \"grey box testing.\""
        ]
    },
    {
        "word": "Blacklist",
        "type": [],
        "definition": [
            "A blacklist is list of items, such as usernames or IP addresses, that are denied access to a certain system or protocol.  When a blacklist is used for access control, all entities are allowed access, except those listed in the blacklist.  The opposite of a blacklist is a whitelist, which denies access to all items, except those included in the list.\nBlacklists have several applications in computing:\n\nWeb servers often include a blacklist that denies access from specific IP addresses or ranges of IPs, for security purposes.\nFirewalls may use a blacklist to deny access to individual users, systems located in certain regions, or computers with IPs within a certain subnet mask.\nSpam filters often include blacklists that reject certain e-mail addresses and specific message content.\nProgrammers may implement blacklists within programs to prevent certain objects from being modified.\n\nSince blacklists deny access to specific entities, they are best used when a limited number of items need to be denied access.  When most entities need to be denied access, a whitelist approach is more efficient."
        ]
    },
    {
        "word": "Bloatware",
        "type": [],
        "definition": [
            "Bloatware is software that uses an excessive amount of system resources, such as disk space and memory.  While bloatware may refer to the first version of a software program, it most often describes programs that require increasing amounts of system resources with each new version.\nIt is generally considered good programming practice to develop efficient applications.  A well-developed program should not require more RAM or disk space than necessary.  However, in some cases a developer may prioritize a specific release date or new features over efficiency.  This can result in a bloated application that uses far more storage space and memory than the previous version.\nNew versions of software programs typically include new features, which provide an incentive for users to upgrade.  However, with each new release, the program's system requirements may also grow.  If left unchecked, after a few versions, a once efficient application can turn into bloatware.  To avoid this, some software developers make an intentional effort to trim unnecessary features when adding new ones.\nCommon examples of software that may be considered bloatware include Microsoft Windows, Apple iTunes, and Adobe Reader."
        ]
    },
    {
        "word": "Blob",
        "type": [],
        "definition": [
            "If you're like me, you picture a blob as a enigmatic green object that lacks a defined shape or size.  In the computer world, however, blobs are a bit easier to define.  The term \"blob\" actually stands for \"Binary Large Object\" and is used for storing information in databases.\nA blob is a data type that can store binary data.  This is different than most other data types used in databases, such as integers, floating point numbers, characters, and strings, which store letters and numbers.  Since blobs can store binary data, they can be used to store images or other multimedia files.  For example, a photo album could be stored in a database using a blob data type for the images, and a string data type for the captions.\nBecause blobs are used to store objects such as images, audio files, and video clips, they often require significantly more space than other data types.  The amount of data a blob can store varies depending on the database type, but some databases allow blob sizes of several gigabytes.  Now that is a big blob!"
        ]
    },
    {
        "word": "Block-Based Coding",
        "type": [],
        "definition": [
            "Block-based coding is a type of programming that uses a visual drag-and-drop interface instead of a source code editor.  By connecting various blocks, novice developers can write programs without knowing a programming language.\nIndividual blocks within a block-based coding project represent commands, such as move and turn, and clauses, such as when, while, and if then statements.  A string of blocks can be attached to one or more objects, such as an image or sprite.   For example, a basic program may display a cat sprite that moves the cat to the center of the canvas and plays a \"meow\" sound when clicked.  The program would require the following three blocks, attached to the cat object.\n\nWhen clicked (clause)\nMove to center (command)\nPlay sound \"meow\" (command)\n\nMore complex programs include multiple sprites that interact with each other.  With enough blocks, it is possible to create detailed animations or interactive games.\nBlock-based coding is primarily used as a learning tool for beginning programmers.  It has a lower barrier to entry and provides an accessible introduction to software development.  For many students, block-based coding is a simple, visual way to learn programming concepts."
        ]
    },
    {
        "word": "Blockchain",
        "type": [],
        "definition": [
            "A blockchain is a digital record of transactions.  The name comes from its structure, in which individual records, called blocks, are linked together in single list, called a chain.  Blockchains are used for recording transactions made with cryptocurrencies, such as Bitcoin, and have many other applications.\nEach transaction added to a blockchain is validated by multiple computers on the Internet.  These systems, which are configured to monitor specific types of blockchain transactions, form a peer-to-peer network.  They work together to ensure each transaction is valid before it is added to the blockchain.  This decentralized network of computers ensures a single system cannot add invalid blocks to the chain.  \nWhen a new block is added to a blockchain, it is linked to the previous block using a cryptographic hash generated from the contents of the previous block.  This ensures the chain is never broken and that each block is permanently recorded.  It is also intentionally difficult to alter past transactions in blockchain since all the subsequent blocks must be altered first.\nBlockchain Uses\nWhile blockchain is widely known for its use in cryptocurrencies such as Bitcoin, Litecoin, and Ether, the technology has several other uses.  For example, it enables \"smart contracts,\" which execute when certain conditions are met.  This provides an automated escrow system for transactions between two parties.  Blockchain can potentially be used to allow individuals to pay each other without a central clearing point, which is required for ACH and wire transfers.  It has potential to greatly increase the efficiency of stock trading by allowing transactions to settle almost instantly instead of requiring three or more days for each transaction to clear.\nBlockchain technology can also be used for non-financial purposes.  For example, the InterPlanetary File System (IFPS) uses blockchain to decentralize file storage by linking files together over the Internet.  Some digital signature platforms now use blockchain to record signatures and verify documents have been digitally signed.  Blockchain can even be used to protect intellectual property by linking the distribution of content to the original source."
        ]
    },
    {
        "word": "Blog",
        "type": [],
        "definition": [
            "Short for \"Web Log,\" this term refers to a list of journal entries posted on a Web page.  Anybody who knows how to create and publish a Web page can publish their own blog.  Some Web hosts have made it even easier by creating an interface where users can simply type a text entry and hit \"publish\" to publish their blog.\nBecause of the simplicity of creating a blog, many people (often young kids and adults) have found a new presence on the Web.  Instead of writing confidential entries in a book that no one is supposed to see, people now can share their personal feelings and experiences with thousands of people around the world.  Blogs are typically updated daily, monthly, or anywhere in between.  \"Blog\" may also be used as a verb, as in \"Wow, Matt sure blogged a lot last week.\""
        ]
    },
    {
        "word": "Blu-ray",
        "type": [],
        "definition": [
            "Blu-ray is an optical disc format such as CD and DVD.  It was developed for recording and playing back high-definition (HD) video and for storing large amounts of data.  While a CD can hold 700 MB of data and a basic DVD can hold 4.7 GB of data, a single Blu-ray disc can hold up to 25 GB of data.  Even a double sided, dual layer DVD (which are not common) can only hold 17 GB of data.  Dual-layer Blu-ray discs will be able to store 50 GB of data.  That is equivalent to 4 hours of HDTV.\nBlu-ray discs can hold more information than other optical media because of the blue lasers the drives use.  The laser is actually blue-violet, but \"Blu-ray\" rolls off the tounge a little easier than \"Blu-violet-ray.\"  The blue-violet laser has a shorter wavelength than the red lasers used for CDs and DVDs (405nm compared to 650nm).  This allows the laser to focus on a smaller area, which makes it possible to cram significantly more data on a disc the same size as a CD or DVD.  Proponents of the Blu-ray format say they expect Blu-ray devices to replace VCRs (thank goodness) and DVD recorders as more people make the transition to HDTV.  For the latest Blu-ray news, check out Blu-ray.com."
        ]
    },
    {
        "word": "Bluetooth",
        "type": [],
        "definition": [
            "This wireless technology enables communication between Bluetooth-compatible devices.  It is used for short-range connections between desktop and laptop computers, PDAs (like the Palm Pilot or Handspring Visor), digital cameras, scanners, cellular phones, and printers.\nInfrared once served the same purpose as Bluetooth, but it had a number of drawbacks.  For example, if there was an object placed between the two communicating devices, the transmission would be interrupted.  (You may have noticed this limitation when using a television remote control).  Also, the Infrared-based communication was slow and devices were often incompatible with each other.\nBluetooth takes care of all these limitations.  Because the technology is based on radio waves, there can be objects or even walls placed between the communicating devices and the connection won't be disrupted.  Also, Bluetooth uses a standard 2.4 GHz frequency so that all Bluetooth-enabled devices will be compatible with each other.  The only drawback of Bluetooth is that, because of its high frequency, its range is limited to 30 feet.  While this is easily enough for transferring data within the same room, if you are walking in your back yard and want to transfer the address book from your cell phone to your computer in your basement, you might be out of luck.  However, the short range can be seen as a positive aspect as well, since it adds to the security of Bluetooth communication."
        ]
    },
    {
        "word": "Bookmark",
        "type": [],
        "definition": [
            "A bookmark is a saved shortcut that directs your browser to a specific webpage.  It stores the title, URL, and favicon of the corresponding page.  Saving bookmarks allows you to easily access your favorite locations on the Web.\nAll major web browsers allow you to create bookmarks, though each browser provides a slightly different way of managing them.  For example, Chrome and Firefox display your bookmarks in an open window, while Safari displays them in a list in the sidebar of the browser window.  Internet Explorer uses the name \"Favorites\" to refer to bookmarks, and like Safari, it displays all your favorites in a list within the browser window sidebar.\nTo create a bookmark, simply visit the page you want to bookmark and select Add Bookmark or Bookmark this Page from the Bookmarks menu.  In Internet Explorer, you can click the star icon to open the Favorites sidebar and click Add to Favorites to add the current page to your bookmarks.  The website title will show up in your bookmarks list along with the website's favicon if available.  As your collection of bookmarks grows, you can create folders to organize your bookmarks into different categories.\nIt is helpful to bookmark frequently visited websites and useful references since you don't have to remember the URLs.  Additionally, you can just click the bookmarks instead of typing in the full web addresses.  Some browsers even display your bookmarked pages in the autocomplete drop down menu as you type in the address bar.  This allows you to visit bookmarked pages without even opening the bookmarks window or sidebar in your browser.\nNOTE: A bookmark only stores the location of a webpage, not store the contents of the webpage itself.  Therefore, when you open a previously saved bookmark, the contents of the page may have changed since the last time you viewed it."
        ]
    },
    {
        "word": "Boolean",
        "type": [],
        "definition": [
            "Boolean, or boolean logic, is a subset of algebra used for creating true\/false statements.  Boolean expressions use the operators AND, OR, XOR, and NOT to compare values and return a true or false result.  These boolean operators are described in the following four examples:\n\nx AND y - returns True if both x and y are true; returns False if either x or y are false.\nx OR y - returns True if either x or y, or both x and y are true; returns False only if x and y are both false.\nx XOR y - returns True if only x or y is true; returns False if x and y are both true or both false.\nNOT x - returns True if x is false (or null); returns False if x is true.\n\nSince computers operate in binary (using only zeros and ones), computer logic can often be expressed in boolean terms.  For example, a true statement returns a value of 1, while a false statement returns a value of 0.  Of course, most calculations require more than a simple true\/false statement.  Therefore, computer processors perform complex calculations by linking multiple binary (or boolean) statements together.  Complex boolean expressions can be expressed as a series of logic gates.\nBoolean expressions are also supported by most search engines.  When you enter keywords in a search engine, you can refine your search using boolean operators.  For example, if you want to look up information about the Apple iMac, but want to avoid results about apples (the fruit) you might search for \"Apple AND iMac NOT fruit.\"  This would produce results about iMac computers, while avoiding results with the word \"fruit.\"  While most search engines support boolean operators, their syntax requirements may vary.  For example, instead of the words AND and NOT, the operators \"+\" and \"-\" may be required.  You can look up the correct syntax in the help section of each search engine's website."
        ]
    },
    {
        "word": "Boot",
        "type": [],
        "definition": [
            "When you boot a football, you kick it really far.  When you boot a computer, you simply turn it on.  Kicking your computer really far is not recommended, though you may be tempted to do so at times.  The term \"boot\" comes from the word \"bootstraps,\" which people at one time used to get their boots on.  Likewise, \"booting\" a computer gets it up and running.\nIn simple terms, to boot a computer is to turn it on.  Once the computer's power is turned on, the \"boot process\" takes place.  This process involves loading the startup instructions from the computer's ROM, followed by loading the operating system from the current boot disk.  The boot disk is usually an internal hard drive, but can also be an external drive, a CD or DVD-ROM, or even a floppy disk.  Once the operating system software is loaded, the boot process is complete and the computer is ready to be used."
        ]
    },
    {
        "word": "Boot Disk",
        "type": [],
        "definition": [
            "A boot disk, or startup disk, is a storage device from which a computer can \"boot\" or start up.  The default boot disk is typically a computer's internal hard drive or SSD.  This disk contains files required by the boot sequence as well as the operating system, which is loaded at the end of the startup process.\nWhile it is most common to boot a system from the primary internal storage device, most computers allow you to boot from other disks.  This include external hard drives, CDs, DVDs, and USB flash drives.  Starting up from a secondary boot disk can be useful for running diagnostics and disk utilities on the primary disk.  It may be necessary if the computer cannot start up from the primary drive.\nSome operating systems require separate partitions for boot files and operating system files.  These partitions are called the \"boot partition\" and \"system partition.\"\nThere are four requirements for a storage device to function as a boot disk:\n\nThe media must be supported by the hardware (for example, a DVD startup disk requires a CD\/DVD drive.\nIt must be formatted for the correct system (for example, NTFS for Windows or APFS for Mac). It must contain the boot files required for startup.\nIt must contain an operating system that is supported by the computer.\n\nSeveral disk utilities allow you to create a custom boot disk, which you can save to a DVD or thumb drive.  These boot disks include a rudimentary \"utility\" operating system that can run diagnostics and repairs on the primary drive.  The goal of this type of boot disk is to start up a computer in case of a drive failure and repair the primary drive so it can be used as the startup disk again.\nNOTE:Some operating systems support network booting.  This loads the startup files and operating system over a network connection.  The data may be downloaded from a LAN or the Internet."
        ]
    },
    {
        "word": "Boot Sector",
        "type": [],
        "definition": [
            "The boot sector is a dedicated section of a hard disk or other storage device that contains data used to boot a computer system.  It includes the master boot record (MBR), which is accessed during the boot sequence.\nThe boot sector is typically located at the very beginning of a disk, before the first partition.  It includes the partition map, which identifies all the partitions on the disk.  It also defines which partition contains the startup data (such as the operating system).  This lets the computer know which partition to access when starting up.  Therefore, if a disk's boot sector becomes corrupted or contains invalid data, the computer may not be able to start up from the disk.  If this happens, you should run a disk utility or antivirus program to try and fix the problem."
        ]
    },
    {
        "word": "Boot Sequence",
        "type": [],
        "definition": [
            "Each time a computer boots up, it goes through an initial series of processes.  This sequence of events is aptly named a \"boot sequence.\"  During the boot sequence, the computer activates the necessary hardware components and loads the appropriate software so that a user can interact with the machine.\nThe boot sequence starts by accessing the computer's BIOS on Windows PCs or the system ROM on a Macintosh.  The BIOS and ROM contain basic instructions that tell the computer how to boot up.  These instructions are then passed to the computer's CPU, which begins loading information into the system RAM.  Once a valid boot disk or startup disk is found, the computer begins loading the operating system into the system memory.  After the operating system finishes loading, the computer is ready to be used.\nThe boot sequence can take anywhere from a few seconds to several minutes, depending on the computer's configuration.  If the system is booting from a CD or DVD, the boot time may be significantly longer than if the computer is booted from a hard drive.  Also, if your computer was turned off unexpectedly, the boot time might increase since the system may perform some additional checks to make sure everything is OK."
        ]
    },
    {
        "word": "Bootstrap",
        "type": [],
        "definition": [
            "Bootstrap, or bootstrapping, is a verb that comes from the saying, \"to pull oneself up by his bootstraps.\"  The idiom implies a person is self sufficient, not requiring help from others.  Similarly, in the computing world, bootstrapping describes a process that automatically loads and executes commands.\nThe most fundamental form of bootstrapping is the startup process that takes place when you start up a computer.  In fact, the term \"boot,\" as in booting up a computer, comes from the word bootstrap.  When you turn on or restart a computer, it automatically loads a sequence of commands that initializes the system, checks for hardware, and loads the operating system.  This process does not require any user input and is therefore considered a bootstrap process.\nWhile bootstrapping is often associated with the system boot sequence, it can be used by individual applications as well.  For example, a program may automatically run a series of commands when opened.  These commands may process user settings, check for updates, and load dynamic libraries, such as DLL files.  They are considered bootstrap processes because they run automatically as the program is starting up.\nNOTE: Bootstrap is also a popular web development framework used for creating websites.  It was developed by a team at Twitter and has been an open source project since 2011.  The Bootstrap framework includes CSS styles, JavaScript libraries, and HTML files.  Bootstrap provides a way for developers to easily build responsive websites rather than designing them from scratch."
        ]
    },
    {
        "word": "Bot",
        "type": [],
        "definition": [
            "A bot (short for \"robot\") is an automated program that runs over the Internet.  Some bots run automatically, while others only execute commands when they receive specific input.  There are many different types of bots, but some common examples include web crawlers, chat room bots, and malicious bots.\nWeb crawlers are used by search engines to scan websites on a regular basis.  These bots \"crawl\" websites by following the links on each page.  The crawler saves the contents of each page in the search index.  By using complex algorithms, search engines can display the most relevant pages discovered by web crawlers for specific search queries.\nChat bots were one of the first types of automated programs to be called \"bots\" and became popular in the 1990s, with the rise of online chatrooms.  These bots are scripts that look for certain text patterns submitted by chat room participants and respond with automated actions.  For example, a chat bot might warn a user if his or her language is inappropriate.  If the user does not heed the warning, the bot might kick the user from the channel and may even block the user from returning.  A more advanced type of chat bot, called a \"chatterbot\" can respond to messages in plain English, appearing to be an actual person.  Both types of chat bots are used for chatroom moderation, which eliminates the need for an individual to monitor individual chatrooms.\nWhile most bots are used for productive purposes, some are considered malware, since they perform undesirable functions.  For example, spambots capture email addresses from website contact forms, address books, and email programs, then add them to a spam mailing list.  Site scrapers download entire websites, enabling unauthorized duplication of a website's contents.  DoS bots send automated requests to websites, making them unresponsive.  Botnets, which consist of many bots working together, may be used to gain unauthorized access to computer systems and infect computers with viruses."
        ]
    },
    {
        "word": "Botnet",
        "type": [],
        "definition": [
            "A botnet is a group of computers that are controlled from a single source and run related software programs and scripts.  While botnets can be used for distributed computing purposes, such as a scientific processing, the term usually refers to multiple computers that have been infected with malicious software.\nIn order to create a malicious botnet, a hacker must first compromise several computers.  This might be done by exploiting a security hole through a Web browser, IRC chat program, or a computer's operating system.  For example, if a user has turned off the default firewall settings, his or her computer may be susceptible to such a botnet attack.  Once the hacker has gained access to several computers, he can run automated programs or \"bots\" on all the systems at the same time.\nA hacker may create a botnet for several different purposes, such as spreading viruses, sending e-mail spam, or crashing Web servers using a denial of service attack.  Botnets can range from only a few computers to several thousand machines.  While large botnets can cause the most damage, they are also easiest to locate and break apart.  The unusual amount of bandwidth used by large botnets may trigger an alert at one or more ISPs, which might lead to the discovery and dismantling of the botnet.\nIn most situations, users do not know that their computers have become part of a botnet.  This is because hackers typically hide their intrusion by masking the activity within regular processes, similar to a rootkit attack.  Therefore, it is a good idea to install antivirus or anti-malware software that regularly checks for such intrusions on your computer.  It is also wise to make sure your system firewall is turned on, which is usually the default setting."
        ]
    },
    {
        "word": "Bounce",
        "type": [],
        "definition": [
            "The term \"bounce\" has several different IT related meanings, yet none of them include bouncy balls.  The most common definition of bounce used in the computer world refers to e-mail messages.\n1. Returning E-mail\nWhen you send an e-mail message to another person, the mail server processes the message and delivers it to the appropriate user's mailbox.  For example, if you send a message to \"mrman@mail.com,\" the mail.com server looks for a user named \"mrman\" to deliver the message to.  If the user does not exist, the mail server may bounce the message back to the sender, saying \"Sorry, that user does not exist.\"  These messages often come from \"Mail Delivery Subsystem\" and have a subject line that reads \"Returned mail: see transcript for details.\"\nIf you receive a bounced message, you may want to check the e-mail address you sent the message to and make sure it was typed correctly.  If the address is correct, it may help to read the body of the bounced message for more details.  The transcript may say something like \"User quota over limit,\" which means the recipient has reached his or her e-mail quota and must delete some messages and\/or attachments in order to receive new mail.  If this is the case, you may want to call the person or use an alternative e-mail address to let the person know he or she has some Inbox maintenance to do.\n2. Restarting a Computer\nThe term \"bounce\" can also describe the process of rebooting or restarting a computer.  For example, a workstation may need to be bounced after installing new software. Similarly, a Web server may be bounced if websites hosted on the server are not responding correctly.\n3. Exporting Audio\n\"Bounce\" can also describe the process of exporting several tracks in an audio mix to one mono track or two stereo tracks.  This helps consolidate audio tracks after they have been mixed.  Bouncing audio tracks limits the need for processing power since the computer only has to process one track instead of all the tracks individually.  Digital Performer is the primary audio software program that uses bouncing to export audio.\n4. Hiding a Network Connection\nFinally, \"bouncing\" can also be used in networking to describe a method of hiding the source of a user's network connection.  This type of bouncing is often abbreviated \"BNC.\"  Someone who bounces his network connection is called a \"bouncer,\" though this is not the same person who checks your ID at the bar."
        ]
    },
    {
        "word": "Breadcrumbs",
        "type": [],
        "definition": [
            "Breadcrumbs are a user interface element designed to make navigation easy and intuitive.  They are used by operating systems, software programs, and websites.  Breadcrumbs display the directory path of the current folder or webpage and provide one-click access to each of the parent directories.  Like breadcrumbs in the story \"Hansel and Gretel,\" they allow you to retrace your steps back to where you started.\nThe Windows operating system displays breadcrumbs in the toolbar of each open window.  If you open the \"Public\" user folder, for example, the toolbar will display the current location as:\nComputer &rarr; Local Disk (C:) &rarr; Users &rarr; Public\nThis provides a simple way to view the directory path of the current folder.  Each of directories listed in the toolbar are clickable, providing quick access to the parent folders.\nWebpages often include breadcrumbs near the top of the page, though they are usually placed outside of the main navigation bar.  The purpose of website breadcrumbs is twofold: 1) to clearly identify what section of a website a specific webpage is located, and 2) to make it easy for you to jump to the parent sections.  For example, a soccer page on a news website may include breadcrumbs\nHome : Sports : Soccer : Premier League\nnear the top of the page.  This indicates the current page is three sections deep within the website.  Since each section name is also a link, you can quickly jump to any of the parent sections, such as \"Soccer,\" by simply clicking the link within the breadcrumbs."
        ]
    },
    {
        "word": "Bricking",
        "type": [],
        "definition": [
            "Bricking is when an electronic device becomes unusable, often from a failed software or firmware update.  If an update error causes system-level damage, the device may not start up or function at all.  In other words, the electronic device becomes a paperweight or a \"brick.\"\nThe more foundational an update is, the greater its potential to brick a device.  For example, a firmware update is more likely to cause bricking than an operating system update.  An OS update is higher risk than an application update.\nBricking may be caused by an invalid update (such as an attempt to \"jailbreak\" a phone) or an update that does not finish successfully.  To avoid incomplete updates, most firmware and OS updates will not run unless the device is plugged into a power source.\nDevelopers can use preventative measures to prevent bricking.  For example, operating system updates typically wait to overwrite old system files until the new files have been fully downloaded and verified.  Still, if an update fails at a crucial moment, such as when files are being overwritten, the device may become unusable.  If the system cannot boot up and is not updatable, the device is bricked.\nHard vs Soft Bricking\nThere are two types of bricking — hard and soft.  A hard brick is when a device shows little or no signs of life.  For example, the power button may light up, but the screen will not turn on.  A soft-bricked device functions enough to display an error.  For instance, on startup, the screen may display an error message or icon that indicates the operating system is unable to load.\nA bricked device may or may not be recoverable.  Soft bricks are easier to resolve than hard bricks and can often be fixed by the user.  Hard bricks may require special recovery tools only available through the device manufacturer.  Therefore, if your device is hard-bricked, you may want to bring it to an authorized repair shop before relegating it to a paperweight."
        ]
    },
    {
        "word": "Bridge",
        "type": [],
        "definition": [
            "When a road needs to extend across a river or valley, a bridge is built to connect the two land masses.  Since the average car cannot swim or fly, the bridge makes it possible for automobiles to continue driving from one land mass to another.\nIn computer networking, a bridge serves the same purpose.  It connects two or more local area networks (LANs) together.  The cars, or the data in this case, use the bridge to travel to and from different areas of the network.  The device is similar to a router, but it does not analyze the data being forwarded.  Because of this, bridges are typically fast at transferring data, but not as versatile as a router.  For example, a bridge cannot be used as a firewall like most routers can.  A bridge can transfer data between different protocols (i.e. a Token Ring and Ethernet network) and operates at the \"data link layer\" or level 2 of the OSI (Open Systems Interconnection) networking reference model."
        ]
    },
    {
        "word": "Broadband",
        "type": [],
        "definition": [
            "This refers to high-speed data transmission in which a single cable can carry a large amount of data at once.  The most common types of Internet broadband connections are cable modems (which use the same connection as cable TV) and DSL modems (which use your existing phone line).  Because of its multiple channel capacity, broadband has started to replace baseband, the single-channel technology originally used in most computer networks.  So now when you see companies like AT&T and SBC pushing those fancy \"broadband\" ads in your face, you'll at least know what they are talking about."
        ]
    },
    {
        "word": "Broadcast",
        "type": [],
        "definition": [
            "A broadcast is a transmission of information to a large group of people.  Originally, it referred to radio and television broadcasts.  Today, it also describes digital broadcasts sent over the Internet.\nOver-The-Air Broadcasting\nEarly broadcasts, such as AM and FM radio, were produced using analog signals transmitted over the air on different frequencies.  In the early 2000s, several over-the-air or \"OTA\" broadcasts either converted to or added digital signals, such as HDTV, HD radio, and satellite radio.  Today, many broadcasting companies transmit both analog and digital signals.\nWhile cable TV is not considered OTA broadcasting, it went through a similar analog-to-digital transformation in the early 2000s.  A digital signal supports higher-resolution audio and video and can also be compressed to save bandwidth.\nInternet Broadcasting\nInternet broadcasting is the distribution of content from a single source to multiple recipients.  It is similar to multicasting, but does not limit the number of users.  For example, a multicast may transmit a video stream to 50 people, while a broadcast is available to all the users who tune into the stream.  Most streams are considered broadcasts since they are not targeted to specific users.\nSimilar to a radio broadcast, which only transmits one signal, an Internet broadcast only sends one copy of the data.  However, Internet broadcasts are not limited by physical distance and are accessible to users around the world.  When individuals connect to a stream or other Internet broadcast, the data is rerouted to multiple locations.  By the time the broadcast reaches all the connected users, it may be duplicated hundreds or thousands of times."
        ]
    },
    {
        "word": "Brouter",
        "type": [],
        "definition": [
            "A brouter is a device that functions as both a bridge and a router.  It can forward data between networks (serving as a bridge), but can also route data to individual systems within a network (serving as a router).\nThe main purpose of a bridge is to connect two separate networks.  It simply forwards the incoming packets from one network to the next.  A router, on the other hand, is more advanced since it can route packets to specific systems connected to the router.  A brouter combines these two functions by routing some incoming data to the correct systems, while forwarding other data to another network.  In other words, a brouter functions as a filter that lets some data into the local network, while redirecting unrecognized data to another network.\nWhile the term \"brouter\" is used to describe bridge\/router device, actual brouters are pretty rare.  Instead, most brouters are simply routers that have been configured to also function as a bridge.  This functionality can often be implemented using the router's software interface.  For example, you may configure a router to only accept data from specific protocols and data sources, while forwarding other data to another network. \nNOTE: Since routers are more complex than bridges, it is more likely for router than a bridge to function as a brouter.  Therefore, brouters are also called bridging routers."
        ]
    },
    {
        "word": "Brownfield",
        "type": [],
        "definition": [
            "Brownfield is a construction term that describes previously developed land.  In the IT industry, it refers to previously developed software.  Brownfield software development is software that is built from an existing program.  It may be contrasted with \"greenfield\" development, which involves creating a software program from scratch.\nSince the software industry has been around for several decades, the vast majority of software development is brownfield.  For example, each new version of Adobe Photoshop and Microsoft Word is developed as a brownfield project.  Even modern video games, such as Call of Duty: Black Ops 3 and StarCraft 2, are created from earlier versions of the software.\nBrownfield vs Greenfield\nBrownfield software development has many advantages over greenfield projects.  For instance, whenever a software company releases an update to a program, they have a good idea of the market for the software.  They also know what features and style of interface their users expect.  Adding new features and interface enhancements is less time consuming than developing a program from scratch.  Therefore, brownfield development is less costly and involves less risk than greenfield development."
        ]
    },
    {
        "word": "Brute Force Attack",
        "type": [],
        "definition": [
            "A brute force attack is an attempt to gain access to a system using successive login attempts.  It can be performed manually or by using an automated script.  In either case, a brute force attack tries different username and password combinations with the hope of discovering a valid login.\nWhile brute force attacks are simplistic by nature, their implementation is often complex.  Since most servers will block a user or IP address after multiple failed logins, a hacker may use multiple systems to perform a single brute force attack.  Some attacks may use hundreds or even thousands of devices, similar to a distributed denial of service DDoS attack.\nWhile the odds of guessing a correct login via a brute force attack are low, it is still one of the most common ways online accounts are compromised.  Using enough attempts, it is theoretically possible to discover any login.  However, short and common passwords are the most vulnerable.\nHow to Protect Against Brute Force Attacks\nThe two primary ways to protect your online accounts from brute force attacks are to 1) choose strong passwords and 2) use two-factor authentication.\n1. Choose strong passwords\nA fundamental step in securing any online account is to choose a strong password.  This means choosing a password that:\n\nis long – at least eight characters, preferably 12 or more.\ncontains special characters – including numbers and symbols, as well as lowercase and uppercase characters.\nis not personally identifiable – using a special date or the name of someone close to you makes it easy for someone to manually hack your account.\n\nIt is especially important to choose a strong password for your email account since your username (half of your login) is your public email address.  Additionally, if someone gains access to your email, he or she can easily discover your other passwords.\n2. Use Two-Factor Identification\nSome services allow you to enable two-factor authentication, which requires authentication from two devices.  For example, you may be asked to enter a username and password on your computer, followed by a code sent via text to the phone number listed in your account.  With two-factor authentication, even if a hacker knows your username and password, he or she will not be able to successfully log in to your account."
        ]
    },
    {
        "word": "Buffer",
        "type": [],
        "definition": [
            "A buffer contains data that is stored for a short amount of time, typically in the computer's memory (RAM).  The purpose of a buffer is to hold data right before it is used.  For example, when you download an audio or video file from the Internet, it may load the first 20% of it into a buffer and then begin to play.  While the clip plays back, the computer continually downloads the rest of the clip and stores it in the buffer.  Because the clip is being played from the buffer, not directly from the Internet, there is less of a chance that the audio or video will stall or skip when there is network congestion.\nBuffering is used to improve several other areas of computer performance as well.  Most hard disks use a buffer to enable more efficient access to the data on the disk.  Video cards send images to a buffer before they are displayed on the screen (known as a screen buffer).  Computer programs use buffers to store data while they are running.  If it were not for buffers, computers would run a lot less efficiently and we would be waiting around a lot more."
        ]
    },
    {
        "word": "Bug",
        "type": [],
        "definition": [
            "In the computer world, a bug is an error in a software program.  It may cause a program to unexpectedly quit or behave in an unintended manner.  For example, a small bug may cause a button within a program's interface not to respond when you click it.  A more serious bug may cause the program to hang or crash due to an infinite calculation or memory leak.\nFrom a developer perspective, bugs can be syntax or logic errors within the source code of a program.  These errors can often be fixed using a development tool aptly named a debugger.  However, if errors are not caught before the program is compiled into the final application, the bugs will be noticed by the user.\nBecause bugs can negatively affect the usability of a program, most programs typically go through a lot of testing before they are released to the public.  For example, commercial software often goes through a beta phase, where multiple users thoroughly test all aspects of the program to make sure it functions correctly.  Once the program is determined to be stable and free from errors, it is released the public.\nOf course, as we all know, most programs are not completely error-free, even after they have been thoroughly tested.  For this reason, software developers often release \"point updates,\" (e.g. version 1.0.1), which include bug fixes for errors that were found after the software was released.  Programs that are especially \"buggy\" may require multiple point updates (1.0.2, 1.0.3, etc.) to get rid of all the bugs."
        ]
    },
    {
        "word": "Build",
        "type": [],
        "definition": [
            "In software development, \"build\" is used as both a verb and a noun.  The verb refers to the build process, or steps, required to create an application.  The noun describes a specific version of a program.\nBuild (verb)\nCreating an executable software program is often described as \"building\" an app because of all the steps involved.  These steps are collectively known as the \"build process,\" which includes the following:\n\nChecking source code for syntax errors\nCompiling source code into machine code\nLinking libraries and other resources, such as images and media files, to the app\nGenerating a runnable application or executable file\n\nProgrammers typically use a software development application, such as an IDE, to automate the build process.  Many IDEs include a \"Build\" or \"Build and Run\" command that performs all the build steps and outputs an executable application.\nBuild (noun)\nEach version of a software program is called a build.  Some builds may be internal (not released to the public), while others are official releases.  For example, a developer may test and refine several internal builds before releasing a stable build to the public.\nSince each build is unique, the build number or ID must also be unique.  Some developers append the build ID to the public version, while others display it as a separate value.  Many applications, especially smaller ones, do not include a public build number.\nThe build ID is typically the fourth number (after the third dot) when appended to the public version.  Standard software versioning uses the following convention:\nMajor version . minor version . patch . build\nFor example, app version 4.2.17.2895 can be broken down as:\n\n4 - Major version\n2 - Minor version\n17 - Patch\n2895 - Build\n\nNOTE: In some cases, developers release different builds between automatic software updates.  For example, a developer may publish a new build after making a minor update, such as fixing a typo.  But the update is not significant enough to push out the latest version to all users.  Instead, a developer may wait until the next minor version or patch release to notify users of the update."
        ]
    },
    {
        "word": "Burn",
        "type": [],
        "definition": [
            "When you \"burn a disc,\" you write data on it.  If you were taking an SAT test, the analogy would look something like this:\nHard Disk : Write ::\nCD\/DVD : Burn\nThe reason the term \"burn\" is used is because the CD-writer, or burner, literally burns the data onto a writable CD.  The laser in a CD-writer can be cranked up to a more powerful level than an ordinary CD-ROM laser.  This enables it to engrave thousands of 1's and 0's onto a CD.\nSo that is why people talk about \"burning\" songs or files to CDs.  They could just say they are \"writing\" the data to a CD, and it would make sense, but people seem to think \"burning\" sounds cooler."
        ]
    },
    {
        "word": "Bus",
        "type": [],
        "definition": [
            "While the wheels on the bus may go \"round and round,\" data on a computer's bus goes up and down.  Each bus inside a computer consists of set of wires that allow data to be passed back and forth.  Most computers have several buses that transmit data to different parts of the machine.  Each bus has a certain size, measured in bits (such as 32-bit or 64-bit), that determines how much data can travel across the bus at one time.  Buses also have a certain speed, measured in megahertz, which determines how fast the data can travel.\nThe computer's primary bus is called the frontside bus and connects the \nCPU to the rest of the components on the motherboard.  Expansion buses, such as PCI and AGP, allow data to move to and from expansion cards, including video cards and other I\/O devices.  While there are several buses inside a computer, the speed of the frontside bus is the most important, as it determines how fast data can move in and out of the processor."
        ]
    },
    {
        "word": "Byte",
        "type": [],
        "definition": [
            "A byte is a data measurement unit that contains eight bits, or a series of eight zeros and ones.  A single byte can be used to represent 28 or 256 different values.\nThe byte was originally created to store a single character since 256 values are sufficient to represent all lowercase and uppercase letters, numbers, and symbols in western languages.  However, since some languages have more than 256 characters, modern character encoding standards, such as UTF-16, use two bytes, or 16 bits for each character.  With two bytes, it is possible to represent 216 or 65,536 values.\nWhile the byte was originally designed to store character data, it has become the fundamental unit of measurement for data storage.  For example, a kilobyte contains 1,000 bytes.  A megabyte contains 1,000 x 1,000, or 1,000,000 bytes.\nA small plain text file may only contain a few bytes of data.  However, many file systems have a minimum cluster size of 4 kilobytes, which means each file requires a minimum of 4 KB of disk space.  Therefore, bytes are more often used to measure specific data within a file rather than files themselves.  Large file sizes may be measured in megabytes, while data storage capacities are often measured in gigabytes or terabytes.\nNOTE:One kibibyte contains 1,024 bytes.  One mebibyte contains 1,024 x 1,024 or 1,048,576 bytes."
        ]
    },
    {
        "word": "Bytecode",
        "type": [],
        "definition": [
            "Bytecode is program code that has been compiled from source code into low-level code designed for a software interpreter.  It may be executed by a virtual machine (such as a JVM) or further compiled into machine code, which is recognized by the processor.\nDifferent types of bytecode use different syntax, which can be read and executed by the corresponding virtual machine.  A popular example is Java bytecode, which is compiled from Java source code and can be run on a Java Virtual Machine (JVM).  Below are examples of Java bytecode instructions.\n\nnew (create new object)\naload_0 (load reference)\nistore (store integer value)\nladd (add long value)\nswap (swap two values)\nareturn (return value from a function)\n\nWhile it is possible to write bytecode directly, it is much more difficult than writing code in a high-level language, like Java.  Therefore, bytecode files, such as Java .CLASS files, are most often generated from source code using a compiler, like javac.\nBytecode vs Assembly Language\nBytecode is similar to assembly language in that it is not a high-level language, but it is still somewhat readable, unlike machine language.  Both may be considered \"intermediate languages\" that fall between source code and machine code.  The primary difference between the two is that bytecode is generated for a virtual machine (software), while assembly language is created for a CPU (hardware)."
        ]
    },
    {
        "word": "Bézier Curve",
        "type": [],
        "definition": [
            "A Bézier (pronounced \"bez-E-A\") curve is a line or \"path\" used to create vector graphics.  It consists of two or more control points, which define the size and shape of the line.  The first and last points mark the beginning and end of the path, while the intermediate points define the path's curvature.\nBézier curves are used to create smooth curved lines, which are common in vector graphics.  Since they are defined by control points, Bézier curves can be resized without losing their smooth appearance.  Raster graphics, on the other hand, define each pixel within an image and appear blocky or pixleated when enlarged.\nThere are several types of Bézier curves, including linear, quadratic, and higher-order curves.  A linear curve is a straight line defined by two points.  A quadratic curve includes intermediate points that pull the control points, and therefore the path, in different directions.  A higher-order curve may include additional intermediate points that fine tune how the path follows each control point.\nThe shape of a Bézier curve is calculated using interpolation, a method of approximating the path of the line between each control point.   Since computer screens display graphics using pixels, Bézier curves are always approximated when displayed on a screen.  If you zoom in on a Bézier curve using a drawing program or CAD software, you will see a more accurate representation of the path.\nNOTE: Bézier curves are named after French engineer Pierre Bézier, which is why the \"B\" is always capitalized."
        ]
    },
    {
        "word": "bps",
        "type": [],
        "definition": [
            "Stands for \"Bits Per Second.\"  Bps is a standard way to measure data transfer rates, such as network connection and Internet download speeds.\nIn the early days of the Internet, data transfer speeds were measured in bps.  As Internet connection speeds increased, a variation of bps – Kbps (1,000 bps) – became more common.  Today, Internet connection speeds are often measured in Mbps (1,000,000 bps).  Some networks support speeds over 1,000 Mbps and are measured in Gbps.\nIt is important to abbreviate bits per second as \"bps\" (with a lowercase \"b\").  The lowercase \"b\" signifies bits rather than bytes.  Since a byte is eight bits, 100 Bps is equal to 800 bps.  Variations of Bps, such as megabytes per second or gigabytes per second are typically abbreviated with a slash, such as MB\/s or GB\/s.  These measurements are commonly used to define transfer speeds of internal components, such as HDDs and SSDs."
        ]
    }
]