[
    {
        "word": "C#",
        "type": [],
        "definition": [
            "C# (pronounced \"C Sharp\") is a programming language developed by Microsoft.  It was introduced in 2002 with version 1.0 of Microsoft's .NET Framework.  Since then, C# has gone through several revisions, corresponding with each .NET update.  Today, it is one of the most popular programming languages for creating Windows programs and web applications.\nC# is a derivative of the C programming language and is similar to C++.  It uses the same basic operators as C++, is object oriented, case sensitive, and has nearly identical syntax.  However, there are several differences between C# and C++.  Below are just a few examples:\n\nArrays in C++ are pointers, while in C#, they are objects that may include methods and properties.\nThe bool (boolean) data type is not recognized as an integer as it is in C++.\nThe keywords typedef, extern, and static all have different meanings in C# than they do in C++.\nC# switch statements do not support fall-through from one case to another.\nGlobal methods and variables are not supported in C#, while they are in C++.\n\nMost importantly, C# is designed specifically for Microsoft's .NET Framework.  This allows developers to take advantage of all the features offered by the .NET API.  However, it also means C# applications can only run on platforms that support .NET runtime, such as Windows, Windows Server, and Windows Phone.  In order for programs written in C# to run on other platforms, the code must be compiled using a conversion tool like Microsoft .NET Native.\nNOTE: The name \"C#\" comes from the musical note \"C♯,\" implying it is a step up from the original version of C.  The ♯ symbol is also comprised of four plus signs, which may imply C# is more advanced than C++ as well."
        ]
    },
    {
        "word": "C\/C++",
        "type": [],
        "definition": [
            "C is a high-level programming language that was developed in the mid-1970s.  It was originally used for writing Unix programs, but is now used to write applications for nearly every available platform.  Compared to most previous languages, C is easier to read, more flexible (can be used for a wide variety of purposes), and more efficient at using memory.\nC++, pronounced \"C plus plus,\" is a programming language that was built off the C language.  The syntax of C++ is nearly identical to C, but it has object-oriented features, which allow the programmer to create objects within the code.  This makes programming easier, more efficient, and some would even say, more fun.  Because of the power and flexibility of the language, most software programs today are written in C++."
        ]
    },
    {
        "word": "CAD",
        "type": [],
        "definition": [
            "Stands for \"Computer-Aided Design.\"  CAD is the use of computers to create 2D and 3D designs.  Common types of CAD include two-dimensional layout design and three-dimensional modeling.\n2D CAD has many applications, but it is commonly used to design vector-based layouts.  For example, architects may use CAD software to create overhead views of building floor plans and outdoor landscapes.  These layouts, which contain vector graphics, can be scaled to different sizes, which may be used for proposals or blueprints.  2D CAD also includes drawings, such as sketches and mockups, which are common at the beginning of the design process.\n3D CAD is commonly used in developing video games and animated films.  It also has several real-world applications, such as product design, civil engineering, and simulation modeling.  3D CAD includes computer-aided manufacturing (CAM), which involves the actual manufacturing of three-dimensional objects.   \nLike 2D CAD drawings, 3D models are typically vector-based, but the vectors include three dimensions, rather than two.  This allows designers to create complex 3D shapes that can be moved, rotated, enlarged, and modified.  Some 3D models are created exclusively of polygons, while others may include Bézier curves and other rounded surfaces.\nWhen creating a 3D model, a CAD designer may first construct the basic shape of the object, or \"wireframe.\"  Once the shape is complete, surfaces can be added that may include colors, gradients, or designs that can be applied using a process called texture mapping.  Many CAD programs include the ability to adjust lighting, which affects the shadows and reflections of the object.  Some programs also include a timeline that can be used to create 3D animations."
        ]
    },
    {
        "word": "CAN",
        "type": [],
        "definition": [
            "Stands for \"Campus Area Network.\"  A CAN is a network that covers an educational or corporate campus.  Examples include elementary schools, university campuses, and corporate buildings.\nA campus area network is larger than a local area network LAN since it may span multiple buildings within a specific area.  Most CANs are comprised of several LANs connected via switches and routers that combine to create a single network.  They operate similar to LANs, in that users with access to the network (wired or wireless) can communicate directly with other systems within the network.\nA college or university CAN may also be called a \"residential network\" or \"ResNet\" since it can only be accessed by campus residents, such as students and faculty.\nThe two primary benefits of a CAN are security and speed.\nSecurity\nUnlike a wide area network (WAN), a CAN is managed and maintained by a single entity, such as the campus IT  team.  The network administrators can monitor, allow, and limit access to the network.  Firewalls are typically placed between the CAN and the Internet to protect the network from unauthorized access.  A firewall or proxy server may also be used to limit the websites or Internet ports users can access.\nSpeed\nSince communication within a CAN takes place over a local network, data transfer speeds between systems within the network are often higher than typical Internet speeds.  This makes it easy to share large files with other users on the network.  For example, it may take several hours to upload a long video to a colleague over the Internet, but the transfer may only take a few minutes over a CAN.\nNOTE: CAN may also stand for \"Corporate Area Network\" or \"Controller Area Network.\""
        ]
    },
    {
        "word": "CCD",
        "type": [],
        "definition": [
            "Stands for \"Charged Coupled Device.\"  CCDs are sensors used in digital cameras and video cameras to record still and moving images.  The CCD captures light and converts it to digital data that is recorded by the camera.  For this reason, a CCD is often considered the digital version of film.\nThe quality of an image captured by a CCD depends on the resolution of the sensor.  In digital cameras, the resolution is measured in Megapixels (or thousands of or pixels.  Therefore, an 8MP digital camera can capture twice as much information as a 4MP camera.  The result is a larger photo with more detail.\nCCDs in video cameras are usually measured by physical size.  For example, most consumer digital cameras use a CCD around 1\/6 or 1\/5 of an inch in size.  More expensive cameras may have CCDs 1\/3 of an inch in size or larger.  The larger the sensor, the more light it can capture, meaning it will produce better video in low light settings.  Professional digital video cameras often have three sensors, referred to as \"3CCD,\" which use separate CCDs for capturing red, green, and blue hues."
        ]
    },
    {
        "word": "CD",
        "type": [],
        "definition": [
            "Stands for \"Compact Disc.\"  CDs are circular discs that are 4.75 in (12 cm) in diameter.  The CD standard was proposed by Sony and Philips in 1980 and the technology was introduced to the U.S. market in 1983.  CDs can hold up to 700 MB of data or 80 minutes of audio.  The data on a CD is stored as small notches on the disc and is read by a laser from an optical drive.  The drives translate the notches (which represent 1's and 0's) into usable data.\nThe first CDs were audio CDs, which eventually replaced audio tapes (which earlier replaced records).  Audio CDs have the advantage of allowing the user to jump to different places on the disc.  CDs can also be listened to an unlimited number of times without losing quality.  Audio tapes can start to lose quality after listening to them as few as ten times.  This is because the laser that reads the data on a CD doesn't put pressure on the disc, whereas the playheads on a tape deck slowly wear away the magnetic strip on the tape.\nIn 1985, CD-ROMs hit the computer market.  Because they could store far more information than floppy discs (700 MB compared to 1.4 MB), CDs soon became the most common software format.  In 1988, the CD-R (CD-Recordable) technology was introduced, allowing computer users to burn their own CDs.  However, this technology did not become mainstream until the late 1990s.  A smaller 3\" CD, called \"CD-3\" is also available and is readable by most tray-loading CD-ROM drives."
        ]
    },
    {
        "word": "CD-R",
        "type": [],
        "definition": [
            "Stands for \"Compact Disc Recordable.\"  CD-R discs are blank CDs that can record data written by a CD burner.  The word \"recordable\" is used because CD-Rs are often used to record audio, which can be played back by most CD players.  However, many other kinds of data can also be written to a CD-R, so the discs are also referred to as \"writable CDs.\"\nThe data burned onto a CD-R disc is permanent, meaning it can not be altered or erased like the data on a hard drive.  Typically, once a CD has been burned, it will not be able to record any more data.  Some CD burning programs can record data as \"sessions,\" allowing a disc to be written to mulitple times until it is full.  Each session creates a new partition on the disc, meaning a computer will read a disc with multiple sessions as multiple discs.  CD-RWs, on the other hand, can be erased and completely re-recorded.  Like CDs, the data on CD-RWs cannot be altered, meaning the disc has to be completely erased each time you want to add new data."
        ]
    },
    {
        "word": "CD-ROM",
        "type": [],
        "definition": [
            "Stands for \"Compact Disc Read-Only Memory.\"  A CD-ROM is a CD that can be read by a computer with an optical drive.  The \"ROM\" part of the term means the data on the disc is \"read-only,\" or cannot be altered or erased.  Because of this feature and their large capacity, CD-ROMs are a great media format for retail software.  The first CD-ROMs could hold about 600 MB of data, but now they can hold up to 700 MB.  CD-ROMs share the same technology as audio CDs, but they are formatted differently, allowing them to store many types of data."
        ]
    },
    {
        "word": "CD-RW",
        "type": [],
        "definition": [
            "Stands for \"Compact Disc Re-Writable.\"  A CD-RW is a blank CD that can be written to by a CD burner.  Unlike a CD-R (CD-Recordable), a CD-RW can be written to multiple times.  The data burned on a CD-RW cannot be changed, but it can be erased.  Therefore, you have to completely erase a CD-RW every time you want to change the files or add new data.  While it may be somewhat inconvenient, this capability makes CD-RWs a good choice for making frequent backups.  However, because CD-RWs can be erased, they don't store data reliably for as long as CD-Rs do.  Therefore, you should use regular CD-Rs for long-term backups."
        ]
    },
    {
        "word": "CDFS",
        "type": [],
        "definition": [
            "Stands for \"Compact Disc File System.\"  CDFS is a file system used for storing data on CDs.  It is a standard published by the International Organization for Standardization (ISO) and is also known as \"ISO 9660.\"  Discs that store data using the ISO 9660 standard can be recognized by multiple platforms, including Windows, Macintosh, and Linux systems.\nCDFS specifies several disc properties, including the volume attributes, file attributes, and file placement.  It also specifies the overall data structure of a CD, such as the header size and the data storage area of the disc.  While CDFS was originally designed for read-only single-session discs, an extension of the standard allows multiple-session writing to CD-R discs.  This means multiple volumes may be stored on a single CD.\nThe CDFS standard is useful for burning discs that will be shared between multiple computers.  Because CDFS is not specific to a single operating system, a disc burned on a Macintosh using the compact disk file system can be read on a Windows or Linux-based computer.  Disc images can also be saved using the CDFS standard, which may be used to burn ISO 9660 discs.  These files are typically saved with an .ISO file extension."
        ]
    },
    {
        "word": "CDMA",
        "type": [],
        "definition": [
            "Stands for \"Code Division Multiple Access.\"  CDMA is a wireless transmission technology that was developed during World War II by the English allies to avoid having their transmissions jammed.  After the war ended, Qualcomm patented the technology and made it commercially available as a digital cellular technology.  Now CDMA is a popular communications method used by many cell phone companies.\nUnlike the GSM and TDMA technologies, CDMA transmits over the entire frequency range available.  It does not assign a specific frequency to each user on the communications network.  This method, called multiplexing, is what made the transmissions difficult to jam during World War II.  Because CDMA does not limit each user's frequency range, there is more bandwidth available.  This allows more users to communicate on the same network at one time than if each user was allotted a specific frequency range.\nBecause CDMA is a digital technology, analog audio signals must be digitized before being transmitted on the network.  CDMA is used by 2G and 3G wireless communications and typically operates in the frequency range of 800 MHz to 1.9 GHz."
        ]
    },
    {
        "word": "CDN",
        "type": [],
        "definition": [
            "Stands for \"Content Delivery Network.\"  A CDN is a group of servers distributed in different locations.  Small CDNs may be located within a single country, while large CDNs are spread across data centers around the world.\nCDNs are used to provide content to users in different locations as quickly as possible.  For example, a user in San Francisco may receive website content from a server in Los Angeles, while a user in England may receive the same content from a server in London.  This is accomplished using data replication, which stores the same data on multiple servers.  Whenever you access a website hosted on a CDN, the network will intelligently provide you with the content using the server closest to the your geographical location.\nBy providing Internet-based content over a CDN, large businesses can avoid bottlenecks associated with serving data from a single location.  It also helps limit the impact of security breaches, such as denial of service attacks.  If hardware fails on one server, the CDN can quickly reroute traffic to the next best server, limiting or even eliminating downtime.\nWhile CDNs are often used to host websites, they are commonly used to provide other types of downloadable data as well.  Examples include software programs, images, videos, and streaming media.  Cloud computing services are often provided over content delivery networks as well.  Since CDNs automatically choose the best server for each user, there is no need to manually choose the most efficient location, like some FTP download services require.\nNOTE: While CDNs are often accessed via standard URLs, many CDNs include the letters \"cdn\" in their web address."
        ]
    },
    {
        "word": "CGI",
        "type": [],
        "definition": [
            "CGI has two different meanings: 1) Common Gateway Interface, and 2) Computer Generated Imagery.\n1) Common Gateway Interface\nThe Common Gateway Interface (CGI) is a set of rules for running scripts and programs on a web server.  It specifies what information is communicated between the web server and clients' Web browsers and how the information is transmitted.\nMost Web servers include a cgi-bin directory in the root folder of each website on the server.  Any scripts placed in this directory must follow the rules of the Common Gateway Interface.  For example, scripts located in the cgi-bin directory may be given executable permissions, while files outside the directory may not be allowed to be executed.  A CGI script may also request CGI environment variables, such as SERVER_PROTOCOL and REMOTE_HOST, which may be used as input variables for the script.\nSince CGI is a standard interface, it can be used on multiple types of hardware platforms and is supported by several types Web server software, such as Apache and Windows Server.  CGI scripts and programs can also be written in several different languages, such as C++, Java, and Perl.  While many websites continue to use CGI for running programs and scripts, developers now often include scripts directly within Web pages.  These scripts, which are written in languages such as PHP and ASP, are processed on the server before the page is loaded, and the resulting data is sent to the user's browser.\n2) Computer Generated Imagery\nIn the computer graphics world, CGI typically refers to Computer Generated Imagery.  This type of CGI refers to 3D graphics used in film, TV, and other types of visual media.  Most modern action films include at least some CGI for special effects, while other movies, such as Pixar animated films, are built completely from computer-generated graphics."
        ]
    },
    {
        "word": "CIFS",
        "type": [],
        "definition": [
            "Stands for \"Common Internet File System.\"  CIFS is a standard file system designed for sharing files over the Internet.  It is part of the SMB protocol, which allows multiple types of computers to share data and peripherals over a network.  CIFS enables users to access files remotely from multiple platforms, including Windows, Mac, Linux, and others.\nEach operating system has its own file system, which defines how files and folders are organized.  For example, most Windows computers use NTFS, while Macs user HFS.  Proprietary file systems are fine when accessing files locally (from the computer itself), but it can cause compatibility issues when users try to access files from a remote system.  If the remote device does not recognize the file system of the computer, it won't be able read the files.  CIFS solves this problem by serving as a universal file system that is supported by multiple platforms.\nThe Common Internet File System provides a standard set of commands that computers can use to access a remote system and read and write files remotely.  It supports both anonymous file transfers and authenticated access, which can be used to prevent unauthorized access to certain folders and files.  CIFS also includes file locking, which prevents multiple users from editing the same file at the same time."
        ]
    },
    {
        "word": "CISC",
        "type": [],
        "definition": [
            "Stands for \"Complex Instruction Set Computing.\"  This is a type of microprocessor design.  The CISC architecture contains a large set of computer instructions that range from very simple to very complex and specialized.  Though the design was intended to compute complex instructions in the most efficient way, it was later found that many small, short instructions could compute complex instructions more efficiently.  This led to a design called Reduced Instruction Set Computing (RISC), which is now the other major kind of microprocessor architecture.  Intel Pentium processors are mainly CISC-based, with some RISC facilities built into them, whereas the PowerPC processors are completely RISC-based."
        ]
    },
    {
        "word": "CLOB",
        "type": [],
        "definition": [
            "Stands for \"Character Large Object.\"  A CLOB is a data type used by various database management systems, including Oracle and DB2.  It stores large amounts of character data, up to 4 GB in size.  The CLOB data type is similar to a BLOB, but includes character encoding, which defines a character set and the way each character is represented.  BLOB data, on the other hand, consists of unformatted binary data.\nCommon data types used for storing character data include char, varchar, and text.  Some database management systems also support additional text data types such as tinytext, mediumtext, and longtext.  If the standard character data types are not large enough for a certain database field, the CLOB data type may be used.  Since CLOB data may be very large, some database management systems do not store the text directly in the table.  Instead, the CLOB field serves as an address, which references the location of the data.\nCLOBs provide a way to store unusually large amounts of text, such as an entire book or publication.  However, some database programs cannot run certain text operations on CLOB fields, such SQL commands with the \"LIKE\" condition.  Therefore, it is often better to use other character data types for smaller text values."
        ]
    },
    {
        "word": "CMOS",
        "type": [],
        "definition": [
            "Stands for \"Complementary Metal Oxide Semiconductor.\"  It is a technology used to produce integrated circuits.  CMOS circuits are found in several types of electronic components, including microprocessors, batteries, and digital camera image sensors.\nThe \"MOS\" in CMOS refers to the transistors in a CMOS component, called MOSFETs (metal oxide semiconductor field-effect transistors).  The \"metal\" part of the name is a bit misleading, as modern MOSFETs often use polysilicon instead of aluminum as the conductive material.  Each MOSFET includes two terminals (\"source\" and \"drain\") and a gate, which is insulated from the body of the transistor.  When enough voltage is applied between the gate and body, electrons can flow between the source and drain terminals.\nThe \"complimentary\" part of CMOS refers to the two different types of semiconductors each transistor contains — N-type and P-type.  N-type semiconductors have a greater concentration of electrons than holes, or places where an electron could exist.  P-type semiconductors have a greater concentration of holes than electrons.  These two semiconductors work together and may form logic gates based on how the circuit is designed.\nCMOS Advantages\nCMOS transistors are known for their efficient use of electrical power.  They require no electrical current except when they are changing from one state to another.  Additionally, the complimentary semiconductors work together to limit the output voltage.  The result is a low-power design that gives off minimal heat.  For this reason, CMOS transistors have replaced other previous designs (such as CCDs in camera sensors) and are used in most modern processors.\nNOTE: CMOS memory in a computer is a type of non-volatile RAM (NVRAM) that stores BIOS settings and date\/time information."
        ]
    },
    {
        "word": "CMS",
        "type": [],
        "definition": [
            "Stands for \"Content Management System.\"  A CMS is a software tool that allows you to create, edit, and publish content.  While early CMS software was used to manage documents and local computer files, most CMS systems are now designed exclusively to manage content on the Web.\nThe goal of a CMS is to provide an intuitive user interface for building and modifying webpage content.  Each CMS also provides a web publishing tool that allows one or more users to publish updates live on the Web.  The editing component is called the content management application (CMA), while the publishing tool is called the content delivery application (CDA).  These two components are integrated together in a CMS to streamline the web development process.\nContent management systems are available as installable applications and web-based user interfaces.  While CMS software programs, such as Adobe Contribute, were popular for a few years, they have largely been replaced by web-based CMSes.  Most people prefer a web interface, since it simplifies the website updating process.  Additionally, most web-based CMSes are updated automatically, ensuring all users have the latest tools to manage their content.\nSeveral web-based CMS tools are available.  The following are some of the most popular ones:\n\nWordPress - free web software designed for creating template-based websites or blogs\nBlogger - Google's blogging tool designed specifically for maintaining a blog\nJoomla - a flexible web publishing tool that supports custom databases and extensions\nDrupal - an open source platform often used for developing community-based sites\nWeebly - a web-based platform for building simple personal and business websites\nWix - a collection of web publishing tools for creating a highly customizable website\n\nSome CMS tools are free to use, while others require a monthly fee.  Many CMSes provide free basic components, but charge for high-quality templates, web hosting, custom domain names, or other features.  Before deciding on a CMS, it is a good idea to review multiple options so you can choose the one that best fits your website goals."
        ]
    },
    {
        "word": "CMYK",
        "type": [],
        "definition": [
            "Stands for \"Cyan Magenta Yellow Black.\"  These are the four basic colors used for printing color images.  Unlike RGB (red, green, blue), which is used for creating images on your computer screen, CMYK colors are \"subtractive.\"  This means the colors get darker as you blend them together.  Since RGB colors are used for light, not pigments, the colors grow brighter as you blend them or increase their intensity.\nTechnically, adding equal amounts of pure cyan, magenta, and yellow should produce black.  However, because of impurities in the inks, true black is difficult to create by blending the colors together.  This is why black (K) ink is typically included with the three other colors.  The letter \"K\" is used to avoid confusion with blue in RGB."
        ]
    },
    {
        "word": "CORS",
        "type": [],
        "definition": [
            "Stands for \"Cross-Origin Resource Sharing.\"  CORS allows scripts on webpages to request resources from other domains.  Most web browsers block these types of requests by default for security purposes.\nA webpage can request resources from another domain — as long as the requests come from the HTML.  For example, the &lt;head&gt; section may reference resources, such as CSS files, fonts, and JS files other domains.  Examples include Google Analytics scripts, jQuery libraries, and fonts hosted on another server.  Similarly, the &lt;body&gt; can request images from a CDN or other domain.  Cross-origin resource requests in the HTML do not require CORS permissions.\nWhen a script or iframe element makes a cross-origin request, CORS is required.  For example, an AJAX method – which runs after the page is loaded – cannot request a resource from another domain.  CORS overrides this default browser setting and allows the request to go through.\nCORS is implemented using \"access control\" HTTP headers.  A server admin can add or modify the response headers, which are sent to a client's browser when a webpage is accessed.  These settings, which can be applied to Apache and IIS servers, may be site-specific or server-wide.  Below are common request and response headers:\nCORS Request Headers:\n\nOrigin\nAccess-Control-Request-Method\nAccess-Control-Request-Headers\n\nCORS Response Headers:\n\nAccess-Control-Allow-Origin\nAccess-Control-Allow-Methods\nAccess-Control-Expose-Headers\n\nCORS Example\nIf a script on techterms.com requests a resource from sharpened.com using a GET action, it may send the following request headers:\n[cb]\nOrigin: https:\/\/techterms.com\nAccess-Control-Request-Method: GET\n[\/cb]\nTo allow the request, sharpened.com may respond with the following headers:\n[cb]\nAccess-Control-Allow-Origin: https:\/\/techterms.com\nAccess-Control-Allow-Methods: GET\n[\/cb]\nAccess-Control-Allow-Origin can be set to specific domains or a wildcard using an asterisk (*).  The wildcard setting allows cross-resource requests from all domains, which may be a security risk.  Access-Control-Allow-Methods can be set to PUT, POST, DELETE, and others, including a wildcard (*) setting that allows all methods."
        ]
    },
    {
        "word": "CPA",
        "type": [],
        "definition": [
            "Stands for \"Cost Per Action,\" and is used in online advertising.  CPA defines how much revenue a publisher receives when a user clicks an advertisement on his website and then completes a certain action.  For example, a publisher may place a banner or text link from an advertiser on his website.  When a user clicks the link, she is directed to the advertiser's website.  She might then be asked to fill out a form or take a survey.  If she completes the form or survey, the action has been completed, and the advertiser pays the publisher a certain amount based on the CPA.\nCPA and CPL (cost per lead) are often used interchangeably, though CPA is more generic."
        ]
    },
    {
        "word": "CPC",
        "type": [],
        "definition": [
            "Stands for \"Cost Per Click,\" and is used in online advertising.  CPC defines how much revenue a publisher receives each time a user clicks an advertisement link on his website.  For example, a publisher may place text or image-based ads on his website.  When a visitor clicks one of the advertisements, he or she is directed to the advertiser's website.  Each click is recorded by the advertiser's tracking system and the publisher is paid a certain amount based on the CPC."
        ]
    },
    {
        "word": "CPL",
        "type": [],
        "definition": [
            "Stands for \"Cost Per Lead,\" and is used in online advertising.  CPL defines how much revenue a publisher receives when he creates a lead for an advertiser.  For example, the publisher may place an ad for an investment site on his website.  If a user clicks on the advertisement link, she is directed to the advertiser's website where she can sign up for an investment account.  If she chooses to sign up, a lead has been created and the publisher is paid a certain amount based on the CPL.\nCPL and CPA (cost per action) are often used interchangeably, though CPL is more specific."
        ]
    },
    {
        "word": "CPM",
        "type": [],
        "definition": [
            "Stands for \"Cost Per 1,000 Impressions,\" and is used in online advertising.  CPM defines the cost an advertiser pays for 1,000 impressions of an advertisement, such as a banner ad or other promotion.  An impression is counted each time an advertisement is shown.\nWhile some advertisers pay publishers an amount based strictly on impressions, most advertisers pay for individual clicks or leads generated from their advertisements.  Therefore, in Web advertising, it may be more effective to measure pay per click (PPC) or pay per lead (PPL) rates.  Either way, the advertiser's goal is to generate as many leads as possible by keeping the rates as low as possible.\nWeb publishers also use the CPM to measure the revenue per 1,000 impressions.  While technically this should be \"revenue per 1,000 impressions,\" or RPM, the terms CPM and RPM are often used interchangeably from the publisher's perspective."
        ]
    },
    {
        "word": "CPS",
        "type": [],
        "definition": [
            "Stands for \"Classroom Performance System.\"  CPS refers to a technology system that is used for educational purposes within a classroom.  It includes both hardware and software that works together to create a modern, interactive learning environment for students.  A typical CPS classroom setup includes a projector, a CPS Chalkboard, a computer running CPS software, and response pads that are given to the students.\nIn a CPS-enabled classroom, the teacher can use a handheld CPS Chalkboard to give lessons or tests that are visually displayed on the projector.  The students can interact with the lesson or test by using the response pads, which are similar to remote controls.  Each response pad has several buttons (i.e. A through H), which can be used to answer test questions displayed on the projector in real-time.  This allows each student to answer every question in a more systematic way than everyone yelling out the answer at one time.\nCPS has been shown to improve kids' learning capabilities and retention of subject matter.  Because each student is able to interact with every aspect of the lesson, CPS can significantly increase students' interest in the subject matter.  Considering how difficult it can be to keep kids' attention these days, many teachers may find CPS to be a welcome new technology."
        ]
    },
    {
        "word": "CPU",
        "type": [],
        "definition": [
            "Stands for \"Central Processing Unit.\"  The CPU is the primary component of a computer that processes instructions.  It runs the operating system and applications, constantly receiving input from the user or active software programs.  It processes the data and produces output, which may be stored by an application or displayed on the screen.\nThe CPU contains at least one processor, which is the actual chip inside the CPU that performs calculations.  For many years, most CPUs only had one processor, but now it is common for a single CPU to have at least two processors or \"processing cores.\"  A CPU with two processing cores is called a dual-core CPU and models with four cores are called quad-core CPUs.  High-end CPUs may have six (hexa-core) or even eight (octo-core) processors.  A computer may also have more than one CPU, which each have multiple cores.  For example, a server with two hexa-core CPUs has a total of 12 processors.\nWhile processor architectures differ between models, each processor within a CPU typically has its own ALU, FPU, register, and L1 cache.  In some cases, individual processing cores may have their own L2 cache, though they can also share the same L2 cache.  A single frontside bus routes data between the CPU and the system memory.\nNOTE: The terms \"CPU\" and \"processor\" are often used interchangeably.  Some technical diagrams even label individual processors as CPUs.  While this verbiage is not incorrect, it is more accurate (and less confusing) to describe each processing unit as a CPU, while each processor within a CPU is a processing core."
        ]
    },
    {
        "word": "CRM",
        "type": [],
        "definition": [
            "Stands for \"Customer Relationship Management.\"  This is a business term that started somewhere in the deep abyss of the IT (Information Technology) world.  CRM refers to solutions and strategies for managing businesses' relationships with customers. (I suppose that's why they call it customer relationship management).  With the advent of Web retailing, companies have found it hard to develop relationships with customers since the e-commerce interface is so impersonal.  After all, don't you miss the firm handshake and sparkling smile of the salesperson who just sold you the most expensive computer system in the store?  Well, whether or not you miss the personal experience of the retail store, the goal of CRM is to give you that feeling when you buy products over the Internet.  When it comes to CRM, customer service is the number one priority.  Yes, all companies seem to make that claim, but when online businesses create CRM models, it really is the case."
        ]
    },
    {
        "word": "CRT",
        "type": [],
        "definition": [
            "Stands for \"Cathode Ray Tube.\"  CRT is the technology used in traditional computer monitors and televisions.  The image on a CRT display is created by firing electrons from the back of the tube to phosphors located towards the front of the display.  Once the electrons hit the phosphors, they light up and are projected on the screen.  The color you see on the screen is produced by a blend of red, blue, and green light, often referred to as RGB.\nThe stream of electrons is guiding by magnetic charges, which is why you may get interference with unshielded speakers or other magnetic devices that are placed close to a CRT monitor.  Flat screen or LCD displays don't have this problem, since they don't require a magnetic charge.  LCD monitors also don't use a tube, which is what enables them to be much thinner than CRT monitors.  While CRT displays are still used by graphics professionals because of their vibrant and accurate color, LCD displays now nearly match the quality of CRT monitors.  Therefore, flat screen displays are well on their way to replacing CRT monitors in both the consumer and professional markets."
        ]
    },
    {
        "word": "CSS",
        "type": [],
        "definition": [
            "Stands for \"Cascading Style Sheet.\"  Cascading style sheets are used to format the layout of Web pages.  They can be used to define text styles, table sizes, and other aspects of Web pages that previously could only be defined in a page's HTML.\nCSS helps Web developers create a uniform look across several pages of a Web site.  Instead of defining the style of each table and each block of text within a page's HTML, commonly used styles need to be defined only once in a CSS document.  Once the style is defined in cascading style sheet, it can be used by any page that references the CSS file.  Plus, CSS makes it easy to change styles across several pages at once.  For example, a Web developer may want to increase the default text size from 10pt to 12pt for fifty pages of a Web site.  If the pages all reference the same style sheet, the text size only needs to be changed on the style sheet and all the pages will show the larger text.\nWhile CSS is great for creating text styles, it is helpful for formatting other aspects of Web page layout as well.  For example, CSS can be used to define the cell padding of table cells, the style, thickness, and color of a table's border, and the padding around images or other objects.  CSS gives Web developers more exact control over how Web pages will look than HTML does.  This is why most Web pages today incorporate cascading style sheets."
        ]
    },
    {
        "word": "CSV",
        "type": [],
        "definition": [
            "Stands for \"Comma-Separated Values.\"  CSV is a standard way to store structured data in a plain text format.  It is a common export option in desktop applications and some websites.  Most spreadsheet programs can import data from a .CSV file.\nA list of comma-separated values represents a table.  Each line in a CSV file is a row and the value between each comma is a column.  The first row is often a table header containing labels for each column.  Since the data in a CSV file represents a table, each line should have the same number of comma-separated values.\nCSV Format\nSince CSV files use the comma character \",\" to separate columns, values that contain commas must be handled as a special case.  These fields are wrapped within double quotation marks.  The first double quote signifies the beginning of the column data, and the last double quote marks the end.  If the value contains a string with double quotes, these are replaced by two double quotes, or \"\".\nBelow are some standard CSV formatting rules:\n\nTable data is represented using only plain text.\nThe first line may or may not represent the table header.\nRows are separted by line breaks (newline characters).\nColumns (fields) are separated by commas.\nAll lines contain the same number of values.\nFields that contain commas must begin and end with double quotes.\nFields that contain line breaks must begin and end with double quotes (not all programs support values with line breaks).\nAll other fields do not require double quotes.\nDouble quotes within values are represented by two contiguous double quotes.\n\nExample CSV Data\nThe following three lines represent a table with three rows and four columns, starting with a table header.\n[cb]\nID,Website,URL,Description\n1,TechTerms,https:\/\/techterms.com,\"TechTerms, the Computer Dictionary\"\n2,Slangit,https:\/\/slangit.com,\"Slangit, the \"\"Clean Slang\"\" Dictionary\"\n[\/cb]\nThe data above may be displayed in a table like this:\n\nIDWebsiteURLDescription\n1TechTermshttps:\/\/techterms.comTechTerms, the Computer Dictionary\n2Slangithttps:\/\/slangit.comSlangit, the \"Clean Slang\" Dictionary\n\nUsing CSV Files\nA *.csv file can be opened, viewed, and edited in any text editor.  However, because of the minimalistic nature of the CSV format, the data is often difficult to read.  Therefore, it is best to view CSV files in a spreadsheet program like Microsoft Excel or Apple Numbers.  These applications parse the comma-delimited data and display the values as a table within a spreadsheet.\nFile extension: .CSV"
        ]
    },
    {
        "word": "CTP",
        "type": [],
        "definition": [
            "Stands for \"Composite Theoretical Performance.\"  CTP is used to measure the performance of computer processors.  The values returned by CTP calculations are used for benchmarking purposes, which compare the performance of different processors.  For example, Intel and AMD use CTP calculations to measure how many millions of theoretical operations per second (MTOPS) their processors can perform.  An Intel Pentium M 770, which runs at 2.13 GHz, has a CTP of 7100 MTOPs, while an AMD Opteron 146, which runs at 2.0 GHz, has a CTP of 7168 MTOPS.\nAs seen in the example above, faster processor speeds do not always result in a higher CTP.  Other considerations, such as the processor's architecture and the speed of the frontside bus also affect the overall performance.  CTP is useful for comparing different brands of processors, as well as comparing different models of processors made by the same company.  With dual and quad processors becoming more prevalent, CTP is now also being used to measure the performance increase when multiple processors are used together.\nCTP also stands for \"Computer to Plate.\"  This is a process where printing plates are made without using costly film.  Instead, the images are sent directly to the plate from the computer."
        ]
    },
    {
        "word": "CTR",
        "type": [],
        "definition": [
            "Stands for \"Click-Through Rate,\" and is used in online advertising.  Web publishers typically generate revenue from advertisers each time a visitor clicks on one of the advertisements (the PPC model).  Therefore, publishers are interested what percentage of page views result in clicks on the advertisements.  The higher the click-through rate, the more revenue a publisher will generate.  So, what would you guess is a common CTR for a website?  10%?  5%?  Try 1%.  Since the average CTR across the web is only around 1%, publishers need to attract thousands of visitors each day to generate substantial revenue."
        ]
    },
    {
        "word": "CUDA",
        "type": [],
        "definition": [
            "Stands for \"Compute Unified Device Architecture.\"  CUDA is a parallel computing platform developed by NVIDIA and introduced in 2006.  It enables software programs to perform calculations using both the CPU and GPU.  By sharing the processing load with the GPU (instead of only using the CPU), CUDA-enabled programs can achieve significant increases in performance.\nCUDA is one of the most widely used GPGPU (General-Purpose computation on Graphics Processing Units) platforms.  Unlike OpenCL, another popular GPGPU platform, CUDA is proprietary and only runs on NVIDIA graphics hardware.  However, most CUDA-enabled video cards also support OpenCL, so programmers can choose to write code for either platform when developing applications for NVIDIA hardware.\nWhile CUDA only supports NVIDIA hardware, it can be used with several different programming languages.  For example, NVIDIA provides APIs and compilers for C and C++, Fortran, and Python.  The CUDA Toolkit, a development environment for C\/C++ developers, is available for Windows, OS X, and Linux."
        ]
    },
    {
        "word": "Cable Management",
        "type": [],
        "definition": [
            "Cable management is the organization of cables connected to electrical devices.  This includes power cables, network cables, audio\/video cables, and many others.  Managing cables is a key aspect of a clean and safe home or work environment.\nElectrical devices often require multiple cables.  For example, a desktop computer may require a power cord, Ethernet cable, and multiple USB cables for peripheral devices.  A home theater system may include multiple power cables, as well as A\/V cables for HDMI and analog audio connections.  The resulting pile of cables, if not managed properly, can easily become a tangled mess.\nCable management offers several benefits:\n\nIt provides a cleaner workspace or living area.\nIt makes it easier to add or remove devices and cables.\nIt protects cables from crimping or other damage.\nIt prevents cables from disconnecting unexpectedly.\nIt limits interference from other cables.\n\nCable management may be as simple as a tying a few cables together with adjustable cable clips.  This type of cable management is often all that is required for a home computer setup.  In some cases, a cable sleeve or a cable cover below a desk may help move cables out of the way.\nManaging cables can also be a complex process.  For example, network engineers may need to organize hundreds of network cables from a server rack that connect to power outlets or network switches.  This type of organization requires choosing the right cable length and correct cable management sleeves so that cables can be easily added or removed.\nRegardless of the application, cable management is an important part of any electronic setup.  Simple cable management accessories, such as cable ties and cable sleeves, can turn a tangled pile of cables into a clean and organized space."
        ]
    },
    {
        "word": "Cable Modem",
        "type": [],
        "definition": [
            "A cable modem is a peripheral device used to connect to the Internet.  It operates over coax cable TV lines and provides high-speed Internet access.  Since cable modems offer an always-on connection and fast data transfer rates, they are considered broadband devices.\nDial-up modems, which were popular in the early years of the Internet, offered speeds close to 56 Kbps over analog telephone lines.  Eventually, DSL and cable modems replaced dial-up modems since they offered much faster speeds.  Early cable modems provided download and upload speeds of 1 to 3 Mbps, 20 to 60 times faster than the fastest dial-up modems.  Today, standard cable Internet access speeds range from 25 to 50 Mbps.  On the high end, Comcast offers an \"Xfinity Extreme\" service with speeds up to 505 Mbps.\nMost cable modems include a standard RJ45 port that connects to the Ethernet port on your computer or router.  Since most homes now have several Internet-enabled devices, cable modems are typically connected to a home router, allowing multiple devices to access the Internet.  Some cable modems even include a built-in wireless router, eliminating the need for a second device.\nNOTE: While \"cable modem\" includes the word \"modem,\" it does not function as a traditional modem (which is short for \"modulator\/demodulator\").  Cable modems send and receive information digitally, so there is no need to modulate an analog signal."
        ]
    },
    {
        "word": "Cache",
        "type": [],
        "definition": [
            "Cache, which is pronounced \"cash\" (not \"catch\" or \"cashay\"), stores recently used information so that it can be quickly accessed at a later time.  Computers incorporate several different types of caching in order to run more efficiently, thereby improving performance.  Common types of caches include browser cache, disk cache, memory cache, and processor cache.\n\nBrowser cache - Most web browsers cache webpage data by default.  For example, when you visit a webpage, the browser may cache the HTML, images, and any CSS or JavaScript files referenced by the page.  When you browse through other pages on the site that use the same images, CSS, or JavaScript, your browser will not have to re-download the files.  Instead, the browser can simply load them from the cache, which is stored on your local hard drive.\nMemory cache - When an application is running, it may cache certain data in the system memory, or RAM.  For example, if you are working on a video project, the video editor may load specific video clips and audio tracks from the hard drive into RAM.  Since RAM can be accessed much more quickly than a hard drive, this reduces lag when importing and editing files.\nDisk cache - Most HDDs and SSDs include a small amount of RAM that serves as a disk cache.  A typical disk cache for a 1 terabyte hard drive is 32 megabytes, while a 2 TB hard drive may have a 64 MB cache.  This small amount of RAM can make a big difference in the drive's performance.  For example, when you open a folder with a large number of files, the references to the files may be automatically saved in the disk cache.  The next time you open the folder, the list of files may load instantly instead of taking several seconds to appears.\nProcessor cache - Processor caches are even smaller than disk caches.  This is because a processor cache contains tiny blocks of data, such as frequently used instructions, that can be accessed quickly by the CPU.  Modern processors often contain an L1 cache that is right next to the processor and an L2 cache that is slightly further away.  The L1 cache is the smallest (around 64 KB), while the L2 cache may be around 2 MB in size.  Some high-end processors even include an L3 cache, which is larger than the L2 cache.  When a processor accesses data from a higher-level cache, it may also move the data to the lower-level cache for faster access next time.\n\nMost caching is done in the background, so you won't even notice it is happening.  In fact, the only one of the above caches that you can control is the browser cache.  You can open your browser preferences to view the cache settings and alter the size of your browser cache or empty the cache if needed."
        ]
    },
    {
        "word": "CamelCase",
        "type": [],
        "definition": [
            "camelCase is a naming convention in which the first letter of each word in a compound word is capitalized, except for the first word.  Software developers often use camelCase when writing source code.\ncamelCase is useful in programming since element names cannot contain spaces.  The camelCase naming convention makes compound names more readable.  For example, myOneMethod is easier to read than myonemethod.\nOther examples of camelCase are listed below:\n\nnewString;\ngetNewString()\nmyVariableName;\n\nThe name camelCase (also \"camel case\" or \"dromedary case\") comes from the hump on a camel, which is represented by the capital letter in the middle of the compound word.  A camelCase word may have one or more capital letters.\ncamelCase vs PascalCase\ncamelCase is similar to PascalCase, which capitalizes the first letters of all words in a compound word, including the first word.  For example, myFunction() in PascalCase would be MyFunction().  Programmers may choose to use either font case when writing source code, since it does not affect the syntax.  While each developer can choose his or her preferred style, some programming languages have standard naming conventions.  For example, in Java, the following cases are recommended:\n\nClasses: PascalCase — class VectorImage {}\nMethods: camelCase — drawImage()\nVariables: camelCase — string newImageName\n\nNOTE: PascalCase is sometimes called \"UpperCamelCase,\" while standard camelCase may be specified as \"lowerCamelCase.\"  In recent years, developers have moved away from these terms and use PascalCase and camelCase instead."
        ]
    },
    {
        "word": "Camera RAW",
        "type": [],
        "definition": [
            "A camera RAW image is an unprocessed photograph captured with a digital camera.  It contains the raw image data captured by the camera's sensor (or CCD), saved in proprietary file format specific to the camera manufacturer.\nBy default, most digital cameras process and compress photos as JPEG files immediately after capturing the image.  The processing step automatically applies the appropriate color correction and the JPEG compression significantly reduces the file size.  The result is an efficiently processed JPEG image.\nWhile JPEG images are suitable for most purposes, professional photographers and photography enthusiasts prefer to control over how each image is processed.  Therefore, many high-end cameras have the ability to shoot in RAW mode instead of JPEG.  The raw files are unprocessed, allowing the photographer to adjust settings like exposure, white balance, and saturation after the image has been captured.  Instead of applying lossy JPEG compression, which reduces the image quality, RAW mode saves files in a losslessly compressed format.\nBecause Camera RAW files are uncompressed, they take up more space than typical JPEG images.  In fact, RAW files often require 5 to 10 times more disk space for each image captured.  So you'll want to have a large memory card in your camera if you plan on shooting in RAW mode.\nViewing Camera RAW Files\nSince Camera RAW files are not saved in a standard image format, image viewing programs may not recognize them.  Even if a program supports the Canon RAW format, it may not recognize a RAW file saved by a newly released Canon camera.  Therefore, camera manufacturers often include proprietary RAW photo editing software with their high-end cameras.  Additionally, popular operating systems and software programs are regularly updated with support for new RAW formats.\nFile extensions: .ARW (Sony), .CR2 (Canon), .DCR (Kodak), .DNG (Adobe), .ERF (Epson), .NEF (Nikon), .ORF (Olympus), .PEF (Pentax), .RAF (Fuji), .RW2 (Panasonic)"
        ]
    },
    {
        "word": "Caps Lock",
        "type": [],
        "definition": [
            "Caps lock is a feature nearly all keyboards have that, when active, capitalizes each letter typed on the keyboard.  Unlike most keys on the keyboard, the caps lock key is a \"toggle key,\" which is always in either an on or off position.  When off, the letters typed are input like usual.  When on, each letter typed is transmitted as an upper-case character.  Caps lock does not alter the input from the rest of the keys, such as numbers and symbols.\nBecause caps lock changes the input of the letters on the keyboard, it is important to know whether it is on or off.  Therefore, most keyboards have a light on the caps lock key that turns on when active, indicating caps lock is on.  Because passwords are often case-sensitive, it is smart to make sure caps lock is not active when entering login information.  Also, it is best not to use caps lock when typing e-mails because IT MAKES IT SEEM LIKE YOU ARE YELLING when you type in all caps."
        ]
    },
    {
        "word": "Captcha",
        "type": [],
        "definition": [
            "A captcha is program used to verify that a human, rather than a computer, is entering data.  Captchas are commonly seen at the end of online forms and ask the user to enter text from a distorted image.  The text in the image may be wavy, have lines through it, or may be highly irregular, making it nearly impossible for an automated program to recognize it.  (Of course, some captchas are so distorted that they can be difficult for humans to recognize as well.)  Fortunately, most captchas allow the user to regenerate the image if the text is too difficult to read.  Some even include an auditory pronunciation feature.\nBy requiring a captcha response, webmasters can prevent automated programs, or \"bots,\" from filling out forms online.  This prevents spam from being sent through website forms and ensures that wikis, such as Wikipedia, are only edited by humans.  Captchas are also used by websites such as Ticketmaster.com to make sure users don't bog down the server with repeated requests.  While captchas may be a minor inconvenience to the user, they can save webmasters a lot of hassle by fending off automated programs.\nThe name \"captcha\" comes from the word \"capture,\" since it captures human responses.  It may also be written \"CAPTCHA,\" which is an acronym for \"Completely Automated Public Turing test to tell Computers and Humans Apart.\""
        ]
    },
    {
        "word": "Card Reader",
        "type": [],
        "definition": [
            "\"Card reader\" is the generic term for an input device that reads flash memory cards.  It can be a standalone device that connects to a computer via USB or it may be integrated into a computer, printer, or multifunction device.  In fact, most multifunction printer\/scanner\/copiers now have built-in card readers.\nMost card readers accept multiple memory card formats, including compact flash (CF), secure digital (SD), and Sony's Memory Stick.  Some card readers accept various other formats such as XD, SmartMedia, Microdrive, and Memory Stick Pro Duo cards.\nThe purpose of a card reader is, not surprisingly, to read the data from a memory card.  When you place a memory card into a card reader, it will often show up on your computer as a mounted disk.  You can then view the contents of the memory card by double-clicking the card's icon.  This icon typically appears on the desktop of Macintosh computers or inside \"My Computer\" on Windows machines.\nSince memory cards most often contain pictures from digital cameras, a photo organization program may automatically open when you insert a memory card into your card reader.  This provides an easy way of importing your pictures into your photo album.  If you don't want to import photos using the program, you can simply close the program and the card will still be mounted on your computer.\nOnce you decide to remove the card, make sure you unmount or \"eject\" the disk before physically removing the card.  This will help prevent the data on the card from becoming corrupted."
        ]
    },
    {
        "word": "Cat 5",
        "type": [],
        "definition": [
            "Cat 5 (short for \"Category 5\") is a type of Ethernet cable.  It supports data transfer rates of up to 100 Mbps, or 12.5 megabytes per second.  Cat 5 cables operate at a 100 MHz frequency and can extend up to 100 meters between connected devices.\nEach Cat 5 cable has eight internal wires, or four \"twisted pairs.\"  These pairs, which are color-coded, may be wired two different ways into the RJ45 connector.  A Cat 5 cable with the same wiring on each end is a \"patch cable,\" while one that is wired differently on each end is a \"crossover cable.\"\nCategory 5 Ethernet cables were commonly used for creating local area networks in the late 1990s and early 2000s.  Since they supported 100 Mbps transfer rates, they were sufficient for 100BASE-T \"Fast Ethernet\" networks.  In 2001, Cat 5e cables, which support 1000BASE-T (Gigabit Ethernet), began to replace Cat 5 cables.  Today, most wired networks use Cat 5e cables and above.  The low maximum data transfer rate of Cat 5 would create a bottleneck in most modern networks.\nWhile Cat 5 cables are only rated for 100 Mbps networks, many Cat 5 cables support data transfer rates over 100 Mbps.  Some may even support speeds up to 1,000 Mbps.\nNOTE: \"Cat 5\" is shorthand for \"category 5.\"  Since there is no standard abbreviation, \"Cat5\" and \"Cat-5\" are also acceptable."
        ]
    },
    {
        "word": "Cat 5e",
        "type": [],
        "definition": [
            "Cat 5e (short for \"Category 5 Enhanced\") is a type of Ethernet cable.  A Cat 5e cable has the same appearance and wiring scheme as a Cat 5 cable, but supports data transfer rates of 1,000 Mbps or one gigabit per second.  Therefore, Cat 5e cables are sometimes called Gigabit Ethernet cables.\nCat 5e cables operate on the same 100 MHz frequency as Cat 5 and have the same maximum length of 100 meters before requiring a router or powered signal booster.  The primary difference between the two standards is that Cat 5 is only rated for 100 Mbps networks, while Cat 5e supports 1,000 Mbps networks.\nWhile the cables are nearly identical, Cat 5e cables have improved shielding that reduces crosstalk, or interference from adjacent wire pairs.  Technically speaking, Cat 5e cables must adhere to stricter IEEE standards in regards to Near-End Crosstalk (NEXT) measurements, which are measured in decibels.\nThe difference between Cat 5 and Cat 5e shielding is specific to the internal wires, not the outer sleeve, or \"jacket.\"  An Ethernet cable's outer jacket (designed for indoor, outdoor, in-wall, etc) has no bearing on the IEEE rating.\nIn 2001, Cat 5e began to replace Cat 5 as the most widely used Ethernet cable standard.  Today, nearly all wired networks use Cat 5e cables or higher."
        ]
    },
    {
        "word": "Cat 6",
        "type": [],
        "definition": [
            "Cat 6 (short for \"Category 6\") is an Ethernet standard.  It operates at 250 MHz and supports data transfer rates of 10 Gbps.  The maximum speed of Cat 6 is 10x faster than the previous standard, Cat 5e.\nFrom the outside, Cat 6 cables look identical to Cat 5 and Cat 5e cables.  They use the same RJ45 connectors and are backward-compatible with Cat 5\/5e Ethernet networks.  Internally, Cat 6 cables retain the same \"twisted pair\" wiring scheme with eight internal wires.  The primary difference between Cat 6 and Cat 5 is that Cat 6 operates at 250 MHz, while Cat 5 and 5e operate at 100 MHz.  The higher frequency enables Cat 6 cables to transfer data more quickly.\nCat 6 vs Cat 6a\nSimilar to Cat 5, Cat 6 has a variant with performance improvements.  The variant is called Cat 6a (rather than Cat 6e).  Cat 6a operates at 500 MHz, twice the frequency of Cat 6, but supports the same maximum data transfer rate of 10 Gbps.  The difference is that Cat 6 can only transmit data at 10 Gbps for 55 meters (180 feet), while Cat 6a supports 10 Gbps for 100 meters (328 feet).  A Cat 6 cable will still work over 55 meters, but the speed may decline.\nIn order for Ethernet cables to transfer data at full speed over long distances, a router or powered signal booster must be placed every 100 meters.\nWhile Cat 5e was the most popular Ethernet standard for nearly two decades, many modern LANs now use Cat 6 or Cat 6a cables.  Even if the network equipment does not support 10 Gbps transfer speeds, Cat 6 cable is necessary to transfer data over 1 Gbps.  Cat 6 cables are usually more expensive than Cat 5\/5e cables, but re-running new Ethernet lines can be time-consuming and costly.  Therefore, it is typically worth the extra expense to future-proof a network with faster Ethernet cables.\nNOTE: Most Ethernet cables have the type of standard printed on the outer jacket."
        ]
    },
    {
        "word": "Catalina",
        "type": [],
        "definition": [
            "Catalina is the sixteenth version of Apple's macOS operating system and is also known as \"macOS 10.15.\"  It follows macOS Mojave (version 10.14) and was released on October 7, 2019.\nWhile Catalina includes several new features, it is primarily a performance update.  Notably, Catalina is the first version of macOS to drop 32-bit support.  By removing support for 32-bit applications, Apple trimmed a significant amount of \"legacy\" code from the OS.  The result is a lighter-weight operating system optimized for 64-bit applications.\nWhile most modern apps are 64-bit, older 32-bit apps will not run in macOS 10.15.\nCatalina is also the first version of macOS that allows an iPad to serve as a secondary display.  This feature, called \"Sidecar,\" works with both a wired and wireless connection between a Mac and an iPad.  It also introduces \"Project Catalyst,\" which makes it possible for iOS and iPadOS apps to run on macOS.\nMost of Catalina's other new features are related to the bundled apps.  For example, iTunes is replaced by three new apps: Music, Podcast, and TV.  Mail adds message blocking and built-in unsubscribing.  The Reminders app provides a new way to organize and manage reminders.  Catalina also includes Screen Time, a feature introduced in iOS 12.  It allows users to track how much time they spend on their computers, including how much they use individual apps."
        ]
    },
    {
        "word": "Cc",
        "type": [],
        "definition": [
            "Stands for \"Carbon Copy.\"  The term comes from carbon copying, in which a piece of carbon paper copies writing from one paper to another (often used when filling out forms).  However, the term is now commonly used in reference to e-mail.  When you send an e-mail message, you typically type the recipient's address in the \"To:\" field.  If you want to send the message to one or more other recipients, you can use the \"Cc:\" field to add additional addresses.  This will send the e-mail to the address in the \"To:\" field and to each address listed in the \"Cc:\" field as well.\nThe \"Cc:\" option is often used in business communications when a message is intended for one person, but is relevant to other people as well.  For example, a retail employee may e-mail another employee saying he can work for her on a certain day.  He might include his manager's and assistant manager's e-mail addresses in the \"Cc:\" field to let them know he is taking the work shift.  Similarly, a team member working on a product design may e-mail his boss with the latest design revisions and may \"Cc:\" the other members of his team to let them know the e-mail has been sent.\n\"CCing\" (yes, it can also be used as a verb) is a quick way to let other people in on your e-mail communications.  It is efficient because you don't have to send separate  messages to each individual address.  However, remember that When you Cc an e-mail, all the recipients can see the other addresses the message was sent to.  If you want to hide the additional addresses, use Blind Carbon Copy (Bcc) instead."
        ]
    },
    {
        "word": "Cell",
        "type": [],
        "definition": [
            "Spreadsheets are made up of rows and columns, which form a table or grid.  A cell is a specific location within a spreadsheet and is defined by the intersection of a row and column.  Since most spreadsheets use numbers to define rows and letters to define columns, cells are often referenced by a letter and number combination.\nFor example, the cell A3 is located in the first column (A), in the third row of a spreadsheet.  The cell B3 would be immediately to the right of A3 and the cell A4 would be directly below it.  These examples are relative cell references, since they are based on the actual names of the cells.  If a user changed the name of column A to \"Income\" and the name of row 3 to \"Q3,\" the reference would be \"IncomeQ3\" instead of A3.  However, you could also refer to the cell by the absolute cell reference, which is defined by $A$3.  Many spreadsheet programs support absolute cell references, which are useful when creating formulas.\nCells may contain several data types, including numbers, dates, times, currencies, percentages, text, and other types of data.  Most spreadsheet programs allow you to format cells for different data types, which helps ensure uniform entries across multiple cells.  For example, you could format the active cell (or currently selected cell) to US dollar currency.  If you enter \"123\" in the cell, it may automatically change to \"$123.00\" when you press Tab or Enter or click outside the cell.  If the active cell is formatted for a date, the text \"1\/2\/3\" may change to \"01\/02\/2003.\"\nCells may contain manually entered data or the results of calculations from other cells.  For example, cell A20 may contain a formula that produces the result of the summation of cells A1-A15.  Cell C5 may contain a formula that averages all the numbers in the B column.  The data in spreadsheet cells that contain formulas are dynamically updated when the data in referenced cells are changed."
        ]
    },
    {
        "word": "Cell Reference",
        "type": [],
        "definition": [
            "A cell reference, or cell address, is an alphanumeric value used to identify a specific cell in a spreadsheet.  Each cell reference contains one or more letters followed by a number.  The letter or letters identify the column and the number represents the row.\nIn a standard spreadsheet, the first column is A, the second column is B, the third column is C, etc.  These letters are typically displayed in the column headers at the top of the spreadsheet.  If there are more than 26 columns, the 26th column is labeled Z, followed by AA for column 27, AB for column 28, AC for column 29, etc.  Column 55 is labeled BA.  Rows simply increment numerically from top to bottom starting with \"1\" for the first row.\nExamples of cell references are listed below:\n\nFirst column, seventh row: A7\nTenth column, twentieth row: J20\nSixty-first column, three hundred forty-second row: BI342\nOne thousand column, two thousandth row: ALL2000\n\nCell references are helpful in two ways: 1) They provide an easy way to locate a specific value within a spreadsheet, and 2) they are used in creating formulas.\nLocating Values\nIf you are reviewing a spreadsheet with another user, you can simply use the column\/row combination to reference a specific cell.  You can also use the \"Go To...\" feature to jump to a specific cell. This is especially helpful when working with large spreadsheets that have hundreds or thousands of cells.\nCreating Formulas\nMost spreadsheet programs support formulas that can be used to calculate values based on the contents of other cells.  For example, a cell may contain the function:\n=D8\/E10\nThe above function will automatically populate the cell with the value stored in cell D8 divided by the value in E10.  If G2 contains the function above, and D8 is 20 and E10 is 5, then G2 will display the value 4.  A cell may also simply display the value of another cell.  For instance, if G3 contained the function =D8, it would display 20 (the value stored in D8)."
        ]
    },
    {
        "word": "Certificate",
        "type": [],
        "definition": [
            "An SSL certificate, or secure certificate, is a file installed on a secure Web server that identifies a website.  This digital certificate establishes the identity and authenticity of the company or merchant so that online shoppers can trust that the website is secure and reliable.  In order to verify that these sites are legitimate (they are who they say they are), the companies and their websites are verified by a third party, such as Verisign or Thawte.\nOnce the verification company establishes the legitimacy of an organization and the associated website, they will issue an SSL certificate (for the small fee of a few hundred dollars).  This digital certificate is installed on the Web server and will be viewable when a user enters a secure area of the website.  You can tell you are visiting a secure page when the URL starts with \"https.\"  To view the certificate, click the lock icon near one of the edges of your browser window.\nBecause digital certificates verify a company's current status, they do not last forever.  SSL certificates typically expire every one to three years.  If the certificate is not renewed in time, you may see an alert box pop up that says \"This website's certificate has expired.\"  This error has nothing to do with you or your computer, but is displayed because the Web server you connected to has not renewed its SSL certificate.  While this does not necessarily mean the site is fraudulent, it does show that the site is less than professional."
        ]
    },
    {
        "word": "Character",
        "type": [],
        "definition": [
            "A character is any letter, number, space, punctuation mark, or symbol that can be typed on a computer.  The word \"computer,\" for example, consists of eight characters.  The phrase \"Hi there.\" takes up nine characters.  Each character requires one byte of space, so \"computer\" takes up 8 bytes.  The list of characters that can be typed is defined by the ASCII and extended ASCII set.  Some of the symbols available are pretty strange and may even make you say, \"That's quite a character!\""
        ]
    },
    {
        "word": "Character Encoding",
        "type": [],
        "definition": [
            "While we view text documents as lines of text, computers actually see them as binary data, or a series of ones and zeros.  Therefore, the characters within a text document must be represented by numeric codes.  In order to accomplish this, the text is saved using one of several types of character encoding.\nThe most popular types of character encoding are ASCII and Unicode.  While ASCII is still supported by nearly all text editors, Unicode is more commonly used because it supports a larger character set.  Unicode is often defined as UTF-8, UTF-16, or UTF-32, which refer to different Unicode standards.  UTF stands for \"Unicode Transformation Format\" and the number indicates the number of bits used to represent each character.  From the early days of computing, characters have been represented by at least one byte (8 bits), which is why the different Unicode standards save characters in multiples of 8 bits.\nWhile ASCII and Unicode are the most common types of character encoding, other encoding standards may also be used to encode text files.  For example, several types of language-specific character encoding standards exist, such as Western, Latin-US, Japanese, Korean, and Chinese.  While Western languages use similar characters, Eastern languages require a completely different character set.  Therefore, a Latin encoding would not support the symbols needed to represent a text string in Chinese.  Fortunately, modern standards such as UTF-16 support a large enough character set to represent both Western and Eastern letters and symbols."
        ]
    },
    {
        "word": "Checksum",
        "type": [],
        "definition": [
            "A checksum is a value used to verify the integrity of a file or a data transfer.  In other words, it is a sum that checks the validity of data.  Checksums are typically used to compare two sets of data to make sure they are the same.  Some common applications include verifying a disk image or checking the integrity of a downloaded file.  If the checksums don't match those of the original files, the data may have been altered or corrupted.\nA checksum can be computed in many different ways, using different algorithms.  For example, a basic checksum may simply be the number of bytes in a file.  However, this type of checksum is not very reliable since two or more bytes could be switched around, causing the data to be different, though the checksum would be the same.  Therefore, more advanced checksum algorithms are typically used to verify data.  These include cyclic redundancy check (CRC) algorithms and cryptographic hash functions.\nIt is rare that you will need to use a checksum to verify data, since many programs perform this type of data verification automatically.  However, some file archives or disk images may include a checksum that you can use to check the data's integrity.  While it is not always necessary to verify data, it can be a useful means for checking large amounts of data at once.  For example, after burning a disc, it is much easier to verify that the checksums of the original data and the disc match, rather than checking every folder and file on the disc.\nBoth Mac and Windows include free programs that can be used to generate and verify checksums.  Mac users can use the built-in Apple Disk Utility and Windows users can use the File Checksum Integrity Verifier (FCIV)."
        ]
    },
    {
        "word": "Chip",
        "type": [],
        "definition": [
            "Technically speaking, a computer chip is a piece of silicon with an electronic circuit embedded in it.  However, the word \"chip\" is often used as a slang term that refers to various components inside a computer.  It typically describes an integrated circuit, or IC, such as a central processor or a graphics chip, but may also refer to other components such as a memory module.\nWhile \"chip\" is a somewhat ambiguous term, it should not be confused with the term \"card.\"  For example, a laptop might have a graphics chip embedded in the motherboard, while a desktop computer may contain a graphics card connected to a PCI or AGP slot.  A graphics card may contain a chip, but the chip cannot contain a card.  Similarly, a CPU may contain a chip (the processor), but it may also contain several other components.  Therefore, the term \"chip\" can be used to refer to specific components, but should not be used describe multiple components that are grouped together."
        ]
    },
    {
        "word": "Chipset",
        "type": [],
        "definition": [
            "A chipset is a group of integrated circuits that work together.  It may refer to the design of a single component or may describe the relationship of multiple components within a computer system.  For example, the chipset of video card describes the design of the card, while a motherboard chipset describes its layout and the different components it supports.\nDiagrams are often used to illustrate chipset designs.  For example, a diagram of a video card chipset may contain the GPU, video RAM, and the PCI bus.  It may also include lines and arrows that represent the circuitry between the components.  Together, the components and circuitry make up the overall design of the chipset, and may also be called the architecture of the video card.\nA motherboard chipset diagram may include components such as the CPU, RAM, video card, and I\/O ports.  A detailed diagram may also include lesser-known components, such as the northbridge, southbridge and frontside bus.  Regardless of level of detail, all motherboard chipset diagrams include lines and arrows that visually describe the way data flows between the different components.\nMost internal computer components are designed for a specific chipset.  Therefore, if you decide to upgrade any internal hardware, it is important to know what type of chipset your computer uses.  In many cases, a computer's chipset is synonymous with the chipset of the motherboard.  Once you find out what chipset your motherboard uses, you can determine what components are compatible with your machine."
        ]
    },
    {
        "word": "Chromebook",
        "type": [],
        "definition": [
            "A Chromebook is a laptop that runs Google's Chrome OS operating system.  While Google sells its own Chromebook model, the Chromebook Pixel, many other manufacturers offer Chromebooks as well.  Examples include Dell, HP, Toshiba, Samsung, ASUS, and Acer.\nChromebooks are designed to be inexpensive and highly portable.  They are considered thin clients since they have minimal internal storage.  Unlike traditional laptops, Chromebooks are designed to run cloud-based applications and store data online.  While the Chrome OS and some applications can run offline, Chromebooks work best when used with an Internet connection.\nThe Chrome OS includes several Google apps, such as the Chrome web browser, Gmail, Google+, and YouTube applications.  It also runs the Google Drive office suite and related apps such as Google Docs, Google Drawings, and Google Forms.  Third party applications can be downloaded from the Chrome Web Store.  Some Android apps can also run on Chrome OS via Google's App Runtime for Chrome (ARC).\nSince Chromebooks do not run Windows or OS X, they do not natively support many traditional applications, such as Microsoft Office.  However, you can run online versions of Word, Excel, and other common applications from the Chrome OS or through the Chrome web browser.  These applications run on a remote server, but look and function like traditional desktop applications.  Chromebooks also support remote access software, which allows you operate Windows or OS X computers from a Chromebook."
        ]
    },
    {
        "word": "Circuit",
        "type": [],
        "definition": [
            "In electronics, a circuit is a closed path that allows electricity to flow from one point to another.  It may include various electrical components, such as transistors, resistors, and capacitors, but the flow is unimpeded by a gap or break in the circuit.\nA flashlight is an example of a basic circuit.  When the switch is off, the circuit is not closed, meaning electrical current will not flow from the batteries to the flashlight's bulb.  When you move the switch to the on position, a piece of metal in the flashlight physically closes the gap in the circuit.  Electricity from the batteries then flows to the bulb making it light up.\nIn computing, the term \"circuit\" is used more liberally and may be used to reference a circuit board or an integrated circuit.  The internal workings of computers and other electronic devices are comprised of these components, which may each contain hundreds or thousands of individual circuits.\nThe large number of circuits inside computers allow them to route data to different locations and perform complex calculations.  For example, a chip may route graphics operations to the GPU and other operations to the CPU.  These processors contain logic gates that can rapidly open and close circuits.  Modern processors have so many circuits and transistors, they can perform billions of instructions every second."
        ]
    },
    {
        "word": "Class",
        "type": [],
        "definition": [
            "A class is used in object-oriented programming to describe one or more objects.  It serves as a template for creating, or instantiating, specific objects within a program.  While each object is created from a single class, one class can be used to instantiate multiple objects.\nSeveral programming languages support classes, including Java, C++, Objective C, and PHP 5 and later.  While the syntax of a class definition varies between programming languages, classes serve the same purpose in each language.  All classes may contain variable definitions and methods, or subroutines that can be run by the corresponding object.\nBelow is an example of a basic Java class definition:\nclass Sample\n{\n&nbsp;&nbsp; public static void main(String[] args)\n&nbsp;&nbsp; {\n&nbsp;&nbsp; &nbsp;&nbsp; String sampleText = \"Hello world!\";\n&nbsp;&nbsp; &nbsp;&nbsp; System.out.println(sampleText);\n&nbsp;&nbsp; }\n}\nThe above class, named Sample, includes a single method named main.  Within main, the variable sampleText is defined as \"Hello world!\"  The main method invokes the System class from Java's built-in core library, which contains the out.println method.  This method is used to print the sample text to the text output window.\nClasses are a fundamental part of object-oriented programming.  They allow variables and methods to be isolated to specific objects instead of being accessible by all parts of the program.  This encapsulation of data protects each class from changes in other parts of the program.  By using classes, developers can create structured programs with source code that can be easily modified.\nNOTE: While classes are foundational in object-oriented programming, they serve as blueprints, rather than the building blocks of each program.  This is because classes must be instantiated as objects in order to be used within a program.  Constructors are typically used to create objects from classes, while destructors are used to free up resources used by objects that are no longer needed."
        ]
    },
    {
        "word": "Clean Install",
        "type": [],
        "definition": [
            "A clean install is an operating system (OS) installation that overwrites all other content on the hard disk.  Unlike a typical OS upgrade, a clean install removes the current operating system and user files during the installation process.  When a clean install finishes, the hard disk only contains the new operating system, similar to a computer that is used for the first time.\nIn most cases, a clean install is not necessary when upgrading your operating system.  It is much easier and safer to perform a standard \"upgrade and install,\" which simply upgrades the necessary files and leaves the user files in place.  However, sometimes an OS upgrade is not possible because important files have become lost or corrupted.  In this case, a clean install may be the only option.  Some users may also prefer to perform a clean install so that no lingering problems from the previous OS will affect the newly installed operating system.  Additionally, a clean install may be appropriate when installing an OS on a new hard drive or when transferring ownership of a computer to another person.\nBoth Windows and Mac OS X allow you to perform a clean install when upgrading your operating system.  The installer will give you the choice between a standard upgrade (typically the default option) and a clean installation near the beginning of the installation process.  Windows 7 also lets you format and partition your installation disk if you select a clean install.  In Mac OS X, you can use the Disk Utility program to format or partition your drive before you perform the clean install.\nNOTE: Since a clean install wipes out all data on the primary hard disk, it is crucial to back up your data before performing the installation.  While it is wise to make sure you have a recent backup of your data before any OS upgrade, it is extremely important when performing a clean install.  Backing up your data to an external hard drive or another computer are both good options.  It is also smart to check your backup and make sure it contains all the files you need so you do not accidentally lose any files."
        ]
    },
    {
        "word": "Clean Room",
        "type": [],
        "definition": [
            "A simple definition of this would be \"the opposite of my bedroom.\"  But technically speaking, a clean room is a highly purified and regulated room for producing equipment sensitive to contamination.  For example, the production of microprocessors is done in a clean room, since the smallest amounts of dust could create flaws in their production.  Therefore, the air in a clean room is constantly filtered.  Other aspects such as temperature, humidity, and pressure may be regulated as well.\nClean rooms are rated by class, according to a Federal standard.  A Class 1,000 clean room has no more than 1,000 particles larger than 0.5 microns in a cubic foot of air.  A Class 100 clean room has no more than 100 particles.  The people who work in clean rooms need to wear special suits that prevent them from contaminating the room.  They look almost like astronaut suits, but are not quite as heavy and don't require the large boots for walking on the moon."
        ]
    },
    {
        "word": "Client",
        "type": [],
        "definition": [
            "Businesses have clients and servers have clients.  In both instances, there exists a one-to-many relationship.  Just like a business may have several clients, a server can communicate with multiple clients.  In computer networking, this is called the client-server model.\nA client is any device that communicates with a server.  It may be a desktop computer, laptop, smartphone, or any other network-compatible device.  In a home network, \"smart\" devices, such as Wi-Fi-enabled thermostats, lights, and appliances, are considered clients.  In an office network, systems that access files from network-attached storage are clients of the file server.  Most networks allow client-to-client communication, though the data flows through a central point, such as a router or switch.\nOn a larger scale, whenever you access a website, your device is the client, and the web server hosting the website is the server.  From a software perspective, your web browser is the client software and the program that responds to requests on the web server (Apache, IIS, etc.), is the server software.  Similarly, when you check your email, you connect to a mail server.  Your device is a client of the mail server, and your email program or webmail interface is the client software."
        ]
    },
    {
        "word": "Client-Server Model",
        "type": [],
        "definition": [
            "The client-server model describes how a server provides resources and services to one or more clients.  Examples of servers include web servers, mail servers, and file servers.  Each of these servers provide resources to client devices, such as desktop computers, laptops, tablets, and smartphones.  Most servers have a one-to-many relationship with clients, meaning a single server can provide resources to multiple clients at one time.\nWhen a client requests a connection to a server, the server can either accept or reject the connection.  If the connection is accepted, the server establishes and maintains a connection with the client over a specific protocol.  For example, an email client may request an SMTP connection to a mail server in order to send a message.  The SMTP application on the mail server will then request authentication from the client, such as the email address and password.  If these credentials match an account on the mail server, the server will send the email to the intended recipient.\nOnline multiplayer gaming also uses the client-server model.  One example is Blizzard's Battle.net service, which hosts online games for World of Warcraft, StarCraft, Overwatch, and others.  When players open a Blizzard application, the game client automatically connects to a Battle.net server.  Once players log in to Battle.net, they can see who else is online, chat with other players, and play matches with or against other gamers.\nWhile Internet servers typically provide connections to multiple clients at a time, each physical machine can only handle so much traffic.  Therefore, popular online services distribute clients across multiple physical servers, using a technique called distributed computing.  In most cases, it does not matter which specific machine users are connected to, since the servers all provide the same service.\nNOTE: The client-server model may be contrasted to the P2P model, in which clients connect directly to each other.  In a P2P connection, there is no central server required, since each machine acts as both a client and a server."
        ]
    },
    {
        "word": "Clip Art",
        "type": [],
        "definition": [
            "Clip art is a collection of pictures or images that can be imported into a document or another program.  The images may be either raster graphics or vector graphics.  Clip art galleries many contain anywhere from a few images to hundreds of thousands of images.\nClip art is typically organized into categories, such as people, objects, nature, etc., which is especially helpful when browsing through thousands of images.  Most clip art images also have keywords associated with them.  For example, a picture of a female teacher in a classroom may have the keywords \"school,\" \"teacher,\" \"woman,\" \"classroom,\" and \"students\" associated with it.  Most clip art programs allow you to search for images based on these keywords.\nWhen you find a clip art image you want to use, you can copy it to your computer's clipboard and paste it into another program, such as Photoshop or Microsoft Word.  You may also be able to export the image to the Desktop or another folder on your hard disk.  Most clip art is royalty free, meaning you can use the images without paying royalties to the creators of the images.  So if you buy a clip art package with 50,000 images for $50.00, you are only paying 1\/10 of one cent for each image.  That's a pretty good deal."
        ]
    },
    {
        "word": "Clipboard",
        "type": [],
        "definition": [
            "The clipboard is a section of RAM where your computer stores copied data.  This can be a selection of text, an image, a file, or other type of data.  It is placed in the clipboard whenever you use the \"Copy\" command, which is located in the Edit menu of most programs.\nData from the clipboard can be pasted into a document or program using the \"Paste\" command, which is also located in most programs' Edit menu.  For example, an image copied to the clipboard from your photo album may be pasted into an image editing program such as Photoshop.  A Web address can be copied to the clipboard from an e-mail and pasted into your Web browser's address field.\nSome programs allow you to see what data is stored in the clipboard.  For example, the Finder in Mac OS X allows you to choose \"Show Clipboard\" from the Edit menu.  When you copy data to the clipboard, whatever data was already stored in the clipboard is typically replaced by the new data.  Because the clipboard data is stored in RAM, it is also deleted when your computer is shut down or restarted."
        ]
    },
    {
        "word": "Clock Cycle",
        "type": [],
        "definition": [
            "A clock cycle, or simply a \"cycle,\" is a single electronic pulse of a CPU.  During each cycle, a CPU can perform a basic operation such as fetching an instruction, accessing memory, or writing data.  Since only simple commands can be performed during each cycle, most CPU processes require multiple clock cycles.\nIn physics, the frequency of a signal is determined by cycles per second, or \"hertz.\"  Similarly, the frequency of a processor is measured in clock cycles per second.  Since modern processors can complete millions of clock cycles every second, processor speeds are often measured in megahertz or gigahertz.\nThe frequency of a processor is also known as the processor's clock speed.  While the clock speed is important in determining the processor's overall performance, it is not the only factor.  Since processors have different instruction sets, they may differ in the number of cycles needed to complete each instruction, or CPI (cycles per instruction).  Therefore, some processors can perform faster than others, even at slower clock speeds."
        ]
    },
    {
        "word": "Clock Speed",
        "type": [],
        "definition": [
            "Clock speed is the rate at which a processor can complete a processing cycle.  It is typically measured in megahertz or gigahertz.  One megahertz is equal to one million cycles per second, while one gigahertz equals one billion cycles per second.  This means a 1.8 GHz processor has twice the clock speed of a 900 MHz processor.\nHowever, it is important to note that a 1.8 GHz CPU is not necessarily twice as fast as a 900 MHz CPU.  This is because different processors often use different architectures.  For example, one processor may require more clock cycles to complete a multiplication instruction than another processor.  If the 1.8 GHz CPU can complete a multiplication instruction in 4 cycles, while the 900 MHz CPU takes 6 cycles, the 1.8 GHz processor will perform the operation more than twice as fast as the 900 MHz processor.  Conversely, if the 1.8 GHz processor takes more cycles to perform the same instruction, it will be less than 2x as fast as the 900 MHz processor.\nOther factors also contribute to the overall performance of a computer.  Examples include the number of processors, the bus speed, cache size, speed of the RAM, and HDD or SSD speed.  Therefore, while the processor's clock speed is a significant indicator of how fast a computer is, it is not the only factor that matters."
        ]
    },
    {
        "word": "Clone",
        "type": [],
        "definition": [
            "What do sheep, droids, and computers all have in common?  They can all be cloned!  Of the three, computer clones are by far the most common.\nThe term \"clone\" arose in the mid-1980s to describe DOS or Windows-based computers made by companies other than IBM.  The machines were often referred to as \"IBM clones,\" or \"IBM compatible\" computers.  They were called clones because the computers functioned exactly the same way as the ones made by IBM.  They used similar hardware and ran the same software.\nPC clones are still around today.  In fact there are dozens more manufacturers of Windows-based computers now than there were in the 1980s.  Companies like Dell, Gateway, HP, Compaq, and Sony all make Windows-based computers, as well as many other manufacturers.  Today, the term \"PC,\" which technically stands for \"Personal Computer,\" is often used to refer to IBM clones.  Macintosh clones were made for a few years in the late 1990s, but Apple forced the end of their production by making the Macintosh operating system only run on the Apple-branded machines.\n\"Clone\" can also be used to refer to software that serves the same purpose as another more mainstream software program.  It can also refer to electronic devices other than computers that are similar to other electronics."
        ]
    },
    {
        "word": "Cloud",
        "type": [],
        "definition": [
            "The term \"cloud\" comes from early network diagrams, in which the image of a cloud was used to indicate a large network, such as a WAN.  The cloud eventually became associated with the entire Internet, and the two terms are now used synonymously.  The cloud may also be used to describe specific online services, which are collectively labeled \"cloud computing.\"\nExamples of popular cloud-based services include web applications, SaaS, online backup, and other types of online storage.  Traditional Internet services like web hosting, email, and online gaming may also be considered part of the cloud since they are hosted on Internet servers, rather than users' local computers.  Even social networking websites such as Facebook and LinkedIn are technically cloud-based services, since they store your information online.\nWhile \"the cloud\" is simply a buzzword for most consumers, it plays an important role for businesses.  By moving software services to the cloud, companies can share data more efficiently and centralize their network security.  Additionally, cloud-based virtualization can help businesses reduce the number of computer systems and software licenses they need to buy.  The end result and a more efficient and less costly way of running a business."
        ]
    },
    {
        "word": "Cloud Computing",
        "type": [],
        "definition": [
            "Cloud computing refers to applications and services offered over the Internet.  These services are offered from data centers all over the world, which collectively are referred to as the \"cloud.\"  This metaphor represents the intangible, yet universal nature of the Internet.\nThe idea of the \"cloud\" simplifies the many network connections and computer systems involved in online services.  In fact, many network diagrams use the image of a cloud to represent the Internet.  This symbolizes the Internet's broad reach, while simplifying its complexity.  Any user with an Internet connection can access the cloud and the services it provides.  Since these services are often connected, users can share information between multiple systems and with other users.\nExamples of cloud computing include online backup services, social networking services, and personal data services such as Apple's MobileMe.  Cloud computing also includes online applications, such as those offered through Microsoft Online Services.  Hardware services, such as redundant servers, mirrored websites, and Internet-based clusters are also examples of cloud computing."
        ]
    },
    {
        "word": "Cloud Waste",
        "type": [],
        "definition": [
            "Cloud waste is unnecessary spending on cloud services.  It refers to unused or underused services during one or more billing cycles, which results in \"wasted\" spending.\nMany types of cloud waste exist.  Some examples include:\n\nUnused apps in Adobe Creative Cloud\nUnused Microsoft 365 subscriptions\nUnderutilized server bandwidth\nUnnecessary cloud security features\nUnderused cloud computing services\nUnderused monthly mailing list email sends\n\nCloud waste affects everyone from home users to enterprise businesses.  For example, a student who purchases an annual Creative Cloud subscription but only uses it for six months may waste several hundred dollars a year.  A company that purchases 10,000 Microsoft 365 licenses or \"seats\" but only uses 8,000 may waste thousands of dollars a month in unused subscription fees.\nIn recent years, many companies have switched from desktop software to SaaS solutions to reduce costs.  However, CTOs and other managers must monitor SaaS usage since unnecessary subscriptions can go overlooked for months or even years.\nCloud computing platforms like Azure, AWS, and Google Cloud provide usage-based billing, which helps reduce cloud waste.  Similar to an electrical meter, these services track each client's specific usage, such as compute time, API calls, bandwidth used, etc.  Still, many cloud platforms have base monthly service fees and charge for add-ons that may go underutilized over time.\nCloud-based services provide an efficient and cost-effective way for companies to manage IT solutions.  However, it is essential for individuals and organizations to regularly review their cloud subscriptions to make sure they are not wasting money on unnecessary services."
        ]
    },
    {
        "word": "Cluster",
        "type": [],
        "definition": [
            "In computing, a cluster may refer to two different things: 1) a group of sectors in a storage device, or 2) a group of connected computers.\n1) A group of sectors\nA sector is the smallest unit that can be accessed on a storage device like an HDD or SSD.  A cluster, or allocation unit, is a group of sectors that make up the smallest unit of disk allocation for a file within a file system.  In other words, a file system's cluster size is the smallest amount of space a file can take up on a computer.\nA common sector size is 512 bytes.  A common cluster size is 8 sectors.  Therefore, many file systems have a minimum cluster size of 4 kibibytes (8 x 512 bytes).\nMost files require a large number of clusters, which means the file contents are spread across multiple clusters on the drive.  Often the data can be written in contiguous blocks so that the file contents are stored in one physical location.  However, when a hard drive begins to fill up, there may not be enough contiguous clusters available to save large files in a single area.  Instead, they must be written in multiple locations on the disk.  This is called fragmentation and can slow down the hard drive's read and write speeds.\n2) A group of connected computers\nA cluster can also refer to a group of machines that work together that perform a similar function.  Unlike grid computing, a computer cluster is controlled by a single software program that manages all the computers or \"nodes\" within the cluster.  The nodes work together to complete a single task.  This process is called \"parallel computing\" since the nodes perform operations in tandem.\nComputer clusters can range from two machines to hundreds of connected computers.  Small clusters are often used to improve the performance of web and online gaming services by handling multiple incoming requests in parallel.  A web farm, for example, is a type of cluster that provides low latency access to websites.  Large clusters can be used to perform scientific calculations or to run a large number of complex algorithms.  For example, a large cluster may be used to apply textures and lighting effects to 3D models in each frame of an animated movie."
        ]
    },
    {
        "word": "Coaxial Cable",
        "type": [],
        "definition": [
            "Coaxial (or “coax”) cable is a common type of cable used for transmitting data over long distances.  It can carry either an analog or digital signal.  While coax cables have many applications, they are most commonly used to transmit cable TV and Internet signals.\nCoax cables that run underground are typically thicker and more heavily insulated than the cables that connect your cable box or cable modem to the wall outlet.  However, they all transmit data via a thin copper line in the middle of the cable.  This wire is surrounded by a layer of insulation comprised of non-conductive or “dielectric” material.  The dielectric layer is covered with one or more metallic shields that provides additional protection from signal interference.  Finally, a protective plastic outer layer surrounds the entire cable.\nThe heavy duty design of coaxial cables is what allows them to carry data over long distances with minimum signal degradation.  In many cases, coax cables laid by cable companies several decades ago are sufficient to provide HDTV and high-speed Internet access simultaneously.  However, certain coax cables (such as RG-59 cables) are designed for low bandwidth applications, like connecting a VCR to a TV, and may not provide enough bandwidth to carry a full HDTV signal.  Coax cables labeled as “RG-6” are a better choice for HDTV and cable Internet service."
        ]
    },
    {
        "word": "Codec",
        "type": [],
        "definition": [
            "Codec is short for \"coder-decoder.\"  It is an algorithm used to encode data, such as an audio or video clip.  The encoded data must be decoded when played back.\nA media codec is not equivalent to media compression, since it is possible to encode a file without compressing it.  However, most codecs do compress the original data, reducing the size of the original file.  This is important for multimedia files, since they often have large file sizes.  Compressed files take up less disk space and can be downloaded more quickly.\nGenerally, a codec reduces the file size of a media file, but increases the processing power required to play the file back correctly.\nLossless vs Lossy Codecs\nSome codecs are lossless, meaning they do not reduce the quality of the original media file.  Examples of lossless audio codecs include the Free Lossless Audio Codec (FLAC), and the Apple Lossless Audio Codec (ALAC).  Video codecs that support lossless compression include H.264 and QuickTime RLE.  A lossless codec can often reduce the file size of a media file to about 50% without altering the quality.\nOther codecs are lossy, meaning the compression reduces the quality of the media.  Examples of lossy audio codecs are Adaptive Differential Pulse Code Modulation (ADPCM) and MPEG-1 Layer 3 (MP3).  Common lossy video codecs include MPEG-2 and HEVC.  Most lossy codecs provide a variable compression setting, which allows you to select how much to compress the media.  For example, if you apply heavy compression to an audio file, it may reduce the file size to 10%, but the audio may sound like it has been compressed.  If you use a lower compression setting that reduces the file size to 30%, it may be closer to the original file.\nNOTE: Lossy codecs are commonly applied to streaming media so the data can be transferred more quickly over the Internet."
        ]
    },
    {
        "word": "Cold Boot",
        "type": [],
        "definition": [
            "To perform a cold boot (also called a \"hard boot\") means to start up a computer that is turned off.  It is often used in contrast to a warm boot, which refers to restarting a computer once it has been turned on.  A cold boot is typically performed by pressing the power button on the computer.\nBoth a cold boot and warm boot clear the system RAM and perform the boot sequence from scratch.  However, unlike a cold boot, a warm boot may not clear all system caches, which store temporary information.  Additionally, a cold boot performs a \"power on self test\" (POST), which runs a series of system checks at the beginning of the boot sequence.\nWhile a warm boot and cold boot are similar, a cold boot performs a more complete reset of the system than a warm boot.  Therefore, if you are troubleshooting your computer, you may be asked to turn off your computer completely and perform a cold boot.  This makes sure all temporary data is wiped from your system, which may help eliminate issues affecting your computer. "
        ]
    },
    {
        "word": "Collision",
        "type": [],
        "definition": [
            "In computer science, a \"collision\" has two different meanings.  One occurs when two or more sets of data are modified and produce the same resulting value.  The other is specific to networking and happens when two devices transmit data at the same time.\n1. Data Collision\nA data collision may take place when hashing data or when calculating a checksum.  A hash function reduces data to a smaller value and is often used in compression and cryptography.  While the hash operation may save disk space, it is possible that two different inputs may produce the same output.  Multiple hash functions can be used to avoid duplicate values when a collision occurs.\nSimilarly, checksums are not guaranteed to be unique since they are smaller than the original data.  While the probability is often very low, two different data sets can theoretically produce the same checksum value.  A well-designed algorithm should minimize this risk.\n2. Network Collision\nA network collision occurs when two or more devices attempt to transmit data over a network at the same time.  For example, if two computers on an Ethernet network send data at the same moment, the data will \"collide\" and not finish transmitting.  This is why most networking protocols confirm that packets has been received before transmitting additional data.\nSwitches and routers can reduce collisions by checking if a transmission line is idle or \"in use\" before transmitting data.  A common method is CSMA\/CD or \"Carrier-sense multiple access with collision avoidance.\"  While it is possible to reduce collisions, they cannot be completely avoided.  For example, if two systems determine a line is idle and then transmit data at exactly the same time, a collision may occur.  This can be resolved by retransmitting the data after a random delay."
        ]
    },
    {
        "word": "Column",
        "type": [],
        "definition": [
            "A column is a vertical group of values within a table.  It contains values from a single field in multiple rows.\nIn databases, columns may be defined as individual fields within a table.  Each field has a name, such as Name, Address, or Phone Number.  Therefore, when multiple values from a column are selected, they will all have similar information, such as a list of phone numbers.  When defining columns in databases and spreadsheets, it is often possible to specify the type of data, such as a string, number, or date.  This helps ensure all the data within a given column has a similar format.\nNOTE: While it is easy to get rows and columns confused, just remember that columns are vertical (like the columns used in architecture), while rows are horizontal, like rows of text."
        ]
    },
    {
        "word": "Command Line Interface",
        "type": [],
        "definition": [
            "A command line interface (or CLI) is a text-based interface used for entering commands.  In the early days of computing, before the mouse, it was the standard way to interact with a computer.  While the graphic user interface (GUI) has largely replaced CLIs, they are still included with several major operating systems, such as Windows and OS X.\nThere are many different types of command line interfaces, but the two most popular ones are DOS (for Windows) and the bash shell (for Linux and OS X).  Each CLI uses its own command syntax, but they all function in a similar way.  For example, every CLI has a command prompt, which is displayed when the interface is ready to accept a command.  When you type a command, it shows up next to the command prompt, and when you press Enter, the command is executed.\nBelow are some examples of command prompts for different command line interfaces, with the root folder as the current directory.\n\nWindows (DOS): C:\\&gt;\nOS X (bash shell): My-iMac:\/ me$ \nLinux (bash shell): [root@myserver \/]#\n\nThe standard way to change directories in most CLIs is to use the command cd, followed by the directory path.  If you are using Windows, you can type cd C:\\Users to access the Users folder.  If you're using OS X, you can type cd \/Volumes\/SSD\/Users (assuming the drive name is \"SSD\").  A few other commands are identical between DOS and the bash shell, but each CLI supports many different commands as well.  For example, to list the contents of the current directory, you would type dir in DOS and ls in the bash shell.\nMost people prefer a standard graphical user interface to a command line one.  However, some operations can actually be completed faster using a keyboard instead of a mouse.  Therefore, CLIs are often used by network administrators and webmasters for common tasks like transferring files and checking server status.\nNOTE: A command line interface is sometimes referred to as a console or terminal window.  OS X includes a utility called \"Terminal\" that functions as the CLI for OS X."
        ]
    },
    {
        "word": "Command Prompt",
        "type": [],
        "definition": [
            "A command prompt is used in a text-based or \"command-line\" interface, such as a Unix terminal or a DOS shell.  It is a symbol or series of characters at the beginning of a line that indicates the system is ready to receive input.  It other words, it prompts the user for a command (hence the name).\nThe command prompt is often preceded by the current directory of the system the user is working with.  For example, the default prompt in DOS may be C:\\, which indicates the user is working at the root level of the main C: drive.  In Unix, the prompt may be ~ user$, where \"user\" is the name of the current user.  The tilde (~) indicates the current directory is the user's home folder.\nA user can type commands at the command prompt, such as cd \/, which means \"change directory to the root folder.\"  The \"cd\" command allows the user to browse through different directories of files on a hard disk or network.  There are dozens of other commands that a user can type, which can be used to list, move, delete, and copy files, run programs, or perform other operations.  While the \"cd\" command is the same in both DOS and Unix, many other commands have different syntax.\nSince a command prompt requires specific input, it is basically useless if you don't know the syntax of the command you want to enter.  Therefore, knowledge of some basic commands is required to use a command-line interface.  Fortunately, most operating systems now use a graphical user interface GUI as their main way of requesting input from the user.  This means you don't have to learn any special commands in order to use the computer.  However, learning to use a command-line interface is kind of like learning to drive a car with a manual transmission.  You never know when it might come in handy."
        ]
    },
    {
        "word": "Commercial Software",
        "type": [],
        "definition": [
            "Computer software comes in three different flavors: freeware, shareware, and commercial software.  Freeware is free to use and does not require any payment from the user.  Shareware is also free to use, but typically limits the program's features or the amount of time the software can be used unless the user purchases the software.  Commercial software requires payment before it can be used, but includes all the program's features, with no restrictions or time limits.\nCommercial software programs typically come in a physical box, which is what you see displayed in retail stores.  While it's true that the software boxes are not as big as they used to be, they still contain the software CD or DVD and usually a \"getting started\" manual along with a registration key used for registering the product.  Most commercial software programs ask that the user register the program so the company can keep track of its authorized users.  Some commercial software programs, such as newer versions of Microsoft and Adobe programs, require the user to register the programs in order to continue using them after 30 days.\nWhile most commercial software programs are sold in the physical box, many software titles are now available as downloads.  These downloads are typically made available from the company's website.  The user pays for the program directly on the website and instead of receiving the software in the mail, the user downloads it to his computer.  Another popular way of purchasing commercial software online is simply paying for a registration key, which unlocks the features of a shareware program.  This upgrades the shareware program to the commercial version, which removes any feature limitations from the shareware version."
        ]
    },
    {
        "word": "Compact Flash",
        "type": [],
        "definition": [
            "Often abbreviated as simply \"CF,\" Compact Flash is a type of flash memory.  Compact flash cards are most commonly used for storing pictures in digital cameras, but are also used in devices such as PDAs and portable music players.\nThere are two types of Compact Flash cards, creatively named \"Type I\" and \"Type II.\"  Type I cards are 3.3 mm thick, while Type II are 5 mm thick.  IBM makes a \"MicroDrive\" card that has the same dimensions as a Type II CF card, but uses an actual hard drive construction rather than flash memory.  Compact Flash cards originally could only store a few megabyes of data, but now can store several gigabytes.  The new CF+ standard can store a possible 137 GB of data.  I don't know about you, but I'd think about backing up that information before throwing the card in my pocket."
        ]
    },
    {
        "word": "Compile",
        "type": [],
        "definition": [
            "When programmers create software programs, they first write the program in source code, which is written in a specific programming language, such as C or Java.  These source code files are saved in a text-based, human-readable format, which can be opened and edited by programmers.  However, the source code cannot be run directly by the computer.  In order for the code to be recognized by the computer's CPU, it must be converted from source code (a high-level language) into machine code (a low-level language).  This process is referred to as \"compiling\" the code.\nMost software development programs include a compiler, which translates source code files into machine code or object code.  Since this code can be executed directly by the computer's processor, the resulting application is often referred to as an executable file.  Windows executable files have a .EXE file extension, while Mac OS X programs have an .APP extension, which is often hidden."
        ]
    },
    {
        "word": "Compiler",
        "type": [],
        "definition": [
            "A compiler is a software program that compiles program source code files into an executable program.  It is included as part of the integrated development environment IDE with most programming software packages.\nThe compiler takes source code files that are written in a high-level language, such as C, BASIC, or Java, and compiles the code into a low-level language, such as machine code or assembly code.  This code is created for a specific processor type, such as an Intel Pentium or PowerPC.  The program can then be recognized by the processor and run from the operating system. \nAfter a compiler compiles source code files into a program, the program cannot be modified.  Therefore, any changes must be made in the source code and the program must be recompiled.  Fortunately, most modern compilers can detect what changes were made and only need to recompile the modified files, which saves programmers a lot of time.  This can help reduce programmers' 100 hour work weeks before project deadlines to around 90 or so."
        ]
    },
    {
        "word": "Component",
        "type": [],
        "definition": [
            "Computers are made up of many different parts, such as a motherboard, CPU, RAM, and hard drive.  Each of these parts are made up of smaller parts, called components.\nFor example, a motherboard includes electrical connectors, a printed circuit board (PCB), capacitors, resistors, and transformers.  All these components work together to make the motherboard function with the other parts of the computer.  The CPU includes components such as integrated circuits, switches, and extremely small transistors.  These components process information and perform calculations.\nGenerally speaking, a component is a element of a larger group.  Therefore, the larger parts of a computer, such as the CPU and hard drive, can also be referred to as computer components.  Technically, however, the components are the smaller parts that make up these devices.\nComponent may also refer to component video, which is a type of high-quality video connection.  A component connection sends the video signal through three separate cables &mdash; one for red, green, and blue.  This provides better color accuracy than composite video (typically a yellow connector), which combines all the color signals into a single cable."
        ]
    },
    {
        "word": "Compression",
        "type": [],
        "definition": [
            "Compression, or \"data compression,\" is used to reduce the size of one or more files.  When a file is compressed, it takes up less disk space than an uncompressed version and can be transferred to other systems more quickly.  Therefore, compression is often used to save disk space and reduce the time needed to transfer files over the Internet.\nThere are two primary types of data compression:\n\nFile Compression\nMedia Compression\n\nFile compression can be used to compress all types of data into a compressed archive.  These archives must first be decompressed with a decompression utility in order to open the original file(s).  Media compression is used to save compressed image, audio, and video files.  Examples of compressed media formats include JPEG images, MP3 audio, and MPEG video files.  Most image viewers and media playback programs can open standard compressed file types directly.\nFile compression is always performed using a lossless compression algorithm, meaning no information is lost during the compression process.  Therefore, a compressed archive can be fully restored to the original version when it is decompressed.  While some media is compressed using lossless compression, most image, audio, and video files are compressed using lossy compression.  This means some of the media's original quality is lost when the file is compressed.  However, most modern compression algorithms can compress media with little to no loss in quality."
        ]
    },
    {
        "word": "Computer",
        "type": [],
        "definition": [
            "Technically, a computer is a programmable machine.  This means it can execute a programmed list of instructions and respond to new instructions that it is given.  Today, however, the term is most often used to refer to the desktop and laptop computers that most people use.  When referring to a desktop model, the term \"computer\" technically only refers to the computer itself -- not the monitor, keyboard, and mouse.  Still, it is acceptable to refer to everything together as the computer.  If you want to be really technical, the box that holds the computer is called the \"system unit.\"\nSome of the major parts of a personal computer (or PC) include the motherboard, CPU, memory (or RAM), hard drive, and video card.  While personal computers are by far the most common type of computers today, there are several other types of computers.  For example, a \"minicomputer\" is a powerful computer that can support many users at once.  A \"mainframe\" is a large, high-powered computer that can perform billions of calculations from multiple sources at one time.  Finally, a \"supercomputer\" is a machine that can process billions of instructions a second and is used to calculate extremely complex calculations."
        ]
    },
    {
        "word": "Computer Ethics",
        "type": [],
        "definition": [
            "Ethics is a set of moral principles that govern the behavior of an individual or group of people.  Computer ethics is the application of moral principles to the use of computers and the Internet.  Examples include intellectual property rights, privacy policies, and online etiquette, or \"netiquette\".\nComputers make it easy to duplicate and redistribute digital content.  However, it is ethical to respect copyright guidelines.  When using software, it is important to understand and follow the license agreement, or SLA.  Using commercial software without paying for a license is considered piracy and is a violation of computer ethics.  Hacking, or gaining unauthorized access to a computer system, is also an unethical way to use computers.\nAs technology advances, computers and the Internet have an increasing impact on society.  Therefore, computer ethics must be part of the discussion whenever creating new technologies.  A modern example is how artificial intelligence affects existing jobs and human communication.  When computer ethics is part of the conversation, it helps ensure new technologies positively affect society."
        ]
    },
    {
        "word": "Computer Science",
        "type": [],
        "definition": [
            "Computer science is the study of computers and computing concepts.  It includes both hardware and software, as well as networking and the Internet.\nThe hardware aspect of computer science overlaps with electrical engineering.  It covers the basic design of computers and the way they work.  A fundamental understanding of how a computer \"computes,\" or performs calculations, provides the foundation for comprehending more advanced concepts.  For example, understanding how a computer operates in binary allows you to understand how computers add, subtract, and perform other operations.  Learning about logic gates enables you to make sense of processor architecture.\nThe software side of computer science covers programming concepts as well as specific programming languages.  Programming concepts include functions, algorithms, and source code design.  Computer science also covers compilers, operating systems, and software applications.  User-focused aspects of computer science include computer graphics and user interface design.\nSince nearly all computers are now connected to the Internet, the computer science umbrella covers Internet technologies as well.  This includes Internet protocols, telecommunications, and networking concepts.  It also involves practical applications, such as web design and network administration.\nNOTE: While computer science (lowercase) refers to the general study of computers, Computer Science (capitalized) is an academic major offered at many colleges and universities.  It is often abbreviated \"CS\" or \"CompSci.\"  Examples of Computer Science courses include:\n\nIntroduction to Computing\nFundamental Programming Concepts\nData Structures\nAnalysis of Algorithms\nComputing Theory\n\nComputer Science classes may also be specific to certain industries or topics.  Examples include:\n\nVideo Game Design\nComputer Graphics\nDatabase Systems\nCryptography\nNetworking Concepts\n\nLike other educational disciplines, Computer Science courses vary from beginner to advanced.  The number of a Computer Science course typically indicates the level of the class.  For example, an introductory class may be labeled CS 102, while an advanced class may be labeled CS 431."
        ]
    },
    {
        "word": "Configuration",
        "type": [],
        "definition": [
            "In the computing world, when people talk about their computer configuration, they are referring to the technical specifications, or the \"tech specs\" of their computer.  These specs typically include processor speed, the amount of RAM, hard drive space, and the type of video card in the machine.  While there are many other advanced specifications that you could list, if you know the four mentioned above, most computer geeks will grant you acceptance into their conversation."
        ]
    },
    {
        "word": "Console",
        "type": [],
        "definition": [
            "A console is the combination of a monitor and keyboard.  It is a rudimentary interface in which the monitor provides the output and the keyboard is used for input.\nWhile any computer with a monitor and keyboard may be considered a console, the term most often refers to a system used to control one or more servers.  Early consoles in the 1970s and 1980s provided a text-only \"command line\" interface, in which a network admin could type commands at a command prompt.  Modern consoles often provide a graphical interface that can be used to control machines on a local network (LAN) or provide remote access to remote systems.  These consoles typically include a mouse for navigating graphical interfaces.\nThe terms \"console\" and \"terminal\" are often used synonymously.  However, \"terminal\" may also be used to describe the software that runs on a console, such as a command line interface or remote access program.  Mac OS X includes both a Terminal program that provides a command line interface, and a Console utility that displays system logs and diagnostic reports.\nNOTE: A console may also refer to other types of hardware besides computer interfaces.  For example, gaming systems such as the PlayStation, Xbox, and Wii, are called video game consoles, while multi-channel audio mixing boards are called mixing consoles."
        ]
    },
    {
        "word": "Constant",
        "type": [],
        "definition": [
            "In mathematics, a constant is a specific number or a symbol that is assigned a fixed value.  For example, in the equation below, \"y\" and \"x\" are variables, while the numbers 2 and 3 are constants.\ny = 2x - 3\nConstants are also used in computer programming to store fixed values.  They are typically declared at the top of a source code file or at the beginning of a function.  Constants are useful for defining values that are used many times within a function or program.  For example, in the C++ code below, min and max are declared as constants.\nconst int min = 10;\nconst int max = 100;\nBy using constants, programmers can modify multiple instances of a value at one time.  For example, changing the value assigned to max in the example above will modify the value wherever max is referenced.  If the number 100 was used instead of max, the programmer would have to modify each instance of \"100\" individually.  Therefore, it is considered good programming practice to use constants whenever a fixed value is used multiple times."
        ]
    },
    {
        "word": "Container",
        "type": [],
        "definition": [
            "A container is a software package that contains everything the software needs to run.  This includes the executable program as well as system tools, libraries, and settings.  Containers are not installed like traditional software programs, which allows them to be isolated from the other software and the operating system itself.\nThe isolated nature of containers provides several benefits.  First, the software in a container will run the same in different environments.  For example, a container that includes PHP and MySQL can run identically on both a Linux computer and a Windows machine.  Second, containers provide added security since the software will not affect the host operating system.  While an installed application may alter system settings and modify resources, such as the Windows registry, a container can only modify settings within the container.  This makes containers ideal for software testing and development.\nContainers also eliminate installation issues, including system conflicts, version incompatibilities, and missing dependencies.  The result is a \"works on all machines\" solution, which is ideal for both developers and end users.  It also makes the jobs of network administrators easier, since they can deliver containers to a multiple users without having to worry about compatibility issues.\nContainers vs Virtual Machines\nContainers are similar to virtual machines (virtualization) since they include everything needed to run in a single package.  However, unlike virtual machines (VMs), containers do not include a guest OS.  Instead containers run on top of a \"container platform,\" like Docker, which is installed on an operating system.  Containers are \"lightweight,\" meaning they require far less disk space than VMs.  Additionally, multiple containers can run side-by-side on the same container platform."
        ]
    },
    {
        "word": "Contextual Menu",
        "type": [],
        "definition": [
            "A contextual menu is a pop-up menu that appears when you right-click on a certain area of the screen.  It is \"contextual\" because the menu options are relevant to what you click on.  While not all programs support contextual menus, most modern operating systems and applications include them as part of the interface design.\nContextual menus provide a choice of options that depend on where the cursor is when you click the right mouse button.  For example, if you right-click on your computer's desktop, the menu that appears will have desktop-specific commands.  These may include options to change the desktop background, create a new folder, clean up the icons, or view the desktop properties.  If you right-click within a desktop window, you might see options to create a new folder, change the view options, or view the folder properties.\nRight-clicking within an application typically provides menu options that are specific to the current program.  For example, if you right-click in a Web browser window, the menu that appears may include options such as \"Back,\" \"Reload,\" and \"Print.\"  Right-clicking a misspelled word in a word processing program often presents a list of similar correctly spelled words.  If you right-click a picture in an image-editing program, you may see a choice of editing options.  These are just a few examples of the many contextual menus included in different programs.\nIt may be helpful to think of a contextual menu of as a streamlined menu bar.  This is because they typically contain many of the same options as the program's main menu, but only include the choices relevant to the location you clicked.  Therefore, contextual menus can be a quick and efficient way of selecting the option you need.  So next time you use your favorite program, try right-clicking in different areas of the screen.  You might find some pretty useful options you didn't even know existed!"
        ]
    },
    {
        "word": "Control Panel",
        "type": [],
        "definition": [
            "The Control Panel is a feature of the Windows operating system that allows the user to modify system settings and controls.  It includes several small applications, or control panels, that can be used to view and change hardware or software settings.  Some examples of hardware control panels are Display, Keyboard, and Mouse settings.  Software control panels include Date and Time, Power Options, Fonts, and Administrative Tools.\nMany control panels are included as part of the Windows operating system, but others can be installed by third-party applications or utilities.  For example, if you add a new mouse to your computer, it may come with a CD for installing a control panel specific for that mouse.  Some graphics cards may also install an additional control panel that gives the user greater control over the computer's visual settings.  Regardless of when control panels are installed, they can always be found within the Control Panel folder.\nThe Windows Control Panel can be accessed by clicking the Start menu and selecting Control Panel.  It is also available in the \"Other Places\" section of the window's sidebar when you open My Computer.  In Windows XP and Windows Vista the Control Panel can be viewed in either Category View or Classic View.  Category View arranges the control panels into sections, while Classic View shows them all at once.  While the Category View is designed to make locating different settings easier, people familiar with most of the control panels often find the Classic View more efficient.\nControl Panels were also used for many years by the Mac OS, through Mac OS 9.  However, with the introduction of Mac OS X, control panels were consolidated into a single interface called System Preferences.  The control panels themselves are now called \"Preference Panes\" in Mac OS X.  They can be accessed by selecting \"System Preferences\" from the Apple menu or by clicking the System Preferences icon in the Dock."
        ]
    },
    {
        "word": "Control Unit",
        "type": [],
        "definition": [
            "A control unit (CU) is an integrated circuit in a processor that controls the input and output.  It receives instructions from a program, then passes them to the arithmetic logic unit (ALU).  The ALU performs the appropriate calculations and sends the resulting values back to the control unit.  The control unit sends these values to the corresponding program as output.\nA typical control unit is comprised of several logic gates and includes two important components:\n\nProgram Counter (PC)\nInstruction Register (IR)\n\nThe program counter loads individual instructions from memory and stores them sequentially.  The instruction register decodes these instructions and converts them to commands for the CPU.  After each instruction, the CU increments the program counter and fetches the next instruction.\nControl units operate at the clock speed of the corresponding CPU.  Therefore, the control unit of a 3 GHz processor can handle three billion operations per second."
        ]
    },
    {
        "word": "Controller Card",
        "type": [],
        "definition": [
            "The controller card, or simply \"controller,\" is a piece of hardware that acts as the interface between the motherboard and the other components of the computer.  For example, hard drives, optical drives, printers, keyboards, and mice all require controllers to work.  Most computers have all the necessary controllers built in the motherboard as chips, not full-sized cards.  However, if you add additional components such as a SCSI hard drive, you may need to add a controller card as well.  Controller cards are typically installed in one of the computer's PCI slots."
        ]
    },
    {
        "word": "Cookie",
        "type": [],
        "definition": [
            "A cookie is a small amount of data generated by a website and saved by your web browser.  Its purpose is to remember information about you, similar to a preference file created by a software application.\nWhile cookies serve many functions, their most common purpose is to store login information for a specific site.  Some sites will save both your username and password in a cookie, while others will only save your username.  Whenever you check a box that says, \"Remember me on this computer,\" the website will generate a login cookie once you successfully log in.  Each time you revisit the website, you may only need to enter your password or you might not need to log in at all.\nCookies are also used to store user preferences for a specific site.  For example, a search engine may store your search settings in a cookie.  A news website may use a cookie to save a custom text size you select for viewing news articles.  Financial websites sometimes use cookies to store recently viewed stock quotes.  If a website needs to store a lot of personal information, it may use a cookie to remember who you are, but will load the information from the web server.  This method, called \"server side\" storage, is often used when you create an account on a website.\nBrowser cookies come in two different flavors: \"session\" and \"persistent.\"  Session cookies are temporary and are deleted when the browser is closed.  These types of cookies are often used by e-commerce sites to store items placed in your shopping cart, and can serve many other purposes as well.  Persistent cookies are designed to store data for an extended period of time.  Each persistent cookie is created with an expiration date, which may be anywhere from a few days to several years in the future.  Once the expiration date is reached, the cookie is automatically deleted.  Persistent cookies are what allow websites to \"remember you\" for two weeks, one month, or any other amount of time.\nMost web browsers save all cookies in a single file.  This file is located in a different directory for each browser and is not meant to be opened manually.  Fortunately, most browsers allow you to view your cookies in the browser preferences, typically within the \"Privacy\" or \"Security\" tab.  Some browsers allow you to delete specific cookies or even prevent cookies from being created.  While disallowing cookies in your browser may provide a higher level of privacy, it is not recommended since many websites require cookies to function properly.\nNOTE: Since cookies are stored in a different location for each web browser, if you switch browsers, new cookies will need to be created."
        ]
    },
    {
        "word": "Copy",
        "type": [],
        "definition": [
            "Many software programs allow you to copy data, such as text in Microsoft Word or an image in Adobe Photoshop.  To copy a piece of data, you need to first select it (or highlight it) and choose \"Copy\" from the Edit menu within the program.  Most programs allow you to use the keyboard shortcut \"Control-C\" for Windows or \"Command-C\" for the Mac OS.\nWhen you copy a piece of data, it is moved to a buffer in the system's memory called the \"Clipboard.\"  This is a temporary storage area in your computer's RAM that holds the most recent item that has been copied.  Of course, copying isn't very helpful if you can't use the data somewhere else.  To insert the copied data into a document, choose \"Paste\" from the Edit menu and the data will be pasted into the document.\nFor more information about copying and pasting, view the Help Center article."
        ]
    },
    {
        "word": "Copyright",
        "type": [],
        "definition": [
            "Copyright is a legal means of protecting an author's work.  It is a type of intellectual property that provides exclusive publication, distribution, and usage rights for the author.  This means whatever content the author created cannot be used or published by anyone else without the consent of the author.  The length of copyright protection may vary from country to country, but it usually lasts for the life of the author plus 50 to 100 years.\nMany different types of content can be protected by copyright.  Examples include books, poems, plays, songs, films, and artwork.  In modern times, copyright protection has been extended to websites and other online content.  Therefore, any original content published on the Web is protected by copyright law.  This is important in the digital age we live in, since large amounts of content can be easily copied and pasted.\nSo how do you obtain copyright protection?  Fortunately, in most countries, copyright protection is automatic.  This means whenever you publish original content, it is automatically protected by copyright law.  For example, if you post a blog on the Internet, your content is automatically covered by copyright.  In most cases, this type of copyright protection is all that is necessary.  However, if you want others to know your content is copyright protected, you can post the copyright logo (&copy;) next to your name on any Web pages that include your original content.  You may also want to include the years you have owned the content.  Below is an example of a copyright line:\nCopyright &copy; 2007-2009 [your name].\nIn situations where it is critical to protect an author's rights, many countries provide copyright registration, which allows authors to register copyrighted content with a central agency.  This makes it easier to prove ownership of content if it is ever disputed.\nCopyright provides a helpful means of protecting original content.  It serves to give people credit for the work they do, which is something we can all appreciate.  Therefore, if you ever consider copying someone else's content, think of how it would make you feel if someone copied your original work and published it as their own.  If you ever would like to use another person's content, make sure to ask the author for permission first.  And always give credit where credit is due."
        ]
    },
    {
        "word": "Copyright Infringement",
        "type": [],
        "definition": [
            "A copyright infringement is a violation of an individual or organization's copyright.  It describes the unauthorized use of copyrighted material, such as text, photos, videos, music, software, and other original content.  In the computer industry, copyright violations often refer to software programs and websites.\nSoftware is usually distributed under a certain type of license agreement, or SLA.  This license defines the terms of use, including whether or not the software can be distributed to other users.  For example, open source programs are free to use and may often be redistributed without limitations.  Commercial software, however, must be purchased and cannot be redistributed.  Using commercial software without paying for it is a copyright infringement and as commonly known as piracy.\nWebsites that contain original content are automatically protected under international copyright law.  In other words, you cannot copy the content of one website and publish it on another site without the author's permission.  Reposting text, images, videos, audio clips, or any other content found on the Web without permission constitutes a copyright infringement.  Legal penalties for violating website copyrights depend on the extent and damages caused by the copyright violation.\nSince we live in a digital age, copying content is often as simple as a copy and paste operation.  This makes it possible for one person to copy and republish content in a few minutes that may have taken another person several years to create.  Therefore, In 1998, the United States Congress took steps to defend intellectual property by passing the Digital Millennium Copyright Act, commonly known as DMCA.  This law defines specific types of digital copyright infringements and establishes serious penalties for violators.\nNOTE: If you ever want to use or republish content from the Web, you should always ask the author for permission and include an appropriate reference and link to the original content."
        ]
    },
    {
        "word": "Crash",
        "type": [],
        "definition": [
            "In computing, a crash is an unexpected termination of a process.  Crashes can happen to individual applications as well as the operating system itself.  Some crashes produce error messages, while other crashes may cause a program or the entire system to hang or freeze.\nWhen a crash occurs, it can cause a number of different problems.  If you are typing a document in a word processor, for example, you may lose the changes you made since you last saved the document.  If you are copying or downloading a file, the crash may produce a corrupt file.  In some cases, a crash can even cause errors in the file system of your storage device.\nSince crashes create a negative user experience, software developers aim to create stable programs that do not crash.  This involves removing bugs that produce undefined or infinite calculations and eliminating memory leaks.  Some programs are even designed to handle crashes gracefully, generating detailed error messages if a \"fatal error\" occurs.  Many productivity applications save your work periodically so you can recover your work after a crash.\nWith older computers (before the turn of the century), when a program crashed, it often took down the whole system with it.  This made restarting the computer a frequent task.  Modern operating systems support multi-threading, which enables programs to run independently of each other.  This allows the operating system and other programs to keep running when an application crashes.  If the operating system itself crashes, however, you may still be forced to restart your computer."
        ]
    },
    {
        "word": "Cron",
        "type": [],
        "definition": [
            "Also known as a \"cron job,\" a cron is a process or task that runs periodically on a Unix system.  Some examples of crons include syncing the time and date via the Internet every ten minutes, sending an e-mail notice once a week, or backing up certain directories every month.\nCrons can be scheduled using the Unix \"crontab\" command.  The jobs are stored in a crontab file and are run by the system at their scheduled times.  Or course, if you're not using Unix, you will not need to use a cron, or even know what one is.  But, if you've read this far, it certainly is a good term for impressing your friends."
        ]
    },
    {
        "word": "Crop",
        "type": [],
        "definition": [
            "When you crop an image or photo, you remove part of the image.  This may involve cutting some of the image from the left, right, top, bottom, or any combination thereof.  It may also mean just cutting out a small rectangular of the image.\nFor example, your friend takes a picture of your family and leaves a good five feet of headroom above the tallest person.  If you are going to use the photo as your Christmas card picture, you probably don't want half the picture to be filled with sky.  Therefore, you can use an image-editing program to crop the top part of the image, leaving only a small area above the tallest person's head.  If the camera was zoomed out too far, you may want to crop some of the sides as well.\nMost image editing programs include a crop function.  Typically, you select a rectangular area using the mouse and click \"Crop\" to remove the area outside the selection.  Once the image is cropped, the cropped section is discarded, leaving only the remainder.  Therefore, if you are working with an original photo, you may want to create a duplicate file before cropping and saving it.  Note that cropping is different than simply reducing a image's size, which involves lowering the image resolution."
        ]
    },
    {
        "word": "Cross-Browser",
        "type": [],
        "definition": [
            "When a software program is developed for multiple computer platforms, it is called a crossplatform program.  Similarly, when a website is developed for multiple browsers, it is called a cross-browser website.\nThe job of a Web developer would be much easier if all browsers were the same.  While most browsers are similar in both design and function, they often have several small differences in the way they recognize and display websites.  For example, Apple's Safari uses a different HTML rendering engines than Internet Explorer.  This means the browsers may display the same Web page with slightly different page and text formatting.  Since not all browsers support the same HTML tags, some formatting may not be recognized at all in an incompatible Web browser.  Furthermore, browsers interpret JavaScript code differently, which means a script may work fine in one browser, but not in another.\nBecause of the differences in the way Web browsers interpret HTML and JavaScript, Web developers must test and adapt their sites to work with multiple browsers.  For example, if a certain page looks fine in Firefox, but does not show up correctly in Internet Explorer,  the developer may change the formatting so that it works with Internet Explorer.  Of course, the page may then appear differently in Firefox.  The easiest fix for browser incompatibility problems is to use a more basic coding technique that works in both browsers.  However, if this solution is not possible, the developer may need to add code that detects the type of browser, then outputs custom HTML or JavaScript for that browser.\nMaking a cross-browser site is usually pretty simple for basic websites.  However, complex sites with a lot of HTML formatting and JavaScript may require significant extra coding in order to be compatible with multiple browsers.  Some developers may even generate completely different pages for each browser.  While CSS formatting has helped standardize the appearance of Web pages across multiple browsers, there are still several inconsistencies between Web browsers.  Therefore, cross-browser design continues to be a necessary aspect of Web development."
        ]
    },
    {
        "word": "Crossplatform",
        "type": [],
        "definition": [
            "Software that can run on multiple types of computer systems.  For example, the graphics program Adobe Photoshop and the word processor Microsoft Word are both available for the Windows and Macintosh operating systems.  Therefore, Photoshop and Word are considered to be crossplatform applications.\nWhile \"crossplatorm\" is typically used to describe computer software, it can refer to hardware as well.  For example, peripherals such as keyboards, mice, printers, scanners, and digital cameras that work on both Mac and PC are crossplatorm.  Software and hardware that work on more than one platform are also called multiplatform."
        ]
    },
    {
        "word": "Cryptography",
        "type": [],
        "definition": [
            "Cryptography is the science of protecting information by transforming it into a secure format.  This process, called encryption, has been used for centuries to prevent handwritten messages from being read by unintended recipients.  Today, cryptography is used to protect digital data.  It is a division of computer science that focuses on transforming data into formats that cannot be recognized by unauthorized users.\nAn example of basic cryptography is a encrypted message in which letters are replaced with other characters.  To decode the encrypted contents, you would need a grid or table that defines how the letters are transposed.  For example, the translation grid below could be used to decode \"1234125678906\" as \"techterms.com\".\n\n1t&nbsp;6m\n2e&nbsp;7s\n3c&nbsp;8.\n4h&nbsp;9c\n5r&nbsp;0o\n\nThe above table is also called a cipher.  Ciphers can be simple translation codes, such as the example above, or complex algorithms.  While simple codes sufficed for encoding handwritten notes, computers can easily break, or figure out, these types of codes.  Because computers can process billions of calculations per second, they can even break complex algorithms in a matter of seconds.  Therefore, modern cryptography involves developing encryption methods that are difficult for even supercomputers to break."
        ]
    },
    {
        "word": "Cursor",
        "type": [],
        "definition": [
            "The cursor on your screen can indicate two things: 1) where your mouse pointer is, or 2) where the next character typed will be entered in a line of text.\nThe mouse cursor is most often an arrow that you can use to point to different objects on your screen.  When the cursor is over an object, you can click or double-click the mouse button to perform an action on that object (such as opening a program).  The mouse cursor can change into other images, such as a small hand (when you roll over a link in a Web page), or an hourglass (when Windows is \"thinking\" so hard, it won't let you click on anything).\nThe text cursor is typically a straight vertical line or I-shaped object that flashes in a line of text.  Typically, when you are typing a paper, the cursor will be at the end of the line, because you are adding new text to the uncharted white area of the page.  However, if you want to insert a word or phrase somewhere else in a line of text, you can use the mouse cursor to click the position where you would like to insert the text.  In most word processing programs, once you start typing, the text cursor continues to flash, but the mouse pointer disappears until you move the mouse again.  This is to avoid \"cursor confusion,\" since most people can't type and click on things at the same time."
        ]
    },
    {
        "word": "Cut",
        "type": [],
        "definition": [
            "Cut is a command that allows you to \"cut out\" a selection of text or other data and save it to the clipboard.  It is similar to the Copy command, but instead of just copying the data to the clipboard, it removes the selected data at the same time.  For example, if you highlight a sentence in a word processing program and select \"Cut,\" the sentence is removed from the document and is added to the clipboard.  Therefore, selecting \"Cut\" is an simple way to both copy and delete a selection in a single step.\nObjects that can be cut include text, images, audio and video segments, and other types of data.  However, you may notice that some selections can only be copied and not cut.  This is typically because the object is not editable and therefore can only be copied.  If you cut a selection from a document, it can be pasted into another similar document.  However, if you copy something else to the clipboard before pasting the selection, the cut data may be lost.\nLike the Copy and Paste commands, the Cut command is located in the Edit menu of most programs.  The standard shortcut for \"Cut\" is Control-X in Windows and Command-X in Mac OS X.  (If you're wondering why it isn't the \"C\" key, that shortcut is reserved for the Copy command.)  Therefore, you can tell if a program supports the Cut command by clicking the Edit menu and looking for the Cut command."
        ]
    },
    {
        "word": "Cyberbullying",
        "type": [],
        "definition": [
            "There are bullies and then there are cyberbullies.  While bullying typically happens at school or work, cyberbullying takes place over cyberspace.  This includes both Internet and cell phone communication.  Like physical bullying, cyberbullying is aimed at younger people, such as children and teenagers.  It may involve harassing, threatening, embarrassing, or humiliating young people online.\nCyberbullying can take many forms.  The following are just a few examples:\n\nMaking fun of another user in an Internet chat room.\nHarassing a user over an instant messaging session.\nPosting derogatory messages on a user's Facebook or MySpace page.\nCirculating false rumors about someone on social networking websites.\nPublishing lewd comments about another person on a personal blog.\nPosting unflattering pictures of another user on the Web.\nSpamming another user with unwanted e-mail messages.\nSending threatening or provocative e-mails.\nRepeatedly calling another person's cell phone.\nSending unsolicited text messages to another user.\n\nCyberbullying may seem humorous to some people, but it is a serious matter.  Kids who are bullied online often feel hurt and rejected by their peers.  This can lead to low self esteem and depression.  Therefore, cyberbullying should not be tolerated and should be reported to authorities.\nNOTE: Technically, cyberbullying takes place between two young people.  When adults are involved, it may be called cyber-harassment or cyberstalking."
        ]
    },
    {
        "word": "Cybercrime",
        "type": [],
        "definition": [
            "Cybercrime is criminal activity done using computers and the Internet.  This includes anything from downloading illegal music files to stealing millions of dollars from online bank accounts.  Cybercrime also includes non-monetary offenses, such as creating and distributing viruses on other computers or posting confidential business information on the Internet.\nPerhaps the most prominent form of cybercrime is identity theft, in which criminals use the Internet to steal personal information from other users.  Two of the most common ways this is done is through phishing and pharming.  Both of these methods lure users to fake websites (that appear to be legitimate), where they are asked to enter personal information.  This includes login information, such as usernames and passwords, phone numbers, addresses, credit card numbers, bank account numbers, and other information criminals can use to \"steal\" another person's identity.  For this reason, it is smart to always check the URL or Web address of a site to make sure it is legitimate before entering your personal information.\nBecause cybercrime covers such a broad scope of criminal activity, the examples above are only a few of the thousands of crimes that are considered cybercrimes.  While computers and the Internet have made our lives easier in many ways, it is unfortunate that people also use these technologies to take advantage of others.  Therefore, it is smart to protect yourself by using antivirus and spyware blocking software and being careful where you enter your personal information."
        ]
    },
    {
        "word": "Cyberspace",
        "type": [],
        "definition": [
            "Unlike most computer terms, \"cyberspace\" does not have a standard, objective definition.  Instead, it is used to describe the virtual world of computers.  For example, an object in cyberspace refers to a block of data floating around a computer system or network.  With the advent of the Internet, cyberspace now extends to the global network of computers.  So, after sending an e-mail to your friend, you could say you sent the message to her through cyberspace.  However, use this term sparingly, as it is a popular newbie term and is well overused.\nThe word \"cyberspace\" is credited to William Gibson, who used it in his book, Neuromancer, written in 1984.  Gibson defines cyberspace as \"a consensual hallucination experienced daily by billions of legitimate operators, in every nation, by children being taught mathematical concepts... A graphical representation of data abstracted from the banks of every computer in the human system. Unthinkable complexity.  Lines of light ranged in the non-space of the mind, clusters and constellations of data\" (New York: Berkley Publishing Group, 1989), pp. 128."
        ]
    },
    {
        "word": "Cybersquatter",
        "type": [],
        "definition": [
            "In the early days of the United States, pioneers traveled west and claimed federal land as their own.  These people were called \"squatters,\" since they claimed rights to the land simply by occupying it.  In the mid-1800s, during the California gold rush, squatters became especially prominent and settled land throughout the west coast.\nIn the early 1990s, a new gold rush began, but this time the rush was for domain names, rather than gold.  Many early Internet users saw the potential value of prominent domain names and began to register as many domains as they could.  Over the course of a few years, nearly all common \"dot coms\" were registered.  Many of these domain names were registered for investment purposes, rather than being used for legitimate websites.  This practice soon became known as \"cybersquatting.\"\nCybersquatters may own anywhere from a single domain to a few thousand domain names.  These \"domainers,\" as they are also called, typically register domain names that contain popular words and phrases.  High profile domain names may generate traffic through manual \"type-ins\" or may simply be attractive to potential buyers.  Some domainers, called \"typosquatters,\" register domain names that are similar to well-known websites, but contain typos.  The goal of these domains is to generate traffic through mistyped URLs.  Generally, cybersquatters profit from their domain names by one of two ways: 1) generating advertising clicks on parked pages (single-page websites), or 2) selling the domains at a significant premium to those interested in buying them.\nWhile some cybersquatters have made huge profits by selling high-interest domain names, others have been forced to give up domains to the rightful owners.  The Anticybersquatting Consumer Protection Act (ACPA) was passed in 1999, which gives owners of trademarked or registered names legal rights to a related domain name.  In general terms, the law states that users cannot register a domain name that is the same or similar to the name of a known entity.  This prevents cybersquatters from extorting money from businesses or individuals by obtaining a specific domain name.\nIf a dispute over a domain name arises, the two parties may bring the case through a legal proceeding.  However, since this is a time-consuming process, ICANN has developed the Uniform Domain Name Dispute Resolution Policy (UDRP), which givens trademark owners a simple means to retrieve domain names from cybersquatters.  While cybersquatters still exist and remain prominent today, the rightful owners of certain names now have an easier (and much less expensive) way of getting the domain names they deserve."
        ]
    }
]