[
    {
        "word": "DAC",
        "type": [],
        "definition": [
            "Stands for \"Digital-to-Analog Converter\" and is often pronounced \"dac.\"  Since computers only recognize digital information, the output produced by computers is typically in digital format.  However, some output devices only accept analog input, which means a digital-to-analog converter, or DAC, must be used.\nThe most common use for a DAC is to convert digital audio to an analog signal.  This conversion typically takes place in the sound card, which has a built-in DAC.  The digital signal, which is basically a stream of ones and zeros, is transformed into an analog signal that might take the form of an electrical charge.  This electrical charge is recognized by most speaker inputs and therefore can be output to a speaker system.\nDACs are also used for converting video signals.  Historically, most video displays, such as TVs and computer monitors used analog inputs.  Only in the last couple of years have digital displays with DVI and HDMI connections become commonplace.  Therefore, in order for a computer to output to an analog display, the digital video signal must be converted to an analog signal.  This is why all video cards with an analog output (such as a VGA connection) also include a DAC.\nAny time a signal is converted from one format to another, there is a potential loss of quality.  Therefore, it is important to have a high-quality DAC whether you are converting audio or video signals.  The same holds true when performing the opposite conversion, which requires an analog-to-digital converter, or ADC."
        ]
    },
    {
        "word": "DAS",
        "type": [],
        "definition": [
            "Stands for \"Direct Attached Storage.\"  DAS refers to any storage device connected directly to a computer.  Examples include HDDs, SSDs, and optical drives.  While DAS can refer to internal storage devices, it is most often describes external devices, such as an external hard drive.\nThe term \"DAS\" was created to differentiate between network-attached storage (NAS) and direct-attached storage.  Before NAS and storage area networks (SANs) were available, direct-attached storage was the only option.  While DAS is still the most common type of storage used in personal computing, network and server administrators often need to choose between DAS and NAS for a storage solution.\nThe primary benefit of DAS vs NAS is the simplicity of the setup.  You can simply connect a device to a computer and, as long as the necessary drivers are available, it will show up as an additional storage device.  There is no need to configure network settings or set up permissions for individual computers.  The main drawback of DAS is that a direct-attached device is only accessible via the computer to which it is attached.  Therefore, a computer must be configured as a file server in order for other systems to access any connected DAS devices."
        ]
    },
    {
        "word": "DAW",
        "type": [],
        "definition": [
            "Stands for \"Digital Audio Workstation.\"  A DAW is a digital system designed for recording and editing digital audio.  It may refer to audio hardware, audio software, or both.\nEarly DAWs, such as those developed in the 1970s and 1990s, were hardware units that included a mixing console, data storage device, and an analog to digital converter (ADC).  They could be used to record, edit, and play back digital audio.  These devices, called \"integrated DAWs,\" are still used today, but they have largely been replaced by computer systems with digital audio software.\nToday, a computer system is the central user interface of most DAWs.  Most professional recording studios include one or more large mixing boards connected to a desktop computer.  Home studios and portable studios may simply include a laptop with audio software and a recording interface.\nSince computers have replaced most integrated DAWs, audio editing and post-production is now performed primarily with software rather than hardware.  Several audio production programs, commonly called DAW software, are available for both Macintosh and Windows systems.  Some common crossplatform titles include Avid Pro Tools, Steinberg Cubase, and Abelton Live.  Other platform-specific DAW programs include Cakewalk SONAR for Windows and MOTU Digital Performer for Mac OS X."
        ]
    },
    {
        "word": "DBMS",
        "type": [],
        "definition": [
            "Stands for \"Database Management System.\"  In short, a DBMS is a database program.  Technically speaking, it is a software system that uses a standard method of cataloging, retrieving, and running queries on data.  The DBMS manages incoming data, organizes it, and provides ways for the data to be modified or extracted by users or other programs.\nSome DBMS examples include MySQL, PostgreSQL, Microsoft Access, SQL Server, FileMaker, Oracle, RDBMS, dBASE, Clipper, and FoxPro.  Since there are so many database management systems available, it is important for there to be a way for them to communicate with each other.  For this reason, most database software comes with an Open Database Connectivity (ODBC) driver that allows the database to integrate with other databases.  For example, common SQL statements such as SELECT and INSERT are translated from a program's proprietary syntax into a syntax other databases can understand."
        ]
    },
    {
        "word": "DCIM",
        "type": [],
        "definition": [
            "Short for \"Digital Camera Images.\"  DCIM is the standard name of the root folder digital cameras use to store digital photos.  Therefore, when you connect a digital camera to your computer, the disk that appears on your desktop (Mac) or in \"My Computer\" (Windows) will most likely have a folder named \"DCIM\" inside it.\nThe DCIM directory is part of the DCF (Design Rule for Camera File System) developed by JEITA (Japan Electronics and Information Technology Industries Association).  This file system was originally established in December 1998 and has since become the standard file system used by all digital cameras.  Therefore, whenever you connect a digital camera or smartphone to your PC, your computer will look for the DCIM folder.  Similarly, if you insert a memory card into a card reader connected to your computer, it will scan the memory card for a folder named \"DCIM.\"\nThe DCIM folder provides a standard way for computers to recognize and import images from connected devices.  For example, if your computer finds a DCIM folder on a memory card, it may automatically open your default image organization program or image importing utility.  This allows all types of computers to find and import images from cameras made by different manufacturers.\nWhile most computers include software that can automatically import all images from the DCIM folder, you can also manually browse through the images stored within the DCIM directory.  However, you may have to browse through multiple subdirectories to find all the images.  Additionally, your camera may save thumbnail images along with the full size images.  By using a program or utility that imports digital photos, you can make sure to import all the full size images from the DCIM folder to your computer correctly."
        ]
    },
    {
        "word": "DDL",
        "type": [],
        "definition": [
            "Stands for \"Data Definition Language.\"  A DDL is a language used to define data structures and modify data.  For example, DDL commands can be used to add, remove, or modify tables within in a database.  DDLs used in database applications are considered a subset of SQL, the Structured Query Language.  However, a DDL may also define other types of data, such as XML.\nA Data Definition Language has a pre-defined syntax for describing data.  For example, to build a new table using SQL syntax, the CREATE command is used, followed by parameters for the table name and column definitions.  The DDL can also define the name of each column and the associated data type.  Once a table is created, it can be modified using the ALTER command.  If the table is no longer needed, the DROP command can be used to delete the table.\nSince DDL is a subset of SQL, it does not include all the possible SQL commands.  For example, commands such as SELECT and INSERT are considered part of the Data Manipulation Language (DML), while access commands such as CONNECT and EXECUTE are part of the Data Control Language (DCL).  The DDL, DML, and DCL languages include most of the commands supported by SQL."
        ]
    },
    {
        "word": "DDR",
        "type": [],
        "definition": [
            "Stands for \"Double Data Rate.\"  It is an advanced version of SDRAM, a type of computer memory.  DDR-SDRAM, sometimes called \"SDRAM II,\" can transfer data twice as fast as regular SDRAM chips.  This is because DDR memory can send and receive signals twice per clock cycle.  The efficient operation of DDR-SDRAM makes the memory great for notebook computers since it uses up less power."
        ]
    },
    {
        "word": "DDR2",
        "type": [],
        "definition": [
            "Stands for \"Double Data Rate 2.\"  DDR2 RAM is an improved version of DDR memory that is faster and more efficient. Like standard DDR memory, DDR2 memory can send data on both the rising and falling edges of the processor's clock cycles.  This nearly doubles the amount of work the RAM can do in a given amount of time.  DDR and DDR2 are also both types of SDRAM, which allows them to run faster than conventional memory.\nWhile DDR and DDR2 have many similarities, DDR2 RAM uses a different design than DDR memory.  The improved design allows DDR2 RAM to run faster than standard DDR memory.  The modified design also gives the RAM more bandwidth, which means more data can be passed through the RAM chip at one time.  This increases the efficiency of the memory.  Since DDR2 runs more efficiently than standard DDR memory, it actually uses less power than DDR memory, even though it runs faster.  The only downside of DDR2 memory is that it is not compatible with standard DDR slots.  So make sure your computer supports DDR2 RAM before upgrading your memory."
        ]
    },
    {
        "word": "DDR3",
        "type": [],
        "definition": [
            "Stands for \"Double Data Rate Type 3.\"  DDR3 is a type of SDRAM that is used for system memory.  It is available in both DIMM and SO-DIMM form factors.\nDDR3 RAM is similar to DDR2 RAM, but uses roughly 30% less power and can transfer data twice as fast.  While DDR2 memory can transfer data at up to 3200 MBps (megabytes per second), DDR3 memory supports maximum data transfer rates of 6400 MBps.  This means computers with DDR3 memory can transfer data to and from the CPU much faster than systems with DDR2 RAM.  The faster memory speed prevents bottlenecks, especially when processing large amounts of data.  Therefore, if two computers have the same processor clock speed, but different types of memory, the computer with DDR3 memory may perform faster than the computer with DDR2 memory.\nDDR3 memory modules look similar to DDR and DDR2 chips, but the gap that separates the two sets of pins on the bottom of each module is in a different location.  This prevents the RAM chip from being installed in a slot that does not support DDR3 RAM.  Therefore, when upgrading your computer's memory, make sure you get the appropriate type of memory for your computer."
        ]
    },
    {
        "word": "DDR4",
        "type": [],
        "definition": [
            "Stands for \"Double Data Rate 4.\"  DDR4 is the fourth generation of DDR RAM, a type of memory commonly used in desktop and laptop computers.  It was introduced in 2014, though it did not gain widespread adoption until 2016.\nDDR4 is designed to replace DDR3, the previous DDR standard.  Advantages include faster data transfer rates and larger capacities, thanks to greater memory density and more memory banks (16 rather than 8).  DDR4 also operates at a lower voltage (1.2V compared to 1.5V), so it is more power-efficient.\nBelow are some notable DDR4 specifications:\n\n64 GB maximum capacity per memory module (common capacities are 16 GB and 32 GB)\n16 internal memory banks\n1600 to 4400 MHz clock speed\n17 to 35.2 GB\/s data transfer rate\n1.2 volts of electrical power\n288 pins on a regular DIMM, 260 pins on a SO-DIMM\n\nDDR4 memory modules come in two primary form factors — DIMMs and SO-DIMMs.  Desktop towers often contain DIMMs, while laptops and all-in-one desktop computers typically use SO-DIMMs.  DDR4 DIMMs are the first to have a curved bottom edge, which makes it easier to insert them into and remove them from RAM slots on a motherboard.  This and the unique position of the notch between the pins make it impossible to insert a DDR4 chip into an incompatible slot.\nFaster speeds and increased memory bandwidth allow DDR4 SDRAM to keep up with modern processors, including multi-core CPUs.  This prevents the memory from being a bottleneck as processing speeds and bus speeds increase.\nNOTE: SDRAM must be matched with the specific requirements of a computer.  When upgrading your memory, make sure you select the type (DDR2, DDR3, DDR4, etc) and speed (1600, 2400, 3200, etc) that is compatible with your computer."
        ]
    },
    {
        "word": "DFS",
        "type": [],
        "definition": [
            "Stands for \"Distributed File System.\"  A DFS manages files and folders across multiple computers.  It serves the same purpose as a traditional file system, but is designed to provide file storage and controlled access to files over local and wide area networks.\nEven when files are stored on multiple computers, DFS can organize and display the files as if they are stored on one computer.  This provides a simplified interface for clients who are given access to the files.  Users can also share files by copying them to a directory in the DFS and can update files by editing existing documents.  Most distributed file systems provide concurrency control or file locking, which prevents multiple people from editing the same file at the same time.\nThere are several types of DFSes, though some of the most common implementations include Server Message Block (SMB), Apple Filing Protocol (AFP), and Microsoft's Distributed File System (often called \"MS-DFS\" or simply \"DFS\").  DFS is included as a standard component of Windows Server, while SMB is typically installed on Linux machines."
        ]
    },
    {
        "word": "DHCP",
        "type": [],
        "definition": [
            "Stands for \"Dynamic Host Configuration Protocol.\"  DHCP is a protocol that automatically assigns a unique IP address to each device that connects to a network.  With DHCP, there is no need to manually assign IP addresses to new devices.  Therefore, no user configuration is necessary to connect to a DHCP-based network.  Because of its ease of use and widespread support, DHCP is the default protocol used by most routers and networking equipment.\nWhen you connect to a network, your device is considered a client and the router is the server.  In order to successfully connect to a network via DHCP, the following steps must take place.\n\nWhen a client detects it has connected to a DHCP server, it sends a DHCPDISCOVER request.\nThe router either receives the request or redirects it to the appropriate DHCP server.\nIf the server accepts the new device, it will send a DHCPOFFER message back to the client, which contains the client device's MAC address and the IP address being offered.\nThe client returns a DHCPREQUEST message to the server, confirming it will use the IP address.\nFinally, the server responds with a DHCPACK acknowledgement message that confirms the client has been given access (or a \"lease\") for a certain amount of time.\n\nDHCP works in the background when you connect to a network, so you will rarely see any of the above steps happen.  The time it takes to connect via DHCP depends on the type of router and the size of the network, but it usually takes around three to ten seconds.  DHCP works the same way for both wired and wireless connections, which means desktop computers, tablets, and smartphones can all connect to a DHCP-based network at the same time."
        ]
    },
    {
        "word": "DIMM",
        "type": [],
        "definition": [
            "Stands for \"Dual In-Line Memory Module.\"  It is a type of computer memory.  A DIMM is a small circuit board that holds memory chips. It uses a 64-bit bus to the memory, whereas a single in-line memory module (SIMM) only has a 32-bit path.  This allows DIMMs to transfer more data at once.  Because DIMMs have faster data transfer capabilities than SIMMs, they have pretty much replaced SIMMs."
        ]
    },
    {
        "word": "DKIM",
        "type": [],
        "definition": [
            "Stands for \"DomainKeys Identified Mail.\"  DKIM is an email authentication technology that verifies a message was sent from a legitimate user of an email address.  It is designed to prevent email forgery or spoofing.\nDKIM works by attaching a digital signature to the header of an email message.  The header is generated by the outgoing mail server and is unique to the domain hosted on the server.  The receiving mail server can check the header against a public key stored in the sending server's DNS record to confirm the authenticity of the message.\nMany popular email services like Gmail, Yahoo! Mail, and Outlook use DKIM by default.  Other email accounts, such as those set up on web servers may require DKIM to be manually activated.  For example, cPanel – a popular Linux web server application – allows an administrator to activate DKIM in the Email &rarr; Authentication section of the cPanel interface.  Once DKIM is enabled, it is activated for all users automatically.\nWhile DKIM provides a simple way to verify a message has been sent from the corresponding domain, it is not a foolproof solution.  For example, the receiving mail server must also support DKIM or the header information will be ignored.  Additionally, messages with a valid signature can be forwarded or resent from another email address.  It is also important to note that DKIM is designed to authenticate messages, not prevent spam.  While a valid DKIM header may mean a message is less likely to be spam, it has no relation to the content of the message.\nHistory\nThe DomainKeys Identified Mail specification was created in 2005 when Yahoo! and Cisco merged their respective DomainKeys and Identified Internet Mail into a single solution.  It was published by the Internet Engineering Task Force (IETF) the same year and has been in use ever since.\nNOTE: DKIM is commonly used along with SPF (Server Policy Framework), though the two verification methods are completely separate."
        ]
    },
    {
        "word": "DLC",
        "type": [],
        "definition": [
            "Stands for \"Downloadable Content.\"  DLC refers to additional content that can be downloaded within a video game.  It has become a common feature in PC, console, and mobile games.\nThe most common type of downloadable content is extra maps or levels that extend the gameplay of the original game.  For example, Activision provides Modern Warfare players with new downloadable levels every few months.  The company also releases new songs for its Guitar Hero series on a regular basis.  By downloading new levels or songs, players can continue to enjoy new challenges after completing the original game.\nAnother popular type of DLC includes extra items that can be incorporated into the game.  For instance, Capcom allows Street Fighter IV players to download custom outfits for their favorite players.  Microsoft provides additional vehicles that can be downloaded by Forza Motorsport 3 users.  Epic Games provides Gears of War 3 players with new characters that can be added to the game.\nWhile some downloadable content is offered for free, most DLC must be purchased.  The cost of downloadable content packs is typically much less than the price the original game, though multiple DLC purchases may surpass the cost of the game itself.  Therefore, DLC has become a common way for software developers to generate a continual long-term revenue stream from video games.\nNOTE: While DLC first became popular on gaming consoles, it soon progressed to PC games, and then to mobile devices.  Now, many mobile apps offer \"in-app purchases,\" which is synonymous with DLC."
        ]
    },
    {
        "word": "DLL",
        "type": [],
        "definition": [
            "Stands for \"Dynamic Link Library.\"  A DLL (.dll) file contains a library of functions and other information that can be accessed by a Windows program.  When a program is launched, links to the necessary .dll files are created.  If a static link is created, the .dll files will be in use as long as the program is active.  If a dynamic link is created, the .dll files will only be used when needed.  Dynamic links help programs use resources, such as memory and hard drive space, more efficiently.\nDLL files can also be used by more than one program.  In fact, they can even be used by multiple programs at the same time.  Some DLLs come with the Windows operating system while others are added when new programs are installed.  You typically don't want to open a .dll file directly, since the program that uses it will automatically load it if needed.  Though DLL filenames usally end in \".dll,\" they can also end in .exe, .drv, and .fon, just to make things more confusing.\nFile extension: .DLL"
        ]
    },
    {
        "word": "DMA",
        "type": [],
        "definition": [
            "Stands for \"Direct Memory Access.\" DMA is a method of transferring data from the computer's RAM to another part of the computer without processing it using the CPU.  While most data that is input or output from your computer is processed by the CPU, some data does not require processing, or can be processed by another device.  In these situations, DMA can save processing time and is a more efficient way to move data from the computer's memory to other devices.\nFor example, a sound card may need to access data stored in the computer's RAM, but since it can process the data itself, it may use DMA to bypass the CPU.  Video cards that support DMA can also access the system memory and process graphics without needing the CPU.  Ultra DMA hard drives use DMA to transfer data faster than previous hard drives that required the data to first be run through the CPU.\nIn order for devices to use direct memory access, they must be assigned to a DMA channel.  Each type of port on a computer has a set of DMA channels that can be assigned to each connected device.  For example, a PCI controller and a hard drive controller each have their own set of DMA channels."
        ]
    },
    {
        "word": "DMZ",
        "type": [],
        "definition": [
            "Stands for \"Demilitarized Zone.\"  In computing, a DMZ is a section of a network that exists between the intranet and a public network, such as the Internet.  It may contain a single host or multiple computer systems.\nThe purpose of a DMZ is to protect an intranet from external access.  By separating the intranet from hosts that can be accessed outside a local network (LAN), internal systems are protected from unauthorized access outside the network.  For example, a business may have an intranet comprised of employee workstations.  The company's public servers, such as the web server and mail server could be placed in a DMZ so they are separate from the workstations.  If the servers were compromised by an external attack, the internal systems would be unaffected.\nA DMZ can be configured several different ways, but two of the most common include single firewall and dual firewall architectures.  In a single firewall setup, the intranet and DMZ are on separate networks, but share the same firewall, which monitors and filters traffic from the ISP.  In a dual firewall setup, one firewall is placed between the intranet and the DMZ and another firewall is placed between the DMZ and the Internet connection.  This setup is more secure since it provides two layers of defense against external attacks.\nNOTE: The term \"DMZ\" or \"Demilitarized Zone\" comes from a military term used to describe a neutral area where military operations are not allowed to take place.  These areas typically exist along the border between two different countries.  They serve as a buffer and are designed to prevent unnecessary escalations of military action.  Similarly, a DMZ is a neutral area within a computer network that can be accessed by both internal and external computer systems."
        ]
    },
    {
        "word": "DNS",
        "type": [],
        "definition": [
            "Stands for \"Domain Name System.\"  Domain names serve as memorizable names for websites and other services on the Internet.  However, computers access Internet devices by their IP addresses.  DNS translates domain names into IP addresses, allowing you to access an Internet location by its domain name.\nThanks to DNS, you can visit a website by typing in the domain name rather than the IP address.  For example, to visit the Tech Terms Computer Dictionary, you can simply type \"techterms.com\" in the address bar of your web browser rather than the IP address (67.43.14.98).  It also simplifies email addresses, since DNS translates the domain name (following the \"@\" symbol) to the appropriate IP address.\nTo understand how DNS works, you can think of it like the contacts app on your smartphone.  When you call a friend, you simply select his or her name from a list.  The phone does not actually call the person by name, it calls the person's phone number.  DNS works the same way by associating a unique IP address with each domain name.\nUnlike your address book, the DNS translation table is not stored in a single location.  Instead, the data is stored on millions of servers around the world.  When a domain name is registered, it must be assigned at least two nameservers (which can be edited through the domain name registrar at any time).  The nameserver addresses point to a server that has a directory of domain names and their associated IP addresses.  When a computer accesses a website over the Internet, it locates the corresponding nameserver and gets the correct IP address for the website.\nSince DNS translation creates additional overhead when connecting to websites, ISPs cache DNS records and host the data locally.  Once the IP address of a domain name is cached, an ISP can automatically direct subsequent requests to the appropriate IP address.  This works great until an IP address changes, in which case the request may be sent to the wrong server or the server will not respond at all.  Therefore, DNS caches are updated regularly, usually somewhere between a few hours and a few days. "
        ]
    },
    {
        "word": "DNS Record",
        "type": [],
        "definition": [
            "DNS records are stored in zone files and are used for translating domain names to IP addresses.  They also contain other data, including the domain name's name server and mail server information.  If there are domain name aliases, such as the commonly used \"www\" preceding the domain name, these will also be listed in the DNS record.\nA typical DNS record may look something like this:\n;&nbsp;&nbsp; Nameservers\n;\n&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; NS&nbsp;&nbsp; ns1.4servers.com.&nbsp;&nbsp; ; 123.456.789.01\n&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; NS&nbsp;&nbsp; ns2.4servers.com.&nbsp;&nbsp; ; 123.456.789.02\n;\n;&nbsp;&nbsp; Domain Mail Handlers\n;\nyourdomain.com.&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; MX&nbsp;&nbsp; 0&nbsp;&nbsp; mail\nyourdomain.com.&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; MX&nbsp;&nbsp;10&nbsp;&nbsp; mail\n;\n;\n;&nbsp;&nbsp; hosts in order\n;\nyourdomain.&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; A&nbsp;&nbsp; Your.IP.XXX\nwww&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; A&nbsp;&nbsp; Your.IP.XXX\nsmtp&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; CNAME&nbsp;&nbsp; www\npop&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; CNAME&nbsp;&nbsp; www\nftp&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; CNAME&nbsp;&nbsp; www\nmail&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; IN&nbsp;&nbsp; A&nbsp;&nbsp; Your.IP.XXX\n;\n; end\nSince DNS records are made up entirely of text, they are easy to modify when needed.  However, one small typo could redirect a domain name to the wrong Web server or prevent it from showing up at all.  This is why it is important to enter DNS information accurately and double-check your changes entry before saving the zone file."
        ]
    },
    {
        "word": "DNSSEC",
        "type": [],
        "definition": [
            "Stands for \"Domain Name System Security Extensions.\"  It is an extension of the standard domain name system (DNS), which translates domain names to IP addresses.  DNSSEC improves security by validating the authenticity of the DNS data.\nThe original domain name system was developed in the 1980s with minimal security.  For example, when a host requests an IP address from a name server using a standard DNS query, it assumes the name server is valid.  However, a name server can pretend to be another server by spoofing (or faking) its IP address.  A fake name server could potentially redirect domain names to the wrong websites.\nDNSSEC provides extra security by requiring authentication with a digital signature.  Each query and response is \"signed\" using a public\/private key pair.  The private key is generated by the host and the public key is generated by a DNS zone, or group of trusted servers.  These servers create a chain of trust, in which they validate each other's public keys.  Each DNSSEC-enabled name server stores its public key in a hashed \"DNSKEY\" DNS record.\nEnabling DNSSEC\nWhile DNSSEC is not required for web servers or mail servers, many web hosts recommend it.  To configure DNSSEC, you must use a nameserver that supports it, like PowerDNS or Knot DNS.  Then you must enable DNSSEC on your server and configure it within the control panel interface.\nIf you are using a public nameserver, activating DNSSEC up may be as simple as clicking \"Enable DNSSEC.\"  If you are using a custom name server, you may need to manually create one or more delegation signer (DS) records.  After you have enabled DNSSEC, it may take several hours to activate since the server must validate the DS records with other servers within the DNS zone."
        ]
    },
    {
        "word": "DOS",
        "type": [],
        "definition": [
            "Stands for \"Disk Operating System.\"  DOS was the first operating system used by IBM-compatible computers.  It was originally available in two versions that were essentially the same, but marketed under two different names.  \"PC-DOS\" was the version developed by IBM and sold to the first IBM-compatible manufacturers.  \"MS-DOS\" was the version that Microsoft bought the rights to, and was bundled with the first versions of Windows.\nDOS uses a command line, or text-based interface, that allows the user to type commands.  By typing simple instructions such as pwd (print working directory) and cd (change directory), the user can browse the files on the hard drive, open files, and run programs.  While the commands are simple to type, the user must know the basic commands in order to use DOS effectively (similar to Unix).  This made the operating system difficult for novices to use, which is why Microsoft later bundled the graphic-based Windows operating system with DOS.\nThe first versions of Windows (through Windows 95) actually ran on top of the DOS operating system.  This is why so many DOS-related files (such as .INI, .DLL, and .COM files) are still used by Windows.  However, the Windows operating system was rewritten for Windows NT (New Technology), which enabled Windows to run on its own, without using DOS.  Later versions of Windows, such as Windows 2000, XP, and Vista, also do not require DOS.\nDOS is still included with Windows, but is run from the Windows operating system instead of the other way around.  The DOS command prompt can be opened in Windows by selecting \"Run...\" from the Start Menu and typing cmd."
        ]
    },
    {
        "word": "DPI",
        "type": [],
        "definition": [
            "Stands for \"Dots Per Inch.\"  DPI is used to measure the resolution of an image both on screen and in print.  As the name suggests, the DPI measures how many dots fit into a linear inch.  Therefore, the higher the DPI, the more detail can be shown in an image.\nIt should be noted that DPI is not dots per square inch.  Since a 600 dpi printer can print 600 dots both horizontally and vertically per inch, it actually prints 360,000 (600 x 600) dots per square inch.\nAlso, since most monitors have a native resolution of 72 or 96 pixels per inch, they cannot display a 300 dpi image in actual size.  Instead, when viewed at 100%, the image will look much larger than the print version because the pixels on the screen take up more space than the dots on the paper."
        ]
    },
    {
        "word": "DRAM",
        "type": [],
        "definition": [
            "Stands for \"Dynamic Random Access Memory.\"  DRAM is a type of RAM that stores each bit of data on a separate capacitor.  This is an efficient way to store data in memory, because it requires less physical space to store the same amount of data than if it was stored statically.  Therefore, a DRAM chip can hold more data than an SRAM (static RAM) chip of the same size can.  However, the capacitors in DRAM need to constantly be refreshed to keep their charge, so DRAM requires more power than SRAM.\nStill, because DRAM can hold more data than SRAM and because it is significantly less expensive to manufacture, DRAM is the most common type of memory found in personal computer systems.  While there are many types of DRAM available, the most common type is synchronous DRAM SDRAM, which is a faster version of standard DRAM.  This is the type of memory most computers use for their main system memory.\nIf you choose to upgrade your computer's SDRAM, check your machine's requirements to see if the memory modules must be installed in pairs.  If so, you will need to replace two modules at once and they must be the same size (i.e. two 1GB SDRAM memory modules)."
        ]
    },
    {
        "word": "DRM",
        "type": [],
        "definition": [
            "Stands for \"Digital Rights Management.\"  DRM refers to a collection of systems used to protect the copyrights of electronic media.  These include digital music and movies, as well as other data that is stored and transferred digitally.  For example, the Apple iTunes Music Store uses a DRM system to limit the number of computers that songs can be played on.  Each audio file downloaded from the iTunes music store includes information about the owner of the file and how many times the file has been transferred.  The protected files will not play on computers that have not been authorized to play the music.\nDigital Rights Management is important to publishers of electronic media since it helps ensure they will receive the appropriate revenue for their products.  By controlling the trading, protection, monitoring, and tracking of digital media, DRM helps publishers limit the illegal propagation of copyrighted works.  This can be accomplished by using digital watermarks or proprietary file encryption on the media they distribute.  Whatever method publishers choose to employ, DRM helps them make sure that their digital content is only used by those who have paid for it."
        ]
    },
    {
        "word": "DSL",
        "type": [],
        "definition": [
            "Stands for \"Digital Subscriber Line.\"  DSL is a communications medium used to transfer digital signals over standard telephone lines.  Along with cable Internet, DSL is one of the most popular ways ISPs provide broadband Internet access.\nWhen you make a telephone call using a landline, the voice signal is transmitted using low frequencies from 0 Hz to 4 kHz.  This range, called the \"voiceband,\" only uses a small part of the frequency range supported by copper phone lines.  Therefore, DSL makes use of the higher frequencies to transmit digital signals, in the range of 25 kHz to 1.5 MHz.  While these frequencies are higher than the highest audible frequency (20 kHz), they can still cause interference during phone conversations.  Therefore, DSL filters or splitters are used to make sure the high frequencies do not interfere with phone calls.\nSymmetric DSL (SDSL) splits the upstream and downstream frequencies evenly, providing equal speeds for both sending and receiving data.  However, since most users download more data than they upload, ISPs typically offer asymmetric DSL (ADSL) service.  ADSL provides a wider frequency range for downstream transfers, which offers several times faster downstream speeds.  For example, an SDSL connection may provide 2 Mbps upstream and downstream, while an ASDL connection may offer 20 Mbps downstream and 1.5 Mbps upstream.\nIn order to access the Internet using DSL, you must connect to a DSL Internet service provider (ISP).  The ISP will provide you with a DSL modem, which you can connect to either a router or a computer.  Some DSL modems now have built-in wireless routers, which allows you to connect to your DSL modem via Wi-Fi.  A DSL kit may also include a splitter and filters that you can connect to landline phones.\nNOTE: Since DSL signals have a limited range, you must live within a specific distance of an ISP in order to be eligible for DSL Internet service.  While most urban locations now have access to DSL, it is not available in many rural areas."
        ]
    },
    {
        "word": "DSLAM",
        "type": [],
        "definition": [
            "Stands for \"Digital Subscriber Line Access Multiplexer.\"  A DSLAM is a device used by Internet Service Providers (ISPs) to route incoming DSL connections to the Internet.  Since a \"multiplexer\" combines multiple signals into one, a DSLAM combines a group of subscribers' connections into one aggregate Internet connection.\nFor example, a DSL access multiplier may receive signals from all the DSL modems in a certain neighborhood and patch them through to the Internet backbone.  The DSLAM processes each incoming connection and may limit the bandwidth of certain DSL lines.  Most DSL service providers use multiple DSLAMs to help route incoming and outgoing traffic in the most efficient way possible."
        ]
    },
    {
        "word": "DTD",
        "type": [],
        "definition": [
            "Stands for \"Document Type Definition.\"  A DTD defines the tags and attributes used in an XML or HTML document.  Any elements defined in a DTD can be used in these documents, along with the predefined tags and attributes that are part of each markup language.  The following is an example of a DTD used for defining an automobile:\n&lt;!DOCTYPE automobile [\n\t\t\t &nbsp;&nbsp;&nbsp;&lt;!ENTITY header &quot;Car Details&quot;&gt;\n\t\t\t &nbsp;&nbsp;&nbsp;&lt;!ELEMENT make (#PCDATA)&gt;\n\t\t\t &nbsp;&nbsp;&nbsp;&lt;!ELEMENT model (#PCDATA)&gt;\n\t\t\t &nbsp;&nbsp;&nbsp;&lt;!ATTLIST model doors (two | four) #required&gt;\n\t\t\t &nbsp;&nbsp;&nbsp;&lt;!ELEMENT year (#PCDATA)&gt;\n\t\t\t &nbsp;&nbsp;&nbsp;&lt;!ELEMENT engine (#PCDATA)&gt;\n\t\t\t &nbsp;&nbsp;&nbsp;&lt;!ATTLIST engine transmission (manual | automatic) #required&gt;\n\t\t\t ]&gt;\n\nThe above DTD first defines the header of the item as \"Car Details.\"  Then it provides elements to define the make and model of the automobile.  The \"#PCDATA\" data type means it can be any text value).  The \"ATTLIST\" tag on the next line provides options for a specific element.  In this case, it states that the model can have either two or four doors.  The DTD then provides elements for the year and engine type of the car, followed by a choice of either a manual or automatic transmission for the engine.\nThe above example is a basic DTD that only uses a few data types.  Document type definitions used for large XML databases can be thousands of lines long and can include many other data types.  Fortunately, DTDs can be easily modified in a text editor whenever changes need to be made."
        ]
    },
    {
        "word": "DUT",
        "type": [],
        "definition": [
            "Stands for \"Device Under Test\" and is pronounced \"D-U-T.\"  A DUT is a product or component that is undergoing testing.  The testing phase often takes place before a product is sold or after it is repaired.  A DUT may also be a prototype that is not meant to be sold, but is tested until it brakes or fails.\nQuality control engineers often test electronic devices before they are packaged and sold.  They may test random devices or every device that is manufactured.  Some tests are performed manually, while others may be conducted using robotics or scientific measuring tools.  Below are examples of DUT tests that might be run on a newly manufactured product:\n\nDoes the device turn on?\nDoes the screen work as expected?\nDoes the device accept input?\nIs the device's output correct?\nIs the size and shape within the acceptable range?\n\nDUTs are also used for reliability testing.  These devices may be prototypes, random samples from a batch of products, or devices that have already been in use.  The goal of reliability testing is to gauge the typical lifespan of a product and what operating conditions are acceptable.  Below are examples of DUT reliability tests:\n\nHow long does the device run before encountering an error?\nWhich component in the device is the first to fail?\nWhat is the safe temperature range in which to operate the device?\nDo other devices interfere with the operation of the device?\nHow durable is the device when bumped or dropped?\n\nDUTs used for reliability testing are pushed to their limits and often their breaking point.  These devices are discarded or recycled after being tested.  Repaired and refurbished products undergo less rigorous testing.  Refurbished DUTs are typically sold or placed back in use if they pass the testing phase."
        ]
    },
    {
        "word": "DV",
        "type": [],
        "definition": [
            "Stands for \"Digital Video.\"  Unlike traditional analog video, which is captured frame by frame on a tape, digital video is recorded digitally, as ones and zeros.  Since it is stored in a digital format, digital video can be recognized and edited by a computer, which is also a digital device.\nDV camcorders, including Mini DV and HDV, record digital video and therefore can export the footage to a computer using a Firewire (IEEE 1394) cable.  Analog camcorders such as SVHS and Hi-8 devices must be run through a analog to digital converter (DAC) in order to be transferred to a computer."
        ]
    },
    {
        "word": "DVD",
        "type": [],
        "definition": [
            "Stands for \"Digital Versatile Disc.\"  A DVD is a type of optical media used for storing digital data.  It is the same size as a CD but has a larger storage capacity.  Some DVDs are formatted specifically for video playback, while others may contain different types of data, such as software programs and computer files.\nThe original \"DVD-Video\" format was standardized in 1995 by a consortium of electronics companies, including Sony, Panasonic, Toshiba, and Philips.  It provided a number of improvements over analog VHS tapes, including higher quality video, widescreen aspect ratios, custom menus, and chapter markers, which allow you to jump to different sections within a video.  DVDs can also be watched repeatedly without reducing the quality of the video and of course, they don't need to be rewound.  A standard video DVD can store 4.7 GB of data, which is enough to hold over 2 hours of video in 720p resolution, using MPEG-2 compression.\nDVDs are also used to distribute software programs.  Since some applications and other software (such as clip art collections) are too large to fit on a single 700 MB CD, DVDs provide a way to distribute large programs on a single disc.  Writable DVDs also provide a way to store a large number of files and back up data.  The writable DVD formats include DVD-R, DVD+R, DVD-RW, DVD+RW, and DVD-RAM.  While the different writable DVD formats caused a lot of confusion and incompatibility issues in the early 2000s, most DVD drives now support all formats besides DVD-RAM.\nA standard DVD can hold 4.7 GB of data, but variations of the original DVD format have greater capacities.  For example, a dual-layer DVD (which has two layers of data on a single side of the disc) can store 8.5 GB of data.  A dual-sided DVD can store 9.4 GB of data (4.7 x 2).  A dual-layer, dual-sided DVD can store 17.1 GB of data.  The larger capacity formats are not supported by most standalone DVD players, but they can be used with many computer-based DVD drives."
        ]
    },
    {
        "word": "DVD+R",
        "type": [],
        "definition": [
            "Stands for \"Digital Versatile Disc Recordable.\"  DVD+R discs look the same as regular DVDs, but can be used to record data.  Single-sided, single-layer DVD+R discs can store 4.7GB of data, while double-layer discs can store 8.5GB and double-sided DVD-Rs can store 9.4GB.  The DVD+R format is not quite as common as the DVD-R format, but is still supported by most current DVD players and DVD-ROM drives.  Drives that can read both DVD+R and DVD-R discs are often referred to as DVD?R drives."
        ]
    },
    {
        "word": "DVD+RW",
        "type": [],
        "definition": [
            "Stands for \"Digital Versatile Disk Rewritable.\"  A DVD+RW is like a DVD+R, but can be erased and rewritten.  DVD+RWs must be completely erased in order for new data to be added. DVD+RW discs can hold 4.7GB of data and do not come in double-sided or double-layer versions like DVD+Rs do.  Still, 4.7GB of data is a lot of storage space.  Combined with their ability to be re-recorded, DVD+RWs are a great choice for making frequent backups of your data.  To record data onto a DVD+RW disc, you'll need a DVD burner that supports the DVD+RW format."
        ]
    },
    {
        "word": "DVD-R",
        "type": [],
        "definition": [
            "Stands for \"Digital Versatile Disc Recordable.\"  A DVD-R looks the same as a regular DVD, but like a CD-R, it can be used to record data.  Once a DVD-R has been \"burned,\" or written to, it cannot be written to again.  A basic single-sided, single-layer DVD-R disc can store 4.7GB of data.  Double-layer discs can store 8.5GB, while double-sided DVD-Rs can store 9.4GB.\nDVD-R is the most common format of writable DVDs (compared to the DVD+R and DVD-RAM formats).  Most DVD players and DVD-ROM drives can read DVD-R discs.  That means you can use a DVD-R disc to back up several gigabytes of data on your computer or make your own video DVD.  The Apple SuperDrive used in many Macintosh computers supports the DVD-R format."
        ]
    },
    {
        "word": "DVD-RAM",
        "type": [],
        "definition": [
            "Stands for \"Digital Versatile Disc Random Access Memory.\"  DVD-RAMs are writable DVDs that can be erased and rewritten like DVD-RW and DVD+RW discs.  Unlike the other two writable DVD formats, DVD-RAM discs support advanced error correction and defect management.  While these features slow down the maximum data transfer rate for DVD-RAM discs, it also makes the discs more reliable.\nEarly DVD-RAM discs required an enclosing cartridge, which meant they would not fit in most DVD players or DVD-ROM drives.  Therefore, you would need a DVD-RAM drive to use DVD-RAM discs, as well as burn them.  Newer DVD-RAM discs, however, can be used without a cartridge.  These discs can be played in any DVD player that supports the DVD-RAM format.  While the first DVD-RAM media could only hold 2.6GB on a single-sided disc, newer double-sided discs can store up to 9.4GB."
        ]
    },
    {
        "word": "DVD-RW",
        "type": [],
        "definition": [
            "Stands for \"Digital Versatile Disk Rewritable.\"  A DVD-RW is like a DVD-R but can be erased and written to again.  Like CD-RWs, DVD-RWs must be erased in order for new data to be added.  DVD-RWs can hold 4.7GB of data and do not come in double-layered or double-sided versions like DVD-Rs do.  Because of their large capacity and ability to be used mulitple times, DVD-RW discs are a great solution for frequent backups.  To record data onto a DVD-RW disc, you'll need a DVD burner that supports the DVD-RW format."
        ]
    },
    {
        "word": "DVI",
        "type": [],
        "definition": [
            "Stands for \"Digital Video Interface.\"  DVI is a video connection standard created by the Digital Display Working Group (DDWG).  Most DVI ports support both analog and digital displays.  If the display is analog, the DVI connection converts the digital signal to an analog signal.  If the display is digital, no conversion is necessary.\nThere are three types of DVI connections: 1) DVI-A (for analog), 2) DVI-D (for digital), and 3) DVI-I (integrated, for both analog and digital).  The digital video interface supports high bandwidth signals, over 160 MHz, which means it can be used for high resolution displays such as UXGA and HDTV.  You may find DVI ports on video cards in computers as well as on high-end televisions."
        ]
    },
    {
        "word": "DVR",
        "type": [],
        "definition": [
            "Stands for \"Digital Video Recorder.\"  A DVR is basically a VCR that uses a hard drive instead of video tapes.  It can be used to record, save, and play back television programs.  Unlike a VCR, however, a DVR can also pause live TV by recording the current show in real time.  The user can choose to fast forward (often during commercials) to return to live television.\nMost satellite and cable TV companies offer a DVR as an option with their digital television packages.  Since cable boxes already provide program listings through some kind of TV guide interface, most DVRs allow users to use the guide to schedule recordings.  For example, a user can use the remote to search through the guide's program listings for the current week and select the shows he would like to record.\nTiVo, the \"brand name\" DVR, performs the same functions as a DVR offered directly from a cable company.  However, TiVo users can choose to buy the DVR box instead of renting it.  Since TiVo is a standalone box, it does not require cable or satellite TV.  While TiVo users who buy their own TiVo boxes may avoid the monthly rental fees, they must pay a monthly fee for program listings if they want to schedule recordings.\nDVRs conveniently save shows in an list that the user can access at any time.  Since the shows are stored on DVR's hard drive, there is no need to rewind or fast forward to play a certain show, like a VCR requires.  While DVRs make it even easier to record your favorite shows every week or even every day, it also makes it easier to watch more TV.  And an excuse to watch more TV is something most of us don't need."
        ]
    },
    {
        "word": "Daemon",
        "type": [],
        "definition": [
            "The word \"daemon\" actually comes from the Greek language, meaning an \"inner or attendant spirit\" (Oxford American Dictionary).  This is a fitting name, as a computer daemon is a constantly running program that triggers actions when it receives certain input.\nFor example, a printer daemon spools information to a printer when a user decides to print a document.  A daemon running on a mail server routes incoming mail to the appropriate mailboxes.   Web servers use an \"HTTPD\" daemon that sends data to users when they access Web pages.  While daemons were first used by the Unix operating system, they have also been incorporated into Mac OS X, which is Unix-based."
        ]
    },
    {
        "word": "Dark Mode",
        "type": [],
        "definition": [
            "Dark mode is a software option that makes the user interface darker.  It changes light backgrounds to a dark color and changes text from dark to light.  The result is a pseudo-inverted interface that isn't exactly the opposite of the \"light mode,\" but has mostly dark colors.\nDark mode, also \"night mode,\" has been popular with developers for many years.  Since developers stare at source code several hours a day, the dark background produces less eye strain.  Recently, dark mode has become a popular option for all end users since it is now a standard option for both Windows and macOS.\nThe first version of Windows to support dark mode was Windows 10 October 2018 Update.  The first version of macOS to support dark mode was macOS 10.14 Mojave, released in September, 2018.\nThere is no standard dark mode palette, so each developer can choose how to implement it.  Some dark modes have dark grey themes, while others are almost black.  Other versions have different hues, such as slate or dark blue.  The option to switch to dark mode is typically located in the \"General\" or \"Interface\" section of a program's settings.  It is also an option on some websites, including TechTerms.com.\nNOTE: To activate dark mode on TechTerms.com, click the sun\/moon icon in the navigation bar."
        ]
    },
    {
        "word": "Dashboard",
        "type": [],
        "definition": [
            "Dashboard is a user-interface feature Apple introduced with the release of Mac OS X 10.4 Tiger.  It allows access to all kinds of \"widgets\" that show the time, weather, stock prices, phone numbers, and other useful data.  With the Tiger operating system, Apple included widgets that do all these things, plus a calculator, language translator, dictionary, address book, calendar, unit converter, and iTunes controller.  Besides the bundled widgets, there are also hundreds of other widgets available from third parties that allow users to play games, check traffic conditions, and view sports scores, just to name a few.\nThe dashboard of widgets is accessed by clicking the Dashboard application icon, or by simply pressing a keyboard shortcut (F12 by default).  Clicking a plus \"+\" icon in the lower-left hand corner of the screen provides the user with a list of all installed widgets.  Clicking the widgets or dragging them onto the desktop makes them active.  They can be individually closed by clicking the close box, just like other open windows.  Pressing the keyboard shortcut (F12) makes them instantly disappear, removing them from view until the user needs them again."
        ]
    },
    {
        "word": "Data",
        "type": [],
        "definition": [
            "Computer data is information processed or stored by a computer.  This information may be in the form of text documents, images, audio clips, software programs, or other types of data.  Computer data may be processed by the computer's CPU and is stored in files and folders on the computer's hard disk.\nAt its most rudimentary level, computer data is a bunch of ones and zeros, known as binary data.  Because all computer data is in binary format, it can be created, processed, saved, and stored digitally.  This allows data to be transferred from one computer to another using a network connection or various media devices.  It also does not deteriorate over time or lose quality after being used multiple times."
        ]
    },
    {
        "word": "Data Center",
        "type": [],
        "definition": [
            "A data center is a central location for storing and processing data.  It may include anywhere from a few computers to several thousand.  Most data centers contain servers, such as web, mail, and file servers.  However, some are designed specifically for data storage and others for cluster computing.\nData centers may serve one or more of the following functions:\n\nWeb hosting\nMail hosting\nCloud computing\nData storage\nData backup\nCDN edge caching\nEdge computing\nBitcoin mining\n\nA typical data center contains rows of rack-mounted computers, which are space-efficient and easy to access.  They also include networking equipment, such as switches, routers, and Ethernet cables.  Most have a high-speed Internet connection or connect directly to the Internet backbone.\nThe equipment each data center contains depends on its purpose.  For example, a web hosting site may have thousands of web servers with various configurations.  A data storage facility may include a large number of storage devices and only a few computers.  An edge computing center requires machines with high-end processors but doesn't need a lot of storage.\nBecause computer technology is constantly evolving, data centers must be scalable, or easy to expand and upgrade over time.  They must be built efficiently, with high-bandwidth connections, to avoid network bottlenecks.  Finally, appropriate security measures, such as firewalls, must be implemented to prevent external attacks.  Many data centers have sophisticated monitoring tools to catch bottlenecks and hacking attempts so network administrators can address them before problems occur."
        ]
    },
    {
        "word": "Data Management",
        "type": [],
        "definition": [
            "Data management is a general term that covers a broad range of data applications.  It may refer to basic data management concepts or to specific technologies.  Some notable applications include 1) data design, 2) data storage, and 3) data security.\n1. Data design, or data architecture, refers to the way data is structured.  For example, when creating a file format for an application, the developer must decide how to organize the data in the file.  For some applications, it may make sense to store data in a text format, while other programs may benefit from a binary file format.  Regardless of what format the developer uses, the data must be organized within the file in a structure that can be recognized by the associated program.\n2. Data storage refers to the many different ways of storing data.  This includes hard drives, flash memory, optical media, and temporary RAM storage.  When selecting an appropriate data storage medium, concepts such as data access and data integrity are important to consider.  For example, data that is accessed and modified on a regular basis should be stored on a hard drive or flash media.  This is because these types of media provide quick access and allow the data to be moved or changed.  Archived data, on the other hand, may be stored on optical media, such as CDs and DVDs, since the data does not need to be changed.  Optical discs also maintain data integrity longer than hard drives, which makes them a good choice for archival purposes.\n3. Data security involves protecting computer data.  Many individuals and businesses store valuable data on computer systems.  If you've ever felt like your life is stored on your computer, you understand how important data can be.  Therefore, it is wise to take steps to protect the privacy and integrity of your data.  Some steps include installing a firewall to prevent unauthorized access to your computer and encrypting personal data that is submitted online or shared with other users.  It is also important to backup your data so that you will be able to recover your files in case your primary storage device fails."
        ]
    },
    {
        "word": "Data Mining",
        "type": [],
        "definition": [
            "Data mining is the process of analyzing large amounts of data in order to discover patterns and other information.  It is typically performed on databases, which store data in a structured format.  By \"mining\" large amounts of data, hidden information can be discovered and used for other purposes.\nData Mining Examples\nA credit card company might use data mining to learn more about their members' buying habits.  By analyzing purchases from cardholders across the United States, the company may discover shopping habits for different demographics, such as age, race, and location.  This information could be useful in offering individuals specific promotions.  The same data may also reveal shopping patterns in different regions of the country.  This information could be valuable to companies looking to advertise or start businesses in specific states.\nOnline services, such as Google and Facebook, mine enormous amounts of data to provide targeted content and advertisements to their users.  Google, for example, might analyze search queries to discover popular searches for certain areas and move those to the top of the autocomplete list (the suggestions that appear as you type).  By mining user activity data, Facebook might discover popular topics among different age groups and provide targeted ads based on this information.\nWhile data mining is commonly used for marketing purposes, it has many other uses as well.  For instance, healthcare companies may use data mining to discover links between certain genes and diseases.  Weather companies can mine data to discover weather patterns that may help predict future meteorologic events.  Traffic management institutions can mine automotive data to forecast future traffic levels and create appropriate plans for highways and streets.\nData Mining Requirements\nData mining requires two things — lots of data and lots of computing power.  The more organized the data, the easier it is to mine it for useful information.  Therefore it is important for any organization that wants to engage in data mining to be proactive in selecting what data to log and how to store it.  When it comes to mining the data, supercomputers and computing clusters may be used to process petabytes of data."
        ]
    },
    {
        "word": "Data Science",
        "type": [],
        "definition": [
            "Data science is the study of data.  It involves developing methods of recording, storing, and analyzing data to effectively extract useful information.  The goal of data science is to gain insights and knowledge from any type of data — both structured and unstructured.\nData science is related to computer science, but is a separate field.   Computer science involves creating programs and algorithms to record and process data, while data science covers any type of data analysis, which may or may not use computers.  Data science is more closely related to the mathematics field of Statistics, which includes the collection, organization, analysis, and presentation of data.\nBecause of the large amounts of data modern companies and organizations maintain, data science has become an integral part of IT.  For example, a company that has petabytes of user data may use data science to develop effective ways to store, manage, and analyze the data.  The company may use the scientific method to run tests and extract results that can provide meaningful insights about their users.\nData Science vs Data Mining\nData science is often confused with data mining.  However, data mining is a subset of data science.  It involves analyzing large amounts of data (such as big data) in order to discover patterns and other useful information.  Data science covers the entire scope of data collection and processing."
        ]
    },
    {
        "word": "Data Transfer Rate",
        "type": [],
        "definition": [
            "The data transfer rate is commonly used to measure how fast data is transferred from one location to another.  For example, a hard drive may have a maximum data transfer rate of 480 Mbps, while your ISP may offer an Internet connection with a maximum data transfer rate of only 1.5 Mbps.\nData transfer rates are typically measured in bits per second (bps) as opposed to bytes per second, which can be understandably confusing.  Because there are eight bits in a byte, a sustained data transfer rate of 80 Mbps is only transferring 10MB per second.  While this is confusing for consumers, Internet service providers must enjoy measuring data transfer rates in bps since it makes their Internet access speeds sound 8x faster than they really are."
        ]
    },
    {
        "word": "Data Type",
        "type": [],
        "definition": [
            "A data type is a type of data.  Of course, that is rather circular definition, and also not very helpful.  Therefore, a better definition of a data type is a data storage format that can contain a specific type or range of values.\nWhen computer programs store data in variables, each variable must be assigned a specific data type.  Some common data types include integers, floating point numbers, characters, strings, and arrays.  They may also be more specific types, such as dates, timestamps, boolean values, and varchar (variable character) formats.\nSome programming languages require the programmer to define the data type of a variable before assigning it a value.  Other languages can automatically assign a variable's data type when the initial data is entered into the variable.  For example, if the variable \"var1\" is created with the value \"1.25,\" the variable would be created as a floating point data type.  If the variable is set to \"Hello world!,\" the variable would be assigned a string data type.  Most programming languages allow each variable to store a single data type.  Therefore, if the variable's data type has already been set to an integer, assigning string data to the variable may cause the data to be converted to an integer format.\nData types are also used by database applications.  The fields within a database often require a specific type of data to be input.  For example, a company's record for an employee may use a string data type for the employee's first and last name.  The employee's date of hire would be stored in a date format, while his or her salary may be stored as an integer.  By keeping the data types uniform across multiple records, database applications can easily search, sort, and compare fields in different records."
        ]
    },
    {
        "word": "Database",
        "type": [],
        "definition": [
            "A database is a data structure that stores organized information.  Most databases contain multiple tables, which may each include several different fields.  For example, a company database may include tables for products, employees, and financial records.  Each of these tables would have different fields that are relevant to the information stored in the table.\nNearly all e-commerce sites uses databases to store product inventory and customer information.  These sites use a database management system (or DBMS), such as Microsoft Access, FileMaker Pro, or MySQL as the \"back end\" to the website.  By storing website data in a database, the data can be easily searched, sorted, and updated.  This flexibility is important for e-commerce sites and other types of dynamic websites.\nEarly databases were relatively \"flat,\" which means they were limited to simple rows and columns, like a spreadsheet.  (See also \"flat file database\").  However, today's relational databases allow users to access, update, and search information based on the relationship of data stored in different tables.  Relational databases can also run queries that involve multiple databases.  While early databases could only store text or numeric data, modern databases also let users store other data types such as sound clips, pictures, and videos."
        ]
    },
    {
        "word": "Datagram",
        "type": [],
        "definition": [
            "Datagram is a combination of the words data and telegram.  Therefore, it is a message containing data that is sent from location to another.  A datagram is similar to a packet, but does not require confirmation that it has been received.  This makes datagrams ideal for streaming services, where the constant flow of data is more important than 100% accuracy.\nDatagrams are also called \"IP datagrams\" since they are used by the Internet protocol (IP).  This protocol defines how information is sent between systems over the Internet.  For example, each device connected to the Internet must have an IP address, which serves as a unique identifier.  Whenever data is transmitted via the Internet protocol, it is broken up into packets or datagrams, which each contain a header plus the actual data transmitted.\nA datagram header defines the source and destination of the data as well as other information, such as the total length (or size) of the datagram, time to live (TTL), and the specific protocol used to transfer the data.  Generally, datagrams are sent via the UDP protocol, which is used for media streaming and other services that do not require confirmation that the data has been received.  Packets, on the other hand, are typically sent via TCP, which guarantees all the data sent has been received."
        ]
    },
    {
        "word": "Deadlock",
        "type": [],
        "definition": [
            "A deadlock is a condition where a program cannot access a resource it needs to continue.  When an active application hits a deadlock, it may \"hang\" or become unresponsive.\nResources, such as saved or cached data, may be locked when accessed by a specific process within a program.  Locking the data prevents other processes from overwriting the data prematurely.  If a process or query needs to access locked data, but the process locking the data won't let it go, a deadlock may occur.\nFor example, the following situation will cause a deadlock between two processes:\n\nProcess 1 requests resource B from process 2.\nResource B is locked while process 2 is running.\nProcess 2 requires resource A from process 1 to finish running.\nResource A is locked while process 1 is running.\n\nThe result is that process 1 and process 2 are waiting for each other to finish.  Since neither process can continue until the other one completes, a deadlock is created.\nAvoiding Deadlocks\nDevelopers can prevent deadlocks by avoiding locking conditions in their programming logic.  For example, instead of having two processes rely on each other, the source code can be written so that each thread finishes before another thread needs its resources.  By ensuring data is accessible when needed, programmers can protect their applications from hanging or crashing.\nNOTE: Deadlocks may also occur when two or more queries are run on a database.  Transactional databases lock active records, preventing other queries from accessing them.  If a process cannot access a locked record, a database deadlock may occur.\n"
        ]
    },
    {
        "word": "Debug",
        "type": [],
        "definition": [
            "Computer programmers, like everybody else, are not perfect.  This means the programs they write sometimes have small errors, called \"bugs,\" in them.  These bugs can be minor, such as not recognizing user input, or more serious, such as a memory leak that crashes the program.  Before releasing their software to the public, programmers \"debug\" their programs, eliminating as many errors as possible.  This debugging process often takes a long time, as fixing some errors may introduce others.  Debugging your windshield at a gas station is much easier than debugging a computer program."
        ]
    },
    {
        "word": "Debugger",
        "type": [],
        "definition": [
            "Even the most experienced software programmers usually don't get it right on their first try.  Certain errors, often called bugs, can occur in programs, causing them to not function as the programmer expected.  Sometimes these errors are easy to fix, while some bugs are very difficult to trace.  This is especially true for large programs that consist of several thousand lines of code.\nFortunately, there are programs called debuggers that help software developers find and eliminate bugs while they are writing programs.  A debugger tells the programmer what types of errors it finds and often marks the exact lines of code where the bugs are found.  Debuggers also allow programmers to run a program step by step so that they can determine exactly when and why a program crashes.  Advanced debuggers provide detailed information about threads and memory being used by the program during each step of execution.  You could say a powerful debugger program is like OFF! with 100% deet."
        ]
    },
    {
        "word": "Decryption",
        "type": [],
        "definition": [
            "Decryption is the process of converting encrypted data into recognizable information.  It is the opposite of encryption, which takes readable data and makes it unrecognizable.\nFiles and data transfers may be encrypted to prevent unauthorized access.  If someone tries to view an encrypted document, it will appear as a random series of characters.  If someone tries to \"snoop\" on an encrypted network connection, the data will not make any sense.  So how is it possible to view encrypted data?  The answer is decryption.\nHow Decryption Works\nThere are several ways to encrypt files, but most methods involve one or more \"keys.\"  When encrypting a file, the key may be a single password.  Network encryption often involves a public key and a private key shared between each end of the data transfer.\nDecryption works by applying the opposite conversion algorithm used to encrypt the data.  The same key is required to return the encrypted data to its original state.  For example, if the password \"ABC123\" is used to encrypt a file, the same password is needed to decrypt the file.\nSecure network transfers, including Internet connections, handle encryption and decryption in the background.  Protocols such as HTTPS and Secure SMTP encrypt and decrypt data on the fly.  These protocols automatically generate a secure key for each encrypted network transfer and do not require a password.\nNOTE: Encrypting data is a smart way to protect private information from prying eyes.  But make sure to use a password you will remember when encrypting files.  If you cannot remember your password, the data may be unrecoverable.\n"
        ]
    },
    {
        "word": "Default",
        "type": [],
        "definition": [
            "Default is an adjective that describes a standard setting or configuration.  While it is not specific to computers, it is commonly used in IT terminology.  In computing, \"default\" may describe several things, including hardware, software, and network configurations.\nA default hardware configuration (or \"default config\") is a prebuilt system with standard specifications.  This includes standard components such as the CPU, RAM, storage device, and video card.  Retail stores typically carry default hardware configurations, while online stores are more likely to offer customization options.\nIn software, \"default\" describes preset settings.  For example, when you install a program for the first time, it will load the default preferences.  If you want to change these settings, you can open the \"Preferences\" window and modify the default options to suit your needs.  Your web browser, for instance, might open new pages in tabs by default.  If you prefer windows instead of tabs, you can change the default selection in the Preferences window.  Some applications offer a \"Restore Default Settings\" command that allows you to revert to the original settings at any time.\nIn networking, \"default\" is often used in reference to protocols.  For example, a web server may serve webpages over HTTP by default, but it may also offer a secure HTTPS option.  Common protocols, such as FTP and SMTP are typically assigned default port numbers, but they can be altered for security reasons.\nNOTE: While default is most often used as an adjective, it can also be used as a verb.  For example, when a certain option is not available (such as a specific font), a program may \"default\" to the preset setting."
        ]
    },
    {
        "word": "Default Program",
        "type": [],
        "definition": [
            "A default program is an application that opens a file when you double-click it.  For example, if you double-click a .TXT file in Windows and it automatically opens in Notepad, then Notepad is the default program for files with a \".txt\" extension.  If the file opens in Microsoft Word, then Microsoft Word is the default program.\nDefault programs are necessary since many file types can be opened by more than one program.  For example, your computer may have over a dozen applications that can open .JPG files.  Therefore, the operating system needs to know which program to open by default when you double-click a JPEG image file.\nBoth Windows and Macintosh computers store a list of default programs for each file extension.  These relationships between programs and file extensions are also called \"file associations.\"  Both the Windows and Macintosh operating systems allow you to change file associations if you don't like the default program that is associated with a certain file type.  For example, if you prefer to play MP3 files in iTunes rather than Windows Media Player, you can change the \".mp3\" file association to iTunes.  This will set iTunes as the default program for all .MP3 files.\nWindows 7 has a built-in utility for configuring file associations called \"Default Programs.\"  This tool allows you to assign specific programs to one or more file extensions using a simple graphical interface.  It also displays what file extensions are associated with each installed application.  For more information on using the Windows 7 Default Programs tool, view the FileInfo.com Default Programs Help Article.\nWhile Mac OS X does not include a Default Programs tool, you can simply right-click a file and choose \"Open With…\" to select a different program to open it.  If you want to change the default program for a specific file, select the file and choose File &rarr; Get Info.  Then select a different program in the \"Open with:\" section of the window.  If you want to change the default program for all files with the same extension, press the \"Change All…\" button."
        ]
    },
    {
        "word": "Defragment",
        "type": [],
        "definition": [
            "Defragmenting your hard disk is a great way to boost the performance of your computer.  Though the term \"defragment\" sounds a little abrasive, it is actually a simple and helpful process.  After all, a defragmented hard disk is a happy hard disk.\nAdding and deleting files from your hard disk is a common task.  Unfortunately, this process is not always done very efficiently.  For example, when you delete a bunch of little files and add a new large file, the file may get broken up into mulitple sections on the hard disk.  The computer will still read the newly added file as a single valid file, but the drive will have to scan multiple parts of the disk to read it.  Because hard disk seek time is one of the most significant bottlenecks in a computer's performance, this can drag down your computer's speed quite a bit.  If you have a ton of \"fragmented\" files on your hard disk, you might hear extra grinding, sputtering, and other weird noises coming from your computer.\nYou computer does not like having fragmented files any more than you do.  This is why defragmenting your hard disk is such a good idea.  When you start to hear extra grinding sounds, or your computer doesn't open files as quickly as it did before, it's time to defragment.  With Windows, you can use the pre-installed Intel defragment program to defragment your hard disk.  You can also use a commercial software program like Norton Utilities to defragment your hard disk more efficiently and with more options.  For Mac users, a disk utility such as DiskWarrior or Tech Tool Pro is the only way to do it.  If you use your computer daily, defragmenting your hard drive once a month should keep the fragment-fiends away."
        ]
    },
    {
        "word": "Degauss",
        "type": [],
        "definition": [
            "Degaussing is the process of reducing a magnetic field.  It can be used to reset the magnetic field of a CRT monitor or to destroy the data on a magnetic storage device.\nA CRT monitor displays images by firing electrons through a cathode ray tube (CRT) onto the screen.  The electron beams are focused by a plate near the screen called a shadow mask.  If this plate becomes unevenly magnetized by surrounding objects or simply the earth's magnetic field, it can cause discoloration on the screen.  Therefore, CRT monitors often include a \"Degauss\" command that resets the magnetic field when run.  Since it is impossible to eliminate the magnetic charge inside the monitor, the degaussing process realigns or randomizes the magnetic field, which provides consistent colors across the screen.\nDegaussing may also be used to destroy the data on a magnetic storage device, such as a hard drive or tape drive.  A hard drive degausser, for example, includes a chamber where you can insert a hard drive.  When you run the degausser, it uses a process called capacitative discharge to decrease the drive's magnetic field, making any data on the drive unreadable.  The cycle time, which is the time it takes for the data to be erased, varies between degaussers, but is usually between ten seconds and one minute.  Companies and government organizations may use degaussers to eliminate the data on storage devices before reprovisioning or discarding them."
        ]
    },
    {
        "word": "Del.icio.us",
        "type": [],
        "definition": [
            "Del.icio.us, pronounced simply \"delicious,\" is a community bookmarking website in which users can save Web pages they find and share them with other users.  Because users' bookmarks are made public and viewable by other users, other people often bookmark Web pages that they find within other users' bookmarks.  Del.icio.us keeps track of how many people bookmark each site and posts the most popular websites on its home page.\nCommon Web pages bookmarked by Del.icio.us users include news stories, online learning resources, and tech support pages.  Since other users add useful pages to their bookmarks, the best Web pages eventually rise to the top of the popularity chain.  The result is a collection of Web pages that are helpful and worthwhile visiting.\nUsers can either browse or search the database of bookmarks on Del.icio.us.  When a user saves a bookmark, he or she can add a description and tags (keywords) that are pertinent to the Web page.  This help the page show up for relevant searches.  The results of Del.icio.us searches are often of higher quality than a regular search engine since the sites have all been chosen by users.  Apparently, other Web surfers agree, since the website became so popular that Yahoo! bought the Del.icio.us at the end of 2005.\nThe domain name \"del.icio.us\" is a creative modification of the standard domain syntax, where \"del\" is the domain prefix and \"icio.us\" is the domain name, with \"us\" being the domain suffix."
        ]
    },
    {
        "word": "Delete",
        "type": [],
        "definition": [
            "Delete is computer terminology for remove or erase.  You can delete text from a document of delete entire files or folders from your hard drive.  When typing a document, you can remove characters behind the cursor by pressing the delete key.  If you want to remove characters in front of the cursor, you can press the smaller delete key near the home and end buttons on the keyboard.  You can also remove entire sections of text by selecting the text you wish to delete and pressing either delete button on the keyboard.\nFiles and folders can be removed from your hard drive by dragging them to the Recycle Bin (Windows) or the Trash (Macintosh) and then emptying the trash.  When you delete a file, it is actually not erased, but instead the reference to the file is removed.  This means deleted files are still intact until they are written over.  Special utilities such as Norton Unerase can recover accidentally deleted files."
        ]
    },
    {
        "word": "Denary",
        "type": [],
        "definition": [
            "Denary, also known as \"decimal\" or \"base 10,\" is the standard number system used around the world.  It uses ten digits (0, 1, 2, 3, 4, 5, 6, 7, 8, and 9) to represent all numbers.  Denary is often contrasted with binary, the standard number system used by computers and other electronic devices.\nThe first two letters in denary (\"de\") are an abbreviated version of \"dec\" which is a Latin prefix meaning \"ten.\"  The Latin prefix \"bi\" means two.  Therefore, the denary system contains ten digits, while the binary system only contains two (0 and 1).  Both systems can be used to represent any integer.  The table below shows how numbers are displayed in both denary and binary.\n\nDenaryBinary\n11\n5101\n101010\n50110010\n1001100100\n1,23410011010010\n\nTo calculate the value of a number in either denary or binary, you can multiply each digit by the appropriate multiplier and add them together to get the total.  In denary, each digit from right to left is multiplied by 10 to the corresponding power, starting with 0.  For example, 1,234 in denary can be calculated as follows:\n4 x 1 (100) + 3 x 10 (101) + 2 x 100 (102) + 1 x 1,000 (103) = 4 + 30 + 200 + 1,000 = 1,234.\nIn binary, each digit is multiplied by 2 to the corresponding power.  For instance, the binary number 1010 can be calculated in denary as:\n0 x 1 (20) + 1 x 2 (21) + 0 x 4 (22)  + 1 x 8 (23) = 0 + 2 + 0 + 8 = 10.\nAnother less common number system is hexadecimal, which uses the same ten digits as denary plus A, B, C, D, E, and F.  Understanding hexadecimal numbers is important for web developers and computer science majors, but is not necessary for the average user.  Simply knowledge of the denary number system is sufficient for most people."
        ]
    },
    {
        "word": "Denial of Service",
        "type": [],
        "definition": [
            "A denial of service attack is an effort to make one or more computer systems unavailable.  It is typically targeted at web servers, but it can also be used on mail servers, name servers, and any other type of computer system.\nDenial of service (DoS) attacks may be initiated from a single machine, but they typically use many computers to carry out an attack.  Since most servers have firewalls and other security software installed, it is easy to lock out individual systems.  Therefore, distributed denial of service (DDoS) attacks are often used to coordinate multiple systems in a simultaneous attack.\nA distributed denial of service attack tells all coordinated systems to send a stream of requests to a specific server at the same time.  These requests may be a simple ping or a more complex series of packets.  If the server cannot respond to the large number of simultaneous requests, incoming requests will eventually become queued.  This backlog of requests may result in a slow response time or a no response at all.  When the server is unable to respond to legitimate requests, the denial of service attack has succeeded.\nDoS attacks are a common method hackers use to attack websites.  Since flooding a server with requests does not require any authentication, even a highly secured server is vulnerable.  However, a single system is typically not capable of carrying out a successful DoS attack.  Therefore, a hacker may create a botnet to control multiple computers at once.  A botnet can be used to carry out a DDoS attack, which is far more effective than an attack from a single computer.\nDenial of service attacks can be problematic, especially when they cause large websites to be unavailable during high-traffic times.  Fortunately, security software has been developed to detect DoS attacks and limit their effectiveness.  While many well-known websites, like Google, Twitter, and WordPress, have all been targets of denial of service attacks in the past, they have been able to update their security systems and prevent further service interruptions. "
        ]
    },
    {
        "word": "Deployment",
        "type": [],
        "definition": [
            "Software deployment is the process of making software usable on one or more systems.  Both single and multi-system deployment involve four primary steps:\n\nDownload\nInstall\nActivate\nUpdate\n\n1. Download\nWhile some software is still distributed on flash drives or optical media (CDs and DVDs), most software today is downloaded.  Therefore, deployment often begins with downloading a software installer.\n2. Install\nThe installation process is the primary deployment step, in which the application and corresponding files are installed on one or more systems.  Installation options include where to install the software and what files to install, such as add-ons and other extras.\n3. Activate\nCommercial software programs often require activation, either immediately or after a trial period.  Without activation, the software may run for a limited time or with limited features.  The activation process requires purchasing a license and entering the activation key.\n4. Update\nThe final step of deployment is updating the software to the latest version.  Many applications include a \"Check for updates\" command to check if a newer version is available.  Keeping software up-to-date reduces issues with bugs, security holes, and incompatibilities.\n\nAdvanced Deployment\nDeploying software on a home PC is often as simple as downloading, installing, and activating the program.  Deployment on corporate machines or across multiple systems on a network can be more complex.  For example, a network administrator may need to configure a program identically on dozens of computers.  To ensure consistency, the admin may use a command-line interface or a deployment script to automate the installation process.\nNOTE: Windows installers usually have an .EXE or .MSI extension.  Active Directory and System Center Configuration Manager (SCCM) installations may require MSI files."
        ]
    },
    {
        "word": "Deprecated",
        "type": [],
        "definition": [
            "In the world of software development, \"deprecated\" refers to functions or elements that are in the process of being replaced by newer ones.  The term comes from the word \"deprecate,\" which means to disapprove of something.  While deprecated items may work in the current version of a programming language, they may not function in future updates.  Therefore, software developers are advised to replace deprecated items with other options.\nAs programming languages evolve, functions are sometimes replaced with newer, more efficient options.  For example, in PHP, the ereg() function, which is used to search for matching strings was deprecated in favor of the preg_match() function, which is faster and more flexible.  While the ereg() function may work with current PHP installations, it may not be supported in future versions of PHP.  Therefore, developers are discouraged to rely on the ereg() function and are encouraged to updated their source code to use to preg_match() function instead.\nIn HTML, elements such as tags and attributes may be deprecated from one version to the next.  For example, in HTML 5, several common tags used in HTML 4 have been deprecated.  These include &lt;center&gt;, &lt;font&gt;, &lt;tt&gt;, and several others.  While modern browsers may still interpret these tags correctly, they are not guaranteed to work, and therefore should be avoided.\nThe process of deprecating functions and elements in a programming language is called \"deprecation.\"  Typically, this process lasts for several versions of the language, which gives developers ample time to update their code.  Most software development environments (IDEs) also alert programmers when deprecated items are being used.  These warnings help developers remove deprecated items before they cause syntax errors or other problems in a program."
        ]
    },
    {
        "word": "Design Pattern",
        "type": [],
        "definition": [
            "Design patterns are reusable solutions for software development.  They serve as templates that programmers can use when creating applications.  They are not specific to individual programming languages, but instead are best practices or heuristics that can be applied in different programming environments.\nWhile design patterns are not language-dependent, they often include objects or classes.  Therefore, they are typically associated with object-oriented programming.  Individual patterns can be classified into three different categories: 1) creational patterns, 2) structural patterns, and 3) behavioral patterns.\n1. Creational Patterns\nCreational design patterns describe ways to create objects using methods that are appropriate for different situations.  For example, the \"Singleton\" pattern is used to create a basic class that will only have one instance.  A common example is a global variable defined in the source code of a program.  An \"Object Pool\" pattern is used to create a class with a \"pool\" of objects that can be retrieved as needed instead of being recreated.  This is often used for caching purposes.\n2. Structural Patterns\nStructural design patterns define the relationships between objects.  For example, the \"Private Class Data\" pattern is used to limit access to a specific class.  This can prevent unwanted modification of an object.  The \"Decorator\" class, on the other hand, allows behaviors and states to be added to an object at runtime.  This provides programmers with the flexibility to add as many classes to an object as needed.  One example is an avatar in a video game that accumulates weapons, armor, and items throughout the game.  The appropriately named \"Decorator\" class would provide a good framework for this process.\n3. Behavioral Patterns\nBehavioral design patterns describe the behavior of objects, such as the way they communicate with each other.  One example is the \"Command\" pattern, which describes objects that execute commands.  The \"Memento\" pattern records the state of an object so it can be restored to its saved stated.  These two patterns can be used together to perform Undo and Redo operations in a program.\nSummary\nEach of the three categories include several other design patterns that programmers can use.  While the patterns provide helpful templates for software developers, they are sometimes criticized for being unnecessary or not specific enough for certain applications.  Therefore, while design patterns are useful tools for programming, they do not need to be followed exactly to create a well-designed software program."
        ]
    },
    {
        "word": "Desk Checking",
        "type": [],
        "definition": [
            "Desk checking is the process of manually reviewing the source code of a program.  It involves reading through the functions within the code and manually testing them, often with multiple input values.  Developers may desk check their code before releasing a software program to make sure the algorithms are functioning efficiently and correctly.\nThe term \"desk checking\" refers to the manual approach of reviewing source code (sitting a desk), rather than running it through a debugger or another automated process.  In some cases, a programmer may even use a pencil and paper to record the process and output of functions within a program.  For example, the developer may track the value of one or more variables in a function from beginning to end.  Manually going through the code line-by-line may help a programmer catch improper logic or inefficiencies that a software debugger would not.\nWhile desk checking is useful for uncovering logic errors and other issues within a program's source code, it is time-consuming and subject to human error.  Therefore, an IDE or debugging tool is better suited for detecting small problems, such as syntax errors.  It is also helpful to have more than one developer desk check a program to reduce the likelihood of overlooking errors in the source code."
        ]
    },
    {
        "word": "Desktop",
        "type": [],
        "definition": [
            "The desktop is the primary user interface of a computer.  When you boot up your computer, the desktop is displayed once the startup process is complete.  It includes the desktop background (or wallpaper) and icons of files and folders you may have saved to the desktop.  In Windows, the desktop includes a task bar, which is located at the bottom of the screen by default.  In Mac OS X, the desktop includes a menu bar at the top of the screen and the Dock at the bottom.\nThe desktop is visible on both Windows and Macintosh computers as long as an application or window is not filling up the entire screen.  You can drag items to and from the desktop, just like a folder.  Since the desktop is always present, items on the desktop can be accessed quickly, rather than requiring you to navigate through several directories.  Therefore, it may be helpful to store commonly used files, folders, and application shortcuts on your desktop.\nBoth the Windows and Macintosh operating systems allow you to customize the appearance of your desktop.  In Windows 7, you can change the desktop background and select the default desktop icons within the \"Personalization\" control panel.  In Mac OS X 10.6, you can change the desktop background using the \"Desktop & Screen Saver\" system preference.  You can choose what items are shown on the desktop by selecting Finder &rarr; Preferences… and checking the items you want displayed.\nNOTE: The term \"desktop\" may also be short for desktop computer."
        ]
    },
    {
        "word": "Desktop Computer",
        "type": [],
        "definition": [
            "A desktop computer (or desktop PC) is a computer that is designed to stay in a single location.  It may be a tower (also known as a system unit) or an all-in-one machine, such as an iMac.  Unlike laptops and other portable devices, desktop computers cannot be powered from an internal battery and therefore must remain connected to a wall outlet.\nIn the early age of computers, desktop computers were the only personal computers available.  Since laptops and tablets did not exist, all home PCs were desktop computers.  Still, the term \"desktop computer\" was used back then to differentiate between personal PCs and larger computers, such as mainframes and supercomputers.\nWhile desktop computers were the most popular type of personal computer for several decades, in recent years, laptop sales have surpassed those of desktop PCs.  Because of the rise in mobile computing, this trend is likely to continue.  However, desktop computers remain the most popular choice for business workstations and family computers. "
        ]
    },
    {
        "word": "Desktop Publishing",
        "type": [],
        "definition": [
            "When documents and images are printed, they are \"published.\"  Before computers became commonplace, the publishing process required large print presses that copied and duplicated pages.  In order to print images and words on the same page, the text and graphics would have to be printed separately, cut out, placed on a single sheet, taped in place, then copied and printed.  Fortunately, computers with graphical user interfaces have enabled desktop publishing, which allows this process to be done electronically.\nAny time you use a computer to create a printable document, it can be considered desktop publishing.  However, the term is most commonly used to refer to professional computer-based publishing.  Desktop publishers use programs like Adobe InDesign and QuarkXpress to create page layouts for documents they want to print.  These desktop publishing programs can be used to create books, magazines, newspapers, flyers, pamphlets, and many other kinds of printed documents.  Publishers may also use programs like Adobe Photoshop and Illustrator to create printable images.  Even word processing programs like Microsoft Word can be used for basic desktop publishing purposes.\nComplete desktop publishing involves the combination of typesetting (choosing fonts and the text layout), graphic design, page layout (how it all fits on the page), and printing the document.  However, as mentioned before, desktop publishing can also be as simple as typing and printing a school paper.  In order to desktop publish, all you need is a computer, monitor, printer, and software that can create a printable document.  While that might cost more than a pen and paper, it certainly is cheaper than a printing press!"
        ]
    },
    {
        "word": "Desktop Software",
        "type": [],
        "definition": [
            "Desktop software refers to any application that runs locally on a desktop computer or laptop.  It is often contrasted with mobile apps and cloud-based software.\nDesktop software is either bundled with an operating system (like Windows or macOS) or installed by the user.  For several decades, software companies sold desktop software in physical boxes containing floppy disks, CDs, or DVDs.  As Internet access became widespread in the early 2000s, developers began offering apps via Internet download.  Today, downloading and installing desktop apps is far more common than installing apps from physical media.\nExamples of desktop apps include:\n\nMicrosoft Word\nAdobe Photoshop\nCorel WordPerfect\nApple Pages\nApple Final Cut Pro\n\nThe above apps are considered desktop software since you can download and install them on a desktop computer or laptop.  Some programs, like Microsoft Word and Apple Pages, are also available as web applications, meaning you can run a cloud-based version of the app in your web browser.  They are also available as mobile apps, which run on iOS and Android devices.  When requesting support for one of these applications, it is helpful to specify which type of app you are using.\nSome web apps are the same as their desktop counterparts, but desktop applications generally have a more robust feature set.  Mobile apps often have limited features based on the smaller screen size.\nDesktop programs are sometimes called \"traditional applications\" since they have been around since the 1980s.  While many people now use mobile apps and cloud-based \"SaaS\" software on a daily basis, desktop software is still essential for most computer users."
        ]
    },
    {
        "word": "DevOps",
        "type": [],
        "definition": [
            "DevOps combines the words \"development\" and \"operations.\"  It encompasses developers and IT operations personnel within an organization.\nThe goal of DevOps integration is to improve collaboration between development and operations teams.  An operations manager, for example, may request an update to a web application from the developers.  In order for the update to be successful, the operations team must accurately describe all the necessary features of the update.  The development team can then implement the update and test it internally before releasing it to the operations team for production.\nIf a bug is found in a live website or software program, the operations team can send the information to the development team so the engineers can review and fix the error.  Setting up a structured and streamlined workflow for requesting, implementing, and publishing updates can help companies release bug fixes quickly and efficiently.\nA DevOps process for software updates might include the following steps:\n\nReceiving and processing user feedback (Operations)\nDesigning the update (Operations and Development)\nCoding and implementing the update (Development)\nTesting the update internally (Development)\nPublishing the update to production (Operations)\nTesting the live update (Operations and Development)\n\nThe above steps are just one example of how a DevOps process might take place.  There is no specific set of steps a company must follow.  A small company, for instance, may have fewer steps and more overlap between divisions than a large corporation.  The end goal of DevOps, regardless of company size, is to produce reliable software in the shortest time possible.\nWays to improve DevOps workflow include:\n\nCreating identical testing and production environments\nAutomating software tests, such as unit testing\nDesigning software that is easily scalable\nUsing version control to keep track of changes\n\nNOTE: A \"DevOps Manager\" is a relatively new position in the field of information technology.  The role of a DevOps manager is to oversee both the development and operations teams, helping them communicate and work together effectively."
        ]
    },
    {
        "word": "Developer",
        "type": [],
        "definition": [
            "In the IT world, a developer is a person who creates something with a computer.  The term encompasses many types of content, such as software, websites, and written material.  Therefore, developers are often have more specific titles.  Some common examples include software developers, web developers, and content developers.\nSoftware Developer\nA software developer is someone who creates software programs.  Software developers often have more specific titles, such as programmer, software analyst, or software engineer.  A software programmer, for example, is someone who writes source code that can be run as a script or compiled into an executable program.  A software analyst provides the requirements and specifications for a software program and may also assist in programming the software.  A software engineer is the person who designs applications from the ground up and often oversees the development of software programs.\nWeb Developer\nA web developer is a person who builds and maintains websites.  Technically, he or she can perform more specialized web development tasks, such as coding HTML, writing CSS, and publishing content online.  Though web design is a subcategory of web development, web designers may also be called web developers since there is a lot of overlap between the two professions.  A person who maintains the content of a website and replies to visitor emails is called a webmaster.\nSoftware and web developers are often categorized as frontend or backend developers.  Frontend refers to layout and user interface design, while backend refers to actual coding, including scripting and database queries.  Someone who handles both frontend and backend development is a \"full stack developer.\"\nContent Developer\nA content developer, also called a content producer, is someone who creates publishable content.  This is often web-based content, though it may be material for a printed publication such as a magazine or technical manual as well.  The content typically includes original text which may be published as a news story, blog, or other type of article.  It may also contain images or video clips that are relevant to the article."
        ]
    },
    {
        "word": "Dial-up",
        "type": [],
        "definition": [
            "Dial-up refers to an Internet connection that is established using a modem.  The modem connects the computer to standard phone lines, which serve as the data transfer medium.  When a user initiates a dial-up connection, the modem dials a phone number of an Internet Service Provider (ISP) that is designated to receive dial-up calls.  The ISP then establishes the connection, which usually takes about ten seconds and is accompanied by several beeping an buzzing sounds.\nAfter the dial-up connection has been established, it is active until the user disconnects from the ISP.  Typically, this is done by selecting the \"Disconnect\" option using the ISP's software or a modem utility program.  However, if a dial-up connection is interrupted by an incoming phone call or someone picking up a phone in the house, the service may also be disconnected.\nIn the early years of the Internet, especially in the 1990s, a dial-up connection was the standard way to connect to the Internet.  Companies like AOL, Prodigy, and Earthlink offered dial-up service across the U.S., while several smaller companies offered local dial-up Internet connections.  However, due to slow speeds (a maximum of 56 Kbps), and the hassle of constantly disconnecting and reconnecting to the ISP, dial-up service was eventually replaced by DSL and cable modem connections.  Both DSL and cable lines, known as \"broadband\" connections, offer speeds that are over 100 times faster than dial-up and provide an \"always on\" connection.  While we don't get to listen to the fun buzzing and beeping noises of older modems anymore, it certainly is nice to download data in a fraction of the time."
        ]
    },
    {
        "word": "Dialog Box",
        "type": [],
        "definition": [
            "As the name implies, a dialog box serves to initiate a dialog with the user.  It is a window that pops up on the screen with options that the user can select.  After the selections have been made, the user can typically click \"OK\" to enter the changes or \"Cancel\" to discard the selections.  It is customary for menu options that include an ellipsis at the end, such as \"Preferences...\" or \"Save As...\", to open a dialog box when selected.\nFor example, if a user selects \"Internet Options...\" from the Options menu in Internet Explorer, a dialog box will pop up allowing the user to choose the default home page, change the security settings, empty the browser cache, and modify several other settings.  Once the selections have been made, the user can click \"OK\" to use the new settings, or \"Cancel\" to discard the changes.  Some Windows programs also have an \"Apply\" option that activates the selections without closing the dialog box.\nWhen a user selects \"Open...\" from the File menu, an \"Open dialog box\" appears, allowing the user to browse the hard drive and other disks for files to open.  When \"Save As...\" is chosen from the File menu, a \"Close dialog box\" pops up, allowing the user to type the name of the file and choose where to save it.  While dialog boxes may not seem too exciting, they provide an intuitive way to communicate with the computer and are an essential part of today's computer interfaces."
        ]
    },
    {
        "word": "Digital",
        "type": [],
        "definition": [
            "Digital information is stored using a series of ones and zeros.  Computers are digital machines because they can only read information as on or off -- 1 or 0.  This method of computation, also known as the binary system, may seem rather simplistic, but can be used to represent incredible amounts of data.  CDs and DVDs can be used to store and play back high-quality sound and video even though they consist entirely of ones and zeros.\nUnlike computers, humans perceive information in analog.  We capture auditory and visual signals as a continuous stream.  Digital devices, on the other hand, estimate this information using ones and zeros.  The rate of this estimation, called the \"sampling rate,\" combined with how much information is included in each sample (the bit depth), determines how accurate the digital estimation is.\nFor example, a typical CD audio track is sampled at 44.1 KHz (44,100 samples per second) with a bit depth of 16 bits.  This provides a high-quality estimation of an analog audio signal that sounds realistic the human ear.  However, a higher-quality audio format, such as a DVD-Audio disc, may be sampled at 96 KHz and have a bit depth of 24 bits.  The same song played on both discs will sound more smooth and dynamic on the DVD-Audio disc.\nSince digital information only estimates analog data, an analog signal is actually more accurate than a digital signal.  However, computers only work with digital information, so storing data digitally makes more sense.  Unlike analog data, digital information can also be copied, edited, and moved without losing any quality.  Because of the benefits digital information offers, it has become the most common way of storing and reading data.\nFor more information on analog and digital technology, view the Help Center article."
        ]
    },
    {
        "word": "Digital Asset",
        "type": [],
        "definition": [
            "A digital asset is a digital entity owned by an individual or company.  Examples include digital photos, videos, and songs.  These assets are not tangible, meaning they have no physical presence.  Instead, they are files that reside on storage device, such as a local computer or a cloud-based storage network.\nThe term \"digital asset\" ascribes legal ownership and value to a digital file.  For example, if you pay $1.29 to download a song from iTunes, it becomes a digital asset since you own the song.  Any stock photos you purchase are digital assets since you own the usage rights.  When you buy a software application, it becomes a digital asset since you own a license to use the software.\n\"Digital asset\" is also important in regards to copyright law.  While you own a song or video that you purchase online, the publisher or artist still owns the copyright to the content.  This means you cannot copy, distribute, or sell the digital content.  Similarly, you own the copyright to photos that you take with your digital camera or smartphone.\nDigital Assets and the DMCA\nUnlike tangible assets, digital assets are easy to copy and share.  Therefore, it is essential to assign legal rights to digital data.  The United States government passed the Digital Millennium Copyright Act (DMCA) in 1998, which help protects digital data and intellectual property.  It criminalizes the unauthorized dissemination of copyrighted digital content.  It also requires individuals and companies to stop publishing or sharing digital data once they have been informed of a copyright infringement.  This law has helped protect digital media and unique content on the web.\nNOTE: Since digital data is saved in a binary format, digital assets are simply ones and zeros saved to a storage device.  This may seem trivial, but millions or billions of ones and zeros can be used to store all types of digital content, including source code, documents, images, videos, webpages, and applications.  These are all digital assets, which are legally protected by U.S. and international copyright law."
        ]
    },
    {
        "word": "Digital Camera",
        "type": [],
        "definition": [
            "A digital camera is a similar to a traditional film-based camera, but it captures images digitally.  When you take a picture with a digital camera, the image is recorded by a sensor, called a \"charged coupled device\" or CCD.  Instead of saving the picture on analog film like traditional cameras, digital cameras save photos in digital memory.  Some digital cameras have built-in memory, but most use an SD or Compact Flash card.\nDigital cameras have several advantages over their analog counterparts.  While film rolls typically hold about 24 pictures, memory cards have the capacity to store several hundred or even several thousand pictures on a single card.  Therefore, photographers can be much more liberal in the shots they take.  Since the images are captured digitally, unwanted images can be deleted directly on the camera.  Most digital cameras also include a small LCD screen that shows a live preview of the image, which makes it easier to capture the perfect picture.  These cameras usually include an option to record video as well.\nIn the past, people would need to drop off their film at a photo processing location in order to get their pictures developed.  With digital cameras, you can simply import the pictures to your computer via a USB cable.  Once the digital photos have been imported, you can publish them online or e-mail them to friends.  You can also edit them using photo editing software.  If you want to print hard copies of your photos, you can use a home printer or an online printing service.\nDigital cameras range greatly in size in quality.  On the low end are portable electronic devices such as as cell phones and iPods that have digital cameras built into them.  In the mid range are are standalone point-and-shoot cameras that have additional features and picture taking modes.  On the high end are digital SLR (single lens reflex) cameras, which support interchangeable lenses.  These cameras are used by photography professionals and capture high resolution images with accurate color.\nWhile early digital cameras did not perform as well as their film-based counterparts, modern digital cameras can now capture even higher quality images.  Today's point-and-shoot cameras now have resolutions in excess of 10 megapixels, which allows them to capture crystal clear images.  They also focus and capture images much faster than before, which gives them the responsiveness of analog cameras.  These improvements, along with the many advantages of digital photography, are why nearly all photographers have gone digital."
        ]
    },
    {
        "word": "Digital Footprint",
        "type": [],
        "definition": [
            "A digital footprint is a trail of data you create while using the Internet.  It includes the websites you visit, emails you send, and information you submit to online services.\nA \"passive digital footprint\" is a data trail you unintentionally leave online.  For example, when you visit a website, the web server may log your IP address, which identifies your Internet service provider and your approximate location.  While your IP address may change and does not include any personal information, it is still considered part of your digital footprint.  A more personal aspect of your passive digital footprint is your search history, which is saved by some search engines while you are logged in.  \nAn \"active digital footprint\" includes data that you intentionally submit online.  Sending an email contributes to your active digital footprint, since you expect the data be seen and\/or saved by another person.  The more email you send, the more your digital footprint grows.  Since most people save their email online, the messages you send can easily remain online for several years or more.\nPublishing a blog and posting social media updates are another popular ways to expand your digital footprint.  Every tweet you post on Twitter, every status update you publish on Facebook, and every photo you share on Instagram contributes to your digital footprint.  The more you spend time on social networking websites, the larger your digital footprint will be.  Even \"liking\" a page or a Facebook post adds to your digital footprint, since the data is saved on Facebook's servers.\nEveryone who uses the Internet has a digital footprint, so it is not something to be worried about.  However, it is wise to consider what trail of data you are leaving behind.  For example, understanding your digital footprint may prevent you from sending a scathing email, since the message might remain online forever.  It may also lead you to be more discerning in what you publish on social media websites.  While you can often delete content from social media sites, once digital data has been shared online, there is no guarantee you will ever be able to remove it from the Internet."
        ]
    },
    {
        "word": "Digital Forensics",
        "type": [],
        "definition": [
            "Digital forensics is a subset of forensics — the collection and analysis of criminal evidence — that focuses on digital information.  Examples include retrieving data from a computer, analyzing the metadata of specific files, and monitoring network traffic.\nA common first step in the digital forensics process is accessing data from an electronic device.  For example, a laptop, smartphone, or cloud storage account may contain data that pertains to a specific investigation.  In some cases, the data is easily accessible, while in others, the data may be encrypted or require a login.  Digital forensics may also involve recovering data from a damaged or partially erased storage device.\nAfter gaining access to the data, investigators may search or browse through folders and files to find relevant information.  For instance, they may look for emails or text messages sent at a specific time.  Images or videos may also provide useful evidence.  The metadata of certain files can be helpful as well.  For example, an email header may include the IP address of the device that sent the message.  Image EXIF data may include GPS location information, as well as the date and time the image was taken.\nWhile digital forensics typically focuses on recovering existing data, it may also involve monitoring data in realtime.  For instance, a detective may use a packet sniffer to record packets sent over an individual's wireless connection.\nData Authenticity\nRegardless of the process used to recover digital information, the authenticity of the data is paramount in criminal cases.  Since digital information can easily be copied or modified, it is often difficult to verify original data.  Corroborating evidence may be required to ensure that digital data has not been altered.  Examples include copies of data from multiple devices and log files from a server."
        ]
    },
    {
        "word": "Digital Signature",
        "type": [],
        "definition": [
            "Signatures are commonly used to authenticate documents.  When you sign a physical document, you are authenticating its contents.  Similarly, digital signatures are used to authenticate the contents of electronic documents.  They can be used with PDF documents, e-mail messages, and word processing documents. \nTo digitally sign a document, you must have a digital ID.  This unique identifier can be obtained from various certification authorities on the web, such as VeriSign and EchoSign.  Once you have a digital ID, you can register it with programs that support digital signatures, such as Adobe Acrobat and Microsoft Outlook.  Then you can use the program's \"Sign\" feature to add your digital signature to documents.\nThe digital signature is simply a small block of data that is attached to documents you sign.  It is generated from your digital ID, which includes both a private and public key.  The private key is used to apply the signature to the document, while the public key is sent with the file.  The public key contains encrypted code, also called a \"hash,\" that verifies your identity.\nDigital signatures can be used to certify or approve documents.  Certifying signatures verify the document's creator and show the document has not been altered since it was signed.  Therefore, only the original creator of a document can add a certifying signature.  Approval signatures can be added by anyone with a digital ID and are used to approve documents, track changes, and accept terms stated with a document."
        ]
    },
    {
        "word": "Digitize",
        "type": [],
        "definition": [
            "To digitize something means to convert it from analog to digital.  For example, an analog audio signal received by a microphone is digitized when it is recorded by a computer.  Computers must digitize analog input because they are digital devices and cannot process analog information.\nDigital recordings are created by taking samples of analog data, typically at the rate of several thousand per second.  For example, CD audio is digitized using a sample rate of 44.1 kilohertz (kHz).  That means the analog signal is sampled at 44,100 times every second.  The greater the sampling rate, the better the quality (or higher the fidelity) of the digitized file.\nAnalog data is digitized using a device called an ADC or \"analog-to-digital converter.\"  This may be a standalone box or simply a small chip inside a computer.  When converting professional audio or video from analog to digital, it is important to use a high-quality ADC to maintain the character of the original recording.  The opposite of an ADC is a DAC, which converts digital data to analog.\nSince digitizing takes small samples an analog signal, the result is an estimation of the original data.  Therefore analog data is actually more accurate than digitized data.  However, as long as a high enough sampling rate is used, humans perceive digitized audio and video as a steady stream of analog information.  Because computers can edit digital data and copy digital files with no loss of quality, most of today's media is created and saved in a digital format."
        ]
    },
    {
        "word": "Diode",
        "type": [],
        "definition": [
            "A diode is an electrical component designed to conduct electric current in only one direction.  It has two ends (or terminals), each with an electrode of a different charge.  The \"anode\" end has a positive charge relative to the negatively charged \"cathode\" end.  Current naturally flows in the direction from the anode to the cathode.\nDiodes commonly serve as switches, allowing or preventing the flow of current.  For example, current can be stopped by simply reversing an active diode inside an electrical circuit.  Flipping the diode back to the original position will allow electricity to continue flowing through the circuit.  Multiple diodes within a circuit can be used as logic gates, performing AND and OR functions.\nWhile current generally flows through a diode in one direction, in some cases the current can be reversed.  If the negative voltage applied to a diode exceeds the \"breakdown voltage,\" the current will begin flowing in the opposite direction.  The breakdown voltage of a typical diode ranges from -50 to -100 volts, though the amount can be significantly less or more based on the design and materials used in the diode.  Some diodes can be damaged by the reverse flow of current, while others are designed to allow current to flow in both directions.  Zener diodes, for instance, are designed with specific breakdown voltages for different applications.\nAnother common type of diode is a light-emitting diode, or LED.  Light emitting diodes generate visible light when current passes between the anode and cathode though a space called the p-n junction.  The electrical charge in this space produces light in different colors depending on the charge and materials used in the diode."
        ]
    },
    {
        "word": "Direct Digital Marketing",
        "type": [],
        "definition": [
            "Direct digital marketing, also known as \"DDM,\" is a type of marketing that is done exclusively through digital means.  It may be used to supplement or even replace traditional physical marketing strategies.  The primary channels of direct digital marketing include e-mail and the Web.\nWhile most of us still receive an abundance of physical marketing materials in our mailboxes each week, many of these mailings have been replaced by e-mail.  By using e-mail marketing, companies can drastically reduce their mailing costs, since the cost of sending e-mail messages is essentially free.  Compare this to mailing physical brochures that may cost $0.50 per recipient.  If a company sends out one million mailings, using e-mail could save the company $500,000 in mailing costs.\nWhile e-mail marketing is great asset for many businesses, it can also be abused.  Since it doesn't cost anything to send e-mail messages, it is possible to distribute unsolicited messages to large lists of recipients at little to no cost.  This kind of unwanted electronic junk mail has become widely known as \"spam.\"  Fortunately, junk mail filters have helped reduce the impact of these messages for most users.  Many companies and organizations also offer an \"unsubscribe\" option in their mailings, which allow users to remove themselves from the mailing lists.\nThe Web is another popular medium for direct digital marketing.  Many companies now advertise on websites through banner ads, text links, and other types of advertisements.  By using Web marketing, companies can drive visitors directly to their website with a single click.  This provides a tangible benefit over print and television advertising, which may fully not capture a viewer's interest.  Additionally, companies can target their ads on pages with relevant content using contextual ad placement services, such as Google AdSense.  This allows businesses to attract people who are the most likely to be interested in the products or services they offer.\nIn the past few years, DDM has revolutionized the marketing industry.  By using digital communications, businesses can advertise in several new ways that were not possible before.  While e-mail and the Web remain the most popular mediums for DDM, digital marketing continues to expand into other areas as well.  Mobile phones and video games are already being used for DDM and you can expect many other mediums to follow."
        ]
    },
    {
        "word": "Direct3D",
        "type": [],
        "definition": [
            "Direct3D is an application program interface (API) developed by Microsoft that provides a set of commands and functions for manipulating 3D objects.  By using Direct3D commands, software developers can take advantage of many prewritten functions.  This allows programmers to write significantly less code than if they had to write all the functions from scratch.  Direct3D makes it relatively easy to manage three-dimensional objects, including lighting and shadows as well.\nIn order for a software program to use Direct3D commands, the computer's video card or graphics accelerator device must support Direct3D.  Fortunately, just about all video cards made for PCs offer Direct3D support.  While many video games and other programs use Direct3D, OpenGL is a more widely used standard."
        ]
    },
    {
        "word": "DirectX",
        "type": [],
        "definition": [
            "DirectX is a set of standard commands and functions that software developers can use when creating their programs.  While any Windows-based software program can include DirectX commands, they are usually used in video games.  For example, developers may use DirectX for controlling video playback, sound effects, and peripheral input (such as a keyboard, mouse, or joystick).  By incorporating DirectX functions into a computer game, programmers can use predefined commands to manage the video and sound of their game, as well as user input.  This makes it easier for programmers to develop video games and also helps the games look more uniform, since DirectX games use many of the same commands.\nTechnically, DirectX is known as an application programming interface (API), which consists of predefined functions and commands.  In order to create programs that use DirectX, software developers must use the DirectX software development kit, available from Microsoft.  However, most users need only the DirectX \"End-User Runtime\" installed on their computer in order to run DirectX-enabled software.  The DirectX API is available for Windows software and Xbox video games."
        ]
    },
    {
        "word": "Directory",
        "type": [],
        "definition": [
            "A directory is another name for a folder.  File systems use directories to organize files within a storage device, such as an HDD or SSD.  For example, system files may be located in one directory, while user files may be stored in another.\nWhile directories often contain files, they may also contain other directories, or subdirectories.  The user folder, for instance, may include directories such as Documents, Pictures, and Videos.  Each of these directories may contain files and other subdirectories.  This resulting directory structure, represented visually, would look like an upside-down tree.  The top-level directory of a volume that contains all other directories is aptly labeled the root directory.\nThe location of an individual file or folder within a directory can be represented by a directory path, such as C:\\Program Files (x86)\\Google\\Chrome\\Application\\. As you browse through your file system, whenever you open a subdirectory, it is called \"moving down a directory.\"  If you open the folder that contains the current directory, it is called \"moving up a directory.\"\nDirectory vs Folder\nThe terms \"directory\" and \"folder\" can be used interchangeably.  However, folders are technically the visual representation of a directory.  In other words, a folder is an icon with a name that represents a directory in the file system."
        ]
    },
    {
        "word": "Disk Drive",
        "type": [],
        "definition": [
            "A disk drive is a device that reads and\/or writes data to a disk.  The most common type of disk drive is a hard drive (or \"hard disk drive\"), but several other types of disk drives exist as well.  Some examples include removable storage devices, floppy drives, and optical drives, which read optical media, such as CDs and DVDs.\nWhile there are multiple types of disk drives, they all work in a similar fashion.  Each drive operates by spinning a disk and reading data from it using a small component called a drive head.  Hard drives and removable disk drives use a magnetic head, while optical drives use a laser.  CD and DVD burners include a high-powered laser that can imprint data onto discs.\nSince hard drives are now available in such large capacities, there is little need for removable disk drives.  Instead of expanding a system's storage capacity with removable media, most people now use external hard drives instead.  While CD and DVD drives are still common, they have become less used since software, movies, and music can now often be downloaded from the Internet.  Therefore, internal hard drives and external hard drives are the most common types of disk drives used today."
        ]
    },
    {
        "word": "Disk Image",
        "type": [],
        "definition": [
            "A disk image is a software copy of a physical disk.  It saves the entire data from the disk, including the file structure and all files and folders from the disk, in a single file.  Because disk images are exact copies, or \"clones,\" of original disks, they can be used to duplicate disks or serve as full backups in case a system restore must be done.\nDisk images can be created from both hard disks and optical media, such as CDs and DVDs.  However, optical media images are technically called \"disc images\" instead of \"disk images.\"  Several programs, such as Nero, IsoBuster, and Norton Ghost can be used to make disk images for Windows.  Programs like Apple Disk Utility and Roxio Toast can create disk images for Mac OS X.\nMost disk image files store data in a raw, binary format.  This means they do not have a file system, which tells the computer how to access the files and folders in the disk image.  Therefore, in order for the data in a disk image to be readable by the computer, the image must first be mounted by either the operating system or a disk utility program.\nFile extensions: .ISO, .BIN, .DMG"
        ]
    },
    {
        "word": "Dithering",
        "type": [],
        "definition": [
            "Dithering is a process that uses digital noise to smooth out colors in digital graphics and sounds in digital audio.\nDigital Graphics\nAll digital photos are an approximation of the original subject, since computers cannot display an infinite amount of colors.  Instead, the colors are estimated, or rounded to the closest color available.  For example, an 8-bit GIF image can only include 256 (2^8) colors.  This may be enough for a logo or computer graphic, but is too few colors to accurately represent a digital photo.  (This is why most digital photos are saved as 16 or 24-bit JPEG images, since they support thousands or millions of colors.)\nWhen digital photos contain only a few hundred colors, they typically look blotchy, since large areas are represented by single colors.  Dithering can be used to reduce this blotchy appearance by adding digital noise to smooth out the transitions between colors.  This \"noise\" adds makes the photo appear more grainy, but gives it a more accurate representation since the colors blend together more smoothly.  In fact, if you view a dithered 256-color image from far away, it may look identical to the same image that is represented by thousands or millions of colors.\nDigital Audio\nLike digital images, digital audio recordings are approximations of the original analog source.  Therefore, if the sampling rate or bit depth of an audio file is too low, it may sound choppy or rough.  Dithering can be applied to the audio file to smooth out the roughness.  Similar to dithering a digital image, audio dithering adds digital noise to the audio to smooth out the sound.  If you view a dithered waveform in an audio editor, it will appear less blocky.  More importantly, if you listen to a dithered audio track, it should sound smoother and more like the original analog sound.\nSummary\nSeveral types of dithering algorithms are used by various image and audio editors, though random dithering is the most common.  While dithering is often used to improve the appearance and sound of low quality graphics and audio, it can also be applied to high quality images and recordings.  In these situations, dithering may still provide extra smoothness to the image or sound."
        ]
    },
    {
        "word": "Dock",
        "type": [],
        "definition": [
            "The Dock is a feature of the Macintosh operating system that was introduced with Mac OS X.  It is a virtual tray of icons that provides fast, one-click access to commonly used programs and files.\nBy default, the Dock is displayed at the bottom of the Mac OS X desktop.  It contains icons for several of the applications included with Mac OS X and always includes the Finder icon on the far left and the Trash icon on the far right.  While the Dock has a default size and location, these options can be changed within the Dock System Preference pane.  For example, the Dock can be moved to the left or right side of the screen.  You can also change the size of the dock and the magnification percentage, which magnifies the icons as you roll over them with the cursor.  If you want the Dock to only appear when you need it, you can select \"Automatically hide and show the Dock,\" which will hide the Dock unless you move the mouse to the bottom of the screen.\nTo open an application, file, or folder from the Dock, simply click the icon (you don't need to double-click items in the Dock).  When you open an application, the icon will bounce while the program is opening.  Once the program opens, the icon will have a dot underneath it, which indicates the application is running.  You can also open files by dragging them to the appropriate application in the Dock.  If the application is not already running, it will start up, then open the file.\nIf you want to add items to the Dock, you can drag the corresponding icons to the Dock from open windows or the desktop.  Note that applications are located on the left of the Dock and files and folders are located on the right side.  Therefore, make sure you drag the icon to the correct side.  When you move an icon to the Dock, a space will open for it and you can place it wherever you like.  You can also move icons around by simply dragging them to different spots within the Dock.\nIf you want to remove an icon from the Dock, simply drag it from the Dock to the desktop.  You will see an animation involving a puff of smoke, which indicates the program has been removed.  Since the icons in the Dock are only shortcuts to the original files and applications, the actual program or file will remain untouched, even after you remove the icon from the Dock."
        ]
    },
    {
        "word": "Docking Station",
        "type": [],
        "definition": [
            "A docking station, or dock, is a device that connects a laptop to multiple peripherals.  It provides a single connection point that allows a laptop to use a connected monitor, printer, keyboard, and mouse.  This allows a laptop to function like a desktop computer.\nLaptop manufacturers often build custom docking stations for their laptops.  These docks usually have a proprietary input port that connects to a matching port on specific laptop models.  Early docks, such as those built in the 1990s, included serial ports for connecting input devices, parallel ports for connecting printers and scanners, and VGA ports for connecting monitors.  In recent years, laptop docking stations have become more standardized, with USB ports for connecting most peripherals and DVI ports for connecting displays.\nWhile modern docks provide standardized I\/O ports, many docking stations still use a proprietary dock connector, which means when you buy a new laptop, you may need to buy a new dock.  Fortunately, the Thunderbolt connector, first used in Apple's MacBook laptops, eliminates the need for a docking station.  A single Thunderbolt connection can support USB, FireWire, Ethernet, and DisplayPort connections.  Therefore, a Thunderbolt hub serves the same purpose as a laptop dock and is compatible with any computer that has a standard Thunderbolt connection.\nNOTE: Docking stations may also refer to hardware used to connect tablets, smartphones, and other portable devices to one or more peripherals.  However, these devices are generally called \"docks\" and typically have fewer I\/O connections than a laptop dock."
        ]
    },
    {
        "word": "Document",
        "type": [],
        "definition": [
            "A computer document is a file created by a software application.  While the term \"document\" originally referred specifically to word processor documents, it is now used to refer to all types of saved files.  Therefore, documents may contain text, images, audio, video, and other types of data.\nA document is represented with both an icon and a filename.  The icon provides a visual representation of the file type, while the filename provides a unique name for the file.  Most document filenames also include a file extension, which defines the file type of the document.  For example, a Microsoft Word document may have a .DOCX file extension, while a Photoshop document may have a .PSD file extension.\nMany software applications allow you to create a new document by selecting File &rarr; New from the menu bar.  You can then edit the document and select File &rarr; Save to save the file to your hard disk.  If you want create a copy of the document, most programs allow you to select File &rarr; Save As… to save the document with a different filename.  Once you have saved a document, you can open it at a later time by double-clicking the file or by selecting File &rarr; Open… within the associated program."
        ]
    },
    {
        "word": "Document Grinding",
        "type": [],
        "definition": [
            "Document grinding is the process of analyzing documents to extract meaningful data.  The term is often associated with computer hacking, since hackers may \"grind\" documents to reveal confidential data.  However, document grinding is also used for nonmalicious purposes.  Examples include identifying unknown file types and viewing file metadata.\nIt is possible to perform document grinding on both plain text and binary files.\nText Files\nGrinding text files is a simple process since they store data as plain text.  You can search for characters and strings within a text document using a tool like grep or another search utility.  Since text processing is a relatively fast computer operation, it may be possible to grind several large documents in less than a second.\nCommon text file types targeted for document grinding include log files (.LOG, .TXT) and configuration files (.CONF, .CNF).  If a hacker gains access to a web server, for example, he may search these files for usernames, passwords, and other confidential data.\nBinary Files\nBinary files may contain some plain text, but they also store binary data — 1s and 0s.  It is more difficult to grind binary data since it cannot be searched with a text search tool.  Additionally, many binary files are saved in a proprietary file format, which is difficult to parse without the corresponding application.  Therefore binary document grinding typically focuses on the header and footer of a document, which may contain plain text.  It may also aim to extract file metadata.\nMany binary files contain information about the file type in the header of the file.  For example, in the sample image, the letters \"PNG\" in the header indicate the file is a PNG image.  This information is useful for identifying the file type since it does not have a file extension.  Similarly, digital photos often contain hidden EXIF data saved when the photo was taken.  An image-viewing program or a document grinding script may be able to detect and extract this information."
        ]
    },
    {
        "word": "Domain",
        "type": [],
        "definition": [
            "While the term \"domain\" is often used synonymously with \"domain name,\" it also has a definition specific to local networks.\nA domain contains a group of computers that can be accessed and administered with a common set of rules.  For example, a company may require all local computers to be networked within the same domain so that each computer can be seen from other computers within the domain or located from a central server.  Setting up a domain may also block outside traffic from accessing computers within the network, which adds an extra level of security.\nWhile domains can be setup using a variety of networking software, including applications from Novell and Oracle, Windows users are most likely familiar with Windows Network Domains.  This networking option is built into Windows and allows users to create or join a domain.  The domain may or may not be password-protected.  Once connected to the domain, a user may view other computers within the domain and can browse the shared files and folders available on the connected systems.\nWindows XP users can browse Windows Network Domains by selecting the \"My Network Places\" option on the left side of an open window.  You can create a new domain by using the Network Setup Wixard.  Mac users using Mac OS X 10.2 or later can also connect to a Windows Network by clicking the \"Network\" icon on the left side of an open window.  This will allow you to browse local Macintosh and Windows networks using the SMB protocol."
        ]
    },
    {
        "word": "Domain Name",
        "type": [],
        "definition": [
            "A domain name is a unique name that identifies a website.  For example, the domain name of the Tech Terms Computer Dictionary is \"techterms.com.\"  Each website has a domain name that serves as an address, which is used to access the website.\nWhenever you visit a website, the domain name appears in the address bar of the web browser.  Some domain names are preceded by \"www\" (which is not part of the domain name), while others omit the \"www\" prefix.  All domain names have a domain suffix, such as .com, .net, or .org.  The domain suffix helps identify the type of website the domain name represents.  For example, \".com\" domain names are typically used by commercial websites, while \".org\" websites are often used by non-profit organizations.  Some domain names end with a country code, such as \".dk\" (Denmark) or \".se\" (Sweden), which helps identify the location and audience of the website.\nDomain names are relatively cheap to register, though they must be renewed every year or every few years.  The good news is that anyone can register a domain name, so you can purchase a unique domain name for your blog or website.  The bad news is that nearly all domain names with common words have already been registered.  Therefore, if you want to register a custom domain name, you may need to think of a creative variation.  Once you decide on a domain name and register it, the name is yours until you stop renewing it.  When the renewal period expires, the domain name becomes available for others to purchase.\nNOTE: When you access a website, the domain name is actually translated to an IP address, which defines the server where the website located.  This translation is performed dynamically by a service called DNS."
        ]
    },
    {
        "word": "Domain Suffix",
        "type": [],
        "definition": [
            "A domain suffix is the last part of a domain name and is often referred to as a \"top-level domain\" or TLD.  Popular domain suffixes include \".com,\" \".net,\" and \".org,\" but there are dozens of domain suffixes approved by ICANN.\nEach domain suffix is intended to define the type of website represented by the domain name.  For example, \".com\" domains are meant for commercial websites, whereas \".org\" domains are to be used by organizations.  However, since any entity can register domain names with these suffixes, the domain suffix does not always represent the type of website that uses the domain name.  For example, many individuals and organizations register \".com\" domain names for non-commercial purposes, since the \".com\" domain is the most recognized.\nEach country also has a unique domain suffix that is meant to be used for websites within the country.  For example, Brazilian websites may use the \".br\" domain suffix, Chinese websites may use the \".cn\" suffix, and Australian websites may use the \".au\" suffix.  These country-based TLDs, sometimes referred to as \"country codes,\" are also used to specify different versions of an international website.  For example, the German home page for Google is \"www.google.de\" instead of \"www.google.com.\""
        ]
    },
    {
        "word": "Donationware",
        "type": [],
        "definition": [
            "Donationware is software that is free to use, but encourages users to make a donation to the developer.  Some donationware programs request a specific amount, while others allow users to determine what the program is worth and send in an appropriate donation.  Unlike shareware, which may provide limited functionality until a registration key is purchased, donationware is fully functional.  Therefore, donationware is more similar to freeware, which is free to use, but retains the author's copyright.\nSome donationware programs make subtle requests for donations, such as an option in the menu bar.  Others are more blatant, and may prompt you for a donation each time you open the program.  This dialog box should disappear once you have made a contribution.  Most donationware programs allow you to donate to the developer via a credit card or PayPal account.\nIf you find a certain donationware application program to be useful, you can be sure the developer will appreciation your donation.  Just make sure that the website you use to donate is legitimate and provides a secure (HTTPS) connection."
        ]
    },
    {
        "word": "Dongle",
        "type": [],
        "definition": [
            "A dongle is a small device, typically about the size of a flash drive, that plugs into a computer.  Some dongles act as security keys while others serve as adapters.  While early dongles connected to parallel ports on PCs and ADB ports on Macs, modern versions typically connect to a USB port.\nSecurity Keys\nSecurity dongles are used for copy protection are designed to prevent software piracy.  For example, some high-end software applications, such as professional audio and video production programs, require a dongle in order to run.  The dongle, which is included with the software, must be plugged in when you open the software program.  If the correct dongle is not detected, the application will produce an error message saying a dongle is required in order to use the software.\nAdapters\nCertain types of adapters are also called dongles.  For instance, a dongle may provide a laptop with different types of wired connections.  Previous generations of laptops had expansion slots called PCMCIA ports that were too skinny to include an Ethernet jack.  Therefore, a dongle was required.  These types of dongles were typically one to three-inch cables that connected to the card on one end and had an Ethernet jack on the other.  Modern Ethernet dongles have a similar appearance, but they usually connect to a USB or Thunderbolt port.\nToday, many dongles provide wireless capabilities.  For example, USB Wi-Fi adapters are often called dongles.  Since most computers now have built-in Wi-Fi chips, cellular data adapters, such as 3G and 4G dongles, are more prevalent.  These types of dongles allow you to connect to the Internet via a cellular carrier like Verizon or AT&T even when Wi-Fi is not available."
        ]
    },
    {
        "word": "Dot Matrix",
        "type": [],
        "definition": [
            "A dot matrix is a 2D matrix of dots that can represent images, symbols, or characters.  They are used for electronic displays, such as computer monitors and LED screens, as well as printed output.\nIn a dot matrix display, the images are estimated using a discrete set of dots instead of lines and shapes.  Therefore, the more dots that are used, the more clear and accurate the image representation will be.  For example, a 16x16 dot matrix can represent the letter \"S\" more accurately than a 8x8 matrix.  If enough dots are used, the image will appear as a contiguous display rather than a group of dots.  This is because the human eye blends the dots together to create a coherent image.  For example, newspaper print is made up of dot matrixes, but it is hard to notice unless you look very closely at the paper.\nBitmap images on a computer screen are also dot matrixes, since they are made up of a rectangular grid of pixels.  If you look closely enough at your monitor, you may even be able to see the dots that make up the image.  But be nice to your eyes and don't stare too long!\nWhile \"dot matrix\" has a broad definition, it can also be used to describe a specific type of printer.  Dot matrix printers, or \"impact printers,\" were introduced in the 1970s.  These printers typically use the kind of paper with small holes on each side that are used to feed the paper through the printer.  They are called dot matrix printers because they use a matrix of dots to print each character.  While they do not have a very high resolution, dot matrix printers are an effective way of printing basic text documents.  Therefore, while most businesses now use inkjet or laser printers, some organizations still find dot matrix printers to be an efficient printing solution."
        ]
    },
    {
        "word": "Dot Pitch",
        "type": [],
        "definition": [
            "Dot pitch, or \"pixel pitch,\" is a measurement that defines the sharpness of a display.  It measures the distance between the dots used to display the image on the screen.  This distance is very small and is typically measured in fractions of millimeters.  The smaller the dot pitch, the sharper the picture.\nDot pitch applies to both CRT monitors and flat-screen displays.  While some large-screen CRTs have dot-pitches as high as 0.51 mm, most computer displays have a dot pitch between 0.25 and 0.28 mm.  Similarly, most LCD displays have a dot pitch between 0.20 and 0.28 mm.  Some high-end displays used for scientific or medical imagery have dot pitches as low as 0.15 mm.  These displays usually cost several times as much as consumer displays of the same size.\nWhile the terms \"dot pitch\" and \"resolution\" are related, they have different meanings.  A display's resolution refers to how many pixels can be displayed on the screen.  For example, a 20\" monitor may have a maximum resolution of 1680 x 1050 pixels.  When a display is set to its native resolution (typically the maximum resolution), it may display exactly one pixel per dot.  However, if the resolution is reduced, the pixels will be larger than the dots used to display the image on the screen.  In this case, each pixel is mapped onto multiple dots."
        ]
    },
    {
        "word": "Double Click",
        "type": [],
        "definition": [
            "Double clicking involves clicking your mouse button quickly two times.  To perform a double click, and not just two clicks, the mouse button must be pressed twice within a very short time, typically about half a second.  Most operating systems allow you to lengthen or shorten the maximum time allowed for a double click, using the Mouse Control Panel or System Preference.\nA double click is recognized by your computer as a specific command, just like pressing a key on your keyboard.  Double clicking is used to to perform a variety of actions, such as opening a program, opening a folder, or selecting a word of text.  In order to double click an object, just move the cursor over the item and press the left mouse button quickly two times."
        ]
    },
    {
        "word": "Download",
        "type": [],
        "definition": [
            "Download can be used as either a verb or a noun.  As a verb, it refers to the process of receiving data over the Internet.  Downloading is the opposite of uploading, or sending data to another system over the Internet.  As a noun, download may refer to either a file that is retrieved from the Internet or the process of downloading a file.  \nEvery time you use the Internet, you download data.  For example, each time you visit a webpage, your computer or mobile device must download the HTML, CSS, images, and any other relevant data in order to display the page in your web browser.  When you click a \"Download Now\" link, your browser will start downloading a specific file that you can open.\nYou can also download data using mediums besides the web.  For example, you can download files using an FTP program, download email messages with an email client, and download software updates directly through your operating system.  You can manually initiate a download (such as clicking a download link), though most downloads happen automatically.  For example, your smartphone may download email messages and software updates in the background without you knowing it.\nWhile you can download a file, the word \"download\" may also refer to the file itself.  A common way you might see \"download\" used as a noun is in an online advertisement that says, \"Free Download.\"  This phrase implies that clicking the download link will download a file (often a software program or installer) and use it for free.  The noun \"download\" can also be used like the word \"transfer\" to describe the process of downloading data.  For example, a program may display a status update that says, \"Download in progress\" or \"Download complete.\""
        ]
    },
    {
        "word": "Downtime",
        "type": [],
        "definition": [
            "Downtime is a period when a system is not available.  It may apply to any computer or network, but is most commonly used in reference to servers.  In particular, web server reliability is often measured in terms of downtime, where little to no downtime is ideal.\nThere are several reasons why a server may experience downtime:\n\nServer reboot - Restarting a server may require a few minutes of downtime because the system must shut down, reboot, then restart the necessary processes in order to respond to incoming requests.\nSoftware restart - Restarting a process, such as Apache on a web server, may cause a few seconds of downtime while the process is restarting.\nNetwork disconnect - If a server is physically disconnected from a network, it will not be reachable by the systems on the network.\nNetwork outage - If any part of a network (including the Internet) is not functioning between the server and client, the client will not be able to communicate with the server.\nTraffic overload - If a server receives more traffic than it can handle, it will not be able to respond to all the requests.  Users may experience downtime until the traffic decreases.  This may be caused by a spike in traffic or a DDoS attack.\nHardware failure - If an important hardware component, such as an HDD or SSD fails, it may cause the server to stop functioning.\nSoftware failure - If a process on a server, such as the httpd (HTTP) service stops running, it will cause the server to be unresponsive to requests until the process is restarted.\nPower outage - If the electrical power goes out and no backup power is available (for example, a generator or UPS), any affected systems will be offline until power is restored.\nHacker attack - If a hacker gains control of a server, he or she may prevent access to the required services, causing the server to stop responding.\n\nIn order to minimize downtime, server administrators must implement strong security measures and redundancy.  Network security helps protect against malicious activity, such as unauthorized logins and DDoS attacks.  Redundancy, such as RAID storage systems and backup power generators, help prevent downtime due to hardware failure.  In some cases, multiple servers may be configured so that a secondary server can take over if the primary server fails.\nWhile server admins try to minimize downtime as much as possible, sometimes downtime is unavoidable.  For example, when performing a server migration, several minutes or even a few hours of downtime may be necessary.  This type of \"planned downtime\" is typically scheduled for early morning or weekend hours when traffic levels are lowest."
        ]
    },
    {
        "word": "Drag",
        "type": [],
        "definition": [
            "You can use your mouse to drag icons and other objects on your computer screen.  Dragging icons from your desktop or an open window to another folder will move the objects to the new folder.  You can also drag icons to the Trash (Mac) or the Recycle Bin (Windows) if you want to delete tehm.  Some word processing programs allow you to select text and drag the selected text to another place in the document.  To select the text, you may have to \"drag\" the mouse over the text you want to select.\nDragging is an important technique for using today's graphical user interfaces (GUIs).  In fact, there are many other things you can drag besides icons.  For example, you can drag the top of windows to reposition them, you can drag the scroll bar in open documents or Web pages to scroll through them, and you can drag messages to different folders in your mail program.  Other programs, such as video games and image-editing programs use dragging to reposition items on the screen.\nTo drag an item, first move the cursor over the item you want to drag.  Then click and hold down the left mouse button to \"grab\" the item.  Move the mouse to position the item where you want it.  Let go of the mouse button once you have moved the item to \"release\" it.  This technique is known as a \"drag and drop.\""
        ]
    },
    {
        "word": "Drag and Drop",
        "type": [],
        "definition": [
            "Drag and drop (also \"drag-and-drop\") is a common action performed within a graphical user interface.  It involves moving the cursor over an object, selecting it, and moving it to a new location.\nIf you are using a mouse, you can drag and drop an object by clicking the mouse button to select an object, then moving the mouse while keeping the mouse button pushed down.  This is called \"dragging\" the object.  Once you have moved the object where you want to place it, you can lift up the mouse button to \"drop\" the object in the new location.  If you are using a touchscreen device, you can select an item by simply touching it with your finger.  (Some interfaces may require you to hold your finger on the object for a second or two to select it.)  Then you drag the item by moving your finger across the screen to the location where you want to place it.  To drop the object, simply lift your finger off the screen.\nDrag and drop can be used for multiple purposes.  For example, you can drag and drop an icon on the desktop to move it to a folder.  You can drag and drop an open window by clicking the title bar and moving it to a new location.  Some programs allow you to open files by dragging and dropping file icons directly onto the application icon.  Many programs allow you to customize the workspace by dragging and dropping interface elements in different locations on the screen.  Computer games, like chess, typically allow you to move objects in the game using a drag and drop action.\nNOTE: Since drag and drop is a simple and intuitive way to work with objects, software programs often promote \"drag and drop editing\" capability, which implies the software is easy to use."
        ]
    },
    {
        "word": "Drive",
        "type": [],
        "definition": [
            "A drive is a computer component used to store data.  It may be a static storage device or may use removable media.  All drives store nonvolatile data, meaning the data is not erased when the power is turned off.\nOver the past several decades, drives have evolved along with other computer technologies.  Below is a list of different types of computer drives.\n\n5.25 inch floppy drive - uses flexible removable media drive, stores up to 800 KB per floppy disk, popular in the 1980s\n3.5 inch floppy drive - uses more rigid removable media, stores up to 1.44 MB per disk, popular in the 1990s\nOptical drive - uses removable optical media such as CDs (800 MB), DVDs (4.7 - 17 GB), and Blu-ray discs (25-50 GB), available in both read-only and writable models, popular in the 2000s\nFlash drive - a small, highly portable storage device that uses flash memory and connects directly to a USB port\nHDD (hard disk drive) - the most common internal storage device used by computers over the past several decades, can store several terabytes (TB) of data\nSSD (solid state drive) - serves the same purpose as a hard drive but contains no moving parts; uses flash memory and provides faster performance than a hard drive\n\nWhile there are many different types of drives, they are all considered secondary memory since they are not accessed directly by the CPU.  Instead, when a computer reads data from a drive, the data first gets sent to the RAM so that it can be accessed more quickly.  Even the fastest drives, likes SSDs, have much slower read\/write speeds than RAM.\nWhy are computer drives called \"drives?\"\nWhile an official answer remains elusive, a compelling reason is that early drives required a rotating device that would spin or \"drive\" the disk.  While some modern drives have no moving parts, the legacy term \"drive\" seems to have stuck."
        ]
    },
    {
        "word": "Drive-By Download",
        "type": [],
        "definition": [
            "A drive-by download is a download that happens automatically when you visit a webpage.  The download starts without you initiating it and may take place in the background without any notification.\nDrive-by downloads can occur on both legitimate and malicious websites.  For example, if a hacker gains access to a trusted website, he can install code on webpages that will initiate automatic downloads on visitors' computers.  Malicious websites, such as those used in phishing and pharming activities, may intentionally download malware on users computers.\nThere are multiple ways a webmaster can implement drive-by downloads in a webpage.  One method is to insert JavaScript code that automatically opens a downloadable file once the page has loaded.  Another method involves using an iframe that references another URL, which initiates the download.  A less common method is to use a browser plug-in or extension that downloads files automatically.  In rare cases, online advertisers can even insert code in display ads that initiate downloads on users computers.  Most ad networks now prevent this type of behavior.\nWhile drive-by downloads happen automatically, it is rare that the an executable file will run without your permission.  This is because most browsers notify you when a file has been downloaded and will not open downloaded files automatically.  Therefore, you can prevent damage from drive-by downloads by simply not opening unknown files downloaded by your web browser."
        ]
    },
    {
        "word": "Driver",
        "type": [],
        "definition": [
            "A driver, or device driver, is a software program that enables a specific hardware device to work with a computer's operating system.  Drivers may be required for internal components, such as video cards and optical media drives, as well as external peripherals, such as printers and monitors.\nMost modern hardware is \"plug and play,\" meaning the devices will work without requiring driver installation.  However, even if a hardware device is recognized by the operating system, installing the correct drivers may provide additional options and functionality for the device.  For example, most mice work automatically when they are connected to a PC.  However, installing the appropriate mouse driver may allow you to customize the function of each button and adjust the mouse sensitivity.  Some keyboard drivers allow you to assign functions to specific keys, such as controlling the volume or opening specific applications.\nThere are several different ways to install drivers.  For some devices, such as printers, the operating system may automatically find and install the correct drivers when the device is connected.  In other cases, drivers can be installed from a CD or DVD provided with the hardware.  If no disc is available, you can typically download the latest drivers from the manufacturer's website from either the \"Support\" or \"Downloads\" section.  Most downloadable drivers include an installer that automatically installs the necessary files when you open the downloaded file.\nFile extensions: .DRV, .DLL, .SYS, .KEXT"
        ]
    },
    {
        "word": "Drop Down Menu",
        "type": [],
        "definition": [
            "A drop down menu is horizontal list of options that each contain a vertical menu.  When you roll over or click one of the primary options in a drop down menu, a list of choices will \"drop down\" below the main menu.\nThe most common type of drop down menu is a menu bar.  On Windows systems, the menu bar is typically located at the top of each open window.  On Macintosh systems, it is fixed at the top of the screen.  When you click one of the options in the menu bar, such as \"File\", a list of options will appear below the menu, such as New, Open, Close, and Save.  You can click any of these options to select it.\nDrop down menus are also commonly used for website navigation.  Many websites use drop down menus to provide users with direct links to more pages than standard navigation bars allow.  For example, a news website may list several news categories in the main menu, such as Politics, Business, Sports, and Entertainment.  Each of these menu options may include several subcategories.  For example, the Sports menu may contain options such Baseball, Basketball, Football, Hockey, and Soccer.  By selecting a specific sport within the Sports menu, you can navigate to the section you want with one click, instead of having to visit the main Sports page first.\nWebsite drop down menus are typically created using DHTML (dynamic HTML), which may include a combination of HTML, CSS, and JavaScript code.  They can also be written as Flash applications.  While software program menus typically require you to click on the main menu to reveal the drop down options, website drop down menus often appear when you simply move the cursor over the main menu.  Clicking a main menu option at the top of a website drop down menu may open the main topic page (like the Sports page in the example above).  Regardless of how intuitive you find drop down menus to be, they can be a useful navigation tool once you get used to them."
        ]
    },
    {
        "word": "Dual Boot",
        "type": [],
        "definition": [
            "A dual boot system is a computer that can boot into two different operating systems.  While most computers automatically load a specific operating system (OS) at startup, a dual boot system allows you to choose what OS you would like to load.  For example, a dual boot Windows system may provide an option to load either Windows 7 or Windows 8 at startup.  Linux and Mac OS X users can install Windows to create a Linux\/Windows or Mac\/Windows dual boot configuration.\nDual boot systems are often used by computer enthusiasts, who prefer different operating systems for different tasks or want to run OS-specific applications.  Software developers also use dual boot systems to test their software on multiple operating systems.  A single dual boot system is more efficient than buying and setting up two separate computers.\nIn order to create a dual boot system, you first need to install a custom boot manager or \"boot loader.\"  This is a small program that loads near the beginning of the boot sequence before the OS loads.  Common PC boot loaders include LILO and GRUB, which support Linux and Windows.  Mac users can install Apple's Boot Camp utility.  In most cases, you will need to install each operating system on a separate partitions.  Linux installations may require multiple partitions just for the Linux OS.  While the disk partitioning can be done manually, it is typically accomplished using a dual boot utility like EasyBCD (Windows) or Boot Camp (Mac OS X).\nWhile many users still create dual boot machines, virtualization has become a more common way to run multiple operating systems on a single computer.  Unlike dual booting, virtualization allows you to run multiple operating systems at the same time and switch between them without restarting.  However, booting into a specific OS typically yields the best performance.\nNOTE: Dual boot may also be called \"multi boot,\" which refers to a computer than can load two or more different operating systems."
        ]
    },
    {
        "word": "Dual Processor",
        "type": [],
        "definition": [
            "Dual processor refers to a computer with two separate processors.  The processors work in tandem to process data using a technique called multiprocessing.  Instructions are split between the two processors (or CPUs), allowing the computer to perform faster than a similar machine with only one processor.\nIn theory, two CPUs can process twice as much data per second than a single CPU.  However, because the two processors share resources, such as L2 and L3 caches, busses, and system memory, there are bottlenecks that slow down the overall performance.  Also, programs must be written to take advantage of multiprocessing, meaning the performance of an application on a dual processor machine is dependent on how the application is written.  As a result, dual processor machines are noticeably faster than single processor machines, but rarely twice as fast.\nDual Processor vs Dual-Core\nDual processor is similar to dual-core, but different.  A dual processor computer has two separate CPUs, which are physically separated on the motherboard.  The two processors may share resources (like the CPU bus and cache), but are physically separate.  In a dual-core system, the two processors are combined into a single chip that may look like one processor.  Since the processors are combined into one entity, they may collectively be called a single dual-core CPU.\nWhile dual processor and dual-core have two different meanings, they are not mutually exclusive.  Some systems have two dual-core CPUs, totally four processing cores.  Desktop computers may have four, six, or eight separate processors.  High-end scientific computing machines can go way beyond dual processor configurations and may include dozens of processors."
        ]
    },
    {
        "word": "Dual-Core",
        "type": [],
        "definition": [
            "A dual-core processor is a CPU with two processors or \"execution cores\" in the same integrated circuit.  Each processor has its own cache and controller, which enables it to function as efficiently as a single processor.  However, because the two processors are linked together, they can perform operations up to twice as fast as a single processor can.\nThe Intel Core Duo, the AMD X2, and the dual-core PowerPC G5 are all examples of CPUs that use dual-core technologies.  These CPUs each combine two processor cores on a single silicon chip.  This is different than a \"dual processor\" configuration, in which two physically separate CPUs work together.  However, some high-end machines, such as the PowerPC G5 Quad, use two separate dual-core processors together, providing up to four times the performance of a single processor.\nWhile a dual-core system has twice the processing power of a single-processor machine, it does not always perform twice as fast.  This is because the software running on the machine may not be able to take full advantage or both processors.  Some operating systems and programs are optimized for multiprocessing, while others are not.  Though programs that have been optimized for multiple processors will run especially fast on dual-core systems, most programs will see at least some benefit from multiple processors as well."
        ]
    },
    {
        "word": "Dvorak Keyboard",
        "type": [],
        "definition": [
            "The Dvorak keyboard is a keyboard layout named after its designer, Dr. August Dvorak.  He designed the keyboard as alternative to the standard QWERTY keyboard layout, with the goal of improving typing ergonomics.\nDvorak developed the new keyboard layout after studying common typing patterns.  He determined the QWERTY layout, which was designed for telegraph operators and early typewriters, was inefficient.  It required awkward motions, didn't use the home row (ASDF) enough, and required many common key patterns to be typed with one hand.\nTo improve typing efficiency, Dvorak designed his keyboard layout to alternate keystrokes between left and right hands.  He also placed the most common letters in the home row.  For example, since nearly all words have vowels, the home row on the Dvorak keyboard begins with the letters AOEUI.  The vowel keys are placed next to each other since vowels often alternate with consonants.\nDvorak patented his keyboard layout in 1936, claiming layout offered the faster typing speeds, greater accuracy, and less fatigue than the QWERTY keyboard.  Despite these benefits, the Dvorak keyboard has never achieved the popularity of the QWERTY layout.  Most people still learn to type on a QWERTY keyboard and simply do not want to relearn a new keyboard layout.  Therefore, nearly all desktop computers and laptops sold in Western countries come with QWERTY keyboards.\nNOTE: The original version of the Dvorak keyboard is also known as the Dvorak Simplified Keyboard (DSK).  In 1982, ANSI standardized a slight variation of the Dvorak keyboard layout, called the American Simplified Keyboard (ASK)."
        ]
    },
    {
        "word": "Dynamic Website",
        "type": [],
        "definition": [
            "Dynamic websites contain Web pages that are generated in real-time.  These pages include Web scripting code, such as PHP or ASP.  When a dynamic page is accessed, the code within the page is parsed on the Web server and the resulting HTML is sent to the client's Web browser.\nMost large websites are dynamic since they are easier to maintain than static websites.  This is because static pages each contain unique content, meaning they must be manually opened, edited, and published whenever a change is made.  Dynamic pages, on the other hand, access information from a database.  Therefore, to alter the content of a dynamic page, the webmaster may only need to update a database record.  This is especially helpful for large sites that contain hundreds or thousands of pages.  It also makes it possible for multiple users to update the content of a website without editing the layout of the pages.\nDynamic websites that access information from a database are also called database-driven websites."
        ]
    }
]