[
    {
        "word": "E-commerce",
        "type": [],
        "definition": [
            "E-commerce (electronic-commerce) refers to business over the Internet.  Web sites such as Amazon.com, Buy.com, and eBay are all e-commerce sites.  The two major forms of e-commerce are Business-to-Consumer (B2C) and Business-to-Business (B2B).  While companies like Amazon.com cater mostly to consumers, other companies provide goods and services exclusively to other businesses.  The terms \"e-business\" and \"e-tailing\" are often used synonymously with e-commerce.  They refer to the same idea; they are just used to confuse people trying to learn computer terms."
        ]
    },
    {
        "word": "E-learning",
        "type": [],
        "definition": [
            "E-learning or \"electronic learning\" is an umbrella term that describes education using electronic devices and digital media.  It encompasses everything from traditional classrooms that incorporate basic technology to online universities.\nE-learning in a traditional setting may include educational films and PowerPoint presentations.  These types of media can provide students with content that is more dynamic and engaging than textbooks and a whiteboard.  Edutainment, or content that is designed to be educational and entertaining, may be used to keep students' attention while providing knowledge about a particular topic.  A documentary film, for example, may be both engaging and informative.\nWhile some classrooms incorporate digital technology, others are designed around it.  A Classroom Performance System (CPS), for example, provides a completely digital learning environment.  It includes a projector for displaying videos and web content and a digital chalkboard for the instructor.  Students can complete quizzes and tests using digital response pads rather than handing in papers.  The paperless environment provides an efficient way for students to learn and ensures teachers always have the latest instructional materials.\nOnline education is another common form of e-learning.  Many colleges and universities now allow students to submit assignments and complete tests online.  Some educational institutions are 100% online, meaning students never have to attend class inside a physical classroom.  In order to maintain a sense of community,  online universities often provide and even require students to participate in online discussions using Moodle or another virtual learning environment.\nOnline classes are typically administered by an accredited professor who may give live or recorded lectures that students can watch online.  The professor also grades students' assignments and is available to answer individual questions.  In most cases, credits earned online are equivalent to those earned in a traditional classroom setting."
        ]
    },
    {
        "word": "E-mail Bankruptcy",
        "type": [],
        "definition": [
            "In this day and age, most of us receive several e-mails a day.  Depending on your job, you may even receive dozens of daily messages that are not spam.  While it is hard enough to keep up with this plethora of e-mails received in a single day, if you fall behind a few days, it can be nearly impossible to catch up.  After awhile, you may end up with hundreds of messages in your inbox that have not been replied to.\nIf your become submerged underneath an endless pile of e-mail in your inbox, the only way out may be to declare e-mail bankruptcy.  Similar to a financial bankruptcy, e-mail bankruptcy involves writing off the losses and starting over.  The most tactful way of declaring e-mail bankruptcy is to paste all the e-mail addresses from the messages you have not responded to into a single message.  Then send a message explaining that you have fallen too far behind on your e-mail and apologize for not responding.  The quicker, but less considerate option is to simply delete all the old messages and start over like nothing ever happened.\nWhile it is best to avoid e-mail bankruptcy by keeping up with your e-mail, for some people it may be the only way to get current with their correspondence.  If you are in a situation where you feel overwhelmed by the growing number of messages in your inbox, make sure you first reply to the most important messages.  Then, as a last resort, declaring e-mail bankruptcy may give you the fresh start you need.\n"
        ]
    },
    {
        "word": "E-reader",
        "type": [],
        "definition": [
            "An e-reader, or \"e-book reader,\" is a portable hardware device designed for reading digital publications.  These include e-books, electronic magazines, and digital versions of newspapers.  Since textual data does not require a lot of storage space, most e-readers can store thousands of books and other publications.  Just like an iPod can store an entire music library, a single e-reader can store a large collection of books.\nDozens of different e-readers are available, but some of the most popular ones include the Amazon Kindle, the Barnes and Noble Nook, and the Sony Reader.  These devices all support a wide range of eBook formats and can download content over a wireless network.  Many e-readers have a monochrome display, often called \"electronic paper,\" while others have a full-color backlit display.  While the electronic paper displays do not provide color images, the screen appears more like a paper page from a book, and it can be easily viewed in bright sunlight.\nTablets, such as the Apple iPad, the BlackBerry PlayBook, and the Amazon Kindle Fire are often considered e-readers, since they can be used for reading digital publications.  However, it is more accurate to refer to these devices as tablets that can be used as e-readers since they are not designed primarily as digital readers.  Tablets offer more capabilities than e-readers, but e-readers are often better suited for just reading e-books."
        ]
    },
    {
        "word": "ECC",
        "type": [],
        "definition": [
            "Stands for \"Error Correction Code.\"  ECC is used to verify data transmissions by locating and correcting transmission errors.  It is commonly used by RAM chips that include forward error correction (FEC), which ensures all the data being sent to and from the RAM is transmitted correctly.\nECC RAM or memory is similar to parity RAM, which includes a parity bit that validates the data being sent.  The parity bit is a redundant binary value of 1 or 0 that is sent along with the data.  If the parity bit does not match the value of the data it represents, it indicates an error in the transmission and the data may need to be resent.  ECC works in a similar way, but uses a more advanced error correction system that can correct data transmission errors on the fly.\nSince ECC memory requires more processing, it can be slower than non-ECC RAM and basic parity RAM.  However, ECC RAM provides more reliable data transfers, which results is greater system stability.  Therefore, high-end servers and workstations may use ECC memory to minimize crashes and system downtime."
        ]
    },
    {
        "word": "EDI",
        "type": [],
        "definition": [
            "Stands for \"Electronic Data Interchange.\"  EDI is a standardized method for transferring data between different computer systems or computer networks.  It is commonly used for e-commerce purposes, such as sending orders to warehouses, tracking shipments, and creating invoices.\nBecause may online retailers sell products that they do not physically stock, it is important to have an easy way to transfer order information to the locations where the goods are stored.  EDI makes this possible.  Some common EDI formats include X12 (U.S.), TRADACOMS (U.K.), and EDIFACT (International)."
        ]
    },
    {
        "word": "EIDE",
        "type": [],
        "definition": [
            "Stands for \"Enhanced Integrated Drive Electronics.\"  EIDE is an improved version of the IDE drive interface that provides faster data transfer rates than the original standard.  While the original IDE drive controllers supported transfer rates of 8.3 Mbps, EIDE can transfer data up to 16.6 Mbps, which is twice as fast.\nThe term EIDE can be a bit ambiguous, since it technically refers to an ATA standard known as ATA-2 or Fast ATA.  Therefore, the terms EIDE, ATA-2, and Fast ATA may be used synonymously.  To add to the confusion, EIDE may also refer to the ATA-3 standard, which is similar to ATA-2, but includes additional features.  ATA-3 supports the same maximum data transfer rate as ATA-2, but has SMART support and uses a 44 pin connector.\nWhile EIDE was the most common drive controller used for many years, it has since been replaced by updated versions of the ATA standard that support Ultra DMA.  These include the ATA-4 through ATA-7 standards, which provide data throughput rates from 33 to 133 Mbps.  Most modern computers use a completely new standard called \"Serial ATA,\" or SATA, which supports even faster transfer rates."
        ]
    },
    {
        "word": "EOL",
        "type": [],
        "definition": [
            "Stands for \"End Of Life.\"  EOL, pronounced \"E-O-L,\" is commonly used in information technology to describe a product that is no longer maintained or supported.  It may refer to either hardware or software.\nHardware\nHardware companies often label products as EOL several years after production has ended.  When a device reaches EOL status, the company ends official support, no longer providing technical help or hardware repairs.\nEven if a company labels a product as EOL (or marks it \"obsolete\"), it may be possible to have the product repaired by a third-party service center.\nHardware products typically reach EOL status 5 to 10 years after they are produced.  The length of time depends on both the product and the manufacturer.  Well-established companies typically provide longer support periods.  Products that are frequently refreshed, such as smartphones and laptops, may be \"EOLed\" more quickly than other products.  Devices that are only updated every few years may be supported for more than a decade.\nSoftware\nEOL status also applies to software, such as operating systems and software applications.  When software is marked as EOL, it will still function.  However, the developer no longer provides updates or technical support.  In most cases, the development team will not fix additional bugs and the software may be incompatible with new hardware devices.  Software products may be EOLed based on time (such as three years after the last update) or based on major version releases.  For example, a developer may only support the two most recent versions of a software program and mark older versions as EOL.\nBoth hardware and software companies use EOL as a means of clarifying which products they currently support.  It allows hardware manufacturers to stop producing replacement parts for old products and focus on supporting new models.  For software developers, it enables them to focus on new and future versions of their programs, rather than supporting apps released several years ago.\nNOTE: EOL also stands for \"End Of Line,\" a computer science term that marks the end of a line of text."
        ]
    },
    {
        "word": "EPS",
        "type": [],
        "definition": [
            "Stands for \"Encapsulated PostScript.\"  EPS is a PostScript image file format that is compatible with PostScript printers and is often used for transferring files between various graphics applications.  EPS files will print identically on all PostScript-compatible printers and will appear the same in all applications that can read the PostScript format.\nAs the name implies, EPS files contain PostScript code, which is used for storing font and vector image information.  Vector images are usually drawings created by programs such as Adobe Illustrator and CorelDRAW.  EPS files may also include a rasterized version of the image used for previewing the contents of the file.\nFile extension: .EPS"
        ]
    },
    {
        "word": "ERP",
        "type": [],
        "definition": [
            "Stands for \"Enterprise Resource Planning.\"  ERP is an umbrella term that covers all the resources of an enterprise business.\nWhen used as an adjective, ERP describes specific products or processes, e.g., ERP software, ERP management, and ERP insights.  When used as a noun, ERP refers to the integration of enterprise business processes.  For example, it may encompass the accounting, human resource, and sales operations of an enterprise organization.\nERP Software\nIn the IT world, ERP commonly refers to business management software.  Most ERP software is cloud-based, meaning it runs on a server and is accessible over the Internet.  Benefits of cloud-based software include:\n\nCentralized data storage\nReal-time updates\nConsistent look and feel for all users\nEasily upgradable\nRemotely accessible\n\nThese benefits are significant to large organizations, such as enterprise companies.  A centralized system makes it possible for global businesses to operate efficiently.  For example, a project manager in California can check supply chain status in Taiwan and send updates to a team in Singapore using a single ERP system.\nConsolidating processes also makes it easier for businesses to analyze data and adapt as needed.  For example, ERP software that integrates e-commerce and business intelligence (BI) can provide customer insights without requiring third-party analytics tools.\nExamples of ERP Software\n\nSAP Business One\nOracle NetSuite\nMicrosoft Dynamics\n"
        ]
    },
    {
        "word": "EUP",
        "type": [],
        "definition": [
            "Stands for \"Enterprise Unified Process.\"  EUP is a software development methodology that helps companies create software in an structured and organized manner.  It is an extension of the Rational Unified Process (RUP), adding two new development phases -- Production and Retirement.  Since the RUP includes four phases, the EUP consists of six phases:\n\nInception - The idea for the project is stated.  The development team determines if the project is worth pursuing and what resources will be needed.\n\nElaboration - The project's architecture and required resources are further evaluated.  Developers consider possible applications of the software and costs associated with the development.\n\nConstruction - The project is developed and completed.  The software is designed, written, and tested.\n\nTransition - The software is released to the public.  Final adjustments or updates are made based on feedback from end users.\n\nProduction - Software is kept useful and productive after being released to the public.  Developers make sure the product continues to run on all supported systems and support staff provides assistance to users. \n\nRetirement - The product is removed from production, often called \"decommissioning.\"  It can either be replaced or simply no longer supported.  The release of a new version of software often coincides with the retirement phase of an older version.\n\n\nFor more information on the EUP, visit the Enterprise Unified Process Home Page."
        ]
    },
    {
        "word": "EXIF",
        "type": [],
        "definition": [
            "Stands for \"Exchangeable Image File Format.\"  EXIF is a standard means of tagging image files with metadata, or additional information about the image.  It is supported by both the TIFF and JPEG formats, but is most commonly seen in JPEG images captured with digital cameras.\nWhen you take a picture with a digital camera, it automatically saves EXIF data with the photo.  This typically includes the exposure time (shutter speed), f-number (aperture), ISO setting, flash (on\/off), and the date and time.  Some cameras may save additional EXIF data, such as the brightness value, white balance setting, metering mode, and sensing method.  Many smartphones and some newer digital cameras also include GPS information, which is used for \"geotagging\" photos.\nWhen you view a digital photo on your computer, the EXIF data is typically hidden by default.  Therefore, you may need to select an option such as \"Get Info,\" \"View Properties,\" or \"Show Inspector\" from within your photo viewing application in order to view the EXIF data.  In Photoshop, for example, you can select File &rarr; File Info…, then click the \"Advanced\" tab to view the EXIF properties.\nNOTE: The PNG and GIF image formats do not support EXIF data."
        ]
    },
    {
        "word": "Edge Caching",
        "type": [],
        "definition": [
            "Edge caching is a mechanism content delivery networks (CDNs) use to cache Internet content in different locations around the world.  Examples include website data, cloud storage, and streaming media.  By storing copies of files in multiple \"edge\" locations, a CDN can deliver content to users more quickly than a single server can.\nCDNs may have tens or hundreds of global data centers.  Each data center contains edge servers that intelligently serve data to nearby users.  In most cases, edge servers \"pull\" data from an origin server when users request content for the first time.  Once an edge server pulls an image, video, or another object, it caches the file — typically for a few days or weeks.  The CDN then serves subsequent requests from the edge server rather than the origin.\nTiered Caching\nA CDN may automatically propagate newly pulled content to all servers or wait for each server to request the data.  Automatic propagation reduces trips to the origin server but may result in unnecessary duplication of rarely-accessed files.  Waiting for local requests is more efficient but increases trips to the origin server.  Modern CDNs use tiered caching to balance the two methods.  The first time a user accesses a file, the CDN caches it on the local edge server and several \"primary data centers.\"  It reduces unnecessary propagation of cached files and limits trips to the origin server.\nCDNs provide customizable cache settings, such as how frequently to check for updated files or when to let cached files expire.  Most have a \"purge\" feature, which allows webmasters to remove old content from all edge servers at once.  Purging files is useful when updating static assets, such as CSS documents and image files.\nEdge Caching Benefits\nEdge caching reduces latency, providing faster and more consistent delivery of Internet content to users around the world.  For example, a user in Sydney, Australia, may experience a two-second delay when accessing a server in Houston, Texas.  If the data is cached in Australia, the delay may be less than one-tenth of a second.\nWhile the primary purpose of edge caching is to improve content delivery speed, it also provides two other significant benefits: bandwidth reduction and redundancy.\nEdge caching reduces Internet bandwidth by shortening the distance data needs to travel to each user.  Local edge servers reduce Internet congestion and limit traffic bottlenecks.  Replicating data across multiple global data centers also provides redundancy.  While CDNs typically pull data from an origin server, individual data centers can serve as backups if the origin server fails or becomes inaccessible."
        ]
    },
    {
        "word": "Edge Server",
        "type": [],
        "definition": [
            "An edge server is a computer located at the \"edge\" of the Internet, serving users in a specific area.  CDNs and edge computing services use edge servers to provide Internet content and computing power as fast as possible.\nEdge servers are distributed around the world at locations called points of presence, or PoPs.  By placing servers closer to users, latency is reduced, and Internet users can access data more quickly.  For example, if someone in Tokyo accesses a website hosted in New York, the ping may be over half a second, causing a delay before the webpage loads.  If the content is hosted on an edge server in Tokyo, the ping may be only a few milliseconds, allowing the webpage to load much faster.\nCDN Edge Servers\nContent delivery networks, or CDNs, use edge servers to cache content, such as websites and streaming media.  They retrieve data from an origin server, then replicate it globally across the edge network.  When a user in Brasil accesses a website with an origin server in England, the CDN may serve the content from an edge server in Rio de Janeiro.\nCDNs often host static assets, such as CSS, JavaScript, and image files.  However, they can also cache and serve HTML.  Pages with dynamic content must be regularly refreshed or \"purged\" so users do not receive outdated pages stored in the CDN cache.\nEdge Computing Servers\nEdge computing networks use edge servers to perform calculations in different locations worldwide.  Handing computation tasks closer to the source of each request reduces roundtrip delays and provides faster response times.  Examples include online ad targeting, video conferencing, and multiplayer gaming.\nWhile edge servers provide users faster access to Internet content, they also have a secondary benefit — reducing Internet traffic.  Since edge servers deliver content and computing power from locations close to each user, they decrease the data travel and total bandwidth required for each request."
        ]
    },
    {
        "word": "Edtech",
        "type": [],
        "definition": [
            "Edtech is short for \"educational technology.\"  It refers to any technology used for educational purposes.  Other industry-specific terms include biotech, medtech, and fintech.\nEdtech includes hardware, such as Chromebooks and tablets, and software, such as educational apps for PCs and mobile devices.  It also includes collaboration tools such as Moodle, Canvas, and Google Classroom.\nFrom elementary schools to universities, educational institutions use edtech to provide modern teaching methods.  Classroom performance systems, for example, combine several educational technologies to create an interactive learning environment.  Instead of taking quizzes with paper and pencil, students can answer questions in real-time using a laptop or tablet.  Edutainment tools, such as videos and games, help keep students engaged.\nModern Edtech Trends\nIn 2020, remote learning replaced in-person education as the pandemic forced students and teachers to stay at home.  Virtual learning environments, or VLEs, quickly replaced physical classrooms so students could learn online.\nWhile teachers and students eventually returned to schools, 2020 marked a leap forward in remote learning technologies.  Many of these technologies, such as Zoom meetings and online classroom portals, continue to be used today.\nNOTE: Edtech may also be written \"EdTech\" or \"EduTech.\"  However, \"edtech\" has become increasingly common because it is consistent with similar terms, such as \"fintech\" and \"biotech.\"\n"
        ]
    },
    {
        "word": "Edutainment",
        "type": [],
        "definition": [
            "Edutainment combines the words \"education\" and \"entertainment.\"  It refers to any form of entertainment that is educational.  The goal of edutainment is to make learning enjoyable and fun.\nEdutainment is found inside and outside of classrooms and exists across several types of media.  Some are passive, while others are interactive.  Examples of passive forms of edutainment include:\n\nFictional books with educational themes\nMovies and TV shows with entertaining characters who teach viewers\nMusic and songs that help people learn\nFictional radio shows and podcasts designed to educate listeners\n\nExamples of interactive edutainment include:\n\nVideo games designed to educate players\nQuizzes that provide goals and rewards as users progress through each level\nSoftware that allows users to compete against each other in learning exercises\nEducational websites with interactive elements, such as clickable images and animations\n\nEdutainment may be used to teach nearly any topic, including math, language, history, geography, and science.  For example, teachers may use entertaining science videos to help students learn new concepts.  Parents can use math or language software to help kids learn at home.  By creating a fun learning environment, edutainment can make education easier and enjoyable."
        ]
    },
    {
        "word": "El Capitan",
        "type": [],
        "definition": [
            "El Capitan is the 12th version of Apple OS X, also known as OS X 10.11.  It was released on September 30, 2015 and succeeded OS X 10.10 Yosemite.  It was followed by OS X 10.12 Sierra.\nOS X 10.11 was not a significant update to Apple's operating system, but it included a number of performance updates.  It was the first version to include \"Metal,\" a graphics technology developed by Apple that accelerates Core Animation and Core Graphics processing.  Metal makes full use of the CPU and GPU, boost system-level rendering by up to 50 percent.  El Capitan also added \"System Integrity Protection\" (SIP), which protects files and directories from unauthorized modification.\nWhile El Capitan was primarily a performance update to OS X, it did include a few new features.  For example, it introduced \"split view\" for windows, which snaps a window to half the screen's width when you press and hold the green zoom button in the title bar.  It also introduced text formatting in the Notes app and improved syncing with Notes and other applications that support iCloud.  OS X 10.11 also added support for numerous gestures in Mail, Messages, and Safari.  These gestures, such as swiping back or forward with more than one finger can done using the trackpad on a laptop or an external input device, such as Apple's Magic Trackpad.\nNOTE: El Capitan is a rock formation within Yosemite National Park in California.  Apple likely chose this name for OS X 10.11 since El Capitan was designed to be a refinement to Yosemite (10.10), rather than a major update."
        ]
    },
    {
        "word": "Email",
        "type": [],
        "definition": [
            "Email, short for \"electronic mail,\" is one of the most widely used features of the Internet, along with the web.  It allows you to send and receive messages to and from anyone with an email address, anywhere in the world.\nEmail uses multiple protocols within the TCP\/IP suite.  For example, SMTP is used to send messages, while the POP or IMAP protocols are used to retrieve messages from a mail server.  When you configure an email account, you must define your email address, password, and the mail servers used to send and receive messages.  Fortunately, most webmail services configure your account automatically, so you only need to enter your email address and password.  However, if you use an email client like Microsoft Outlook or Apple Mail, you may need to manually configure each account.  Besides the email address and password, you may also have to enter the incoming and outgoing mail servers and enter the correct port numbers for each one.\nThe original email standard only supported plain text messages.  Eventually, email evolved to support rich text with custom formatting.  Today, email supports HTML, which allows emails to be formatted the same way as websites.  HTML email messages can include images, links, and CSS layouts.  You can also send files or \"email attachments\" along with messages.  Most mail servers allow you to send multiple attachments with each message, but they limit the total size.  In the early days of email, attachments were typically limited to one megabyte, but now many mail servers support email attachments that are 20 megabytes in size or more.\nEmail Netiquette\nWhen composing an email message, it is important to use good netiquette.  For example, you should always include a subject that summarizes the topic of the email.  It is also helpful to begin each message with the recipient's name and end the message with your name or \"signature.\"  A typical signature includes your name, email address, and\/or website URL.  A professional signature may include your company name and title as well.  Most email programs allow you to save multiple signatures, which you can insert at the bottom of an email.\nIf you want to send an email to multiple recipients, you can simply add each email address to the \"To\" field.  However, if the email is primarily intended for one person, you should place the additional addresses in the \"CC\" (carbon copy) field.  If you are sending an email to multiple people that don't know each other, it is best to use the \"Bcc\" (blind carbon copy) field.  This hides the email addresses of each recipient, which helps prevent spam.\nNOTE: Email was originally written \"e-mail,\" but is now more commonly written as \"email\" without the dash."
        ]
    },
    {
        "word": "Email Address",
        "type": [],
        "definition": [
            "An email address is a unique identifier for an email account.  It is used to both send and receive email messages over the Internet.  Similar to physical mail, an email message requires an address for both the sender and recipient in order to be sent successfully.\nEvery email address has two main parts: a username and domain name.  The username comes first, followed by an at (@) symbol, followed by the domain name.  In the example below, \"mail\" is the username and \"techterms.com\" is the domain name.  \nmail@techterms.com\nWhen a message is sent (typically through the SMTP protocol), the sending mail server checks for another mail server on the Internet that corresponds with the domain name of the recipient's address.  For example, if someone sends a message to a user at techterms.com, the mail server will first make sure there is a mail server responding at techterms.com.  If so, it will check with the mail server to see if the username is valid.  If the user exists, the message will be delivered.\nEmail Address Formatting\nWhile a basic email address consists of only a username and domain name, most email clients and webmail systems include names with email addresses.  An email address that contains a name is formatted with the name first, followed by the email address enclosed in angle brackets, as shown below.\nFull Name &lt;user@domain.com&gt;\nEmail can be sent to recipients with or without a name next to the email address.  However, emails sent to addresses that include a name are less likely to be filtered as spam.  Therefore, it is a good idea to fill in your full name when setting up an email account.  Most mail clients and webmail systems will automatically include your name in your sending email address.\nNOTE: When manually typing an email address into the To: field, it is a good idea to use the \"Full Name\" formatting as shown above and include the person's name before the email address.  This will help prevent the message from being incorrectly flagged as spam."
        ]
    },
    {
        "word": "Email Bomb",
        "type": [],
        "definition": [
            "An email bomb or \"mail bomb\" is a malicious act in which a large number of email messages are sent to a single email address in a short period of time.  The purpose of an email bomb is typically to overflow a user's inbox.  In some cases, it will also make the mail server unresponsive.\nEmail bombing is often done from a single system in which one user sends hundreds or thousands of messages to another user.  In order to send the messages quickly, the email bomber may use a script to automate the process.  By sending emails with a script, it is possible to send several thousand messages per minute.\nIf performed successfully, an email bomb will leave the recipient with a pile of email messages in his or her inbox.  It may also max out the recipient's email quota, preventing the user from receiving new email messages.  The result is a frustrating situation where the user has to manually delete the messages.  If the recipient's email client or webmail system does not allow the user to select all the unwanted messages at once, this process can take a long time to complete.\nFortunately, most mail servers are capable of detecting email bombs before a large number of messages are sent.  For example, if the server detects that more than ten messages are received from the same email address within one minute, it may block the sender's email address or IP address.  This simple action will stop the email bomb by rejecting additional emails from the sender."
        ]
    },
    {
        "word": "Emoji",
        "type": [],
        "definition": [
            "An emoji is a small icon that can be placed inline with text.  The name \"emoji\" comes from the Japanese phrase \"e\" (絵) and \"moji\" (文字), which translates to \"picture character.\"\nSince 2010, the popularity or emojis have grown rapidly.  They are commonly used in text messaging, social media, and in apps like Instagram and Snapchat.  They have largely replaced emoticons as the standard way to express an emotion in a message or comment.\nWhile smiley faces are the most commonly used emojis, they can also represent people, places, animals, objects, flags, and symbols.  By inserting emojis into a message, you can emphasize a feeling or simply replace words with symbols.  For example, instead of writing, \"I love coffee; it makes me happy,\" you could simply write:\nI ❤️ ☕️ ☺️.\nHow Emojis Work\nEmojis can be inserted inline with text because each icon corresponds to a Unicode value for a specific character.  Inserting an emoji is just like typing a letter or symbol on your keyboard.  However, in order for the emoji to be displayed, it must be supported by the operating system (OS).  In other words, the OS must recognize the Unicode value and have an emoji that corresponds to it.  If no emoji is found, either a blank space or an empty box will be displayed.\nApple's iOS was the first major OS to offer system-level support, so Apple's database of emojis has historically been larger than those found on Android and Windows devices.  Therefore, if you send an emoji recently added to Apple's database to a user with an Android device, he may only see an empty box on his device.\nNOTE: While the Unicode values for emojis has become standardized across platforms, there is no central database of emoji icons.  Therefore, each platform displays different images for each emoji.  For example, the \"Smiling face\" emoji will look different on Mac, Windows, and Android devices.  Additionally, the way to insert emojis varies between operating systems, such as Windows and OS X."
        ]
    },
    {
        "word": "Emoticon",
        "type": [],
        "definition": [
            "The term emoticon comes from \"emotion and icon\" and refers to facial expressions represented by keyboard characters.  For example, the emoticon :-) represents a happy face and :-( represents a sad face.  By inserting an emoticon into a message, you can help the recipient better understand the feeling you want to get across.\nWhile most emoticons represent expressions, they have branched out to symbolize many other things, such as people, animals, objects, and actions.  Some emoticons are meant to be read left-to-right, while others are displayed vertically.  Below are examples of different types of emoticons:\n\n:-D - very happy\no.O - confused\n=^.^= - cat\n:o3 - dog\n*"
        ]
    },
    {
        "word": "Emulation",
        "type": [],
        "definition": [
            "The term \"emulation\" comes from the verb \"emulate,\" which means to imitate or reproduce.  Therefore, computer emulation is when one system imitates or reproduces another system.  This can be done using hardware, software, or a combination of the two.  However, since hardware is expensive to reproduce, most emulation is done via software.\nOne of the most common types of software emulation involves running different operating systems in a virtual environment.  For example, programs like Parallels Desktop, VMware, and Apple's Boot Camp allow Windows and other operating systems to run on an Intel-based Macintosh computer.  Sun Microsystems' xVM VirtualBox allows multiple operating systems to be run on Windows, Mac, and Unix platforms.  These applications are collectively referred to as software emulators, since they emulate different computer systems.\nAnother popular type of software emulation allows console video games, such as Nintendo, Sega, and PlayStation games, to be run on a PC.  The program ZSNES, for example, allows Super Nintendo (SNES) games to be played on a Windows or Unix machine.  The Visual Boy Advance emulator allows users to play Game Boy Advance games on Windows or Macintosh computers.  Games for these emulators are saved as ROM files, which are exact copies of a game cartridge or disk.  Therefore, instead loading a physical cartridge, video game emulators simply load ROM files from the computer's hard drive.\nA third type of emulation uses a type of file called a disk image.  While ROM files are used to emulate game cartridges, disk images can be used to emulate optical media and physical hard disk.  For example, an .ISO file (Windows) or .DMG file (Mac) can be mounted on the desktop, which makes the operating system view the file as a physical disk.  This provides an easy way to make exact copies of CDs, DVDs, and hard disks.  Disk images are also commonly used to create virtual installer disks that can't be modified by the user."
        ]
    },
    {
        "word": "Encoding",
        "type": [],
        "definition": [
            "Encoding is the process of converting data from one form to another.  While \"encoding\" can be used as a verb, it is often used as a noun, and refers to a specific type of encoded data.  There are several types of encoding, including image encoding, audio and video encoding, and character encoding.\nMedia files are often encoded to save disk space.  By encoding digital audio, video, and image files, they can be saved in a more efficient, compressed format.  Encoded media files are typically similar in quality to their original uncompressed counterparts, but have much smaller file sizes.  For example, a WAVE (.WAV) audio file that is converted to an MP3 (.MP3) file may be 1\/10 the size of the original WAVE file.  Similarly, an MPEG (.MPG) compressed video file may only require a fraction of the disk space as the original digital video (.DV) file.\nCharacter encoding is another type of encoding that encodes characters as bytes.  Since computers only recognize binary data, text must be represented in a binary form.  This is accomplished by converting each character (which includes letters, numbers, symbols, and spaces) into a binary code.  Common types of text encoding include ASCII and Unicode.\nWhenever data is encoded, it can only be read by a program that supports the correct type of encoding.  For audio and video files, this is often accomplished by a codec, which decodes the data in real-time.  Most text editors support multiple types of text encoding, so it is rare to find a text file that will not open in a standard text editor.  However, if a text editor does not support the encoding used in a text document, some or all of the characters may appear as strange symbols rather than the intended text."
        ]
    },
    {
        "word": "Encryption",
        "type": [],
        "definition": [
            "Encryption is the process of converting data to an unrecognizable or \"encrypted\" form.  It is commonly used to protect sensitive information so that only authorized parties can view it.  This includes files and storage devices, as well as data transferred over wireless networks and the Internet.\nYou can encrypt a file, folder, or an entire volume using a file encryption utility such as GnuPG or AxCrypt.  Some file compression programs like Stuffit Deluxe and 7-Zip can also encrypt files.  Even common programs like Adobe Acrobat and Intuit TurboTax allow you to save password-protected files, which are saved in an encrypted format.\nAn encrypted file will appear scrambled to anyone who tries to view it.  It must be decrypted in order to be recognized.  Some encrypted files require a password to open, while others require a private key, which can be used to unlock files associated with the key.\nEncryption is also used to secure data sent over wireless networks and the Internet.  For example, many Wi-Fi networks are secured using WEP or the much stronger WPA encryption.  You must enter a password (and sometimes a username) to connect to a secure Wi-Fi network, but once you are connected, all the data sent between your device and the wireless router will be encrypted.\nMany websites and other online services encrypt data transmissions using SSL.  Any website that begins with \"https:\/\/,\" for example, uses the HTTPS protocol, which encrypts all data sent between the web server and your browser.  SFTP, which is a secure version of FTP, encrypts all data transfers.\nThere are many different types of encryption algorithms, but some of the most common ones include AES (Advanced Encryption Standard), DES (Data Encryption Standard), Blowfish, RSA, and DSA (Digital Signature Algorithm).  While most encryption methods are sufficient for securing your personal data, if security is extremely important, it is best to use a modern algorithm like AES with 256-bit encryption."
        ]
    },
    {
        "word": "End User",
        "type": [],
        "definition": [
            "An end user is the person that a software program or hardware device is designed for.  The term is based on the idea that the \"end goal\" of a software or hardware product is to be useful to the consumer.  The end user can be contrasted with the developers or programmers of the product.  End users are also in a separate group from the installers or administrators of the product.\nTo simplify, the end user is the person who uses the software or hardware after it has been fully developed, marketed, and installed.  It is also the person who keeps calling the \"IT guy\" with questions about why the product isn't working correctly.  Generally, the terms \"user\" and \"end user\" mean the same thing."
        ]
    },
    {
        "word": "Endianness",
        "type": [],
        "definition": [
            "Endianness is a computer science term that describes how data is stored.  Specifically, it defines which end of a multi-byte data type contains the most significant values.  The two types of endianness are big-endian and little-endian.\nBig-Endian\nBig-endian is the most common way to store binary data.  It places the most significant (or largest) value first, followed by less significant values.  For example, the big-endian representation of the integer 123 places the hundreds value (1) first, followed by the tens value (2), then the ones value (3), or [123].\nLittle-Endian\nLittle-endian stores the least-significant value first, followed by increasingly more significant values.  For example, the number 123  in little-endian notation is [321].  The text string \"ABC\" is represented as [CBA].\nEndian Conversion\nIn most cases, developers do not have to specify endianness since the compiler generates the correct type of data for a specific platform.  However, a program may need to process external input, such as a file format that stores data with a different endianness.  In this case, the data must be converted from little-endian to big-endian or vice versa.\nConverting endianness is not as simple as reversing the data.  The bytes, rather than the bits, must be reversed.  In other words, each byte (or block of eight bits) must remain the same, but the order of the bytes is changed.  This can be explained using the hexadecimal or binary representation of data.\nFor example, the integer 41,394 is represented in big-endian notation as:\nhexadecimal: A1B2\nbinary: 1010000110110010\nConverting this data to little-endian does not reverse the data, but rather the individual bytes within the data.  Hexadecimal uses two digits to represent each byte – [A1][B2], while binary uses eight digits – [10100001][10110010].\nTherefore, the little-endian representation of 41,394 is:\nhexadecimal: B2A1\nbinary: 1011001010100001\nNOTE: Some processors can fetch data as either big-endian or little-endian with no conversion required.  This is called bi-endian data access."
        ]
    },
    {
        "word": "Enterprise",
        "type": [],
        "definition": [
            "In the IT world, enterprise refers to large businesses and organizations.  It is often used to describe hardware, software, and technical services that are aimed at business customers.\nEnterprise hardware includes telecommunications systems such as large-scale network equipment, telephone systems, and SIP devices.  It also includes server farms and infrastructure used for cloud computing.  Though enterprise hardware often describes large-scale hardware systems, it may also refer to an individual device, such as as workstation or laptop designed specifically for business purposes.\nEnterprise software, also called enterprise application software (EAS), refers to software developed for businesses, non-profit organizations, and educational institutions.  Examples of enterprise programs include accounting software like Intuit QuickBooks, project management programs like Microsoft Project, database management systems like Microsoft SQL Server, and content management systems like IBM Information Management solutions.  Some applications are offered in multiple editions and may include an \"Enterprise\" edition that is designed specifically for large organizations.\nExamples of technical services that fall under the enterprise category include network installation and monitoring, business telephony services, and private and public cloud systems.  Small-scale enterprise services include VPN setup, data backup, and web hosting.  These services often include a combination of enterprise hardware and software that companies may either purchase, lease, or rent as part of the service agreement."
        ]
    },
    {
        "word": "Enum",
        "type": [],
        "definition": [
            "Enum, short for \"enumerated,\" is a data type that consists of predefined values.  A constant or variable defined as an enum can store one of the values listed in the enum declaration.\nEnums are used in both source code and database tables.  For example, an enum that stores multiple colors may be declared in C# as follows:\nenum Color { white, red, green, blue, black };\nA column in a MySQL database table may be defined as below:\nColor ENUM ('white', 'red', 'green', 'blue', 'black')\nA variable or database value defined as Color can be assigned any of the five colors listed in the enum declarations above.  If assigned any other value besides the one of the five colors above, it will remain undefined and may produce an error depending on the context.  Also, enum variables may only contain one value.  If a variable may need to store one or more predefined values, it should be defined as a SET instead.\nEnums provide a highly structured way to store data since they can only store a single pre-defined value.  While this helps ensure data integrity, it also limits their flexibility.  Therefore, enum variables are most appropriate for storing discrete data that can only be one of a few possible values.  Examples include colors, sizes, categories, months, and days of the week.  Variables that contain more varied data, such as names and places, should be defined as strings."
        ]
    },
    {
        "word": "Equalizer",
        "type": [],
        "definition": [
            "An equalizer or \"EQ\" is a sound engineering tool that adjusts the output of different frequencies.  It allows you to cut or boost the levels of specific frequency ranges, providing more granular control of the sound volume.  For example, an EQ enables you to amplify low \"bass\" frequencies while not affecting sounds in the mid or high \"treble\" range.\nBoth hardware and software equalizers are available.  A hardware EQ has physical knobs or sliders and processes analog audio signals using internal circuitry.  A software EQ is controlled with a mouse or keyboard and processes digital audio through a computer.\nSeveral types of equalizers exist, but the most common are graphic and parametric.\nGraphic Equalizer\nThe most common and well-recognized equalizer is the graphic EQ.  It includes sliders that allow you to cut or boost specific frequencies.  A typical graphic EQ may have anywhere from 3 to 31 bands.  The more bands, the more granular the control.  For example, a simple 3-band EQ may have \"bass,\" \"mid,\" and \"treble,\" sliders.  A 7-band EQ may have sliders for specific frequencies, such as 50 Hz, 120 Hz, 300 Hz, 800 Hz, 2 kHz, 5 kHz, and 12 kHz.\nSome EQs may only provide an output range of +\/- 6 dB, while others allow you to cut or boost the level by more than 20 dB.  Increasing the output of a specific frequency too much may cause distortion (or \"clipping\" in a digital audio signal).  Therefore, it is usually best to decrease the levels of individual frequencies and increase the overall volume.\nSome EQs include a \"preamp\" slider that can boost the input levels, which raises the overall amplitude of the output signal.\nParametric Equalizer\nA parametric EQ uses knobs instead of sliders.  A semi-parametric EQ allows you to select the frequency and gain of each adjustment.  A fully-parametric EQ enables you to modify the frequency, gain, and \"Q\" (or width) of each setting.\nMost graphic equalizers automatically adjust the frequencies around each slider, which \"rolls off\" the boost or cut to the surrounding frequencies.  The \"Q\" setting of a parametric EQ allows you to control how quickly the adjustment rolls off.  For example, a narrow Q targets a small frequency range, such as a snare drum hit.  A wide Q targets a broad frequency range, such as a string section.\nChoosing an Equalizer\nThe visual nature of graphic EQs makes them easy to use and understand.  For example, a \"smiley-face\" EQ, which boosts the lows and highs and cuts the mids, is easy to recognize.  Many consumer audio programs include graphic equalizers because they are simple to use.   Fully-parametric EQs have a less-intuitive interface, but they provide more control over each frequency adjustment.  Therefore, most audio professionals prefer to work with parametric equalizers.\nOther types of equalizers include filters and shelving EQs.  Filters, such as low-pass and high-pass filters, roll off low and high frequencies, respectively.  These are useful for removing too much bass or treble from an audio signal.  A shelving EQ is similar to a low or high-pass filter, but it can also boost a low or high-end frequency.\nNOTE: Many software and hardware EQs have a \"bypass\" setting.  This on\/off switch provides a simple way to toggle between the original sound and the audio signal processed by the equalizer."
        ]
    },
    {
        "word": "Ergonomics",
        "type": [],
        "definition": [
            "Ergonomics is the study of how humans interact with manmade objects.  The goal of ergonomics is to create an environment that is well-suited to a user's physical needs.  \nWhile ergonomics is relevant in many areas, it is commonly applied to the workplace environment.  For example, ergonomics is often used to create comfortable workstations for employees.  This may involve choosing customized desks and chairs that fit each individual's body type.  It may also include providing employees with ergonomic keyboards and wrist rests that provide better typing posture.\nKeyboards, mice, and other devices that are developed using ergonomics are said to have \"ergonomic design.\"  This type of design is produced by ergonomics studies that help engineers better understand the way people use devices.  For example, an ergonomic chair may help support your lower back and prevent you from slouching.  An ergonomic desk may adjust to the appropriate height, so you can sit up straight and view your monitor at the right level.  An ergonomic keyboard may have a small slope on each side that fits your hand position more naturally than a flat keyboard.\nWhen multiple ergonomic objects are used together, it creates an ergonomically sound environment.  This is especially important in office workplaces, where people often spend the majority of their day sitting in front of a computer.  Small changes like adjusting a monitor to the correct height may prevent neck pain.  A simple wrist rest may prevent carpal tunnel syndrome, which is caused by a pinched nerve in the wrist.  By paying attention to ergonomics and making the necessary changes, you avoid the aches and pains that bad posture and receptive stress injuries can cause.\nNOTE: Even if you have an ergonomically friendly workstation, it is still helpful to stand up and walk around every half hour."
        ]
    },
    {
        "word": "Escape Key",
        "type": [],
        "definition": [
            "The Escape key is located in the upper-left corner of a computer keyboard.  It typically resides to the left of the Function keys (F1, F2, F3, etc.) and above the tilde (~) key.  Most often, is is labeled with the abbreviation \"esc.\"\nThe Escape key has many purposes, which have evolved over time.  Most uses share the common action of exiting or \"escaping\" an operation.  The Escape key is often used to quit, cancel, or abort a process that is running on a computer.\nSome specific examples of Escape key functions include:\n\nClosing a pop-up menu - You can press Escape to collapse the Windows Start Menu or the File menu in macOS.\nSelecting \"Cancel\" in a dialog box - When prompted with options such as \"OK\" and \"Cancel,\" the Enter key is often used to select \"OK,\" while the Escape key selects \"Cancel.\"\nReverting changes to a filename - If you are in the middle of changing the name of a file or folder, pressing Escape instead of Enter will revert to the unedited name.\nExiting full screen mode - Watching a full screen YouTube video on your computer?  Press Escape to return to the webpage view.\nEnding a presentation - Similar to exiting full-screen mode, pressing Escape will immediately end a presentation in programs like PowerPoint and Keynote.\nPausing a game - Escape is the default pause button in several video games.  Pressing Escape may bring up the in-game menu as well.\nHiding the cursor - Several programs, as well as macOS, make the cursor disappear when you press Escape\n\nWhile most applications don't require the use of the Escape (esc) key, it can be a handy shortcut for stopping or canceling operations on your computer."
        ]
    },
    {
        "word": "Esports",
        "type": [],
        "definition": [
            "Esports (pronounced \"e-sports\") is a general term used to describe video game competitions.  Much like athletic sporting events, Eports games are often played before live audiences and may be broadcast over the Internet as well.\nEsports dates back to the 1980s when gaming tournaments took place in arcades.  In the 1990s, console gaming became more popular and video game competitions started being held in auditoriums and other large arenas.  In the 2000s, as computing gaming grew in popularity, PC esports became more popular as well.  Over the past several years, the Internet has fostered a new era in esports, as players are now able to compete in gaming competitions remotely.\nAn esports match is performed much like an athletic sporting event.  Players must follow certain rules and a referee officiates the game.  Sportscasters typically commentate the game, explaining what is happening in real-time.  While esports games may be narrated by a single commentator, most large esports events are presented by two or more commentators at once.\nThe rise of esports has produced a large number of professional video gamer players (or \"pro gamers\").  These players compete regularly in professional tournaments with cash prizes.  Esports tournaments are typically sponsored by technology companies, but may also generate revenue through selling live tickets and online viewing subscriptions.\nEsports encompasses a wide range of video game genres.  Popular real-time strategy (RTS) games include StarCraft 2, Dota, and League of Legends.  Common first-person shooters include Call of Duty: Modern Warfare and Half Life: Counter-Strike.  Additionally, there are a few console games that are played in esports competitions, including Guitar Hero, Halo 3, and Super Street Fighter IV."
        ]
    },
    {
        "word": "Ethernet",
        "type": [],
        "definition": [
            "Ethernet, pronounced \"E-thernet\" (with a long \"e\"), is the standard way to connect computers on a network over a wired connection.  It provides a simple interface and for connecting multiple devices, such computers, routers, and switches.  With a single router and a few Ethernet cables, you can create a LAN, which allows all connected devices to communicate with each other.\nA standard Ethernet cable is slightly thicker than a phone cable and has an RJ45 connector on each end.  Ethernet ports look similar to telephone jacks, but are slightly wider.  You can plug or unplug devices on an Ethernet network while they are powered on without harming them.\nLike USB, Ethernet has multiple standards that all use the same interface.  These include:\n\n10BASE-T - supports up to 10 Mbps\n100BASE-T - supports up to 100 Mbps\n1000BASE-T (also called \"Gigabit Ethernet\") - supports up to 1,000 Mbps\n\nMost Ethernet devices are backwards compatible with lower-speed Ethernet cables and devices.  However, the connection will only be as fast as the lowest common denominator.  For example, if you connect a computer with a 10BASE-T NIC to a 100BASE-T network, the computer will only be able to send and receive data at 10 Mbps.  If you have a Gigabit Ethernet router and connect devices to it using 100BASE-T cables, the maximum data transfer rate will be 100 Mbps.\nWhile Ethernet is still the standard for wired networking, it has been replaced in many areas by wireless networks.  Wi-Fi allows you to connect your laptop or smartphone to a network without being tethered to the wall by a cable.  The 802.11ac Wi-Fi standard even provides faster maximum data transfer rates than Gigabit Ethernet.  Still, wired connections are less prone to interference and are more secure than wireless ones, which is why many businesses and organizations still use Ethernet.\nNOTE: Ethernet is also known by its technical name, \"IEEE 802.3.\""
        ]
    },
    {
        "word": "Exabyte",
        "type": [],
        "definition": [
            "An exabyte is 1018 or 1,000,000,000,000,000,000 bytes.\nOne exabyte (abbreviated \"EB\") is equal to 1,000 petabytes and precedes the zettabyte unit of measurement.  Exabytes are slightly smaller than exbibytes, which contain 1,152,921,504,606,846,976 (260) bytes.\nThe exabyte unit of measure measurement is so large, it is not used to measure the capacity of data storage devices.  Even the storage capacity of the largest cloud storage centers is measured in petabytes, which is a fraction of one exabyte.  Instead, exabytes are used to measure the sum of multiple storage networks or the amount of data transferred over the Internet in a certain amount of time.  For example, several hundred exabytes of data are transferred over the Internet each year.\nNOTE: View a list of all the units of measurement used for measuring data storage.\n"
        ]
    },
    {
        "word": "Exbibyte",
        "type": [],
        "definition": [
            "A exbibyte is a unit of data storage that equals 2 to the 60th power, or 1,152,921,504,606,846,976 bytes.\nWhile a exabyte can be estimated as 10^18 or 1,000,000,000,000,000,000 bytes, a exbibyte is exactly 1,152,921,504,606,846,976 bytes.  This is to avoid the ambiguity associated with the size of exabytes.  A exbibyte is 1,024 pebibytes and precedes the zebibyte unit of measurement.\nFor a list of other units of measurements, view this Help Center article.\nAbbreviation: EiB"
        ]
    },
    {
        "word": "Excel",
        "type": [],
        "definition": [
            "Microsoft Excel is a spreadsheet program for Windows and Macintosh computers.  It is part of the Microsoft Office suite, which includes other productivity programs, such as Word and PowerPoint.\nThough Excel is developed by Microsoft, the first version of the program was released for the Macintosh in 1985.  It wasn't until 1987, when Microsoft introduced Windows 3.0, that Excel was made available for Windows.  Since then, Microsoft has supported the program on both platforms, releasing updates about every two years.\nSome other popular spreadsheet programs include IBM Lotus 1-2-3 (for Windows) and the AppleWorks spreadsheet program (for the Mac).  However, Microsoft Excel has led the spreadsheet market for many years and continues to be the most popular spreadsheet program for both businesses and consumers."
        ]
    },
    {
        "word": "Exception",
        "type": [],
        "definition": [
            "An exception (short for \"exceptional event\") is an error or unexpected event that happens while a program is running.  When an exception occurs, it interrupts the flow of the program.  If the program can handle and process the exception, it may continue running.  If an exception is not handled, the program may be forced to quit.\nMultiple programming languages support exceptions, though they are used in different ways.  For example, exceptions are an integral part of the Java language and are often to control the flow of a program.  Java includes an Exception class, which has dozens of subclasses, such as TimeoutException, UserException, and IOException.  Subclasses like IOException contain more specific exceptions like FileNotFoundException and CharacterCodingException that can be \"thrown\" if a file is not found or the character encoding of a string is not recognized.\nOther languages only use exceptions to catch fundamental runtime errors, such as failure allocating memory or system-level errors.  For example, a C++ program may throw the bad_alloc exception when memory cannot be allocated and the system_error exception when the operating system produces an error.\nException Handling\nA well-written computer program checks for exceptions and handles them appropriately.  This means the developer must check for likely exceptions and write code to process them.  If a program handles exceptions well, unexpected errors can be detected and managed without crashing the program.\nExceptions are \"thrown\" when then occur and are \"caught\" by some other code in the program.  They can be thrown explicitly using the throw statement or implicitly within a try clause.  Below is an example of \"try \/ catch\" syntax in Java.  The following code attempts to divide by zero, but throws an ArithmeticException exception and returns 0 as the result.\n&nbsp;1. int a = 11;\n&nbsp;2. int b = 0;\n&nbsp;3. int result = 0;\n&nbsp;4. try {\n&nbsp;5. &nbsp; int c = a \/ b;\n&nbsp;6. &nbsp; result = c;\n&nbsp;7. } catch(ArithmeticException ex) {\n&nbsp;8. &nbsp; result = 0;\n&nbsp;9. }\n10. return result;\nAn exception is thrown on line 5 (when 11 is divided by 0), so the remainder of the try statement (line 6) is not executed.  Instead, the exception is caught on line 7 and a result of 0 is returned.\n"
        ]
    },
    {
        "word": "Executable File",
        "type": [],
        "definition": [
            "An executable file is a type of computer file that runs a program when it is opened.  This means it executes code or a series of instructions contained in the file.  The two primary types of executable files are 1) compiled programs and 2) scripts.\nOn Windows systems, compiled programs have an .EXE file extension and are often referred to as \"EXE files.\"  On Macintosh computers, compiled programs have an .APP extension, which is short for application.  Both types of executable files have been compiled from source code into binary machine code that is directly executable by the CPU.  However, EXE files only run in Windows, while APP files only run in Mac OS X.  This is because the code is executed by the operating system and therefore must be compiled in format that the operating system can understand.\nUncompiled executable files are often referred to as scripts.  These files are saved in a plain text format, rather than a binary format.  In other words, you can open a script file and view the code in a text editor.  Since scripts do not contain executable machine code, they require an interpreter to run.  For example, a PHP file can execute code only when run through a PHP interpreter.  If a PHP interpreter is not available, the PHP script can only be opened as a text file.\nSince executable files run code when opened, you should not open unknown executable files, especially ones received as email attachments.  While compiled executable files are the most dangerous, script files can run malicious code as well.  For example, VBScript (.VBS) files can run automatically on Windows systems through the built-in Windows Script Host.  Likewise, AppleScript (.SCPT) files can run through the AppleScript interpreter included with Mac OS X.  Therefore, if you come across an unknown file and are unsure if it contains executable code, it is best not to open it.  Below is a list of common file extensions used for executable files on Windows and Macintosh systems.\nWindows file extensions: .EXE, .COM, .BAT, .VB, .VBS, .WSF, .PIF\nMacintosh file extensions: .APP, .SCPT, .APPLESCRIPT"
        ]
    },
    {
        "word": "Expansion Card",
        "type": [],
        "definition": [
            "An expansion card is a printed circuit board that can be installed in a computer to add functionality to it.  For example, a user may add a new graphics card to his computer to give it more 3D graphics processing power.  An audio engineer may add a professional sound card to his machine to increase the computer's audio input and output connections.  Users that need more Firewire or USB ports can add Firewire or USB expansion cards, which provide additional connections.\nMost expansion cards are installed in PCI slots.  This includes variations of PCI, such as PCI-X and PCI Express.  Graphics cards may also be installed in an AGP slot, which is designed specifically for video cards.  Since expansion cards require open slots, they can only be installed in computers that have available expansion slots.  Therefore, computers like the Apple iMac and other all-in-one machines cannot accept expansion cards.  Computer towers, however, often have two or three open expansion slots, and can accept multiple cards.\nLaptops don't use traditional expansion cards because of their small form factor.  However, some models can accept removable PCMCIA cards that add extra ports or other functionality to the computer."
        ]
    },
    {
        "word": "Export",
        "type": [],
        "definition": [
            "Export is a command usually found within a program's File menu (File &rarr; Export...).  It is similar to the File &rarr; Save As... command, but is typically used for more specific purposes.  For example, instead of simply saving a file with a different name or different format, \"Export\" might be used to save parts of a file, create a backup copy of a file, or save a file with customized settings.\nSince the Export command is only used for specific purposes, it is not available in all applications.  For example, most text editors do not include an Export feature because text documents do not contain anything specific to export.  Instead, the Export command is often found in multimedia programs, like photo and video editing applications.  For example, Adobe Photoshop includes an Export command that allows users to export vector paths within an image as Adobe Illustrator files.  Apple QuickTime Player allows users to export videos to multiple formats and provides advanced options for choosing the compression type, frame rate, video dimensions, and other settings.  QuickTime's \"Save As...\" command only allows users to save movies in the standard QuickTime (.MOV) format.\nA program's Export command can be a useful tool if you need to save elements within a file or if you would like to save a version of the file with customized settings.  Therefore, if a program's \"Save As...\" command doesn't have the options you are looking for, select File &rarr; Export... and you might find exactly what you need.\nMany programs also include an Import command, which is used for opening specific types of files."
        ]
    },
    {
        "word": "Extensible",
        "type": [],
        "definition": [
            "Extensible is an IT term used to describe something that can be extended or expanded from its initial state.  It typically refers to software, such as a program or file format, though it can also be used to describe a programming language itself.\nAn extensible software program, for example, might support add-ons or plug-ins that add extra functionality to the program.  It may also allow you to add custom functions or macros that perform specialized tasks within the application.  An extensible file format (like XML) can be customized with user-defined elements.\nIf a programming language is extensible, it may support custom syntax and operations.  These custom elements can be defined in the source code and are recognized by the compiler along with the pre-defined elements.  Examples of extensible programming languages include Ruby, Lua, and XL.\nScalable vs. Extensible\nWhile the terms scalable and extensible are sometimes used interchangeably, they are not the same thing.  Scalability can refer to hardware, software, or an entire IT system, such as a cloud-based service.  Extensibility, on the other hand, is almost always used to describe software and refers specifically to its extendable capabilities.  For instance, a software program that supports plugins is extensible, but not necessarily scalable.  A server rack that has several empty slots for future use may be considered scalable, but is not extensible."
        ]
    },
    {
        "word": "External Hard Drive",
        "type": [],
        "definition": [
            "Nearly all personal computers come with an internal hard drive.  This drive stores the computer's operating system, programs, and other files.  For most users, the internal hard drive provides enough disk space to store all the programs and files.  However, if the internal hard drive becomes full or if the user wants to back up the data on the internal hard drive, and external hard drive may be useful.\nExternal hard drives typically have one of two interfaces - USB or Firewire.  USB hard drives commonly use the USB 2.0 interface because it supports data transfer rates of up to 480 Mbps.  USB 1.1 only supports transfers of up to 12 Mbps, which would make the hard drive seem slow to even the most patient people.  Firewire drives may use either Firewire 400 or Firewire 800, which support data transfer rates of up to 400 and 800 Mbps respectively.\nThe most likely users to need external hard drives are those who do audio and video editing.  This is because high-quality media files can fill up even the largest hard drives.  Fortunately, external hard drives can be daisy chained, which means they can be connected one after the other and be used at the same time.  This allows for virtually unlimited amounts storage.\nUsers who do not require extra storage may still find external hard drives useful for backing up their main hard drive.  External hard drives are a great backup solution because they can store an exact copy of another hard drive and can be stored in a safe location.  Using the drive to restore data or perform another backup is as simple as connecting it to the computer and dragging the necessary files from one drive to another.\nWhile most external hard drives come in heavy, protective cases, some hard drives are designed primarily for portability.  These drives usually don't hold as much data as their larger desktop counterparts, but they have a sleek form factor and can easily be transported with a laptop computer.  Some portable drives also include security features such as fingerprint recognition that prevent other people from accessing data on the drive in case it is lost."
        ]
    },
    {
        "word": "Extranet",
        "type": [],
        "definition": [
            "If you know the difference between the Internet and an intranet, you have an above average understanding of computer terminology.  If you know what an extranet is, you may be in the top echelon.\nAn extranet actually combines both the Internet and an intranet.  It extends an intranet, or internal network, to other users over the Internet.  Most extranets can be accessed via a Web interface using a Web browser.  Since secure or confidential information is often accessible within an intranet, extranets typically require authentication for users to access them.\nExtranets are often used by companies that need to share selective information with other businesses or individuals.  For example, a supplier may use an extranet to provide inventory data to certain clients, while not making the information available to the general public.  The extranet may also include a secure means of communication for the company and its clients, such as a support ticket system or Web-based forum.\nUnlike the Internet, \"extranet\" is not a proper noun and therefore should not be capitalized."
        ]
    },
    {
        "word": "eBook",
        "type": [],
        "definition": [
            "eBook (or e-book) is short for \"electronic book.\"  It is a digital publication that can be read on a computer, e-reader, or other electronic device.\neBooks are available in several different file formats.  Some are open formats that can be read on multiple devices, while others are proprietary and can only be viewed on a specific device, such as an iPad or Kindle.  Commercially available publications often include some kind of digital rights management (DRM) that prevent the content from being viewed on unauthorized devices.  For example, many books available through Amazon's Kindle Store and Apple's iBookstore are copy-protected using DRM protection.\nWhile there are many types of eBook formats, all major ones support text, images, chapters, and page markers.  Most formats also support user annotations, such as highlighted text, drawings, and notes.  For example, the Sony Reader includes a handwriting feature that allows you to underline specific text on a page.  The Amazon Kindle includes a highlighter pen used for highlighting text.  Some e-readers allow you to share your annotations with others online and view what text other readers have highlighted or commented on.\nNOTE: An eBook may be a novel, magazine, newspaper, or other publication.  However, the electronic versions of magazines and newspapers are often called \"digital editions\" to differentiate them from electronic books.  View a comprehensive list of eBook formats.\nFile extensions: .EPUB, .LIT, .AZW3, .IBOOKS"
        ]
    },
    {
        "word": "eGPU",
        "type": [],
        "definition": [
            "Stands for \"External Graphics Processing Unit.\"  An eGPU is a graphics processor that resides outside of a computer.  It is attached via a high-speed connection, such as Thunderbolt cable, which provides sufficient bandwidth to process graphics in real-time outside the computer.\neGPUs can be used by both desktop and laptop computers.  However, they are more commonly connected to laptops since desktop PCs often have internal expansion slots for graphics cards.  In either case, the purpose of an eGPU is to provide the connected machine with higher graphics processing performance.\nHistorically, the graphics performance of a computer without expansion slots was limited by the speed of the built-in graphics card.  The introduction of the high-speed Thunderbolt 2 and Thunderbolt 3 interfaces has made it possible to render graphics in real-time using an external GPU.\nAn eGPU setup requires four components:\n\nComputer\neGPU enclosure or adapter\nVideo card (GPU)\nCable\n\nWhile it is possible to use a rudimentary adapter to connect an external graphics card, eGPU enclosures are more commonly used because they protect the GPU and provide more reliable performance.  An eGPU enclosure provides a connection for the video card (such as a PCI Express slot) and has an interface for connecting to the computer, such as a Thunderbolt port.\nMost eGPU enclosures support several different models of video cards, which means you can upgrade the card at any time.  Similar to an internal GPU, the graphics processor used in an eGPU must be supported by the operating system in order to work.  This means you may need to install drivers for the eGPU before using it.\nNOTE: Apple added operating system-level support for eGPUs in macOS High Sierra 10.13.4, which was released on March 29, 2018."
        ]
    },
    {
        "word": "eSATA",
        "type": [],
        "definition": [
            "Stands for \"External Serial Advanced Technology Attachment.\"  eSATA is a variation of the SATA interface that supports external storage devices.  It was standardized in 2004 and uses the same pins and same protocols as internal SATA.  However, it provides a slightly different, more rugged connector.  The eSATA standard also supports a cable length of two meters compared to the one meter cable length supported by SATA.\nSince eSATA uses the same protocols as SATA, an eSATA drive offers the same high-speed data transfer rates as and internal SATA drive.  For example, an eSATA 3.0 drive can transfer data at 6 Gbps or 4.8 Gbps, taking into account the data encoding process.  This is significantly faster than Firewire 800 (800 Mbps) and USB 2.0 (480 Mbps) and is on par with USB 3.0 (5 Gbps).\nBecause eSATA offers such fast transfer rates, it has been a popular external hard drive interface used by video editors, audio producers, and other media professionals.  While eSATA is one of the fastest interfaces available, it is surpassed by both Thunderbolt (10 Gbps) and Thunderbolt 2.0 (20 Gbps), which are alternatives to eSATA.\neSATAp\nUnlike Firewire, USB, and Thunderbolt, the eSATA interface does not provide power to connected devices.  Therefore, all drives connected via eSATA must include a separate power connector to provide electricity to the device.  A variation of eSATA, called eSATAp or eSATA USB Hybrid Port (EUHP), combines four USB pins and two 12-volt power pins into the eSATA connector.  An eSATAp port supports both eSATA and USB connectors.  It allows connected devices to draw power from the computer's power supply, eliminating the need for a separate power cable."
        ]
    },
    {
        "word": "eSIM",
        "type": [],
        "definition": [
            "An eSIM, short for \"embedded SIM,\" is SIM chip or \"UICC\" embedded in a mobile device.  It provides the same functionality as a SIM card, but is not removable.\nWhat is a SIM?\nA SIM (Subscriber Identification Module) is a unique number that identifies a device on a cellular network.  When you activate a smartphone, tablet, or another device on a cellular network, the mobile provider links the SIM number to your account.  When activating a smartphone, the cellular company also links the SIM to your mobile phone number.\neSIM vs SIM Card\nUnlike SIM cards, which are removable and can be moved between devices, an eSIM is integrated into a device's hardware.  Since eSIMs cannot be removed, they are writable and can be reprogrammed to work with different cellular providers.  They can also store more than one SIM number at a single time.\nBelow are some advantages of eSIMs over traditional SIM cards:\n\nSmaller form factor - Generally, eSIMs require less than 1\/3 the space of even the smallest nano-SIM cards.\nElectronically programmable - You don't need to go to a physical store or receive a new SIM card in the mail when moving to a new cellular provider.  You can add the eSIM number electronically.\nSupport for multiple SIMs - An eSIM makes it possible to use one device with multiple cellular providers at the same time.  Common uses include separating personal and business calls and using local cellular plans when traveling internationally.\nImproved security - If your phone is lost or stolen, another person will not be able to use your SIM card.\n\nThe first smartphones to use eSIMs hit the market around 2018.  Many popular models now include eSIM chips.  Since embedded SIMs only work with mobile providers that support eSIM technology, many eSIM devices also have a physical SIM card slot."
        ]
    }
]