[
    {
        "word": "FAQ",
        "type": [],
        "definition": [
            "Stands for \"Frequently Asked Questions.\"  An FAQ, pronounced \"F-A-Q,\" is a list of answers to common questions about a specific product or service.  In the IT world, FAQs are created for software programs, computer hardware, websites, and online services.  They serve as a central reference for locating answers to common questions.\nSince FAQs are based on user feedback, they typically evolve over time.  For example, a software company may receive a large number of emails regarding a specific step in their software installer.  The company may clarify the step in their FAQ so that users can find the answer without needing to email the company.  This cuts down on technical support, saving time for both the software company and the end users.\nSome software programs and hardware devices come with an FAQ document.  In some cases, the FAQ is contained in the \"readme\" file, though it may also be a separate file or included within a printed manual.  Most often, FAQs are located on a website.  This allows the respective company or organization to regularly update the FAQ based on users' questions.  Most FAQs are located within the \"Support\" section of a website."
        ]
    },
    {
        "word": "FAT32",
        "type": [],
        "definition": [
            "This strange term refers to the way Windows stores data on your hard drive.  \"FAT\" stands for \"File Allocation Table,\" which keeps track of all your files and helps the computer locate them on the disk.  Even if a file gets fragmented (split up into various areas on the disk), the file allocation table still can keep track of it.  FAT32 is an improvement to the original FAT system, since it uses more bits to identify each cluster on the disk.  This helps the computer locate files easier and allows for smaller clusters, which improves the efficiency of your hard disk.  FAT32 supports up to 2 terabytes of hard disk storage.  Unless you are a serious power user, that should be more than enough space for you."
        ]
    },
    {
        "word": "FDDI",
        "type": [],
        "definition": [
            "Stands for \"Fiber Distributed Data Interface.\"  FDDI is a group of networking specifications standardized by ANSI in the mid-1980s.  An FDDI network supports data transfer speeds of 100 Mbps over a fiber optic cable and uses a rotating token to define which system can send data at any given time.\nFDDI networks are comprised of two physical paths, or \"rings,\" that transfer data in opposite directions.  The primary ring carries data between systems, while the secondary ring is used for redundancy.  If a system on the network causes an interruption in the primary data path, the secondary ring is used until the primary ring is functional again.  A variation of FDDI, called FDDI Full Duplex Technology (FFDT), uses the secondary ring as an additional primary channel.  This type of FDDI network has no redundancy, but supports data transfer rates up to 200 Mbps.\nFDDI was designed in the 1980s to provide faster networking than the 10 Mbps Ethernet and 16 Mbps token ring standards available at the time.  Because of its high bandwidth, FDDI became a popular choice for high-speed backbones used by universities and businesses.  While FDDI was the fastest LAN technology for several years, it was eventually superseded by Fast Ethernet, which offered 100 Mbps speeds at a much lower cost.  Today, many networks use Gigabit Ethernet, which supports speeds up to 1,000 Mbps."
        ]
    },
    {
        "word": "FIFO",
        "type": [],
        "definition": [
            "Stands for \"First In, First Out.\"  FIFO is a method of processing and retrieving data.  In a FIFO system, the first items entered are the first ones to be removed.  In other words, the items are removed in the same order they are entered.\nTo use a real world analogy, imagine a vending machine where the items are loaded from the back.  When someone selects a Milky Way bar from row E5, the machine churns out the candy bar closest to the front.  The next Milky Way in line then moves to the front.  Therefore, using the FIFO method, the candy bars are dispensed in the order they were placed in the machine.\nComputers often implement the FIFO system when extracting data from an array or buffer.  If the first data entered into the buffer must be extracted first, the FIFO method is used.  The opposite of FIFO is LIFO, in which the last data entered is the first to be removed."
        ]
    },
    {
        "word": "FILO",
        "type": [],
        "definition": [
            "Stands for \"First In, Last Out.\"  FILO is an acronym used in computer science to describe the order in which objects are accessed.  It is synonymous with LIFO (which is more commonly used) and may also be called LCFS or \"last come, first served.\"\nA stack is a typical data structure that may be accessed using the LIFO method.  In a stack, each item is placed on top of the previous item, one at a time.  Items can be removed from either the top of the stack (FILO) or from the bottom of the stack FIFO.  You can imagine a FILO stack as the paper in a printer tray.  Whatever paper you place on top of the existing paper in the input tray will be accessed first.\nFILO is not necessarily a \"fair\" way to access data, since it operates in opposite order of a queue.  Still, the FILO method can be useful for retrieving recently used objects, such as those stored in cache memory."
        ]
    },
    {
        "word": "FLOPS",
        "type": [],
        "definition": [
            "Stands for \"Floating Point Operations Per Second.\"  FLOPS are typically used to measure the performance of a computer's processor.  While clock speed, which is measured in megahertz, is often seen as an indicator or a processor's speed, it does not define how many calculations a processor can perform per second.  Therefore, FLOPS is a more raw method of measuring a processor's processing speed.\nStill, a FLOPS reading only measures floating point calculations and not integer operations.  Therefore, while FLOPS can accurately measure a processor's floating point unit (FPU), it is not a comprehensive measurement of a processor's performance.  In order to accurately gauge the processing capabilities of a CPU, multiple types of tests must be run."
        ]
    },
    {
        "word": "FPGA",
        "type": [],
        "definition": [
            "Stands for \"Field-Programmable Gate Array.\"  An FPGA is an integrated circuit that can be customized for a specific application.  Unlike traditional CPUs, FGPAs are \"field-programmable,\" meaning they can be configured by the user after manufacturing.\nFPGAs contain programmable logic blocks that can be wired in different configurations.  These blocks create a physical array of logic gates that can be used to perform different operations.  Because the gates are customizable, FPGAs can be optimized for any computing task.  This gives FPGAs the potential to perform operations several times faster than a hard-wired processor.\nField-programmable gate arrays are typically customized using a hardware description language, or HDL.  A programmer can use HDL commands to configure the gate interconnects (how the gates connect to each other) as well as the gates themselves.  For example, a gate may be assigned a boolean operator, such as AND, OR, or XOR.  By linking several gates together, it is possible to perform advanced logic operations.\nSince FPGAs are designed to be programmed for specific applications, they are not suitable for personal computers.  However, they have a wide variety of field applications.  Examples include telecommunications, data centers, scientific computing, and audio\/video processing.  Besides being used in servers and high-end computers, they can also be implemented in electronic devices, such as TVs, radios, and medical equipment."
        ]
    },
    {
        "word": "FPS",
        "type": [],
        "definition": [
            "Stands for \"Frames Per Second.\"  FPS is used to measure frame rate – the number of consecutive full-screen images that are displayed each second.  It is a common specification used in video capture and playback and is also used to measure video game performance.\nOn average, the human eye can process 12 separate images per second.  This means a frame rate of 12 FPS can display motion, but will appear choppy.  Once the frame rate exceeds 12 FPS, the frames appear less discrete and start to blur together.  A frame rate of 24 FPS is commonly used for film since it creates a smooth appearance.  Many video cameras record in 30 or 60 FPS, which provides even smoother motion.\nThe 60i (60 FPS, interlaced) format was used for NTSC broadcasts and was replaced by the 60p (60 FPS, progressive scan) with HDTV.  This means HDTV not only provides a higher resolution than NTSC, but also yields smoother playback.  In order to take advantage of higher frame rates, the display on which the video is output must support a refresh rate that is at least as high as the frame rate.  That is why most televisions and monitors support refresh rates of at least 60 hertz.\nFPS is also used to measure the frame rate of video games.  The maximum frame rate is generally  determined by a combination of the graphics settings and the GPU.  For example, if you are running a new game on an old computer, you may have to reduce the quality of the graphics to maintain a high frame rate.  If you have a new computer with a powerful video card, you may be able to increase the graphics settings without reducing the FPS.\nWhile some games limit the maximum frame rate, it is not uncommon for a powerful GPU to generate over 100 FPS.  For a game to be playable without any lag, it helps to make sure the game maintains over 60 FPS even when a lot is happening on the screen.  Therefore, it is wise to configure your graphics settings conservatively to avoid choppy gameplay.\nNOTE: FPS is also a common abbreviation for \"First Person Shooter,\" a type of 3D video game that gives you the perspective of the main character."
        ]
    },
    {
        "word": "FPU",
        "type": [],
        "definition": [
            "Stands for \"Floating Point Unit.\"  An FPU is a processor or part of a processor that performs floating point calculations.  While early FPUs were standalone processors, most are now integrated inside a computer's CPU.\nEven without a floating point unit, a CPU can handle both integer and floating point (non-integer) calculations.  However, integer operations use significantly different logic than floating point operations, which makes it inefficient to use the same processor to handle both types of operations.  An FPU provides a faster way to handle calculations with non-integer numbers.\nAny mathematical operation, such as addition, subtraction, multiplication, or division can be performed by either the integer processing unit or the FPU.  When a CPU receives an instruction, it automatically sends it to the corresponding processor.  For example, 12 + 5 would be processed as an integer calculation, while 1.0023 x 5.789 would get sent to the FPU.  While it is possible for a programmer to write an instruction specifically for either processing unit, it is usually unnecessary.\nSince integer and floating point performance can vary significantly, most processor benchmarks include both types of operations.  Integer calculation speed is typically listed as \"integer performance\" and is labeled \"SPECint\" in SPEC benchmarks.  FPU calculation speed is often listed as \"floating point performance\" and can be measured in FLOPS."
        ]
    },
    {
        "word": "FQDN",
        "type": [],
        "definition": [
            "Stands for \"Fully Qualified Domain Name.\"  An FQDN is a the most complete domain name that identifies a host or server.  The format is:\n[hostname].[domain].[tld].\nFor example, \"www.techterms.com.\" is an FQDN since it contains a hostname (\"www\") and a domain name (\"techterms.com\"), followed by a trailing period.  The name \"techterms.com\" is not fully qualified because it does not include a hostname or end with a period.\nAn FQDN can be broken down into four parts:\n\nHostname: www, mail, ftp, store, support, etc.\nDomain: apple, microsoft, ibm, facebook, etc.\nTop level domain (TLD): .com, .net, .org, .co.uk, etc.\nTrailing period: the final period in an FQDN indicates the end of the name, implying the previous string is the TLD.\n\nHostname and Domain Name\nThe domain and TLD comprise the domain name, while the hostname specifies different services and protocols for the domain.  For example, \"mail.example.com\" is often the required format when configuring the SMTP server for an email account.  The server address \"ftp.example.com\" is commonly used when connecting to an FTP server.  Name servers typically use the naming convention \"ns1.example.com\" and \"ns2.example.com\".\nThe hostname may also specify a website subdomain.  The most popular subdomain is \"www.\"  Other common subdomains include \"support,\" \"dev,\" \"store,\" and \"forum.\"  Some sites use variations of \"www\" such as \"web\", \"ww1,\" \"www2,\" etc.\nThe Trailing Period\nTechnically, a fully-qualified domain name includes a trailing period, which indicates the end of the name.  Since a hostname can include multiple subdomains, such as \"en.support.example.com,\" it is more reliable to process an FQDN backwards, beginning with the TLD and ending with the hostname.  Ironically, the period serves as the starting point when a computer processes an FQDN.\nWhile the trailing dot is part of a fully-qualified domain name, in most cases, it is implied.  For example, you don't need to enter the period when typing in a web address in the address bar of your web browser or when entering the mail server in your email client.  In other places, such as a DNS zone file, it is important to include the trailing period for each FQDN.\nNOTE: A domain name that includes the domain, TLD, and period, but no hostname is called a partially-qualified domain name, or PQDN."
        ]
    },
    {
        "word": "FSB",
        "type": [],
        "definition": [
            "Stands for \"frontside bus.\"  The FSB connects the computer's processor to the system memory (RAM) and other components on the motherboard.  These components include the system chipset, AGP card, PCI devices, and other peripherals.  Because the FSB serves as the main path from the processor to the rest of the motherboard, it is also called the \"system bus.\"\nThe speed of the frontside bus is measured in Megahertz or Gigahertz, just like the processor.  Most computers' processors run faster than their system buses, so the FSB speed is typically a ratio of the processor speed.  For example, a Pentium 4 processor that runs at 2.4 GHz may have an FSB speed of only 400 MHz.  The CPU to FSB ratio would be 6:1.  A Power Mac G5, however, with a 2.0 GHz processor, has a 1.0 GHz frontside bus.  Therefore, its CPU to FSB ratio is 2:1.\nThe smaller the ratio, the more efficiently the processor can work.  Therefore, faster frontside bus speeds lead to faster overall performance.  When the CPU to FSB ratio is high, the processor often has to wait for data to be sent out over the system bus before getting new data to process.  For this reason, the FSB can be a bottleneck in a computer's performance.  So if you are looking for a fast computer, don't just check the processor speed, but find out what the frontside bus speed is as well."
        ]
    },
    {
        "word": "FTP",
        "type": [],
        "definition": [
            "Stands for \"File Transfer Protocol.\"  FTP is a protocol designed for transferring files over the Internet.  Files stored on an FTP server can be accessed using an FTP client, such as a web browser, FTP software program, or a command line interface.\nAn FTP server can be configured to enable different types of access.  For example, an \"anonymous FTP\" configuration allows anyone to connect to the server.  However, anonymous users may only be allowed to view certain directories and may not be able to upload files.  If anonymous FTP access is disabled, users are required to log in in order to view and download files.\nThe standard FTP protocol is not encrypted, meaning it is vulnerable to packet sniffers and other types of snooping attacks.  Therefore, the FTPS and SFTP protocols were developed to provide secure FTP connections.  FTPS (FTP with SSL security) provides SSL encryption for all FTP communication.  SFTP (SSH File Transfer Protocol) is a secure version of FTP that uses SSH to encrypt all data transfers.\nTo you connect to an FTP server, you first need to enter the server name and port number.  The server name often starts with \"ftp,\" such as \"ftp.example.com.\"  The standard port number for FTP is 21, while SFTP uses port 22 (SSH).  If you connect via FTPS, you might be required to enter a custom port number, but the most common one is 990.  In order to access an SFTP or FTPS server, you will also need to enter a username and password."
        ]
    },
    {
        "word": "Facebook",
        "type": [],
        "definition": [
            "Facebook is a social networking website that was originally designed for college students, but is now open to anyone 13 years of age or older.  Facebook users can create and customize their own profiles with photos, videos, and information about themselves.  Friends can browse the profiles of other friends and write messages on their pages.\nEach Facebook profile has a \"wall,\" where friends can post comments.  Since the wall is viewable by all the user's friends, wall postings are basically a public conversation.  Therefore, it is usually best not to write personal messages on your friends' walls.  Instead, you can send a person a private message, which will show up in his or her private Inbox, similar to an e-mail message.\nFacebook allows each user to set privacy settings, which by default are pretty strict.  For example, if you have not added a certain person as a friend, that person will not be able to view your profile.  However, you can adjust the privacy settings to allow users within your network (such as your college or the area you live) to view part or all of your profile.  You can also create a \"limited profile,\" which allows you to hide certain parts of your profile from a list of users that you select.  If you don't want certain friends to be able to view your full profile, you can add them to your \"limited profile\" list.\nAnother feature of Facebook, which makes it different from MySpace, is the ability to add applications to your profile.  Facebook applications are small programs developed specifically for Facebook profiles.  Some examples include SuperPoke (which extends Facebook's \"poke\" function) and FunWall (which builds on the basic \"wall\" feature).  Other applications are informational, such as news feeds and weather forecasts.  There are also hundreds of video game applications that allow users to play small video games, such as Jetman or Tetris within their profiles.  Since most game applications save high scores, friends can compete against each other or against millions of other Facebook users.\nFacebook provides an easy way for friends to keep in touch and for individuals to have a presence on the Web without needing to build a website.  Since Facebook makes it easy to upload pictures and videos, nearly anyone can publish a multimedia profile.  Of course, if you are a Facebook member or decide to sign up one day, remember to use discretion in what you publish or what you post on other user's pages.  After all, your information is only as public as you choose to make it!"
        ]
    },
    {
        "word": "Factory Reset",
        "type": [],
        "definition": [
            "A factory reset restores an electronic device's software to a fresh state, similar to when it left the factory.  It removes all user data, and the software operates as a new device.\nMany devices have a factory reset option, including computers, tablets, smartphones, smart TVs, AVRs, and smart appliances.  The top two reasons for performing a factory reset are:\n\nFixing a persistent software issue\nClearing a device before transferring it to another user\n\nPerforming a factory reset will erase all your data.  Make sure you have a recent backup or have transferred your data to another device before selecting this action.\nThe factory reset command is usually found within the Settings &rarr; General menu of a device's user interface.  In most cases, the command is not labeled \"factory reset,\" but something similar.  Below are examples of verbiage used by popular operating systems.\n\nWindows: Reset PC\nmacOS: Erase All Content and Settings\nChrome OS: Powerwash\nAndroid: Erase all data (factory reset)\niOS: Erase all Content and Settings\n\nFactory Reset vs. System Restore\nThe terms \"factory reset\" and \"system restore\" are often used interchangeably and may refer to the same operation.  However, a system restore may reference a backup or system snapshot to restore user data instead of resetting a device to factory settings.  Therefore, a factory reset is best when discarding or transferring a device to another user.\nNOTE: Usually, a factory reset maintains the most recently installed version of the operating system.  However, if the device is restored from firmware, performing a factory reset may revert the system software to the original operating system."
        ]
    },
    {
        "word": "Favicon",
        "type": [],
        "definition": [
            "A favicon is a small icon that identifies a website in a web browser.  Most browsers display a website's favicon in the left side of the address bar, next to the URL.  Some browsers may also display the favicon in the browser tab, next to the page title.  Favicons are automatically saved along with bookmarks or \"favorites\" as well.\nFavicons have been around since the early 2000s and are supported by all major web browsers.  However, different browsers provide different implementations of the favicon.  For example, Firefox, Internet Explorer, and Safari all display favicons in the address bar, but Google Chrome only displays them in the page tabs.  Most browsers support favicons saved as .GIF, .PNG, or .JPG files, but Internet Explorer only displays favicons saved in the .ICO format.\nThe standard way to implement a favicon on a website is to upload a small 16x16 pixel image named favicon.ico to the root directory of the website.  When a user loads a page from the website in a web browser, the browser looks for the favicon.ico file, and if it finds one saved in a supported format, it automatically displays the icon next to the URL or the page title.  The favicon can also be specified in the HTML of a webpage as follows:\n&lt;link rel=\"shortcut icon\" href=\"http:\/\/www.domain.com\/myicon.ico\"&gt;\nThe HTML method typically overrides the favicon saved in the root directory, which can be useful if you want to display a custom favicon for certain pages within a website.\nNOTE: The standard size of a favicon is 16x16 pixels, though most browsers will recognize favicons saved as 32x32, 48x48, and 64x64 pixel images as well.  Favicons larger than 16x16 pixels are typically scaled down to 16x16 so that they display in the browser correctly.  However, browsers that support retina displays will display 32x32 pixel icons in their native resolution."
        ]
    },
    {
        "word": "Favorites",
        "type": [],
        "definition": [
            "While most Web browsers store saved webpage locations as bookmarks, Internet Explorer saves them as favorites.  For example, when you save a webpage location in Firefox, it gets stored as a bookmark.  When you save one in Internet Explorer, it gets stored as a favorite.  For this reason, the terms \"bookmarks\" and \"favorites\" are often used synonymously.  \nFavorites are also used in other applications besides Web browsers.  For example, media players often include a favorites list, which allows users to store references to favorite audio and video files in a single location.  Media editing programs often include a favorites panel, which contains links to files that can be imported into projects.  Mac OS X has a \"Favorites\" folder in which users can store aliases to frequently accessed files and folders.  Windows 7 also has a \"Favorites\" folder, which is used to store both favorite webpages and favorite files.\nYou can often identify a Favorites folder by a star or heart icon.  Most applications allow you to simply drag items into the Favorites folder to add them to your favorites.  While \"favorites\" may refer to a wide variety of items, the purpose of a favorites folder is always to provide easy access to frequently used items."
        ]
    },
    {
        "word": "Fiber Optic Cable",
        "type": [],
        "definition": [
            "Fiber optic cable is a high-speed data transmission medium.  It contains tiny glass or plastic filaments that carry light beams.  Digital data is transmitted through the cable via rapid pulses of light.  The receiving end of a fiber optic transmission translates the light pulses into binary values, which can be read by a computer.\nBecause fiber optic cables transmit data via light waves, they can transfer information at the speed of light.  Not surprisingly, fiber optic cables provide the fastest data transfer rates of any data transmission medium.  They are also less susceptible to noise and interference compared to copper wires or telephone lines.  However, fiber optic cables are more fragile than their metallic counterparts and therefore require more protective shielding.  While copper wires can be spliced and mended as many times as needed, broken fiber optic cables often need to be replaced.\nSince fiber optic cables provide fast transfer speeds and large bandwidth, they are used for a large part of the Internet backbone.  For example, most transatlantic telecommunications cables between the U.S. and Europe are fiber optic.  In recent years, fiber optic technology has become increasingly popular for local Internet connections as well.  For example, some ISPs now offer \"fiber Internet,\" which provides Internet access via a fiber optic line.  Fiber connections can provide homes and businesses with data transfer speeds of 1 Gbps."
        ]
    },
    {
        "word": "Field",
        "type": [],
        "definition": [
            "A field is a user interface element designed for entering data.  Many software applications include text fields that allow you to provide input using your keyboard or touchscreen.  Websites often include form fields, which you can use to enter and submit information.\nIn software programs, the terms \"field\" and \"text box\" may be used interchangeably.  For example, a world processor may provide several formatting options, such as font size, line spacing, and page margins.  Each option includes a text box where you can manually enter custom settings.  Many applications also include a search field (or \"search box\") that allows you to search the contents of one or more documents.  \nWhen you visit a website, it may provide a form that allows you to enter data, such as your billing address or registration information.  Each single-line text box within a web form is called an \"input\" field and is defined by &lt;input type=\"text\"&gt; in HTML.  Fields with more than one line are called text areas and are created using the &lt;textarea&gt; tag.  You may also encounter login forms that include two fields for entering your username and password.  Most password fields are defined as &lt;input type=\"password\"&gt; which hides the characters as you type.\nNOTE: Databases also include fields.  Each row or \"record\" in a database table may include multiple fields.  The table columns define what fields are available in each row.  Therefore, a specific column and row combination (such as Row: 101, Column: Name) defines a specific field.  Individual fields in a database may be searched and modified using standard SQL queries."
        ]
    },
    {
        "word": "File",
        "type": [],
        "definition": [
            "A file is a collection of data stored in one unit, identified by a filename.  It can be a document, picture, audio or video stream, data library, application, or other collection of data.  The following is a brief description of each file type.\nDocuments include text files, such as a Word documents, RTF (Rich Text Format) documents, PDFs, Web pages, and others.  Pictures include JPEGs, GIFs, BMPs, and layered image files, such as Photoshop documents (PSDs).  Audio files include MP3s, AACs, WAVs, AIFs, and several others.  Video files can be encoded in MPEG, MOV, WMV, or DV formats, just to name a few.\nA library file is a unit of data that is referenced by a specific program or the operating system itself.  These include plug-ins, components, scripts, and many others.  An application is a program, or executable file.  Programs such as Microsoft Internet Explorer and Apple iTunes are both applications, but are also files.\nFiles can be opened, saved, deleted, and moved to different folders.  They can also be transferred across network connections or downloaded from the Internet.  A file's type can be determined by viewing the file's icon or by reading the file extension.  If the file type is associated with a specific application, double-clicking the file will typically open the file within the program."
        ]
    },
    {
        "word": "File Association",
        "type": [],
        "definition": [
            "A file association is a relationship between a file type and a supporting application.  For example, a Word document may be associated with Microsoft Word.  This means when you double-click a Word document, Microsoft Word will open the file.\nBoth the Windows and Mac OS X operating systems use file associations to define what default program is used to open each file type.  For example, in Windows, plain text (.TXT) files are commonly associated with Microsoft Notepad.  In Mac OS X, they are associated with Apple TextEdit.  Therefore, if you double-click a plain text file in Windows, it will open in Notepad, while in Mac OS X, it will open in TextEdit.\nSince some file types have multiple file extensions, file associations relate each file extension to a specific program.  For example, a file association for the HTML file type may require both .HTM and .HTML files to be associated with a specific Web browser.  The file association for JPEG image files may require .JPG, .JPE, and .JPEG files to be associated with a specific image viewer.\nIn Windows, file associations are defined in the registry, while in Mac OS X, they are listed in the LaunchServices preferences.  Fortunately, if you want to change a file association on your computer, you don't need to access either of these locations.  Instead, both Windows and Mac OS X provide a simple user interface for modifying file associations.  For instructions on changing file associations on Windows and Macintosh systems, visit the pages below.\n\nWindows XP\nWindows 7\nMac OS X\n\nNOTE: While you can manually change file associations using the methods above, some applications can also change file associations for you.  For example, when you install or open a program, it may ask you if you want to make it the default program for all supported file types.  If you select \"Yes,\" the program will assign all supported file types to itself."
        ]
    },
    {
        "word": "File Compression",
        "type": [],
        "definition": [
            "File compression is used to reduce the file size of one or more files.  When a file or a group of files is compressed, the resulting \"archive\" often takes up 50%  to 90% less disk space than the original file(s).  Common types of file compression include Zip, Gzip, RAR, StuffIt, and 7z compression.  Each one of these compression methods uses a unique algorithm to compress the data.\nSo how does a file compression utility actually compress data?  While each compression algorithm is different, they all work in a similar fashion.  The goal is to remove redundant data in each file by replacing common patterns with smaller variables.  For example, words in a plain text document might get replaced with numbers or another type of short identifier.  These identifiers then reference the original words that are saved in a key within the compressed file.  For instance, the word \"computer\" may be replaced with the number 5, which takes up much less space than the word \"computer.\"  The more times the word \"computer\" is found in the text document, the more effective the compression will be.\nWhile file compression works well with text files, binary files can also be compressed.  By locating repeated binary patterns, a compression algorithm can significantly reduce the size of binary files, such as applications and disk images.  However, once a file is compressed, it must be decompressed in order to be used.  Therefore, if you download or receive a compressed file, you will need to use a file decompression program, such as WinZip or StuffIt Expander, to decompress the file before you can view the original contents.\nRelated file extensions: .ZIP, .GZ, .RAR, .SITX, .7Z."
        ]
    },
    {
        "word": "File Extension",
        "type": [],
        "definition": [
            "A file extension (or simply \"extension\") is the suffix at the end of a filename that indicates what type of file it is.  For example, in the filename \"myreport.txt,\" the .TXT is the file extension.  It indicates the file is a text document.  Some other examples include .DOCX, which is used for Microsoft Word documents, and .PSD, which is the standard file extension for Photoshop documents.\nWhile most file extensions are three characters in length, they can be as short as one character or longer than twenty characters.  Sometimes long file extensions are used to more clearly identify the file type.  For example, the .TAX2015 file extension is used to identify TurboTax 2015 tax returns and the .DESKTHEMEPACK extension identifies Windows 8 desktop themes.  The file extension determines which program is used to open the file as well as what icon should be displayed for the file.  It also helps you see what kind of file a certain document is by just looking at the filename.\nBoth Windows and Mac OS X allow you to manually change file extensions, which may also change the program the computer uses to open the file.  While this might work for some files, it may also cause the file to not open at all.  For example, if you change a file with a \".txt\" extension to a \".doc\" extension, Microsoft Word may still open it.  However, if you change a \".txt\" file to a \".psd\" file, Photoshop will not recognize or open the file.\nSince there are tens of thousands of file types, there are also tens of thousands of file extensions.  While it may not be possible to remember all of them, it is helpful to learn some of the more common ones, such as .JPG, .GIF, .MP3, .ZIP, .HTML, and others.  For a list of common file extensions and their associated file types, visit FileInfo.com's Common File Types page."
        ]
    },
    {
        "word": "File Format",
        "type": [],
        "definition": [
            "A file format defines the structure and type of data stored in a file.  The structure of a typical file may include a header, metadata, saved content, and an end-of-file (EOF) marker.  The data stored in the file depends on the purpose of the file format.  Some files, such as XML files, are used to store lists of items, while others, such as JPEG image files simply contain a block of data.\nA file format also defines whether the data is stored in a plain text or binary format.  Plain text files can be opened and viewed in a standard text editor.  While text-based files are easy to create, they often use up more space than comparable binary files.  They also lack security, since the contents can be easily viewed by dragging the file to a text editor.  Binary file formats can be compressed and are well-suited for storing graphics, audio, and video data.  If you attempt to view a binary file in a text editor, most of the data will appear garbled and unintelligible, but you may see some header text that identifies the file's contents.\nSome file formats are proprietary, while others are universal, or open formats.  Proprietary file formats can only be opened by one or more related programs.  For example, a compressed StuffIt X (.SITX) archive can only be opened by StuffIt Deluxe or StuffIt Expander.  If you try to open a StuffIt X archive with WinZip or another file decompression tool, the file will not be recognized.  Conversely, open file formats are publicly available and are recognized by multiple programs.  For example, StuffIt Deluxe can also save compressed archives in a standard zipped (.ZIP) format, which can be opened by nearly all decompression utilities.\nWhen software developers create applications that save files, choosing an appropriate file format is important.  For some programs, it might make sense to use an open format, which is compatible with other applications.  In other cases, using a proprietary format may give the developer a competitive advantage, since the files created with the program can only be opened with the developer's software.  However, most people prefer to have multiple software options, so many developers have moved away from proprietary file formats and now use open formats instead.  For example, Microsoft Word, which used to save word processing documents in the proprietary .DOC format now saves documents in the open .DOCX format, which is supported by multiple applications.\nNOTE: While the term \"file format\" technically refers to the structure and content of a file, the term is also used interchangeably with \"file type,\" which defines a specific type of file, such as a rich text file or a Photoshop document."
        ]
    },
    {
        "word": "File Server",
        "type": [],
        "definition": [
            "As the name implies, a file server is a server that provides access to files.  It acts as a central file storage location that can be accessed by multiple systems.  File servers are commonly found in enterprise settings, such as company networks, but they are also used in schools, small organizations, and even home networks.\nA file server may be a dedicated system, such as network attached storage (NAS) device, or it may simply be a computer that hosts shared files.  Dedicated file servers are typically used for enterprise applications, since they provide faster data access and offer more storage capacity than non-dedicated systems.  In home networks, personal computers are often used as file servers.  However, personal NAS devices are also available for home users that require more storage capacity and faster performance than a non-dedicated file server would allow.\nFile servers can be configured in multiple ways.  For example, in a home setting, a file server may be set to automatically allow access to all computers on the local network (LAN).  In a business setting where security is important, a file server may require all client systems to log in before accessing the server.  Others may only grant access to a specific list of machines, which can be defined by MAC address or IP address.  Internet file servers, which provide access to files over the Internet, often require an FTP login before users can download files.\nNOTE: When you connect to a file server on a local network, it usually appears as a hard disk on your computer.  You can double-click the hard disk icon to view the contents and browse through directories on the server, just like local folders.  If you want to copy a file from the server to your computer, simply drag the file to your desktop or another folder on your local disk.  If the file server has write permissions enabled, you can also copy local files to the server by dragging them to a directory on the server.  When you copy files to or from the file server, it may appear that they are simply being transferred from one local folder to another.  However, the files are actually being transferred across the network."
        ]
    },
    {
        "word": "File System",
        "type": [],
        "definition": [
            "Most people have several thousand files on their computer's hard disk, so imagine how hard it would be to find anything if the files were not organized.  Fortunately, all hard disks use a file system, which organizes all the files on the disk.  The file system is created when you initialize or format your hard disk.  It sets up the root directory and subsequent directories beneath it.  The file system allows you to create new files and folders, which are added to different parts of the \"file tree\" on your hard disk.\nFor example, your hard disk probably has separate folders for programs, documents, pictures, music, and movie files.  Within these folders, there are likely other folders that futher organize your files.  All these folders (or directories) are organized by your computer's file system.  There are also several folders your computer's operating system uses to store system files, such as startup data and system preferences.  Some of these folders are invisible to the user, but are recognized by the computer's file system.\nOlder Windows machines used a file system called FAT32, while newer Windows computers use NTFS.  Macintosh computers used the HFS file system for a long time, but now use an updated version of HFS, called HFS+.  Though you typically don't need to know all the details of your computer's file system, it is nice to know that it is always working to keep your files organized."
        ]
    },
    {
        "word": "File Type",
        "type": [],
        "definition": [
            "A file type is a name given to a specific kind of file.  For example, a Microsoft Word document and an Adobe Photoshop document are two different file types.  While these file types are associated with individual applications, other file types, such as rich text RTF files and MP3 audio files are standard file types that can be opened by multiple programs.\nThe terms \"file type\" and \"file format\" are often used interchangeably.  However, a file format technically describes the structure and content of a file.  For example, the file type of an image file saved using JPEG compression may be defined as a \"JPEG image file.\"  The file format might be described as a binary file that contains a file header, metadata, and compressed bitmap image data.\nEach file type has one or more corresponding file extensions.  For example, JPEG image files may be saved with a .JPG or .JPEG extension, while Adobe Photoshop image files are saved with a .PSD extension.  The file extension appended to the end of each filename provides a simple way of identifying the file type of each file.  File extensions are also used by the operating system to associate file types with specific programs.  The relationships between file types and programs are called file associations and define what program opens each file type by default.\nYou can view a list of common file types at FileInfo.com."
        ]
    },
    {
        "word": "Filename",
        "type": [],
        "definition": [
            "A filename is a text string that identifies a file.  Every file stored on a computer's hard disk has a filename that helps identify the file within a given folder.  Therefore, each file within a specific folder must have a different filename, while files in different folders can have the same name.\nFilenames may contain letters, numbers, and other characters.  Depending on the operating system, certain characters cannot be used since they conflict with operators or other syntax used by the operating system.  Different operating systems also have different limits for the number of characters a filename can have.  While older operating systems limited filenames to only 8 or 16 characters, newer OS's allow filenames to be as long as 256 characters.  Of course, for most practical purposes, 16 characters is usually enough.\nFilenames also usually include a file extension, which identifies the type of file.  The file extension is also called the \"filename suffix\" since it is appended to the filename, following a dot or period.  For example, a Microsoft Word document may be named \"document1.doc.\"  While technically the filename in the preceding example is \"document1\" and \"doc\" is the extension, it is also acceptable to refer to \"document1.doc\" as the filename.  In some cases, the filename may even refer to the file's directory location, i.e. (\"\\My Documents\\School Papers\\document1.doc\").\nYou can name a file by clicking on the file's icon or filename, waiting for a second, then clicking on the filename again.  As long as the file is not locked, the filename will become highlighted, and you can type a new name for the file.  You can also name a file the first time you save it from a program or by selecting \"Save As...\" from the program's File menu."
        ]
    },
    {
        "word": "Filter",
        "type": [],
        "definition": [
            "In computing, the term \"filter\" has several different meanings.  Examples include 1) search filters, 2) email filters, and 3) multimedia filters.\n1. Search Filter\nMany search engines allow you to filter search results.  Search filtering allows you to limit the results to a reduced set that matches the filter(s) you select.  For example, Google provides search filtering options in the \"Tools\" menu at the top of the search results page.  You can filter the results to only display webpages that match your query verbatim (exactly as you typed it).  You can filter image results by size, color, file type, and usage rights.\nMany websites' internal search engines allow you to filter results as well.  For example, e-commerce sites like Amazon and Best Buy provide filtering options when you perform a search.  These options are typically found in the left sidebar of the desktop search results page.  By checking different filters, you can fine-tune the results by brand, price ranges, style, rating, etc.\n2. Email Filter\nAn email filter may refer to a spam filter or a custom filter created by a user.  Spam filtering is often handled by the mail server before messages even reach a user's account.  However, several mail clients allow you to create custom junk filters to further reduce the spam, or unwanted mail, that shows up in your inbox.\nYou can also create email filters or \"rules\" that automatically filter messages to specific folders within your email account.  If you get a lot of messages about a particular topic, you can create a rule to automatically filter the messages to a specific folder.  This can make it easier to organize your messages.\n3. Multimedia Filter\nA filter may also refer to a digital effect added to an image, video clip, or audio track.  For example, Photoshop includes a \"Filter\" option in the menu bar that contains several image filters, such as blur, distort, pixelate, and sharpen.  Other image filters can be used to add effects such as vibrant colors or an antique character to an image.  Instagram, for instance, provides dozens of filters for modifying the appearance of photos.\nFilters are so ubiquitous on Instagram, users sometimes use the hashtag #nofilter when captioning photos without a filter.\nFilters may also be applied to audio and video clips.  For example, an audio filter can add extra reverb or chorus to a track.  An autotune filter can be used to correct the pitch of a singer's voice to a specific key.  Video filters can be used to add a specific visual style to a movie, such as black and white film or cinematic color tone.  All multimedia filters are simply algorithms that are applied to digital media to create a desired effect."
        ]
    },
    {
        "word": "Finder",
        "type": [],
        "definition": [
            "The Finder is the desktop interface of Macintosh computers.  It allows users to move, copy, delete, and open files, navigate through folders, and move windows around the desktop.  The Finder loads automatically when the computer starts up and is always running in the background.\nWhile the Finder is a core component of the Mac OS, it is technically an application.  This means users can select the Finder from a list of active applications, either using the Dock or the Command-Tab shortcut.  For example, a user may switch to the Finder so he can open a window and browse to a specific file he wants to open.  Once the user finds the file, he can open it by double-clicking the icon.  Since the Finder is always running in the background, it cannot be quit like other applications.  Instead, the Finder can only be relaunched, which simply restarts the application.\nThe Finder has been part of the Mac OS GUI since its inception and has gradually evolved throughout the years.  It has always included a menu bar, desktop, icons, and windows, but now has several additional features as well.  For example, the current Finder in Mac OS X includes the Dock for easy access to applications and files, an advanced search feature, and Quick Look technology, which allows many types of documents to be viewed directly in the Finder.  The Finder windows now include a sidebar, with shortcuts to disks and folders, and support several viewing options, including Cover Flow, which allows users to flip through previews of documents.\nThe Finder is a fundamental part of the Macintosh operating system and serves as the primary interface between the user and the Mac.  Therefore, if you use a Mac, it may be a good idea to browse through the Finder's menu options and familiarize yourself with all the features the Finder has to offer."
        ]
    },
    {
        "word": "Fintech",
        "type": [],
        "definition": [
            "Fintech combines the words \"finance\" and \"technology\" into a single term.  It describes any industry, product, or service that uses financial technology.  The term is sometimes used in contrast with other tech categories, such as biotech and edtech.\nJust like other businesses, financial companies must evolve and adapt over time.  For example, if a bank does not offer online banking in 2021, it is unlikely to attract any customers.  Therefore, fintech is a necessary component of any financial institution.  Below is a list of different types of fintech a bank might employ.\n\nMobile apps\nMobile check scanning and deposits\nOnline banking\nElectronic statements\nAutomatic investing\nAccount syncing with financial apps\n\nFintech also includes the underlying technologies that enable or simplify financial transactions. Examples include:\n\nCredit cards\nChip readers\nContactless payments (Apple Pay and Google Pay)\nNFC and Bluetooth wireless technologies\nDirect desposit and ACH payments\nData encryption\n\nIn recent years, new financial technologies have emerged, providing new ways to save, spend, and invest money.  Some examples are:\n\nBlockchain\nBitcoin\nSquare payments\nShopify e-commerce stores\nRobinhood investing\n\nBecause security and accuracy are critical to financial transactions, most fintech products and services incorporate secure technologies, such as encryption, TLS, HTTPS, and others.  \"Regtech,\" a subset of fintech, includes products and services used to regulate financial technologies."
        ]
    },
    {
        "word": "Fios",
        "type": [],
        "definition": [
            "Stands for \"Fiber Optic Service.\"  Fios is a telecommunications network owned by Verizon that uses fiber optic cables to transfer data.  It is considered a \"Fiber to the Premises,\" or FTTP service, since it brings fiber optic data transmission to residential homes as well as businesses.  Fios supports data transfer rates of 940 Mbps downstream and 880 Mbps upstream.\nServices include Fios Internet, Fios TV, and Fios Digital Voice.  Fios Internet is a high-speed broadband connection to the Internet where Verizon serves as the ISP.  Fios TV is high-definition television service that provides over 400 channels, similar to cable television.  Fios Digital Voice is similar to a traditional telephone service.  It provides a phone number and supports both domestic and international calls.\nSince Fios uses 100% fiber optic cables, it is one of the fastest Internet services available.  It is also known for its high reliability.  However, Fios is only available in specific areas of the United States that are connected to Verizon's fiber optic network.  To find out if you can get Fios where you live, check Verizon's Fios Availability."
        ]
    },
    {
        "word": "Firewall",
        "type": [],
        "definition": [
            "A physical firewall is a wall made of brick, steel, or other inflammable material that prevents the spread of a fire in a building.  In computing, a firewall serves a similar purpose.  It acts as a barrier between a trusted system or network and outside connections, such as the Internet.  However, a computer firewall is more of a filter than a wall, allowing trusted data to flow through it.\nA firewall can be created using either hardware or software.  Many businesses and organizations protect their internal networks using hardware firewalls.  A single or double firewall may be used to create a demilitarized zone (DMZ), which prevents untrusted data from ever reaching the LAN.  Software firewalls are more common for individual users and can be custom configured via a software interface.  Both Windows and OS X include built-in firewalls, but more advanced firewall utilities can be installed with Internet security software.\nFirewalls can be configured in several different ways.  For example, a basic firewall may allow traffic from all IP addresses except those flagged in a blacklist.  A more secure firewall might only allow traffic from systems or IP addresses listed in a whitelist.  Most firewalls use a combination of rules to filter traffic, such as blocking known threats while allowing incoming traffic from trusted sources.  A firewall can also restrict outgoing traffic to prevent spam or hacking attempts.\nNetwork administrators often custom configure hardware and software firewalls.  While custom settings may be important for a company network, software firewalls designed for consumers typically include basic default settings that are sufficient for most users.  For example, in OS X, simply setting the firewall to \"On\" in the \"Security & Privacy\" System Preference prevents unauthorized applications and services from accepting incoming connections.  Some firewalls even \"learn\" over time and dynamically develop their own filtering rules.  This helps them become more adept at blocking unwanted connections without any manual customization."
        ]
    },
    {
        "word": "Firewire",
        "type": [],
        "definition": [
            "FireWire is an I\/O interface developed by Apple Computer.  It is also known as IEEE 1394, which is the technical name standardized by the IEEE.  Other names for IEEE 1394 include Sony i.Link and Yamaha mLAN, but Apple's FireWire name the most commonly used.\nThere are two primary versions of the FireWire interface – FireWire 400 (IEEE 1394a) and FireWire 800 (IEEE 1394b).  FireWire 400 uses a 6-pin connector and supports data transfer rates of up to 400 Mbps.  FireWire 800 uses a 9-pin connector and can transfer data at up to 800 Mbps.  The FireWire 800 interface, which was introduced on Macintosh computers in 2003, is backwards compatible with FireWire 400 devices using an adapter.  Both interfaces support daisy chaining and can provide up to 30 volts of power to connected devices.\nFireWire is considered a high-speed interface, and therefore can be used for connecting peripheral devices that require fast data transfer speeds.  Examples include external hard drives, video cameras, and audio interfaces.  On Macintosh computers, FireWire can be used to boot a computer in target disk mode, which allows the hard drive to show up as an external drive on another computer.  Mac OS X also supports networking two computers via a FireWire cable.\nWhile FireWire has never been as popular as USB, it has remained a popular choice for audio and video professionals.  Since FireWire supports speeds up to 800 Mbps, it is faster than USB 2.0, which maxes out at 480 Mbps.  In fact, even FireWire 400 provides faster sustained read and write speeds than USB 2.0, which is important for recording audio and video in real-time.  Future versions of IEEE 1394, such as FireWire 1600 and 3200, were designed to support even faster data transfer speeds.  However, the FireWire interface has been superseded by Thunderbolt, which can transfer data at up to 10,000 Mbps (10 Gbps) and is backwards compatible with multiple interfaces."
        ]
    },
    {
        "word": "Firmware",
        "type": [],
        "definition": [
            "Firmware is a software program or set of instructions programmed on a hardware device.  It provides the necessary instructions for how the device communicates with the other computer hardware.  But how can software be programmed onto hardware?  Good question.  Firmware is typically stored in the flash ROM of a hardware device.  While ROM is \"read-only memory,\" flash ROM can be erased and rewritten because it is actually a type of flash memory.\nFirmware can be thought of as \"semi-permanent\" since it remains the same unless it is updated by a firmware updater.  You may need to update the firmware of certain devices, such as hard drives and video cards in order for them to work with a new operating system.  CD and DVD drive manufacturers often make firmware updates available that allow the drives to read faster media.  Sometimes manufacturers release firmware updates that simply make their devices work more efficiently.\nYou can usually find firmware updates by going to the \"Support\" or \"Downloads\" area of a manufacturer's website.  Keeping your firmware up-to-date is often not necessary, but it is still a good idea.  Just make sure that once you start a firmware updater, you let the update finish, because most devices will not function if their firmware is not recognized."
        ]
    },
    {
        "word": "Flag",
        "type": [],
        "definition": [
            "In computer science, a flag is a value that acts as a signal for a function or process.  The value of the flag is used to determine the next step of a program.  Flags are often binary flags, which contain a boolean value (true or false).  However, not all flags are binary, meaning they can store a range of values.\nYou can think of a binary flag as a small red flag that is laying flat when it is false, but pops up when it is true.  A raised flag says to a program, \"Stop - do something different.\"  A common example of a flag in computer programming is a variable in a while loop.  The PHP loop below will iterate until $flag is set to true.\n[cb]\n$flag = false;\n$i = 1;\nwhile (!$flag)  \/\/ stop when $flag is true\n{\n    &nbsp; echo \"$i, \";\n    &nbsp; $i++;   \/\/ increment $i\n    if ($i > 100) $flag = true;\n}\n[\/cb]\nThe above code will print out numbers (1, 2, 3...) until 100.  Then the loop will break because $flag will be set to true.  Using a flag in this context is effective, but unnecessary.  Instead, the while loop condition could have been while ($i &lt; 101) instead of while (!$flag).  This would produce the same result and eliminate the need for the $flag variable.  Efficiently written programs rarely need explicit flags since an existing variable within a function can often be used as a flag.\nA binary flag only requires one bit, which can be set to 0 or 1.  However, bytes have eight bits, meaning seven bits are unused when a single byte stores a binary flag.  While a single byte is still a very small amount of data, a programmer may choose to use a single byte to store multiple binary flags.\nNon-Binary Flags\nNon-binary flags use multiple bits and can store more than \"yes or no\" or \"true or false.\"  These types of flags require more than one bit, but not necessarily a full byte.  For example, two bits can produce four possible options.\n\n00 = option A\n01 = option B\n10 = option C\n11 = option D\n\nYou can think of a non-binary flag as a flag with multiple colors.  A program can check to see if 1) if the multi-bit flag is set and 2) what value it contains.  Depending on the value (or \"color\") of the flag, the program will continue in the corresponding direction."
        ]
    },
    {
        "word": "Flaming",
        "type": [],
        "definition": [
            "Flaming is the act of posting or sending offensive messages over the Internet.  These messages, called \"flames,\" may be posted within online discussion forums or newsgroups, or sent via e-mail or instant messaging programs.  The most common area where flaming takes place is online discussion forums, which are also called bulletin boards.\nFlaming often leads to the trading of insults between members within a certain forum.  This is an unfortunate result, as it often throws the discussion of a legitimate topic well off track.  For example, the topic of a discussion forum may be \"Choosing a Mac or a PC.\"  Some Mac user may post a message gloating about the benefits of a Mac, which in turn prompts a response from a PC user explaining why Macs suck and why Windows is obviously the better platform.  The Mac user may then post a reply saying that Mac users are, in fact, a more intelligent species who are not as naive as PC users.  This kindles a more personal attack from the PC user, which incites an all out flame war.\nThese flame wars, also called \"pie fights,\" are not limited to only two people at a time, but may involve multiple users.  This causes a swell of negatively within online discussion groups and results in little, if any, productively.  Flaming is unfortunately one of the most common breaches of online netiquette.  Instead of being considerate of others' viewpoints, \"flamers\" force their own agendas on other users.\nWhile some flaming is intentional, some is not.  This is because users may misunderstand the intent of a another user's message or forum posting.  For example, someone may make a sarcastic comment that is not understood as sarcastic by another user, who may take offense to the message.  Using emoticons and clearly explaining one's intent can help avoid online misunderstandings.  Because of the adverse effects of flaming, it is best to err on the side of humility and be courteous when posting or sending messages online."
        ]
    },
    {
        "word": "Flash",
        "type": [],
        "definition": [
            "While \"Flash\" was the name of a popular superhero in the 1970s, today the term refers to something completely different.  When you see Flash on the Web, it most likely refers to Adobe Flash, a multimedia technology.  Flash allows Web developers to incorporate animations and interactive content into their websites.\nFlash was originally released by Macromedia in 1996.  It began as a basic animation tool and an optional plug-in for Web browsers.  Over the next decade, Flash gained many new features and became a standard plugin included with nearly all Web browsers.  In 2005, Adobe acquired Macromedia and took over development of the Flash technology.  Today, Flash continues to be a ubiquitous Web standard and is included with all major Web browsers.\nBecause Flash animations can incorporate text and vector graphics, they typically don't take up a lot of disk space.  The contents of a Flash animation may also be compressed to further reduce the file size.  This makes it possible for Flash content to be downloaded relatively quickly.  Still, large Flash animations may still take a few seconds to load in your browser.  Therefore, when you open a Web page and see a \"Loading...\" animation, it usually means Flash content is being downloaded to your computer.\nTo view Flash content in your web browser, the Flash plug-in must be installed.\nFile extensions: .FLA, .SWF\nNOTE: \"Flash\" may also refer to flash memory.  Erasing a flash disk is often called \"flashing\" the memory."
        ]
    },
    {
        "word": "Flash Drive",
        "type": [],
        "definition": [
            "Flash drives have many names &mdash; jump drives, thumb drives, pen drives, and USB keychain drives.  Regardless of what you call them, they all refer to the same thing, which is a small data storage device that uses flash memory and has a built-in USB connection.\nFlash drives are typically no more than two to three inches in length and less than an inch in width.  Their size and shape may resemble a thumb or a small pen (which is where the names \"thumb drive\" and \"pen drive\" come from).  Flash drives are also very thin, often having a depth of less than a centimeter.  Because of their small form factor, they are highly portable and can easily fit in a pocket or on a keychain (hence the name \"keychain drive\").\nEarly flash drives could store only a few megabytes of data, but modern flash drives can store several gigabytes of information.  Since they are small in size but have large storage capacities, flash drives have replaced most previous portable data storage mediums such as floppy disks and removable hard disks like Zip disks.  Because they have a built-in USB connection, flash drives also don't require a special disk drive to be used.  Instead, they can be used on any computer with a USB port, which nearly all modern computers have."
        ]
    },
    {
        "word": "Flash Memory",
        "type": [],
        "definition": [
            "Flash memory is a type of electrically erasable programmable read-only memory (EEPROM).  Whew, that's a mouthful.  The name comes from how the memory is designed -- a section of memory cells can be erased in a single action or in a \"flash.\"  A common use of flash memory is to store the BIOS settings in a computer's ROM.  When the BIOS needs to be changed, the flash memory can be written in blocks, rather than bytes, making it easy to update.  Most modems use flash memory for the same reason. \nThough flash memory was orginally used inside computers, it has invaded many other areas outside the box.  Flash memory cards used for digital cameras, cellular phones, networking hardware, and PC cards.  Though the memory's read\/write speed is not lightning fast, it is nice to be able to tote around a little card rather than a cumbersome hard drive."
        ]
    },
    {
        "word": "Flat File",
        "type": [],
        "definition": [
            "A flat file database is a database that stores data in a plain text file.  Each line of the text file holds one record, with fields separated by delimiters, such as commas or tabs.  While it uses a simple structure, a flat file database cannot contain multiple tables like a relational database can.  Fortunately, most database programs such as Microsoft Access and FileMaker Pro can import flat file databases and use them in a larger relational database.\nFlat file is also a type of computer file system that stores all data in a single directory.  There are no folders or paths used organize the data.  While this is a simple way to store files, a flat file system becomes increasingly inefficient as more data is added.  The original Macintosh computer used this kind of file system, creatively called the Macintosh File System (MFS).  However, it was soon replaced by the more efficient Hierarchical File System (HFS) that was based on a directory structure."
        ]
    },
    {
        "word": "Flatbed",
        "type": [],
        "definition": [
            "A flatbed is a type of scanner or copier that uses a flat, glass surface for scanning documents or other objects.  Most flatbed scanners have an adjustable lid that can be raised to allow magazines, books, and other thick objects to be scanned.  This is a significant benefit over sheet-fed scanners or copiers (sometimes referred to as automatic document feeders, which can only accept paper documents.\nFlatbed scanners and copy machines range in size from standard letter size (8.5\"x11\") to legal size and beyond.  For example, a scanner used to scan architectural blueprints may be the size of several letter-size scanners.  Because of their large size capacity and ability to scan thick objects, flatbed scanners are more versatile than sheet-fed scanners.  However, they cannot automatically feed pages into the scanner, which means scanning multiple pages can be a time-consuming process.  For this reason, some scanners and copy machines include both a flatbed scanning surface for large or thick objects, and an ADF for feeding multiple pages at once."
        ]
    },
    {
        "word": "Flexible",
        "type": [],
        "definition": [
            "In the computer world, \"flexible\" may refer to hardware, software, or a combination of the two.  It describes a device or program that can be used for multiple purposes, rather than a single function.\nAn example of a flexible hardware device is a hybrid tablet that also functions as a laptop.  The Microsoft Surface, for instance, is more flexible than typical tablet, since it can also be used as a Windows laptop.  A router that can serve as a firewall for both internal and external networks might also be considered flexible.  Instead of being limited to filtering traffic from the Internet, a flexible router may be used to filter traffic within a local network as well.\nHorizontal market software, which is used across multiple industries, is a common type of flexible software.  Spreadsheet programs, for example, are flexible because they provide a range of uses, such as managing team rosters, tracking inventory, and organizing finances.  A professional design program like Adobe InDesign may be considered flexible, since it can be used to create digital layouts for print, web, and electronic publications.  Web browser are flexible since they serve many different purposes.  Besides surfing the web, you can use a browser to check email, interact with social media sites, play games, and run various web applications.\nFlexible hardware and software products provide extra value since they can be used in many different ways.  However, flexibility is not always important.  In some cases, a device or program designed for a specific purpose can perform a task better than a multipurpose solution."
        ]
    },
    {
        "word": "Floating Point",
        "type": [],
        "definition": [
            "As the name implies, floating point numbers are numbers that contain floating decimal points.  For example, the numbers 5.5, 0.001, and -2,345.6789 are floating point numbers.  Numbers that do not have decimal places are called integers.\nComputers recognize real numbers that contain fractions as floating point numbers.  When a calculation includes a floating point number, it is called a \"floating point calculation.\"  Older computers used to have a separate floating point unit (FPU) that handled these calculations, but now the FPU is typically built into the computer's CPU."
        ]
    },
    {
        "word": "Floppy Disk",
        "type": [],
        "definition": [
            "Floppy disks have an interesting name, considering they do not appear to be \"floppy.\"  However, if you take the actual disk out of the protective casing, you will discover that the disk is, in fact, rather flexible.  It is coated with iron oxide and stores data magnetically, just like a hard disk.\nThe first floppy disks were created in 1969, the same year the Internet had its origin.  These disks were 8 inches in diameter and were read-only, like a CD-ROM, meaning no data could be written to them by the user.  The first 8 inch disks only held 80KB of data, but later versions could hold as much as 800KB.\nIn 1978, a 5.25 inch disk was introduced, which could hold a whopping 360KB of data.  Later revisions of the 5.25 inch floppy disk could store 1.2MB.  These disks were used in early desktop PCs, such as the Apple IIe.  In 1987, the 3.5 inch HD (high density) floppy disk was released, which could hold 1.44MB after being formatted.  These disks were a little more durable than the 5.25 inch disks and were also more portable.  For the next decade, the 3.5 inch floppy disk became the standard means of distributing commercial software titles and backing up personal data.\nIn the late 1990s, CD-ROMs began to replace floppy disks as the standard means of distributing software.  A few years later, consumers began migrating to recordable CDs for backing up their data.  Apple's original iMac, released in 1998, was the first mainstream computer to not even include a floppy disk drive.  While it took several years, many PC manufacturers eventually followed suit.\nNow most software is distributed on CDs and DVDs and most people back up their data either on recordable CDs or USB flash drives.  Floppy disks are finally becoming a thing of the past, which is good, considering they are notorious for losing data.  Still, the floppy disk will always have a special place in the hearts and minds of veteran computer users as it was the data storage medium many people grew up with."
        ]
    },
    {
        "word": "Flowchart",
        "type": [],
        "definition": [
            "A flowchart is a diagram that describes a process or operation.  It includes multiple steps, which the process \"flows\" through from start to finish.  Common uses for flowcharts include developing business plans, defining troubleshooting steps, and designing mathematical algorithms.  Some flowcharts may only include a few steps, while others can be highly complex, containing hundreds of possible outcomes.\nFlowcharts typically use standard symbols to represent different stages or actions within the chart.  For example, each step is shown within a rectangle, while each decision is displayed in a diamond.  Arrows are placed between the different symbols to show the direction the process is flowing.  While flowcharts can be created with a pen and paper, there are several software programs available that make designing flowcharts especially easy.  Common programs that can be used to create flowcharts include SmartDraw and Visio for Windows and OmniGraffle for the Mac."
        ]
    },
    {
        "word": "Fluid Layout",
        "type": [],
        "definition": [
            "A fluid layout is a type of webpage design in which layout of the page resizes as the window size is changed.  This is accomplished by defining areas of the page using percentages instead of fixed pixel widths.\nMost webpage layouts include one, two, or three columns.  In the early days of web design, when most users had similar screen sizes, web developers would assign the columns fixed widths.  For example, a fixed layout may include a main content area that is 960px wide with three columns that have widths of 180px, 600px, and 180px.  While this layout might look great on a 1024x768 screen, it might look small on a 1920x1080 screen and would not fit on a 800x600 screen.\nFluid layouts solve this problem by using percentages to define each area of the layout.  For example, instead of creating a content area of 960px, a web developer can create a layout that fills 80% of the screen and the three columns could take up 18%, 64%, and 18% respectively.  By using percentages, the content can expand or shrink to fit the window of the user's computer.  The CSS used to create a fixed layout vs a fluid layout is shown below.\n\nFixed LayoutFluid Layout\n\n\n.content { width: 960px; }\n.left, .right { width: 180px; }\n.middle { width: 600px; }\n\n\n.content { width: 80%; }\n.left, .right { width: 18%; }\n.middle { width: 64%; }\n\n\n\nThe CSS classes in the examples could each be assigned to a div within a page's HTML where the .left, .right, and .middle classes are enclosed within the .content class.  The content class could also be a assigned to a table and the other classes could be assigned to table cells.  The fixed width .content class does not require a defined width since it automatically spans the width of the enclosed divs or table cells.\nFluid Layout vs Responsive Design\nThe terms \"fluid layout\" and \"responsive web design\" are sometimes used interchangeably, but they are two different things.  A page created using responsive web design includes CSS media queries, which load different styles depending on the width of the window or the type of device used to access the page.  Responsive web design requires more CSS (and sometimes JavaScript) than a basic fluid layout, but it also provides more control over layout of the page."
        ]
    },
    {
        "word": "Focus",
        "type": [],
        "definition": [
            "In computer terminology, focus means to select an element within a user interface.  When an item is \"focused,\" it can be controlled using keyboard input.  For example, clicking within a search box on a webpage focuses the field, allowing you to enter text.\nFocused text fields often display a visual indicator, such as an outline or halo.  In the example below, the Name field is focused within the web form.\n\nWeb browsers allow you to press the Tab key to cycle through focusable elements on a page.  While text fields are focused by default, web developers can make other items focusable, including links, buttons, and other elements.  It is also possible to choose the \"tab order\" of these items using the tabindex HTML attribute.  The element assigned to tabindex=0 is focused when the user presses Tab, followed by tabindex=1, tabindex=2, etc.\nAccessibility\nFocusing items is essential for users with accessibility needs.  Most browsers only focus form fields, but ones with assistive technology allow users to focus other elements, such as links and buttons.  For example, tabbing to a link within the page content and pressing Enter is the same as clicking the link.  This technology enables users to navigate webpages without using a mouse."
        ]
    },
    {
        "word": "Folder",
        "type": [],
        "definition": [
            "A digital folder has the same purpose as a physical folder – to store documents.  Computer folders can also store other types of files, such as applications, archives, scripts, and libraries.  Folders can even store other folders, which may contain additional files and folders.\nFolders are designed for organizing files.  For example, you might store your digital photos in a \"Pictures\" folder, your audio files in a \"Music\" folder, and your word processing documents in a \"Documents\" folder.  In Windows, software programs are installed by default in the \"Program Files\" folder, while in OS X they are stored in the \"Applications\" folder.\nFolders are also called directories because of the way they organize data within the file system of a storage device.  All folders are subfolders, or subdirectories of the root directory.  For example, in Windows, C:\\ is the root directory of the startup disk.  The Internet Explorer application is installed in the C:\\Program Files\\Internet Explorer directory, which is also the directory path of the Internet Explorer folder.\nWhile folders may contain several gigabytes of data, folders themselves do not take up any disk space.  This is because folders are simply pointers that define the location of files within the file system.  You can view how much data is stored in a folder by right-clicking it and selecting Properties in Windows or Get Info in OS X.  To create a new folder, right-click on the desktop or an open window and select New &rarr; Folder (Windows) or New Folder (OS X)."
        ]
    },
    {
        "word": "Font",
        "type": [],
        "definition": [
            "A font is a collection of characters with a similar design.  These characters include lowercase and uppercase letters, numbers, punctuation marks, and symbols.\nChanging the font can alter the look and feel of a block of text.  Some fonts are designed to be simple and easy to read, while others are designed to add a unique style to the text.  For example, Arial has a simple, modern look, while Palatino has an older more traditional appearance.\nSerif vs Sans-Serif Fonts\nThe two most basic categories of fonts are \"serif\" and \"sans-serif.\"  Small extensions on the edges of characters, such as horizontal line on the bottom of a capital \"T,\" are called serifs.  Fonts that include these small lines are called serif fonts.  The word \"sans\" means \"without,\" so sans-serif fonts do not have these extra lines.  Generally, serif fonts have a traditional appearance and are often used in printed books and newspapers.  Sans-serif fonts have a more modern look and are commonly used on the web.\nMost word processors allow you to select a font from a \"Fonts\" drop-down menu in the toolbar.  You can apply a font to an entire document or to a section of highlighted text.  In order to use a font, it must be installed on your computer.  In Windows, you can add or remove fonts using the Fonts control panel, located in Control Panel &rarr; Appearance and Personalization &rarr; Fonts.  In macOS, you can manage fonts using Font Book, located in the \/Applications directory.\nFont vs Typeface\nOriginally, the term \"font\" referred to a specific size and style of a typeface.  For example, Verdana was a typeface and Verdana 16px bold would be a specific font.  However, in recent years, the terms have been used interchangeably, with companies like Microsoft, Apple, and Google all using the term \"font\" to describe a typeface.  Therefore, it is acceptable to refer to a typeface such as Roboto as a font.\n"
        ]
    },
    {
        "word": "Font Case",
        "type": [],
        "definition": [
            "Font case describes the way characters are capitalized within a word or phrase.  \"Font\" refers to the typeface used to display the letters, while \"case\" refers to their capitalization.  Below are examples of different font cases, shown in their corresponding style.\n\nUPPER CASE - every character is capitalized\nlower case - no letters are capitalized\nSentence case - the first letter of the first word in a sentence is capitalized\nTitle Case - the first letter of each word is capitalized\ncamelCase - the first letter of each word within a compound word, besides the first word, is capitalized\nPascalCase - the first letter of each word within a compound word, including the first word, is capitalized\ntoGGLe caSe - random characters are capitalized\n\nSpecific font cases are appropriate for various applications.  For example, sentence case is the grammatically correct way to type a sentence.  Title case is used for proper names and titles of articles.  Upper case (also \"uppercase\" or \"ALL CAPS\") can be used to bring attention to a specific word or phrase.  Lower case (also \"lowercase\") is commonly used in online chat and text messaging since it is the fastest way to type messages.\nProgrammers use camelCase when writing source code.  PascalCase (sometimes called \"UpperCamelCase\" is an alternative version that some developers prefer.  Toggle case may be used to modify the appearance of a handle or online identity, such as an eSports player name.  \nIt is important to use the correct font case when publishing professional articles and writing formal messages.  Font case is less important with informal communication.  For example, it is acceptable to type a text message in all lower case, but it is unprofessional to only use lower case when corresponding via email.  If you only use upper case, it SEEMS LIKE YOU ARE SHOUTING.  Keeping caps lock off and using the Shift key appropriately will help you communicate more effectively.\nNOTE: In macOS, you can select Edit &rarr; Transformations while working in a text editor to apply a specific font case to a block of selected text.  Options include Make Upper Case, Make Lower Case, and Capitalize, which transforms the selected text to title case."
        ]
    },
    {
        "word": "Footer",
        "type": [],
        "definition": [
            "The term \"footer\" has many uses in the computer world.  However, the two most common are 1) a document footer, and 2) a webpage footer.\n1. Document Footer\nA document footer is a small section at the bottom of each page within a document.  It is often used to display company data or copyright information.  In longer documents, the footer may be used to specify the current section of the document as well.  By default, changes made to the footer on one page will change the footer on all other pages in the section.  If no sections are defined, modifying the footer will update all the pages in the document.\nMost word processors allow you to view and edit document footers by selecting View &rarr; Headers and Footers.  This enables you to edit the content of both the header at the top of the page and the footer at the bottom.  Some word processors, like Microsoft Word, allow you to simply double-click within the footer section to edit the content.  If you want to change the height of the footer, you can modify the margins in the Document Properties window.\nSince page numbers are often placed at the bottom of each page, they are generally considered part of the footer.  However, unlike most footer content, page numbers are different on each page, since they are automatically incremented.  Additionally, changes made to the footer will not affect the page numbers.\n\n2. Webpage Footer\nThe bottom section of a webpage is also known as a footer.  This area typically contains the name of the company or organization that publishes the website, along with relevant copyright information.  Some websites may also include basic navigation links, such as \"About Us,\" \"Contact,\" and \"Help.\"  Corporate website footers often include additional links to \"Terms of Use,\" \"Privacy Guidelines,\" and \"Advertising\" pages as well.\nWhile footers are not required on webpages, they are found on nearly all major websites.  HTML 5 even includes a &lt;footer&gt; tag, which is designed specifically for placing footer information at the bottom of a webpage.  Additionally, visitors often expect to find certain information about a website when they scroll down to the bottom of a page in their web browser.  Therefore, most web developers include a footer as a standard part of their website template."
        ]
    },
    {
        "word": "Fork",
        "type": [],
        "definition": [
            "In software development, a fork is a new application developed from an existing one.  When an application is \"forked,\" it creates a new, separate program, rather than a new development branch.  Open-source project forks are more common than proprietary software forks, but both are possible.\nOpen-Source Software\nBecause open-source software may be freely distributed and edited, anyone can legally fork an open-source application.  The codebase of any open-source program or operating system may be used as the basis of a new project.  Most Linux distributions, for example, are forks from earlier Linux-based operating systems.  Because of Linux's popularity and open-source code base, hundreds of Linux forks exist.\nExamples of applications created from forks of open-source code libraries include:\n\nLibreOffice, from OpenOffice.org\nCollabora Online, from LibreOffice\nCalligra, from KOffice\nBasilisk, from Firefox\n\nProprietary Software\nSince the source code of proprietary software is protected by copyright, outside developers cannot fork a commercial application.  However, a developer may wish to fork an application to create a slightly different version for another purpose.  For example, a developer may fork an image editor to create a read-only image viewer that prevents users from modifying files.\nNOTE: Unlike a mod, which alters or adds features to an existing application, a fork is a new, distinct program with a different name."
        ]
    },
    {
        "word": "Form",
        "type": [],
        "definition": [
            "A form is a user interface element within a website or software application that allows you to enter and submit data.  It contains one or more fields and an action button, such as Save or Submit.\nWeb Forms\nWeb forms allow you to submit information to a website via a web browser.  Examples include registration forms, online surveys, and contact forms.  When you click Submit, the web server hosting the website processes the data you entered in the form.  For example, a feedback form may send an email to the webmaster.  A registration form may create a new account in a database.\nA web form is a standard HTML element, created using the &lt;form&gt; tag.  Elements within a form may include:\n\n&lt;input type=\"text\"&gt; – a one-line text input field for name, email address, etc.\n&lt;textarea&gt; – a large text field that supports multiple lines of text; often used for messages\n&lt;select&gt; – a drop-down menu with multiple options, defined by &lt;option&gt; tags\n&lt;input type=\"hidden\"&gt; – a hidden field used to submit additional data, such as a timestamp or referring page URL\n&lt;input type=\"submit\"&gt; – a button used for submitting the data entered in the form.\n\nNOTE: Form data is often processed by a server-side script, but form validation (such as verifying required fields) is usually performed by client-side JavaScript or HTML checks.\nApplication Forms\nWhile forms are commonly associated with websites, many software programs also include forms.  For instance, database applications allow you to create custom forms to enter data more quickly.  Media converters provide forms that enable you to choose audio and video compression settings.  All dialog boxes, such as Print and Save As windows, are considered forms because they include selectable options and a primary action button."
        ]
    },
    {
        "word": "Format",
        "type": [],
        "definition": [
            "The term \"format\" has several meanings, related to 1) disk formatting, 2) page formatting, and 3) file formats.\n1) Disk formatting\nIn order for storage media, such as a hard drive or flash drive to be recognized by your computer, it first needs to be initialized, or \"formatted.\"  Formatting a disk involves testing the disk and writing a new file system onto the disk.  This enables the computer to read the disk's directory structure, which defines the way files and folders are organized on the disk.\nYou can use a disk utility program to format or reformat a disk.  This will create a blank, empty disk for storing your files.  Therefore, only format disks that don't contain important data or make sure you have backed up your data before reformatting a disk!\nWhen you reformat a disk, it will appear to be empty.  This is because the directory structure has been rewritten, making the entire disk space available for writing new data.  However, the old files are still on the disk.  They just don't show up since they are no longer included in the directory structure.  So if you accidentally format a disk (which is pretty hard to do), you may be able to retrieve your files using a disk utility such as Norton Disk Doctor or DiskWarrior.\n2) Page formatting\nThe term \"format\" can also be used to describe the page layout or style of text in a word processing document.  When you format the layout of a page, you can modify the page size, page margins, and line spacing.  When you format the text, you can choose the font and font size, as well as text styles, such as bold, underlined, and italics.\n3) File formats\nA file format refers to the way data is saved within a file.  For example, some files are saved in a plain text format, while others are saved as binary files.  Software developers often create proprietary file formats for their programs, which prevents the files from being used by other applications."
        ]
    },
    {
        "word": "Formula",
        "type": [],
        "definition": [
            "The term \"formula\" has several different meanings, depending on the field in which the term is used.  For example, a mathematical formula is a relationship expressed using numbers and symbols.  A chemical formula defines the atomic structure of a chemical compound.  In computing, a formula is a calculation performed on one or more variables.\nFormulas and Functions\nFunctions in computer programs often contain formulas.  A simple formula, for instance, might convert centimeters to inches.  This formula, along with several others, may be used within a metric conversion function.  The function can apply the appropriate formula to the input (typically defined by the input parameters) and produce the resulting value as output.  Formulas and functions are similar and sometimes the terms are used interchangeably.  However, formulas are often the building blocks of functions, not the other way around.\nSpreadsheet Formulas\nFormulas are also used in spreadsheets.  Most spreadsheet applications allow you to enter formulas into cells instead of static data.  For example, if a spreadsheet contains numbers in columns A and B, column C could be used to total the numbers in the respective rows of columns A and B.  Entering the formula \"=A2+B2\" in cell C2 would display the sum of the cells A2 and B2 in C2.  Advanced spreadsheet formulas can be used to determine the average of multiple cells, divide cells by the results of other formulas, and perform other complex operations.\nNOTE: To enter a formula in a spreadsheet, start by typing an equal sign (=) into an empty cell."
        ]
    },
    {
        "word": "Fragmentation",
        "type": [],
        "definition": [
            "The most efficient way to store a file is in a contiguous physical block.  However, over time, as a storage device reads and writes data, fewer blocks of free space are available.  In some cases, it may be necessary to split a file into multiple areas of a storage device.  This is called file fragmentation.\nWhile computers can read fragmented files, it is less efficient than reading a file saved in a single block.  When an HDD accesses a fragmented file, the drive head has to jump to multiple areas to read it, which can cause a noticeable slowdown.  Fragmentation may also occur on an SSD, and while the effect isn't as significant, it will still take longer for an SSD to read a fragmented file.  If your HDD or SSD has a large number of fragmented files, it can significantly affect your computer's performance.\nIdeally, an HDD or SSD would have no fragmented files and different types of data would be organized into to different physical areas of the storage device.  For example, system files, applications, and documents would all be organized into separate groups.  This arrangement would provide the most efficient data access with the shortest seek time, and therefore the fastest performance.  A defragmentation utility can defragment individual files, while an optimization utility will actually separate and move different types of files to different areas of the storage device.\nSince fragmentation can cause disk performance to decline over time, most modern operating systems include some level of automatic defragmentation.  While the OS may not offer as comprehensive defragmentation as a specialized disk utility, it can still help maintain the performance of your storage device.\nNOTE: Another type of fragmentation is memory fragmentation, which refers to fragmented data in RAM.  When memory is becomes fragmented, more RAM is allocated than what is used, resulting in less available memory."
        ]
    },
    {
        "word": "Frame",
        "type": [],
        "definition": [
            "In the computer world, a frame can be many different things.  The different definitions of \"frame\" are listed below:\n\nSome Web sites use HTML frames, where the pages are broken up into various areas.  Each area consists of an independent Web page.  Frames allow the multiple Web pages to all show up in the same page.\nGraphics and desktop publishing programs also use frames.  In these programs, frames are rectangular areas meant for inserting graphics and text.  They allow users to place objects wherever they want to on the page.\nIn video and animation, frames are individual pictures in a sequence of images.  For example, a Flash movie you see on the Web may play 12 frames per second, creating the appearance of motion.  Most video is shot at 24 or 30 frames per second, or FPS.  FPS is often measured in 3D games as a way of checking how fast the graphics processor of a computer is.\n\n"
        ]
    },
    {
        "word": "Framework",
        "type": [],
        "definition": [
            "A framework, or software framework, is a platform for developing software applications.  It provides a foundation on which software developers can build programs for a specific platform.  For example, a framework may include predefined classes and functions that can be used to process input, manage hardware devices, and interact with system software.  This streamlines the development process since programmers don't need to reinvent the wheel each time they develop a new application.\nA framework is similar to an application programming interface (API), though technically a framework includes an API.  As the name suggests, a framework serves as a foundation for programming, while an API provides access to the elements supported by the framework.  A framework may also include code libraries, a compiler, and other programs used in the software development process.\nSeveral different types of software frameworks exist.  Popular examples include ActiveX and .NET for Windows development, Cocoa for Mac OS X, Cocoa Touch for iOS, and the Android Application Framework for Android.  Software development kits (SDKs) are available for each of these frameworks and include programming tools designed specifically for the corresponding framework.  For example, Apple's Xcode development software includes a Mac OS X SDK designed for writing and compiling applications for the Cocoa framework.\nIn many cases, a software framework is supported natively by an operating system.  For example, a program written for the Android Application Framework will run on an Android device without requiring other additional files to be installed.  However, some applications require a specific framework in order to run.  For example, a Windows program may require Microsoft .NET Framework 4.0, which is not installed on all Windows machines (especially PCs running older versions of Windows).  In this case, the Microsoft .NET Framework 4 installer package must be installed in order for the program to run.\nNOTE: While frameworks generally refer to broad software development platforms, the term can also be used to describe a specific framework within a larger programming environment.  For example, multiple Java frameworks, such as Spring, ZK, and the Java Collections Framework (JCF) can be used to create Java programs.  Additionally, Apple has created several specific frameworks that can be accessed by OS X programs.  These frameworks are saved with a .FRAMEWORK file extension and are installed in the \/System\/Library\/Frameworks directory.  Examples of OS X frameworks include AddressBook.framework, CoreAudio.framework, CoreText.framework, and QuickTime.framework."
        ]
    },
    {
        "word": "Freeware",
        "type": [],
        "definition": [
            "Freeware is software that is free to use.  Unlike commercial software, it does not require any payment or licensing fee.  It is similar to shareware, but will not eventually ask you for payment to continue using the software.  You can legally download and use freeware for as long as you want without having to pay for it.\nMany types of software programs are offered as freeware, including games, utilities, and productivity applications.  Since the software is free, you might wonder what incentive developers have to create freeware programs.  Below are a few reasons a program might be offered as freeware:\n\nTo offer a program developed by a non-profit or educational institution to the public\nTo promote a brand or drive traffic to a company's website\nTo generate revenue through advertisements or in-app purchases within the program\nTo generate revenue by offering other programs during the installation process\nTo provide a \"lite\" version of a program that may lead users to upgrade to the full-featured version\n\nWhile freeware is free to use, it is still copyrighted and may include a license agreement that restricts usage or distribution of the software.  It is also not the same thing as open source software (or \"free software\"), which allows you to edit and redistribute the program's source code."
        ]
    },
    {
        "word": "Frequency",
        "type": [],
        "definition": [
            "Frequency measures the number of times something occurs in a specific amount of time.  For example, if someone visits the grocery store twice a week, her shopping frequency is 2 visits per week.  While frequency can be used to measure the rate of any action, in technical applications it is typically used to measure wave rates or processing speed.  These frequencies often occur multiple times per second and therefore are measured in hertz (Hz) or related units of measurement, such as megahertz or gigahertz.\nWave Rates\nFrequency can be used to measure the rate of waves, such as sound waves, radio waves, and light waves.  Audible sound waves have a frequency of roughly 20 Hz to 20,000 Hz (20 kilohertz).  Therefore, the sounds you hear have waves that occur anywhere from 20 to 20,000 times per second.  Lower frequencies produce low-pitched sounds and are called bass frequencies.  Higher frequencies produce high-pitched sounds and are called treble frequencies.\nSound waves are compression waves, which actually move small amounts of air particles.  Other waves, such as radio waves and light waves do not require air particles to travel.  These waves are part of the electromagnetic spectrum and generally have much higher frequencies than sound waves.  For example, most radio waves are measured in megahertz (1,000,000 hertz) or gigahertz (1,000,000,000 hertz).  Visible light has a frequency of about 400 terahertz to 780 terahertz.\nProcessing Speed\nIn the computer world, frequency is often used to measure processing speed.  For example, clock speed, measures how many cycles a processor can complete in one second.  If a computer has a 3.2GHz processor, it can can complete 3,200,000,000 cycles per second.  FLOPS, which is used to measure floating point performance, is also a frequency-based calculation (operations per second).  Finally, computing speed may also be defined in MIPS, which measures instructions per second."
        ]
    },
    {
        "word": "Friend",
        "type": [],
        "definition": [
            "A friend, in the traditional sense of the word, is a close acquaintance.  An online friend, however, is simply a person added to your list of friends on a social networking website.\nFor example, on Facebook, you can select a user and click \"Add as Friend\" to send a friend request to that user.  When the user receive your friend request, he or she may choose to accept or decline the invitation.  If the user accepts your request, he or she will be added to your list of friends.  Likewise, you will be added to that user's list of friends as the same time.  MySpace includes a similar feature.\nOnce you become friends with a user, that person will be able to access your profile with the additional viewing rights.  This means he or she may be able to view more or your profile and post comments on the \"wall\" of your profile page.  Since non-friends may not be able to view any of your profile, it is common practice to accept most friend requests.  Of course, this has led to a rather liberal definition of \"friend,\" since many people have hundreds of online friends who they hardly know.\nThe word \"friend\" can also be used as a verb, which means adding a user as a friend.  When you delete a friend, you \"unfriend\" that person."
        ]
    },
    {
        "word": "Friendly URL",
        "type": [],
        "definition": [
            "A friendly URL is a Web address that is easy to read and includes words that describe the content of the webpage.  This type of URL can be \"friendly\" in two ways.  1) It can help visitors remember the Web address, and 2) it can help describe the page to search engines.\nUser-Friendly URLs\nFriendly URLs that are short and easy to remember are considered \"user-friendly URLs.\"  These URLs help visitors remember web addresses, which means they can revisit pages by simply typing in the URL address bar.  For example, a company may use the URL \"www.[company].com\/support\/\" for the support section of their website.  This is much easier to remember than a long convoluted URL, like \"www.[company].com\/section\/support\/default.aspx?id=1&amp;lang=en\".\nSince dynamic sites often load different content based on the variables in the URL (which are usually listed after the question mark), creating user-friendly URLs is not always easy.  Therefore, many webmasters now use a strategy called \"URL rewriting\" to create simpler URLs.  This method tells the Web server to load a different URL than the one in the address bar.  Therefore, a simple Web address can point to a more complex URL with lots of variables.  Since the URL is redirected at the server level, visitors only see the simple Web address.\nSearch Engine-Friendly URLs\nWhile user-friendly URLs are helpful for visitors, most webmasters are more concerned with creating search engine-friendly URLs.  These URLs include important keywords that describe the content of the page.  Since most search engines include the Web address as part of the information that describes a page, placing keywords in the URL can help boost the ranking of the page.  Therefore, this strategy has become a popular aspect of search engine optimization or SEO.\nFor example, a blog that includes tips for Windows 7 may have a URL like \"blogger.blogger.com\/2011\/02\/windows7.html\".  A search engine friendly version of this URL may be \"blogger.blogger.com\/2011\/02\/helpful-tips-for-using-windows-7.html\".  While this type of descriptive URL may help with search engine ranking, it is important not to create ridiculously long URLs just to describe the page.  After all, search engines still focus primarily on the content of each page when indexing websites."
        ]
    },
    {
        "word": "Frontend",
        "type": [],
        "definition": [
            "The frontend of a software program or website is everything with which the user interacts.  From a user standpoint, the frontend is synonymous with the user interface.  From a developer standpoint, it is the interface design and the programming that makes the interface function.  Conversely, the backend includes functions and data processing that takes place behind the scenes.\nOne of the primary goals of frontend development is to create a smooth or \"frictionless\" user experience.  In other words, the front end of an application or website should be intuitive and easy to use.  While this sounds like a simple goal, it can be surprisingly complex since not all users or devices are the same.  For example, an app developed for a mobile device requires a significantly different frontend than a desktop application.  Websites must work well on multiple devices and screen sizes, which is why modern web development typically involves responsive design.\nExamples of frontend elements include:\n\napplication or page layout\ngraphics\naudio and video elements\ntext content\nuser interface elements (buttons, links, toolbars, navigation bars, etc.)\ninput areas (dialog boxes), form fields, text areas, etc.)\nuser flow (how one interface leads to the next)\nuser preferences, themes, and customizations\n\nUser input is received through the frontend and processed in the backend of a program or website.  Backend code reads and writes data and sends output to the user via the frontend.  Since the backend and frontend of an app or website work together, software jobs often require both frontend and backend development.  Developing for both ends is called full-stack development.\nNOTE: Frontend may also be written \"front end\" (as a noun) or \"front-end\" (as an adjective).  For simplicity, the closed compound word \"frontend\" has become an acceptable term for both."
        ]
    },
    {
        "word": "Frozen",
        "type": [],
        "definition": [
            "While \"frozen\" describes the state of Minnesota from November to March, it also refers to an unresponsive computer.  When a computer does not respond to any user input, it is said to be frozen.  When a computer system freezes, or \"locks up,\" the screen stays the same and does not change no matter what buttons you press on your mouse or keyboard.  You can tell if you computer has frozen if the cursor will not move when you move the mouse.\nA computer typically freezes due to a software malfunction that causes the operating system to \"hang.\"  This may happen because of many possible reasons, including a memory leak, an infinite calculation, or another reason.  A computer can also freeze because of a hardware malfunction, such as a bad RAM chip or a processor error.\nSince computers are not supposed to freeze, a software crash is often due to a software programming error or unrecognizable input.  Fortunately, modern operating systems, such as Mac OS X are designed so that if one program crashes, it will not affect other programs and the computer will not freeze.\nIf your computer does freeze, you will need to restart the computer to make it function again.  You can typically force your computer to shut down by holding the power button for several seconds.  And remember - since most computer freezes happen unexpectedly, it is a good idea to save your work frequently!"
        ]
    },
    {
        "word": "Full-Duplex",
        "type": [],
        "definition": [
            "Full-duplex, or simply \"duplex,\" is a type of communication in which data can flow two ways at the same time.  Full duplex devices, therefore, can communicate back and forth simultaneously.\nTelephones are common examples of full-duplex devices.  They allow both people to hear each other at the same time.  In the computer world, most network protocols are duplex, enabling hardware devices to send data back and forth simultaneously.  For example, two computers connected via an Ethernet cable can send and receive data at the same time.  Wireless networks also support full-duplex communication.  Additionally, modern I\/O standards, such as USB and Thunderbolt, are full-duplex.\nThe terms duplex and full-duplex can be used interchangeably since both refer to simultaneous bidirectional communication.  Full-duplex is often used in contrast to half-duplex, which refers to bidirectional communication, but not at the same time.  Simplex communication is even more limited and only supports data transmission in one direction.\nNOTE: Full-duplex is sometimes abbreviated \"FDX.\""
        ]
    },
    {
        "word": "Function",
        "type": [],
        "definition": [
            "In mathematics, a function is defined as a relationship between defined values and one or more variables.  For example, a simple math function may be:\ny = 2x\nIn this example, the relationship of y to x is that y is twice as much as the value assigned to x.  While math functions can be far more complex than this, most are simple relative to functions used in computer programming.  This may be why math functions are often referred to as \"expressions,\" while computer functions are often called \"procedures\" or \"subroutines.\"\nComputer functions are similar to math functions in that they may reference parameters, which are passed, or input into the function.  If the example above were written as a computer function, \"x\" would be the input parameter and \"y\" would be the resulting output value.  It might look something like this:\nfunction double(x)\n{\n&nbsp; $y = 2 * x;\n&nbsp; return $y;\n}\nThe above example is a very basic function.  Most functions used in computer programs include several lines of instructions and may even reference other functions.  A function may also reference itself, in which case it is called a recursive function.  Some functions may require no parameters, while others may require several.  While it is common for functions to return variables, many functions do not return any values, but instead output data as they run.\nFunctions are sometimes considered the building blocks of computer programs, since they can control both small and large amounts of data.  While functions can be called multiple times within a program, they only need to be declared once.  Therefore, programmers often create \"libraries\" of functions that can referenced by one or more programs.  Still, the source code of large computer programs may contain hundreds or even thousands of functions."
        ]
    },
    {
        "word": "Function Key",
        "type": [],
        "definition": [
            "A function key is one of the \"F\" keys along the top of a computer keyboard.  On some keyboards, these range from F1 to F12, while others have function keys ranging from F1 to F19.\nFunction keys may be used as single key commands (e.g., F5) or may be combined with one or more modifier keys (e.g., Alt+F4).  In either case, function keys typically serve as keyboard shortcuts to perform a specific function.\nWhile function keys have been included on keyboards since the 1960s, they have not had a standard purpose.  Over the years, various operating systems and applications have made use of function keys in different ways.  While each software developer can decide how to use the \"F keys\" in his or her program, some actions have been universally recognized.\nBelow are some common uses for function keys in Windows:\n\nF1 - Display help screen\nF2 - Highlight file or folder for renaming\nF3 - Open search tool\nAlt+F4 - Close the current window\nF5 - Refresh the contents of a window or webpage\nF8 - Boot Windows into Safe Mode by holding F8 during startup\n\nHigher number function keys are often used for common system actions, such as adjusting the speaker volume or the display brightness.\nBased on your system settings, you may need to hold the \"Fn\" modifier key to perform system actions.  In macOS, this is typically reversed, meaning the function keys perform system actions by default.  For example, pressing F1 lowers the brightness, while F2 increases it.  Pressing Fn+F1 sends an \"F1\" command rather than changing the brightness.  For this reason, most Mac keyboards have icons on the function keys displaying the default function of each key."
        ]
    }
]