[
    {
        "word": "GDPR",
        "type": [],
        "definition": [
            "Stands for \"General Data Protection Regulation.\"  GDPR, also known as Regulation (EU) 2016\/679, is a European Union law drafted on April 27, 2016 and instituted on May 25, 2018.  It replaces the EU Data Protection Directive, which was adopted in 1995.  The primary purpose of GDPR is to protect the personal data of residents of countries within the European Union (EU).\nThe 88-page GDPR document begins by stating the protection of people in regards to their personal data is a fundamental human right.  The rules and guidelines within the General Data Protection Regulation are designed to support this premise.  It states that all data controllers (organizations that collect and store user data) must protect the data, give users access to the data, and make the data easily transferrable.\nGDPR updates the previous Data Protection Directive to be relevant to modern times and technologies.  For example:\n\nRegulation 42 states that data processors (such as websites) must make their identity clear and ask users for consent before storing their data.\nRegulation 49 bans malicious activity in regards to data, such as hacking and denial of service attacks.\nRegulation 83 states that data controllers and processors should mitigate security risks by using encryption.\nArticle 33.1 requires organizations to inform their users within 72 hours of when a data breach has been discovered.\n\nTo Whom Does GDPR Apply?\nThe GDPR guidelines must be followed by all public and private companies and organizations within the EU.  Fines and penalties may be assessed to entities that do not conform to the regulations.  While GDPR is commonly associated with IT industries, such as e-commerce websites and cloud services, it applies to all EU organizations that store personal data.  Examples include health care services, law firms, educational institutions, scientific research firms, and government entities.\nWhile GDPR is enforceable within the European Union, it also applies to companies and organizations outside the EU that do business with EU residents.  For example, if a U.S.-based company stores data for individuals living in Sweden, it must conform to the GDPR regulations.  On the consumer side, GDPR protects both EU citizens and people who live and work in the EU.  The rules apply to individuals engaged in business transactions, but they do not apply to personal or household activities."
        ]
    },
    {
        "word": "GIF",
        "type": [],
        "definition": [
            "Stands for \"Graphics Interchange Format.\"  GIF is an image file format commonly used for images on the web and sprites in software programs.  Unlike the JPEG image format, GIFs uses lossless compression that does not degrade the quality of the image.  However, GIFs store image data using indexed color, meaning a standard GIF image can include a maximum of 256 colors.\nThe original GIF format, also known as \"GIF 87a,\" was published by CompuServe in 1987.  In 1989, CompuServe released an updated version of the format called \"GIF 89a.\"  The 89a format is similar to the 87a specification but includes support for transparent backgrounds and image metadata.  Both formats support animations by allowing a stream of images to be stored in a single file.  However, the 89a format also includes support for animation delays.\n Even though the GIF format was published more than a quarter-century ago, it is still widely used on the web.  Nearly all GIFs use the 89a format.  You can check the version of a specific GIF image by opening it in a text editor and looking at the first six characters listed in the document (GIF87a or GIF89a).\nSince GIFs may only contain 256 colors, they are not ideal for storing digital photos, such as those captured with a digital camera.  Even when using a custom color palette and applying dithering to smooth out the image, photos saved in the GIF format often look grainy and unrealistic.  Therefore, the JPEG format, which supports millions of colors, is more commonly used for storing digital photos.\nGIFs are better suited for buttons and banners on websites since these types of images typically do not require a lot of colors.  However, most web developers prefer to use the newer PNG format, since PNGs support a broader range of colors and include an alpha channel.  (The alpha channel makes it possible for a single image with transparency to blend smoothly with any webpage background color.)  Still, neither JPEGs nor PNGs support animations, so animated GIFs remain popular on the web.\nNOTE: A GIF image can actually store more than 256 colors.  This is accomplished by separating the image into multiple blocks, which each continue unique 256 color palettes.  The blocks can be combined into a single rectangular image, which can theoretically produce a \"true color\" or 24-bit image.  However, this method is rarely used because the resulting file size is much larger than a comparable .JPEG file.\nHow to pronounce \"GIF\"\nAccording to Steve Wilhite, the creator of the original GIF format, it is pronounced \"jiff\" (like the peanut butter brand).  However, most people still pronounce it \"gif\" (with a hard G).  Therefore, either pronunciation is acceptable.\nFile extension: .GIF"
        ]
    },
    {
        "word": "GIGO",
        "type": [],
        "definition": [
            "Stands for \"Garbage In, Garbage Out.\"  GIGO is a computer science acronym that implies bad input will result in bad output.\nBecause computers operate using strict logic, invalid input may produce unrecognizable output, or \"garbage.\"  For example, if a program asks for an integer and you enter a string, you may get an unexpected result.  Similarly, if you try to open a binary file in a text editor, it may display unreadable content.\nGIGO is a universal computer science concept, but it only applies to programs that process invalid data.  Good programming practice dictates that functions should check for valid input before processing it.  A well-written program will avoid producing garbage by not accepting it in the first place.  Requiring valid input also helps programs avoid errors that can cause crashes and other erratic behavior.\nNOTE: Because the related terms FIFO and LIFO are pronounced with a long \"i,\" GIGO is typically pronounced \"guy-go\" (not gih-go).  This also helps avoid confusion with the prefix \"giga,\" which is pronounced with a soft \"i.\""
        ]
    },
    {
        "word": "GIS",
        "type": [],
        "definition": [
            "Stands for \"Geographic Information Systems.\"  GIS tools are used to gather and analyze data about the surface of the earth.  The data can be used to create charts, maps, and 3D models of the earth's surface.  This includes hills, mountains, trees, buildings, streets, rivers, and pretty much anything else.  Sounds fun, but how is it used?  Well, organizations such as the police and fire department can use the data to develop emergency routes.  The government can use the data to measure the growth and expansion of cities or the depletion of forests.  Most importantly, however, GIS can assist with special effects by simulating landscapes and terrain in action movies.\nGIS files created with ArcGIS software use the .e00 file extension."
        ]
    },
    {
        "word": "GNU",
        "type": [],
        "definition": [
            "GNU (pronounced \"g-new\") is a free Unix-like operating system distributed by the Free Software Foundation.  It is available in several different versions, but the most popular is the GNU\/Linux system, which uses the Linux kernel.  Since the GNU\/Linux system is a popular version of Linux, it is often referred to as simply \"Linux.\"  However, GNU\/Linux is technically a specific version of Linux developed by the GNU Project.\nSeveral GNU\/Linux distributions are available, including BLAG, Dragora, gNewSense, Kongoni, Musix GNU+Linux, Trisquel, Ututo, and Venenux.  While each version of GNU\/Linux is based on the GNU system, each has a custom user interface and may include unique bundled applications.  For example, Trisquel is designed for small business and home and educational purposes, while Musix GNU+Linux is designed primarily for audio production.\nGNU operating systems, software programs, and development tools, such as the GNU Compiler Collection (GCC), are distributed for free under the GNU General Public License (GPL).  This license states that the software may be freely used, modified, and distributed.  Therefore, all GNU software is freely available without a commercial license.  Many freeware programs developed for other operating systems are now distributed under the GNU General Public License as well.\nThe name \"GNU\" is a recursive acronym for \"GNU's Not Unix.\""
        ]
    },
    {
        "word": "GPGPU",
        "type": [],
        "definition": [
            "Stands for \"General-Purpose computation on Graphics Processing Units.\"  GPGPU, or GPU computing, is the use of a GPU to handle general computing operations.  Modern operating systems allow programs to access the GPU alongside the CPU, speeding up the overall performance.\nWhile GPUs are designed to process graphics calculations, they can also be used to perform other operations.  GPGPU maximizes processing efficiency by offloading some operations from the central processing unit (CPU) to the GPU.  Instead of sitting idle when not processing graphics, the GPU is constantly available to perform other tasks.  Since GPUs are optimized for processing vector calculations, they can even process some instructions faster than the CPU.\nGPGPU is a type of parallel processing, in which operations are processed in tandem between the CPU and GPU.  When the GPU finishes a calculation, it may store the result in a buffer, then pass it to the CPU.  Since processors can complete millions of operations each second, data is often stored in the buffer only for a few milliseconds.\nGPU computing is made possible using a programming language that allows the CPU and GPU share processing requests.  The most popular is OpenCL, an open standard supported by multiple platforms and video cards.  Others include CUDA (Compute Unified Device Architecture), an API created by NVIDIA, and APP (Accelerated Parallel Processing), an SDK provided by AMD."
        ]
    },
    {
        "word": "GPIO",
        "type": [],
        "definition": [
            "Stands for \"General Purpose Input\/Output.\"  GPIO is a type of pin found on an integrated circuit that does not have a specific function.  While most pins have a dedicated purpose, such as sending a signal to a certain component, the function of a GPIO pin is customizable and can be controlled by software.\nNot all chips have GPIO pins, but they are commonly found on multifunction chips, such as those used in power managers and audio\/video cards.  They are also used by system-on-chip (SOC) circuits, which include a processor, memory, and external interfaces all on a single chip.  GPIO pins allow these chips to be configured for different purposes and work with several types of components.\nA popular device that makes use of GPIO pins is the Raspberry Pi, a single-board computer designed for hobbyists and educational purposes.  It includes a row of GPIO pins along the edge of the board that provide the interface between the Raspberry Pi and other components.  These pins act as switches that output 3.3 volts when set to HIGH and no voltage when set to LOW.  You can connect a device to specific GPIO pins and control it with a software program.  For example, you can wire an LED to a GPIO and a ground pin on a Raspberry Pi.  If a software program tells the GPIO pin to turn on, the LED will light up.\nMost computer users will not encounter GPIO pins and do not need to worry about configuring them.  However, if you are a hobbyist or computer programmer, it can be helpful to learn what chips have GPIO pins and how to make use of them."
        ]
    },
    {
        "word": "GPS",
        "type": [],
        "definition": [
            "Stands for \"Global Positioning System.\"  GPS is a satellite navigation system used to determine the ground position of an object.  GPS technology was first used by the United States military in the 1960s and expanded into civilian use over the next few decades.  Today, GPS receivers are included in many commercial products, such as automobiles, smartphones, exercise watches, and GIS devices.\nThe GPS system includes 24 satellites deployed in space about 12,000 miles (19,300 kilometers) above the earth's surface.  They orbit the earth once every 12 hours at an extremely fast pace of roughly 7,000 miles per hour (11,200 kilometers per hour).  The satellites are evenly spread out so that four satellites are accessible via direct line-of-sight from anywhere on the globe.\nEach GPS satellite broadcasts a message that includes the satellite's current position, orbit, and exact time.  A GPS receiver combines the broadcasts from multiple satellites to calculate its exact position using a process called triangulation.  Three satellites are required in order to determine a receiver's location, though a connection to four satellites is ideal since it provides greater accuracy.\nIn order for a GPS device to work correctly, it must first establish a connection to the required number of satellites.  This process can take anywhere from a few seconds to a few minutes, depending on the strength of the receiver.  For example, a car's GPS unit will typically establish a GPS connection faster than the receiver in a watch or smartphone.  Most GPS devices also use some type of location caching to speed up GPS detection.  By memorizing its previous location, a GPS device can quickly determine what satellites will be available the next time it scans for a GPS signal.\nNOTE: Since GPS receivers require a relatively unobstructed path to space, GPS technology is not ideal for indoor use.  Therefore, smartphones, tablets, and other mobile devices often use other means to determine location, such as nearby cell towers and public Wi-Fi signals.  This technology, sometimes referred to as the local positioning system (LPS), is often used to supplement GPS when a consistent satellite connection is unavailable."
        ]
    },
    {
        "word": "GPU",
        "type": [],
        "definition": [
            "Stands for \"Graphics Processing Unit.\"  A GPU is a processor designed to handle graphics operations.  This includes both 2D and 3D calculations, though GPUs primarily excel at rendering 3D graphics.\nHistory\nEarly PCs did not include GPUs, which meant the CPU had to handle all standard calculations and graphics operations.  As software demands increased and graphics became more important (especially in video games), a need arose for a separate processor to render graphics.  On August 31, 1999, NVIDIA introduced the first commercially available GPU for a desktop computer, called the GeForce 256.  It could process 10 million polygons per second, allowing it to offload a significant amount of graphics processing from the CPU.\nThe success of the first graphics processing unit caused both hardware and software developers alike to quickly adopt GPU support.  Motherboards were manufactured with faster PCI slots and AGP slots, designed exclusively for graphics cards, became a common option as well.  Software APIs like OpenGL and Direct3D were created to help developers make use of GPUs in their programs.  Today, dedicated graphics processing is standard – not just in desktop PCs – but also in laptops, smartphones, and video game consoles.\nFunction\nThe primary purpose of a GPU is to render 3D graphics, which are comprised of polygons.  Since most polygonal transformations involve decimal numbers, GPUs are designed to perform floating point operations (as opposed to integer calculations).  This specialized design enables GPUs to render graphics more efficiently than even the fastest CPUs.  Offloading graphics processing to high-powered GPUs is what makes modern gaming possible.\nWhile GPUs excel at rendering graphics, the raw power of a GPU can also be used for other purposes.  Many operating systems and software programs now support GPGPU, or general-purpose computation on graphics processing units.  Technologies like OpenCL and CUDA allow developers to utilize the GPU to assist the CPU in non-graphics computations.  This can improve the overall performance of a computer or other electronic device."
        ]
    },
    {
        "word": "GUI",
        "type": [],
        "definition": [
            "Stands for \"Graphical User Interface\" and is pronounced \"gooey.\"  It is a user interface that includes graphical elements, such as windows, icons and buttons.  The term was created in the 1970s to distinguish graphical interfaces from text-based ones, such as command line interfaces.  However, today nearly all digital interfaces are GUIs.\nThe first commercially available GUI, called \"PARC,\" was developed by Xerox.  It was used by the Xerox 8010 Information System, which was released in 1981.  After Steve Jobs saw the interface during a tour at Xerox, he had his team at Apple develop an operating system with a similar design.  Apple's GUI-based OS was included with the Macintosh, which was released in 1984.  Microsoft released their first GUI-based OS, Windows 1.0, in 1985.\nFor several decades, GUIs were controlled exclusively by a mouse and a keyboard.  While these types of input devices are sufficient for desktop computers, they do not work as well for mobile devices, such as smartphones and tablets.  Therefore, mobile operating systems are designed to use a touchscreen interface.  Many mobile devices can now be controlled by spoken commands as well.\nBecause there are now many types of digital devices available, GUIs must be designed for the appropriate type of input.  For example, a desktop operating system, such as OS X, includes a menu bar and windows with small icons that can be easily navigated using a mouse.  A mobile OS, like iOS, includes larger icons and supports touch commands like swiping and pinching to zoom in or zoom out.  Automotive interfaces are often designed to be controlled with knobs and buttons, and TV interfaces are built to work with a remote control.  Regardless of the type of input, each of these interfaces are considered GUIs since they include graphical elements.\nNOTE: Specialized GUIs that operate using speech recognition and motion detection are called natural user interfaces, or NUIs."
        ]
    },
    {
        "word": "GUID",
        "type": [],
        "definition": [
            "Stands for \"Globally Unique Identifier.\"  A GUID is a 128-bit (16 byte) number used by software programs to uniquely identify the location of a data object.  Some examples of data that include GUIDs are streaming media files, Windows registry entries, database keys, and various file types.  GUIDs are typically written in hexadecimal notation, containing 32 digits, and may look something like this:\n{12345678-9012-3456-7890-123456789012}\nGlobally unique identifiers are also the basis of the GUID Partition Table (GPT).  This is a hard disk partitioning scheme proposed by Intel as part of the Extensible Firmware Interface.  It is used by Windows PCs as well as Intel-based Macintosh computers.  GPT uses GUIDs to define the different partitions on a hard drive.  Some examples include the boot partition, the file system partition, and the data partition.  Each operating system that supports the GPT partitioning scheme uses specific GUIDs to label each partition."
        ]
    },
    {
        "word": "Gamma Correction",
        "type": [],
        "definition": [
            "Gamma refers to the brightness of a monitor or computer display.  It is a setting that determines how bright the output of the display will be.  Therefore,  \"gamma correction\" is used to alter the output levels of a monitor.\nWhile the gamma setting affects the brightness of a display, it is not identical to the brightness.  This is because gamma adjustments are not linear, like brightness levels are.  Instead, the gamma setting applies a function to the input levels, which produces the final output level.  You can visualize this function as a curved line instead of a straight one.  This means the extreme dark and light points are not as affected as the midtones, which are enhanced more because of the non-linear function.  Therefore, the gamma setting affects both the brightness and the contrast of the display.\nThe reason gamma correction is used is because the input signal, or voltage, sent to a monitor is not high enough to create a bright image.  Therefore, if the gamma is not altered, the images on your screen would be dark and difficult to see.  By applying gamma correction, the brightness and contrast of the display are enhanced, making the images appear brighter and more natural looking.\nNOTE: Common gamma settings are 2.2 for PC monitors and 1.8 for Macintosh monitors.  These gamma settings apply an inverse luminance curve to the display's native gamma, which produces natural brightness and contrast levels."
        ]
    },
    {
        "word": "Garbage Collection",
        "type": [],
        "definition": [
            "In computer science, garbage collection is a type of memory management.  It automatically cleans up unused objects and pointers in memory, allowing the resources to be used again.  Some programming languages have built-in garbage collection, while others require custom functions to manage unused memory.\nA common method of garbage collection is called reference counting.  This strategy simply counts how many references there are to each object stored in memory.  If an object has zero references, it is considered unnecessary and can be deleted to free up the space in memory.  Advanced reference counting detects objects that only reference each other, which indicates the objects are unused by the parent process.\nGarbage collection may also be done at compile-time, when a program's source code is compiled into an executable program.  In this method, the compiler determines which resources in memory will never be accessed after a certain time.  It can then add instructions to automatically deallocate those resources from memory.  While this is an effective way to eliminate unused objects, it must be done conservatively to avoid deleting references required by the program.\nGarbage collection is an important part of software development since it keeps programs from using up too much RAM.  Besides helping programs run more efficiently, it can also prevent serious bugs, such as memory leaks, that can cause a program to crash."
        ]
    },
    {
        "word": "Gateway",
        "type": [],
        "definition": [
            "A gateway is a hardware device that acts as a \"gate\" between two networks.  It may be a router, firewall, server, or another device that enables traffic to flow in and out of the network.\nWhile a gateway protects the nodes within network, it is also a node itself.  The gateway node is considered to be on the \"edge\" of the network as all data must flow through it before coming in or going out of the network.  It may also translate data received from outside networks into a format or protocol recognized by devices within the internal network.\nA router is a common type of gateway used in home networks.  It allows computers within the local network to send and receive data over the Internet.  A firewall is a more advanced type of gateway, which filters inbound and outbound traffic, disallowing incoming data from suspicious or unauthorized sources.  A proxy server is another type of gateway that uses a combination of hardware and software to filter traffic between two networks.  For example, a proxy server may only allow local computers to access a list of authorized websites.\nNOTE: Gateway is also the name of a computer hardware company founded in the United States in 1985.  The company was acquired by Acer in 2007 but still sells computers under the Gateway name."
        ]
    },
    {
        "word": "Gbps",
        "type": [],
        "definition": [
            "Stands for \"Gigabits per second.\"  1Gbps is equal to 1,000 Megabits per second (Mbps), or 1,000,000,000 bits per second.  Gbps is commonly used to measure data transfer speeds between hardware devices.\nFor many years, data transfer speeds were only measured in Mbps and Kbps.  However, modern hardware interfaces can now transfer data over one gigabit per second, which makes Gbps a necessary unit of measurement.  Examples of these interfaces include SATA 3 (6Gbps), USB 3.0 (5Gbps), and Thunderbolt (10Gbps).  Additionally, Gigabit Ethernet can transfer data up to 1Gbps.\nNOTE: The lowercase \"b\" is Gbps indicates it stands for \"Gigabits\" rather than \"Gigabytes.\"  Since one byte equals eight bits, 1GBps is equal to 8Gbps.  While storage capacity is typically measured in bytes, data transfer speeds are typically measured in bits.  Therefore, Gbps is much more commonly used than GBps."
        ]
    },
    {
        "word": "Gibibyte",
        "type": [],
        "definition": [
            "A gibibyte is a unit of data storage that equals 2 to the 30th power, or 1,073,741,824 bytes.\nWhile a gigabyte can be estimated as 10^9 or 1,000,000,000 bytes, a gibibyte is defined as exactly 1,073,741,824 bytes.  This helps avoid the ambiguity associated with the size of gigabytes.  A gibibyte is 1,024 mebibytes and precedes the tebibyte unit of measurement.\nFor a list of other units of measurements, view this Help Center article.\nAbbreviation: GiB"
        ]
    },
    {
        "word": "Gigabit",
        "type": [],
        "definition": [
            "A gigabit is 109 or 1,000,000,000 bits.\nOne gigabit (abbreviated \"Gb\") is equal to 1,000 megabits or 1,000,000 kilobits.  It is one-eighth the size of a gigabyte (GB).\nGigabits are most often used to measure data transfer rates of local networks and I\/O connections.  For example, Gigabit Ethernet is a common Ethernet standard that supports data transfer rates of one gigabit per second (Gbps) over a wired Ethernet network.  Modern I\/O technologies, such as USB 3.0 and Thunderbolt are also measured in gigabits per second.  USB 3.0 can transfer data at up to 5 Gbps, while Thunderbolt 1.0 can transfer data bidirectionally at 10 Gbps.\nWhile gigabits and gigabytes sound similar, it is important not to confuse the two terms.  Since there are eight bits in one byte, there are also eight gigabits in one gigabyte.  Gigabits are most often used to describe data transfer speeds, while gigabytes are used to measure data storage."
        ]
    },
    {
        "word": "Gigabyte",
        "type": [],
        "definition": [
            "A gigabyte is 109 or 1,000,000,000 bytes.\nOne gigabyte (abbreviated \"GB\") is equal to 1,000 megabytes and precedes the terabyte unit of measurement.  While a gigabyte is technically 1,000,000,000 bytes, in some cases, gigabytes are used synonymously with gibibytes, which contain 1,073,741,824 bytes (1024 x 1,024 x 1,024 bytes).\nGigabytes, sometimes abbreviated \"gigs,\" are often used to measure storage capacity.  For example, a standard DVD can hold 4.7 gigabytes of data.  An SSD might hold 256 GB, and a hard drive may have a storage capacity of 750 GB.  Storage devices that hold 1,000 GB of data or more are typically measured in terabytes.\nRAM is also usually measured in gigabytes.  For example, a desktop computer may come with 16 GB of system RAM and 2 GB of video RAM.  A tablet may only require 1 GB of system RAM since portable apps typically do not require as much memory as desktop applications.\nNOTE: You can view a list of all the units of measurement used for measuring data storage."
        ]
    },
    {
        "word": "Gigaflops",
        "type": [],
        "definition": [
            "Gigaflops is a unit of measurement used to measure the performance of a computer's floating point unit, commonly referred to as the FPU.  One gigaflops is one billion (1,000,000,000) FLOPS, or floating point operations, per second.\nThe term \"gigaflops\" appears to be plural, since it ends in \"s,\" but the word is actually singular since FLOPS is an acronym for \"floating point operations per second.\"  This is why gigaflops is sometimes written as \"gigaFLOPS.\"  Since gigaflops measures how many billions of floating point calculations a processor can perform each second, it serves as a good indicator of a processor's raw performance.  However, since it does not measure integer calculations, gigaflops cannot be used as a comprehensive means of measuring a processor's overall performance."
        ]
    },
    {
        "word": "Gigahertz",
        "type": [],
        "definition": [
            "One gigahertz is equal to 1,000 megahertz (MHz) or 1,000,000,000 Hz.  It is commonly used to measure computer processing speeds.  For many years, computer CPU speeds were measured in megahertz, but after personal computers eclipsed the 1,000 Mhz mark around the year 2000, gigahertz became the standard measurement unit.  After all, it is easier to say \"2.4 Gigahertz\" than \"2,400 Megahertz.\"\nWhile gigahertz is most commonly used to measure processor speed, it can also measure the speed of other parts of the computer, such as the RAM and backside cache.  The speed of these components, along with other parts of the computer, also impact the computer's overall performance.  Therefore, when comparing computers, remember the number of gigahertz is not the only thing that matters.\nAbbreviation: GHz."
        ]
    },
    {
        "word": "Gnutella",
        "type": [],
        "definition": [
            "Gnutella is a file sharing network that allows users to send and receive files over the Internet.  The first part of its name comes from the GNU General Public License, which originally allowed the source of the program to be made available to the public.  The second part of the name comes from Nutella, a chocolate hazelnut spread, which apparently the developers ate a lot of while working on the project.\nThe Gnutella network is a peer-to-peer (P2P) network, which allows users on different networks to share files.  However, each user still must connect to an \"ultrapeer,\" which is a server that lists files shared by connected users.  This makes it possible to search for files across hundreds or even thousands of other computers connected to the network.\nGnutella is a network protocol, not an actual program.  Therefore, to access other computers on the Gnutella network, you must install a P2P program that supports Gnutella.  Fortunately, many of these programs are available as shareware and can be downloaded from the Internet.  Some popular Gnutella clients include Acquisition for the Mac and BearShare and Morpheus for Windows."
        ]
    },
    {
        "word": "Golden Master",
        "type": [],
        "definition": [
            "A golden master, or GM, is the final version of a software program that is sent to manufacturing and is used to make retail copies of the software.  The golden master follows several other stages in the software development process including the alpha, beta, and release candidate stages.  The final release candidate (RC) becomes the \"release to manufacturing\" (RTM) version, which is also called the golden master.\nThe term \"golden master\" has been used by Apple for many years, and is now used by many other software companies as well.  It is also used in the video game industry to refer to the final version of games that are sent to replication facilities.  When a program reaches the golden master stage, it is often said to have \"gone gold.\"  This means it won't be long before the product is available to consumers for retail purchase.\nNOTE: Golden master should not be confused with a \"gold record,\" which refers to a music album that has sold 500,000 copies."
        ]
    },
    {
        "word": "Goodput",
        "type": [],
        "definition": [
            "When data is transferred over a communications medium, such as the Internet or a local area network (LAN), the average transfer speed is often described as throughput.  This measurement includes all the protocol overhead information, such as packet headers and other data that is included in the transfer process.  It also includes packets that are retransmitted because of network conflicts or errors.  Goodput, on the other hand, only measures the throughput of the original data.\nGoodput can be calculated by dividing the size of a transmitted file by the time it takes to transfer the file.  Since this calculation does not include the additional information that is transferred between systems, the goodput measurement will always be less than or equal to the throughput.  For example, the maximum transmission unit MTU of an Ethernet connection is 1,500 bytes.  Therefore, any file over 1,500 bytes must be split into multiple packets.  Each packet includes header information (typically 40 bytes), which adds to the total amount of data that needs to be transferred.  Therefore, the goodput of an Ethernet connection will always be slightly less than the throughput.\nWhile goodput is typically close to the throughput measurement, several factors can cause the goodput to decrease.  For example, network congestion may cause data collisions, which requires packets to be resent.  Many protocols also require acknowledgment that packets have been received on the other end, which adds additional overhead to the transfer process.  Whenever more overhead is added to a data transfer, it will increase the difference between the throughput and the goodput."
        ]
    },
    {
        "word": "Google",
        "type": [],
        "definition": [
            "Google is the world's most popular search engine.  It began as a search project in 1996 by Larry Page and Sergey Brin, who were two Ph.D. students at Stanford University.  They developed a search engine algorithm that ranked Web pages not just by content and keywords, but by how many other Web pages linked to each page.  This strategy produced more useful results than other search engines, and led to a rapid increase in Google's Web search marketshare.  The Google ranking algorithm was later named \"PageRank\" and was patented in September of 2001.  In only a short time, Google became the number one search engine in the world.\nAccording to Google's website, the company's mission is to \"organize the world's information and make it universally accessible and useful.\"  While the Web search remains Google's primary tool for helping users access information, the company offers several other services as well.  Some of these include:\n\nFroogle - price comparison shopping\nImage Search - search for images on the Web\nGoogle Groups - online discussion forums\nGoogle Answers - answers to questions based on a bidding system\nGoogle Maps - maps and directions\nGoogle Toolbar - a downloadable search tool\nBlogger - a free blogging service\nGmail - Web-based e-mail with several gigabytes of storage\nAdWords - Advertising services for advertisers\nAdSense - Advertising services for Web publishers\n\nGoogle has become such a popular search engine that the term \"Google\" is now often used as a verb, synonymous with \"search.\"  For example, if you are looking for information about someone, you can Google that person using Google's search engine.\nTo Google your own term or phrase, visit Google's home page."
        ]
    },
    {
        "word": "Google Drive",
        "type": [],
        "definition": [
            "Google Drive is a service offered by Google that allows you to store and share files online.  The service was launched on April 24, 2012 and provides 5 GB of free storage.  Additional storage can be purchased for a monthly fee.\nThe goal of Google Drive is to provide a central place to store your files online so that you can access them from anywhere.  Additionally, you can access your Google Drive from multiple devices, since the software is available for Windows, Mac OS X, Android, and iOS platforms.  The service also provides a web-based interface that allows you to organize your files and search for documents by filename or content.\nBesides online file storage, Google Drive provides tools for sharing files and collaborating on projects with other users over the Web.  For example, instead of emailing large attachments, you can send links to the files from your Google Drive to one or more users.  You can also use the web-based Google Docs applications to create or edit documents online.  When you share a document with other Google Drive users, everyone can view and edit the document at the same time.\nGoogle Drive allows you to view over 30 file types directly in your web browser.  These include Google's proprietary formats, as well as other popular file types, such as Adobe Photoshop and Illustrator documents.  For more information about Google Drive's proprietary file types, view the Google Drive File Types article at FileInfo.com."
        ]
    },
    {
        "word": "Gopher",
        "type": [],
        "definition": [
            "The Gopher technology was invented at the University of Minnesota, whose mascot is, not surprisingly, the Golden Gopher.  The gopher system allows people to search for and retrieve information using a text interface.  The technology is based on a client-server structure, where a gopher client program is used to search gopher servers.  These servers can store documents, articles, programs, and other information.  Instead of hyperlinks, the gopher interface uses menus of links to other documents and programs.\nThe University of Minnesota began a licensing program for the gopher technology in 1993 as the use of gopher was spreading rapidly over the Internet.  However, this was around the same time that the World Wide Web was introduced.  Because the Web used hypertext and images, it soon became the preferred way to search and browse for information.  While there are still servers and client programs that use gopher technology, their use is not nearly as widespread as the Web."
        ]
    },
    {
        "word": "Graphics",
        "type": [],
        "definition": [
            "A graphic is an image or visual representation of an object.  Therefore, computer graphics are simply images displayed on a computer screen.  Graphics are often contrasted with text, which is comprised of characters, such as numbers and letters, rather than images.\nComputer graphics can be either two or three-dimensional.  Early computers only supported 2D monochrome graphics, meaning they were black and white (or black and green, depending on the monitor).  Eventually, computers began to support color images.  While the first machines only supported 16 or 256 colors, most computers can now display graphics in millions of colors.\n2D graphics come in two flavors — raster and vector.  Raster graphics are the most common and are used for digital photos, Web graphics, icons, and other types of images.  They are composed of a simple grid of pixels, which can each be a different color.  Vector graphics, on the other hand are made up of paths, which may be lines, shapes, letters, or other scalable objects.  They are often used for creating logos, signs, and other types of drawings.  Unlike raster graphics, vector graphics can be scaled to a larger size without losing quality.\n3D graphics started to become popular in the 1990s, along with 3D rendering software such as CAD and 3D animation programs.  By the year 2000, many video games had begun incorporating 3D graphics, since computers had enough processing power to support them.  Now most computers now come with a 3D video card that handles all the 3D processing.  This allows even basic home systems to support advanced 3D games and applications."
        ]
    },
    {
        "word": "Graymail",
        "type": [],
        "definition": [
            "Graymail describes email messages that are generally unwanted, but do not fit the definition of spam.  Unlike spam, graymail includes messages from mailing lists and newsletters that you have legitimately signed up to receive.  Over time, these messages can begin to clutter your inbox and can easily be mistaken for spam.\nThe term \"graymail\" was coined by the Microsoft Hotmail team in 2011, when the company introduced new methods of filtering incoming messages.  Graymail differs from spam in the following ways:\n\nThe email is solicited.  You request to receive graymail by opting in, either directly or indirectly.  For example, a direct method is subscribing to a mailing list.  An indirect method is providing your email address when you register with an e-commerce website.\nThe email is legitimate.  Graymail messages are sent by reputable sources who value their relationship with the recipient.  The messages usually contain an unsubscribe option, which is honored by the sender.\nThe email content is targeted to specific users.  Graymail messages generally contain content that is specific to your interests.  While the emails may include text that is similar to spam messages, such as special offers and promotions, the offers are directed to you and other specific users.\n\nBased on Microsoft's research, newsletters and special offers make up the majority of messages in the average user's inbox.  By identifying these messages as graymail, Hotmail is able to filter them appropriately.  This includes moving newsletters to a specific \"Newsletters\" category and providing a \"Schedule Cleanup\" tool that moves or deletes outdated email promotions."
        ]
    },
    {
        "word": "Grayscale",
        "type": [],
        "definition": [
            "Grayscale is a range of monochromatic shades from black to white.  Therefore, a grayscale image contains only shades of gray and no color.\nWhile digital images can be saved as grayscale (or black and white) images, even color images contain grayscale information.  This is because each pixel has a luminance value, regardless of its color.  Luminance can also be described as brightness or intensity, which can be measured on a scale from black (zero intensity) to white (full intensity).  Most image file formats support a minimum of 8-bit grayscale, which provides 2^8 or 256 levels of luminance per pixel.  Some formats support 16-bit grayscale, which provides 2^16 or 65,536 levels of luminance.\nMany image editing programs allow you to convert a color image to black and white, or grayscale.  This process removes all color information, leaving only the luminance of each pixel.  Since digital images are displayed using a combination of red, green, and blue (RGB) colors, each pixel has three separate luminance values.  Therefore, these three values must be combined into a single value when removing color from an image.  There are several ways to do this.  One option is to average all luminance values for each pixel.  Another method involves keeping only the luminance values from the red, green, or blue channel.  Some programs provide other custom grayscale conversion algorithms that allow you to generate a black and white image with the appearance you prefer.\nWhile grayscale is an important aspect of digital images, it also applies to printed documents.  When you select \"Print,\" the print dialog box that appears may include a grayscale option.  If you choose this option, the color information will be removed from the document before it is printed.  As long as your printer has an individual black ink cartridge, when you print in grayscale, it should only use the black ink and none of the color cartridges.  Therefore, the \"Print in Grayscale\" feature is useful if you just need to print a document for reference or don't need a color version."
        ]
    },
    {
        "word": "Greenfield",
        "type": [],
        "definition": [
            "Greenfield is a term from the construction industry that refers to undeveloped land.  In the IT world, greenfield describes a software project that is developed from scratch rather than built from an existing program.  It is often contrasted with \"brownfield,\" which describes software built from an existing program.\nGreenfield software development is generally more flexible than brownfield development since a new program does not need to fit a specific mold.  For example, a greenfield word processor might provide a completely new user interface and may have features not available in any previous program.  Additionally, greenfield software does not need to be backwards compatible with older versions of a program.  There is no need to support legacy file formats or include previous features to meet end user expectations.\nWhile greenfield projects are open ended, developing software from scratch involves inherent risk.  For example, there may not be as large of a market for a program as the developer expects.  The interface may not be well-received and may need to be altered or redesigned to be more user-friendly.  It make take several updates before a greenfield application is successful in the marketplace.  Of course, greenfield programs that succeed often benefit from being a unique option for users until similar applications are developed.\nNOTE: The vast majority of software development is brownfield, since most major software releases are updates to existing programs.  However, there has been a recent surge in greenfield development thanks to the new market of mobile apps."
        ]
    },
    {
        "word": "Grep",
        "type": [],
        "definition": [
            "Grep is a command-line utility for Unix used for searching text documents.  It can perform basic searches and advanced pattern matching using regular expressions.  The grep utility is included with all major Unix distributions, including Linux and Mac OS X.\nGrep can be run by simply typing grep at the command prompt.  The command requires specific parameters, including the string to be located and the filename of the file to be searched.  For example, if you want to check if the file \"readme.text\" has the word \"license\" in it, you would type the following command:\ngrep license readme.txt\nIf the word is not found, grep will not produce any output.  If the string is located in the document, grep will list each occurrence of the string.  If you need to perform a more complex search, you can use a regular expression.  For example, the command below will search the file \"us.txt\" and list all lines that begin with \"Me\" or end with \"you\" (case-sensitive).\ngrep -E \"^Me|you$\" us.txt\nThe \"-E\" parameter in the example above indicates the pattern is an \"extended regular expression.\"  By using this option, you can make sure grep processes your search pattern as a regular expression instead of a basic string.  Grep also supports several other command-line options, which can be used to create more specific queries and customize the output.  You can view these options and learn more about grep by typing \"man grep at the Unix command prompt.\nNOTE: The name \"grep\" is an acronym that comes from the phrase, \"Globally search a regular expression and print.\""
        ]
    },
    {
        "word": "Grid Computing",
        "type": [],
        "definition": [
            "Grid computing (also called \"distributed computing\") is a collection of computers working together to perform various tasks.  It distributes the workload across multiple systems, allowing computers to contribute their individual resources to a common goal.\nA computing grid is similar to a cluster, but each system (or node) on a grid has its own resource manager.  In a cluster, the resources are centrally managed, typically by a single system.  Additionally, clusters are usually located in a single physical space (such as a LAN), whereas grid computing often incorporates systems in several different locations (such as a WAN).\nIn order for systems in a computing grid to work together, they must be physically connected (over a network or the Internet) and run software that allows them to communicate.  The software used in grid computing is called middleware since it translates the information passed from one system to another into a recognizable format.  This allows the data computed by one node within the grid to be stored or processed by another system on the grid.\nGrid computing has many different scientific applications.  For example, it is used to model the changes in molecular structures, analyze brain behavior, and compute complex physics models.  It is also used to perform weather and economic simulations.  Some companies also use grid computing to process internal data and provide services over the Internet.  Cloud computing, for instance, is considered to be a subset of grid computing."
        ]
    }
]