[
    {
        "word": "HAN",
        "type": [],
        "definition": [
            "Stands for \"Home Area Network,\" which is the same thing as a home network.  It is a local area network (LAN) within a home that may include both wired and wireless devices.\nThe central hub of a HAN is the router.  In most cases, the router is connected to a modem, which communicates with an ISP.  The modem provides an Internet connection to the router, which in turn provides Internet access to all connected devices within the home.\nSome modems include built-in routers, in which case the modem and router are the same device.\nBesides sharing the same Internet connection, devices on a HAN may communicate with each other.  For example, a laptop can transfer files to a desktop computer over a home network.  Similarly, a smartphone can cast videos to a smart TV if they are connected to the same router.\nIn larger homes, a HAN may include repeaters to extend the range of the wireless signal.  Both long distances and objects — especially cement walls — can cause Wi-Fi signals to degrade.  A weak wireless connection may still be useable, but it may be inconsistent and produce slow data transfer rates.  Wi-Fi repeaters or \"mesh networks\" solve this problem by boosting the signal in various areas of the home.\nPrevious generations of HANs mainly provided Internet access to multiple computers.  Modern HANs are the foundation of smart homes, which include many connected devices besides computers.  Examples include smartphones, TVs, thermostats, lights, sensors, and home assistants, such as Alexa and Google Home."
        ]
    },
    {
        "word": "HD",
        "type": [],
        "definition": [
            "Stands for \"High Definition.\"  HD describes any video with a resolution greater than standard definition (SD) video.  While \"high-definition\" has a broad scope, it can also refer to a specific HD resolution, such as 1920x1080 pixels.\nBefore HDTV was introduced in the late 1990s, the most common video resolutions were 640x480 (NTSC) and 720x576 (PAL and SECAM).  The NTSC (National Television Standards Committee) format was standard in the U.S. and Japan, while Europe and other parts of the world used PAL (Phase Alternating Line) or SECAM (Sequential Color and Memory). These resolutions became known as \"standard definition\" (SD) only after \"high definition\" (HD) was introduced.\nWhen HD devices first hit the market, there were three standard versions:\n\n720p - 1280x720 progressive scan\n1080i - 1920x1080 interlaced\n1080p - 1920x1080 progressive scan\n\nThe HD video formats listed above each have a 16:9 aspect ratio, which is wider than the 4:3 aspect ratio of standard definition.\n720p, also called \"HD ready,\" was the standard DVD video format, while 1080i and 1080p, called \"Full HD,\" were most often used HD broadcasts.  Since early HD televisions only supported 1080i, the standard HD broadcast format was 1080i.  It was not until Blu-ray discs became available that 1080p became standard.\nSince \"HD\" refers to any resolution greater than standard definition, it also encompasses higher resolutions like 4K and 8K.  However, to avoid ambiguity, 4K resolution (3840x2160) is typically called Ultra HD or UHD, while HD most often describes 1920x1080 video."
        ]
    },
    {
        "word": "HDD",
        "type": [],
        "definition": [
            "Stands for \"Hard Disk Drive.\"  \"HDD\" is often used interchangeably with the terms \"hard drive\" and \"hard disk.\"  However, the term \"hard disk drive\" is technically the most accurate, since \"hard drive\" is short for \"hard disk drive\" and the \"hard disk\" is actually contained within the hard disk drive.\nThe HDD is the most common storage device used to store data.  Most computers made in the 1980s, 1990s, and 2000s include an internal hard disk drive.  The first PCs had hard drives that were less than one megabyte in size, while modern hard drives may contain several terabytes of data.  Some desktop computers have multiple internal hard drives, and external hard drives are often used for additional storage or backup purposes.\nHDDs are non-volatile, meaning they do not need electrical power to maintain their data.  They store data magnetically using a series of spinning platters, or magnetic discs, which record individual bits as ones and zeroes.  Data is recorded using a write head that writes bits onto the disk.  A read head is used to read data from the disk.  Both of these heads are located at the end of a tapered metal component called an actuator arm.  The appearance is similar to a turntable, but the hard disk spins hundreds of times faster than a record.  Additionally, an HDD reads data digitally, while a record player captures an analog signal.\nHard disk drives come in many shapes and sizes, but 3.5 inch models are most common in desktop computers, and 2.5 inch models are usually found in laptops.  A typical consumer HDD has a rotational speed of 7200 RPM, but some high-end hard disk drives run as fast as 15,000 RPM.  Laptop HDDs typically run at either 4800 or 5400 RPM.  Even at the fastest rotational speed, hard drives are still limited by the \"seek time\" of the drive head.  Therefore, SSDs, which do not have a drive head, have become a popular high-performance alternative to HDDs in recent years."
        ]
    },
    {
        "word": "HDMI",
        "type": [],
        "definition": [
            "Stands for \"High-Definition Multimedia Interface.\"  HDMI is a trademark and brand name for a digital interface used to transmit audio and video data in a single cable.  It is supported by modern audio\/video equipment, such as 4K televisions, HDTVs, audio receivers, DVD and Blu-ray players, cable boxes, and video game consoles.\nWhile other types of A\/V connections require separate cables for audio and video data, a single HDMI cable carries the audio and video streams together, eliminating cable clutter.  For example, an analog component cable connection requires three cables for video and two for audio, totaling five cables in all.  The same information can be transmitted digitally using one HDMI cable.\nBecause HDMI is a digital connection, HDMI cables are less prone to interference and signal noise than analog cables.  Also, since most components, such as DVD players and digital cable boxes process information digitally, HDMI eliminates the digital-to-analog and analog-to-digital conversion other interfaces require.  Therefore, HDMI typically produces the best quality picture and sound compared to other types of connections.\nHDMI cables are often more expensive than analog cables since they cost more to manufacture.  But it is important to remember that a single HDMI cable can replace multiple analog cables.  The single all-purpose connection simplifies setup and makes it easy to connect and disconnect devices.  It also supports digital commands, allowing devices to communicate with each other.  For example, if your TV is connected via HDMI to a receiver, the TV can automatically turn the receiver on and off when the TV is turned on and off.  It can also synchronize the volume between the TV and receiver.  Modern HDMI receivers allow you to visually configure the receiver settings using your TV as the interface.\nNOTE: HDMI is a trademark owned by HDMI Licensing Administrator, Inc. (HDMI LA) that serves as an indicator of source for HDMI LA’s brand of digital interfaces used to connect high-definition equipment.  More information is available at HDMI.org."
        ]
    },
    {
        "word": "HDR",
        "type": [],
        "definition": [
            "Stands for \"High Dynamic Range.\"  HDR is a technology that improves the range of color and contrast in a digital image.  It may be used for both photos and videos, though the implementations are different.\nHDR Photography\nAn HDR photo is created my capturing multiple images with different exposures at the same time.  Instead of taking a single photo, the camera captures three or more photos in quick sequence using different exposure values.  For example, a digital camera might take one photo with a -1 exposure setting, one with the default (automatic) exposure, and one with a +1 exposure setting.  The camera (or smartphone) then combines the photos to create a single image.\nHDR image processing is useful when taking photos of scenes with high contrast.  For example, if you are standing in front of window during a sunny day, the backlight might cause the automatic exposure to be too low, making your face appear dark.  If you adjust the exposure to brighten your face, the window will become too bright — possibly completely white.  By combining multiple exposures, these levels can be averaged out, allowing your face to be visible in the photo while not overexposing the light behind you.\nMany digital cameras and smartphones, such as the iPhone, have an HDR option.  You can often choose from from three different HDR settings — OFF, ON, or Auto, which only takes an HDR photo in high-contrast situations.  Most cameras will also capture a regular photo at the same time, so you can choose between the HDR or regular photo for each HDR image captured.\nHDR Video\nHDR video is captured in a similar way to an HDR photo.  Each scene is recorded with different exposures (or different ISO settings) at the same time.  These scenes are blended together to create a single recording.  This typically results in a brighter video, though it can also create a grayish effect that may look unrealistic.  For this reason, HDR recordings are often modified in post-production before being published.\nIn order to display HDR video correctly, the output device (such as a TV or computer monitor) must also support HDR.  An HDR-capable TV, for example, must support certain video output standards.  These include 10-bit color and at least 90% of the DCI-P3 color space, a range of RGB colors defined by the American film industry.  An HDR display must also support specific HDR formats, such as HDR10, Dolby Vision, and Hybrid Log Gamma (HLG).  Most HDR televisions support all of these standards and can be updated using firmware updates that can be downloaded from the Internet."
        ]
    },
    {
        "word": "HDTV",
        "type": [],
        "definition": [
            "Stands for \"High Definition Television.\"  HDTV is a high-quality video standard developed to replace older video formats often referred to as SDTV (standard definition television).  While HDTV's video quality is one of the most noticeable improvements over SDTV, HDTV includes a number of other important improvements as well.\nFirst of all, the HDTV signal is digital.  Instead of an analog signal, used by traditional NTSC broadcasts, HDTV is always digital.  This eliminates analog interference caused be electrical currents and magnetic fields.  Secondly, HDTV uses a different aspect ratio than SDTV.  While previous broadcasts used a 4:3 ratio (4 units wide for every 3 units tall), HDTV uses a ratio of 16:9.  This wider aspect ratio more closely emulates how humans see the world, making the image appear more realistic.  This ratio is also better for watching widescreen movies, which are recorded in widescreen for the same reason.\nTrue to its name, high definition television offers a much higher resolution than standard definition video.  While a typical analog broadcast in the U.S. contains a maximum of 525 horizontal lines of resolution, an HDTV signal supports up to 1080.  The three formats used by HDTV are 1080i (interlaced), and 720p and 1080p (progressive).  HDTV's higher resolution produces images that are much finer and contain more detail and more color than previous formats.  HDTV also provides a higher-quality digital audio signal than SDTV and supports up to six audio channels compared to the two channels allowed previously.\nTo watch HDTV, you need an HDTV-compatible television and a means of receiving an HDTV signal.  HDTVs come in both 16:9 and 4:3 formats (for backwards compatibility).  Some HDTVs include HDTV tuners for receiving over-the-air broadcasts, but others require the receiver to be bought separately.  Fortunately, most cable and satellite TV companies offer HDTV-compatible boxes with their digital service plans."
        ]
    },
    {
        "word": "HDV",
        "type": [],
        "definition": [
            "Stands for \"High-Definition Video.\"  According to a consortium of manufacturers including Sony, JVC, Canon, and Sharp, it is a \"consumer high-definition video format.\"  HDV is the next step up from Mini DV, which has been used in consumer digital camcorders for several years.  The HDV technology allows high-definition video to be recorded on a Mini DV tape, using MPEG-2 compression.\nOf course, recording in high-definition requires an HD camcorder, such as the Sony HDR-FX1 or the JVC GR-HD1.  These cameras are significantly more expensive than their Mini DV counterparts, but can capture much higher quality video.  HDV uses a native 16:9 widescreen format, with a resolution of 1280 x 720 pixels.  This is a substantial improvement over Mini DV, which records video in a 4:3 format, with a maximum resolution of 500 horizontal lines.  Most HDV camcorders allow the user to record in standard DV as well, but if you shell out a couple thousand dollars extra for a HDV camcorder, you might as well shoot everything in HD."
        ]
    },
    {
        "word": "HFS",
        "type": [],
        "definition": [
            "Stands for \"Hierarchical File System.\"  HFS is the file system used for organizing files on a Macintosh hard disk.  When a hard disk is formatted for a Macintosh computer, the hierarchical file system is used to create a directory that can expand as new files and folders are added to the disk.  Since HFS is a Macintosh format, Windows computers cannot recognize HFS-formatted drives.  Windows hard drives are typically formatted using WIN32 or NTFS file systems.\nSince HFS was not originally designed to handle large hard disks, such as the 100GB+ hard disks that are common today, Apple introduced a updated file system called HFS+, or HFS Extended, with the release of Mac OS 8.1.  HFS+ allows for smaller clusters or block sizes, which reduces the minimum size each file must take up.  This means disk space can be used much more efficiently on large hard disks.  Mac OS X uses the HFS+ format by default and also supports journaling, which makes it easier to recover data in case of a hard drive crash."
        ]
    },
    {
        "word": "HMD",
        "type": [],
        "definition": [
            "Stands for Head-Mounted Display.  An HMD is a visual device used for virtual reality, augmented reality, or mixed reality.  It can be as small as a pair of glasses or as large as a helmet with an integrated display.\nVirtual Reality HMDs\nHead-mounted displays designed for virtual reality (a.k.a. VR headsets) are typically larger than their AR\/MR counterparts.  Most have adjustable straps or a helmet to keep the headset in place.  VR headsets are enclosed, meaning the view is completely black when the screen is turned off.  When you turn the headset on, it provides an immersive 3D environment that responds to your movements.  Examples include the Meta Quest and the PlayStation VR headsets.\n\nAugmented & Mixed-Reality HMDs\nHead-mounted displays designed for augmented and mixed reality are see-through headsets that overlay digital images in a real-world environment.  For example, an AR headset may allow you to see how different pieces of furniture would look in your living room.  In the case of mixed reality, you can interact with virtual objects in a real 3D space.  Examples of AR and MR HMDs include Google Glass and Microsoft Hololens.\n\nNOTE: Most AR\/MR HMDs contain all the hardware needed to operate and do not require additional hardware, such as a PC.  The Meta Quest 2 VR headset functions without a computer but can also work with a PC to load additional content.  The PlayStation VR headset is a PlayStation accessory and requires a PlayStation console."
        ]
    },
    {
        "word": "HSF",
        "type": [],
        "definition": [
            "Stands for \"Heat Sink and Fan.\"  Nearly all computers have heat sinks, which help keep the CPU cool and prevent it from overheating.  But sometimes the heat sink itself can become too hot.  This can happen if the CPU is running at full capacity for an extended period of time or if the air surrounding the computer is simply too hot.\nTherefore, a fan is often used in combination with the heat sink to keep both the CPU and heat sink at an acceptable temperature.  This combination is creatively called a \"heat sink and fan,\" or HSF.  The fan moves cool air across the heat sink, pushing hot air away from the computer.  Each CPU has a thermometer built in that keeps track of the processor's temperature.  If the temperature becomes to hot, the fan or fans near the CPU may speed up to help cool the processor and heat sink.  "
        ]
    },
    {
        "word": "HTML",
        "type": [],
        "definition": [
            "Stands for \"Hypertext Markup Language.\"  HTML is the language used to create webpages.  \"Hypertext\" refers to the hyperlinks that an HTML page may contain.  \"Markup language\" refers to the way tags are used to define the page layout and elements within the page.\nBelow is an example of HTML used to define a basic webpage with a title and a single paragraph of text.\n&lt;!doctype html&gt;\n&lt;html&gt;\n&lt;head&gt;\n&lt;title&gt;TechTerms.com&lt;\/title&gt;\n&lt;\/head&gt;\n&lt;body&gt;\n&lt;p&gt;This is an example of a paragraph in HTML.&lt;\/p&gt;\n&lt;\/body&gt;\n&lt;\/html&gt;\nThe first line defines what type of contents the document contains.  \"&lt;!doctype html&gt;\" means the page is written in HTML5.  Properly formatted HTML pages should include &lt;html&gt;, &lt;head&gt;, and &lt;body&gt; tags, which are all included in the example above.  The page title, metadata, and links to referenced files are placed between the &lt;head&gt; tags.  The actual contents of the page go between the &lt;body&gt; tags.\nThe web has gone through many changes over the past few decades, but HTML has always been the fundamental language used to develop webpages.  Interestingly, while websites have become more advanced and interactive, HTML has actually gotten simpler.  If you compare the source of an HTML5 page with a similar page written in HTML 4.01 or XHTML 1.0, the HTML5 page would probably contain less code.  This is because modern HTML relies on cascading style sheets or JavaScript to format nearly all the elements within a page.\nNOTE: Many dynamic websites generate webpages on-the-fly, using a server-side scripting language like PHP or ASP.  However, even dynamic pages must be formatted using HTML.  Therefore, scripting languages often generate the HTML that is sent to your web browser."
        ]
    },
    {
        "word": "HTML5",
        "type": [],
        "definition": [
            "HTML5 is the fifth major standard of HTML.  Development of the standard began in 2007 and HTML5 websites started becoming mainstream in 2010.  The final HTML5 standard was officially standardized by W3C on October 28, 2014.\nThe previous HTML standard, HTML 4.01, was standardized in 1999 – fifteen years before the HTML5 standard was published.  However, in the decade preceding HTML5, most websites were written in XHTML, a more strict version of HTML published in 2000.  HTML5 was designed to supersede both HTML 4 and XHTML by providing web developers with a simpler standard that includes several new features for the modern web.\nThe table below includes a list of new elements, or tags, introduced in HTML5 that are used to define the structure of a document.\n\nTagDescription\n&lt;header&gt;Defines the webpage header\n&lt;footer&gt;Defines the page footer\n&lt;nav&gt;Defines the navigation bar\n&lt;main&gt;Defines the main content of a webpage\n&lt;article&gt;Defines an article within a page\n&lt;section&gt;Defines a section of a document or article\n&lt;aside&gt;Defines content outside a page's primary content\n\nThese tags simplify the webpage's source as well as the corresponding CSS styles.  For example, in order to define a navigation element in XHTML, you would typically write \"&lt;div class=\"nav\"&gt; in the page's HTML and define a class called \".nav\" in CSS.  In HTML5, you can simply insert the &lt;nav&gt; tag in the HTML and style the element itself using CSS.\nHTML5 includes several other new tags as well.  Examples include &lt;canvas&gt; and &lt;svg&gt; for graphics and &lt;audio&gt; and &lt;video&gt; for multimedia elements.  These tags provide new capabilities for web developers, though it is important to note that HTML5 still relies heavily on CSS and JavaScript for page styling, animations, and user interaction.  Therefore, most interactive HTML5 websites are built using a combination of HTML5, CSS3, and JavaScript or jQuery.\nNOTE: Previous HTML standards included a space between the \"HTML\" and the number (i.e., HTML 1.0, HTML 4.01). HTML 5.0 does away with the space and is officially written as HTML5."
        ]
    },
    {
        "word": "HTTP",
        "type": [],
        "definition": [
            "Stands for \"Hypertext Transfer Protocol.\"  HTTP is the protocol used to transfer data over the web.  It is part of the Internet protocol suite and defines commands and services used for transmitting webpage data.\nHTTP uses a server-client model.  A client, for example, may be a home computer, laptop, or mobile device.  The HTTP server is typically a web host running web server software, such as Apache or IIS.  When you access a website, your browser sends a request to the corresponding web server and it responds with an HTTP status code.  If the URL is valid and the connection is granted, the server will send your browser the webpage and related files.\nSome common HTTP status codes include:\n\n200 - successful request (the webpage exists)\n301 - moved permanently (often forwarded to a new URL)\n401 - unauthorized request (authorization required)\n403 - forbidden (access is not allowed to the page or directory)\n500 - internal server error (often caused by an incorrect server configuration)\n\nHTTP also defines commands such as GET and POST, which are used to handle form submissions on websites.  The CONNECT command is used to facilitate a secure connection that is encrypted using SSL.  Encrypted HTTP connections take place over HTTPS, an extension of HTTP designed for secure data transmissions.\nNOTE: URLs that begin with \"http:\/\/\" are accessed over the standard hypertext transfer protocol and use port 80 by default. URLs that start with \"https:\/\/\" are accessed over a secure HTTPS connection and often use port 443."
        ]
    },
    {
        "word": "HTTPS",
        "type": [],
        "definition": [
            "Stands for \"HyperText Transport Protocol Secure.\"  HTTPS is the same thing as HTTP, but uses a secure socket layer (SSL) for security purposes.  Some examples of sites that use HTTPS include banking and investment websites, e-commerce websites, and most websites that require you to log in.\nWebsites that use the standard HTTP protocol transmit and receive data in an unsecured manner.  This means it is possible for someone to eavesdrop on the data being transferred between the user and the Web server.  While this is highly unlikely, it is not a comforting thought that someone might be capturing your credit card number or other personal information that you enter on a website.  Therefore, secure websites use the HTTPS protocol to encrypt the data being sent back and forth with SSL encryption.  If someone were to capture the data being transferred via HTTPS, it would be unrecognizable.\nYou can tell if a website is secure by viewing the URL in the address field of your Web browser.  If the Web address starts with https:\/\/, you know you are accessing a secure website.  Most browsers will also display a lock icon somewhere along the edge of the window to indicate the website you are currently visiting is secure.  You can click the lock icon to view the secure certificate that authenticates the website.\nSo whenever you are asked to enter personal or financial information on a website, make sure that the URL starts with \"https:\/\/\" and that the lock icon appears in the window.  Then you can be sure that the website is secure and any data you enter will only be recognized by your computer and the Web server."
        ]
    },
    {
        "word": "Hacker",
        "type": [],
        "definition": [
            "While this term originally referred to a clever or expert programmer, it is now more commonly used to refer to someone who can gain unauthorized access to other computers.  A hacker can \"hack\" his or her way through the security levels of a computer system or network.  This can be as simple as figuring out somebody else's password or as complex as writing a custom program to break another computer's security software.  Hackers are the reason software manufacturers release periodic \"security updates\" to their programs.  While it is unlikely that the average person will get \"hacked,\" some large businesses and organizations receive multiple hacking attempts a day."
        ]
    },
    {
        "word": "Half-Duplex",
        "type": [],
        "definition": [
            "Half-duplex is a type of communication in which data can flow back and forth between two devices, but not simultaneously.  Each device in a half-duplex system can send and receive data, but only one device can transmit at a time.\nAn example of a half-duplex device is a CB (citizens band) radio.  The CB protocol, which is used by truckers, police officers, and other mobile personnel, allows users to communicate back and forth on a specific radio frequency.  However, since the CB protocol only supports half-duplex communication, only person can speak at a time.  This is why people communicating over two-way radios often say \"over\" at the end of each statement.  It is a simple way of telling the recipient he or she can respond if necessary.\nMost communication protocols are designed to be full-duplex, rather than half duplex.  Full-duplex communication allows computers and other devices to communicate back and forth at the same.  While some computer networks can be set to half-duplex mode to limit bandwidth, full-duplex communication is much more common.\nNOTE: Half-duplex is sometimes abbreviated \"HDX.\""
        ]
    },
    {
        "word": "Halftone",
        "type": [],
        "definition": [
            "A halftone, or halftone image, is an image comprised of discrete dots rather than continuous tones.  When viewed from a distance, the dots blur together, creating the illusion of continuous lines and shapes.  By halftoning an image (converting it from a bitmap to a halftone), it can be printed using less ink.  Therefore, many newspapers and magazines use halftoning to print pages more efficiently.\nOriginally, halftoning was performed mechanically by printers that printed images through a screen with a grid of holes.  During the printing process, ink passed through the holes in the screen, creating dots on the paper.  For monochrome images, only one pass was needed to create an image.  For multicolor images, several passes or \"screens\" were required.\nToday's printers are more advanced and typically do not contain physical screens.  Instead, the halftone images are generated by a computer and the resulting image is printed onto the paper.  By using a process called dithering, modern printers can randomize the dot patterns, creating a more natural appearance.  This produces realistic images using far less ink than fully saturated ones.\nLike a standard bitmap, the quality of a halftone image depends largely on the its resolution.  A halftone with a high resolution (measured in LPI), will have greater detail than a halftone with a low resolution.  While the goal of halftoning is typically to create a realistic image, sometimes low resolutions are used for an artistic effect."
        ]
    },
    {
        "word": "Handle",
        "type": [],
        "definition": [
            "In the online world, a handle is another word for a username.  It can refer to the name you use in chat rooms, web forums, and social media services like Twitter.\nThe term \"handle\" dates back to the 1970s and comes from Citizens Band radio (CB radio), a short-distance radio communications medium.  CB radio users would identify themselves by unique nicknames, which became known as handles.  When online chat became popular in the 1990s, the term \"handle\" transferred to the Internet and became a common way for users to identify themselves online.\nWhile handle and username are often used synonymously, they do not always mean the same thing.  For example, when you choose a username for a secure website like a bank or investment site, it is not necessarily your handle.  This is because the username is intended to be private and used in combination with a password to create your login.  Handles, on the other hand, are public usernames that can be used to identify people online.\nThe most popular web service to use handles is Twitter.  In fact, Twitter usernames are often called \"Twitter handles.\"  You can reference other users in a tweet using \"Mentions\" or the \"@reply\" feature.  To mention another Twitter user in your post, simply type an at symbol (@) immediately before the user's handle.  A link to the user's profile will show up in the published tweet and the user will be notified that you have mentioned or replied to him or her."
        ]
    },
    {
        "word": "Handshake",
        "type": [],
        "definition": [
            "In the real world, a handshake is a customary greeting between two people.  Similarly, a computer handshake serves as a greeting between two computer systems.  It is commonly used to initialize a network connection between two hosts.\nA computer handshake may be completed between any two systems that communicate with each other on the same protocol.  The two systems may be a client and server or simply two computers on a P2P network.  The handshake confirms the identities of the connecting systems and allows additional communication to take place.\nHandshaking over a network is commonly called a 3-Way Handshake or \"SYN-SYN-ACK.\"  A successful handshake involves seven steps:\n\nHost A sends a synchronize (SYN) packet to Host B.\nHost B receives Host A's SYN request.\nHost B sends a synchronize acknowledgement (SYN-ACK) message to Host A.\nHost A receive's Host B's SYN-ACK message.\nHost A sends an acknowledge (ACK) message to to Host B.\nHost B receives Host A's ACK message.\nThe connection between the two systems is established.\n\nWhen a system initiates a handshake, there are three possible outcomes:\n\nNo response – If the system receiving the handshake is not available or does not support the protocol the initiating system uses, it may not respond to the request.\nConnection refused – The system receiving the handshake is available and understands the request, but denies the connection.\nConnection accepted – The system receiving the handshake is available, receives the request, and accepts the connection.\n\nThe third outcome listed above is the only the one in which the handshake is completed.  If a handshake is successful, the two systems can begin communicating and transferring (data) over the established protocol.  Examples of protocols that use handshaking include TCP, TLS, and SSL."
        ]
    },
    {
        "word": "Hard Copy",
        "type": [],
        "definition": [
            "A hard copy is a printed document.  It may be a text file, photograph, drawing, or any other type of printable file.  For example, instead of e-mailing a business memo, it may be sent out as a hard copy, or an actual physical paper containing the memo.\nWhen a document is created on a computer, it is typically saved as a file on the computer's hard drive.  This is sometimes referred to as a soft copy.  While the file can be easily opened and edited on a computer, it can also be easily deleted.  Therefore, sometimes printing a hard copy is done to create a physical backup of the document."
        ]
    },
    {
        "word": "Hard Disk",
        "type": [],
        "definition": [
            "When you save data or install programs on your computer, the information is typically written to your hard disk.  The hard disk is a spindle of magnetic disks, called platters, that record and store information.  Because the data is stored magnetically, information recorded to the hard disk remains intact after you turn your computer off.  This is an important distinction between the hard disk and RAM, or memory, which is reset when the computer's power is turned off.\nThe hard disk is housed inside the hard drive, which reads and writes data to the disk.  The hard drive also transmits data back and forth between the CPU and the disk.  When you save data on your hard disk, the hard drive has to write thousands, if not millions, of ones and zeros to the hard disk.  It is an amazing process to think about, but may also be a good incentive to keep a backup of your data."
        ]
    },
    {
        "word": "Hard Drive",
        "type": [],
        "definition": [
            "The hard drive is what stores all your data.  It houses the hard disk, where all your files and folders are physically located.  A typical hard drive is only slightly larger than your hand, yet can hold over 100 GB of data.  The data is stored on a stack of disks that are mounted inside a solid encasement.  These disks spin extremely fast (typically at either 5400 or 7200 RPM) so that data can be accessed immediately from anywhere on the drive.  The data is stored on the hard drive magnetically, so it stays on the drive even after the power supply is turned off.\nThe term \"hard drive\" is actually short for \"hard disk drive.\"  The term \"hard disk\" refers to the actual disks inside the drive.  However, all three of these terms are usually seen as referring to the same thing -- the place where your data is stored.  Since I use the term \"hard drive\" most often, that is the correct one to use."
        ]
    },
    {
        "word": "Hard Token",
        "type": [],
        "definition": [
            "A hard token, sometimes called an \"authentication token,\" is a hardware security device that is used to authorize a user.  An common example of a hard token is a security card that gives a user access to different areas of building or allows him to log in to a computer system.  Some hard tokens are used in combination with other security measures to further enhance security.  For example, a username and password or a fingerprint scan may be required along with the hard token to gain access to a secure system.\nA hard tag is another type of hard token that is used as a security device on merchandise such as clothing and electronics.  You have probably seen these used in several retail stores, where they are used to deter theft.  If someone tries to exit the building with merchandise before the hard tag has been deactivated, it causes the security system by the doors to beep.  Of course, if the cashier forgets to deactivate the hard tag, you get to experience the unpleasant beeping sound as you exit even if you paid for the merchandise."
        ]
    },
    {
        "word": "Hardware",
        "type": [],
        "definition": [
            "Computer hardware refers to the physical parts of a computer and related devices.  Internal hardware devices include motherboards, hard drives, and RAM.  External hardware devices include monitors, keyboards, mice, printers, and scanners.\nThe internal hardware parts of a computer are often referred to as components, while external hardware devices are usually called peripherals.  Together, they all fall under the category of computer hardware.  Software, on the other hand, consists of the programs and applications that run on computers.  Because software runs on computer hardware, software programs often have system requirements that list the minimum hardware required for the software to run."
        ]
    },
    {
        "word": "Hash",
        "type": [],
        "definition": [
            "A hash is a function that converts one value to another.  Hashing data is a common practice in computer science and is used for several different purposes.  Examples include cryptography, compression, checksum generation, and data indexing.\nHashing is a natural fit for cryptography because it masks the original data with another value.  A hash function can be used to generate a value that can only be decoded by looking up the value from a hash table.  The table may be an array, database, or other data structure.  A good cryptographic hash function is non-invertible, meaning it cannot be reverse engineered.\nSince hashed values are generally smaller than the originals, it is possible for a hash function to generate duplicate hashed values.  These are known as \"collisions\" and occur when identical values are produced from different source data.  Collisions can be resolved by using multiple hash functions or by creating an overflow table when duplicate hashed values are encountered.  Collisions can be avoided by using larger hash values.\nDifferent types of compression, such as lossy image compression and media compression, may incorporate hash functions to reduce file size.  By hashing data into smaller values, media files can be compressed into smaller chunks.  This type of one-way hashing cannot be reversed, but it can produce an approximation of the original data that requires less disk space.\nHashes are also used to create checksums, which validate the integrity of files.  A checksum is a small value that is generated based on the bits in a file or block of data such as a disk image.  When the checksum function is run on a copy of the file (such as a file downloaded from the Internet), it should produce the same hashed value as the original file.  If the file does not produce the same checksum, something in the file was changed. \nFinally, hashes are used to index data.  Hashing values can be used to map data to individual \"buckets\" within a hash table.  Each bucket has a unique ID that serves as a pointer to the original data.  This creates an index that is significantly smaller than the original data, allowing the values to be searched and accessed more efficiently."
        ]
    },
    {
        "word": "Hashtag",
        "type": [],
        "definition": [
            "A hashtag is a number symbol (#) used to label keywords in a tweet.  The name \"hashtag\" was coined by Twitter and combines the word \"hash\" (another name for the number symbol) and \"tag,\" since it is used to tag certain words.  In order to tag a keyword in a Twitter post, simply type a number symbol (Shift+3) immediately before the word.  For example, you can tag the word \"tech\" in a tweet by typing \"#tech.\"\nTwitter automatically turns hashtagged words into links to a dynamic feed.  This feed is updated in real-time and lists all recent tweets containing the same hashtag.  When you post a tweet with a hashtag, your tweet will show up in the public feed.  Besides clicking on hashtags within tweets, you can also search for hashtags using Twitter's search feature.\nHashtags are used to categorize tweets, since all tweets with the same hashtag are related.  Therefore, searching for hashtags is a good way to monitor hot topics or trends.  For example, #marchmadness is popular during the March NCAA tournament, while #election might be popular during political elections.  Company names, such as #apple and #microsoft, are common hashtagged terms and may be used when people comment on new product releases.  As people post tweets with the same hashtag, the corresponding feed can easily turn into a discussion.\nA hashtag can be any word or combination or words and can also include numbers.  You can use trending hashtags in your tweets or make up your own.  However, it is best to use popular hashtags if you want others to see your tweet.  Each Twitter post can include multiple hashtags, though Twitter discourages spamming tweets with hashtags and recommends using no more than three hashtags per tweet.  It is common to include hashtags at the end of a tweet, but you can hashtag any word by simply adding a number symbol in front of it."
        ]
    },
    {
        "word": "Header",
        "type": [],
        "definition": [
            "In computing, the term \"header\" can refer to a number of different things.  Some of the most common uses include 1) a document header, 2) a webpage header, and 3) a file header.\n1. Document Header\nMany word processing programs allow you to add a header and\/or footer to each page.  The header is a small area at the top of the document, while the footer is located at the bottom.  Document headers are often used to display the document title or company name at the top of each page.  By default, the header content is the same on all pages, so when you edit the header on one page, it will update on all the other pages as well.  If you break a document up into sections, you can specify different headers for each section.\nWord processors provide different ways of adding and editing header content.  Several programs allow you to select View &rarr; Headers and Footers to display the header and footer content.  Once visible, you can type new content inside each section.  Most version of Microsoft Word allow you to simply double-click in the header area to activate the header and add or edit text.  If you want to change the height of the header, you can open the Document Formatting window and modify the margins.\n2. Webpage Header\nThe header of a webpage typically includes the company or organization's logo, as well as the main navigation bar.  This section, which resides at the top of each webpage, is often part of a template and therefore is the same across all pages within a website or section of a website.  HTML 5 even includes a &lt;header&gt; tag that developers can use to specify the header section of each webpage.\nNOTE: A webpage header should not be confused with the &lt;head&gt; section in the HTML, which includes the page title, meta tags, and links to referenced files.\n3. File Header\nA file header is a small amount of data at the beginning of a file.  File headers vary between file formats, but they generally define the content of the file and list specific file attributes.  For example, the file header of a JPEG image file may include the image format, color profile, and application that created the file.  An MP3 audio file may include the song name, tagging format, and compression information.  You can view a file's header by dragging the file icon to a text editor and reading the first few lines.  While binary files may contain a lot of garbled characters, the header information is often still readable."
        ]
    },
    {
        "word": "Headphones",
        "type": [],
        "definition": [
            "Headphones are small speakers that can be worn in or around your ears.  Traditional headphones have two ear cups attached by a band that is placed over your head.  Smaller headphones, often called earbuds or earphones, are placed inside the outer part of your ear canal.\nLike speakers, headphones contain transducers that convert an audio signal into sound waves.  Headphones that connect to an analog audio port (such as a 3.5 mm audio jack) process analog audio.  Headphones that connect to a digital port, such as a USB or Lightning port process digital audio.  Digital headphones must also include a digital-to-analog converter, or DAC, in order to produce the analog output.\nWhile headphones function the same way as standalone speakers, their output is significantly different.  Speakers must generate enough amplitude for the sound to be audible from far away.  Headphones only need to send the sound waves a few millimeters to your ear drums.  Therefore headphone components are much smaller and often more precise than speaker components.  Even though the output is much lower than standalone speakers, the close proximity of headphones to your ears can make the volume sound very loud.  Most headphones even support the full 20 hertz to 20,000 Hz frequency range.  However, the bass is less noticeable since they don't move as much air.\nHeadphones come in many shapes and sizes, but a few common types are listed below.\n\nIn-ear - earphones that fit snuggly in your ear canal; typically contain rubber ends that help give them a secure fit.\nEarbuds - earphones that rest inside the edge of your ear; often included with smartphones and portable media players.\nOn-ear - headphones that rest on your ears but don't encompass the whole ear; helps isolate outside sounds.\nOver-ear - headphones that wrap around your ears; also called \"around-ear\" or \"circumaural\" headphones; come in open and closed versions.  Open versions allow all outside noise, while closed versions limit external sounds.\nNoise-cancelling - creates an extra quiet listening environment by canceling outside noise; contains a microphone that detects external sounds and sends the opposite waveform to your ear to \"cancel\" the noise; available in all types of form factors.\n"
        ]
    },
    {
        "word": "Heap",
        "type": [],
        "definition": [
            "A heap is a data structure made up of \"nodes\" that contain values.  A typical heap has a root node at the top, which may have two or more child nodes directly below it.  Each node can have two or more child nodes, which means the heap becomes wider with each child node.  When displayed visually, a heap looks like an upside down tree and the general shape is a heap.\nWhile each node in a heap may have two or more child nodes (also called \"children\"), most heaps limit each node to two children.  These types of heaps are also called binary heaps and may be used for storing sorted data.  For example, a \"binary max heap\" stores the highest value in the root node.  The second and third highest values are stored in the child nodes of the root node.  Throughout the tree, each node has a greater value than either of its child nodes.  A \"binary min heap\" is the opposite, where the root node stores the lowest value and each node has a lower value than its children.\nIn computer science, heaps are often drawn as simple diagrams.  However, actually storing data in a heap is more complex.  In order to create a heap, programmers must write individual algorithms for inserting and deleting data.  The values inserted into a heap are typically stored in an array, which can be referenced by a program.  Since the data in a heap is already sorted, it provides an efficient means of searching for specific values.\nNOTE: \"The heap\" is also a programming term that may be used to describe dynamically allocated memory.  This block of memory can be accessed by active applications.  Since memory in the heap is allocated dynamically, it may grow or shrink depending on how much memory is being used."
        ]
    },
    {
        "word": "Heartbleed",
        "type": [],
        "definition": [
            "Heartbleed is a security hole in OpenSSL that was discovered by the Finnish security firm Codenomicon and publicized on April 7, 2014.  OpenSSL is the encryption technology used to create secure website connections over HTTPS, establish VPNs, and encrypt several other protocols.  Since OpenSSL is used by roughly two-thirds of web servers, the vulnerability is considered one of the most significant security holes discovered since the beginning of the web.\nHow does Heartbleed work?\nThe Heartbleed exploit takes advantage of the initial communication between the client and server.  This preliminary step is commonly called a \"handshake,\" though OpenSSL provides a variation called a \"heartbeat.\"  The heartbeat is used to establish a secure connection, but the data transmitted during the heartbeat is not sent securely.\nBy sending false information to a server, a hacker can retrieve 64 kilobyte chunks of data from the server's cache.  While this is a small amount of data, it is enough to contain a username, password, or other confidential information.  By making several requests in a row, a hacker can potentially capture large amounts of private data cached in a server's memory.\nThe Heartbleed bug is specific to OpenSSL 1.0.1 through 1.0.1f and version 1.0.2-beta1.  Other versions of OpenSSL and other types of TLS (transport layer security) implementations are not affected.  After the bug was made known on April 7, many web servers were patched immediately with version 1.0.1g.  However, it is unknown how many servers were affected and how many still are using the vulnerable version of OpenSSL.\nHow does Heartbleed affect me?\nIt is unlikely that you are directly affected by the Heartbleed bug.  While the security hole went undetected for two years, there is little evidence that the exploit has been widely used.  Still, to be safe, you can protect yourself by updating your passwords for website logins, email accounts, and other online services."
        ]
    },
    {
        "word": "Heat Sink",
        "type": [],
        "definition": [
            "A computer's CPU may perform millions of calculations every second.  As the processor continues to work at a rapid pace, it begins to generate heat.  If this heat is not kept in check, the processor could overheat and eventually destroy itself.\nFortunately, CPUs include a heat sink, which dissipates the heat from the processor, preventing it from overheating.  The heat sink is made out of metal, such as a zinc or copper alloy, and is attached to the processor with a thermal material that draws the heat from away the processor towards the heat sink.  Heat sinks can range in size from barely covering the processor to several times the size of the processor if the CPU requires it.\nMost heat sinks also have \"fins,\" which are thin slices of metal that are connected to the base of the heat sink.  These additional pieces of metal further dissipate the heat by spreading it over a much larger area.  A fan is often used to cool the air surrounding the heat sink, which prevents the heat sink from getting too hot.  This configuration is referred to as a heat sink and fan or HSF combination.  While heat sinks are used in nearly all computer CPUs, they have become commonplace in video card processors, or GPUs, as well."
        ]
    },
    {
        "word": "Hertz",
        "type": [],
        "definition": [
            "\nHertz (abbreviated: Hz) is the standard unit of measurement used for measuring frequency.  Since frequency is measured in cycles per second, one hertz equals one cycle per second.\nHertz is used commonly used to measure wave frequencies, such as sound waves, light waves, and radio waves.  For example, the average human ear can detect sound waves between 20 and 20,000 Hz.  Sound waves close to 20 Hz have a low pitch and are called \"bass\" frequencies.  Sound waves above 5,000 Hz have a high pitch and are called \"treble\" frequencies.\nWhile hertz can be used to measure wave frequencies, it is also used to measure the speed of computer processors.  For example, each CPU is rated at a specific clock speed.  This number indicates how many instruction cycles the processor can perform each second.  Since modern processors can perform millions or even billions of instructions per second, clock speeds are typically measured in megahertz or gigahertz.\nAbbeviation: Hz"
        ]
    },
    {
        "word": "Heuristic",
        "type": [],
        "definition": [
            "Generally speaking, a heuristic is a \"rule of thumb,\" or a good guide to follow when making decisions.  In computer science, a heuristic has a similar meaning, but refers specifically to algorithms.\nWhen programming software, computer programmers aim to create the most efficient algorithms to accomplish various tasks.  These may include simple processes like sorting numbers or complex functions such as processing images or video clips.  Since these functions often accept a wide range of input, one algorithm may perform well in certain cases, while not very well in others.\nFor example, the GIF image compression algorithm performs well on small images with few colors, but not as well as JPEG compression on large images with many colors.  If you knew you were only going to be dealing with small images that didn't have a wide range of colors, GIF compression would be all you need.  You wouldn't have to worry about large, colorful images, so there would be no point in optimizing the algorithm for those images.  Similarly, computer programmers often use algorithms that work well for most situations, even though they may perform inefficiently for uncommon situations.\nTherefore, a heuristic process may include running tests and getting results by trial and error.  As more sample data is tested, it becomes easier to create an efficient algorithm to process similar types of data.  As stated previously, these algorithms are not always perfect, but work well most of the time.  The goal of heuristics is to develop a simple process that generates accurate results in an acceptable amount of time."
        ]
    },
    {
        "word": "Hexadecimal",
        "type": [],
        "definition": [
            "Hexadecimal is a base-16 number system.  It is a different method of representing numbers than the base-10 system we use in every day practice.  In base-10, we count in multiples of 10 before adding another digit.  For example, \"8 - 9 - 10 - 11 - 12...\" and \"98 - 99 - 100 - 101 - 102...\"  Notice how a new digit is added when the number 10 is reached, and another digit is added to represent 100 (10x10).  In base-16, or the hexadecimal number system, each digit can have sixteen values instead of ten.  The values of a hexadecimal digit can be:\n0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F\nTherefore, the number 12 (in the common base-10 format) would be represented as \"C\" in hexadecimal notation.  The number 24 would be 18 (16+8).  100 is 64 in hexadecimal (16x6 + 4) and 1000 is 3E8 (256x3 + 16x14 + 8).\nWhile computers process numbers using the base-2, or binary system, it is often more efficient to visually represent the numbers in hexadecimal format.  This is because it only takes one hexadecimal digit to represent four binary digits.  Since there are eight binary digits in a byte, only two hexadecimal digits are needed to represent one byte."
        ]
    },
    {
        "word": "HiDPI",
        "type": [],
        "definition": [
            "HiDPI is an adjective that describes a display with high pixel density or DPI.  A HiDPI screen can display sharper text and more detailed images than a standard DPI display.\nWhile there is no official DPI threshold for a HiDPI display, a typical HiDPI monitor has a DPI of at least 200.  Most HiDPI monitors have twice the resolution of a comparable \"standard DPI\" display, which is ideal for scaling bitmap images.  For example, a typical 27\" monitor may have a resolution of 2560x1440 pixels (109 DPI).  A HiDPI 27\" monitor may have a resolution of 5120x2880, which is twice the pixel density (218 DPI).\nA 27\" iMac with a 5K display has a 5120x2880 resolution.  Apple calls this a \"Retina display,\" which is Apple's trademarked term for a HiDPI display.\nHiDPI is related to resolution but also factors in screen size.  For example, a small smartphone screen with an HD resolution of 1920x1080 may be considered HiDPI, while a 24\" display with a 1920x1080 is not HiDPI.  Computer monitors and laptop screens must have a much higher resolution than smartphones to be considered HiDPI.\nAndroid HiDPI Standards\nNearly all smartphones have high pixel density, so most mobile displays are HiDPI.  To help developers target different DPIs, Google has established the following Android pixel density standards:\n\nldpi - low-density (~120dpi)\nmdpi - medium-density or \"baseline dpi\" (~160dpi)\nhdpi - high-density (~240dpi)\nxhdpi - extra-high-density (~320dpi)\nxxhdpi - extra-extra-high-density (~480dpi)\nxxxhdpi - extra-extra-extra-high-density (~640dpi)\n"
        ]
    },
    {
        "word": "Hibernate",
        "type": [],
        "definition": [
            "If you are not going to use your computer for a few hours, it is a good idea to put it to sleep (also known as standby mode) to save power.  If you are not going to use the computer for more than a day, it is usually best to turn it off.  However, some Windows computers offer an option that combines the benefits of sleep mode and completely powering down, called \"Hibernate.\"\nWhen you select Hibernate, the computer saves the current state of the system from the computer's RAM to the hard disk, then shuts down.  When the computer is restarted, instead of going through the typical boot sequence, the previously saved state is automatically loaded into the RAM.  The open windows and running programs from your previous session appear just as they were when the computer entered Hibernate mode.  Hibernate mode acts like Standby mode, except the computer can be completely turned off.  This is especially helpful for laptop computers, which will slowly lose their battery charge if they are left in sleep mode.\nTo make your computer hibernate, select \"Turn Off Computer\" from the bottom of the Windows Start Menu.  Then press and hold the Shift key when the dialog box appears.  The \"Standby\" option should change to \"Hibernate.\"  If the Standby option does not change, you may need to enable Hibernate mode in Windows.  This can be done by opening the \"Power Options\" control panel, clicking the Hibernate tab, and checking the box that says, \"Enable hibernation.\""
        ]
    },
    {
        "word": "High Sierra",
        "type": [],
        "definition": [
            "High Sierra is the common name of macOS 10.13.  It is the 14th version of Apple's desktop operating system, and follows Sierra, macOS 10.12.  Apple released macOS High Sierra on September 25, 2017.\nThe similarity of the name \"High Sierra\" to \"Sierra\" is not coincidental, as it was designed to be a performance update rather than major feature update.  Previous performance updates include Snow Leopard (which followed Leopard), Mountain Lion (which followed Lion), and El Capitan (which followed Yosemite).\nThe most notable performance improvement in High Sierra is the introduction of a new file system, called \"Apple File System\" or APFS.  The new file system is designed to operate more efficiently on SSDs and other flash memory drives.  It improves overall responsiveness and speeds up common tasks, such as copying files and calculating the size of a folder.  It also includes native built-in encryption to protect data from unauthorized access.  Finally, AFS makes system backups faster and more reliable.\nHigh Sierra natively supports the High Efficiency Video Coding (HEVC) codec, which provides as good or better quality than previous codecs, while reducing file size by up to 40%.  It also supports Apple's Metal 2 API, which takes advantage of modern GPUs and improves virtual reality rendering.\nApps updated in High Sierra include Photos, which adds photo organization options and provides new editing capabilities, Mail, which includes support for compressed messages, and Notes, which supports tables.  Additionally, High Sierra makes it easier to share individual iCloud files and allows family members to share a single iCloud storage plan."
        ]
    },
    {
        "word": "High-Level Language",
        "type": [],
        "definition": [
            "A high-level language is a programming language designed to simplify computer programming.  It is \"high-level\" since it is several steps removed from the actual code run on a computer's processor.  High-level source code contains easy-to-read syntax that is later converted into a low-level language, which can be recognized and run by a specific CPU.\nMost common programming languages are considered high-level languages.  Examples include:\n\n\n\n\nC++\nC#\nCobol\nFortran\nJava\nJavaScript\n\n\n\n\nObjective C\nPascal\nPerl\nPHP\nPython\nSwift\n\n\n\n\nEach of these languages use different syntax.  Some are designed for writing desktop software programs, while others are best-suited for web development.  But they all are considered high-level since they must be processed by a compiler or interpreter before the code is executed.\nSource code written in languages like C++ and C# must be compiled into machine code in order to run.  The compilation process converts the human-readble syntax of the high-level language into low-level code for a specific processor.  Source code written in scripting languages like Perl and PHP can be run through an interpreter, which converts the high-level code into a low-level language on-the-fly."
        ]
    },
    {
        "word": "Hit",
        "type": [],
        "definition": [
            "A hit is a metric used in website analytics.  While \"hits\" and \"visits\" are sometimes used interchangeably, they are two different things.  A visit is recorded when a user visits a webpage.  A hit is recorded for each resource that is downloaded from a web server.  Therefore, it is common for hits to outnumber visits, often by a ratio of more than 10 to 1.\nMost webpages reference multiple files, such as images, CSS documents, and JavaScript files.  Each local file referenced in the HTML counts as a hit, along with the webpage itself.  Therefore, if a page includes eight images, references two CSS documents, and links to three JavaScript files, it would record 14 hits each time a visitor views the page.\nBecause website hits can vary depending on how many resources each page contains, the metric is rarely used to measure website traffic.  Instead, most webmasters track other metrics, such as visitors, unique visitors, and page views.\nNOTE: The term \"hits\" can also refer to the number of search engine results for a specific query.  For example, if you perform a Google search that generates 300,000 results, you could say the query produced 300,000 hits."
        ]
    },
    {
        "word": "Home Page",
        "type": [],
        "definition": [
            "A home page is a webpage that serves as the starting point of website.  It is the default webpage that loads when you visit a web address that only contains a domain name.  For example, visiting https:\/\/techterms.com will display the Tech Terms home page.\nThe home page is located in the root directory of a website.  Most web server allow the home page to have one of several different filenames.  Examples include index.html, index.htm, index.shtml, index.php, default.html, and home.html.  The default filename of a website's home page can be customized on both Apache and IIS servers.  Since the home page file is loaded automatically from the root directory, the home page URL does not need need to include the filename.\nThere is no standard home page layout, but most home pages include a navigation bar that provides links to different sections within the website.  Other common elements found on a home page include a search bar, information about the website, and recent news or updates.  Some websites include information that changes every day.  For example, the Tech Terms home page includes a daily quiz and tech term of the day."
        ]
    },
    {
        "word": "Honeypot",
        "type": [],
        "definition": [
            "A honeypot is a security system designed to detect and counteract unauthorized access or use of a computer system.  The name \"honeypot\" is used in reference to the way the system traps unauthorized users, such as hackers or spammers so they can be identified and prevented from causing further problems.\nHoneypots are different than typical security solutions because they intentionally lure in hackers or users with malicious intent.  For example, a company may purposely create a security hole in their network that hackers could exploit to gain access to a computer system.  The system might contain fake data that would be of interest to hackers.  By gaining access to the data, the hacker might reveal identifying information, such as an IP address, geographical location, computer platform, and other data.  This information can be used to increase security against the hacker and similar users.\nAnother example of a honeypot is an email honeypot designed to counteract spammers.  It may be configured as a fake email address that is intentionally added to known spam lists.  The email address can be used to track the servers and relays that send spam to the honeypot account.  This information can be used to blacklist certain IP addresses and domain names in anti-spam databases.  An email honeypot can even be used as a counterattack tool, which forwards spam to the email addresses of identified spammers.\nWhile honeypots are an effective way to monitor and protect information systems, they can also be expensive to maintain.  Therefore, honeypots are used primarily by large companies and organizations, rather than small businesses.  Government and educational institutions may also deploy research honeypots as a means of tracking unauthorized access attempts and improving security solutions."
        ]
    },
    {
        "word": "Horizontal Market Software",
        "type": [],
        "definition": [
            "A horizontal market is one that supplies goods to a variety of industries instead of just one.  Therefore, horizontal market software is software that can be used by several different types of industries.\nFor example, word processing and spreadsheet programs are horizontal market applications because they can be used by many types of businesses and consumers.  A business owner might use word processing software to type memos to his employees, while a student might use the same program to write a paper for a class.\nSoftware developers that create programs for horizontal markets typically have a broad audience, but also face high levels of competition.  The opposite of horizontal market software is vertical market software, which is only developed for a specific industry."
        ]
    },
    {
        "word": "Host",
        "type": [],
        "definition": [
            "A host is a computer that is accessible over a network.  It can be a client, server, or any other type of computer.  Each host has a unique identifier called a hostname that allows other computers to access it.\nDepending on the network protocol, a computer's hostname may be a domain name, IP address, or simply a unique text string.  For example, the hostname of a computer on a local network might be Tech-Terms.local, while an Internet hostname might be techterms.com.  A host can access its own data over a network protocol using the hostname \"localhost.\"\nHost vs Server\nThe terms host and server are often used interchangeably, but they are two different things.  All servers are hosts, but not all hosts are servers.  To avoid confusion, servers are often defined as a specific type of host, such as a web host or mail host.  For instance, a mail host and mail server may refer to the same thing.\nWhile a server refers to a specific machine, a host may also refer to an organization that provides a service over the Internet.  For example, a web host (or web hosting company) maintains multiple web servers and provides web hosting services for clients.  A file host may provide online storage using multiple file servers.  In other words, a hosting company hosts multiple servers that serve data to clients."
        ]
    },
    {
        "word": "Hostname",
        "type": [],
        "definition": [
            "A hostname is a label that identifies a hardware device, or host, on a network.  Hostnames are used in both local networks (LANs) as well as wide area networks like the Internet.\nLocal network hostnames don't have a standard format, but they cannot contain spaces and other special characters like commas, periods, and apostrophes.  For example, if your name your Mac, \"Mike's iMac\", the hostname will automatically be translated to \"Mikes-iMac.local\".  If you're a Mac user, you can customize your computer's hostname by modifying the computer name in the Sharing System Preference.  If you use a Windows PC, you can modify your hostname by changing the computer name within the System Control Panel.\nInternet hostnames are simply domain names, like techterms.com.  They are typically fully qualified domain names, such as www.techterms.com or ftp.techterms.com, since each subdomain is a different hostname.  However, if a website URL does not include a domain prefix like \"www,\" then the domain name itself (e.g. \"techterms.com\") can serve as the hostname.\nIn both local networks and wide area networks like the Internet, hostnames are translated to IP addresses using DNS.  Either a local or remote DNS server maps each hostname to a unique IP address, which is how the device is actually identified on a network.  Therefore, hostnames are simply used as human-readable labels, which makes it easy to remember names of devices on a network and websites on the Internet."
        ]
    },
    {
        "word": "Hot Swappable",
        "type": [],
        "definition": [
            "In electronics terminology, the word \"hot\" is often used to mean \"active\" or \"powered on.\"  Therefore, a hot swappable device is a peripheral or component that can be removed or added while a computer is running.  Replacing a device while a computer is powered on is called \"hot swapping.\"\nMost early I\/O devices were not hot swappable.  This is because early ports, such as parallel ports and SCSI ports did not support connecting or removing devices while the computer was powered on.  In fact, removing devices from these older ports while the computer was running could cause damage to them or the computer.  Since it was hassle for users to turn off their computers each time they needed to connect or reconnect a device, newer I\/O ports were designed to be hot swappable.  Modern ports that support hot swapping include USB, FireWire, and Thunderbolt.\nMost modern PCs include only hot swappable ports.  Therefore, the term is now used most often to describe internal components that can be replaced while the computer is running.  A common example is a server hard drive.  Since servers need to run constantly to avoid downtime, they typically support hot swappable hard drives.  Rack-based servers often provide easy access to one or more hard drives on the front face of the rack unit.  This allows server administrators to quickly add more storage or replace old hard drives without powering down the server.\nNOTE: Except for rare exceptions, RAM is generally not hot swappable."
        ]
    },
    {
        "word": "Hotfix",
        "type": [],
        "definition": [
            "A hotfix is a software update designed to fix a bug or security hole in a program.  Unlike typical version updates, hotfixes are urgently developed and released as soon as possible to limit the effects of the software issue.  They are often released between incremental version updates.\nYou may receive a hotfix notification by email or as an alert in the program itself.  It may be labeled as a \"critical update\" or \"security update.\"  Some applications allow you to update the software by simply clicking Update in the program.  Other applications may require you to download the hotfix package and run the update as an executable file.\nIt is typically advisable to run a hotfix update as soon as possible to avoid problems with the software.  However, any time you receive a hotfix notification, make sure it is legitimate and from the developer of the software before agreeing to install it.  In most cases, you can check the software company's website to view the update history and release notes for the program.\nNOTE: Since hotfixes are designed to fix a specific issue, the size of a hotfix is typically small.  For this reason, a hotfix may also be called a patch, since it \"patches\" the bug or security hole."
        ]
    },
    {
        "word": "Hover",
        "type": [],
        "definition": [
            "When you roll the cursor over a link on a Web page, it is often referred to as \"hovering\" over the link.  This is somewhat like when your boss hovers over you at work, but not nearly as uncomfortable.  In most cases, the cursor will change from a pointer to a small hand when it is hovering over a link.  Web developers can also use cascading style sheets (CSS) to modify the color and style of link when a user hovers over it.  For example, the link may become underlined or change color while the cursor is hovering over it.\nThe term hovering implies your computer screen is a three-dimensional space.  In this conception, your cursor moves around on a layer above the text and images.  When you click the mouse button while the cursor is hovering over a link, it presses down on the link to activate it.  Hovering can also be used in a more general sense such as moving the cursor over icons, windows, or other objects on the screen."
        ]
    },
    {
        "word": "Hub",
        "type": [],
        "definition": [
            "There are two primary types of hubs in the computing world: 1) network hubs and 2) USB hubs.\n1. Network hub\nA network hub is a device that allows multiple computers to communicate with each other over a network.  It has several Ethernet ports that are used to connect two or more network devices together.  Each computer or device connected to the hub can communicate with any other device connected to one of the hub's Ethernet ports.\nHubs are similar to switches, but are not as \"smart.\"  While switches send incoming data to a specific port, hubs broadcast all incoming data to all active ports.  For example, if five devices are connected to an 8-port hub, all data received by the hub is relayed to the five active ports.  While this ensures the data gets to the right port, it also leads to inefficient use of the network bandwidth.  For this reason, switches are much more commonly used than hubs.\n2. USB hub\nA USB hub is a device that allows multiple peripherals to connect through a single USB port.  It is designed to increase the number of USB devices you can connect to a computer.  For example, if your computer has two USB ports, but you want to connect five USB devices, you can connect a 4-port USB hub to one of the ports.  The hub will create four ports out of one, giving you five total ports.  The USB interface allows you to daisy chain USB hubs together and connect up to 127 devices to a single computer.\nSome USB hubs include a power supply, while others do not.  If you're connecting basic devices like a mouse, keyboard, and USB flash drive, an unpowered or \"passive\" USB hub should work fine.  However, some peripherals, like external hard drives and backlit keyboards, require additional electrical power.  In order for these types of devices to function through a USB hub, you may need use a powered or \"active\" hub that provides 5 volts of power to connected devices."
        ]
    },
    {
        "word": "Hyper-Threading",
        "type": [],
        "definition": [
            "Hyper-threading is a technology developed by Intel Corporation.  It is used in certain Pentium 4 processors and all Intel Xeon processors.  Hyper-threading technology, commonly referred to as \"HT Technology,\" enables the processor to execute two threads, or sets of instructions, at the same time.  Since hyper-threading allows two streams to be executed in parallel, it is almost like having two separate processors working together.\nWhile hyper-threading can improve processing performance, software must support multiple processors to take advantage of the technology.  Fortunately, recent versions of both Windows and Linux support multiple processors and therefore benefit from hyper-threading.  For example, a video playing in Windows Media Player should not be slowed down by a Web page loading in Internet Explorer.  Hyper-threading allows the two programs to be processed as separate threads at the same time.  However, individual programs can only take advantage of Intel's HT Technology if they have been programmed to support multiple processors."
        ]
    },
    {
        "word": "Hyperlink",
        "type": [],
        "definition": [
            "A hyperlink is a word, phrase, or image that you can click on to jump to a new document or a new section within the current document.  Hyperlinks are found in nearly all Web pages, allowing users to click their way from page to page.  Text hyperlinks are often blue and underlined, but don't have to be.  When you move the cursor over a hyperlink, whether it is text or an image, the arrow should change to a small hand pointing at the link.  When you click it, a new page or place in the current page will open.\nHyperlinks, often referred to as just \"links,\" are common in Web pages, but can be found in other hypertext documents.  These include certain encyclopedias, glossaries, dictionaries, and other references that use hyperlinks.  The links act the same way as they do on the Web, allowing the user to jump from page to page.  Basically, hyperlinks allow people to browse information at hyperspeed."
        ]
    },
    {
        "word": "Hypermedia",
        "type": [],
        "definition": [
            "Most Web navigation is done by clicking text-based links that open new pages in a Web browser.  These links, which are often blue and underlined, are referred to as hypertext, since they allow the user to jump from page to page.  Hypermedia is an extension of hypertext that allows images, movies, and Flash animations to be linked to other content.\nThe most common type of hypermedia is an image link.  Photos or graphics on the Web are often linked to other pages.  For example, clicking a small \"thumbnail\" image may open a larger version of the picture in a new window.  Clicking a promotional graphic may direct you to an advertiser's website.  Flash animations and videos can also be turned into hyperlinks by embedding one or more links that appear during playback.\nYou can tell if an image or video is a hyperlink by moving the cursor over it.  If the cursor changes into a small hand, that means the image or video is linked to another page.  Clicking the text, image, or video will open up a new location in your Web browser.  Therefore, you should only click a hypertext or hypermedia link when you are ready to leave the current page.  If you want to open the link in a new window, you can usually right click the link and select \"Open Link in New Window.\""
        ]
    },
    {
        "word": "Hypertext",
        "type": [],
        "definition": [
            "Hypertext is text that links to other information.  By clicking on a link in a hypertext document, a user can quickly jump to different content.  Though hypertext is usually associated with Web pages, the technology has been around since the 1960s.  Software programs that include dictionaries and encyclopedias have long used hypertext in their definitions so that readers can quickly find out more about specific words or topics.  Apple Computer's HyperCard program also used hypertext, which allowed users to create multi-linked databases.  Today, the Web is where hypertext reigns, where nearly every page includes links to other pages and both text and images can be used as links to more content."
        ]
    },
    {
        "word": "Hypervisor",
        "type": [],
        "definition": [
            "A hypervisor is a software program that manages one or more virtual machines (VMs).  It is used to create, start, stop, and reset VMs.  The hypervisor allows each VM or \"guest\" to access the physical hardware, such as the CPU, RAM, and storage.  It can also limit how many system resources each VM can use so that multiple VMs can run simultaneously on a single system.\nThere are two primary types of hypervisors: native and hosted.\nType-1: Native\nA native or \"bare metal\" hypervisor runs directly on the hardware.  It sits between the hardware and one or more guest operating systems.  A native hypervisor loads even before the OS and interacts directly with the kernel.  This provides the highest possible performance since there is no primary operating system competing for the computer's resources.  However, it also means the computer may only be used to run virtual machines since the hypervisor is always running.  Examples of Type-1 hypervisors include VMware ESXi, Microsoft Hyper-V, and Apple Boot Camp.\nType-2: Hosted\nA hosted hypervisor is installed on a host computer, which already has an operating system installed.  It runs as an application like other software on the computer.  Most hosted hypervisors can manage and run multiple VMs at one time.  The advantage of a hosted hypervisor is that it can be open or quit as needed, freeing up resources for the host computer.  However, since it runs on top of an operating system, it may not offer the same performance as a native hypervisor.  Examples of Type-2 hypervisors include VMware Workstation, Oracle VirtualBox, and Parallels Desktop for Mac.\nGenerally, hosted hypervisors are more common for personal and small business use, while native hypervisors are used for enterprise applications and cloud computing."
        ]
    }
]