[
    {
        "word": "I\/O",
        "type": [],
        "definition": [
            "Stands for \"Input\/Output\" and is pronounced simply \"eye-oh.\"  Computers are based on the fundamental idea that every input results in an output.  For example, if you are running a word processor program and type a sentence on your keyboard, the text will appear on the screen.  The keyboard is an input device and the screen is an output device.  You might also print the text using a printer, which is another output device.  The computer's CPU handles all the I\/O operations, sending the data it receives to the correct path.  The path may be to the video card, to the hard drive, or to the RAM, just to name a few.\nThe ports on the outside of a computer are commonly referred to as \"I\/O ports\" because they are what connect input and output devices to the computer.  Software developers use I\/O to describe how a program will function, depending on what a user enters.  For example, if the user presses the space bar key in a game, say \"Super Jumper Man,\" the character on the screen will jump.  Multiply that by several thousand other scenarios of user input and you have yourself a computer game."
        ]
    },
    {
        "word": "I\/O Address",
        "type": [],
        "definition": [
            "Each I\/O device connected to your computer is mapped to a unique I\/O (Input\/Output) address.  These addresses are assigned to every I\/O port on your computer, including USB, Firewire, Ethernet, VGA, and DVI ports, as well as any other ports your computer might have.\nHaving a unique address assigned to each port allows your computer to easily recognize and locate devices attached to your computer.  Whether it is a keyboard, mouse, monitor, printer, or any other device, the computer can locate it by its I\/O address.  Because I\/O addresses are controlled by the computer's motherboard, they do not use up any system memory, or RAM."
        ]
    },
    {
        "word": "IBM Compatible",
        "type": [],
        "definition": [
            "The personal computer market in the early 1980's consisted primarily of Apple and IBM computers.  Apple's systems ran a proprietary operating system developed by Apple, while IBM machines primarily ran PC-DOS. As the demand for personal computers began to grow, IBM decided to license the DOS operating system to other manufacturers.  These companies began producing personal computers that were called PC clones or IBM compatibles.\nAs several other manufacturers began producing PCs, supplies grew and costs began to drop.  This enabled more people to afford PCs and sales of IBM compatibles began to dominate the personal computer market.  It wasn't long until the new manufacturers' PC sales surpassed the number of computers sold directly by IBM.  The Apple Macintosh also gained substantial market share when it was introduced in 1984, but the low cost and wide availability of IBM compatibles kept their sales strong.\nSales of IBM compatibles surged again in 1995, when Microsoft introduced the Windows 95 operating system.  However, by that time, the term \"IBM compatible\" had become almost irrelevant, since most PCs used Microsoft Windows as the primary operating system.  Also, PC manufacturers had been building their own computers for many years, and there were few similarities between IBM's own PCs and IBM compatibles.\nIn 2005, IBM stopped manufacturing personal computers.  The company that started the PC revolution is no longer in the market.  Therefore, the term \"IBM compatible\" is a bit outdated, though it can still be used to describe Windows-based computers.  The term \"PC\" is more appropriate, albeit a bit ambiguous, since Macs are technically PCs too.  Therefore, the term \"Windows computer\" seems to be the best way to describe a modern day IBM compatible."
        ]
    },
    {
        "word": "ICANN",
        "type": [],
        "definition": [
            "Stands for \"Internet Corporation For Assigned Names and Numbers.\"  The ICANN is an non-profit corporation that is responsible for allocating IP addresses and managing the domain name system.\nEvery computer connected to the Internet, from servers to home PCs, has an IP address.  However, it would be unrealistic for the ICANN to directly assign each computer an individual IP address.  Instead, the ICANN allocates blocks of IP addresses to companies, educational institutions, and Internet service providers.  These organizations then allocate IP addresses to computers that use their Internet connections.\nWhile the ICANN is a US-based organization, it is also a global Internet community.  According to ICANN's website, the organization is \"dedicated to preserving the operational stability of the Internet; to promoting competition; to achieving broad representation of global Internet communities; and to developing policy appropriate to its mission through bottom-up, consensus-based processes\" (icann.org)."
        ]
    },
    {
        "word": "ICCID",
        "type": [],
        "definition": [
            "Stands for \"Integrated Circuit Card Identifier.\"  An ICCID is a unique number assigned to a SIM card used in a mobile phone or another cellular device.  It provides a standard way to identify each mobile device connected to a cellular network.\nICCID Format\nAn ICCID is 19 or 20 digits long and contains individual sections of numbers, including a header, ID number, and check digit, calculated using a checksum.  The header is 6 or 7 digits long and includes the following information:\n\nMajor industry identifier (MMI) - the first two digits — always 89 for SIM cards\nCountry code (CC) - one to three digits — represents USA, England, Japan, etc.\nIssuer Identifier Number (IIN) - two to three digits — represents Verizon, AT&T, T-Mobile, etc.\n\nICCID vs IMEI\nBoth the ICCID and IMEI (International Mobile Equipment Identity) are unique IDs for mobile devices.  However, the IMEI is attached to the hardware while the ICCID is assigned to a removable SIM card.  Therefore a smartphone will always have the same IMEI, but the ICCID will change if the SIM card is replaced.\nCellular providers activate devices based on their ICCID rather than their IMEI.  Since each mobile account is linked to an ICCID, it is possible to use the same device on multiple networks by merely swapping out the SIM card."
        ]
    },
    {
        "word": "ICF",
        "type": [],
        "definition": [
            "Stands for \"Internet Connection Firewall.\"  ICF is a Windows XP feature that protects computers connected to the Internet from unauthorized access.  When ICF is enabled, Windows keeps a log of incoming requests from other systems on the Internet.  If the request is something the user has requested, like a Web page, the transmission will not be affected.  However, if the request is unsolicited and is not recognized by the system, the transmission will be dropped.  This helps prevent intrusion by hackers or malicious software such as spyware.\nWhile ICF limits incoming traffic from the Internet, it does not affect outgoing traffic.  This means data sent from your computer is still vulnerable to viruses or other disruptions even when ICF is enabled.  If you have multiple computers sharing the same Internet connection via ICS, you can enable ICF for all the computers.  However, you should enable ICF for the router or system connected directly to the Internet connection, not for each individual system."
        ]
    },
    {
        "word": "ICMP",
        "type": [],
        "definition": [
            "Stands for \"Internet Control Message Protocol.\"  When information is transferred over the Internet, computer systems send and receive data using the TCP\/IP protocol.  If there is a problem with the connection, error and status messages regarding the connection are sent using ICMP, which is part of the Internet protocol.\nWhen one computer connects to another system over the Internet (such as a home computer connecting to a Web server to view a website), it may seem like a quick and easy process.  While the connection may take place in a matter of seconds, there are often many separate connections that must happen in order for the computers to successfully communicate with each other.  In fact, if you were to trace all the steps of an Internet connection using a traceroute command, it might surprise you that Internet connections are successful as often as they are.  This is because for every \"hop\" along the way, the network must be functional and able to accept requests from your computer.\nIn cases where there is a problem with the connection, ICMP can send back codes to your system explaining why a connection failed.  These may be messages such as, \"Network unreachable\" for a system that is down, or \"Access denied\" for a secure, password-protected system.  ICMP may also provide routing suggestions to help bypass unresponsive systems.  While ICMP can send a variety of different messages, most are never seen by the user.  Even if you do receive an error message, the software you are using, such as a Web browser, has most likely already translated the message into simple (and hopefully less technical) language you can understand."
        ]
    },
    {
        "word": "ICQ",
        "type": [],
        "definition": [
            "ICQ is a popular online messaging program.  It is similar to instant messaging programs like AIM and Yahoo! Messenger, but allows users to enter chat rooms and chat with multiple users at one time.  Therefore, ICQ (which is short for \"I seek you\") is more of a community-oriented chat program than other messaging programs.\nSince the program was released in 1996, ICQ has gone through several major revisions.  It has evolved from a basic messaging program to a communications tool that allows users to interact in many different ways.  For example, ICQ now supports voice, video, and VoIP communications and can be used to send text messages to mobile phones via SMS.  Programs like ICQ2Go, the ICQ Toolbar, and ICQmail, have all been developed as additional tools for ICQ users.\nICQ remains community-oriented and offers several types of chat rooms, categorized by age, location, lifestyles, beliefs, and other classifications.  Users can join chat rooms using the ICQ software or via the Web interface at ICQ.com."
        ]
    },
    {
        "word": "ICS",
        "type": [],
        "definition": [
            "Stands for \"Internet Connection Sharing.\"  ICS allows multiple computers to connect to the Internet using the same Internet connection and IP address.  For example, several computers in a household can connect to same cable or DSL modem using a router.  As long as the router is connected to the modem, every computer connected to the router is also connected to the Internet.  Network address translation (NAT) allows the computers to share the same IP address.\nICS can also be done using software.  Windows 98 and later, as well as Mac OS X, support Internet connection sharing.  This allows one system's network settings to be modified, turning the computer into a gateway.  Other computers on the same network can then use that computer's Internet connection.  Windows users can also use programs such as WinGate and WinProxy to achieve the same result.  While it is possible to share an Internet connection using software, using hardware (such as a router) for ICS is the easiest and most hassle-free solution."
        ]
    },
    {
        "word": "ICT",
        "type": [],
        "definition": [
            "Stands for \"Information and Communication Technologies.\"  ICT refers to technologies that provide access to information through telecommunications.  It is similar to Information Technology (IT), but focuses primarily on communication technologies.  This includes the Internet, wireless networks, cell phones, and other communication mediums.\nIn the past few decades, information and communication technologies have provided society with a vast array of new communication capabilities.  For example, people can communicate in real-time with others in different countries using technologies such as instant messaging, voice over IP (VoIP), and video-conferencing.  Social networking websites like Facebook allow users from all over the world to remain in contact and communicate on a regular basis.\nModern information and communication technologies have created a \"global village,\" in which people can communicate with others across the world as if they were living next door.  For this reason, ICT is often studied in the context of how modern communication technologies affect society."
        ]
    },
    {
        "word": "IDE",
        "type": [],
        "definition": [
            "IDE stands for both \"Integrated Device Electronics\" and \"Integrated Development Environment.\"  The first is a hardware term, while the second is related to software programming.\n1. Integrated Device Electronics\nIDE was the most widely-used type of hard drive from the mid 1990s to the late 2000s.  The \"integrated\" aspect of the name describes how the controller is integrated into the drive itself.  IDE and ATA are often used synonymously since they both refer to the same type of hard drive.  However, ATA describes the interface while IDE describes the actual hard drive.\nThe first IDE standard (ATA-1) was released in 1994 and supported data transfer rates of 8.3 Mbps in DMA mode.  Enhanced IDE (ATA-2) was standardized in 1996 and supported data transfer rates up to 16.7 Mbps – twice the rate of the original standard.  The next several IDE standards were labeled using ATA versions (up to ATA-7), maxing out at 133 Mbps.  The IDE interface was eventually superseded by SATA, an even faster interface.\n2. Integrated Development Environment\nA software IDE is an application that developers use to create computer programs.  In this case, \"integrated\" refers to the way multiple development tools are combined into a single program.  For example, a typical IDE includes a source code editor, debugger, and compiler.  Most IDEs also provide a project interface that allows programmers to keep track of all files related to a project.  Many support version control as well.\nSome IDEs provide a runtime environment (RTE) for testing software programs.  When a program is run within the RTE, the developer can track each event that takes place within the application being tested.  This can be useful for finding and fixing bugs and locating the source of memory leaks.  Because IDEs provide a centralized user interface for writing code and testing programs, a programmer can make a quick change, recompile the program, and run the program again.  Programming is still hard work, but IDE software helps streamline the development process."
        ]
    },
    {
        "word": "IDS",
        "type": [],
        "definition": [
            "Stands for \"Intrusion Detection System.\"  An IDS monitors network traffic for suspicious activity.  It may be comprised of hardware, software, or a combination of the two.  IDSes are similar to firewalls, but are designed to monitor traffic that has entered a network, rather than preventing access to a network entirely.  This allows IDSes to detect attacks that originate from within a network.\nAn intruder detection systems can be configured for either a network or a specific device.  A network intrusion detection system (NIDS) monitors inbound and outbound traffic, as well as data transfers between systems within a network.  NIDSes are often spread out across several different points in a network to make sure there a no loopholes where traffic may be unmonitored.\nAn IDS configured for a single device is called a host intrusion detection system, or HIDS.  It monitors a single host for abnormal traffic patterns.  For example, it may look for known viruses or malware in both inbound and outbound traffic.  Some HIDSes even check packets for important system files to make sure they are not modified or deleted.\nBoth network and host IDSes are designed to detect intrusions and sound an alert.  This alert may be sent to a network administrator or may be processed by an automated system.  A system that automatically handles intrusion alerts is called a reactive IDS or an intrusion prevention system (IPS)."
        ]
    },
    {
        "word": "IEEE",
        "type": [],
        "definition": [
            "Stands for the \"Institute of Electrical and Electronics Engineers\" and is produced \"I triple E.\"  The IEEE is a professional association that develops, defines, and reviews electronics and computer science standards.  Its mission is \"to foster technological innovation and excellence for the benefit of humanity.\"\nThe history of the IEEE dates back to the 1800s when electricity started to influence society.  In 1884, the AIEE (American Institute of Electrical Engineers) was formed to support electrical innovation.  In 1912, the IRE (Institute of Radio Engineers) was created to develop wireless telegraphy standards.  In 1963, the two organizations merged to become a single entity – the IEEE.  Since then, the organization has established thousands of standards for consumer electronics, computers, and telecommunications.\nWhile the Institute of Electrical and Electronics Engineers is based in the United States, IEEE standards often become international standards.  Below are a few examples of technologies standardized by the IEEE.\n\nIEEE 1284 (Parallel Port) – an I\/O interface used by early desktop PCs\nIEEE 1394 (Firewire) – a high-speed interface designed for external hard drives, digital video cameras, and other A\/V peripherals\nIEEE 802.11 (Wi-Fi) – a series of Wi-Fi standards used for wireless networking\nIEEE 802.16 (WiMAX) – a wireless communications standard for transferring cellular data\n\nThe IEEE provides a wide range of membership options for individuals, groups, and corporations.  IEEE knowledge groups, which are communities driven by members and volunteers, help individuals grow in their knowledge about various topics.  Members can also contribute ideas and feedback to help the IEEE draft and establish new technical standards."
        ]
    },
    {
        "word": "IGP",
        "type": [],
        "definition": [
            "Stands for \"Integrated Graphics Processor.\"  An IGP is a graphics chip that is integrated into a computer's motherboard.  The IGP serves the same purpose as a video card, which is to process the graphics displayed on the computer.\nIntegrated graphics processors take the graphics portion of the processing load off the main CPU.  However, because IGPs are soldered onto the motherboard, their size is limited and they cannot use a dedicated fan to cool them, like some video cards do.  For this reason, IGPs typically do not have the same performance as video cards, which may be attached to the computer's PCI or AGP slots.  Because integrated graphics processors cannot be removed, they also cannot be upgraded like video cards can.  However, because of their small size, IGPs are a good solution for laptop computers and entry-level desktop PCs."
        ]
    },
    {
        "word": "IIS",
        "type": [],
        "definition": [
            "Stands for \"Internet Information Services.\"  IIS is a web server software package designed for Windows Server.  It is used for hosting websites and other content on the Web.\nMicrosoft’s Internet Information Services provides a graphical user interface (GUI) for managing websites and the associated users.  It provides a visual means of creating, configuring, and publishing sites on the web.  The IIS Manager tool allows web administrators to modify website options, such as default pages, error pages, logging settings, security settings, and performance optimizations.\nIIS can serve both standard HTML webpages and dynamic webpages, such as ASP.NET applications and PHP pages.  When a visitor accesses a page on a static website, IIS simply sends the HTML and associated images to the user’s browser.  When a page on a dynamic website is accessed, IIS runs any applications and processes any scripts contained in the page, then sends the resulting data to the user’s browser.\nWhile IIS includes all the features necessary to host a website, it also supports extensions (or “modules”) that add extra functionality to the server.  For example, the WinCache Extension enables PHP scripts to run faster by caching PHP processes.  The URL Rewrite module allows webmasters to publish pages with friendly URLs that are easier for visitors to type and remember.  A streaming extension can be installed to provide streaming media to website visitors.\nIIS is a popular option for commercial websites, since it offers many advanced features and is supported by Microsoft.  However, it also requires requires a commercial license and the pricing increases depending on the number of users.  Therefore, Apache HTTP Server, which is open source and free for unlimited users, remains the most popular web server software."
        ]
    },
    {
        "word": "IM",
        "type": [],
        "definition": [
            "Stands for \"Instant Message.\"  Instant messaging, or \"IMing,\" as frequent users call it, has become a popular way to communicate over the Internet.  Two people with the same IM client software can type messages back in forth in a private online chat session.  IM software allows users to build a list of friends, or \"buddies\" and displays what other users are online.  After seeing who is online, the user can open up chat sessions with as many other people as he or she wants.  While I find it difficult to focus on one conversation at a time, apparently some teenage girls that can keep more than ten conversations going at once.\nInstant messaging can be a much more efficient way to communicate with others than sending multiple e-mails back and forth.  For this reason, IMing has become a useful tool among friends and co-workers.  Some people even find it more convenient to IM their friends than to talk on the phone, which I do not understand."
        ]
    },
    {
        "word": "IMAP",
        "type": [],
        "definition": [
            "Stands for \"Internet Message Access Protocol\" and is pronounced \"eye-map.\"  It is a method of accessing e-mail messages on a server without having to download them to your local hard drive.  This is the main difference between IMAP and another popular e-mail protocol called \"POP3.\"  POP3 requires users to download messages to their hard drive before reading them.  The advantage of using an IMAP mail server is that users can check their mail from multiple computers and always see the same messages.  This is because the messages stay on the server until the user chooses to download them to his or her local drive.  Most webmail systems are IMAP based, which allows people to access to both their sent and received messages no matter what computer they use to check their mail.\nMost e-mail client programs such as Microsoft Outlook and Mac OS X Mail allow you to specify what kind of protocol your mail server uses.  If you use your ISP's mail service, you should check with them to find out if their mail server uses IMAP or POP3 mail.  If you enter the wrong protocol setting, your e-mail program will not be able to send or receive mail."
        ]
    },
    {
        "word": "IMEI",
        "type": [],
        "definition": [
            "Stands for \"International Mobile Equipment Identity.\"  Every mobile device that connects to a cellular network has a unique IMEI number.  This includes cell phones, smartphones, cellular-enabled tablets and smartwatches, and other devices that support cellular data.\nThe IMEI number uniquely identifies a mobile device.  It is separate from the SIM card or UICC number which is linked to a removable card in the device.  This means the IMEI can be used to track or locate a specific device, regardless of what card is installed in it.  For example, if your phone is stolen and the SIM card is swapped out, your mobile provider can still block access from the stolen phone using the IMEI.\nDifference Between the IMEI and Serial Number\nAn IMEI is similar to a serial number since it is a unique number linked to a hardware device.  While serial numbers are generated by the manufacturer, IMEI numbers are produced by the GSMA (Groupe Spéciale Mobile Association), an international organization that oversees mobile network operators.  The GSMA provides each mobile device manufacturer with a range of numbers to use for IMEIs on devices they produce.\nManufacturers can choose their own convention for serial numbers, including the length and type of characters (numeric or alphanumeric).  IMEI numbers are always 15 digits long, comprised of a 14-digit unique number followed by a \"check digit\" (or a checksum), which validates the number.  A variation of the IMEI, called the IMEISV (IMEI Software Version), includes the 14-digit number plus two digits for the version of the device's software.  The IMEISV may change after a software update.\nNOTE: Most smartphones allow you to view your device's IMEI in the \"About\" section of the device settings.  Another way to view the IMEI is to press *#06# on the numeric keypad."
        ]
    },
    {
        "word": "IOPS",
        "type": [],
        "definition": [
            "Stands for \"Input\/Output Operations Per Second.\"  IOPS is a metric used to measure to performance of a storage device or storage network.  The IOPS value indicates how many different input or output operations a device or group of devices can perform in one second.  It may be used along with other metrics, such as latency and throughput, to measure overall performance.\nAn IOPS value is typically synonymous with \"total IOPS,\" which includes a mix of read and write operations.  However, it is also possible to measure more specific values, such as sequential read IOPS, sequential write IOPS, random read IOPS, and random write IOPS.  Higher values mean a device is capable of handling more operations per second.  For example, a high sequential write IOPS value would be helpful when copying a large number of files from another drive.\nSSDs have significantly higher IOPS valued than HDDs. Since SSDs do not have a physical drive head that moves around the drive, they can perform over 1,000 times more read\/write operations per second than a typical hard drive.  For example, a hard drive that spins at 7200 RPM may have a total IOPS value of 90.  A modern SSD may have an IOPS value above 100,000.  Some high-end flash drives have IOPS measurements above one million.\nWhile IOPS was important when measuring hard drive performance, most real-world situations do not require more than a thousand inputs\/outputs per second.  Therefore, IOPS is rarely viewed as an important metric in SSD performance.  Latency and throughput are the primary factors that affect SSD speed, while storage capacity and durability (lifespan) are also important to consider."
        ]
    },
    {
        "word": "IP",
        "type": [],
        "definition": [
            "Stands for \"Internet Protocol.\"  IP provides a standard set of rules for sending and receiving data over the Internet.  It allows devices running on different platforms to communicate with each other as long as they are connected to the Internet.\nIn order for an Internet-connected host to be recognized by other devices, it must have an IP address.  This may be either an IPv4 or IPv6 address, but either way, it uniquely defines a device on the Internet.\nThe Internet Protocol also provides basic instructions for transferring packets between devices.  However, it does not actually establish the connection or define the ordering of the packets transmitted.  These aspects are handled by the Transmission Control Protocol, which works in conjunction with the Internet Protocol to transfer data between systems on the Internet.  For this reason, connections between Internet-connected systems are often called \"TCP\/IP\" connections.\nNOTE: IP may also be short for \"IP address,\" as in \"What is your IP?\"  In this case, IP refers to the unique identifier of a system, not the protocol itself."
        ]
    },
    {
        "word": "IP Address",
        "type": [],
        "definition": [
            "An IP address, or simply an \"IP,\" is a unique address that identifies a device on the Internet or a local network.  It allows a system to be recognized by other systems connected via the Internet protocol.  There are two primary types of IP address formats used today — IPv4 and IPv6.\nIPv4\nAn IPv4 address consists of four sets of numbers from 0 to 255, separated by three dots.  For example, the IP address of TechTerms.com is 67.43.14.98.  This number is used to identify the TechTerms website on the Internet.  When you visit http:\/\/techterms.com in your web browser, the DNS system automatically translates the domain name \"techterms.com\" to the IP address \"67.43.14.98.\"\nThere are three classes of IPv4 address sets that can be registered through the InterNIC.  The smallest is Class C, which consists of 256 IP addresses (e.g., 123.123.123.xxx — where xxx is 0 to 255).  The next largest is Class B, which contains 65,536 IP addresses (e.g. 123.123.xxx.xxx).  The largest block is Class A, which contains 16,777,216 IP addresses (e.g. 123.xxx.xxx.xxx).\nThe total number of IPv4 addresses ranges from 000.000.000.000 to 255.255.255.255.  Because 256 = 28, there are 28 x 4 or 4,294,967,296 possible IP addresses.  While this may seem like a large number, it is no longer enough to cover all the devices connected to the Internet around the world.  Therefore, many devices now use IPv6 addresses.\nIPv6\nThe IPv6 address format is much different than the IPv4 format.  It contains eight sets of four hexadecimal digits and uses colons to separate each block.  An example of an IPv6 address is: 2602:0445:0000:0000:a93e:5ca7:81e2:5f9d.   There are 3.4 x 1038 or 340 undecillion) possible IPv6 addresses, meaning we shouldn't run out of IPv6 addresses anytime soon."
        ]
    },
    {
        "word": "IPC",
        "type": [],
        "definition": [
            "Stands for \"Interprocess Communication.\"  IPC is a feature of modern operating systems that enables processes to communicate with each other.  It improves performance by allowing concurrent processes to share system resources efficiently.\nThe two primary methods of interprocess communication are memory sharing and message passing.  Memory sharing involves indirect communication since the OS manages RAM usage and allocation.  Message passing requires active communication between processes.  For example, one process may request exclusive access to a specific resource, such as a file, from another process.  Message passing is an effective way to ensure two applications do not access the same block of data at the same time.\nWhen actively passing messages between processes, it is important to avoid deadlocks and race conditions.  A deadlock may cause a process to become unresponsive, while a race condition may produce errors and unexpected results.\nIPC Examples\nBelow are some common ways operating systems use interprocess communication:\n\nFile access - limiting access to files on a local or remote storage device to one process at a time\nNetwork communication - ensuring data sent through a network socket does not overlap\nShared memory - allowing mulitple processes to use the same block of memory, often through the use of a buffer that dynamically allocates free memory\nSignals - sending system messages to processes to notify them of an event, similar to an interrupt\n"
        ]
    },
    {
        "word": "IPS",
        "type": [],
        "definition": [
            "Stands for \"Intrusion Prevention System.\"  An IPS is a network security system designed to prevent malicious activity within a network.  It is often used in combination with a network detection system (IDS) and may also be called an intrusion detection and prevention system (IDPS).\nLike an IDS, an IPS may include hardware, software, or both.  It may also be configured for a network or a single system.  However, unlike IDSes, intrusion prevention systems are designed to prevent malicious activity, rather than simply detecting it.\nWhen an IDS detects suspicious activity, such as numerous failed login attempts, it may log the IP address.  If it detects a suspicious data transfer, it may check the packets against a database of known viruses to see if any any malicious code is being transferred.  When an intrusion detected, an IDS compares the activity to a set of rules designed to prevent malicious activities from taking place.  For example, when an IDS detects numerous failed logins, it may block the IP address from accessing any network devices.  If it detects a virus, the data may be quarantined or deleted before it reaches its destination.\nExamples of hardware-based IPSes include Cisco's IPS 4500 Series, IBM's Security Network \"GX\" systems, and HP's TippingPoint \"NX\" devices.  Software IPS solutions include Check Point's IPS Software Blade and McAfee's Host Intrusion for Desktop."
        ]
    },
    {
        "word": "IPX",
        "type": [],
        "definition": [
            "Stands for \"Internetwork Packet Exchange.\"  IPX is a networking protocol originally used by the Novell NetWare operating system and later adopted by Windows.  IPX was introduced in the 1980s and remained popular through the 1990s.  Since then, it has largely been replaced by the standard TCP\/IP protocol.\nIPX is the network layer of the IPX\/SPX protocol and SPX is the transport layer.  IPX has a similar function to the IP protocol and defines how data is sent and received between systems.  The SPX protocol is used to establish and maintain a connection between devices.  Together, the two protocols can be used to create a network connection and transfer data between systems.\nIPX is connectionless, meaning it does not require a consistent connection to be maintained while packets are being sent from one system to another.  It can resume the transfer where it left off when a connection is temporarily dropped.  IPX only loads when a network connection is attempted, so it does not take up unnecessary resources.\nNOTE: In the 1990s, popular video games like Quake, Descent, and WarCraft 2 supported IPX for network gaming.  A service like Kali could be used to emulate an IPX connection over the Internet, enabling Internet gaming.  Now most video games use TCP\/IP or their own proprietary protocols to enable gamers to play online."
        ]
    },
    {
        "word": "IPv4",
        "type": [],
        "definition": [
            "IPv4 is the most widely used version of the Internet Protocol.  It defines IP addresses in a 32-bit format, which looks like 123.123.123.123.  Each three-digit section can include a number from 0 to 255, which means the total number of IPv4 addresses available is 4,294,967,296 (256 x 256 x 256 x 256 or 2^32).\nEach computer or device connected to the Internet must have a unique IP address in order to communicate with other systems on the Internet.  Because the number of systems connected to the Internet is quickly approaching the number of available IP addresses, IPv4 addresses are predicted to run out soon.  When you consider that there are over 6 billion people in the world and many people have more than one system connected to the Internet (for example, at home, school, work, etc.), it is not surprising that roughly 4.3 billion addresses is not enough.\nTo solve this problem, a new 128-bit IP system, called IPv6, has been developed and is in the process of replacing the current IPv4 system.  During this transitional process from IPv4 to IPv6, systems connected to the Internet may be assigned both an IPv4 and IPv6 address."
        ]
    },
    {
        "word": "IPv6",
        "type": [],
        "definition": [
            "Every computer system and device connected to the Internet is located by an IP address.  The current system of distributing IP addresses is called IPv4.  This system assigns each computer a 32-bit numeric address, such as 120.121.123.124.  However, with the growth of computers connected to the Internet, the number of available IP addresses are predicted to run out in only a few years.  This is why IPv6 was introduced.\nIPv6, also called IPng (or IP Next Generation), is the next planned version of the IP address system.  (IPv5 was an experimental version used primarily for streaming data.)  While IPv4 uses 32-bit addresses, IPv6 uses 128-bit addresses, which increases the number of possible addresses by an exponential amount.  For example, IPv4 allows 4,294,967,296 addresses to be used (2^32).  IPv6 allows for over 340,000,000,000,000,000,000,000,000,000,000,000,000 IP addresses.  That should be enough to last awhile.\nBecause IPv6 allows for substantially more IP addresses than IPv4, the addresses themselves are more complex.  They are typically written in this format:\nhhhh:hhhh:hhhh:hhhh:hhhh:hhhh:hhhh:hhhh\nEach \"hhhh\" section consists of a four-digit hexadecimal number, which means each digit can be from 0 to 9 and from A to F.  An example IPv6 address may look like this:\nF704:0000:0000:0000:3458:79A2:D08B:4320\nBecause IPv6 addresses are so complex, the new system also adds extra security to computers connected to the Internet.  Since there are so may IP address possibilities, it is nearly impossible to guess the IP address of another computer.  While most computer systems today support IPv6, the new Internet procotol has yet to be fully implemented.  During this transitional process, computers are often assigned both an IPv4 and an IPv6 address.  By 2008, the U.S. government has mandated that all government systems use IPv6 addresses, which should help move the transition along."
        ]
    },
    {
        "word": "IRC",
        "type": [],
        "definition": [
            "Stands for \"Internet Relay Chat.\"  IRC is a service that allows people to chat with each other online.  It operates on a client\/server model where individuals use a client program to connect to an IRC server.  Popular IRC clients include mIRC for Windows and Textual for OS X.  Several web-based clients are also available, including KiwiIRC and Mibbit.\nIn order to join an IRC conversation, you must choose a username and a channel.  Your username, also called a handle, can be whatever you want.  It may include letters and numbers, but not spaces.  A channel is a specific chat group within an IRC network where users can talk to each other.  Some networks publish lists of available channels, while others require you to manually enter channel names in order to join them.  Channels always begin with a hashtag followed by a name that represents their intended chat topic, such as \"#teenchat,\" \"#politics,\" or \"#sports\".  Some IRC channels require a password while others are open to the public.\nWhen you join a channel, the chat window will begin displaying messages people are typing.  You can join the conversation by typing your own messages.  While channel members can type whatever they want, popular channels are often moderated.  That means human operators or automated bots may kick people out of the channel and even ban users who post offensive remarks or spam the channel with repeated messages.\nWhile IRC was designed as a public chat service, it supports other features such as private messaging and file transfers.  For example, you can use an IRC command (which typically begins with a forward slash \"\/\") to request a private chat session with another user.  Then you can use another IRC command to send the user a file from your local system.\nNOTE: IRC was a popular way for users to connect online before social media became prevalent in the early 2000s.  Today, many people still use IRC, but social media sites and apps are much more popular."
        ]
    },
    {
        "word": "IRQ",
        "type": [],
        "definition": [
            "Stands for \"Interrupt Request.\"  PCs use interrupt requests to manage various hardware operations.  Devices such as sound cards, modems, and keyboards can all send interrupt requests to the processor.  For example, when the modem needs to run a process, it sends an interrupt request to the CPU saying, \"Hey, hold up, let me do my thing!\"  The CPU then interrupts its current job to let the modem run its process.\nIt is important to assign different IRQ addresses to different hardware devices is because the interrupt request signals run along single IRQ lines to a controller.  This interrupt controller assigns priorities to incoming IRQs and sends them to the CPU.  It's kind of like taking a number at the local deli, except the hardware usually only has to wait a couple of nanoseconds instead of like twenty minutes.  Since the interrupt controller can control only one device per IRQ line, if you assign the same IRQ address to multiple devices, you are likely to get an IRQ conflict.  This can cause a range of errors from not allowing network connections to crashing your computer. So make sure you assign unique IRQs to new hardware you install and avoid the frustration and keyboard throwing that conflicts can cause."
        ]
    },
    {
        "word": "ISA",
        "type": [],
        "definition": [
            "Stands for \"Industry Standard Architecture.\" ISA is a type of bus used in PCs for adding expansion cards.  For example, an ISA slot may be used to add a video card, a network card, or an extra serial port.  The original 8-bit version of PCI uses a 62 pin connection and supports clock speeds of 8 and 33 MHz.  16-bit PCI uses 98 pins and supports the same clock speeds.\nThe original 8-bit version of ISA was introduced in 1981 but the technology did not become widely used until 1984, when the 16-bit version was released.  Two competing technologies -- MCA and VLB -- were also used by some manufacturers, but ISA remained the most common expansion bus for most of the 1980s and 1990s.  However, by the end of the twentieth century, ISA ports were beginning to be replaced by faster PCI and AGP slots.  Today, most computers only support PCI and AGP expansion cards."
        ]
    },
    {
        "word": "ISDN",
        "type": [],
        "definition": [
            "Stands for \"Integrated Services Digital Network.\"  ISDN is a telecommunications technology that enables the transmission of digital data over standard phone lines.  It can be used for voice calls as well as data transfers.\nThe first ISDN standard was defined in 1988 by the CCITT organization, which is now the ITU-T (International Telegraph and Telephone Consultative Committee).  However, it wasn't until the 1990s that the service became widely used.  Since the introduction of ISDN, several variants have been standardized, including the following:\n\nBasic Rate Interface (BRI) - supports two 64 kbps bearer channels (or B channels) for a data transfer rate of 128 kbps.\nPrimary Rate Interface (PRI) - supports 30 B channels and two additional channels in a single E1 connection, providing a data transfer rate of 2,048 kbps.\nAlways on Dynamic ISDN (AODI) - an consistent ISDN connection that uses the X.25 protocol and supports speeds up to 2 Mbps.\n\nISDN was a common high-end Internet service in the 1990s and early 2000s and was offered by many ISPs as faster alternative to dial-up Internet access.  Many businesses and organizations used ISDN service for both Internet access and network connections between locations.  In the mid-2000s, DSL and cable serviced began to replace ISDN connections because of their faster speed and lower cost.  Today, ISDN is still used in some network connections, but it is rarely used for Internet access."
        ]
    },
    {
        "word": "ISO",
        "type": [],
        "definition": [
            "Stands for \"International Organization for Standardization.\"  Yes, technically the acronym should be \"IOFS,\" but I guess ISO sounds better.  The ISO works with standards institutes from over 150 countries to develop technology and product standards.  These standards lead to a more efficient, safer, and cleaner development of products.  It also leads to more standardized products for consumers.\nThe ISO is important to the computer industry, since the organization standardizes many of the technologies used by your computer hardware and software.  For example, the ISO 9660 standard defines a file system used by CD-ROM media.  CDs formatted using this standard can be used on any operating system that supports the ISO 9660 standard, including Windows, Mac, and Unix systems.\nThe ISO is similar to the IEEE, but performs a much broader range of standardizations.  To learn more about the International Organization for Standardization, visit the ISO website."
        ]
    },
    {
        "word": "ISP",
        "type": [],
        "definition": [
            "Stands for \"Internet Service Provider.\"  An ISP provides access to the Internet.  Whether you're at home or work, each time you connect to the Internet, your connection is routed through an ISP.\nEarly ISPs provided Internet access through dial-up modems.  This type of connection took place over regular phone lines and was limited to 56 Kbps.  In the late 1990s, ISPs began offering faster broadband Internet access via DSL and cable modems.  Some ISPs now offer high-speed fiber connections, which provide Internet access through fiber optic cables.  Companies like Comcast and Cox provide cable connections, while companies like AT&T and Verizon provide DSL Internet access.\nTo connect to an ISP, you need a modem and an active account.  When you connect a modem to the telephone or cable outlet in your house, it communicates with your ISP.  The ISP verifies your account and assigns your modem an IP address.  Once you have an IP address, you are connected to the Internet.  You can use a router (which may be a separate device or built into the modem) to connect multiple devices to the Internet.  Since each device is routed through the same modem, they will all share the same public IP address assigned by the ISP.\nISPs act as hubs on the Internet since they are often connected directly to the Internet backbone.  Because of the large amount of traffic ISPs handle, they require high bandwidth connections to the Internet.  In order to offer faster speeds to customers, ISPs must add more bandwidth to their backbone connection in order to prevent bottlenecks.  This can be done by upgrading existing lines or adding new ones."
        ]
    },
    {
        "word": "ISR",
        "type": [],
        "definition": [
            "Stands for \"Interrupt Service Routine.\"  An ISR (also called an interrupt handler) is a software process invoked by an interrupt request from a hardware device.  It handles the request and sends it to the CPU, interrupting the active process.  When the ISR is complete, the process is resumed.\nA basic example of an ISR is a routine that handles keyboard events, such as pressing or releasing a key.  Each time a key is pressed, the ISR processes the input.  For example, if you press and hold the right arrow key in a text file, the ISR will signal to the CPU that the right arrow key is depressed.  The CPU sends this information to the active word processor or text editing program, which will move the cursor to the right.  When you let go of the key, the ISR handles the \"key up\" event.  This interrupts the previous \"key down\" state, which signals to the program to stop moving the cursor.\nSimilar to Newton's law of inertia (an object in motion tends to stay in motion), computer processes continue to run unless interrupted.  Without an interrupt request, a computer will remain in its current state.  Each input signal causes an interrupt, forcing the CPU to process the corresponding event.\nMany types of hardware devices, including internal components and external peripherals can sent interrupts to the CPU.  Examples include keyboards, mice, sound cards, and hard drives.  A device driver enables communication between each of these devices and the CPU.  ISRs prioritize interrupt requests based on the IRQ setting of the device (or port).  Typically the keyboard is at the top of the IRQ list, while devices like hard drives are further down."
        ]
    },
    {
        "word": "IT",
        "type": [],
        "definition": [
            "Stands for \"Information Technology,\" and is pronounced \"I.T.\"  It refers to anything related to computing technology, such as networking, hardware, software, the Internet, or the people that work with these technologies.  Many companies now have IT departments for managing the computers, networks, and other technical areas of their businesses.  IT jobs include computer programming, network administration, computer engineering, Web development, technical support, and many other related occupations.  Since we live in the \"information age,\" information technology has become a part of our everyday lives.  That means the term \"IT,\" already highly overused, is here to stay."
        ]
    },
    {
        "word": "ITIL",
        "type": [],
        "definition": [
            "Stands for \"Information Technology Infrastructure Library.\"  ITIL is a set of recommended procedures and guidelines organizations should follow when using or delivering information technology (IT) services.  It provides an organized approach to managing IT services, which is designed to benefit both companies and clients.\nThe five primary stages of the ITIL service lifecycle are listed below.\n\nService strategy - the planning stage of creating or using a new IT service.  Examples include building a wireless campus network or a implementing an intranet for members of an organization. This step involves defining the purpose and goals of the service.\nService design - the design stage of the service, which may also include the initial implementation.  The service must be designed to meet the needs of the end users and be sustainable for the expected duration of the service.  Choosing the appropriate technologies is one of the most important aspects of the design stage.  Typically scalable solutions are preferred so they can grow with the organization.\nService transition - the stage that focuses on transitioning between IT services and IT personnel.  This includes the initial transition of rolling out the new service as well moving to other solutions in the future.  It also involves creating a plan for who will manage the services if the technologies or personnel change.\nService operation - the stage that covers the actual management and operation of the service once it is live.  This includes monitoring and maintaining the service as well as developing a plan for fixing issues as they arise.  The goal is to provide a reliable service with limited downtime throughout the life of the service.\nContinual service improvement (CSI) - a plan to continually update and improve the service as needed.  In the IT world, the needs of businesses and clients are constantly changing.  Therefore a successful service must be flexible and upgradable, adapting to these changing needs.  A plan to regularly update the service can help meet this goal.\n\nBusinesses and organizations are not required to follow the practices outlined by ITIL.  However, the recommendations can be helpful to any organization looking to offer or implement an IT-related service.  AXELOS, which maintains the ITIL best practices, provides ITIL certifications to individuals who have developed a comprehensive understanding of ITIL."
        ]
    },
    {
        "word": "IVR",
        "type": [],
        "definition": [
            "Stands for \"Interactive Voice Response.\"  IVR is a telephony technology that can read a combination of touch tone and voice input.  It gives users the ability to access a database of information via phone.  A typical IVR system has several menus of prerecorded options that the caller can choose from.  While many choices are as basic as choosing a number, some options may require the caller to speak detailed information such as his name or account number.  This input is read by the IVR system and is used to access the appropriate information in the database.\nFor example, a bank may have an IVR system that allows members to call in and check their balance or recent transactions.  Credit card companies and stock brokerage firms also use IVR systems to allow users to access information from their account.  The technology can also be used for other purposes such as phone surveys, checking movie times, and call center forwarding.  Because the caller can vocally respond to prerecorded messages, using an IVR system is almost like talking to another human being.  That is, as long as it understands you."
        ]
    },
    {
        "word": "Icon",
        "type": [],
        "definition": [
            "Ever since the Macintosh was introduced in 1984, icons have been the way we view files on computers.  An icon on your computer screen represents an object or a program on your hard drive.  For example, the folders you see on your desktop or in open windows are icons.  The files that you see in those folders are also icons.  The trash can on the Macintosh and the recycle bin on Windows are both icons as well.\nIcons are a visual representation of something on your computer.  For example, a blue \"e\" on your screen most likely repersents the Internet Explorer program.  An icon that looks like a sheet of paper is probably a text document.  By clicking and dragging icons, you can move the actual files they represent to various locations on your computer's hard drive.  By double-clicking an application icon, you can open the program.  Icons are one of the fundamental features of the graphical user interface (GUI).  They make computing much more user-friendly than having to enter text commands to accomplish anything.  Some Unix nerds would beg to differ, but I'm talking about normal people here."
        ]
    },
    {
        "word": "Iframe",
        "type": [],
        "definition": [
            "An iframe (short for inline frame) is an HTML element that allows an external webpage to be embedded in an HTML document.  Unlike traditional frames, which were used to create the structure of a webpage, iframes can be inserted anywhere within a webpage layout.\nAn iframe can be inserted into an HTML document using the iframe tag, as shown in the example below:\n&lt;iframe src=\"http:\/\/sharpened.com\/example.php\" width=\"728\" height=\"90\"&gt;&lt;\/iframe&gt;\nThe code above would insert the contents of the URL into a 728 x 90 px inline frame within the webpage.  The iframe source (src) can reference an external website or another page on the same server, such as src=\"\/example.php\".  The width and height attributes are not required, but are commonly used to define the size of the iframe.  Other iframe attributes, such as marginwidth and marginheight are supported in HTML 4 and earlier, but in HTML5, CSS is used to customize the appearance of an iframe.\nIframes are used for several different purposes, such as online advertising and multimedia.  Many ad platforms use iframes to display ads on webpages since they provide more flexibility than an inline script.  Since iframes may contain an entire webpage, advertisers can include extra tracking code within an iframe that helps ensure accurate reporting for both the advertiser and publisher.\nIframes are also used for displaying different types of media within a webpage.  For example, YouTube videos and Google Maps windows are often embedded in webpages using iframes.  Many web applications use iframes since they can display dynamic content without reloading the webpage."
        ]
    },
    {
        "word": "Illegal Operation",
        "type": [],
        "definition": [
            "When a program on your computer has an error, you may see a message pop up on the screen saying, \"Illegal Operation.\"  This is a rather tactless way of saying something went wrong with the program that was running.  It could also be a fault with the operating system itself.  The problem with the phrase \"Illegal Operation\" is that it seems to put the blame on you, the user.  The fact is, the error was most likely caused by a bug in the program, and is certainly not your fault.\nCommon errors that produce illegal operation messages are divide by zero errors (no number is divisible by zero), and memory leaks where the program tries to address memory in another program's memory space.  If these errors happen while a program is running, the execution comes to an abrupt halt and the program usually quits.  Illegal operations can happen on both Windows and Macintosh computers, though the Mac OS X operating system is better at avoiding system-level errors."
        ]
    },
    {
        "word": "Image Scaling",
        "type": [],
        "definition": [
            "Image scaling is the process of resizing a digital image.  Scaling down an image makes it smaller while scaling up an image makes it larger.  Both raster graphics and vector graphics can be scaled, but they produce different results.\nRaster Image Scaling\nA raster graphic is a bitmap image comprised of individual pixels.  Examples include JPEG and PNG files.  The process of scaling raster graphics is also called \"resampling,\" in which pixels are mapped to a new grid, which may be smaller or larger than the original matrix.\nScaling down a raster graphic may cause a slight decrease in image quality since the pixels are squeezed into a smaller grid.  Colors must be blended and edges are often smoothed out using a process called anti-aliasing.  A good image scaling algorithm or \"scaler\" will keep most of the image detail when scaling down an image.  The further an image is scaled down, the less detail can be maintained.\nScaling up a raster graphic also decreases the image quality.  Generally, increasing the size of a digital image will cause it to look blurry.  The larger the image is scaled, the fuzzier it will appear.  Anti-aliasing can be used to smooth out the edges, but a scaled-up image will not look as clear as the original image.\nVector Image Scaling\nVector graphics, such as an .SVG or .AI file, are comprised of points and lines, also called paths.  These paths can be scaled up or down with no loss of quality.  Instead of mapping pixels to another grid, vector image scaling simply moves the points within the image.\nSince vector graphics are not defined by pixels, they appear sharp at both small and large sizes.  For this reason, company logos and application icons are often designed as vector graphics.  When published in a software application or website, the images can be scaled to a specific size and then saved as a raster graphic.\nNOTE: \"Video Upscaling\" is the process of scaling video for a higher-resolution display.  The goal is to make a lower-resolution video look sharp at a higher resolution.  For example, an HD video might be upscaled to 4K.  A good upscaling algorithm will keep as much detail as possible at the higher resolution, but cannot make the video look as sharp as a video originally recorded in 4K."
        ]
    },
    {
        "word": "Impact Printer",
        "type": [],
        "definition": [
            "An impact printer is a type of printer that operates by striking a metal or plastic head against an ink ribbon.  The ink ribbon is pressed against the paper, marking the page with the appropriate character, dot, line, or symbol.  Common examples of impact printers include dot matrix, daisy-wheel printers, and ball printers.\nDot matrix printers work by striking a grid of pins against a ribbon. Different characters are printed by using different pin combinations.  Daisy-wheel printers use a circular wheel with \"petals\" that each have a different character or symbol on the end.  In order to print each character, the wheel spins to the appropriate petal and a hammer strikes the petal against the ribbon and the page.  Similarly, ball printers use a spherical ball with raised characters on the outside.  The ball spins to each character before printing it on the page.\nWhile impact printers still have some uses (such as printing carbon copies), most printers are now non-impact printers.  These printers, such as laser and inkjet printers are much quieter than impact printers and can print more detailed images."
        ]
    },
    {
        "word": "Import",
        "type": [],
        "definition": [
            "Import is a command typically located within a program's File menu (File &rarr; Import...).  Like the standard File &rarr; Open... command, Import is used for opening files, but it serves a more specific purpose.  Instead of opening standard file types, Import is often used for importing parts of files, program settings, plug-ins, or other unconventional file formats.\nNot all applications include an Import option, since the \"Open...\" command is often sufficient.  Instead, the Import command is only found in programs that require a means of importing unique types of data.  For example, Adobe Photoshop includes an Import command that allows users to import frames from a video file as layers in an image document.  Intuit Quicken includes an Import feature that allows users to import data from .QIF documents or download information directly from the Web.  Most Web browsers also include an Import option that allows users to import saved bookmarks and other settings.\nWhile the Import command can serve a number of different purposes, its main function is to import file types that cannot be opened with the standard \"Open...\" command.  Therefore, if you want to import unconventional types of data into an application, the File &rarr; Import... command may be your best bet.\nMany programs also include an Export command, which is used for saving data in a specific format."
        ]
    },
    {
        "word": "Impression",
        "type": [],
        "definition": [
            "Impressions track how many times a webpage or element on a webpage is viewed.  It is one of the standard metrics used in website analytics software.  The term \"impressions\" most often refers to page impressions, which is synonymous with page views.  Each time a page is viewed, a page impression is counted.  Therefore, a single visitor can rack up multiple impressions on a website by visiting multiple pages.\nUnique impressions, or page views by different visitors, are useful for measuring the number of daily unique visitors to a website.  Website analytics software may record unique impressions by either saving a 24 hour cookie on visitors' browsers or by resetting the record of unique visitors at the start of each day.  Most analytics software records both total and unique impressions.  These two metrics can be used to determine the average number of pages visitors view before leaving the website.\nWhile impressions typically refer to page views, they may also define how many times individual elements on a webpage are viewed.  For example, in online advertising, \"ad impressions\" track the number of times individual advertisements are displayed.  If a webpage contains three ad units, each page view will produce three ad impressions.  By tracking the number of ad impressions, webmasters can monitor the performance of individual ads.  This information can be used in combination with RPM, or revenue per 1,000 page views, to determine the ideal amount of ads for each webpage."
        ]
    },
    {
        "word": "Inbox",
        "type": [],
        "definition": [
            "An inbox is the main folder that your incoming mail gets stored in.  Whether you check your mail through a webmail interface or use a program like Outlook or Mac OS X Mail, each downloaded message gets stored in your inbox.\nIf you check your mail from a POP3 account using an e-mail program, the messages are downloaded to the inbox on your local hard drive.  However, if you use an IMAP mail server, your inbox is created on the server and therefore your messages are stored on the server as well.\nBecause most people receive more mail than they can manage in one folder, it is common to create other folders to store your messages.  After reading your messages, you may move them to other folders you have created (such as \"Family,\" \"Friends,\" \"Business,\" etc.) or delete them by moving them to the Trash.  However you decide to manage you mail, it is a good idea to keep the number of messages in your inbox from growing too large.  Otherwise, you just might have to file for E-mail Bankruptcy."
        ]
    },
    {
        "word": "Index",
        "type": [],
        "definition": [
            "An index is a list of data, such as group of files or database entries.  It is typically saved in a plain text format that can be quickly scanned by a search algorithm.  This significantly speeds up searching and sorting operations on data referenced by the index.  Indexes often include information about each item in the list, such as metadata or keywords, that allows the data to be searched via the index instead of reading through each file individually.\nFor example, a database program such as Microsoft Access may generate an index of entries in a table.  When an SQL query is run on the database, the program can quickly scan the index file to see what entries match the search string.  Search engines also use indexes to store a large list of Web pages.  These indexes, such as those created by Google and Yahoo!, are necessary for quickly generating search results.  If search engines had to scan through millions of pages each time a user submitted a search, it would take roughly forever.  Fortunately, by using search indexes, Web searches can be performed in less than a second instead of several hours.\nThe term \"index\" can also be used as a verb, which not surprisingly means to create an index.  It may also refer to adding a new item to an existing index.  For example, Mac OS X 10.4 and later indexes the hard disk to create a searchable index for Apple's Spotlight search utility.  Google's \"Googlebot\" crawls the Web on a regular basis, adding new Web pages to the Google index.  While most database and hard disk indexes are updated on-the-fly, search engine indexes are only updated every few hours, days, or even weeks.  This is why newly published Web pages may not show up in search engine results.  While it may be a frustration for Web developers, it is a small price to pay for the convenience of super-fast Web searches."
        ]
    },
    {
        "word": "Influencer",
        "type": [],
        "definition": [
            "An influencer is a person who promotes products, services, or events via social media.  Common platforms include Instagram, Twitter, and YouTube.  Paying influencers to promote brands is a popular means of social media marketing.\nThe number one qualification of an influencer is a large number of followers.  Small influencers may have under 100,000 followers, while the most popular influencers have several million followers.  Some influencers build their follower base from scratch by posting photos, videos, or tweets that gain a lot of attention.  Other influencers use their existing celebrity status to build a follower base.\nAn influencer must also have expertise or authority in his or her fields of influence.  For example, a weight-lifting champion may have the credibility to promote workout equipment and training videos.  An experienced cook may be able to influence people's decisions regarding diet and nutrition.  A technology expert may recommend specific hardware and software products.\nInfluencers often sign contracts with companies, which may require that the influencer publishes a certain number of posts per week or month.  The company may also require specific words, mentions, or hashtags.  For example, a clothing company might pay an influencer an ongoing fee to post at least two photos of the person wearing the brand each week.  Companies may also pay influencers a one-time fee for a single post or a series of posts.  This is a common way to promote brand launches or local events, such as concerts.\nNOTE: In 2017, the Federal Trade Commission (FTC) instituted rules influencers must follow when promoting brands online.  For example, Instagram posts must include wording that clearly states when they have been sponsored."
        ]
    },
    {
        "word": "Infotainment",
        "type": [],
        "definition": [
            "Infotainment is a combo word, like \"fantabulous,\" that combines two words into one.  It refers to television shows, movies, websites, and software that blend information and entertainment together.  For example, shows on the Food Network and Animal Planet provide information to the viewer, but are also fun to watch.  Certain news broadcasts can also be considered infotainment, since they strive to be as entertaining as they are informational.\nWebsites like Yahoo! and CNET also have content that is both informational and entertaining.  Software titles such as Grolier Encyclopedia and Encyclopedia Britannica serve primarily to inform, but are also geared to be entertaining, so they can be considered infotainment.  While there is a blurry line between basic information and infotainment, if informational media makes an intentional effort to entertain, you can call it infotainment."
        ]
    },
    {
        "word": "Inkjet",
        "type": [],
        "definition": [
            "Inkjet printers are the most common type of consumer printers.  The inkjet technology works by spraying very fine drops of ink on a sheet of paper.  These droplets are \"ionized\" which allows them to be directed by magnetic plates in the ink's path.  As the paper is fed through the printer, the print head moves back and forth, spraying thousands of these small droplets on the page.\nWhile inkjet printers used to lack the quality and speed of laser printers, they have become almost as fast as laser printers and some can even produce higher-quality images.  Even low-budget inkjet printers can now print high-resolution photos.  The amazing thing is, as the quality of inkjet printers has improved, the prices have continued to drop.  However, for most people, refilling the inkjet cartridges a few times will often cost more than the printer."
        ]
    },
    {
        "word": "Inode",
        "type": [],
        "definition": [
            "An inode (short for \"index node\") is a data structure Linux uses to store information about a file.  Each inode has a unique ID that identifies an individual file or other object in the Linux file system.\nInodes contain the following information:\n\nFile type -  file, folder, executable program etc.\nFile size\nTime stamp - creation, access, modification times\nFile permissions - read, write, execute\nAccess control list - permissions for special users\/groups\nFile protection flags\nFile location - directory path where the file is stored\nLink count -  number of hardlinks to the inode\nAdditional file metadata\nFile pointers - addresses of the storage blocks that store the file contents\n\nNotably, an inode does not contain the filename or the actual data.  When a file is created in the Linux file system, it is assigned an inode number and a filename.  This linked pair allows the filename to be changed without affecting the file ID in the system.  The same holds true when renaming directories, which are treated as files in Linux.\nFile data is stored across one or more blocks on the storage device.  An inode includes a pointer to this data but does not contain the actual data.  Therefore, all inodes are relatively small, regardless of the size of the files they identify.\nModern file systems provide a hierarchical directory structure (folders) to make it easier to organize files.  However, in Linux, files are not actually stored in directories.  Instead, directories only contain filenames and their associated inode IDs.  The ID references an inode in the Linux inode table, which points to the storage blocks where the file data is stored.\nNOTE: Each Linux storage device has an inode limit, which is defined when the disk is formatted.  In rare cases, when many small files are created, the inode limit may be reached before the full storage capacity has been used."
        ]
    },
    {
        "word": "Input",
        "type": [],
        "definition": [
            "Whenever you enter data into your computer, it is referred to as input.  This can be text typed in a word processing document, keywords entered in a search engine's search box, or data entered into a spreadsheet.  Input can be something as simple as moving the mouse or clicking the mouse button or it can be as complex as scanning a document or downloading photos from a digital camera.\nDevices such as the keyboard, mouse, scanner, and even a digital camera are considered input devices.  This is because they allow the user to input data into the computer (yes, the word \"input\" can also be used as a verb).  While input generally comes from humans, computers can also receive input from other sources.  These include audio and video devices that record movies and sound, media discs that install software, and even the Internet, which is used to download files and receive data such as e-mail or instant messages.\nThe opposite of input is output, which is what the computer produces based on user input.  Input and output devices are collectively referred to as I\/O devices."
        ]
    },
    {
        "word": "Input Device",
        "type": [],
        "definition": [
            "An input device is any device that provides input to a computer.  There are dozens of possible input devices, but the two most common ones are a keyboard and mouse.  Every key you press on the keyboard and every movement or click you make with the mouse sends a specific input signal to the computer.  These commands allow you to open programs, type messages, drag objects, and perform many other functions on your computer.\nSince the job of a computer is primarily to process input, computers are pretty useless without input devices.  Just imagine how much fun you would have using your computer without a keyboard or mouse.  Not very much.  Therefore, input devices are a vital part of every computer system.\nWhile most computers come with a keyboard and mouse, other input devices may also be used to send information to the computer.  Some examples include joysticks, MIDI keyboards, microphones, scanners, digital cameras, webcams, card readers, UPC scanners, and scientific measuring equipment.  All these devices send information to the computer and therefore are categorized as input devices.  Peripherals that output data from the computer are called output devices."
        ]
    },
    {
        "word": "Insertion Point",
        "type": [],
        "definition": [
            "An insertion point is the location on the screen where the next character typed will be inserted.  This location may be in a text document, a form field, a Web browser address bar, or anywhere else on the screen that allows text input.\nThe insertion point is often identified by a flashing cursor.  This cursor is called an \"I-beam pointer\" and is shaped like a capital \"I\" or a long vertical line.  When you type a character on the keyboard, it will appear on the screen directly to the right of the flashing cursor.  The insertion point continues to move to the right as each character is entered.\nYou can typically change the current insertion point by clicking in a different location within a text field or word processing document.  This allows you to insert or delete text wherever you click.  You can also create a text selection by clicking and dragging the cursor over a block of text.  When text is selected, the insertion point becomes the entire selection, meaning the next character typed will replace the currently selected text."
        ]
    },
    {
        "word": "Instagram",
        "type": [],
        "definition": [
            "Instagram is an online photo sharing service.  It allows you to apply different types of photo filters to your pictures with a single click, then share them with others.  While is a rather basic service, Instagram's simplicity has helped it gain widespread popularity.\nWhile nearly all smartphones have built-in cameras, they often do not produce quality photos.  By using Instagram, you can liven up otherwise mediocre images and make them look more professional.  For example, Instagram's Valencia filter brightens photos and enhances the contrast, improving the appearance of drab photos.  The Earlybird filter adds a slight blur to the image, warms the colors, and vignettes the corners, giving photos a softer look.  You can also make more drastic changes to photos using a filter like \"1977,\" which makes images look like vintage photographs taken with an old camera.\nThe two primary ways to use Instagram are the Instagram website (Instagram.com) and the Instagram app.  The website allows you to upload images, manage your photos, apply filters, and share them with your friends.  The app allows you to take pictures with your iPhone or Android device and immediately apply the filter of your choice.  You can share your photos directly on Instagram.com or on other social media websites like Facebook, Twitter, and Tumblr.\nNOTE: Instragram was acquired by Facebook in 2012 for approximately $1 billion."
        ]
    },
    {
        "word": "Install",
        "type": [],
        "definition": [
            "Most software programs require that you first install them on your computer before using them.  For example, if you buy Microsoft Office, you need to install it on your computer before you can run any of the included programs such as Word or Excel.  You can install software from a CD or DVD, an external hard drive, or from a networked computer.  You can also install a program or software update from a file downloaded from the Internet.\nInstalling a software program writes the necessary data for running the program on your hard drive.  Often the installer program will decompress the data included with the installer immediately before writing the information to your hard drive.  Software updates, which are typically downloaded from the Internet, work the same way.  When you run the update, the installer file decompresses the data and then updates the correct program or operating system.\nInstalling software is usually a simple process.  It involves double-clicking an installer icon and then clicking \"I Agree\" when the license agreement pops up.  You may have to choose what directory on your hard disk you would like to install the software in, but often the installer will even choose that for you.  Some software can be installed by simply dragging a folder or application program onto your hard drive.  Either way, installing software is a rather simple process and should not be intimidating.  If you can cook you dinner in the microwave, you can install your own software."
        ]
    },
    {
        "word": "Installer",
        "type": [],
        "definition": [
            "In order to install new software on your computer, you often need to run an installer program.  This program unpacks compressed data included with the installer and writes new information to your hard drive.  While some installers do not use compressed data, most use some level of compression since it reduces the size of the files included with the installer.  This is especially helpful when downloading programs or software updates from the Internet.\nAn installer can either install a new program on your computer or can update a program currently on your hard drive.  It can also update or add files to your operating system.  Most installers can be run by simply double-clicking the installer icon and then choosing the folder you want to install the software into.  The nice thing about installers is that they do all the work for you, decompressing and writing the data on the hard drive.  Once the installer is finished, you can often use the new or updated software right away.  If any system files were installed, you will be asked to restart your computer before using the new software.  This is because system files can only be loaded during the computer's boot process."
        ]
    },
    {
        "word": "Integer",
        "type": [],
        "definition": [
            "An integer is a whole number (not a fraction) that can be positive, negative, or zero.  Therefore, the numbers 10, 0, -25, and 5,148 are all integers.  Unlike floating point numbers, integers cannot have decimal places.\nIntegers are a commonly used data type in computer programming.  For example, whenever a number is being incremented, such as within a \"for loop\" or \"while loop,\" an integer is used.  Integers are also used to determine an item's location within an array.\nWhen two integers are added, subtracted, or multiplied, the result is also an integer.  However, when one integer is divided into another, the result may be an integer or a fraction.  For example, 6 divided by 3 equals 2, which is an integer, but 6 divided by 4 equals 1.5, which contains a fraction.  Decimal numbers may either be rounded or truncated to produce an integer result."
        ]
    },
    {
        "word": "Integrated",
        "type": [],
        "definition": [
            "Integrated comes from the Latin word \"integer,\" which means whole.  If something is integrated, it is designed to act or function as one unit.  While the term has a singular meaning, it has many different applications within the IT world.  It may describe a hardware component, a software program, or the combination of hardware and software.\nAn integrated hardware component may be combined with one or more other components.  Many laptops, for instance, include integrated graphics chips that are built into the motherboard.  In some cases, the graphics processor is integrated directly into the CPU.  Integrating hardware components can save space and reduce manufacturing costs, but it may also limit the performance and upgradability of a computer system.\nIntegrated software often describes applications bundled with an operating system.  This collection of programs, also called \"system software,\" is designed to provide basic functionality with a consistent user experience.  Both Windows and Macintosh operating systems come with several integrated programs and utilities, such as text editors, web browsers, and activity monitors.\nHardware and software may also be integrated together.  A well-known example is the Macintosh platform, in which the software is integrated with the hardware, since both are developed by Apple.  This is different than the Windows platform, in which Microsoft develops the software, but the hardware is produced by many different manufacturers.  Apple's iOS is also integrated with its iPhone and iPad devices, which is different than the open Android platform."
        ]
    },
    {
        "word": "Integrated Circuit",
        "type": [],
        "definition": [
            "An integrated circuit, or IC, is small chip that can function as an amplifier, oscillator, timer, microprocessor, or even computer memory.  An IC is a small wafer, usually made of silicon, that can hold anywhere from hundreds to millions of transistors, resistors, and capacitors.  These extremely small electronics can perform calculations and store data using either digital or analog technology.\nDigital ICs use logic gates, which work only with values of ones and zeros.  A low signal sent to to a component on a digital IC will result in a value of 0, while a high signal creates a value of 1.  Digital ICs are the kind you will usually find in computers, networking equipment, and most consumer electronics.\nAnalog, or linear ICs work with continuous values.  This means a component on a linear IC can take a value of any kind and output another value.  The term \"linear\" is used since the output value is a linear function of the input.  For example, a component on a linear IC may multiple an incoming value by a factor of 2.5 and output the result.  Linear ICs are typically used in audio and radio frequency amplification."
        ]
    },
    {
        "word": "Intellectual Property",
        "type": [],
        "definition": [
            "Intellectual property refers to the ownership of intangible and non-physical goods.  This includes ideas, names, designs, symbols, artwork, writings, and other creations.  It also refers to digital media, such as audio and video clips that can be downloaded online.\nSince intellectual property is intangible, it is more difficult to protect than other types of property.  For example, tangible property, such as a car, can be recovered or replaced if it is stolen.  However, if intellectual property is stolen, it may be difficult to recover.  Say for example, a person comes up with a great idea for a new invention.  If someone else steals the idea, the potential profit of the invention may also be taken away.  Similarly, if a digital recording of a new song is \"leaked\" on the Internet, thousands of people may download it and redistribute it to others.  If this happens, the profit potential of selling the music may be substantially diminished.\nBecause of its monetary implications, intellectual property it is often used as a legal term to safeguard the rights of creators and inventors.  It has also become increasingly important to media production companies who need to protect the distribution of their digital media.  By defining and establishing intellectual property rights, innovators and creators can have legal protection of their ideas and creations.  This may be done by copyrighting written works, applying for patents for inventions, and trademarking brands, names, and logos.  Of course, the sooner these legal steps are taken, the better.  After all, it is much easier to protect an idea before it is stolen than after someone else takes it!"
        ]
    },
    {
        "word": "InterNIC",
        "type": [],
        "definition": [
            "Stands for \"Internet Network Information Center.\"  The InterNIC is an organization created by the National Science Foundation to provide Internet information and domain name registration services.  While the InterNIC was started as a joint effort between Network Solutions and AT&T, it is now run by the Internet Corporation For Assigned Names and Numbers (ICANN).\nWhile the InterNIC still monitors domain names and provides WHOIS data, the domain name registration process has been relinquished to commercial domain registrars.  Public information regarding domain names, registrars, and other Internet-related data can be accessed at the InterNIC website."
        ]
    },
    {
        "word": "Interactive Video",
        "type": [],
        "definition": [
            "Interactive video (also known as \"IV\") is a type of digital video that supports user interaction.  These videos play like regular video files, but include clickable areas, or \"hotspots,\" that perform an action when you click on them.  For example, when you click on a hotspot, the video may display information about the object you clicked on, jump to a different part of the video, or open another video file.\nInteractive videos are common on YouTube, a popular video sharing website.  They allow you to select one or more options while the video is playing.  For example, towards the end of a video, you may be asked to select which character in the video you liked best.  Once you make your choice, a new video will open and may provide more information about the character you selected.  Other examples of interactive videos include card tricks, choose your own adventure videos, and interactive tutorials.\nYou can create an interactive video in YouTube by using YouTube's \"Annotations\" feature.  This tool allows you to overlay content on top of the video and create clickable hotspots.  If you add interactive content to your video, it is helpful to include a few extra seconds of \"decision time\" that allows the user to make his or her selection.  It is also important to make sure each clickable option links to another live video file on YouTube.\nNOTE: While clickable advertisements are sometimes overlaid on YouTube videos and other video files, these are not considered interactive videos."
        ]
    },
    {
        "word": "Interface",
        "type": [],
        "definition": [
            "The term \"interface\" can refer to either a hardware connection or a user interface.  It can also be used as a verb, describing how two devices connect to each other.\nA hardware interface is used to connect two or more electronic devices together.  For example, a printer typically connects to a computer via a USB interface.  Therefore, the USB port on the computer is considered the hardware interface.  The printer itself also has a USB interface, which is where the other end of the USB cable connects.  Several common peripherals connect to a computer via USB, while other devices use a Firewire connection or other interface.  Ethernet connections are commonly used for networking, which is why most cable modems and routers have an Ethernet interface.\nMany other electronic devices besides computers use some type of interface to connect to other equipment.  For example, a TV may connect to a Blu-ray player via an HDMI cable and may connect to a cable box using component cables.  Audio devices may have either analog or digital audio connections and may include a MIDI interface, which is used to transfer MIDI data.  iPods have a proprietary \"dock connector\" interface, which allows them to connect to a power source and transfer data via USB.\nSince there are many different types of electronic devices, there are also a lot of hardware interfaces.  Fortunately, standards like USB, Firewire, HDMI, and MIDI have helped consolidate the number of interfaces into a manageable number.  After all, it would be pretty difficult if each digital camera, printer, keyboard, and mouse used a different interface.  Computers would need a lot more ports on the back!\n"
        ]
    },
    {
        "word": "Interlaced",
        "type": [],
        "definition": [
            "A common way to compress video is to interlace it.  Each frame of an interlaced video signal shows every other horizontal line of the image.  As the frames are projected on the screen, the video signal alternates between showing even and odd lines.  When this is done fast enough, i.e. around 60 frames per second, the video image looks smooth to the human eye.\nInterlacing has been used for decades in analog television broadcasts that are based on the NTSC (U.S.) and PAL (Europe) formats.  Because only half the image is sent with each frame, interlaced video uses roughly half the bandwidth than it would sending the entire picture.\nThe downside of interlaced video is that fast motion may appear slightly blurred.  For this reason, the DVD and HDTV standards also support progressive scan signals, which draw each line of the image consecutively."
        ]
    },
    {
        "word": "Internal Hard Drive",
        "type": [],
        "definition": [
            "An internal hard drive is a hard drive that resides inside the computer.  Most computers come with a single internal hard drive, which includes the operating system and pre-installed applications.  While laptop computers only have room for one internal hard drive, some desktop computers have multiple hard drive bays, which allows for multiple internal hard drives.\nInternal hard drives have two main connections – one for data and another for power.  The data port may have an ATA or a SATA interface.  This interface connects to the computer's hard drive controller, which enables the drive to communicate with the motherboard.  The power connector attaches to an electrical cable, which provides power from the computer's main power supply.\nThe internal hard drive is a key component of a computer since it stores the user's software and personal files.  While the rest of a computer's components can be easily replaced, if a hard drive fails, the data may not be able to be recovered.  Therefore, it is wise to regularly back up the data stored on an internal hard drive using an external hard drive or an online backup service."
        ]
    },
    {
        "word": "Internet",
        "type": [],
        "definition": [
            "The Internet is a global wide area network that connects computer systems across the world.  It includes several high-bandwidth data lines that comprise the Internet \"backbone.\"  These lines are connected to major Internet hubs that distribute data to other locations, such as web servers and ISPs.\nIn order to connect to the Internet, you must have access to an Internet service provider (ISP), which acts as the middleman between you and the Internet.  Most ISPs offer broadband Internet access via a cable, DSL, or fiber connection.  When you connect to the Internet using a public Wi-Fi signal, the Wi-Fi router is still connected to an ISP that provides Internet access.  Even cellular data towers must connect to an Internet service provider to provide connected devices with access to the Internet.\nThe Internet provides different online services.  Some examples include:\n\nWeb – a collection of billions of webpages that you can view with a web browser\nEmail – the most common method of sending and receiving messages online\nSocial media – websites and apps that allow people to share comments, photos, and videos\nOnline gaming – games that allow people to play with and against each other over the Internet\nSoftware updates – operating system and application updates can typically downloaded from the Internet\n\nIn the early days of the Internet, most people connected to the Internet using a home computer and a dial-up modem.  DSL and cable modems eventually provided users with \"always-on\" connections.  Now mobile devices, such as tablets and smartphones, make it possible for people to be connected to the Internet at all times.  The Internet of Things has turned common appliances and home systems into \"smart\" devices that can be monitored and controlled over the Internet.  As the Internet continues to grow and evolve, you can expect it to become an even more integral part of daily life."
        ]
    },
    {
        "word": "Internet of Things",
        "type": [],
        "definition": [
            "The Internet of Things, commonly abbreviated \"IoT,\" is an umbrella term that refers to anything connected to the Internet.  It includes traditional computing devices, such as laptops, tablets, and smartphones, but also includes a growing list of other devices that have recently become Internet enabled.  Examples include home appliances, automobiles, wearable electronics, security cameras, and many other things.\nIn order for a device to be part of the Internet of Things, it must be able to communicate with other devices.  Therefore, it requires some type of built-in wired or wireless communication.  Most IoT devices are Wi-Fi enabled, but Bluetooth can also be used to transfer data to nearby devices.  Anything that connects directly to the Internet must have a unique IP address, which is one of the reasons the adoption of IPv6 has been so important.\nIoT devices are commonly called \"smart devices,\" since they are able to communicate with other things.  For example, you can't control a traditional oven when you are away from home.  However, a smart oven that is connected to the cloud can be accessed remotely via a web interface or an app.  You can check the status of the oven and start preheating it before you get home.  Other smart home devices, such as smart thermostats, light fixtures, wall outlets, and window treatments are considered part of the IoT since they can be accessed and controlled over the Internet.\nAlong with the capacity to communicate, many IoT devices also include an array of sensors that provide useful information.  For example, a wearable device may include sensors that track your heart rate and activity level.  It can automatically upload your data to your personal account on the Internet.  A security system might include motion detectors that send you an alert if any suspicious activity is recorded.  Lighting systems can be automated using sensors that detect how dark it is outside.\nWhile the Internet of Things is still in its infancy, it provides promising opportunities for the future.  For example, connecting medical devices to the Internet will make it easier for doctors to track patients' health, providing more consistent data and requiring fewer appointments.  Agricultural products will be able to self-adjust based on weather forecasts, creating more efficient farming methods.  Internet-connected cars will communicate with each other, providing better traffic information and paving the way for self-driving cars.  In time, the Internet of Things will become less of an abstract idea and more of a way of life."
        ]
    },
    {
        "word": "Interpreter",
        "type": [],
        "definition": [
            "An interpreter is a program that reads and executes code.  This includes source code, pre-compiled code, and scripts.  Common interpreters include Perl, Python, and Ruby interpreters, which execute Perl, Python, and Ruby code respectively.\nInterpreters and compilers are similar, since they both recognize and process source code.  However, a compiler does not execute the code like an interpreter does.  Instead, a compiler simply converts the source code into machine code, which can be run directly by the operating system as an executable program.  Interpreters bypass the compilation process and execute the code directly.\nSince interpreters read and execute code in a single step, they are useful for running scripts and other small programs.  Therefore, interpreters are commonly installed on Web servers, which allows developers to run executable scripts within their webpages.  These scripts can be easily edited and saved without the need to recompile the code.\nWhile interpreters offer several advantages for running small programs, interpreted languages also have some limitations.  The most notable is the fact that interpreted code requires an interpreter to run.  Therefore, without an interpreter, the source code serves as a plain text file rather than an executable program.  Additionally, programs written for an interpreter may not be able to use built-in system functions or access hardware resources like compiled programs can.  Therefore, most software applications are compiled rather than interpreted."
        ]
    },
    {
        "word": "Interrupt",
        "type": [],
        "definition": [
            "An interrupt is a signal sent to the processor that interrupts the current process.  It may be generated by a hardware device or a software program.\nA hardware interrupt is often created by an input device such as a mouse or keyboard.  For example, if you are using a word processor and press a key, the program must process the input immediately.  Typing \"hello\" creates five interrupt requests, which allows the program to display the letters you typed.  Similarly, each time you click a mouse button or tap on a touchscreen, you send an interrupt signal to the device.\nAn interrupt is sent to the processor as an interrupt request, or IRQ.  Each input device has a unique IRQ setting, or priority.  This prevents conflicts and ensures common input devices, such as keyboards and mice, are prioritized.\nSoftware interrupts are used to handle errors and exceptions that occur while a program is running.  For example, if a program expects a variable to be a valid number, but the value is null, an interrupt may be generated to prevent the program from crashing.  It allows the program to change course and handle the error before continuing.  Similarly, an interrupt can be used to break an infinite loop, which could create a memory leak or cause a program to be unresponsive.\nBoth hardware and software interrupts are processed by an interrupt handler, also called an interrupt service routine, or ISR.  When a program receives an interrupt request, the ISR handles the event and the program resumes.  Since interrupts are often as brief as a keystroke or mouse click, they are often processed in less than a millisecond."
        ]
    },
    {
        "word": "Intranet",
        "type": [],
        "definition": [
            "An intranet is a private network that can only be accessed by authorized users.  The prefix \"intra\" means \"internal\" and therefore implies an intranet is designed for internal communications.  \"Inter\" (as in Internet) means \"between\" or \"among.\"  Since there is only one Internet, the word \"Internet\" is capitalized.  Because many intranets exist around the world, the word \"intranet\" is lowercase.\nSome intranets are limited to a specific local area network (LAN), while others can be accessed from remote locations over the Internet.  Local intranets are generally the most secure since they can only be accessed from within the network.  In order to access an intranet over a wide area network (WAN), you typically need to enter login credentials.\nIntranets serve many different purposes, but their primary objective is to facilitate internal communication.  For example, a business may create an intranet to allow employees to securely share messages and files with each other.  It also provides a simple way for system administrators to broadcast messages and roll out updates to all workstations connected to the intranet.\nMost intranet solutions provide a web-based interface for users to access.  This interface provides information and tools for employees and team members.  It may include calendars, project timelines, task lists, confidential files, and a messaging tool for communicating with other users.  The intranet website is commonly called a portal and can be accessed using a custom intranet URL.  If the intranet is limited to a local network, it will not respond to external requests.\nExamples of intranet services include Microsoft SharePoint, Huddle, Igloo, and Jostle.  While some services are open source and free of charge, most intranet solutions require a monthly fee.  The cost is usually related to the number of users within the intranet."
        ]
    },
    {
        "word": "Irrational Number",
        "type": [],
        "definition": [
            "An irrational number is real number that cannot be expressed as a ratio of two integers.  When an irrational number is written with a decimal point, the numbers after the decimal point continue infinitely with no repeatable pattern.\nThe number \"pi\" or π (3.14159...) is a common example of an irrational number since it has an infinite number of digits after the decimal point.  Many square roots are also irrational since they cannot be reduced to fractions.  For example, the √2 is close to 1.414, but the exact value is indeterminate since the digits after the decimal point continue infinitely: 1.414213562373095...  This value cannot be expressed as a fraction, so the square root of 2 is irrational.\nAs of 2018, π has been calculated to 22 trillion digits and no pattern has been found.\nIf a number can be expressed as a ratio of two integers, it is rational.  Below are some examples of irrational and rational numbers.\n\n2 - rational\n√2 - irrational\n3.14 - rational\nπ - irrational\n√3 - irrational\n√4 - rational\n7\/8 - rational\n1.333 (repeating) - rational\n1.567 (repeating) - rational\n1.567183906 (not repeating) - irrational\n\nNOTE: When irrational numbers are encountered by a computer program, they must be estimated."
        ]
    },
    {
        "word": "Iteration",
        "type": [],
        "definition": [
            "Iteration is the repetition of a function or process in a computer program.  Iterations of functions are common in computer programming, since they allow multiple blocks of data to be processed in sequence.  This is typically done using a \"while loop\" or \"for loop\" (see the examples below).  These loops will repeat a process until a certain number or case is reached.  Recursive functions also use iteration, though instead of repeating a process, the entire function repeats itself.\nWhile loop: &nbsp; while (x &lt; 30) { ... x++; }\nFor loop: &nbsp; for (x=0; x&lt;30; x++) { ... }\nA practical example of how iterations are used is a PHP Web page that lists data from a table in a database.  In order to display the table on the Web, the function might write each row in HTML using data from the database until the last row of data is reached.  In this case, each row of the table would be created by an iteration of the PHP function.\nIterated functions are frequently used in both Web scripts and software programs.  They can be simple functions like the one in the example above or complex loops that contain nested loops, which may call additional functions.  The amazing thing is that even these complex loops typically only take a fraction of a second to complete."
        ]
    },
    {
        "word": "iCloud",
        "type": [],
        "definition": [
            "iCloud is an online service provided by Apple.  It provides an email account, online storage, and backup services.  It also allows you to share data between devices, such as Macs, iPhones, and iPads.\nBelow is a list of features included with iCloud:\n\nMail – an email account that can be automatically configured on Apple devices and accessed via Apple's webmail interface; iCloud email addresses end with mac.com, me.com, or icloud.com.\nContacts – your address book is stored in the cloud and can be synced across your all your devices.\nCalendar – you can store one or more calendars online and sync the events across your all your devices.\nPhotos – Apple's Photo Stream automatically stores your recently captured photos in iCloud.  You can also use iCloud Photo Library to store all your images on iCloud and sync them across your devices.\niCloud Drive – an online storage area where you can save and download all types of files.\nNotes – you can jot down notes on one device and view them on another one.\nReminders – when you set a reminder it will show up on all devices connected to your iCloud account.\nFind My iPhone – a service that allows you to locate all your Apple devices, such as your iPhone, iPad, or MacBook.\n\nSeveral Apple applications support iCloud, meaning you can save a document from one device and open and edit it on another one.  For example, you can create a presentation using Apple Keynote on an iMac, save it in iCloud, then open it on your iPad at a later time.  The primary apps that support iCloud include Pages (word processing documents), Numbers (spreadsheets), and Keynote (presentations).  iCloud includes web-based versions of these applications as well.\nApple's iCloud service is free to use and can be accessed using an Apple ID on any supported device.  If you need additional online storage, you can purchase extra storage space for a monthly fee.\nNOTE: iCloud is an evolution of Apple's cloud computing services.  Previous versions include iTools (2000), &#46;Mac (2002), and MobileMe (2008).  iCloud, which replaced MobileMe, was launched in 2011."
        ]
    },
    {
        "word": "iOS",
        "type": [],
        "definition": [
            "iOS is a mobile operating system developed by Apple.  It was originally named the iPhone OS, but was renamed to the iOS in June, 2009.  The iOS currently runs on the iPhone, iPod touch, and iPad.\nLike modern desktop operating systems, iOS uses a graphical user interface, or GUI.  However, since it is a mobile operating system, iOS is designed around touchscreen input, rather than a keyboard and mouse.  For example, applications, or \"apps,\" can be opened by a single tap, rather than a double-click.  Different screens can be viewed by swiping your finger across the screen, rather than clicking on open windows.\nSince iOS is designed to be simple and easy to use, it does not include several features found in a traditional operating system.  For example, you cannot manage files and folders like you can in Mac OS X or Windows.  You also have limited access to iOS system settings.  Instead of modifying application preferences from within each program, most settings need to be adjusted within the Settings app.  Additionally, while you can run multiple programs at once, you can only view one open program at a time.\nWhile Apple's iOS provides a more basic user interface than Mac OS X, each new version adds more features.  For example, iOS 2 provided access to the App Store, which allowed users to download and install third-party apps on their iPhones.  iOS 3 added copy and paste functionality and iPad support.  iOS 4 was the first version to support multitasking and added the GameCenter feature.  iOS 5 introduced the Siri voice assistant (only available on the iPhone 4S), and provided new cloud connectivity features."
        ]
    },
    {
        "word": "iPad",
        "type": [],
        "definition": [
            "The iPad is a tablet computer developed by Apple.  It is smaller than a typical laptop, but significantly larger than the average smartphone.  The iPad does not include a keyboard or a trackpad, but instead has a touchscreen interface, which is used to control the device.\nLike the iPhone, the iPad runs Apple's iOS operating system.  This allows the iPad to run third-party apps, which can downloaded from Apple's App Store.  While apps designed for the iPhone can also be installed and run on the iPad, many iOS apps are developed specifically for the iPad.  Since the iPad's screen is much larger than the iPhone's screen, iPad apps can include more user interface features that would not fit within an iPhone app.  Therefore, productivity, graphics, and video-editing apps are often developed specifically for the iPad rather than the iPhone.\nThe iPad's 9.7 in screen size also makes it ideal as an e-reader.  The iBooks app allows you to download electronic versions of books from the iBookstore and read them on your iPad.  Since the iPad has a full color screen, it supports novels as well as art books and illustrated children's stories.  Books can be read one page at a time in portrait mode or with pages side by side in landscape mode.\nAll versions of the iPad include Wi-Fi capability, which can be used for surfing the Web, checking email, and downloading apps directly to the device.  Some versions of the iPad also include 3G support for transferring data over a cellular connection, though this capability requires a monthly cellular service contract.  While the original iPad did not include a camera, the iPad 2 includes both rear-facing and front-facing cameras.  These cameras can be used for video conferencing with other iPad, iPhone, or Mac users via the FaceTime feature."
        ]
    },
    {
        "word": "iPhone",
        "type": [],
        "definition": [
            "The iPhone is a smartphone developed by Apple.  The first iPhone was released in June, 2007 and an updated version has been released roughly every year since then.  While the iPhone was originally only available to AT&T customers, the iPhone 4 was released on the Verizon network in February, 2010.\nThe iPhone has a sleek, minimalist design, and differs from other smartphones in its lack of buttons.  Most operations on the iPhone are performed using the touch screen display.  The only physical buttons include a sleep\/wake button, a mute switch, volume up\/down buttons, and a home button.  All versions of the iPhone have a rear-facing camera, but the iPhone 4 introduced a front-facing camera, which can be used for video calls made using the FaceTime feature.  The iPhone 4 also included the first 960 x 640 pixel \"retina display,\" which has double the resolution of previous iPhone displays.\nThe iPhone 5 and 5s had the same screen resolution as the iPhone 4.  The iPhone 6, released in September 2014, provided a larger 4.7\" display with 1334x750 pixels.  The iPhone 6 Plus, released at the same time, came with an even larger 5.5-inch 1920x1080 pixel display.  The iPhone 7 and 7 Plus have the same screen sizes as the 6 and 6 Plus.\nInternally, the iPhone runs the iOS, an operating system developed by Apple for portable devices.  This allows the iPhone to run \"apps,\" or applications developed specifically for the iPhone.  Apps can be downloaded from Apple's App Store, which can be accessed through iTunes or directly from the iPhone's built-in App Store app.  There are hundreds of thousands of apps available from the App Store, which provide the iPhone with limitless functionality.\nExamples of iPhone apps include Tech Terms (for this website) and Slang.net, a slang dictionary."
        ]
    },
    {
        "word": "iPod",
        "type": [],
        "definition": [
            "The iPod is a portable music player developed by Apple Computer.  Though it is an Apple product, the iPod can be used with both Macs and PCs.  The iTunes software, also created by Apple, is used to organize and transfer songs and playlists to the iPod.  Both iTunes and the iPod support a wide variety of audio formats, including MP3, AAC, WAV, and AIFF.  MP3 is the most common audio compression format, while AAC is the format used by the iTunes Music Store.  WAV and AIFF are nearly identical formats that store CD-quality audio.\nSince introducing the iPod in 2001, Apple has released several new versions of the popular device.  These include iPod, iPod mini, iPod Special Edition, iPod photo, and iPod shuffle.  iPod mini is a smaller version of the iPod that comes in various colors and stores fewer songs.  iPod Special Edition is a variation of the basic iPod (the first being a black U2 iPod with the signatures of the band members on the back).  iPod photo is an iPod with a color screen that allows users to store and view a library of photos as well as play music.  iPod shuffle is an extra small iPod that only holds a couple hundred songs and does not have a screen.\nAll iPods store data on an internal hard drive, except the iPod Shuffle, which uses flash memory.  This means each iPod, including the shuffle, can also be used as a hard drive.  Aside from being a music player, the iPod can serve as a backup device, a basic organizer, and an alarm clock.  To transfer files to the iPod, you must first connect it to your computer using a USB or Firewire cable.  iTunes can automatically transfer your playlists and songs or you can change the program's preferences to manually update the iPod.\nBecause of its superb interface and unmatched ease of use, the iPod has become the staple product of the portable music player market.  Granted, the \"cool factor\" of owning an iPod has certainly helped it gain popularity as well."
        ]
    },
    {
        "word": "iSCSI",
        "type": [],
        "definition": [
            "Stands for \"Internet Small Computer Systems Interface.\"  iSCSI is an extension of the standard SCSI storage interface that allows SCSI commands to be sent over an IP based network.  It enables computers to access hard drives over a network the same way they would access a drive that is directly connected to the computer.\niSCSI is a popular protocol used by storage area networks, which allow multiple computers to share multiple hard drives.  For example, data centers can be spread out over multiple locations using iSCSI and a standard Internet connection.  While the data access time may be slower over the Internet than compared to a direct SCSI connection, iSCSI can serve as a helpful means for creating off-site backups and sharing large amounts of data across multiple locations."
        ]
    },
    {
        "word": "iTunes",
        "type": [],
        "definition": [
            "iTunes is an audio playback program developed by Apple Computer.  You can use iTunes to import songs from CDs as well as other audio files from your hard drive.  The program can also download songs (for a small fee) from the iTunes Music Store.  While songs are the most common files played by iTunes, you can also play spoken word files, such as audio books or other recordings.  iTunes also has a radio option that allows you to play live streams of Internet radio from a variety of stations.\nEach file you import with iTunes get stored in the iTunes library.  Fortunately, the library can be organized into multiple playlists, which is especially helpful when you have thousands of songs.  (Yes, some people have over 10,000 songs in their library.)  You can also create \"smart playlists,\" which store songs according to the parameters you set.  For example, if you want a playlist of only rock music, you can create a smart playlist that only holds songs where the \"Genre\" tag contains \"Rock.\"  iTunes is the software that comes with the iPod, and allows you to transfer your playlists from your computer to your iPod.  Like the iPod, iTunes can be used on a Mac or PC."
        ]
    }
]