[
    {
        "word": "JDBC",
        "type": [],
        "definition": [
            "Stands for \"Java Database Connectivity.\"  JDBC is an API that allows Java applications to connect to and query a wide range of databases.  Examples include Java DB, Oracle, MySQL, PostgreSQL, DB2, Sybase ASE, and Microsoft SQL Server.\nJDBC makes it possible for a software developer to run SQL queries within a Java application.  The database connection and any required query translations are handled by the JDBC driver.  For example, the same Java method can be used to query a MySQL database and a Microsoft SQL Server database.  The goal is to provide developers with \"write once, run anywhere\" functionality, making it easy to work with different types of databases.\nIn order for an application to use JDBC, the appropriate driver must be installed.  Examples include the JDBC Thin driver and the JDBC OCI (Oracle Call Interface) driver.  The driver files are available as Java archives (.JAR files), which can be referenced by a Java application.  Each Java archive contains .CLASS files that allow Java apps to communicate with different types of databases.  Individual classes can be removed to reduce the disk space required by the corresponding Java app.\nJDBC drivers are maintained and provided by Oracle, which took over the development of Java after acquiring Sun Microsystems in 2010.\nWhat is the difference between JDBC and ODBC?\nJDBC is designed specifically for Java applications, while ODBC is language independent.  That means the ODBC API is available for multiple programming languages, while JDBC is only available for Java.  A \"bridge\" can be used to translate commands between the two APIs.  For example, an ODBC-JDBC bridge translates ODBC function-calls into JDBC method-calls, allowing them to be processed by a JDBC driver.  A JDBC-ODBC driver converts JDBC method calls into ODBC function calls, allowing them to work with an ODBC driver."
        ]
    },
    {
        "word": "JFS",
        "type": [],
        "definition": [
            "Stands for \"Journaled File System.\"  JFS is a 64-bit file system created by IBM.  The initial version of JFS (also called JFS1) was developed for IBM's AIX operating system and was released in 1990.  In 2001, IBM released JFS2 (the Enhanced Journaled File System), as well as a version of JFS that is compatible with the Linux operating system.\nThe \"journaled\" aspect of JFS means that the file system keeps tracks of changes to files and folders in a log file (or journal).  This log can be used to backtrack certain changes in case of an unexpected power failure or system crash, which may prevent data corruption.  For example, if a file is in the process of being moved or deleted when a computer crashes, the journal can be used to restore the file to its last stable state.  Without the journal, the file may be truncated, which would make it unreadable and could produce other file system errors.\nThe Enhanced Journaled File System (JFS2) is similar to JFS, but supports much larger volumes and file sizes.  For example, a hard disk formatted using JFS can be a maximum of one terabyte (TB) in size, while a JFS2-formatted disk can be up to 32 TB.  JFS's maximum file size is slightly less than 64 gigabytes (GB), while JFS2 supports file sizes up to 16 TB.  This large file capacity is especially important for storing large databases, which are often contained in a single file.\nNOTE: JFS2 is supported by AIX 5.1 and later.  It is also supported on Linux systems that have the \"jfsutils\" package installed."
        ]
    },
    {
        "word": "JPEG",
        "type": [],
        "definition": [
            "Stands for \"Joint Photographic Experts Group.\"  JPEG is a popular image file format.  It is commonly used by digital cameras to store photos since it supports 224 or 16,777,216 colors.  The format also supports varying levels of compression, which makes it ideal for web graphics.\nThe 16 million possible colors in a JPEG image are produced by using 8 bits for each color (red, green, and blue) in the RGB color space.  This provides 28 or 256 values for each of the three colors, which combined allow for 256 x 256 x 256 or 16,777,216 colors.  Three values of 0 produce pure black, while three values of 255 create pure white.\nThe JPEG compression algorithm may reduce the file size of a bitmap (BMP) image by ten times with almost no degradation in quality.  Still, the compression algorithm is lossy, meaning some image quality is lost during the compression process.  For this reason, professional digital photographers often choose to capture images in a raw format so they can edit their photos in the highest quality possible.  They typically export the pictures as JPEG (.JPG) images when they are shared or published on the web.\nBesides image data, JPEG files may also include metadata that describes the contents of the file.  This includes the image dimensions, color space, and color profile information, as well as EXIF data.  The EXIF data is often \"stamped\" on the image by a digital camera and may include the aperture setting, shutter speed, focal length, flash on\/off, ISO number, and dozens of other values.\nDisadvantages of the JPEG Format\nWhile the JPEG format is great for storing digital photos, it does have some drawbacks.  For example, the lossy compression can cause an issue called \"artifacting,\" in which parts of the image become noticeably blocky.  This typically happens when a high compression setting is used to save the image.  For saving small images and images with a lot of text, the GIF format is often a better alternative.  JPEG images also don't support transparency.  Therefore, the JPEG format is a poor choice for saving non-rectangular images, especially if they will be published on webpages with different background colors.  The PNG format, which supports transparent pixels is more ideal for these types of images.\nNOTE: The Joint Photographic Experts Group, which the JPEG image format is named after, published the first JPEG specification in 1992.  Since then, the organization has developed several variations of the format, including JPEG 2000 and JPEG XR.  However, the standard JPEG format remains the most popular.\nFile extensions: .JPG, .JPEG, .JFIF, .JPX, .JP2"
        ]
    },
    {
        "word": "JRE",
        "type": [],
        "definition": [
            "Stands for \"Java Runtime Environment\" and may also be written \"Java RTE.\"  Java is a programming language, similar to C.  However, since it is a newer language, it is not natively supported by all operating systems.  Therefore, a Java Runtime Environment may need to be installed on your computer for Java applets and Java applications to run.\nThe JRE, or Java RTE, is developed by Sun Microsystems (the creator of Java) and includes the Java Virtual Machine (JVM), code libraries, and components, which are necessary to run programs written in Java.  The JRE is available for multiple computer platforms, including Mac, Windows, and Unix.\nIf the JRE is not installed on a computer, Java programs may not be recognized by the operating system and will not run.  The JRE software provides a runtime environment in which Java programs can be executed, just like software programs that have been fully compiled for the computer's processor.  JRE software is available as both a standalone environment and a Web browser plug-in, which allows Java applets to be run within a Web browser."
        ]
    },
    {
        "word": "JSF",
        "type": [],
        "definition": [
            "Stands for \"JavaServer Faces.\"  JSF is a framework that allows Web developers to build user interfaces for JavaServer applications.  It is supported by Web servers running Java Enterprise Edition (Java EE).\nJSF simplifies the creation of Web applications by providing a standard set of tools (or an API) for building user interfaces.  For example, instead of coding a Web form in HTML, a developer can instead call a simple JSF function that generates the form.  Another JSF function may be used to process the data entered by the user.  These functions are processed on the server and the resulting data is output to the client's browser.\nJSF benefits developers by providing reusable objects that can easily be inserted into webpages.  However, these components are also beneficial to website visitors since they produce standardized interface elements.  Since the Java code is processed on the server, the appearance of the generated Web objects is consistent across multiple websites.  Additionally, JSF components are tested on multiple platforms, so they work well in all major browsers.\nWhile JSF is often used to create basic webpage elements, it also supports advanced features, such as database access, Ajax interaction, and JavaScript page actions.  These capabilities are useful for building dynamic websites that generate pages on-the-fly."
        ]
    },
    {
        "word": "JSON",
        "type": [],
        "definition": [
            "Stands for \"JavaScript Object Notation\" and is pronounced like the name \"Jason.\"  JSON is a text-based data interchange format designed for transmitting structured data.  It is most commonly used for transferring data between web applications and web servers.\nJSON is often viewed as an alternative to XML, another plain text data interchange format.  In most cases, the JSON representation of an object is more compact than the XML representation because it does not require tags for each element.  Below is an example of an object named \"Gaming PC\" defined in both JSON and XML.\nJSON\n{\n&nbsp;&nbsp;\"computer\": {\n&nbsp;&nbsp;&nbsp;&nbsp;\"name\": \"Gaming PC\",\n&nbsp;&nbsp;&nbsp;&nbsp;\"components\": {\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\"cpu\": \"Intel i7 3.4GHz\", \"ram\": \"16GB\", \"storage\": \"2TB HDD\"\n&nbsp;&nbsp;&nbsp;&nbsp;}\n&nbsp;&nbsp;}\n}\nXML\n&lt;computer&gt;\n&nbsp;&nbsp;&lt;name&gt;Gaming PC&lt;\/name&gt;\n&nbsp;&nbsp;&lt;components&gt;\n&nbsp;&nbsp;&nbsp;&nbsp;&lt;cpu&gt;Intel i7 3.4GHz&lt;\/cpu&gt;\n&nbsp;&nbsp;&nbsp;&nbsp;&lt;ram&gt;16GB&lt;\/ram&gt;\n&nbsp;&nbsp;&nbsp;&nbsp;&lt;storage&gt;2TB HDD&lt;\/storage&gt;\n&nbsp;&nbsp;&lt;\/components&gt;\n&lt;\/computer&gt;\nAs you can see, the object is represented more efficiently in JSON than in XML.  JSON's efficiency has helped it become a popular choice for web applications and is it is now often used in place of XML.  Even Ajax applications commonly use JSON, though Ajax technically stands for \"Asynchronous JavaScript and XML.\"  While the difference between XML and JSON may be negligible for small applications, JSON's low overhead can help reduce bandwidth and other system resources used by high-traffic websites.\nFile extension: .JSON"
        ]
    },
    {
        "word": "JSP",
        "type": [],
        "definition": [
            "Stands for \"Java Server Page.\"  This standard was developed by Sun Microsystems as an alternative to Microsoft's active server page (ASP) technology.  JSP pages are similar to ASP pages in that they are compiled on the server, rather than in a user's Web browser.  After all, they don't call them \"server pages\" for nothing.  However, JSP is Java-based, whereas ASP is Visual Basic-based.  JSP pages are useful for building dynamic Web sites and accessing database information on a Web server.  Though JSP pages may have Java interspersed with HTML, all the Java code is parsed on the server.  Therefore, once the page gets to the browser, it is only HTML.  JavaScript, on the other hand, is usually parsed by the Web browser, not the Web server."
        ]
    },
    {
        "word": "JVM",
        "type": [],
        "definition": [
            "Stands for \"Java Virtual Machine.\"  A JVM is a software-based machine that runs Java programs.  It can be installed on several different operating systems, including Windows, OS X, and Linux.  JVMs allow Java apps to run on almost any computer.\nA Java virtual machine processes instructions similar to a physical processor.  However, the Java code from a .JAVA file must first be converted into instructions the JVM can understand.  This binary format, called \"bytecode,\" can be processed one instruction at a time or compiled into a .CLASS file before execution to improve performance.\nWhile Java apps are platform independent (meaning they can run on different platforms), not all Java programs are compatible with all Java virtual machines.  JVMs are updated regularly with new features and support for new instructions.  Therefore Java often require a minimum JVM version in order to run.\nNOTE: The terms JVM and JRE (Java runtime environment) are often used synonymously.  Technically, however, the JVM is part of a JRE, which also includes libraries of functions and other files that Java programs can reference."
        ]
    },
    {
        "word": "Java",
        "type": [],
        "definition": [
            "Java is a high-level programming language developed by Sun Microsystems.  It was originally designed for developing programs for set-top boxes and handheld devices but later became a popular choice for creating web applications.\nThe Java syntax is similar to C++, but is strictly an object-oriented programming language.  For example, most Java programs contain classes, which are used to define objects, and methods, which are assigned to individual classes.  Java is also known for being more strict than C++, meaning variables and functions must be explicitly defined.  This means Java source code may produce errors or \"exceptions\" more easily than other languages, but it also limits other types of errors that may be caused by undefined variables or unassigned types.\nUnlike Windows executables (.EXE files) or Macintosh applications (.APP files), Java programs are not run directly by the operating system.  Instead, Java programs are interpreted by the Java Virtual Machine, or JVM, which runs on multiple platforms.  This means all Java programs are multiplatform and can run on different platforms, including Macintosh, Windows, and Unix computers.  However, the JVM must be installed for Java applications or applets to run at all.  The JVM is included as part of the Java Runtime Environment (JRE).\nNOTE: Oracle acquired Sun Microsystems in January 2010.  Java is now maintained and distributed by Oracle.\nFile extensions: .JAVA, .JAV, .JAD, .JAR, .JSP, .CLASS"
        ]
    },
    {
        "word": "JavaScript",
        "type": [],
        "definition": [
            "JavaScript is a programming language commonly used in web development.  It was originally developed by Netscape as a means to add dynamic and interactive elements to websites.  While JavaScript is influenced by Java, the syntax is more similar to C and is based on ECMAScript, a scripting language developed by Sun Microsystems.\nJavaScript is a client-side scripting language, which means the source code is processed by the client's web browser rather than on the web server.  This means JavaScript functions can run after a webpage has loaded without communicating with the server.  For example, a JavaScript function may check a web form before it is submitted to make sure all the required fields have been filled out.  The JavaScript code can produce an error message before any information is actually transmitted to the server.\nLike server-side scripting languages, such as PHP and ASP, JavaScript code can be inserted anywhere within the HTML of a webpage.  However, only the output of server-side code is displayed in the HTML, while JavaScript code remains fully visible in the source of the webpage.  It can also be referenced in a separate .JS file, which may also be viewed in a browser.\nBelow is an example of a basic JavaScript function that adds two numbers.  The function is called with the parameters 7 and 11.  If the code below were included in the HTML of a webpage, it would display the text \"18\" in an alert box.\n&lt;script&gt;\n&nbsp; function sum(a,b)\n&nbsp; {\n&nbsp; &nbsp; return a + b;\n&nbsp; }\n&nbsp; var total = sum(7,11);\n&nbsp; alert(total);\n&lt;\/script&gt;\nJavaScript functions can be called within &lt;script&gt; tags or when specific events take place.  Examples include onClick, onMouseDown, onMouseUp, onKeyDown, onKeyUp, onFocus, onBlur, onSubmit, and many others.  While standard JavaScript is still used for performing basic client-side functions, many web developers now prefer to use JavaScript libraries like jQuery to add more advanced dynamic elements to websites."
        ]
    },
    {
        "word": "Jitter",
        "type": [],
        "definition": [
            "Jitter, in networking, refers to small intermittent delays during data transfers.  It can be caused by a number of factors including network congestion, collisions, and signal interference.\nTechnically, jitter is the variation in latency — the delay between when a signal is transmitted and when it is received.  All networks experience some amount of latency, especially wide area networks that span across the Internet.  This delay, typically measured in milliseconds, can be problematic for real-time applications, such as online gaming, streaming, and digital voice communication.  Jitter makes this worse by producing additional delays.\nNetwork jitter causes packets to be sent at irregular intervals.  For example, there may be a delay after some packets are sent and then several packets may be sent all at once.  This may cause packet loss if the receiving system is unable to process all the incoming packets.  If this happens during a file download, the lost packets will be resent, slowing down the file transfer.  In the case of a real-time service, like audio streaming, the data may simply be lost, causing the audio signal to drop out or decrease in quality.\nThe standard way to compensate for network jitter is to use a buffer that stores data before it is used, such as a few seconds of an audio or video clip.  This will smooth out the playback of the media since it gives the receiving computer a few seconds to receive any packets lost due to jitter.  While buffers are an effective solution, they must be extremely small when used in real-time applications such as online gaming and video conferencing.  If the buffer is too large (greater than 10 ms), it will cause a noticeable delay."
        ]
    },
    {
        "word": "Joystick",
        "type": [],
        "definition": [
            "A joystick is an input device commonly used to control video games.  Joysticks consist of a base and a stick that can be moved in any direction.  The stick can be moved slowly or quickly and in different amounts.  Some joysticks have sticks that can also be rotated to the left or right.  Because of the flexible movements a joystick allows, it can provide much greater control than the keys on a keyboard.\nJoysticks typically include several buttons as well.  Most joysticks have at least one button on the top of the stick and another button in the front of the stick for the trigger.  Many joysticks also include other buttons on the base that can be pressed using the hand that is not guiding the stick.  Joysticks typically connect to your computer using a basic USB or serial port connection and often come with software that allows you to assign the function of each button. \nSince joysticks emulate the controls of planes and other aircraft, they are best suited for flight simulators and flying action games.  However, some gamers like to use joysticks for other types of video games, such as first-person shooters and fighting games.  Others prefer using the basic keyboard and mouse, with which they are already accustomed to."
        ]
    },
    {
        "word": "Jumper",
        "type": [],
        "definition": [
            "A jumper is a small metal connector that acts as an on\/off switch.  Multiple jumpers are often used together to configure settings for a hardware device.  Some jumpers are encased in a plastic switch, that can be toggled on or off.  Other jumpers are plastic sleeves with metal linings that connect two metallic prongs together.  When the sleeve is applied, the connection is on and it when it is removed, the connection is off.\nJumpers are found in computer hardware as well as other types of electronic devices.  A motherboard, for instance, may include jumpers that are used to enable different types of components.  Hard drives commonly include jumpers that can enable or disable different features.  For example, one jumper setting might enable spread spectrum clocking (SSC) while another setting might enable PHY or \"physical layer\" mode.  These settings may be required for the hard drive to work with specific types of hardware.\nJumpers are also found in common household electronics, such as remote controls.  For example, a garage door remote may include a row of jumpers.  These jumpers must match the settings of the garage door receiver in order for it to work.  Ceiling fan remotes often include jumpers that can be customized to match the settings for a specific fan.  Modifying the jumper settings of a remote typically changes the frequency on which it communicates.  This allows you to use different frequencies for different devices.\nWhile altering jumpers might seem like a high-tech process, it is usually very easy.  Remotes, for example, typically have jumpers right next to the battery so they can easily be switched on or off.  Just make sure that you know how to correctly modify the jumper settings before changing them.  If you modify the wrong jumpers, the device might not work."
        ]
    },
    {
        "word": "jQuery",
        "type": [],
        "definition": [
            "jQuery is a JavaScript library that allows web developers to add extra functionality to their websites.  It is open source and provided for free under the MIT license.  In recent years, jQuery has become the most popular JavaScript library used in web development.\nTo implement jQuery, a web developer simply needs to reference the jQuery JavaScript file within the HTML of a webpage.  Some websites host their own local copy of jQuery, while others simply reference the library hosted by Google or the jQuery server.  For example, a webpage may load the jQuery library using the following line within the &lt;head&gt; section of the HTML:\n&lt;script type=\"text\/javascript\"src=\"\/\/ajax.googleapis.com\/ajax\/libs\/jquery\/1.9.1\/jquery.min.js\"&gt;&lt;\/script&gt;\nOnce the jQuery library is loaded, a webpage can call any jQuery function supported by the library.  Common examples include modifying text, processing form data, moving elements on a page, and performing animations.  jQuery can also work with Ajax code and scripting languages, such as PHP and ASP to access data from a database.  Since jQuery runs on the client side (rather than the web server), it can update information on a webpage in realtime, without reloading the page.  A common example is \"autocomplete,\" in which a search form automatically displays common searches as you type your query.  In fact, this is how TechTerms.com provides search suggestions when you type in the search box.\nBesides its free license, the other main reason jQuery has gained such popularity is its cross-browser compatibility.  Since each browser renders HTML, CSS, and JavaScript differently, it can be difficult for a web developer to make a website appear the same across all browsers.  Instead of having to write custom functions for each browser, a web developer can use a single jQuery function that will work in Chrome, Safari, Firefox, and Internet Explorer.  This multi-browser support has led many developers to switch from standard JavaScript to jQuery, since it greatly simplifies the coding process.\nYou can read more about jQuery and download the latest library at the official jQuery website."
        ]
    }
]