[
    {
        "word": "LAMP",
        "type": [],
        "definition": [
            "Stands for \"Linux, Apache, MySQL, and PHP.\"  Together, these software technologies can be used to create a fully-functional web server.\nLinux is the most popular operating system used in web servers, primarily because many free Linux distributions are available.  This means Linux-based servers are typically cheaper to set up and maintain than Windows servers.  Since Linux is (open source|open source), it also works with many other popular open source web hosting software components.\nThe most important software component in the \"AMP\" package is Apache, or \"Apache HTTP Server.\"  Apache is the software that serves webpages over the Internet via the HTTP protocol.  Once Apache is installed, a standard Linux machine is transformed into a web server that can host live websites.\nOther components of LAMP include MySQL and PHP.  MySQL is a popular open source database management system (DBMS) and PHP is a popular web scripting language.  Together, these two technologies are used to create dynamic websites.  Instead of only serving static HTML pages, a LAMP server can generate dynamic webpages that run PHP code and load data from a MySQL database.\nNOTE: In some instances, the \"P\" in LAMP may stand for either Perl or Python, which are other scripting languages.  \"AMP\" packages for Windows and Mac systems are called WAMP and MAMP respectively."
        ]
    },
    {
        "word": "LAN",
        "type": [],
        "definition": [
            "Stands for \"Local Area Network\" and is pronounced \"lan.\"  A LAN is a network of connected devices that exist within a specific location.  LANs may be found in homes, offices, educational institutions, and other areas.\nA LAN may be wired, wireless, or a combination of the two.  A standard wired LAN uses Ethernet to connect devices together.  Wireless LANs are typically created using a Wi-Fi signal.  If a router supports both Ethernet and Wi-Fi connections, it can be used to create a LAN with both wired and wireless devices.\nTypes of LANs\nMost residential LANs use a single router to create the network and manage all the connected devices.  The router acts as the central connection point and enables devices, such as computers, tablets, and smartphones to communicate with each other.  Typically, the router is connected to a cable or DSL modem, which provides Internet access to connected devices.\nA computer may also be the central access point of a LAN.  In this setup, the computer acts as a server, providing connected machines with access to files and programs located on the server.  It also includes LAN software used to manage the network and connected devices.  LAN servers are more common in business and educational networks, since the extra capabilities are not required by most home users.  In a server-based LAN, devices may connect directly to the server or indirectly via a router or switch.\nNOTE: Multiple LANs may be combined to create a larger LAN.  This type of network, which can be customized to include specific devices from various networks, is called a virtual LAN or VLAN."
        ]
    },
    {
        "word": "LCD",
        "type": [],
        "definition": [
            "Stands for \"Liquid Crystal Display.\"  LCD is a flat panel display technology commonly used in TVs and computer monitors.  It is also used in screens for mobile devices, such as laptops, tablets, and smartphones.\nLCD displays don't just look different than bulky CRT monitors, the way they operate is significantly different as well.  Instead of firing electrons at a glass screen, an LCD has a backlight that provides light to individual pixels arranged in a rectangular grid.  Each pixel has a red, green, and blue RGB sub-pixel that can be turned on or off.  When all of a pixel's sub-pixels are turned off, it appears black.  When all the sub-pixels are turned on 100%, it appears white.  By adjusting the individual levels of red, green, and blue light, millions of color combinations are possible.\nHow an LCD works\nThe backlight in a liquid crystal display provides an even light source behind the screen.  This light is polarized, meaning only half of the light shines through to the liquid crystal layer.  The liquid crystals are made up of a part solid, part liquid substance that can be \"twisted\" by applying electrical voltage to them.  They block the polarized light when they are off, but reflect red, green, or blue light when activated.\nEach LCD screen contains a matrix of pixels that display the image on the screen.  Early LCDs had passive-matrix screens, which controlled individual pixels by sending a charge to their row and column.  Since a limited number of electrical charges could be sent each second, passive-matrix screens were known for appearing blurry when images moved quickly on the screen.  Modern LCDs typically use active-matrix technology, which contain thin-film transistors, or TFTs.  These transistors include capacitors that enable individual pixels to \"actively\" retain their charge.  Therefore, active-matrix LCDs are more efficient and appear more responsive than passive-matrix displays.\nNOTE: An LCD's backlight may either be a traditional bulb or LED light.  An \"LED display\" is simply an LCD screen with an LED backlight.  This is different than an OLED display, which lights up individual LEDs for each pixel.  While the liquid crystals block most of an LCD's backlight when they are off, some of the light may still shine through (which might be noticeable in a dark room).  Therefore OLEDs typically have darker black levels than LCDs."
        ]
    },
    {
        "word": "LDAP",
        "type": [],
        "definition": [
            "Stands for \"Lightweight Directory Access Protocol.\"  If you want to make directory information available over the Internet, this is the way to do it.  LDAP is a streamlined version of an earlier directory standard called X.500.  What makes LDAP so useful is that it works great over TCP\/IP networks (unlike X.500), so information can be accessed through LDAP by anyone with an Internet connection.  It is also an open protocol, which means directories can be stored on any type of machine (i.e. Windows 2000, Red Hat Linux, Mac OS X).\nTo give you an idea of how an LDAP directory is organized, here are the different levels of a simple LDAP tree hierarchy:\n\nThe root directory\nCountries\nOrganizations\nDivisions, departments, etc.\nIndividuals\nIndividual resources, such as files and printers.\n\nMost LDAP connectivity is done behind the scenes, so the typical user probably won't notice it when surfing the Web.  However, it is a good technology to know about.  If nothing else, it is another term to impress your parents with."
        ]
    },
    {
        "word": "LED",
        "type": [],
        "definition": [
            "Stands for \"Light-Emitting Diode.\"  An LED is an electronic device that emits light when an electrical current is passed through it.  Early LEDs produced only red light, but modern LEDs can produce several different colors, including red, green, and blue (RGB) light.  Recent advances in LED technology have made it possible for LEDs to produce white light as well.\nLEDs are commonly used for indicator lights (such as power on\/off lights) on electronic devices.  They also have several other applications, including electronic signs, clock displays, and flashlights.  Since LEDs are energy efficient and have a long lifespan (often more than 100,000 hours), they have begun to replace traditional light bulbs in several areas.  Some examples include street lights, the red lights on cars, and various types of decorative lighting.  You can typically identify LEDs by a series of small lights that make up a larger display.  For example, if you look closely at a street light, you can tell it is an LED light if each circle is comprised of a series of dots.\nThe energy efficient nature of LEDs allows them to produce brighter light than other types of bulbs while using less energy.  For this reason, traditional flat screen LCD displays have started to be replaced by LED displays, which use LEDs for the backlight.  LED TVs and computer monitors are typically brighter and thinner than their LCD counterparts."
        ]
    },
    {
        "word": "LFN",
        "type": [],
        "definition": [
            "Stands for \"Long Filename.\"  LFN is an extension to the \"short filename\" standard used in DOS, which only allowed eight uppercase characters plus a three-character file extension.  LFN filenames can be up to 255 characters long, including the file extension, which may be longer or shorter than three characters.  They can include lowercase and uppercase characters, as well as spaces, numbers, and symbols.\nMicrosoft introduced long filename support with the VFAT file system in 1994.  VFAT was first included with Windows NT 3.5 and later in Windows 95. To maintain backward compatibility with the previous FAT file system, Microsoft provided an automatic way to shorten long filenames using a tilde followed by a number.  If the shortened filename conflicted with another filename, the number would be incremented by one.  For example:\n\nEXAMPLE.DOC &rarr; EXAMPLE.DOC\nExample.doc &rarr; EXAMPLE.DOC\nSample File.doc &rarr; SAMPLE~1.DOC\nSample File copy.doc &rarr; SAMPLE~2.DOC\nVerylongfilename.txt &rarr; VERYLO~1.TXT\n\nNOTE: While Windows, macOS, and Unix have supported long filenames for over two decades, a filename may still be truncated if the file is copied or edited by a Windows system using the FAT file system."
        ]
    },
    {
        "word": "LIFO",
        "type": [],
        "definition": [
            "Stands for \"Last In, First Out.\"  LIFO is a method of processing data in which the last items entered are the first to be removed.  This is the opposite of LIFO is FIFO (First In, First Out), in which items are removed in the order they have been entered.\nTo better understand LIFO, imagine stacking a deck of cards by placing one card on top of the other, starting from the bottom.  Once the deck has been fully stacked, you begin to remove the cards, starting from the top.  This process is an example of the LIFO method, because the last cards to be placed on the deck are the first ones to be removed.\nThe LIFO method is sometimes used by computers when extracting data from an array or data buffer.  When a program needs to access the most recent information entered, it will use the LIFO method.  When information needs to be retrieved in the order it was entered, the FIFO method is used."
        ]
    },
    {
        "word": "LISTSERV",
        "type": [],
        "definition": [
            "LISTSERV is a mailing list program that was popular in the early days of the Internet.  It was developed by Eric Thomas in 1985 but was not widely released until he made several revisions to make message distribution more efficient.  The \"Revised LISTSERV\" program was released in June 1986.  It soon became the standard mailing list tool for BITNET, a network of United States universities.\nSimplicity and automation were the main reasons LISTSERV grew in popularity.  For example, it works over standard email, meaning you do not need special software to use the service.  It allows you to subscribe and unsubscribe by simply sending an email to the correct email address.  Once you subscribe to a LISTSERV list, you can send messages to all other members and receive messages from everyone who is subscribed to the list.  Subscriptions and message distribution are handled automatically by the LISTSERV program.\nLISTSERV provided an efficient medium for group discussions years before social media was available.  But as email evolved, so did mailing lists.  Over the years, more complex mass mailing systems have largely taken the place of LISTSERV.  Even so, several universities still maintain LISTSERV servers, many of which have tens of thousands of subscribers.\nNOTE: \"LISTSERV\" is sometimes used synonymously with \"mailing list,\" but they are not the same thing.  LISTSERV is a program that provides automated mailing list functionality.  Many other mailing list programs and services besides LISTSERV are also available."
        ]
    },
    {
        "word": "LPI",
        "type": [],
        "definition": [
            "Stands for \"Lines Per Inch.\"  LPI is used to measure the resolution of images printed in halftones.  Because halftone images are printed as a series of dots, the higher the LPI number, the more dense the dots can be, resulting in a finer resolution.\nNewspapers are typically printed in a resolution of 85 lpi, while magazines may use 133 lpi or higher.  Because the naked eye can distinguish halftone dots up to about 120 lpi, you are more likely to notice the dots in newspaper print than in magazines.  Of course, if you look closely enough, you may be able to see the dots in images printed in 150 lpi or more.  But, in normal viewing, it is natural to see the dots as a continuous image even at 85 lpi."
        ]
    },
    {
        "word": "LTE",
        "type": [],
        "definition": [
            "Stands for \"Long Term Evolution.\"  LTE is a 4G telecommunications standard used for transferring data over cellular networks.  It supports data transfer rates of up to 100 Mbps downstream and 50 Mbps upstream.\nWhile the terms \"4G\" and \"LTE\" are often used synonymously, LTE is actually a subset of 4G technologies.  Other 4G standards include Mobile WiMAX (IEEE 802.16e) and WirelessMAN-Advanced (IEEE 802.16m).  However, since LTE was designed to be an international telelcommunications standard, it has been widely adopted by the United States and several countries in Europe and Asia.  Therefore, LTE is by far the most common 4G standard.\nIn order to use LTE, you must have an LTE-compatible device, such as a smartphone, tablet, or USB dongle that provides wireless access for a laptop.  When LTE first became available in 2009, most devices did not yet support the technology.  However, most major cellular provides now offer LTE and therefore most phones and other mobile devices are now LTE-compatible.  Many devices, such as iPhones and iPad will display the letters \"LTE\" in the status bar at the top of the screen when you are connected to an LTE network.  If \"4G\" is displayed instead, LTE may not be available in your area.\nNOTE: LTE may also refer to LTE Advanced, a newer version of LTE that supports peak download speeds of 1 GBps and upload speeds of 500 Mbps (10x the speeds of standard LTE)."
        ]
    },
    {
        "word": "LUN",
        "type": [],
        "definition": [
            "Stands for \"Logical Unit Number.\"  LUNs are used to identify SCSI devices, such as external hard drives, connected to a computer.  Each device is assigned a LUN, from 0 to 7, which serves as the device's unique address.\nLUNs can also be used for identifying virtual hard disk partitions, which are used in RAID configurations.  For example, a single hard drive may be partitioned into multiple volumes.  Each volume can then be assigned a unique LUN.  However, few modern computers use LUNs, since SCSI devices have mostly been replaced by USB and Firewire devices."
        ]
    },
    {
        "word": "Lag",
        "type": [],
        "definition": [
            "Lag is a slow response from a computer.  It can describe any device that responds slower than expected, though it is most often used in online gaming.\nVideo game lag is generally caused by one of two factors:\n\nA slow computer\nA slow Internet connection\n\nIf you are playing an online multiplayer game and your computer cannot process the incoming data in realtime, it may slow the game down for everyone.  If your Internet connection is slow or inconsistent (which often happens with shared wireless connections), your system may not send and receive data quickly enough to keep up with other players.  The lag may result in choppy frame rates and cause a delay between your input and what happens on the screen.\nIn an ideal world, all online gamers would have fast computers and Internet connections.  In reality, players have a wide range of computer systems and Internet connection speeds.  Therefore, game developers must account for lag in multiplayer games.  One method is to use a central game server that makes sure one player's lag only affects the individual with the slow computer or Internet connection.  It prevents players with high-quality gaming setups from being negatively affected by users with slow systems.\nIn some cases, a player with a high lag will be booted from a multiplayer game.  For example, in StarCraft 2, if a player's system is not responding, a message will appear on the player's screen that says, \"Waiting for Server.\"  Other players in the game will see a message that says \"Waiting for player: [player name].\"  If the lag is too high, the server will eventually boot the lagging player from the game.\nLag vs Latency\nThe terms \"lag\" and \"latency\" are sometimes interchangeable since they often refer to the same thing.  However, latency is a more technical term, usually quantified by a specific amount.  For example, the latency of a player's network connection may be equal to the ping response time between his computer and the server.  High latency (over 120 ms, for example) can produce noticeable lag.\nNOTE: \"Lag\" can also be used as a verb.  For example, a player that is \"lagging\" may be slowing down the game."
        ]
    },
    {
        "word": "Landing Page",
        "type": [],
        "definition": [
            "A landing page is an informational or promotional webpage a user \"lands on\" after clicking a link.  Most online advertisements link to a landing page that corresponds with the content of the ad.\nLanding pages often have a simple design and a primary call to action, such as \"Learn More,\" \"Download Now,\" or \"Buy Today.\"  The goal is to minimize distractions and guide the user to take a specific step.  Some landing pages use the associated website template, while others may have a completely different design.  They may be integrated into a website or published as \"standalone\" pages that do not link back to the primary site.\nExamples of landing page entry points include:\n\nA sponsored search result\nA link in a marketing email\nA link in a YouTube video\nA button in an app, such as \"Upgrade Now\"\nA promotional URL in a physical mailing\n\nLanding pages commonly include analytics code for tracking and marketing purposes.  The analytics data may include things like source\/referrer, IP address, platform, and link clicks.  These metrics help marketers determine how effective each landing page is and can be used for remarketing purposes, such as customizing ads for repeat visitors."
        ]
    },
    {
        "word": "Laptop",
        "type": [],
        "definition": [
            "Laptop computers, also known as notebooks, are portable computers that you can take with you and use in different environments.  They include a screen, keyboard, and a trackpad or trackball, which serves as the mouse.  Because laptops are meant to be used on the go, they have a battery which allows them to operate without being plugged into a power outlet.  Laptops also include a power adapter that allows them to use power from an outlet and recharges the battery.\nWhile portable computers used to be significantly slower and less capable than desktop computers, advances in manufacturing technology have enabled laptops to perform nearly as well as their desktop counterparts.  In fact, high-end laptops often perform better than low or even mid-range desktop systems.  Most laptops also include several I\/O ports, such as USB ports, that allow standard keyboards and mice to be used with the laptop.  Modern laptops often include a wireless networking adapter as well, allowing users to access the Internet without requiring any wires.\nWhile laptops can be powerful and convenient, the convenience often comes at a price.  Most laptops cost several hundred dollars more than a similarly equipped desktop model with a monitor, keyboard, and mouse.  Furthermore, working long hours on a laptop with a small screen and keyboard may be more fatiguing than working on a desktop system.  Therefore, if portability is not a requirement for your computer, you may find better value in a desktop model."
        ]
    },
    {
        "word": "Laser Printer",
        "type": [],
        "definition": [
            "A laser printer is a printer that uses a focused beam or light to transfer text and images onto paper.  Though contrary to popular belief, the laser does not actually burn the images onto the paper.  Instead, as paper passes through the printer, the laser beam fires at the surface of a cylindrical drum called a photoreceptor.  This drum has an electrical charge (typically positive), that is reversed in areas where the laser beam hits it.  By reversing the charge in certain areas of the drum, the laser beam can print patterns (such as text and pictures) onto the photoreceptor.\nOnce the pattern has been created on the drum, it is coated with toner from a toner cartridge.  The toner is black in most cartridges, but may be cyan, magenta, and yellow in color laser printers.  The positively charged toner clings to areas of the drum that have been negatively charged by the laser.  When the paper passes through the printer, the drum is given a strong negative charge, which allows the toner to transfer and stick to the paper.  The result is a clean copy of the image written on the paper.\nBecause laser printers do not use ink, they have less image smearing problems than inkjet printers and are able to print pages faster.  While laser printers and toner cartridges typically cost more than inkjet printers and ink cartridges, most laser toner cartridges last several times longer than ink cartridges, which makes their cost per page about equal.  For this reason, businesses tend to use laser printers, while consumers are more likely to use inkjet printers.  Laser printers typically have a resolution of 600 dpi (dots per inch) or higher."
        ]
    },
    {
        "word": "Latency",
        "type": [],
        "definition": [
            "In computing, \"latency\" describes some type of delay.  It typically refers to delays in transmitting or processing data, which can be caused by a wide variety of reasons.  Two examples of latency are network latency and disk latency, which are explained below.\n1. Network latency\nNetwork latency describes a delay that takes place during communication over a network (including the Internet).  For example, a slow router may cause a delay of a few milliseconds when one system on a LAN tries to connect to another through the router.  A more noticeable delay may happen if two computers from different continents are communicating over the Internet.  There may be a delay in simply establishing the connection because of the distance and number of \"hops\" involved in making the connection.  The \"ping\" response time is a good indicator of the latency in this situation.\n2. Disk latency\nDisk latency is the delay between the time data is requested from a storage device and when the data starts being returned.  Factors that affect disk latency include the rotational latency (of a hard drive) and the seek time.  A hard drive with a rotational speed of 5400 RPM, for example, will have almost twice the rotational latency of a drive that rotates at 10,000 RPM.  The seek time, which involves the physical movement of the drive head to read or write data, can also increase latency.  Disk latency is why reading or writing large numbers of files is typically much slower than reading or writing a single contiguous file.  Since SSDs do not rotate like traditional HDDs, they have much lower latency.\nOther types of latency\nMany other types of latency exist, such as RAM latency (a.k.a. \"CAS latency\"), CPU latency, audio latency, and video latency.  The common thread between all of these is some type of bottleneck that results in a delay.  In the computing world, these delays are usually only a few milliseconds, but they can add up to create noticeable slowdowns in performance.\nNOTE: It is important to not confuse latency with other measurements like data transfer rate or bandwidth.  Latency refers to the delay before the data transfer starts rather than the speed of the transfer itself."
        ]
    },
    {
        "word": "Lazy Loading",
        "type": [],
        "definition": [
            "Lazy loading is a programming technique that delays loading resources until they are needed.  A common example is a webpage that defers loading images until the user scrolls to their location within the page.  Lazy loading is used on the web and in software programs, such as mobile and desktop applications.\nLazy Loading on the Web\nLazy loading images within a webpage can speed up the load time since the browser does not need to load images that are not visible.  As the user scrolls through the page, the images are loaded dynamically.  This is accomplished using JavaScript that detects the position of each image and determines if it is in the browser window's viewable area.  If the user scrolls down to an image, the JavaScript will request the resource from the web server and display the image on the page.  If the user does not scroll down, the image will not load.\nIt is possible to delay the loading of other resources, such as  JavaScript files, CSS, and even the HTML itself.  For example, a web developer might determine which CSS styles are needed for  \"above-the-fold\" content on a webpage, or content viewable within the height of a typical browser window.  The developer can implement these as \"inline styles,\" or styles defined within the HTML of the webpage.  JavaScript is used to load additional CSS after the page has loaded or once the user starts scrolling.\nLazy loading video is also popular on the web.  It is especially effective since video files are typically the largest resources loaded within a webpage.  Instead of sending the entire video to a client's device, the web server only sends small portions of the video while the user is watching it.  Popular video sharing websites like YouTube and Vimeo use lazy loading to reduce bandwidth and to prevent users from downloading more video content than necessary.  This is especially helpful for users with metered Internet connections, such as mobile data plans.\nWhen lazy loading a video, it is common to load a few seconds or even several minutes ahead of the current point in the video.  The video data is saved in a buffer, which helps videos play smoothly even when the Internet connection is not consistent.\nLazy Loading in Software Programs\nWhile lazy loading has become increasingly popular on the web, it has been used in software development for a long time.  For example, an operating system may only display thumbnail images for the visible icons in a folder.  Similarly, an image viewing program may only load the visible images in a photo library.  This uses less memory and improves application performance because the program does not load unnecessary data."
        ]
    },
    {
        "word": "Lead",
        "type": [],
        "definition": [
            "Lead (pronounced \"leed\") is a marketing term that describes a connection made with a potential customer or client.  The goal of most online advertising is to generate leads, which may \"lead\" to sales or subscriptions for a company or organization.\nThe process of creating leads on the Internet is called online lead generation.  This can be accomplished by running ads through a service like Google AdWords or Bing Ads or by directly purchasing advertising space on other websites.  Advertisers can choose to run either CPC (cost per click) or CPA (cost per action) ads, which can both generate leads.  While CPA and CPL (cost per lead) are often used interchangeably, CPL specifically measures lead generations, rather than aggregate clicks or sales.\nA typical online lead is created when a user fills out and submits a form on a website.  The number of fields required depends on the type of lead.  For example, an automotive dealer website may provide an online form for interested buyers.  The form may request your name, email address, physical address, phone number, and best time to reach you.  Other forms are more basic and only capture an email address.  These types of leads are often created when you sign up for a newsletter or download a software program.  Whatever information is captured in a lead can be used to contact you at a later time for marketing purposes."
        ]
    },
    {
        "word": "Leaderboard",
        "type": [],
        "definition": [
            "As the average computer screen size has grown larger, the size of online advertisements as grown as well.  The leaderboard ad, which was introduced in 2003, has a standard size of 728 pixels wide by 90 pixels tall (728x90).  Compare that to its predecessor, the banner ad, which is 468 pixels wide by 60 pixels tall (468x60).\nLeaderboards can contain text, images, or even animations.  When a visitor clicks on a leaderboard, he or she is directed to the advertiser's website.  While leaderboards are larger than the original banner ads, most Web developers have found ways to incorporate the ads in ways that are not too distracting to the user."
        ]
    },
    {
        "word": "Leading",
        "type": [],
        "definition": [
            "Leading is a typography term that describes the distance between each line of text.  It is pronounced ledding (like \"sledding\" without the \"s\").  The name comes from a time when typesetting was done by hand and pieces of lead were used to separate the lines.\nToday, leading is often used synonymously with \"line height\" or \"line spacing.\"  Sometimes the terms have the same meaning, while in some applications, the implementation is different.  Font leading is a setting commonly found in graphic design programs, while word processors typically use line spacing.  Leading is typically measured in pixels, while line spacing is measured as a ratio of the default line height.\nIn manual typesetting, leading defined the distance between each line (the width of the lead).  However, modern applications often calculate leading as the font size plus the space above a line of text.  In Photoshop, for example, the default leading or \"Auto\" setting for a 40px font is roughly 50px (125% of 40px).  The extra ten pixels provides decent padding between each row of text, which makes it more readable.  If the default leading is too much or too little, it be modified using the Leading setting in Photoshop's Character palette.\nMost text editors use a default line spacing of 120 to 130% of the font size.  A line spacing setting or 1.2, for example, is common in many word processors.  However, this can be adjusted to another setting, such as 1.5 or 2.0, to add extra spacing between the lines.  If leading or line spacing is reduced below the default setting (such as a leading of 20px for a 40px font), the lines may overlap.\nNOTE: Leading is generally calculated from the baseline of a font (the bottom of a lowercase \"a\") to the baseline of the row above it.  However some programs add more vertical padding to each line than others.  Therefore, different programs may produce different line heights with the same leading size."
        ]
    },
    {
        "word": "Leaf",
        "type": [],
        "definition": [
            "What does a computer's hard disk have in common with a tall oak?  While it may not look like a tree on the outside, the hard disk is organized the same way.  Directories of files and folders on a hard drive are organized into branches, where each directory is a branch with files and folders.  Folders make up the branches, while files are the leaves.  Therefore a leaf is a file within a directory on your hard drive.\nTechnically speaking, a leaf is a node on a tree with no child nodes.  Because files cannot have child nodes like folders can, they are always leafs.  When referring to a tree structure, a leaf can also be called a leaf node."
        ]
    },
    {
        "word": "Leet",
        "type": [],
        "definition": [
            "Leet, or leetspeak, is a method of typing words using alternate characters.  Letters are replaced with numbers or symbols that closely resemble them.  For example, the letter \"a\" might be replaced with the @ symbol and the letter \"E\" might be replaced with the number 3.  The word \"leet\" can be written as \"1337.\"\nSome letters have obvious numeric alternatives, such as \"8\" for \"B\" and \"5\" for \"S.\"  Other characters are easily replaced by special characters.  For example, \"ƒ\" can be used for \"f\" and \"µ\" may be used for \"u.\"  In cases where no obvious substitution is available, multiple characters may be used.  For example, \"\\\/\" can replace \"V\" and \"|)\" can replace \"D.\"\nMost letters have more than one possible leet replacement, so there is no standard way to write words in leetspeak.  Additionally, font case is interchangeable.  Leet words often contain a combination of lowercase and uppercase characters.  In some cases, letters may be omitted or changed to something similar, such as \"z\" for the letter \"s.\"\nThe word \"computer\" can be written in leetspeak several different ways.  Below are a few examples:\n\nCøM9µ†3r\nc0m¶uT€R\n¢o^^püt&r\nçOm|°|_|7e®\nÇ[]\/\\\/\\pÜ+é\/I2\n\nWhile there is no correct way to write words in leetspeak, they should be easy to decipher.\nLeet has no official use, though it is commonly associated with the computing elite (3l33t) and hackers (h@ck0rz).  It is often used just for fun, though it can also be used to intimidate newbies (n00bs) in web forums or online chatrooms.  Some users type questionable words in leetspeak to bypass word filters in online games or discussions.\nNOTE: You can view a list of common leet translations from the PC.net Leet Sheet."
        ]
    },
    {
        "word": "Left-Click",
        "type": [],
        "definition": [
            "A left-click involves clicking the left mouse button.  Typically, \"left-clicking\" means the same thing as just \"clicking\" since the left mouse button is the primary button by default.  The term \"left-click\" is most often used in contrast to \"right-click,\" which involves clicking the secondary button on the right side of the mouse.\nLeft-clicking is used for many common computer tasks, such as selecting objects, opening hyperlinks, and closing windows.  Clicking and holding the left mouse button can be used to select text or perform drag and drop operations.  In video games, left-clicking is typically used to perform the primary action, such as moving a character or firing a weapon.\nFor right-handed users, the left-click is the most natural click, since it is done with the index finger.  For people that use a mouse with their left hand, it is a bit less natural since left-clicking is done with the middle finger and the index finger is used for right-clicking.  Therefore, Mac OS X and Windows allow you to switch the primary mouse button from left to right.\nNOTE: Double-clicking is simply two left-clicks in rapid sequence."
        ]
    },
    {
        "word": "Leopard",
        "type": [],
        "definition": [
            "Leopard is another name for Mac OS X 10.5, which was released on October 26, 2007.  It followed Mac OS X 10.4 Tiger and preceded the release of Mac OS X 10.6 Snow Leopard.\nMac OS X Leopard was one of the most significant updates to Mac OS X, with over 300 new features.  Some of the most notable additions include Time Machine (an automated backup solution), Spaces (a virtual desktop environment), and Quick Look (a feature that allows many file types to be viewed directly in the Finder by pressing space bar.  Leopard was also the first version of Mac OS X to include Boot Camp, a feature that allows you to run Windows on your Mac.\nBesides the above features, Leopard also provided several enhancements to existing Mac OS X software.  For example, RSS feed support was added to Mail, advanced photo filters were added to Photo Booth, and the Spotlight search feature added support for boolean operators.  Leopard also shipped with Safari 3, the third major release of Apple's web browser.\nThe final Leopard software update was 10.5.8, released on August 5, 2009."
        ]
    },
    {
        "word": "LiDAR",
        "type": [],
        "definition": [
            "Stands for \"Light Detection and Ranging.\"  LiDAR is a distance detection technology that uses pulses of light to detect surrounding objects.  A LiDAR scanner determines the distance of each object by calculating the time each pulse takes to reflect back to the source.  Using multiple light pulses, it can generate a 3D depth map of the scanned area.\nLiDAR was originally used for terrain mapping purposes, such as creating topographical images of the earth's surface.  High-powered LiDAR units on drones and other aircraft can scan large areas at once.  Combining LiDAR and GPS data makes it possible to generate three-dimensional maps of scanned locations.\nIn recent years, LiDAR has made its way to everyday devices, including automobiles and smartphones.\nAutomotive LiDAR\nModern cars and trucks use LiDAR to detect surrounding vehicles and other objects.  Short-range LiDAR (under 50 meters) provides features like blind spot detection and park assist.  Long-range LiDAR (up to 200 meters) enables features like adaptive cruise control and automatic emergency braking.\nLiDAR scanners do not capture color data.  Therefore, autonomous vehicles combine LiDAR and video camera data to detect and identify surrounding objects.\nSmartphone LiDAR\nModern high-end smartphones, such as the iPhone 12 Pro and later, include short-range LiDAR.  The depth-sensing technology improves photo quality and provides augmented reality (AR) features.  For example, when taking a photo, LiDAR helps the phone detect and focus on the primary objects in the frame.  When using AR technology, such as Snapchat filters, LiDAR improves face detection, providing smoother and more accurate mapping.\nNOTE: While Apple's FaceID employs 3D imaging to detect faces, it uses infrared technology rather than LiDAR."
        ]
    },
    {
        "word": "Lightning",
        "type": [],
        "definition": [
            "Lightning is a proprietary I\/O interface designed by Apple for its mobile devices, such as the iPhone, iPad, and iPod.  It was first introduced in September, 2012, with the iPhone 5 and new iPod models.  It was later added to iPads, beginning with the 4th generation iPad and the first generation iPad mini.  The Lightning interface replaced the the previous \"dock connector,\" which Apple products used since 2003.\nThe Lightning connector has eight pins and is about one third the size of the 30-pin dock connector it supersedes.  Instead of having mobile latches on the sides, the Lightning connector has small divots on each side that allow it to snap into place.  Even without magnets or clips, the Lightning connection is designed to be strong enough to hold a device upside down by the cable without the cable detaching.\nUnlike most other I\/O interfaces, such as USB, Firewire, and the previous dock connector, the Lightning connector is reversible.  The connection is fully symmetrical and the connector can be inserted either way into a Lightning port.  This means it is impossible to insert the cable upside down, which makes it easier to plug in and reduces wear and tear on the interface.  The order of the pins are recognized dynamically by the device when the connection is made, allowing power and data to flow through the correct channels.\nThe name \"Lightning\" is correlated with Thunderbolt, another I\/O port Apple began using around the same time the Lightning interface was introduced.  However, unlike Thunderbolt, Lightning is proprietary and is only used in Apple products.  While most mobile devices (such as Android phones) have standard mini-USB or micro-USB ports, if you have an Apple device, you will need a Lightning cable to charge it and transfer data."
        ]
    },
    {
        "word": "Link",
        "type": [],
        "definition": [
            "A link (short for hyperlink) is an HTML object that allows you to jump to a new location when you click or tap it.  Links are found on almost every webpage and provide a simple means of navigating between pages on the web.\nLinks can be attached to text, images, or other HTML elements.  Most text links are blue since that is the standard color web browsers use to display links.  However, links can be any color since the style of the link text may be customized using HTML or CSS styles.  In the early days of the web, links were underlined by default.  Today, underlining links is less common.\nWhen a link is applied to an image, the link tag encapsulates, or surrounds the image tag.  Since the image tag is nested inside the link tag, the image itself becomes a link.  This method can be used to apply links to other elements such as &lt;div&gt; and &lt;span&gt; objects.  However, since CSS can be used to stylize a link, an &lt;a&gt; tag with a CSS class or ID attribute is often used in place of a &lt;div&gt; or &lt;span&gt; tag.\nBelow is an example of the HTML for a text and image link:\nText Link: &lt;a href=\"\/definition\/computer\"&gt;Computer Definition&lt;\/a&gt;\nImage Link: &lt;a href=\"https:\/\/techterms.com\/definition\/computer\"&gt;&lt;img src=\"\/images\/computer.jpg\" alt=\"desktop PC\"&gt;&lt;\/a&gt;\nRelative and Absolute Links\nThe first link above is a \"relative link\" because it does not include the domain name.  Instead, the link is relative to the current website.  Any internal link on TechTerms.com, for example, does not need \"https:\/\/techterms.com\/\" in the source.  Rather, a relative link like \"\/definition\/computer\" is all that is required.  Since the link starts with a forward slash, the path begins with the root directory.  If a relative link does not start with a forward slash, the path is relative to the current URL.\nThe second link above is an absolute link because it includes the domain name.  Absolute links are required for external links, which direct you to another website.  They may begin with \"http\" or \"https.\"  Absolute links may also begin with two forward slashes (\"\/\/\").  This is interpreted as \"http:\/\/\" for pages served via HTTP and \"https:\/\/\" for pages served via HTTPS.\nNOTE: The \"a\" in the &lt;a&gt; tag stands for \"anchor,\" since early hypertext documents often linked to anchors (or markers) within a page rather than other pages.  The \"href\" within an &lt;a&gt; stands for \"hypertext reference.\""
        ]
    },
    {
        "word": "LinkedIn",
        "type": [],
        "definition": [
            "LinkedIn is a social networking website designed for business professionals.  It allows you to share work-related information with other users and keep an online list of professional contacts.\nLike Facebook and MySpace, LinkedIn allows you to create a custom profile.  However, profiles created within LinkedIn are business-oriented rather than personal.  For example, a LinkedIn profile highlights education and past work experience, which makes it appear similar to a resume.  Profiles also list your connections to other LinkedIn users, as well as recommendations you make or receive from other users.\nBy using LinkedIn, you can keep in touch with past and current colleagues, which can be useful in today's ever-changing work environment.  You can also connect with new people when looking for potential business partners.  While people outside your personal network cannot view your full profile, they can still view a snapshot of your education and work experience.  They can also contact you using LinkedIn's anonymous \"InMail\" messaging service, which could lead to new job opportunities.\nLinkedIn has several benefits for business professionals, which is why it is used by millions of people across the world.  Just remember, if you decide to create a LinkedIn profile, keep your information professional.  It's best to save your personal information for the other social networking websites."
        ]
    },
    {
        "word": "Linux",
        "type": [],
        "definition": [
            "Linux (pronounced \"lih-nux\", not \"lie-nux\") is a Unix-like operating system (OS) created by Linus Torvalds. He developed Linux because he wasn't happy with the currently available options in Unix and felt he could improve it.  So he did what anybody else would do and created his own operating system.\nWhen Linus finished building a working version of Linux, he freely distributed the OS, which helped it gain popularity.  Today, Linux is used by millions of people around the world.  Many computer hobbyists (a.k.a. nerds) like the operating system because it is highly customizable.  Programmers can even modify the source code and create their own unique version of the Linux operating system.\nWeb hosting companies often install Linux on their Web servers because Linux-based servers are cheaper to set up and maintain than Windows-based servers.  Since the Linux OS is freely distributed, there are no licensing fees.  This means Linux servers can host hundreds or even thousands of websites at no additional cost.  Windows servers, on the other hand, often require user licenses for each website hosted on the server.\nLinux is available in several distributions.  Some of the most popular distributions include Red Hat Enterprise, CentOS, Debian, openSUSE, and Ubuntu.  Linux also supports several hardware platforms, including Intel, PowerPC, DEC Alpha, Sun Sparc, and Motorola.  Since Linux is compatible with so many types of hardware, variations of the Linux operating system are used for several other electronic devices besides computers.  Some examples include cell phones, cable boxes, and Sony's PS2 and PS3 gaming consoles."
        ]
    },
    {
        "word": "Lion",
        "type": [],
        "definition": [
            "Lion is another name for Mac OS X 10.7, the eighth version of Apple's desktop operating system.  It was released on July 20, 2011, almost two years after Mac OS X 10.6 Snow Leopard and preceded the release of Mac OS X 10.8 Mountain Lion.  Lion was the first version of Mac OS X to be released on the Mac App Store and was not sold on a DVD like previous versions of the operating system.\nMac OS X 10.7 Lion was one of the most substantial updates to Mac OS X and included more than 250 new features.  Most notably, Lion added several features from iOS, Apple's mobile operating system that runs on the iPhone and iPad.  For example, Lion supported several new multi-touch gestures, such as swiping to switch between applications and to navigate between webpages.  Additionally, the user interface was updated to look more like the iOS, with hidden scroll bars and a bouncing animation when you scroll past the top or bottom of a page. \nIn an effort to make Mac OS X 10.7 more like iOS, Apple also introduced system-wide support for full-screen apps, which hides the menu bar and allows the current application to fill the entire screen.  Several of Apple's own applications including Safari, Mail, iPhoto, and Pages, were updated with full-screen support when Lion was released and many third party applications were updated shortly after.  Lion also introduced \"Launchpad\" (similar to the Launcher included with early versions of the Mac OS), which provides one-click access to all programs installed in the Applications folder.  Finally, Lion added a \"Resume\" feature that saves the state of open windows in applications, so they reappear automatically when you reopen a program or restart your computer.\nThe last Lion software update was 10.7.5, released on October 4, 2012."
        ]
    },
    {
        "word": "Live Streaming",
        "type": [],
        "definition": [
            "Live streaming is a type of streaming in which audio or video is broadcast live over the Internet.  The media is transmitted while it is recorded, allowing viewers to watch or listen to it in real-time.\nMost live streams are delivered via multicasting.  Unlike a television broadcast, a multicast only transmits the media to users who choose to watch or listen to the stream.  Multiple users can \"tune in\" to a single stream, providing an efficient way of delivering the audio or video to several locations at once.\nLive Streaming Platforms\nTwitch is a popular live streaming platform, which is mainly used by gamers to stream their games live over the Internet.  It is also to broadcast live eSports events.  Personal streaming platforms, such as Periscope and Facebook Live allow users to live stream video from their smartphones.  YouTube Live allows YouTube users to share videos in real-time via live streaming.\nStreaming vs Live Streaming\nThe terms \"streaming\" and \"live streaming\" are often used interchangeably, but they have different meanings.  Streaming is delivering media over the Internet that can be played while it is downloaded.  Live streaming is a specific type of streaming that is broadcast at the same time it is recorded.\nAn easy way to check if you are watching a live stream is to see if the video has a defined length.  If there is no end to the video and you can't jump ahead in the video, you are most likely watching a live stream.  Most live streams also display a \"Live\" indicator somewhere in the interface.  However, previously-recorded videos may have a \"Live\" icon overlaid on the video, which can be misleading.\nNOTE: Most live streaming platforms provide a live chat interface alongside the video.  This feature allows users watching the video to comment or react to the video in real-time."
        ]
    },
    {
        "word": "Load Balancing",
        "type": [],
        "definition": [
            "Computer networks are complex systems, often routing hundreds, thousands, or even millions of data packets every second.  Therefore, in order for networks to handle large amounts of data, it is important that the data is routed efficiently.  For example, if there are ten routers within a network and two of them are doing 95% of the work, the network is not running very efficiently.  The network would run much faster if each router was handling about 10% of the traffic.  Likewise, if a website gets thousands of hits every second, it is more efficient to split the traffic between multiple Web servers than to rely on a single server to handle the full load.\nLoad balancing helps make networks more efficient.  It distributes the processing and traffic evenly across a network, making sure no single device is overwhelmed.  Web servers, as in the example above, often use load balancing to evenly split the traffic load among several different servers.  This allows them to use the available bandwidth more effectively, and therefore provides faster access to the websites they host.\nWhether load balancing is done on a local network or a large Web server, it requires hardware or software that divides incoming traffic among the available servers.  Networks that receive high amounts of traffic may even have one or more servers dedicated to balancing the load among the other servers and devices in the network.  These servers are often called (not surprisingly) load balancers.\nClusters, or mulitple computers that work together, also use load balancing to spread out processing jobs among the available systems."
        ]
    },
    {
        "word": "Localhost",
        "type": [],
        "definition": [
            "\"Localhost\" refers to the local computer that a program is running on.  For example, if you are running a Web browser on your computer, your computer is considered to be the \"localhost.\"  While this does not need to be specified when using a single computer, the localhost does need to be defined when running programs from multiple computers.  For example, a network administrator might use his local machine to start a Web server on one system and use a remote access program on another.  These programs would run from computers other than the localhost.\nIn the example above, the two non-local computers must be defined by their IP addresses.  The local machine is defined as \"localhost,\" which gives it an IP address of 127.0.0.1.  This is considered a \"loopback\" address because the information sent to it is routed back to the local machine.  Localhost is often used in Web scripting languages like PHP and ASP when defining what server the code should run from or where a database is located."
        ]
    },
    {
        "word": "Localization",
        "type": [],
        "definition": [
            "Localization is the process of adapting a product for a specific region and language.  It may include several steps, but the most common is language translation.  In the context of IT, localization typically applies to software and websites.\nSoftware Localization\nSoftware localization involves translating all user interface elements into a specific language.  Translated items include menu items, buttons, instructions, help documentation, and templates.  Each localized element has an ID instead of a single text string, which is associated with multiple translations.  When the user installs a localized app, the installer detects the system language and loads the correct text string for each ID.\nLocalized apps often provide a way to override the system language.  You may find this option by opening the Preferences window and clicking the Language option.\nLocalizing an app can provide developers with new markets where English is not the primary language.  Even in countries where most people speak English, users generally prefer to use apps in their native language.  While large developers such as Microsoft and Apple translate software into dozens of languages, smaller developers may limit translations to the most widely-used.  Some examples include:\n\nSpanish\nFrench\nGerman\nChinese\nJapanese\n\nWebsite Localization\nThe \"World Wide Web\" is accessible by people around the world and not everybody speaks English.  Therefore, websites with a high number of international visitors may offer content translated in multiple languages.  Similar to software programs, websites can detect the user's system language (or browser language setting) and display the corresponding translation.  Some websites have a language option (often at the top or bottom of each page) that allows users to select their preferred language from a list.\nNo matter how localization is performed from a technical standpoint, the quality is only as good as the translations themselves.  Therefore, large web publishers and software companies work with reputable translation companies to provide accurate localized content.\nNOTE: If a website does not offer a translation in your language, you may be able to use your browser's built-in translate feature (such as Google Chrome's \"Translate this page\" option).  Automatic webpage translation may not be as accurate as manually translated content, but it can help you understand the text."
        ]
    },
    {
        "word": "Log File",
        "type": [],
        "definition": [
            "A log file is a file that contains a list of events, which have been \"logged\" by a computer.  Log files are often generated during software installations and are created by Web servers, but they can be used for many other purposes as well.  Most log files are saved in a plain text format, which minimizes their file size and allows them to be viewed in a basic text editor.\nLog files created by software installers typically contain a list of files that were added or copied to the hard drive during the installation process.  They may also include the date and time the files were installed, as well as the directory where each file was placed.  Installer log files allow users to see exactly what files were installed on their system by a specific program.  This may be useful when troubleshooting program crashes or when uninstalling a program.\nWeb servers use log files to record data about website visitors.  This information typically includes the IP address of each visitor, the time of the visit, and the pages visited.  The log file may also keep track of what resources were loaded during each visit, such as images, JavaScript, or CSS files.  This data can be processed by website statistics software, which can display the information in a user-friendly format.  For example, a user may be able to view a graph of daily visitors during the past month and click on each day to view more detailed information.\nLog files may also be generated by software utilities, FTP programs, and operating systems.  For example, Mac OS X saves a log of all program and system crashes, which can be viewed using the built-in Console application.  Windows records application, security, and system logs, which can all be viewed using the included Event Viewer program.  Most log files have a \".log\" file extension, but many use the standard \".txt\" extension or another proprietary extension instead.\nFile Extension: .LOG"
        ]
    },
    {
        "word": "Log On",
        "type": [],
        "definition": [
            "The verb \"log on\" refers to the process of accessing a secure computer system or website.  When you log on to a system, you provide \"login\" information that authenticates you as a user.  This information typically includes a username and password, though some logins require extra information, such as a PIN number or a correct answer to a security question.\nMost computer systems can be configured to require users to log on before accessing the system.  For example, both Mac and Windows systems can be set up to require all users to enter a username and password each time the computer is restarted or woken up from sleep mode.  Similarly, when you access a remote system through a remoteaccess or FTP connection, you may be required to log on to the system.\nWhen you create an account on a secure website, you are typically required to log on to the site each time you want to access your account information.  Examples include online banking websites, social networking sites like Facebook and LinkedIn, online Web forums, and a variety of other sites.  Any website that allows you to create a unique user account will require you to log on in order to access your personal information.  The only time you may not have to log on to one of these sites is if your login information has been stored in a cookie by your Web browser.\nNOTE: While the terms \"log on\" and \"login\" sound similar, they have separate meanings.  \"Log on\" is a verb and refers to the process of accessing a secure system.  \"Login\" is a noun that refers a user's login information, such as a username and password combination.  However, the phrase \"log in\" (two words) is an acceptable alternative to \"log on,\" and the two terms can be used synonymously."
        ]
    },
    {
        "word": "Logic Error",
        "type": [],
        "definition": [
            "A logic error (or logical error) is a mistake in a program's source code that results in incorrect or unexpected behavior.  It is a type of runtime error that may simply produce the wrong output or may cause a program to crash while running.\nMany different types of programming mistakes can cause logic errors.  For example, assigning a value to the wrong variable may cause a series of unexpected program errors.  Multiplying two numbers instead of adding them together may also produce unwanted results.  Even small typos that do not produce syntax errors may cause logic errors.  In the PHP code example below, the if statement may cause a logic error since the single equal sign (=) should be a double equal sign (==).\nIncorrect:\nif ($i=1) { ... }\nCorrect:\nif ($i==1) { ... }\nIn PHP, \"==\" means \"is equal to,\" while \"=\" means \"becomes.\"  Therefore, the incorrect if statement always returns TRUE, since assigning 1 to the variable $i returns a TRUE value.  In the correct code, the if statement only returns TRUE if $i is equal to 1.  However, since the syntax of the incorrect code is acceptable, it will not produce a syntax error and the code will compile successfully.  The logic error might only be noticed during runtime.  Because logic errors are often hidden in the source code, they are typically harder to find and debug than syntax errors."
        ]
    },
    {
        "word": "Logic Gate",
        "type": [],
        "definition": [
            "Logic gates perform basic logical functions and are the fundamental building blocks of digital integrated circuits.  Most logic gates take an input of two binary values, and output a single value of a 1 or 0.  Some circuits may have only a few logic gates, while others, such as microprocessors, may have millions of them.  There are seven different types of logic gates, which are outlined below.\nIn the following examples, each logic gate except the NOT gate has two inputs, A and B, which can either be 1 (True) or 0 (False).  The resulting output is a single value of 1 if the result is true, or 0 if the result is false.\n\nAND - True if A and B are both True\nOR - True if either A or B are True\nNOT - Inverts value: True if input is False; False if input is True\nXOR - True if either A or B are True, but False if both are True\nNAND - AND followed by NOT: False only if A and B are both True\nNOR - OR followed by NOT: True only if A and B are both False\nXNOR - XOR followed by NOT: True if A and B are both True or both False\n\nBy combining thousands or millions of logic gates, it is possible to perform highly complex operations.  The maximum number of logic gates on an integrated circuit is determined by the size of the chip divided by the size of the logic gates.  Since transistors make up most of the logic gates in computer processors, smaller transistors mean more complex and faster processors."
        ]
    },
    {
        "word": "Login",
        "type": [],
        "definition": [
            "A login is a set of credentials used to authenticate a user.  Most often, these consist of a username and password.  However, a login may include other information, such as a PIN number, passcode, or passphrase.  Some logins require a biometric identifier, such as a fingerprint or retina scan.\nLogins are used by websites, computer applications, and mobile apps.  They are a security measure designed to prevent unauthorized access to confidential data.  When a login fails (i.e, the username and password combination does not match a user account), the user is disallowed access.  Many systems block users from even trying to log in after multiple failed login attempts.\nExamples of logins include:\n\nOperating system login – Windows and Mac systems can be configured to require a login in order to use the computer after it is turned on or woken from sleep mode.  A login may also be required to install software or modify system files.\nWebsite login –  Webmail interfaces, financial websites, and many other sites require a username and password in order to access account information.\nApp store login – App stores like Google Play and Apple's App Store require a login to download mobile apps, music, and other files.\nFTP login – file transfer programs often require a login in order to browse, send, and receive files from an FTP server.\nRouter login – Wired and wireless routers typically require an administrator login to modify the settings.\n\nAt a basic level, logins make user accounts possible.  Most systems require unique usernames, which ensures every user's login is different.  On a more advanced level, logins provide a security layer between unsecured and secure activity.  Once a user logs in to a secure website, for example, all data transfers are typically encrypted.  This prevents other systems from viewing or recording the data transferred from the server.\nNOTE: Login is technically a noun, not a verb.  To enter a username and password is to \"log in,\" \"sign in,\" or \"log on\" (two words)."
        ]
    },
    {
        "word": "Long",
        "type": [],
        "definition": [
            "Long is a data type used in programming languages, such as Java, C++, and C#.  A constant or variable defined as long can store a single 64-bit signed integer.\nSo what constitutes a 64-bit signed integer?  It helps to break down each word, starting from right to left.  An integer is a whole number that does not include a decimal point.  Examples include 1, 99, or 234536.  \"Signed\" means the number can be either positive or negative, since it may be preceded by a minus (-) symbol.  64-bit means the number can store 263 or 18,446,744,073,709,551,616 different values (since one bit is used for the sign).  Because the long data type is signed, the possible integers range from -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807, including 0.\nIn modern programming languages, the standard integer (int) data type typically stores a 32-bit whole number.  Therefore, if a variable or constant may potentially store a number larger than 2,147,483,647 (231 ÷ 2), it should be defined as a long instead of an int.\nNOTE: In standard C, a long integer may be limited to a 32-bit value ranging from -2,147,483,648 to 2,147,483,647."
        ]
    },
    {
        "word": "Loop",
        "type": [],
        "definition": [
            "In computer science, a loop is a programming structure that repeats a sequence of instructions until a specific condition is met.  Programmers use loops to cycle through values, add sums of numbers, repeat functions, and many other things.\nLoops are supported by all modern programming languages, though their implementations and syntax may differ.  Two of the most common types of loops are the while loop and the for loop.\nWhile Loop\nA while loop is the simplest form of a programming loop.  It states that while a condition is valid, keep looping.  In the PHP example below, the while loop will continue until i is equal to num.\n &nbsp; &nbsp;$i = 1;\n &nbsp; &nbsp;$num = 21;\n\n &nbsp; &nbsp;while ($i < $num)&nbsp; \/\/ stop when $i equals $num\n &nbsp; &nbsp;{\n &nbsp; &nbsp; &nbsp; &nbsp;echo \"$i, \";\n &nbsp; &nbsp; &nbsp; &nbsp;$i++; &nbsp; \/\/ increment $i\n &nbsp; &nbsp;}\nIf $i is 1 and $num is 21, the loop will print out 1, 2, 3, 4… etc. all the way to 20.  Then the loop will stop or \"break\" after 20 iterations because the while condition has been met.\nFor Loop\nA for loop is similar to a while loop, but streamlines the source code.  The for loop statement defines the start and end point as well as the increment for each iteration.  Below is the same loop above defined as a while loop.\n &nbsp; &nbsp;$num = 21;\n\n &nbsp; &nbsp;for ($i = 1; $i < $num; $i++)&nbsp; \/\/ stop when $i equals $num\n &nbsp; &nbsp;{\n &nbsp; &nbsp; &nbsp; &nbsp;echo \"$i, \";\n &nbsp; &nbsp;}\nThough for loops and while loops can often be used interchangeably, it often makes more sense to use one over the other.  In most cases, for loops are preferred since they are cleaner and easier to read.  However, in some situations, a while statement can be more efficient.  For instance, the following PHP statement can be used to load all the values from a MySQL result into an array using only one line of code.\n &nbsp; &nbsp;while ($row = mysql_fetch_array($result))\nNOTE: Since loops will repeat until a given specific condition is met, it is important to make sure the loop will break at some point.  If the condition is never met, the loop will continue indefinitely creating an infinite loop.  Writing code that allows infinite loops is bad programming practice, since they can cause programs to crash."
        ]
    },
    {
        "word": "Lossless",
        "type": [],
        "definition": [
            "Lossless compression reduces a file's size with no loss of quality.  This seemingly magical method of reducing file sizes can be applied to both image and audio files.  While JPEGs and MP3s use lossy compression, newer compression algorithms, such as JPEG 2000 and Apple Lossless compression, can be used to create lossless compressed files.\nLossless compression basically rewrites the data of the original file in a more efficient way.  However, because no quality is lost, the resulting files are typically much larger than image and audio files compressed with lossy compression.  For example, a file compressed using lossy compression may be one tenth the size of the original, while lossless compression is unlikely to produce a file smaller than half of the original size."
        ]
    },
    {
        "word": "Lossy",
        "type": [],
        "definition": [
            "Lossy file compression results in lost data and quality from the original version.  Lossy compression is typically associated with image files, such as JPEGs, but can also be used for audio files, like MP3s or AAC files.  The \"lossyness\" of an image file may show up as jagged edges or pixelated areas.  In audio files, the lossyness may produce a watery sound or reduce the dynamic range of the audio.\nBecause lossy compression removes data from the original file, the resulting file often takes up much less disk space than the original.  For example, a JPEG image may reduce an image's file size by more than 80%, with little noticeable effect.  Similarly, a compressed MP3 file may be one tenth the size of the original audio file and may sound almost identical.\nThe keyword here is \"almost.\"  JPEG and MP3 compression both remove data from the original file, which may be noticeable upon close examination.  Both of these compression algorithms allow for various \"quality settings,\" which determine how compressed the file will be.  The quality setting involves a trade-off between quality and file size.  A file that uses greater compression will take up less space, but may not look or sound as good as a less compressed file.  Some image and audio formats allow lossless compression, which does not reduce the file's quality at all."
        ]
    },
    {
        "word": "Low-Level Language",
        "type": [],
        "definition": [
            "A low-level language is a type of programming language that contains basic instructions recognized by a computer.  Unlike high-level languages used by software developers, low-level code is often cryptic and not human-readable.  Two common types of low-level programming languages are assembly language and machine language.\nSoftware programs and scripts are written in high-level languages, like C#, Swift, and PHP.  A software developer can create and edit source code in a high-level language using a programming IDE or even a basic text editor.  However, the code is not recognized directly by the CPU.  Instead, it must be compiled into a low-level language.\nAssembly language is one step closer to a high-level language than machine language.  It includes commands such as MOV (move), ADD (add), and SUB (subtract).  These commands perform basic operations, such as moving values into memory registers and performing calculations.  Assembly language can be converted to the machine language using an assembler.\nMachine language, or machine code, is the lowest level of computer languages.  It contains binary code, often generated by compiling high-level source code for a specific processor.  Most developers never need to edit or even look at machine code.  Only programmers who build software compilers and operating systems need to view machine language."
        ]
    },
    {
        "word": "Lua",
        "type": [],
        "definition": [
            "Lua is a programming language commonly used to extend, or add functionality, to software applications.  It uses simple syntax (similar to C), allowing it to work with a number of other languages.  Lua has a wide array of uses, but it is commonly used as an extension language for web applications and video games.\nLua is a scripting language, since the code can be parsed and run on-the-fly by an interpreter.  However, like Python Lua code can also be compiled into an executable binary file.  Pre-compiling a Lua script with the luac compiler can improve performance, so Lua code is often compiled when it is embedded in an existing program.\nWhile Lua is designed to be simple and portable, it is also a highly capable language.  Lua supports a wide variety of data types, including strings, floating point numbers, and arrays.  It also includes many different operators for performing calculations, comparisons, and logic operations.  Lua also supports functions, loops, and if-then statements.  The language even includes garbage collection for automatic memory management.\nSince Lua is relatively lightweight – meaning it does not use more system resources than necessary – it is an ideal language for performing basic tasks.  For example, a programmer may code a video game in C++, but use Lua to manage the characters and objects within the game.  The simplicity of Lua can make it easier to code individual aspects of a program without the overhead other languages require.\nFile extension: .LUA"
        ]
    }
]