[
    {
        "word": "M1",
        "type": [],
        "definition": [
            "The M1 is the first Apple silicon chip.  Apple launched the M1 in November 2020 with the Mac mini and MacBook Air.\nUnlike previous Mac chips, the M1 is designed and manufactured by Apple.  It is ARM-based, meaning it uses a design similar to the \"A-series\" chips found in iPhones and iPads, rather than the Intel \"x86\" architecture.  Additionally, the M1 is a System on a Chip (SoC), which contains several types of processors.  Besides the CPU, the M1 includes a GPU, neural engine, media engine, and \"high-efficiency\" processing cores that help reduce power consumption.\nNot only does the M1 contain multiple types of processors, but most of them are multi-core.  Below are the M1 processor specs:\n\nCPU: 8-core (4 high-performance cores running at a 3.2 GHz clock speed + 4 high-efficiency cores)\nGPU: 8-core (7-core on the low-end model)\nNeural Engine: 6-core  (for AI and ML computations)\nTransistors: 16 billion (5 nm)\nRAM: 8 or 16 GB of unified (integrated) memory\nL2 Cache : 12 MB per performance core; 4 MB per efficiency core\n\nNOTE: Apple released two high-performance variants of the M1 — the M1 Pro and M1 Max — with new MacBook Pros in October 2021."
        ]
    },
    {
        "word": "MAC Address",
        "type": [],
        "definition": [
            "Stands for \"Media Access Control Address,\" and no, it is not related Apple Macintosh computers.  A MAC address is a hardware identification number that uniquely identifies each device on a network.  The MAC address is manufactured into every network card, such as an Ethernet card or Wi-Fi card, and therefore cannot be changed.\nBecause there are millions of networkable devices in existence, and each device needs to have a unique MAC address, there must be a very wide range of possible addresses.  For this reason, MAC addresses are made up of six two-digit hexadecimal numbers, separated by colons.  For example, an Ethernet card may have a MAC address of 00:0d:83:b1:c0:8e.  Fortunately, you do not need to know this address, since it is automatically recognized by most networks."
        ]
    },
    {
        "word": "MAMP",
        "type": [],
        "definition": [
            "Stands for \"Mac OS X, Apache, MySQL, and PHP.\"  MAMP is a variation of the LAMP software package that can be installed on Mac OS X.  It can be used to run a live web server from a Mac, but is most commonly used for web development and local testing purposes.\nApache (or \"Apache HTTP Server\") is the component used to configure and run the web server.  Once installed, Apache enables a Mac to host one or more websites.  By configuring and running a local Apache web server, web developers can view their webpages in a web browser without publishing to an external server.\nMAMP also includes MySQL and PHP.  These two components are common (open source|open source) technologies used for creating dynamic websites.  MySQL is a popular DBMS and PHP is a web scripting language.  Webpages that include PHP code can access data from a MySQL database and load dynamic content on-the-fly.  By installing PHP and MySQL locally, a developer can build and test a dynamic website on his Mac before publishing it on the Internet.\nApache, MySQL, and PHP are open source components that can be installed individually.  However, it is faster and easier to install a pre-built \"AMP\" package like MAMP or MAMP Pro.  Both MAMP and MAMP Pro also include a graphical user interface GUI that can be used to manage the local web server.\nNOTE: In some cases, the \"P\" in MAMP may stand for Perl or Python, which are other scripting languages that can be used in place of PHP.  The Windows version of LAMP is called WAMP."
        ]
    },
    {
        "word": "MAN",
        "type": [],
        "definition": [
            "Stands for \"Metropolitan Area Network.\"  A MAN is a network that spans a large area, such as a town or city.  It is larger than a campus area network (CAN), but smaller than a wide area network (WAN).\nAn example of a MAN is a series of wireless routers distributed across a city.  The routers are almost always linked to an Internet connection, which allows public users to connect to the Internet once they connect to the MAN.  They are also bridged together, meaning each access point has the same name and authentication method.  Once you connect your device to one of the routers, it should automatically connect to routers in other locations within the MAN.\nThere is no hard limit to the size range of a MAN, but most are between 3 and 30 miles in diameter.  Some campus area networks are larger than 3 miles in diameter, but they are technically not MANs.  CANs typically provide more security and faster speeds than a MAN.  They are also more likely to limit access to public users.\nMetropolitan area networks are sometimes considered wide area networks since they span large areas.  However, a MAN is a single network, not several interconnected networks, which is what comprises a WAN."
        ]
    },
    {
        "word": "MANET",
        "type": [],
        "definition": [
            "Stands for \"Mobile Ad Hoc Network.\"  A MANET is a type of ad hoc network that can change locations and configure itself on the fly.  Because MANETS are mobile, they use wireless connections to connect to various networks.  This can be a standard Wi-Fi connection, or another medium, such as a cellular or satellite transmission.\nSome MANETs are restricted to a local area of wireless devices (such as a group of laptop computers), while others may be connected to the Internet.  For example, A VANET (Vehicular Ad Hoc Network), is a type of MANET that allows vehicles to communicate with roadside equipment.  While the vehicles may not have a direct Internet connection, the wireless roadside equipment may be connected to the Internet, allowing data from the vehicles to be sent over the Internet.  The vehicle data may be used to measure traffic conditions or keep track of trucking fleets.  Because of the dynamic nature of MANETs, they are typically not very secure, so it is important to be cautious what data is sent over a MANET."
        ]
    },
    {
        "word": "MBR",
        "type": [],
        "definition": [
            "Stands for \"Master Boot Record.\"  An MBR is a small section of a hard disk or other storage device that contains information about the disk.  It is located in the boot sector and defines the disk partitions as well as the code used to start the boot sequence.\nThere are several variations of MBRs, but they are all 512 bytes in size and contain a partition table and bootstrap code.  Modern master boot records may contain disk signatures, timestamps, and other disk formatting information.   Additionally, while early MBRs only supported four partitions, newer versions can support up to sixteen.  However, all master boot records are limited to 512 bytes, which means they can only address up to two terabytes of data.  Therefore, disks that are formatted using an MBR are limited to 2TB of usable disk space.\nThe master boot record was first used by PC-DOS compatible computers in 1983 and was the standard way to format DOS disks for over two decades.  However, most hard drives are now using the GUID partition table (GPT), which is compatible with multiple operating systems and does not have a 2TB limit.\nNOTE: If necessary, a master boot record can be added to a GUID partition table for backwards compatibility."
        ]
    },
    {
        "word": "MCA",
        "type": [],
        "definition": [
            "Stands for \"Micro Channel Architecture.\"  It is an expansion bus created by IBM that was used in the company's PS\/2 desktop computers.  An expansion bus allows additional cards to be connected to the computer's motherboard, expanding the number of I\/O ports.  These include SCSI, USB, Firewire, AGP, and DVI connections, as well as many others.\nThe MCA standard was designed to take the place of the AT and ISA buses used in previous IBM PC\/AT compatible computers.  While the MCA bus architecture was an improvement in both size and speed over AT and ISA, it was kept as a proprietary standard by IBM.  This discouraged other manufacturers from adopting the standard, since the MCA architecture was not compatible with other standards.  Most PC companies incorporated the more universal PCI and AGP expansion buses into their computers, which are both widely used today."
        ]
    },
    {
        "word": "MDI",
        "type": [],
        "definition": [
            "Stands for \"Medium Dependent Interface.\"  MDI is a type of Ethernet port found on network devices.  It is often used in contrast with MDIX (or \"MDI-X\"), which is similar to MDI, but switches the transmit and receive pins within the interface.\nWhen connecting two devices with an Ethernet cable, it is important that the transmit pins on one end line up with the receive pins on the other.  If you connect a device with an MDI port to a device with an MDIX port, a standard straight through Ethernet cable will do the job.  However, when connecting two devices with MDI ports, such as two computers, an Ethernet crossover cable is required.  The crossover cable switches the send and receive ports on the two connectors, allowing data to flow correctly between two MDI or MDIX ports.\nStraight-through and crossover Ethernet cables may look identical, but you can tell the difference by looking at the colors of the wires on each end.  In a straight-through Ethernet cable, the colors will be the same on both ends, while in a crossover cable, the colors will be arranged differently.\nOn some network devices, the ports are labeled MDI or MDIX to help you choose the right type of cable.  Routers often have multiple MDIX ports and a single MDI port called an \"uplink\" port designed to connect a device such as a cable modem.  If you connect a device to the wrong port or use the wrong cable, it may not be able to communicate with the router.\nFortunately, Hewlett Packard developed a technology called Auto-MDIX (or \"MDI\/MDIX Auto Cross\") that automatically switches between MDI and MDIX as needed.  Today, most 10Base-T and 100Base-T network devices have Auto-MDIX ports, so it does not matter if you connect other devices using straight through or crossover cables.  Additionally, Giagbit Ethernet (1000-BaseT) does not define specific send\/receive pins, so it is not necessary to identify MDI or MDIX ports when connecting two Gigabit Ethernet devices."
        ]
    },
    {
        "word": "MHL",
        "type": [],
        "definition": [
            "Stands for \"Mobile High-definition Link.\"  MHL is a technology designed for connecting mobile devices, such as smartphones and tablets, to TVs, displays, home theater systems, and automotive interfaces.  It was developed and standardized by multiple companies that make up the MHL Consortium.  These include Nokia, Samsung, Sony, Toshiba, and Lattice Semiconductor.\nAn MHL connection provides three primary functions:\n\nIt transmits a full HD audio and video signal\nIt provides electrical power to mobile devices\nIt supports RCP data transmissions\n\n1. HD Signal\nThe HD connection allows a smartphone or tablet to mirror its screen content on an HDTV in full resolution with almost no latency.  The MHL 1 and MHL 2 standards support a maximum resolution of 1080p at 60 FPS.  This makes it possible to play movies and games from a mobile device on an HDTV with no lag.  MHL 3 supports 4K resolution at 30 FPS.  A new variation of the standard, called superMHL, supports 8K video at 120 FPS.  All MHL technologies support 8-channel high-definition audio.\n2. Power\nWhen an MHL-compatible device is connected to a TV or other hardware that supports MHL, it can receive electrical power at up to 10W (MHL 3) or 40W (superMHL).  Therefore an MHL connection can be used to charge a mobile device and will prevent it from running out of power during a video or gaming session.\n3. Data Transmission\nThe MHL standard supports data transmissions over the Remote Control Protocol (RCP).  This means it can send and receive messages, such as play, pause, volume up\/down, and other commands.  RCP support means you can use your television remote to control your MHL-connected device.\nMHL Interface\nThere is no such thing as an MHL cable.  Instead, MHL operates over existing connectors.  Android smartphones commonly have Micro-USB ports while TVs and other A\/V devices often have HDMI ports.  Therefore, an MHL-compatible Micro-USB to HDMI adapter is commonly required to connect the two devices.  superMHL also supports USB-C, which provides more bandwidth than a Micro-USB cable."
        ]
    },
    {
        "word": "MIDI",
        "type": [],
        "definition": [
            "Stands for \"Musical Instrument Digital Interface.\"  MIDI is a connectivity standard for transferring digital instrument data.  It is primarily used by computers, synthesizers, and electronic keyboards.  However, MIDI is supported by several other instruments, such as electronic drums, beat boxes, and even digital stringed instruments like guitars and violins.\nMIDI data includes several types of information.  For example, pressing a single key on a synthesizer transmits the note played, the velocity (how hard the note is pressed), and how long the note is held.  If multiple notes are played at once, the MIDI data is transmitted for all the notes simultaneously.  Other data that may be sent over a MIDI connection includes the instrument ID, sustain pedal timings, and controller information, such as pitch bend and vibrato.\nWhen a synthesizer is hooked up to a computer via a MIDI connection, the notes played can be recorded by DAW software in MIDI format.  The MIDI data can be played back by sending the recorded MIDI notes to the keyboard, which outputs them as audio samples, such as a piano or strings.  Most DAW software supports MIDI editing, allowing you to adjust the timing and velocity of individual notes, change their pitch, delete notes, or add new ones.  MIDI data is often displayed in a digital format, with lines representing each note played.  Many programs can convert MIDI data to a musical score as well.\nA MIDI recording simply contains instrument information and the notes played.  The actual sound is played back using samples (individual recordings) from real instruments.  For example, a MIDI track recorded as a song for piano can be played back with a guitar sound by simply changing the output instrument — though it might not sound very realistic.\nOriginally, MIDI connections used MIDI cables, which connected to a 5-pin MIDI port on each device.  Now, most MIDI devices have standard computer interfaces, such as USB or Thunderbolt ports.  These modern interfaces provide more bandwidth than traditional MIDI ports, allowing more tracks with more data to be transmitted at once.\nGeneral MIDI\nThe MIDI standard defines 128 \"General MIDI\" (or GM) instruments, which are available on most computers as software instruments.  The sound of each General MIDI instrument may vary between different computers and keyboards because the samples used for the instruments may be different.  However, the ID for a GM instrument is the same across devices.  For example, GM instrument #1 is always an acoustic piano, #20 is a church organ, and #61 is a french horn.  Modern synthesizers typically include hundreds or even thousands of other instruments that can be selected, most of which provide more authentic sound than the General MIDI options. "
        ]
    },
    {
        "word": "MIME Type",
        "type": [],
        "definition": [
            "MIME stands for \"Multipurpose Internet Mail Extensions.\"\nA MIME type or \"media type\" is a text string that identifies a specific file format.  It consists of two parts — a type and a subtype — separated by a forward slash.  For example, the MIME type of a plain text file is:\ntext\/plain\nHistory\nSMTP, the standard protocol used to send email messages, was not originally designed to support file transfers.   Email attachments had to be encoded as part of the message, limiting their size.  MIME, which was introduced the 1990s, made it easier to send files via email using a custom Content-Type: header.  Decades later, SMTP uses the same method.  Email messages that contain attachments include a header that looks something like this:\nContent-Type: multipart\/mixed; boundary =\"[identifier]\"\nOther Internet protocols soon adopted MIME types as a way to identify files transferred over the Internet.  HTTP, for example, uses MIME types to identify the type of data accessible from a URL.\nA standard webpage has the following MIME type:\nContent-Type: text\/html\nSince MIME types have many other uses besides email, they are also called media types.\nMIME Type Examples\nMIME types, are used to identify thousands different file formats.  The official list is maintained by the IANA (Internet Assigned Numbers Authority).  Some examples include:\n\ntext\/html - HTML document (webpage)\ntext\/css - CSS file\ntext\/javascript - JavaScript file\nimage\/jpeg - JPEG image file\nimage\/png - PNG image file\naudio\/wav - WAVE audio file\nvideo\/mp4 - MPEG video file\napplication\/zip - ZIP compressed archive\n\nMIME Types vs File Extensions\nMIME types and file extensions are similar in that they both identify file formats.  However, MIME types provide two advantages:\n\nThey contain a type and subtype.  The type (preceding the forward slash) helps categorize file types, making it easy for applications to filter files.  For example, an Internet program may allow the transfer of text and image files, but not audio or video files.\nThey have a one-to-one relationship with file formats.  Some file formats have multiple file extensions.  For example, a JPEG image may have a .JPG or .JPEG extension.  A webpage may have an .HTM or .HTML extension.  MIME types provide standard identifiers for file formats that are recognized across applications and different protocols.\n"
        ]
    },
    {
        "word": "MIPS",
        "type": [],
        "definition": [
            "Stands for \"Million Instructions Per Second.\"  It is a method of measuring the raw speed of a computer's processor.  Since the MIPS measurement doesn't take into account other factors such as the computer's I\/O speed or processor architecture, it isn't always a fair way to measure the performance of a computer.  For example, a computer rated at 100 MIPS may be able to computer certain functions faster than another computer rated at 120 MIPS.\nThe MIPS measurement has been used by computer manufacturers like IBM to measure the \"cost of computing.\"  The value of computers is determined in MIPS per dollar.  Interestingly, the value of computers in MIPS per dollar has steadily doubled on an annual basis for the last couple of decades."
        ]
    },
    {
        "word": "MIS",
        "type": [],
        "definition": [
            "Stands for \"Management Information System.\"  An MIS is a system designed to manage information within a company or organization.  This includes employees, departments, projects, clients, finances, and other types of data.  At its most general level, an MIS may include non-computer based elements, such as the structural hierarchy of an organization.  However, in the computing world, an MIS typically refers to the hardware and software used to manage information.\nThe hardware required for a management information system can vary widely depending on the size and data processing requirements of an organization.  A small business, for example, may only need a single machine to store information, such as employee data, projects, and invoices.  A large business may require several systems that allow employees to share data securely across multiple locations.  Data stored in an MIS is often backed up in multiple locations for redundancy.\nOf course, hardware must have the appropriate software installed to assist in a management information system.  Some common functions of MIS software include employee record keeping, invoicing, inventory management, project planning, customer relationship management, and business analysis.  Some software programs are designed for specific tasks, such as maintaining financial records or backing up data.  Other programs are designed to be comprehensive solutions that perform multiple MIS functions in a single software package.\nExamples of MIS software include Microsoft Dynamics, Fleetmatics WORK, Clarity Professional MIS, and Tharstern Limited.  MIS programs designed specifically for the graphics and print industry include Avanti Slingshot, EFI Pace, and DDS Accura.  Most MIS software programs are available as desktop applications, though many solutions now include web-based interfaces and mobile apps as well."
        ]
    },
    {
        "word": "MMS",
        "type": [],
        "definition": [
            "Stands for \"Multimedia Messaging Service.\"  MMS is mobile phone service that allows users to send multimedia messages to each other.  This includes images, videos, and sound files.\nMMS is an extension of SMS, which is used to send and receive text messages.  Like text messages, multimedia messages are first transmitted to a central server maintained by the cellular service provider.  Once the message has been received by the server, it is forwarded to the recipient.  If the recipient's phone is off or she does not have cell phone service when the message is sent, the server will hold the message and send it once the recipient's phone is available.\nMost modern cell phones and smartphones support MMS messaging.  MMS support is typically integrated into the text messaging interface and activates automatically when needed.  For example, if you type a text-only message, it will be sent using SMS.  If you add a graphic or video, the multimedia portion will be transmitted via MMS.  Similarly, if someone sends you an multimedia message, your phone will automatically use MMS to receive the file.  If your phone does not support MMS messages, you will most likely receive a text message that includes a URL where you can view the file from a Web browser."
        ]
    },
    {
        "word": "MP3",
        "type": [],
        "definition": [
            "Stands for \"MPEG Audio Layer-3.\"  MP3 is a compressed audio file format developed by the Moving Picture Experts Group (MPEG).  A typical MP3 file sounds similar to the original recording, but requires significantly less disk space.  MP3 files are often about one tenth the size of an uncompressed WAVE or AIFF file, which have the same audio quality as a CD.\nThe small file size and high fidelity of MP3 files helped popularize digital music downloads in the late 1990s and early 2000s.  Instead of requiring a 40 megabyte download for a single song, the comparable MP3 file might be 4 MB.  MP3s made it possible for users to download entire albums in roughly the same time it took to download a single WAV or AIFF file.  For over a decade, MP3s were the most common way to store music files on computers and portable music players like the iPod.\nWhile MP3s are still prevalent on the Internet, other file formats are now also used for audio compression.  Advanced Audio Coding (AAC), for example, is used for songs on Apple's iTunes Store.  Ogg Vorbis is an open container format that is frequently used for royalty-free compression and streaming.\nThe MP3 File Format\nAn MP3 file includes a header, metadata, and compressed audio.  The header includes information about the audio, such as the version of the encoding, the bitrate, and the (sample_rate|sample_rate).  A high bitrate and sample rate produces better audio quality, but also a larger file size.\nA common MP3 compression setting is a bitrate of 128 kbps and a sample rate of 44.1 kHz.  This produces a file size of roughly one megabyte per minute.\nMP3 metadata provides information about the actual recording.  This data is usually saved in an ID3 tag, which is a standard format supported by most hardware and software media players.  The bulk of the MP3 file contents is the actual compressed audio, which is stored as binary data.\nFile extension: .MP3"
        ]
    },
    {
        "word": "MPEG",
        "type": [],
        "definition": [
            "Stands for \"Moving Picture Experts Group.\"  MPEG is an organization that develops standards for encoding digital audio and video.  It works with the International Organization for Standardization (ISO) and the International Electrotechnical Commission (IEC) to ensure media compression standards are widely adopted and universally available.\nThe MPEG organization has produced a number of digital media standards since its inception in 1998.  Examples include:\n\nMPEG-1 – Audio\/video standards designed for digital storage media (such as an MP3 file)\nMPEG-2 – Standards for digital television and DVD video\nMPEG-4 – Multimedia standards for the computers, mobile devices, and the web\nMPEG-7 – Standards for the description and search of multimedia content\nMPEG-MAR – A mixed reality and augmented reality reference model\nMPEG-DASH – Standards that provide solutions for streaming multimedia data over HTTP (such as servers and CDNs)\n\nUsing MPEG compression, the file size of a multimedia file can be significantly reduced with little noticeable loss in quality.  This makes transferring files over the Internet more efficient, which helps conserve Internet bandwidth.  MPEG compression is so ubiquitous that the term \"MPEG\" is commonly used to refer to a video file saved in an MPEG file format rather than the organization itself.  These files usually have a \".mpg\" or \".mpeg\" file extension.\nFile extensions: .MP3, .MP4, .M4V, .MPG, .MPE, .MPEG"
        ]
    },
    {
        "word": "MTU",
        "type": [],
        "definition": [
            "Stands for \"Maximum Transmission Unit.\"  MTU is a networking term that defines the largest packet size that can be sent over a network connection.  The MTU is typically limited by the type of connection, but may sometimes be adjusted in a computer's network settings.  Because a higher MTU allows for more data to be transferred at once, connections with high MTUs typically have more bandwidth than connections with lower MTUs.\nFor example, the MTU of an Ethernet connection is 1500 bytes.  If a system sends packets over an Ethernet network that are larger than 1500 bytes, the data will be fragmented into smaller packets.  These packets will then need to be reassembled on the receiving computer.  Fortunately, the receiving computer does this automatically.  However, it may cause a slowdown in the overall data transfer.  Since the majority of computers connected to the Internet go through an Ethernet connection at some point, most computers have a default MTU setting of 1500 bytes."
        ]
    },
    {
        "word": "MVC",
        "type": [],
        "definition": [
            "Stands for \"Model-View-Controller.\"  MVC is an application design model comprised of three interconnected parts.  They include the model (data), the view (user interface), and the controller (processes that handle input).\nThe MVC model or \"pattern\" is commonly used for developing modern user interfaces.  It is provides the fundamental pieces for designing a programs for desktop or mobile, as well as web applications.  It works well with object-oriented programming, since the different models, views, and controllers can be treated as objects and reused within an application.\nBelow is a description of each aspect of MVC:\n1. Model\nA model is data used by a program.  This may be a database, file, or a simple object, such as an icon or a character in a video game.\n2. View\nA view is the means of displaying objects within an application.  Examples include displaying a window or buttons or text within a window.  It includes anything that the user can see.\n3. Controller\nA controller updates both models and views.  It accepts input and performs the corresponding update.  For example, a controller can update a model by changing the attributes of a character in a video game.  It may modify the view by displaying the updated character in the game.\nThe three parts of MVC are interconnected (see diagram).  The view displays the model for the user.  The controller accepts user input and updates the model and view accordingly.  While MVC is not required in application design, many programming languages and IDEs support the MVC architecture, making it a common choice for developers."
        ]
    },
    {
        "word": "Mac OS",
        "type": [],
        "definition": [
            "This is the operating system that runs on Macintosh computers.  It is pronounced, \"mack-oh-es.\"  The Mac OS has been around since the first Macintosh was introduced in 1984.  Since then, it has been continually updated and many new features have been added to it.  Each major OS release is signified by a new number (i.e. Mac OS 8, Mac OS 9).\nSince the core of the Mac OS was nearly decades old, Apple decided to completely revamp the operating system.  In March of 2001, Apple introduced a completely new version of the Mac OS that was written from the ground up.  The company dubbed it \"Mac OS X,\" correctly pronounced \"Mac OS 10.\"  Unlike earlier versions of the Mac OS, Mac OS X is based on the same kernel as Unix and has many advanced administrative features and utilities.  Though the operating system is much more advanced than earlier versions of the Mac OS, it still has the same ease-of-use that people have come to expect from Apple software."
        ]
    },
    {
        "word": "Machine Language",
        "type": [],
        "definition": [
            "Machine language, or machine code, is a low-level language comprised of binary digits (ones and zeros).  High-level languages, such as Swift and C++ must be compiled into machine language before the code is run on a computer.\nSince computers are digital devices, they only recognize binary data.  Every program, video, image, and character of text is represented in binary.  This binary data, or machine code, is processed as input by the CPU.  The resulting output is sent to the operating system or an application, which displays the data visually.  For example, the ASCII value for the letter \"A\" is 01000001 in machine code, but this data is displayed as \"A\" on the screen.  An image may have thousands or even millions of binary values that determine the color of each pixel.\nWhile machine code is comprised of 1s and 0s, different processor architectures use different machine code.  For example, a PowerPC processor, which has a RISC architecture, requires different code than an Intel x86 processor, which has a CISC architecture.  A compiler must compile high-level source code for the correct processor architecture in order for a program to run correctly.\nMachine Language vs Assembly Language\nMachine language and assembly language are both low-level languages, but machine code is below assembly in the hierarchy of computer languages.  Assembly language includes human-readable commands, such as mov, add, and sub, while machine language does not contain any words or even letters.  Some developers manually write assembly language to optimize a program, but they do not write machine code.  Only developers who write software compilers need to worry about machine language.\nNOTE: While machine code is technically comprised of binary data, it may also be represented in hexadecimal values.  For example, the letter \"Z,\" which is 01011010 in binary, may be displayed as 5A in hexadecimal code."
        ]
    },
    {
        "word": "Machine Learning",
        "type": [],
        "definition": [
            "Machine learning, commonly abbreviated \"ML,\" is a type of artificial intelligence (AI) that \"learns\" or adapts over time.  Instead of following static rules coded in a program, ML technology identifies input patterns and contains algorithms that evolve over time.\nMachine learning has a wide variety of applications, many of which are now part of everyday life.  Below are a few examples:\n\nMedical diagnoses\nAutonomous vehicles\nOnline ad targeting – Google AdSense and Facebook Advertising\nSpeech recognition – Google Assistant, Amazon Alexa, Microsoft Cortana, and Apple Siri\nImage recognition – Google image search, facial recognition on Facebook and in Apple Photos\n\nSelf-Driving Vehicle Example\nAutonomous vehicles incorporate machine learning to improve their safety and reliability.  A self-driving car that uses traditional artificial intelligence can respond to any road conditions it has been programmed to handle.  However, if the software encounters unrecognized input, the car may default to a backup safety measure, such as slowing down, stopping, or requiring a manual override.\nMachine learning can enable a vehicle to recognize events and objects that have not been explicitly programmed in the source code.  For example, a car may be programmed to recognize street lights, but not flashing lights on construction barricades.  By learning from experience — possibly recording the driving behavior of a human driver — the car will start to recognize construction barriers and respond accordingly.\nML technology is what enables autonomous vehicles to differentiate between objects on the road, such as cars, bikes, humans, and animals.  It also helps automobiles drive more reliably in imperfect weather conditions and on roads without clear lines.  The goal is to enable vehicles to drive like humans while avoiding mistakes caused by human error."
        ]
    },
    {
        "word": "Macintosh",
        "type": [],
        "definition": [
            "Macintosh is a line of desktop and laptop computers developed by Apple.  Each Macintosh computer, or Mac, runs a version of the Mac OS, Apple's desktop operating system.  Since 2001, all Macs have run Mac OS X, a redesigned version of the original Mac OS that was built from the NeXTSTEP operating system.\nThe original Macintosh, released in 1984, was the first personal computer to have a graphical user interface, or GUI.  It was in all-in-one machine with a color display and included a mouse and a keyboard.  Over the past several decades, Apple has released many new types of Macintosh computers, including all-in-one models, system units (which do not include a monitor), and portable computers.\nThe current Macintosh line (as of early 2012) includes the following models:\n\nMac Pro - a professional desktop computer sold as a system unit\niMac - an all-in-one desktop computer aimed at home and pro users\nMac mini - a small desktop computer designed for home and server purposes\nMacBook Pro - a portable computer aimed towards students and pro users\nMacBook Air - a lightweight portable computer designed for travelers\n\nNOTE: While Macs are technically personal computers (PCs), the term PC is often used to describe computers that run Windows or Linux.  Therefore, Macs are often referred to as personal computers, but not PCs.  Unlike PCs, which are manufactured by several different companies, Apple designs and manufactures all Macintosh computers."
        ]
    },
    {
        "word": "Macro",
        "type": [],
        "definition": [
            "Macro has two computer-related definitions, both of which involve making your computer experience more efficient.\n1. A Keyboard Shortcut\nThe term \"macro\" is often used synonymously with \"keyboard shortcut.\"  Keyboard shortcuts are key combinations that perform commands, such as saving a file, closing a window, or copying and pasting data.  For a list of keyboard shortcuts available for Mac and Windows, view the pages below:\n- Mac OS X Keyboard Shortcuts\n- Windows XP Keyboard Shortcuts\n2. A Small Program\nA macro can also be a small program, or script, that automates common tasks.  These scripts are usually run within programs and can often be created by the user.  For example, a user might record a macro for Microsoft Word that inserts his entire address when he presses a custom key combination.  A Microsoft Excel user might record a macro to format the data in the selected column of a spreadsheet.\nWhile Word and Excel both make it easy to create custom macros, many other programs allow users to create macros as well.  However, not all programs refer to the automated commands as macros.  For example, Photoshop allows users to record changes made to an image and saves the series of steps as an \"action.\"  These actions can then by applied to other images.  Regardless of what they are called, macros can save you a lot of time by automating repetitive tasks.  If you find yourself doing the same thing over and over again when using a certain program, you may want to simplify the process by recording a macro."
        ]
    },
    {
        "word": "Mail Server",
        "type": [],
        "definition": [
            "A mail server (or email server) is a computer system that sends and receives email.  In many cases, web servers and mail servers are combined in a single machine.  However, large ISPs and public email services (such as Gmail and Hotmail) may use dedicated hardware for sending and receiving email.\nIn order for a computer system to function as a mail server, it must include mail server software.  This software allows the system administrator to create and manage email accounts for any domains hosted on the server.  For example, if the server hosts the domain name \"techterms.com,\" it can provide email accounts ending in \"@techterms.com.\"\nMail servers send and receive email using standard email protocols.  For example, the SMTP protocol sends messages and handles outgoing mail requests.  The IMAP and POP3 protocols receive messages and are used to process incoming mail.  When you log on to a mail server using a webmail interface or email client, these protocols handle all the connections behind the scenes.\nMail server software is available for multiple platforms.  The most popular mail server for Windows is Microsoft Exchange Server, an enterprise product used by large businesses.  However, many other options exist, including Ipswitch IMail Server, IceWarp Mail Server, MailEnable, and hMailServer.  Popular Linux options include Exim for sending mail and Dovecot and Courier for receiving mail."
        ]
    },
    {
        "word": "Mainframe",
        "type": [],
        "definition": [
            "A mainframe is an ultra high-performance computer made for high-volume, processor-intensive computing.  They are typically used by large businesses and for scientific purposes.  You probably won't find a mainframe in any household.  In the hierarchy of computers, mainframes are right below supercomputers, the most powerful computers in the world. (Which is why they are aptly named \"supercomputers.\")  Yet a mainframe can usually execute many programs simultaneously at a high speed, whereas supercomputers are designed for a single process.  Currently, the largest manufacturers of mainframes are IBM and Unisys."
        ]
    },
    {
        "word": "Malware",
        "type": [],
        "definition": [
            "Short for \"malicious software,\" malware refers to software programs designed to damage or do other unwanted actions on a computer system.  In Spanish, \"mal\" is a prefix that means \"bad,\" making the term \"badware,\" which is a good way to remember it (even if you're not Spanish).\nCommon examples of malware include viruses, worms, trojan horses, and spyware.  Viruses, for example, can cause havoc on a computer's hard drive by deleting files or directory information.  Spyware can gather data from a user's system without the user knowing it.  This can include anything from the Web pages a user visits to personal information, such as credit card numbers.\nIt is unfortunate that there are software programmers out there with malicious intent, but it is good to be aware of the fact.  You can install anti-virus and anti-spyware utilities on your computer that will seek and destroy the malicious programs they find on your computer.  So join the fight against badware and install some protective utilities on your hard drive!"
        ]
    },
    {
        "word": "Margin",
        "type": [],
        "definition": [
            "Margin is a page layout term used in both print and Web publishing.  In print, \"margin\" typically refers to page borders, while on the Web it describes the spacing between elements on a webpage.\n1. Printed Pages\nWhen you create a new document in a word processor, the default margins are usually defined as one inch on all sides.  However, depending on the program, the side margins may vary anywhere from 0.75 in to 1.25 inches.  These margins create a frame around the content of the page so that the text does not run all the way to the edges.  The white space along the edges of the document makes the page look cleaner and the text is easier to read.\nIn many cases, it is not necessary to edit the page margins.  However, some documents, such as school papers, may require specific margins.  In these cases, you can edit the margins in your word processor's Document Formatting window.  This window can typically be accessed by selecting Format &rarr; Document from the program's menu bar.  In Microsoft Word, you can edit page margins using the Layout tab in the ribbon located above the document.\n2. Webpages\nMargin is also a CSS property used for creating space between HTML \"block\" elements on webpages.  It can specify the top, right, bottom, and left margins around an object.  Below are several examples of how margins can be specified in CSS.\n\nmargin: 12px; — 12 pixel margin around all sides of the element\nmargin: 4px 6px; — top and bottom margins: 4 pixels; right and left margins: 6 pixels\nmargin: 10px 15px 20px; 5px; — top: 10px, right: 15px, bottom: 20px, left: 5px margin\nmargin-right: 30px; — 30 pixel margin on the right side of the element\n\nMargins can also be negative values, which may be used to overlay an object on another element within a webpage.  In some cases, margins may also be defined as \"auto.\"  For example, the CSS declaration \"margin: 0px auto;\" is often used to center elements on webpages."
        ]
    },
    {
        "word": "Markup Language",
        "type": [],
        "definition": [
            "A markup language is a computer language that uses tags to define elements within a document.  It is human-readable, meaning markup files contain standard words, rather than typical programming syntax.  While several markup languages exist, the two most popular are HTML and XML.\nHTML is a markup language used for creating webpages.  The contents of each webpage are defined by HTML tags.  Basic page tags, such as &lt;head&gt;, &lt;body&gt;, and &lt;div&gt; define sections of the page, while tags such as &lt;table&gt;, &lt;form&gt;, &lt;image&gt;, and &lt;a&gt; define elements within the page.  Most elements require a beginning and end tag, with the content placed between the tags.  For example, a link to the TechTerms.com home page may use the following HTML code:\n&lt;a href=\"https:\/\/techterms.com\"&gt;TechTerms.com&lt;\/a&gt;\nXML is used for storing structured data, rather than formatting information on a page.  While HTML documents use predefined tags (like the examples above), XML files use custom tags to define elements.  For example, an XML file that stores information about computer models may include the following section:\n&lt;computer&gt;\n&nbsp;&nbsp;&lt;manufacturer&gt;Dell&lt;\/manufacturer&gt;\n&nbsp;&nbsp;&lt;model&gt;XPS 17&lt;\/model&gt;\n&nbsp;&nbsp;&lt;components&gt;\n&nbsp;&nbsp;&nbsp;&nbsp;&lt;processor&gt;2.00 GHz Intel Core i7&lt;\/processor&gt;\n&nbsp;&nbsp;&nbsp;&nbsp;&lt;ram&gt;6GB&lt;\/ram&gt;\n&nbsp;&nbsp;&nbsp;&nbsp;&lt;storage&gt;1TB&lt;\/storage&gt;\n&nbsp;&nbsp;&lt;\/components&gt;\n&lt;\/computer&gt;\nXML is called the \"Extensible Markup Language\" since custom tags can be used to support a wide range of elements.  Each XML file is saved in a standard text format, which makes it easy for software programs to parse or read the data.  Therefore, XML is a common choice for exporting structured data and for sharing data between multiple programs.\nNOTE: Since both HTML and XML files are saved in a plain text format, they can be viewed in a standard text editor.  You can also view the HTML source of an open webpage by selecting the \"View Source\" option.  This feature is found in the View menu of most Web browsers."
        ]
    },
    {
        "word": "Martech",
        "type": [],
        "definition": [
            "Martech combines the words \"marketing\" and \"technology.\"  It covers a wide range of technologies used in online marketing.  Martech is related to adtech (advertising technology) but focuses on marketing services rather than digital ads.\nExamples of martech include:\n\nCRM (Customer Relationship Management) software\nEmail marketing systems\nSocial media marketing technologies\nOnline tracking tools\nUser analytics\nSEO (Search Engine Optimization)\n\nMartech software, such as CRM SaaS applications and email delivery services, enable marketing teams to reach targeted audiences.  For example, instead of mass-emailing (e.g., spamming) recipients, martech makes it possible to send emails only to those most interested in receiving them.  The software is often part of a CRM suite, which companies use to maintain a database of existing customers and potential leads.  Complex algorithms assign values, e.g., likelihood to purchase, to people in the database, allowing companies to make effective marketing decisions.\nCross-site and cross-platform tracking enable companies to track user behavior across websites and devices.  For example, if you visit an e-commerce website on your smartphone, cross-platform tracking allows the company to display personalized recommendations on your laptop.  Ever wonder how you get an email about something you left in your online shopping cart?  You can thank martech for that.\nNOTE: Because martech often tracks user activity, online marketing services must follow data collection and usage guidelines, such as GDPR.  Organizations that collect and store data often publish a privacy policy, which explains how they use the data."
        ]
    },
    {
        "word": "Mashup",
        "type": [],
        "definition": [
            "The term \"mashup\" has several meanings.  It was originally used to describe songs that meshed two different styles of music into one song.  For example, a classic rock song put to a well-known hip-hop beat may be considered a mashup.  It is also used to describe videos that have been compiled using different clips from multiple sources.  For example, a skateboarding movie created from several different skateboard videos found would be considered a video mashup.\nA mashup also describes a Web application that combines multiple services into a single application.  For example, a Web forum may contain a mashup that uses Google Maps to display what parts of the world the users are posting from.  Yahoo offers a mashup called Yahoo! Pipes that aggregates RSS feeds into a single page that can be navigated using a graphical interface.\nThe primary purpose of most Web mashups is to consolidate information with an easy-to-use interface.  Because the combinations of Web applications are limitless, so are the possibilities of mashups.  Therefore, as mashups continue to evolve, don't be surprised to see them popping up on your favorite websites.  After all, we can always use new tools that help make information easier to find!"
        ]
    },
    {
        "word": "Matrix",
        "type": [],
        "definition": [
            "A matrix is a grid used to store or display data in a structured format.  It is often used synonymously with a table, which contains horizontal rows and vertical columns.\nWhile the terms \"matrix\" and \"table\" can be used interchangeably, matrixes (or matrices) are considered more flexible than tables.  For example, tables generally have a fixed number of rows and columns, while the size of a matrix may change dynamically.  The term \"matrix\" may also be used to refer to a table that has groups of columns within a single row.\nIn computing, a matrix may be used to store a group of related data.  For example, some programming languages support matrixes as a data type that offers more flexibility than a static array.  By storing values in a matrix rather than as individual variables, a program can access and perform operations on the data more efficiently.\nIn mathematics, matrixes are used to display related numbers.  Math matrixes are usually presented as a list of numbers within square brackets.  A matrix that only contains one row is called a row vector, while a matrix that contains a single column is called a column vector.  A matrix that contains the same number of rows as columns (for example, a 4x4 matrix) is called a square matrix.\nNOTE: While the term \"matrix\" has technical meanings in both computing and mathematics, it is also used in everyday speech to describe structured data.  For example, a comparison chart may also be called a comparison matrix because it contains a list of values in a grid format."
        ]
    },
    {
        "word": "Mavericks",
        "type": [],
        "definition": [
            "Mavericks (also called OS X 10.9) is the tenth version of OS X, Apple's desktop operating system.  It supersedes OS X 10.8 (Mountain Lion) and was released on October 22, 2013 as a free update for all OS X users.\nOS X Mavericks is the first free version of OS X (formerly Mac OS X) and also the first version that does not reference a feline in its name.  While \"Mavericks\" is a significant change in the nomenclature of OS X, the user interface remains similar to previous versions of the operating system.  For example, Mavericks is still based on the Finder, which includes a menu bar, dock, and a desktop background.  It also runs nearly all applications designed for previous versions of OS X.\nThough Mavericks is not significantly different than Mountain Lion, it does includes several new features.  For example, in previous versions of OS X, the menu bar was only displayed on one screen, even if a Mac was connected to multiple displays.  In OS X 10.9, the menu bar now shows up at the top of all connected monitors and corresponds to the front application open on that display.  Additionally, each screen can be used in full-screen mode at the same time, which was not possible before.  Mavericks is the first version of OS X to include Finder Tabs, which provides a tabbed interface for open Finder windows.  It also supports Tags, or the capability to tag individual files with certain words, which provides a new way or organizing documents.\nBesides these system updates, Mavericks is the first version of OS X to include iBooks and Maps, which were both previously only available on iOS devices.  It also includes new power-saving features that use energy more efficiently.  For example, the \"Timer Coalescing\" groups low-level operations together, which allows the CPU to enter a low-power state more often.  \"App Nap\" slows down background applications and \"Safari Power Saver\" prevents browser plug-ins from running outside the active window.  These improvements, while not obvious to the user, reduce power consumption and increase battery life on Apple laptops."
        ]
    },
    {
        "word": "Maximize",
        "type": [],
        "definition": [
            "When you maximize a window on your computer screen, it becomes larger.  In Windows, maximizing a window makes it take up the entire screen.  In Mac OS X, a maximized window typically only takes up as much space as it needs.\nTo maximize a window in Windows, click the button with a square icon next to the close button in the upper-right corner of the window, or double-click the title bar.  The maximized window should expand to fill the screen.  Once the window is expanded, the maximize button may change to a \"restore\" button.  If you click the restore button or double-click the title bar again, the window will change back to its previous size.\nTo maximize a window in Mac OS X, click the green button in the upper-left corner of the window.  The window will expand to take up as much space as it needs to show the window's contents.  If you click the maximize button again, the window will revert to its previous size.  The maximize feature in Mac OS X is also called \"zoom.\"\nOn both Windows and Macintosh computers, the maximize button is located next to the minimize button, which hides the window."
        ]
    },
    {
        "word": "Mbps",
        "type": [],
        "definition": [
            "Stands for \"Megabits Per Second.\"  One megabit is equal to one million bits or 1,000 kilobits.  While \"megabit\" sounds similar to \"megabyte,\" a megabit is roughly one eighth the size of a megabyte (since there are eight bits in a byte).  Mbps is used to measure data transfer speeds of high bandwidth connections, such as Ethernet and cable modems."
        ]
    },
    {
        "word": "Mebibyte",
        "type": [],
        "definition": [
            "A mebibyte is a unit of data storage that equals 2 to the 20th power, or 1,048,576 bytes.\nWhile a megabyte can be estimated as 10^6 or 1,000,000 bytes, a mebibyte is exactly 1,048,576 bytes.  This is to avoid the ambiguity associated with the size of megabytes.  A mebibyte is 1,024 kibibytes and precedes the gibibyte unit of measurement.\nFor a list of other units of measurements, view this Help Center article.\nAbbreviation: MiB"
        ]
    },
    {
        "word": "Media",
        "type": [],
        "definition": [
            "In general, \"media\" refers to various means of communication.  For example, television, radio, and the newspaper are different types of media.  The term can also be used as a collective noun for the press or news reporting agencies.  In the computer world, \"media\" is also used as a collective noun, but refers to different types of data storage options.\nComputer media can be hard drives, removable drives (such as Zip disks), CD-ROM or CD-R discs, DVDs, flash memory, USB drives, and yes, floppy disks.  For example, if you want to bring your pictures from your digital camera into a photo processing store, they might ask you what kind of media your pictures are stored on.  Are they on the flash memory card inside your camera or are they on a CD or USB drive?  For this and many other reasons, it is helpful to have a basic understanding of what the different types of media are."
        ]
    },
    {
        "word": "Media Compression",
        "type": [],
        "definition": [
            "Like file compression, the goal of media compression is to reduce file size and save disk space.  However, media compression algorithms are specific to certain types of media, such as image, audio, and video files.\nMost popular image formats use some type of compression.  Three of the most common include JPEG, GIF, and PNG.  JPEG compression, which is commonly used for digital photos, incorporates a lossy compression algorithm that averages nearby colors and removes color variations that are imperceivable by the human eye.  GIF compression reduces the color palette of an image to 256 colors or less, which provides an efficient way to represent each color within the image.  PNG compression uses a lossless compression algorithm that filters the image data and predicts pixel colors based on other nearby pixels.  While each of these algorithms work in different ways, they can all be used to significantly reduce the file size of an uncompressed image.\nSeveral common audio file formats also use compression to save disk space.  Popular audio formats, such as MP3 and M4A use compression algorithms that remove inaudible frequencies and reduce the dynamics of the sound.  Since uncompressed audio files, such as AIFF and WAVE files, take up a lot of disk space, they are often compressed as MP3 or M4A files before they are distributed over the Internet.  These files are typically around one tenth the size of the original audio files and have nearly identical sound quality.\nMost video files are also compressed.  Popular video formats, such as MPEG and DivX compress video using a specific codec.  Each codec uses a custom algorithm that removes redundant information from the video.  For example, if the background of a video doesn't change for a while, a codec can reduce the file size by not redrawing the background every frame.  A video codec may also incorporate audio compression to reduce the size of the audio track.  Since encoded videos are decoded as they are played, the codec that was used to encode a video must also be available to decode the video.  Therefore, in order to play a compressed video file on your computer, your video player software must have the appropriate codec installed.\nRelated file extensions: .JPG, .GIF, .PNG, .MP3, .M4A, .MPG, .DIVX."
        ]
    },
    {
        "word": "Media Queries",
        "type": [],
        "definition": [
            "Media queries are a feature of CSS that enable webpage content to adapt to different screen sizes and resolutions.  They are a fundamental part of responsive web design and are used to customize the appearance of websites for multiple devices.\nMedia queries may be inserted within a webpage's HTML or included in a separate .CSS file referenced by the webpage.  Below is an example of a simple media query:\n@media screen and (max-width: 768px)\n{\n&nbsp; header { height: 70px; }\n&nbsp; article { font-size: 14px; }\n&nbsp; img { max-width: 480px; }\n}\nThe media query above activates if a user's browser window is 768 pixels wide or less.  This could happen if you shrink your window on a desktop computer or if you are using a mobile device, such as a tablet, to view the webpage.\nIn responsive web design, media queries act as filters for different screen sizes.  Like all modules within a cascading style sheet, the ones that appear further down the list override the ones above them.  Therefore, the default styles are typically defined first within a CSS document, followed by the media queries for different screen sizes.  For example, the desktop styles might be defined first, followed by a media query with styles for tablet users, followed by a media query designed for smartphone users.  Styles may also be defined in the opposite order, which is considered \"mobile first\" development.\nWhile min-width is by far the most common feature used in media queries, many others are available as well.  Examples include min-device-width, min-device-height, aspect-ratio, max-color-index, max-resolution, orientation, and resolution.  The resolution value, for instance, may be used to detect HiDPI displays (such as retina displays) and load high-resolution graphics instead of standard images."
        ]
    },
    {
        "word": "Medtech",
        "type": [],
        "definition": [
            "Medtech, short for \"medical technology,\" is an umbrella term that covers all technologies used for medical purposes.  Related terms include biotech, edtech, and fintech.\nWhile technology has been part of medicine for hundreds of years, computers have made several new medical advancements possible.  Examples include:\n\nElectronic patient records\nOnline access to health information\nData sharing across medical facilities\nDigital x-rays, MRIs, and CT scans\nTelehealth, such as remote doctor visits\n\nDigital health data is not just convenient; it also provides useful analytics.  Data from thousands — even millions — of anonymous individuals can provide valuable insights into health trends or changes.  These findings may reveal correlations between lifestyles and specific diseases and help determine what treatments are most effective.\nIn recent years, wearable electronics have played an increasingly significant role in medtech.  Devices like fitness bands and smartwatches record daily activity and heart rate.  Most wearable electronics communicate via Bluetooth to a connected smartphone, providing an easy way to access and monitor personal health data."
        ]
    },
    {
        "word": "Megabit",
        "type": [],
        "definition": [
            "A megabit is 106 or 1,000,000 bits.\nOne megabit (abbreviated \"Mb\") is equal to 1,000 kilobits.  There are 1,000 megabits in a gigabit.  It is important to distinguish megabits (Mb) from megabytes (MB), as there are 8 megabits in a single megabyte.  800 megabits are equal to 100 megabytes.\nMegabits per second (Mbps) is commonly used to measure data transfer rates of broadband Internet connections.  For example, an ISP may offer cable modem Internet access with download speeds up to 200 Mbps and upload speeds up to 20 Mbps.  Fiber connections can provide even faster speeds.  For example, 500\/500 fiber Internet connections are available in certain areas within the U.S. and Europe.  This type of connection provides symmetrical downstream and upstream data transfers at up to 500 megabits per second.\nWhile megabits are used to measure Internet speeds, megabytes are commonly used to measure file size.  This difference can make it tricky to determine how long a download will take to complete.  You must first divide the download speed by eight in order to convert megabits per second to megabytes per second.  For example, if you download a 100 megabyte file at a speed of 40 Mbps, it will take 20 seconds.\n40 Mbps \/ 8 = 5 MBps. &nbsp; &rarr; &nbsp; 100 MB \/ 5 MBps = 20 seconds."
        ]
    },
    {
        "word": "Megabyte",
        "type": [],
        "definition": [
            "A megabyte is 106 or 1,000,000 bytes.\nOne megabyte (abbreviated \"MB\") is equal to 1,000 kilobytes and precedes the gigabyte unit of measurement.  While a megabyte is technically 1,000,000 bytes, megabytes are often used synonymously with mebibytes, which contain 1,048,576 bytes (220 or 1,024 x 1,024 bytes).\nMegabytes are often used to measure the size of large files.  For example, a high resolution JPEG image file might range in size from one to five megabytes.  Uncompressed RAW images from a digital camera may require 10 to 50 MB of disk space.  A three-minute song saved in a compressed format may be roughly three megabytes in size, and the uncompressed version may take up 30 MB of space.  While CD capacity is measured in megabytes (typically 700 to 800 MB), the capacity of most other forms of media, such as flash drives and hard drives, is typically measured in gigabytes or terabytes.\nNOTE: View a list of all the units of measurement used for measuring data storage."
        ]
    },
    {
        "word": "Megahertz",
        "type": [],
        "definition": [
            "One megahertz (abbreviated: MHz) is equal to 1,000 kilohertz, or 1,000,000 hertz.  It can also be described as one million cycles per second.  Megahertz is used to measure wave frequencies, as well as the speed of microprocessors.\nRadio waves, which are used for both radio and TV broadcasts, are typically measured in megahertz.  For example, FM radio stations broadcast their signals between 88 and 108 MHz.  When you tune to 93.7 on your radio, the station is broadcasting at a frequency of 93.7 MHz.\nMegahertz is also used to measure processor clock speeds.  This measurement indicates how many instruction cycles per second a processor can perform.  While the clock speeds of processors in mobile devices and other small electronics are still measured in megahertz, modern computer processors are typically measured in gigahertz.\nAbbreviation: MHz."
        ]
    },
    {
        "word": "Megapixel",
        "type": [],
        "definition": [
            "A megapixel is one million pixels.  It is commonly used to describe the resolution of digital cameras.  For example, a 7.2 megapixel camera is capable of capturing roughly 7,200,000 pixels.  The higher the megapixel number, the more detail the camera can capture.  Therefore, the megapixel count is a significant specification to look for when buying a digital camera.\nA camera's megapixel number is calculated by multiplying the number of vertical pixels by the number of horizontal pixels captured by the camera's sensor, or CCD.  For example, the original Canon Digital Rebel captures 2048 vertical by 3072 horizontal pixels, for a total of 6,291,456 pixels (2048 x 3072).  Therefore, it is estimated to be a 6.3 megapixel camera.  The Sony T10 captures 3072 x 2304 pixels, totaling 7,077,888, which makes it a 7.2 megapixel camera (because not all the pixels are used).\nMegapixels are helpful in marketing digital cameras, because it is easier to say, \"6.3 megapixels\" than \"6,291,456 pixels.\"  It is also a little easier to remember.  However, while megapixels are important, it is helpful to know the other specifications of a camera as well.  For example, shutter speed, shooting modes, start-up time, flash quality, and color accuracy can also make a big difference in the camera's performance.  After all, it doesn't matter how many megapixels your camera has if all your pictures turn out blurry and have poor color.  Therefore, while you should check the megapixel count on a camera before buying it, make sure you check the other specs too."
        ]
    },
    {
        "word": "Meme",
        "type": [],
        "definition": [
            "A meme is a concept or behavior that spreads from person to person.  Examples of memes include beliefs, fashions, stories, and phrases.  In previous generations, memes typically spread within local cultures or social groups.  However, now that the Internet has created a global community, memes can span countries and cultures across the world.  Memes that are propogated online are called \"Internet memes.\"\nExamples of behavioral Internet memes include using Facebook and checking email several times a day.  While Facebook and email are now part of many people's daily life, both technologies are relatively new.  They expanded through technological and social evolution to become commonplace in many cultures.  Now Facebook and email, which are memes themselves, are common mediums used to spread Internet memes.\nAnother type of Internet meme is \"chat slang,\" which includes acronyms and abbreviations used online.  Over the past several years, Internet users have developed ways to communicate faster by creating new shorthand.  Abbreviations like BTW and LOL are part of an entirely new lexicon created by Internet users.  Emoticons, or text-based expressions, such as =) and :-P have become popular memes as well.\nInternet memes may also be subjects, such as people or animals made popular by blogs or other websites.  For example, a politician or celebrity involved in a public scandal may become an Internet meme thanks to numerous bloggers who publish their thoughts on the story.  A household pet may even become a meme if it stars in a YouTube video that goes viral.  These types of Internet memes are typically short-lived, but they are part of the larger meme of social networking, in which people participate in online communities."
        ]
    },
    {
        "word": "Memory",
        "type": [],
        "definition": [
            "Just like humans, computers rely a lot on memory.  They need to process and store data, just like we do.  However, computers store data in digital format, which means the information can always be called up exactly the way it was stored.  Also, unlike our memory, the computer's memory doesn't get worse over time.\nWhile memory can refer to any medium of data storage, it usually refers to RAM, or random access memory.  When your computer boots up, it loads the operating system into its memory, or RAM.  This allows your computer to access system functions, such as handling mouse clicks and keystrokes, since the event handlers are all loaded into RAM.  Whenever you open a program, the interface and functions used by that program are also loaded into RAM.\nRAM is a very high-speed type of memory, which makes it ideal for storing active programs and system processes.  It is different than hard disk space in that RAM is made up of physical memory chips, while hard disks are magnetic disks that spin inside a hard drive.  Accessing RAM is much faster than accessing the hard disk because RAM access is based on electric charges, while the hard drive needs to seek to the correct part of the disk before accessing data.  However, all the information stored in RAM is erased when the computer's power is turned off.  The hard disk, on the other hand, stores data magnetically without requiring any electrical power.  For more information on the difference between RAM and hard disk space, view this Help Center article.\nAnother common type of memory is flash memory, which is typically used for small devices such as digital cameras, USB keychain drives, and portable music players like the iPod nano.  This kind of memory, known as \"electrically erasable programmable read-only memory\" (EEPROM), is convenient for portable devices, since it stores information even when its power source is turned off, but is smaller and more resilient than a hard drive.\nTo summarize, memory is a vital part of the way computers and many electronic devices function.  While memory and RAM can often be used synonymously, it is good to know about other types of memory as well.  Hopefully you will be able to store the information you've learned in your own memory."
        ]
    },
    {
        "word": "Memory Bank",
        "type": [],
        "definition": [
            "A memory bank is a designated section of computer memory used for storing data.  Much like financial bank, a memory bank serves as a repository for data, allowing data to be easily entered and retrieved.  Banks are organized into logical units that are ordered consecutively, providing easy to access individual items.\nMemory banks are commonly used for caching data.  By storing frequently used information in memory banks, the data can be accessed quickly and easily.  This speeds up common tasks that are run within the operating system and other programs.  Various applications may also use memory banks to store data while the program is running.\nSets of physical memory modules may also be referred to as memory banks.  However, to avoid confusion, these are usually called banks of memory."
        ]
    },
    {
        "word": "Memory Leak",
        "type": [],
        "definition": [
            "A memory leak is like a virtual oil leak in your computer.  It slowly drains the available memory, reducing the amount of free memory the system can use.  Most memory leaks are caused by a program that unintentionally uses up increasing amounts of memory while it is running.  This is typically a gradual process that gets worse as the program remains open.  If the leak is bad enough, it can cause the program to crash or even make the whole computer freeze.\nThe most common reason programs have memory leaks is due to a programming error where unused memory is not allocated back to the system.  This means the amount of RAM the program uses is always growing.  Therefore, the program is constantly \"leaking\" memory.  A memory leak may also be caused by a program that requests new memory too frequently, instead of using available memory.  This means each time more memory is requested, the program takes up additional RAM instead of using memory that has already been made available to the program.\nFortunately, memory leaks are not as messy as oil leaks and can be more easily fixed.  Software development applications often include debuggers that can check programs for memory leaks.  Once the source of the leak is found, the programmer can modify the code so that the program uses memory more efficiently.  If you are using a program that has a memory leak, you can temporarily fix the problem by simply quitting the program and opening it again.  Once the program has been quit, the memory is automatically allocated back to the system.  Of course, if the leak continues to be a problem, the best solution is to let the developer know about the issue so it can be fixed."
        ]
    },
    {
        "word": "Memory Module",
        "type": [],
        "definition": [
            "A memory module is another name for a RAM chip.  It is often used as a general term used to describe SIMM, DIMM, and SO-DIMM memory.  While there are several different types of memory modules available, they all serve the same purpose, which is to store temporary data while the computer is running.\nMemory modules come in different sizes and have several different pin configurations.  For example, the original SIMMs had 30 pins (which are metal contacts that connect to the motherboard).  However, newer SIMM chips have 72 pins.  DIMMs commonly come in 168-pin configurations, but some DIMMs have as many as 240 pins.  SO-DIMMs have a smaller form factor than standard DIMM chips, and come in 72-pin, 144-pin, and 200-pin configurations.\nWhile \"memory module\" is the technical term used to describe computer memory, the terms \"RAM,\" \"memory,\" and \"RAM chip\" are just as acceptable.  But remember, while memory terms may be interchangeable, the memory itself is not.  This is because most computers only accept one type of memory.  Therefore, if you decide to upgrade you computer's RAM, make sure the memory modules you buy are compatible with your machine."
        ]
    },
    {
        "word": "Memory Stick",
        "type": [],
        "definition": [
            "Memory Stick is a type of flash memory developed by Sony.  It is used to store data for digital cameras, camcorders, and other kinds of electronics.  Because Memory Stick is a proprietary Sony product, it is used by nearly all of Sony's products that use flash media.  Unfortunately, this also means Memory Stick cards are incompatible with most products not developed by Sony.\nMemory Stick cards are available in two versions: Memory Stick PRO and Memory Stick PRO Duo.  Memory Stick PRO cards are 50mm long by 21.5mm wide and are 2.8mm thick.  Memory Stick PRO Duo cards are 31mm long by 20mm wide and are only 1.6mm thick.  High-speed versions of Memory Stick media support data transfer rates up to 80Mbps, or 10 MB\/sec, which is fast enough to record high-quality digital video."
        ]
    },
    {
        "word": "Menu Bar",
        "type": [],
        "definition": [
            "A menu bar is a user interface element that contains selectable commands and options for a specific program.  In Windows, menu bars are typically located at the top of open windows.  In OS X, the menu bar is always fixed at the top of the screen, and changes depending on what program is currently active.  For Macs with multiple screens, OS X Mavericks (OS X 10.9) displays a different menu bar for the active application within each screen.\nWhile menu bar items vary between applications, most menu bars include the standard File, Edit, and View menus.  The File menu includes common file options such as New, Open…, Save, and Print.  The Edit menu contains commands such as Undo, Select All, Copy, and Paste.  The View menu typically includes zoom commands and options to show or hide elements within the window.\nOther menu bar items may be specific to the application.  For example, a text editor may include a Format menu for formatting selected text and an Insert menu for inserting pictures or other media into a document.  A web browser may include a History menu for reviewing previously visited websites and a Bookmarks menu for viewing bookmarked webpages.  Many programs also include Window and Help menus for selecting window options and viewing Help documentation.\nIf you browse through the options in a menu bar, you’ll notice many of the items have symbols and letters next to them.  These are keyboard shortcuts that allow you to perform commands in the menu by simply pressing a key combination.  For example, the standard keyboard shortcut to save a file is Control+S (Windows) or Command+S (Mac).  By pressing this key combination, you can quickly save an open document without even clicking the menu bar.  While common commands often have keyboard shortcuts, other menu items may not have a shortcut associated with them.  These items can only be selected by choosing the command or option within the menu bar."
        ]
    },
    {
        "word": "Mesh Wi-Fi",
        "type": [],
        "definition": [
            "A mesh Wi-Fi system is a series of Wi-Fi routers that work together to create a single wireless network.  The goal is to provide a reliable and consistent wireless signal across a large home or workspace.\nA basic Wi-Fi network uses a single router to broadcast a wireless signal to multiple devices.  While this functions well in a small area, the signal may not reach certain locations in a larger space.  Obstructions, such as concrete walls and floors, can create \"dead zones\" where the signal strength drops significantly.  The solution is to spread out a \"mesh\" of routers across the area.\nA mesh network consists of a primary router and one or more nodes or \"points.\"  The router and nodes work seamlessly together to create a single wireless network.  By strategically placing nodes across a home or office, it's possible to eliminate dead zones and provide consistent Wi-Fi coverage across the area.\nAs you move around a mesh network, it intelligently switches your connection to the router with the strongest signal, similar to how cellular towers work.\nThanks to the improved range of Wi-Fi 6, most areas under 2,000 square feet only require a single router.  A mesh Wi-Fi network with a single node generally covers up to 4,000 square feet, while a router with two nodes may be sufficient for areas up to 6,000 square feet.  In a large building with multiple floors, a mesh network may require several dozen nodes for consistent coverage.\nMesh Networks vs Range Extenders\nRange extenders, or repeaters, are an alternative way to boost the range of Wi-Fi coverage.  Unlike mesh nodes, range extenders simply repeat the Wi-Fi signal and do not provide \"intelligent\" switching.  They require separate networks for each repeater, which may each have a different wireless passwords.  Because range extenders do not create a seamless network, Wi-Fi mesh systems are a more popular option."
        ]
    },
    {
        "word": "Meta Search Engine",
        "type": [],
        "definition": [
            "Meta search engines are search engines that search other search engines.  Confused?  To put it simply, a meta search engine submits your query to several other search engines and returns a summary of the results.  Therefore, the search results you receive are an aggregate result of multiple searches.\nWhile this strategy gives your search a broader scope than searching a single search engine, the results are not always better.  This is because the meta search engine must use its own algorithm to choose the best results from multiple search engines.  Often, the results returned by a meta search engine are not as relevant as those returned by a standard search engine."
        ]
    },
    {
        "word": "Meta Tag",
        "type": [],
        "definition": [
            "This is a special HTML tag that is used to store information about a Web page but is not displayed in a Web browser.  For example, meta tags provide information such as what program was used to create the page, a description of the page, and keywords that are relevant to the page.  Many search engines use the information stored in meta tags when they index Web pages."
        ]
    },
    {
        "word": "Metadata",
        "type": [],
        "definition": [
            "Metadata describes other data.  It provides information about a certain item's content.  For example, an image may include metadata that describes how large the picture is, the color depth, the image resolution, when the image was created, and other data.  A text document's metadata may contain information about how long the document is, who the author is, when the document was written, and a short summary of the document.\nWeb pages often include metadata in the form of meta tags.  Description and keywords meta tags are commonly used to describe the Web page's content.  Most search engines use this data when adding pages to their search index."
        ]
    },
    {
        "word": "Metafile",
        "type": [],
        "definition": [
            "A metafile can refer to two different types of computer files.  The first is a file that describes the contents of other files.  This type of metafile may contain metadata, which defines a group other files and gives a summary of what data they contain.\nThe second type of metafile is most often used in computer graphics.  These files define objects and images using a list of coordinates.  They are typically used for vector images, such as Adobe Illustrator, CorelDRAW, and EPS files, but can include raster images as well."
        ]
    },
    {
        "word": "Metaheuristic",
        "type": [],
        "definition": [
            "A heuristic is a set of rules for solving problems or making decisions.  In computer science, heuristics are the foundation of algorithms.  Metaheuristics are larger principles or guidelines that establish the heuristics used to create algorithms.\nBoth heuristics and metaheuristics apply to computer programming.  A heuristic applies to a specific problem, while a metaheuristic is a general guideline that is problem-independent.  Developers use metaheuristics to produce consistent programming practices, while they develop heuristics for specific solutions.\nFor example, a software development team may build a search engine using both metaheuristics and heuristics.  Below are examples of each:\nSearch Metaheuristics\nThe following metaheuristics apply to all search engines:\n\ncreate an index of searchable data to improve search efficiency\nuse a \"fuzzy search\" to search for terms similar to   keywords entered by the user, instead of only exact matches\norder results by most relevant to least relevant\n\nSearch Heuristics\nThe following heuristics may apply to a specific type of  search engine:\n\nproduce search results that are most relevant to the user's location\ncustomize search results based on information stored in the user's account\nuse search history to provide a list of autocomplete search phrases\n\nThe first list above provides general guidelines for an effective search engine.  The second list provides specific features a search engine should have.  In some cases, heuristics and metaheuristics may overlap in their scope.  The best way to distinguish between the two is to determine if it is a general rule (metaheuristic) or if it applies to a specific problem\/solution (heuristic)."
        ]
    },
    {
        "word": "Metaverse",
        "type": [],
        "definition": [
            "The metaverse is a virtual world where people can interact, learn, work, shop, and create in a 3D environment.  It combines virtual reality with an open-world multiplayer setting, similar to those offered by Roblox and Fortnite.\nWhile still in the early stages, the goal of the metaverse is to provide a virtual environment that simulates reality.  It will allow people to explore an online space, meet other people, and build relationships.  The metaverse will also support buying and selling virtual goods online.\nIn many ways, the metaverse simulates real life, but it also provides an alternate reality.  For example, users create avatars, or characters, to represent themselves in the virtual world.  Each user's avatar is a personalized creation that may appear similar or completely different than the actual person.\nMetaverse combines the words \"meta\" and \"universe.\"  While \"meta\" has several different meanings, in \"metaverse,\" it means something of a higher or second-order kind.  In other words, the metaverse is another realm that exists outside the real world.\nMetaverse Requirements\nThe idea of a metaverse has existed for decades, but only in recent years has technology made it possible.  The metaverse itself is hosted by hundreds, or even thousands, of interconnected servers around the world.  Each client, or user, who connects to the metaverse, must have the following technologies:\n\nHigh-speed Internet connection\nFast GPU (graphics processor)\nVR (virtual reality) headset\n\nMetaverse Examples\nA prime example of a metaverse is the virtual world represented in the movie \"Ready Player One,\" released in 2018.  Online multiplayer games like Second Life, Fortnite, Minecraft, and Roblox have elements of the metaverse, but their worlds are self-contained and don't incorporate virtual reality.\nIn 2021, Facebook changed the company name to \"Meta.\"  It plans to leverage its large social community and Oculus VR technology to create a new metaverse."
        ]
    },
    {
        "word": "Method",
        "type": [],
        "definition": [
            "A method is a subroutine attached to a specific class defined in the source code of a program.  It is similar to a function, but can only be called by an object created from a class.\nIn the Java example below, the method getArea is defined within the class rectangle.  In order for the getArea method to be used by a program, an object must first be created from the rectangle class. \nclass Rectangle\n{\n&nbsp;&nbsp; int getArea(int width, int height)\n&nbsp;&nbsp; {\n&nbsp;&nbsp; &nbsp;&nbsp; int area = width * height;\n&nbsp;&nbsp; &nbsp;&nbsp; return area;\n&nbsp;&nbsp; }\n}\nMethods are an important part of object-oriented programming since they isolate functions to individual objects.  The methods within a class can only be called by objects created from the class.  Additionally, methods can only reference data known to the corresponding object.  This helps isolate objects from each other and prevents methods within one object from affecting other objects.\nWhile methods are designed to isolate data, they can still be used to return values to other classes if necessary.  If a value needs to be shared with another class, the return statement (as seen in the example above) can be used."
        ]
    },
    {
        "word": "Microblogging",
        "type": [],
        "definition": [
            "Microblogging is posting brief and often frequent updates online.  Unlike traditional blogs, which are often hosted on a custom website, microblogs are typically published on social media sites like Twitter or Facebook.\nThe most common microblogging platform is Twitter, which allows allows you to post updates of 140 characters or less.  These updates, called tweets, may include hashtags, mentions (links to other Twitter users), or links to online resources, such as webpages, images, or videos.  When you microblog using Twitter, your updates are seen by all users who have chosen to \"follow\" you.\nMicroblogging on Facebook is more flexible than on Twitter, since you can post longer updates and include media directly in your posts.  You can also share content with other users, similar to Twitter's \"retweet\" feature.  Though Facebook makes it easy to post quick updates, its focus is more towards social networking than microblogging.  Therefore, Twitter remains the most popular microblogging platform.\nWhile Facebook and Twitter dominate the microblogging scene, there are several other options available.  One popular service is Tumblr, a website (owned by Yahoo!) that was designed specifically for microblogging.  Tumblr allows you to easily insert photos, videos, quotes, and links into your posts and includes a \"reblog\" feature for sharing other users' posts.  Another service is Google+, which is similar to Facebook, and allows you to post updates that can be seen by the public or specific user within Google+ circles.  Instagram (owned by Facebook) is a microblogging platform designed for sharing images, while Vine allows you to share short videos."
        ]
    },
    {
        "word": "Microcomputer",
        "type": [],
        "definition": [
            "A microcomputer is a computer designed for individual use.  The term was introduced in the 1970s to differentiate desktop computer systems from larger minicomputers.  It is often used synonymously with the term \"desktop computer,\" but it may refer to a server or laptop as well.  \nIn the 1960s and 1970s, computers were much larger than today, often taking up several cubic feet of space.  Some mainframe computers could even fill a large room.  Therefore, the first computers that could fit on a desktop were appropriately labeled \"microcomputers\" in comparison to these larger machines.\nThe first microcomputers became available in the 1970s and were used primarily by businesses.  As they became cheaper, individuals were able to buy their own microcomputer systems.  This led to the personal computer revolution of the 1980s, in which microcomputers became a mainstream consumer product.\nAs microcomputers grew in popularity, the name \"microcomputer\" faded and was replaced with other more specific terms.  For example, computers purchased for business purposes were labeled as workstations, while computers bought for home use became known as personal computers, or PCs.  Eventually, computer manufacturers developed portable computers, which were called laptops.  While computers have evolved a lot over the past few decades, these same terms are still used today."
        ]
    },
    {
        "word": "Microcontroller",
        "type": [],
        "definition": [
            "A microcontroller (or MCU for \"microcontroller unit) is a small integrated circuit that controls an electronic device.  It is similar to a microprocessor but includes memory and other integrated components.\nA typical microcontroller includes the following elements:\n\nCPU - ranging from a simple 4-bit processor to a full-blown 64-bit processor\nRAM - high-speed volatile memory used to store data temporarily\nFlash memory - a type of non-volatile memory used to store data with or without electrical power\nI\/O interface - serial ports or other connectors for peripheral devices\nWireless communications - transmitters or receivers for sending and receiving wireless signals\n\nSome MCUs are several inches long and wide.  Others are extremely small, with a length and width of less than one millimeter.  Because microcontrollers are integrated circuits, most are relatively flat.  Below are examples of different types of microcontrollers:\n\nan image processor on a digital camera\na digital-to-analog converter (DAC) in a powered speaker\na temperature sensor in a washing machine or dryer\na Wi-Fi transmitter in a smart appliance\na motion tracker in a smartwatch\n\nNearly all electronic devices include microcontrollers.  Many include multiple MCUs that operate in tandem.  An automobile, for example, may contain dozens of microcontrollers for sensors, communication, and user interface functions."
        ]
    },
    {
        "word": "Microkernel",
        "type": [],
        "definition": [
            "A microkernel is a minimalistic kernel designed to be as small as possible.  It contains only the basic code needed to communicate with hardware and load an operating system.\nMost modern kernels, sometimes called \"monolithic kernels,\" contain several million lines of code.  For example, the Linux 3.0 kernel includes over 15 million lines.  Microkernels, on the other hand, generally contain less than 10,000 lines of code.  They are able to maintain a small size by loading most system processes in the user mode rather than the kernel itself.\nA monolithic kernel may include device drivers, file system support, and inter-process communication (IPC) protocols for applications.  A microkernel only includes basic system IPC protocols and memory management functions.  Everything else is loaded in user mode (when a user logs on).  This keeps the kernel size small and also provides a modular type of OS since custom drivers and file systems can be loaded by the kernel.\nMicrokernels were popular in the 1980s because of the memory and storage limitations of early computer systems.  While they are still used for some server OSes, most major operating systems, such as Windows and OS X, use monolithic kernels."
        ]
    },
    {
        "word": "Micron",
        "type": [],
        "definition": [
            "A micron is a small unit of measurement that measures length.  It is another name for \"micrometer,\" which is one thousandth of a millimeter, or one millionth of a meter.  An object that is only a single micron wide is not visible by the human eye.  However, a human hair, which has a width around 50 micron, can been seen.\nMicrons are used in many industries, such as biology (e.g., to measure cell size) and chemical engineering (e.g., to measure particle filtration).  They are also used in computing to measure the size of elements within integrated circuits and other components.  Additionally, manufacturing specifications may state the dimensions of a product must fall within a certain micron number to meet quality control standards.\nWhile a micron is extremely small, it is still too large to measure some computing components such as transistors and bus widths.  These are often measured in nanometers, which are one thousandth of a micron, or one billionth of a meter.\nNOTE: The term \"micron\" used is in both singular and plural cases.  For example, one micron is half the length of two micron.  While the term \"micron\" is still used in some industries, micrometers have become a more standard unit of measurement.\nAbbreviation: µ"
        ]
    },
    {
        "word": "Microphone",
        "type": [],
        "definition": [
            "A microphone is a device that captures audio by converting sound waves into an electrical signal.  This signal can be amplified as an analog signal or may be converted to a digital signal, which can be processed by a computer or other digital audio device.\nWhile all microphones (or \"mics\") serve the same basic function, they can capture audio in several different ways.  Therefore, multiple classes of microphones exist.  The three most common types are described below.\n\nDynamic - Dynamic microphones are the most widely used microphones.  They have a simple design that includes a magnet wrapped by a metal coil.  A thin sheet called a diaphragm is placed on the front end of the magnet and transmits vibrations from sound waves to the coil.  The coil then transfers these vibrations to electrical wires that transmit the sound as an electrical signal.  Since dynamic microphones use a simple design, they are typically very durable and do not require electrical power. \nCondenser - Condenser microphones are commonly used for audio recording purposes.  They are known for their sensitivity and flat frequency response.  Each condenser microphone includes a front plate (the diaphragm) and a back plate that is parallel to the front plate.  When sound waves hit the diaphragm, it vibrates and alters the distance between the two plates.  This change is transmitted as an electrical signal.  Unlike dynamic microphones, condensers require electrical power.  This current may be provided by an internal battery, but is most often provided as 48 volt \"phantom power\" from an external preamp or mixing console.\nRibbon - Ribbon microphones are also known for their high fidelity.  They contain a thin ribbon made of a aluminum, duraluminum, or nanofilm, which is suspended in a magnetic field.  Incoming sound waves make the ribbon vibrate, generating voltage proportional to the velocity of the vibration.  This voltage is transmitted as an electrical signal.  While early ribbon microphones required a transformer to increase the output voltage, modern ribbon mics have improved magnets that provide a stronger signal – in some cases even stronger than dynamic microphones.  Though ribbon mics have been largely replaced by condensers, several models are still manufactured and used today.\n\nNot only do microphones come in several different classes, they also use several types of directional patterns to capture audio.  Some microphones are designed with a single \"polar pattern,\" while others have switches that allow you to select the appropriate pattern for a specific recording purpose.  Some of the most common patterns include:\n\nCardioid - a heart or bean-shaped pattern that captures audio from one direction; commonly used for recording vocals or a single instrument.\nBidirectional - a figure 8 pattern that captures audio from two separate directions; may be used for recoding audio from two different sources or to capture reverb.\nOmnidirectional - a circular pattern that captures audio from all directions; often used to capture groups of vocalists or ambient sounds.\n\nNOTE: Microphones perform the opposite action of speakers, which convert electrical signals into sound waves."
        ]
    },
    {
        "word": "Microsoft",
        "type": [],
        "definition": [
            "Microsoft is a US-based technology company.  It was founded by Bill Gates and Paul Allen in 1975 and quickly grew to become the largest software company in the world.  Today, Microsoft is still widely known for its software, but the company also develops hardware and provides a number of cloud services.\nMicrosoft's most recognizable software titles include Windows and Office.  Microsoft Windows is the world's most popular desktop operating system and Office is the most popular productivity suite.  Below is a list of some of the software, hardware, and cloud services provided by Microsoft.\nSoftware\n\nWindows - operating system for desktop computers, laptops, and tablets\nOffice - productivity suite including Word, Excel, PowerPoint, and Access\nOutlook - email and calendar software\nVisio - diagramming and vector drawing program\nVisual Studio - multi-platform software development IDE for building apps\nSkype - video conferencing application\nHalo - popular series of video games for Xbox\n\nHardware\n\nXbox - video game console first launched in 2001; followed by Xbox 360, Xbox One, and Xbox One X\nSurface - line of tablets and laptop computers\nHoloLens - head-mounted smartglasses designed for augmented reality\nInput devices - Microsoft branded keyboards and mice\n\nServices\n\nBing - web search engine integrated into Windows 10\nOutlook.com - free webmail service also used for Hotmail accounts\nOneDrive - cloud storage with web-based access\nAzure - cloud computing platform for hosting data and deploying applications\n\nMicrosoft's headquarters is located in Redmond, Washington, but the company has corporate offices and data centers around the world.  Microsoft Corporation's ticker symbol is MSFT."
        ]
    },
    {
        "word": "Middleware",
        "type": [],
        "definition": [
            "Middleware has two separate but related meanings.  One is software that enables two separate programs to interact with each other.  Another is a software layer inside a single application that allows different aspects of the program to work together.\nThe most common type of middleware is software that enables two separate programs to communicate and share data.   An example is software on a Web server that enables the HTTP server to interact with scripting engines like PHP or ASP when processing webpage data.  Middleware also enables the Web server to access data from a database when loading content for a webpage.  In each of these instances, the middleware runs quietly in the background, but serves as an important \"glue\" between the server applications.\nMiddleware also helps different applications communicate over a computer network.  It enables different protocols to work together by translating the information that is passed from one system to another.  This type of middleware may be installed as a \"Services-Oriented Architecture\" (SOA) component on each system on the network.  When data is sent between these systems, it is first processed by the middleware component, then output in a standard format that each system can understand.\nMiddleware can also exist within a single application.  For example, many 3D games use a \"3D engine\" that processes the polygons, textures, lighting, shading, and special effects in the game.  3D engines are considered middleware, since they bring different aspects of the game together.  For example, the game's artificial intelligence works in conjunction with the 3D engine to create the gameplay.\nGame engine middleware includes a custom API, which provides developers with standard functions and commands used for controlling objects within the game.  This simplifies game development by allowing programmers to use a library of prewritten functions rather than creating their own from scratch.  It also means 3D engines can be used in more than one game."
        ]
    },
    {
        "word": "Mini DV",
        "type": [],
        "definition": [
            "Most digital camcorders record video and audio on a Mini DV tape.  The cassettes measure 2.6 x 1.9 x 0.5 inches (L x W x H), while the tape itself is only 0.25 inches thick.  A Mini DV tape that is 65 meters long can hold an incredible 11GB of data, or 80 minutes of digital video.\nThe small size of Mini DV tapes has helped camcorder manufacturers reduce the size of their video cameras significantly.  Some consumer cameras that use Mini DV tapes are smaller than the size of your hand.  Because Mini DV tapes store data digitally, the footage can be exported directly to a computer using a Firewire (IEEE 1394) cable.  So if you want to record video and edit it on your computer, avoid the SVHS and Hi-8 options and make sure to get a camera that uses Mini DV."
        ]
    },
    {
        "word": "Minicomputer",
        "type": [],
        "definition": [
            "While a minicomputer sounds like a small computer, the name can be a bit misleading.  In fact, minicomputers are several times the size of desktop PCs and are only one step below mainframes in the hierarchy of computer classes.\nThe term \"minicomputer\" was introduced in the 1960s to describe powerful computers that were not as large as mainframes, which sometimes could fill an entire room.  Instead, most minicomputers were a few feet wide and several feet tall.  They were primarily used by large businesses during the 1960s and 1970s to process large amounts of data.  Some minicomputers also functioned as servers, allowing multiple users to access them from connected terminals.\nAs computer processors became smaller and more powerful, microcomputers began to rival minicomputers in processing power.  Therefore, in the 1980s, minicomputers started becoming less relevant and eventually became obsolete.  Today, rack-based servers perform similar functions to minicomputers."
        ]
    },
    {
        "word": "Minification",
        "type": [],
        "definition": [
            "In computer science, minification is the process of removing unnecessary elements and rewriting code to reduce file size.  It is commonly done to web page resources, such as HTML, CSS, and JavaScript files.  Reducing the size of web resources allows the files to be transferred more quickly, making web pages load faster.\nThere are several ways to minify data.  The most basic is to remove comments, unnecessary spaces, and line breaks (newline characters).  While comments and whitespace help make the code more readable, they are ignored by the browser.  Therefore these elements can be safely removed before publishing.  Another method is to minimize the code required for each statement.  In CSS, this is often accomplished by converting longhand CSS to shorthand CSS.  For example, a margin definition might take seven lines in longhand, but only one line in shorthand.  In JavaScript, long variable names can be replaced with shorter ones (often a single character.\nBelow is an example of CSS code before and after minification.  Note how the comments, spaces, line breaks, and unnecessary semicolons are removed.  The code is also converted from longhand CSS to shorthand.\nStandard CSS code\nimg.left &nbsp; \/* float left 400px image *\/\n{\n&nbsp; &nbsp; float: left;\n&nbsp; &nbsp; max-width: 400px;\n&nbsp; &nbsp; margin-top: 8px;\n&nbsp; &nbsp; margin-right: 30px;\n&nbsp; &nbsp; margin-bottom: 12px;\n&nbsp; &nbsp; margin-left: 0px;\n}\nMinified CSS code\nimg.left{float:left;max-width:400px;margin:8px 30px 12px 0}\nAdvanced minification algorithms can reduce file size even further.  A CSS minifier, for instance, may find and remove duplicate lines within a CSS file.  It may also combine similar CSS definitions into a single statement.  A JS minifier may actually rewrite JavaScript functions to be more efficient.\nMinifying code often saves only a few kilobytes.  For example, a standard CSS file may be 50KB and the minified version may be 40KB.  However, when improving page load speed, every kilobyte matters.  The goal of a good minifier is to reduce file size as much as possible with zero impact on the way the code is parsed or processed.  Regardless of what minifier is used, developers typically maintain a non-minified version of the code for future editing.\nMinification vs Compression\nWhile minification and file compression both reduce file size, they are not identical.  Minification simply alters the text while file compression completely rewrites the binary code within a file.  A compressed file must be decompressed by file decompression utility in order to be read as a text file.  Many websites use a combination of minification and \"gzip\" file compression to reduce the size of web resources as much as possible."
        ]
    },
    {
        "word": "Minimize",
        "type": [],
        "definition": [
            "When you minimize a window, you hide it from view.  This is commonly done to unclutter the display or to view other open windows without closing the current window.  In Windows, minimizing a window will create a button for it in the taskbar.  In Mac OS X, an icon for the minimized window is added to the right size of the dock.\nTo minimize a window in Windows, click the button with the icon of a horizontal line, located in the upper-right corner of the window.  This will hide the window and create a corresponding button for it in the taskbar.  To open the window again, simply click the button in the taskbar.\nTo minimize a window in Mac OS X, click the yellow button in the upper-left corner of the window or double-click the title bar.  This will shrink the window into an icon that is stored in the dock.  Like Windows, clicking the icon will open the window again.  One fun thing to try is to hold the Shift key while clicking the minimize button.  Instead of shrinking immediately, the window will contract into the dock in slow motion.\nThe minimize button is located next to the maximize button on both Macintosh and Windows computers."
        ]
    },
    {
        "word": "Minisite",
        "type": [],
        "definition": [
            "A minisite, sometimes called a microsite, is a small website dedicated to a specific topic.  Most minisites contain around five pages, though a minisite may be as small as a single webpage or as large as 20 pages.\nMinisites are often related to larger websites.  For example, a sporting goods website may have several associated minisites.  Each of these small websites would be dedicated to a specific related topic, such as running shoes, soccer clothing, or hockey equipment.  The purpose of these minisites would be to drive traffic to the larger sporting goods website.\nWhile minisites are created for a number of reasons, the most common is e-commerce.  For example, affiliates often build minisites that drive traffic to large retailers in order to generate commissions.  Some online retailers may even create their own minisites to broaden their reach.  If a publisher is able to get several sites ranked highly in search engines, it may result in more traffic and therefore more sales.\nWhile creating minisites may seem like a good strategy for increasing Web traffic, small websites with limited content typically do not rank well in search engines.  Therefore, many companies have found that it is more productive to add content to the main site rather than spread it out across multiple sites.\nNOTE: \"Microsite\" and \"minisite\" are often used synonymously.  However, a microsite may refer specifically to a minisite that only contains one page."
        ]
    },
    {
        "word": "Mirror",
        "type": [],
        "definition": [
            "In computing, a mirror is a server that provides an exact copy of data from another server.  This may be one or more files, a database, a website, or an entire server.\nMirroring is designed to provide fault tolerance, or a means of redundancy in case something goes wrong with the primary or \"principal\" server.  If principal server unexpected goes offline, for example, the mirror server can take over.  This process may be performed automatically, but it requires a third system, called a \"witness\" server.  This machine monitors both servers and transfers all traffic to the mirror if an outage is detected with the principal server.\nServer mirroring can also be used for planned maintenance, such as upgrading a server or running software updates that require services to be stopped or restarted.  In these instances, a server admin can manually set the mirror as the principal server to avoid downtime.  Some mirroring setups allow \"role switching,\" in which the principal and mirror servers can be swapped at any time.\nAnother type of mirroring – FTP mirroring – simply provides one or more files from multiple servers.  For example, a download page may list several \"mirror\" URLs, which all offer the same file.  The mirrors are typically listed by geographical location, so you can select the one closest to you.  While FTP mirrors still exist, they have faded in popularity as automatic location detection and content delivery networks have automated this process."
        ]
    },
    {
        "word": "Mirrored Volume",
        "type": [],
        "definition": [
            "A mirrored volume is a hard drive or other form of storage media that stores an exact copy of the data from another volume.  It is used for fault tolerance, which means mirrored volume serves as a backup device in case the primary device fails.\nCompanies and organizations that store critical information typically \"mirror\" the data on another drive.  Using a mirrored volume decreases the chance of losing data exponentially.  For example, if the odds of a hard drive going bad is 1 out of 200, the odds of two drives going bad at the same time is 1 out of 40,000.\nMirroring data can be done using various backup software programs or may be enabled within operating systems that support disk mirroring.  While using a mirrored volume helps keep data safe, it also slows down data transfers because the data must always be written twice.  It also costs more, since mirroring data requires twice as much disk storage than what would otherwise be required.  However, the cost of an extra hard drive is usually well worth the security of having important data backed up.\nMirroring may also be referred to as \"duplexing\" or RAID 1."
        ]
    },
    {
        "word": "Mixed Reality",
        "type": [],
        "definition": [
            "Mixed reality is a blend of physical and virtual worlds that includes both real and computer-generated objects.  The two worlds are \"mixed\" together to create a realistic environment.  A user can navigate this environment and interact with both real and virtual objects.\nMixed reality (MR) combines aspects of virtual reality (VR) and augmented reality (AR).  It sometimes called \"enhanced\" AR since it is similar to AR technology, but provides more physical interaction.\nMixed Reality vs Virtual Reality\nVirtual reality provides a virtual experience that is completely digitally created.  A user can enter a virtual world by putting on a VR headset that includes audio and video.  As the user moves his head, he can look around the three-dimensional space.  A VR headset may also come with gloves or handheld sticks that can be used to interact in the virtual environment.  Unlike virtual reality, mixed reality starts with a physical space and places virtual objects within it.  A user can interact with these objects without wearing special gloves.   A VR headset is totally black when it is turned off, while an MR headset is see-through like a pair of glasses.\nMixed Reality vs Augmented Reality\nMixed reality is closer to augmented reality than virtual reality.  Like MR, AR uses a real environment.  It \"augments\" reality by overlaying virtual objects on top of it, such as a Snapchat filter.  However, the user cannot interact directly with virtual objects.  For example, AR has the capability to display a virtual 3D box on a physical table.  With MR, the user might be able to pick up and open the box.\nAR only requires a handheld device that has a camera and screen, such as a smartphone.  Since MR enables the user to interact directly with the 3D environment, it requires a head-mounted display, such as Microsoft's HoloLens.\nMixed Reality has several applications, such as virtual training for police, remote guidance for construction workers, and virtual testing for engineers.  While still in the early stages, MR can also be combined with robotic technology.  This could allow a surgeon to perform surgeries remotely."
        ]
    },
    {
        "word": "Mnemonic",
        "type": [],
        "definition": [
            "A mnemonic (pronounced \"nemonic\") is a pattern that can be used as an aid for memorizing information.  Most often, this pattern consists of letters or words.  For example, the phrase \"Every Good Boy Does Fine\" can be used to help music students remember the notes of the staff, E, G, B, D, and F.  The name \"Roy G. Biv\" is often used to memorize the order of colors in a rainbow (or other light spectrum) -- Red, Orange, Yellow, Green, Blue, Indigo, Violet.\nWhile initials of words are commonly used as mnemonic devices, rhyming words and poems can also be used to memorize information.  Furthermore, images can be associated with words or phrases to help memorize them.  Because the human brain organizes information in \"chunks,\" mnemonics help people categorize information better, which makes it easier to remember."
        ]
    },
    {
        "word": "Mobile",
        "type": [],
        "definition": [
            "The word \"mobile\" has a storied history in the computer world.  The term was initially used in the 1980s to describe computers that you could take with you and use while you were on-the-go.  These devices eventually became small and light enough to fit on your lap and were known as laptops.  For many years, \"mobile\" differentiated between desktop computers and their portable counterparts.\nThen came the smartphone.  Spurred by the release of the first iPhone in 2007, mobile phones evolved into small computers that could surf the web, send email, and run different apps.  The IT community started using the word \"mobile\" to describe cell phones as well as computers.\nNext came tablets.  These lightweight touchscreen devices, which are even more portable than laptops, introduced a new mobile category between laptops and smartphones.  \"Mobile\" evolved into an umbrella term that now describes laptops, tablets, and smartphones.\nThe Different Meanings of Mobile\nWhen used in different contexts, such as \"mobile development,\" \"designing for mobile,\" and \"mobile-friendly,\" the term \"mobile\" can have different meanings.  For example, \"mobile development\" typically refers to creating touch-based apps for tablets and smartphones, but not laptops.  \"Designing for mobile\" might refer to responsive web design that supports mobile devices with smaller screens, such as tablets and smartphones.\n\"Mobile-friendly\" refers to websites that are easy to use on smartphones.  In this case, \"mobile\" is used synonymously with \"smartphone,\" but not necessarily tablet.  This smartphone-specific definition of mobile has become common in web analytics.  For example, Google Analytics separates traffic by device into Desktop, Tablet, and Mobile categories.  \"Desktop\" refers to both desktop and laptop computers, while \"Mobile\" refers specifically to smartphones."
        ]
    },
    {
        "word": "Mod Function",
        "type": [],
        "definition": [
            "A mod function divides two numbers and returns the remainder.  It requires the same input values as a division operation but outputs the \"leftover\" value instead of the division result.  For example:\n\n7 mod 3 = 1\n8 mod 3 = 2\n\nIf there is no remainder, the result is zero.\n\n9 mod 3 = 0\n\nIn mathematical formulas, the mod or \"modulo\" operator is often represented with a percentage sign.  For example, 7 mod 3 can be written as the following expression:\n\n7 % 3 = 1\n\nIn computer science, a mod function may be written as mod(x,y), or something similar, depending on the programming language.  For example:\n\nmod(7,3) = 1\n\nThe function above divides the first value (dividend) by the second value (divisor) and returns the remainder.  Because 7 ÷ 3 = 2r1, the result of mod(7,3) is 1.\nMod Function Applications\nThe mod function has several uses in computer programming.  Since the result must be less than the divisor, it can limit results to a specific range.  For example mod(x,4) can only return 0, 1, 2, or 3, assuming x is an integer.  It is useful for checking every nth value or categorizing results into a limited number of \"buckets.\"\nIn most programming languages, 0 evaluates as false, and other numbers evaluate as true.  Therefore, a mod function can provide a boolean result — false if two numbers are evenly divisible and true if they are not.  Below is an example of a mod function within an if statement:\nif (mod(x,5)) then { ... }\nIf x is not evenly divisible by 5, the code in the then clause will execute.  If x is divisible by five — 5, 10, 15, 20, etc —  the code will not.\nNOTE: Mod functions often have two integers as arguments.  However, floating point numbers are also acceptable.  Two integer values always produce an integer, but one or more fractional inputs may output a fractional result.  For instance, 8 % 2.5 = 0.5 since 8 ÷ 2.5 = 3r0.5."
        ]
    },
    {
        "word": "Modem",
        "type": [],
        "definition": [
            "Modem is short for \"Modulator-Demodulator.\"  It is a hardware component that allows a computer or another device, such as a router or switch, to connect to the Internet.  It converts or \"modulates\" an analog signal from a telephone or cable wire to digital data (1s and 0s) that a computer can recognize.  Similarly, it converts digital data from a computer or other device into an analog signal that can be sent over standard telephone lines.\nThe first modems were \"dial-up,\" meaning they had to dial a phone number to connect to an ISP.  These modems operated over standard analog phone lines and used the same frequencies as telephone calls, which limited their maximum data transfer rate to 56 Kbps.  Dial-up modems also required full use of the local telephone line, meaning voice calls would interrupt the Internet connection.\nModern modems are typically DSL or cable modems, which are considered \"broadband\" devices.  DSL modems operate over standard telephone lines, but use a wider frequency range.  This allows for higher data transfer rates than dial-up modems and enables them to not interfere with phone calls.  Cable modems send and receive data over standard cable television lines, which are typically coaxial cables.  Most modern cable modems support DOCSIS (Data Over Cable Service Interface Specification), which provides an efficient way of transmitting TV, cable Internet, and digital phone signals over the same cable line.\nNOTE: Since a modem converts analog signals to digital and vice versa, it may be considered an ADC or DAC.  Modems are not needed for fiber optic connections because the signals are transmitted digitally from beginning to end."
        ]
    },
    {
        "word": "Modifier Key",
        "type": [],
        "definition": [
            "A modifier key modifies the action of another key when the keys are pressed at the same time.  Common modifier keys include Shift, Function, Control, Alt, Command, and Option.  The Shift key is found on all keyboards, while the other keys may be exclusive to laptops or Windows or Macintosh computers.  Below is a list of the common modifier keys and their primary uses.\n\nShift - used for capitalizing letters and entering different types of symbols.\nFunction (Fn) - commonly found on laptop computers and used to enter the F1 - F15 commands if the function keys also have other functions (such as brightness and volume controls).\nControl (Ctrl) - a Windows key used for entering keyboard shortcuts, such as Ctrl+S for saving a file or Ctrl+P for printing a document.\nAlt - a Windows key that is also called the Alternate or Alternative key; used in combination with the numeric keypad for entering \"Alt codes,\" which output special characters; may also be used in combination with the Control key for entering keyboard shortcuts.\nCommand (Cmd) - a Macintosh key (similar to the Windows Control key) used for entering keyboard shortcuts; may have a four leaf clover or Apple icon printed on the key.\nOption - A Macintosh key (similar to the Windows Alt key) used for entering special characters; may also be used in combination with the Command key for entering keyboard shortcuts.\n\nTo enter a key combination that requires a modifier key, first press the modifier key, then the other key in the combination.  For example, to save a document using the common \"Ctrl+S\" shortcut, first press and hold the Control key.  Then press and release the \"S\" key to perform the command.  Finally, release the Ctrl key.\nWhile most key combinations require only one modifier key, some require multiple modifier keys.  For example, in Mac OS X, Cmd+Shift+3 takes a screenshot of the screen.  In this case, either modifier key can be pressed first, as long as both keys are held when the \"3\" key is pressed."
        ]
    },
    {
        "word": "Mojave",
        "type": [],
        "definition": [
            "Mojave (pronounced \"mo-ha-vee\") is the name of macOS 10.14, the fifteenth version of macOS (previously OS X).  It was released on September 24th, 2018 and follows macOS 10.13, also known as High Sierra.\nmacOS Mojave is a minor update to macOS but includes a few notable new features.  One of the most significant is Dark Mode, which makes the menu bar and window backgrounds dark.  It also changes the light grey and white backgrounds of supported applications to dark grey with white text.  Dark mode was inspired by the dark interface of software development IDEs used by programmers and is intended to reduce eye strain.\nOther UI improvements in Mojave include \"time-shifting\" desktops that change color during the day, a new Gallery View in the Finder, and Stacks, which automatically groups similar file types together.  Mojave also includes new document editing capabilities at the operating system level.  For example, the updated Quick Look feature allows you to mark up a PDF or edit an image without even opening it with an application.   You can also edit and share screenshots immediately after taking them.  The screen capture feature in Mojave is the first to support screen recording.\nmacOS Mojave is the first version of macOS to include support for iOS apps.  While only a handful of Apple's own iOS apps were supported by Mojave at the time of launch, Apple plans to allow third party developers to build crossplatform apps that run on both iOS and macOS in the future."
        ]
    },
    {
        "word": "Molex Connector",
        "type": [],
        "definition": [
            "A Molex connector is a common type of connector used to power internal computer components.  The name comes from the Molex Connector Company, which pioneered the two-piece electrical connectors that became standard in computers and other electronics.\nSince Molex makes dozens of different connectors, there is no single connector technically called a \"Molex connector.\"  However, the term \"Molex connector\" has become a generic way to describe the Molex 4-pin 8981 power connector used to power hard drives, optical drives, and other storage devices.  It contains four pins (colored yellow, black, black, and red) encased in a white plastic connector.  The connector snaps into a receptacle attached to the power supply and locks into place, ensuring a reliable connection.  The 8981 connector's simple and inexpensive design helped it become the standard power connector in desktop computers for several decades.\nWhile the Molex 8981 connector is still used in many PCs, modern storage devices, such as SSDs and SATA drives often use newer types of connectors.  However, other products from the Molex family are still used in many electronic devices.  These connectors are not generically referred to as \"Molex connectors,\" but instead have proprietary names.  Examples include the \"Mini-Fit Jr.\" motherboard connector and the \"PanelMate\" connector used for powering flat panel displays."
        ]
    },
    {
        "word": "Monitor",
        "type": [],
        "definition": [
            "The term \"monitor\" is often used synonymously with \"computer screen\" or \"display.\"  The monitor displays the computer's user interface and open programs, allowing the user to interact with the computer, typically using the keyboard and mouse.\nOlder computer monitors were built using cathode ray tubes (CRTs), which made them rather heavy and caused them to take up a lot of desk space.  Most modern monitors are built using LCD technology and are commonly referred to as flat screen displays.  These thin monitors take up much less space than the older CRT displays.  This means people with LCD monitors have more desk space to clutter up with stacks of papers, pens, and other objects.\n\"Monitor\" can also be used as a verb.  A network administrator may monitor network traffic, which means he watches the traffic to make sure the bandwidth usage is within a certain limit and checks to see what external sources may be attempting to access the network.  Software programs may monitor the system's CPU performance as well as RAM and hard disk usage.\nFinally, monitors also refer to speakers used for monitoring sound.  Audio engineers typically use \"studio monitors\" to listen to recordings.  These high-end speakers allow the engineers to accurately mix and master audio tracks.  So a sound mixer could be monitoring a recording visually using a computer monitor, while monitoring the sound using audio monitors at the same.  As you can tell, \"monitor\" serves as a rather multipurpose word."
        ]
    },
    {
        "word": "Monochrome",
        "type": [],
        "definition": [
            "The word \"monochrome\" literally means \"one color.\"  Therefore, a monochrome image only includes one color, but may contain many shades.  In computing, \"monochrome\" typically refers to a two-tone image, rather than one with several shades of a single color.  For example, a monochrome monitor uses one color for the background and another to display text or images on the screen.\nBefore color monitors became standard, most computers had monochrome displays.  These displays often had a black background with green text, though some displayed text in other colors, such as red or orange.  While this may seem like a rudimentary way to display text, it was sufficient for typing documents, since computers still offered more text editing capabilities that a typewriter.  Even after color monitors became the norm in the 1980s, monochrome displays were still used for several years as computer terminals.\nToday, monochrome computer monitors are rare.  By the time LCD displays replaced CRTs monitors in the early 2000s, monochrome screens had already been obsolete for several years.  Now, even basic terminal displays support a wide range of colors.  While you might not see monochrome monitors today, monochrome displays can still be found in other electronics, such as watches, timers, and digital clocks.\nNOTE: Monochrome is not the same thing as grayscale.  A grayscale image is a type of monochrome image that only contains shades of gray.  Additionally, monochrome and black-and-white are two different things.  The phrase \"black-and-white\" may refer to a monochrome image that only includes the colors black and white or a grayscale image with multiple shades of gray."
        ]
    },
    {
        "word": "Monterey",
        "type": [],
        "definition": [
            "macOS Monterey (macOS 12) is the 18th version of Apple's desktop operating system.  It follows macOS Big Sur (macOS 11) and was released on October 25, 2021.\nMonterey is a major macOS release (version 12.0), but contains fewer significant updates than its predecessor Big Sur.  While macOS 11 included major changes to the user interface, macOS 12 maintains the same look and feel and nearly all the same icons.  The most notable changes in Monterey are improvements to Apple-branded apps.\nExamples of app updates in Monterey include:\n\nFaceTime: adds \"SharePlay,\" which supports screen sharing and allows mulitple people to watch videos together\nPhotos: improves the Memories feature with a new look, an interactive interface, and more memory types\nNotes: adds tags and Smart Folders for categorizing notes\nShortcuts: brings the iOS app to macOS, which integrates with Automator\nMaps: provides new transit information and more detailed information for large cities\n\nSome OS-level updates in macOS Monterey include:\n\nFocus: enables custom notifications while working as an alternative to Do Not Disturb\nUniversal Control: allows the same keyboard, mouse, and trackpad to be used with a Mac and iPad\nAccessibility: includes \"Full Keyboard Access,\" which makes it possible to control everything on a Mac using only a keyboard\nTranslation: adds system-wide translation to text via right-click &rarr; Translate\n\nmacOS Monterey supports MacBook Pros, MacBook Airs, and iMacs released in 2015 and later, Mac minis released in 2014 and later, and Mac Pros released in 2013 and later."
        ]
    },
    {
        "word": "Moodle",
        "type": [],
        "definition": [
            "Moodle is an acronym for \"Modular Object-Oriented Dynamic Learning Environment.\"  It is an online educational platform that provides custom learning environments for students.  Educators can use Moodle to create lessons, manage courses, and interact with teachers and students.  Students can use Moodle to review the class calendar, submit assignments, take quizzes, and interact with their classmates.\nMoodle is used by thousands of educational institutions around the world to provide an organized and central interface for e-learning.  Teachers and class administrators can create and manage virtual classrooms, in which students can access videos, documents, and tests.  Course chat allows students to communicate with the teacher and other students in a secure environment.\nEach Moodle classroom and course can be customized by the class administrator.  For example, one teacher may choose to provide a wiki that students can edit, while another may opt to use a private web forum for online discussions.  Some teachers may use Moodle to simply provide documents to students, while others may use it as the primary interface for quizzes and tests.  Individual class sizes can be scaled from a handful of students to millions of users. \nIn order to create a Moodle learning environment, the Moodle software must be downloaded and installed on a web server.  The Moodle platform is open source and is built using a modular design, so advanced users can modify the platform as needed.  Individual users, such as teachers and students, can sign up for an account on the Moodle server and access content through either the web interface or the \"Moodle Desktop\" application."
        ]
    },
    {
        "word": "Motherboard",
        "type": [],
        "definition": [
            "The motherboard is the main circuit board of your computer and is also known as the mainboard or logic board.  If you ever open your computer, the biggest piece of silicon you see is the motherboard.  Attached to the motherboard, you'll find the CPU, ROM, memory RAM expansion slots, PCI slots, and USB ports.  It also includes controllers for devices like the hard drive, DVD drive, keyboard, and mouse.  Basically, the motherboard is what makes everything in your computer work together.\nEach motherboard has a collection of chips and controllers known as the chipset.  When new motherboards are developed, they often use new chipsets.  The good news is that these boards are typically more efficient and faster than their predecessors.  The bad news is that older components often do not work with new chipsets.  Of course, if you are planning on upgrading multiple components, it may be more cost-effective to just buy a new computer."
        ]
    },
    {
        "word": "Motion Tween",
        "type": [],
        "definition": [
            "A motion tween is a feature available in Adobe Flash (formerly Macromedia Flash) that allows you to easily animate the motion of an object.  Instead of defining the location of the object in every frame, you can create a motion tween, which will automatically move the object from the beginning location to ending location.\nTo create a motion tween, simply select a layer in the timeline and drag an object onto the stage. Then select the number of frames in the timeline you would to use for the duration of the animation.  To create the motion tween, you can either right-click in the timeline and select \"Create Motion Tween,\" or simply choose Insert &rarr; Motion Tween from the menu bar.  NOTE: In order for Flash to create the tween, you may need to convert the object to a symbol.\nOnce the tween has been created, you can click on any frame within the motion tween and move or rotate the object.  For example, you can click on the last frame in the motion tween and move the object to a different part of the stage.  When you run the animation, Flash will automatically calculate the location of the symbol for each frame and smoothly move the symbol from the start location to the end location.  You can modify the acceleration of the object using the \"Ease\" property in the Properties palette.\nMotion tweening has become the standard way of animating symbols in Flash animations.  While the name \"motion tween\" is specific to Adobe Flash, the phrase is sometimes used to refer to automated movements in other animation software as well."
        ]
    },
    {
        "word": "Mount",
        "type": [],
        "definition": [
            "In order for a hard disk or disk partition to be accessible by a computer, it must first be mounted.  This is a software process that \"activates\" the disk, which makes the folders and files on the disk readable by the computer.  If a hard drive is physically connected, but not mounted, the computer will not recognize it.\nFortunately, most operating systems, such as Windows and Mac OS X, mount newly connected disks by default.  In Windows, the disk will appear in the \"My Computer\" window.  In Mac OS X, the disk will appear on the desktop.  This is true for all types of disks, such as internal and external hard drives, optical media, such as CDs and DVDs, and USB flash drives.  Disk image files may have to be mounted manually using a program like Nero or WinImage (Windows) or Apple Disk Utility (Mac OS X).\nIf a disk is not being used, it can be unmounted.  Optical disks are typically unmounted automatically when they are ejected.  However, before you disconnect an external hard drive or a USB flash drive, you should unmount the disk to avoid possible data corruption."
        ]
    },
    {
        "word": "Mountain Lion",
        "type": [],
        "definition": [
            "Mountain Lion is another name for Mac OS X 10.8, the ninth version of Apple's desktop operating system.  It was released on July 25, 2012, almost exactly one year after Mac OS X 10.7 Lion.  Like Snow Leopard, Mountain Lion was not a major update to the Mac OS.  Instead, it was primarily a performance update and included a small number of enhancements to further integrate Mac OS X with iOS, Apple's mobile operating system.\nUnlike previous versions of Mac OS X, Apple officially labeled Mountain Lion \"OS X\" (removing \"Mac\" from the name).  This change, while symbolic, represents Apple's effort to integrate their desktop computers and mobile devices into a more cohesive environment.  For example, Mountain Lion allows Macs to share reminders, notes, and documents with iOS devices using the cloud.  Notification Center, introduced with OS X 10.8, provides many of the same updates as the Notifications feature in iOS.  The new Messages application can send and receive iMessages, which allows Mac users to communicate directly with people using iPhones and iPads.\nOS X Mountain Lion also added a few other notable features. including Dictation, which converts speech to text, and AirPlay, which streams media to other Apple devices.  OS 10.8 also includes Gatekeeper, a tool that protects your Mac from malicious software.  The new Power Nap feature updates Mail, Contacts, Calendar, and Reminders data, on Mac laptops while they are in sleep mode.  Additionally, Mountain Lion includes several new social networking features, such as a \"Share\" button added to applications, Facebook and Twitter integration, and Game Center, a social gaming network that was previously only available on iOS devices.\nNOTE: Like Lion, Apple's Mountain Lion operating system is not sold on a disc, but is only available as a download from the Mac App Store."
        ]
    },
    {
        "word": "Mouse",
        "type": [],
        "definition": [
            "While most people don't want to see a mouse running around in their home, they typically don't have a problem seeing one sitting by their computer.  This is because, along with the keyboard, the mouse is one of the primary input devices used with today's computers.  The name comes from the small shape of the mouse, which you can move quickly back and forth on the mouse pad, and the cord, which represents the mouse's tail.  Of course, if you are using a wireless mouse, the analogy does not work so well.\nAll mice have at least one button, though most mice have two or three.  Some also have additional buttons on the sides, which can be assigned to different commands.  Most mice also have a scroll-wheel, which lets you scroll up and down documents and Web pages by just rolling the wheel with your index finger.\nEarly mice tracked movement using a ball in the bottom of the mouse.  This \"mouse ball\" pushed against different rollers as it moved, measuring the mouse's speed and direction.  However, now most mice use optical technology, which uses a beam of light to track the mouse's motion.  Optical mice are more accurate than roller-based mice and they have the added bonus of not getting dirty inside.\nA plurality of plurals\nWhen you refer to more than one mouse, you can call them either \"mice\" or \"mouses,\" since both terms are acceptable.  However, \"mouses\" is technically the correct version since \"mice\" is the plural form designated for living creatures.  Still, most people have a hard time saying \"mouses,\" which is why \"mice\" is more commonly used."
        ]
    },
    {
        "word": "Mouse Pad",
        "type": [],
        "definition": [
            "A mouse pad, or \"mousing surface,\" is a surface designed for tracking the motion of a computer mouse.  Early mouse pads were literally \"pads,\" which had soft surfaces.  The slight cushion allowed the mouse ball to roll smoothly in any direction.  Modern mouse pads typically have harder surfaces, designed to track the motion of optical mice.\nMouse pads come in many shapes and sizes.  Most are rectangular, though are some are circular or oval shaped.  While the majority of mouse pads are less than a foot wide or long, graphic artists and CAD designers sometimes use mouse pads that are much larger.  These super-sized mousing surfaces allow them to use a slow, precise mouse speed without needing to lift up the mouse very often.  Computer gamers also prefer larger mouse pads, because they offer more desktop real estate for making long, fast motions.\nSince optical mice track motion by detecting small changes in the surface below the mouse, the mouse pad's surface affects how accurately the mouse responds to movement.  Lighter colored mouse pads typically produce the best results since they reflect the most light.  Some highly reflective mouse pads even claim to have \"battery saving\" capabilities for wireless mice.  The improvement in battery life most likely comes from how quickly the mouse enters low-power mode when it stops moving.\nSince optical mice work on just about any opaque surface, you typically do not even need a mouse pad to use a mouse.  However, a good mouse pad can provide smooth, accurate motion, which is beneficial if cursor accuracy is important for your work.  When choosing a mouse pad, make sure you get one large enough for your needs, but not so large that it won't fit on your desk.  If possible, choose a mouse pad with a built-in wrist rest or buy a separate wrist rest if necessary.  This small ergonomic addition will relieve a lot of strain on your wrist no matter what mouse pad you use."
        ]
    },
    {
        "word": "Multi-Core",
        "type": [],
        "definition": [
            "Multi-core technology refers to CPUs that contain two or more processing cores.  These cores operate as separate processors within a single chip.  By using multiple cores, processor manufacturers can increase the performance of a CPU without raising the processor clock speed.  Since the upper threshold of clock speeds has leveled out during recent years, multi-core processors have become a common means to improve computing performance.\nMost modern computers have at least two cores, or a dual-core processor.  Some high-end machines have four core (quad-core), six core (hexa-core), or eight core (octo-core) processors.  While adding more cores does not increase the overall computing performance by a proportional amount (two cores do not equal twice the speed), multi-core processors do provide a substantial performance boost over a single-core CPUs.  Additionally, a multi-core processor can run more efficiently than a single processor, since not all cores need to be active unless needed.  For example, Intel's \"Turbo Boost Technology\" can turn off power to entire cores when they are not being used.\nIt is important to understand that multiple cores are different than multiple CPUs.  While a multi-core computer may contain two processing cores on a single chip, a multiprocessor computer may have two CPUs, each with a single processing core.  Since multi-core computing is more energy and cost efficient, multi-core computers have become more popular than multiprocessor computers.  However, some high-end machines combine the two technologies and include multiple CPUs, each with multiple cores."
        ]
    },
    {
        "word": "Multicast",
        "type": [],
        "definition": [
            "A multicast is a transmission of data from a single source to multiple recipients.  Multicasting is similar to broadcasting, but only transmits information to specific users.  It is used to efficiently transmit streaming media and other types of data to multiple users at one time.\nThe simple way to send data to multiple users simultaneously is to transmit individual copies of the data to each user.  However, this is highly inefficient, since multiple copies of the same data are sent from the source through one or more networks.  Multicasting enables a single transmission to be split up among multiple users, significantly reducing the required bandwidth.\nMulticasts that take place over the Internet are known as IP multicasts, since they use the Internet protocol (IP) to transmit data.  IP multicasts create \"multicast trees,\" which allow a single transmission to branch out to individual users.  These branches are created at Internet routers wherever necessary.  For example, if five users from five different countries requested access to the same stream, branches would be created close to the original source.  If five users from the same city requested access to the same stream, the branches would be created close to users.\nIP multicasting works by combining two other protocols with the Internet protocol.  One is the Internet Group Management Protocol (IGMP), which allows users or client systems use to request access to a stream.  The other is Protocol Independent Multicast (PIM), which is used by network routers to create multicast trees.  When a router receives a request to join a stream via IGMP, it uses PIM to route the data stream to the appropriate system.\nMulticasting has several different applications.  It is commonly used for streaming media over the Internet, such as live TV and Internet radio.  It also supports video conferencing and webcasts.  Multicasting can also be used to send other types of data over the Internet, such as news, stock quotes, and even digital copies of software.  Whatever the application, multicasting helps reduce Internet bandwidth usage by providing an efficient way of sending data to multiple users."
        ]
    },
    {
        "word": "Multimedia",
        "type": [],
        "definition": [
            "As the name implies, multimedia is the integration of multiple forms of media.  This includes text, graphics, audio, video, etc.  For example, a presentation involving audio and video clips would be considered a \"multimedia presentation.\"  Educational software that involves animations, sound, and text is called \"multimedia software.\"  CDs and DVDs are often considered to be \"multimedia formats\" since they can store a lot of data and most forms of multimedia require a lot of disk space.\nDue to the advancements in computer speeds and storage space, multimedia is commonplace today.  Therefore, the term doesn't produce the same excitement is once did.  This also means it is not as overused as it was back in the late '90s.  Thank goodness."
        ]
    },
    {
        "word": "Multiplatform",
        "type": [],
        "definition": [
            "If a software program is developed for mulitple operating systems, it is considered to be \"multiplatform.\"  Since Microsoft Word runs on both the Windows and Macintosh platform, it is a multiplatform application.\nIn the consumer gaming market, multiplatform games run on more than one gaming machine.  For example, a sports game developed for Xbox, Playstation, GameCube, and PC would be a multiplatform game.  If a game is developed exclusively for one system, i.e. \"The Legend of Zelda,\" for Nintendo, it is not multiplatform.  Gaming hardware manufacturers use exclusive software as a reason for consumers to buy their system."
        ]
    },
    {
        "word": "Multiprocessing",
        "type": [],
        "definition": [
            "For many years, the speed of computer processors increased through improvements in the architecture and clock speed of processors.  However, in recent years, chip manufacturers have reached a limit in how small they can make the transistors inside CPUs without them overheating.  Therefore, using multiple processors, or multiprocessing, has become the next step in increasing computing performance.\nMultiprocessing can be implemented in two different ways: 1) using more than one physical processor, or 2) using a processor with multiple cores.  For example, early Power Mac G5 computers had multiple physical processors, each with their own heat sink and frontside bus.  When Apple switched to using Intel processors in 2006, they began using dual-core processors.  These chips look like a single processor, but act as two.  Now, some machines like the Mac Pro, have quad-core processors, which include four processing cores.  Some Mac Pros even have two physical quad-core processors, giving the computer a total of eight processors.  Most Windows and Linux-based PCs now use multi-core processors as well.\nWhile multiprocessing sounds like a logical choice for improving computing performance, it must be supported by the computer's operating system in order to work correctly.  Fortunately, current versions of both Windows and Mac OS X fully support multiprocessing.  This means they can manage multiple processors as one CPU, dividing the processing load between them.  Still, not all tasks can be split equally between two or more processors.  Therefore, while multiprocessing may increase a computer's speed, it does not typically improve performance by the exact factor of processors in the machine."
        ]
    },
    {
        "word": "Multitasking",
        "type": [],
        "definition": [
            "Multitasking is processing multiple tasks at one time.  For example, when you see someone in the car next to you eating a burrito, taking on his cell phone, and trying to drive at the same, that person is multitasking.\nMultitasking also refers to the way a computer works.  Unlike the phone and burrito juggling driver, a computer's CPU can handle many processes at one time with complete accuracy.  However, it will only process the instructions sent to it by the computer's software.  Therefore, to make full use of the CPU's capabilities, the software must be able to process more than one task at a time, or multitask.\nEarly operating systems could run multiple programs at one time, but did not fully support multitasking.  Therefore, a single program could consume the computer's entire CPU while performing a certain operation.  Basic operating system processes, such as copying files, prevented the user from performing other tasks, such as opening or closing windows.  Fortunately, since modern operating systems include full multitasking support, multiple programs can run at the same time without affecting each other.  Also, multiple operating system processes can take place simultaneously.\nSince multitasking can handle several tasks at once, it also improves the stability of the computer.  For example, if one process crashes, it will not affect the other running programs, since the computer handles each process separately.  In other words, if you are in the middle of writing a paper in a word processing program and your Web browser unexpectedly quits, you won't lose your work.  That's when you can really be thankful for multitasking."
        ]
    },
    {
        "word": "Multithreading",
        "type": [],
        "definition": [
            "Multithreading is similar to multitasking, but enables the processing of multiple threads at one time, rather than multiple processes.  Since threads are smaller, more basic instructions than processes, multithreading may occur within processes.\nBy incorporating multithreading, programs can perform multiple operations at once.  For example, a multithreaded operating system may run several background tasks, such as logging file changes, indexing data, and managing windows at the same time.  Web browsers that support multithreading can have multiple windows open with JavaScript and Flash animations running simultaneously.  If a program is fully multithreaded, the different processes should not affect each other at all, as long as the CPU has enough power to handle them.\nSimilar to multitasking, multithreading also improves the stability of programs.  However, instead of keeping the computer from crashing, multithreading may prevent a program from crashing.  Since each thread is handled separately, if one thread has an error, it should not affect the rest of the program.  Therefore, multithreading can lead to fewer crashes, which is something we can all be thankful for."
        ]
    },
    {
        "word": "MySQL",
        "type": [],
        "definition": [
            "MySQL, pronounced either \"My S-Q-L\" or \"My Sequel,\" is an open source relational database management system.  It is based on the structure query language (SQL), which is used for adding, removing, and modifying information in the database.  Standard SQL commands, such as ADD, DROP, INSERT, and UPDATE can be used with MySQL.\nMySQL can be used for a variety of applications, but is most commonly found on Web servers.  A website that uses MySQL may include Web pages that access information from a database.  These pages are often referred to as \"dynamic,\" meaning the content of each page is generated from a database as the page loads.  Websites that use dynamic Web pages are often referred to as database-driven websites.\nMany database-driven websites that use MySQL also use a Web scripting language like PHP to access information from the database.  MySQL commands can be incorporated into the PHP code, allowing part or all of a Web page to be generated from database information.  Because both MySQL and PHP are both open source (meaning they are free to download and use), the PHP\/MySQL combination has become a popular choice for database-driven websites."
        ]
    },
    {
        "word": "MySpace",
        "type": [],
        "definition": [
            "MySpace is an online community that allows friends to keep in touch and meet new people as well.  It started out as a website that bands could use to promote their music, but has since grown into a more general community of friends.  Anyone who is at least 14 years old can sign up for a MySpace account at no cost.  Once you sign up, you can customize your profile by adding information about yourself, listing your interests, hobbies, and educational background, and uploading photos of yourself and your friends.  You can also create your own blog for others to read.\nOnce you have created a profile on MySpace, you can search or browse other users' profiles.  If you want to add someone as a friend, just click the \"Add to Friends\" link on that person's profile page.  If the person approves your friend request, he or she will be added to your list of friends.  Some users have only a few friends, while others have several thousand.  You can send a private message to a user by clicking the \"Send Message\" link or post a comment on his or her page by clicking \"Add Comment.\"  Comments can be seen by all visitors to that person's profile, so be careful what you post!\nThe \"friends\" concept is the heart and soul of MySpace.  By building a list of friends, you have your own network of people readily accessible from your profile page.  When you click on a friend's image, you can view their profile and all their friends.  This makes is easy to meet friends of friends, and their friends, and so on.  The number of people you can meet on MySpace is practically endless, which may be a part of the reason there are so many \"MySpace addicts\" out there.\nIn order to create a MySpace account, you need to choose a username and password, which is used for logging in to your account.  This gives you control over what appears on your profile page.  The only way others can add content to your page is through comments, which you can choose to delete once you have logged in to your account."
        ]
    }
]