[
    {
        "word": "N-Key Rollover",
        "type": [],
        "definition": [
            "N-key rollover, or \"NKRO,\" is a feature of high-end keyboards that detects all keystrokes no matter how many keys are pressed simultaneously.  It ensures every keystroke is recorded and prevents \"ghosting,\" in which an extra keystroke may be registered when multiple keys are pressed together.\nIn a basic keyboard, the electrical connections from the base of the keys to the keyboard output (typically a USB connection) may intersect.  If you press multiple keys at the same time, the keyboard may register some keystrokes but not others.  Ghosting happens when the data from two or more keystrokes gets combined and registers input from a key you did not press.\nMost keyboards have some level of rollover, meaning they support multiple simultaneous keystrokes.  For example, an inexpensive keyboard might have 5-key rollover, while another might have 8-key rollover.  This type of rollover is also called \"x-key rollover,\" where x equals the number of keys that can be pressed and recorded simultaneously.\nN-key rollover means there is no limit to how many keys can be pressed and recorded at once.  This feature is typically found in high-end keyboards, such as gaming keyboards used in eSports.  Gamers often press several keys at once while playing video games, so it is essential for the keyboard to register all the input accurately.\nNOTE: The USB interface initially only supported 6 simultaneous keystrokes plus 4 modifier keys.  Modern USB interfaces do not have a simultaneous keystroke limit."
        ]
    },
    {
        "word": "NAND",
        "type": [],
        "definition": [
            "NAND is the most common type of flash memory.  It is used in several types of storage devices, including SSDs, USB flash drives, and SD cards.  NAND memory is non-volatile, meaning it retains stored data even when the power is turned off.\nWhat does NAND stand for?\nSurprisingly, NAND is not an acronym.  Instead, the term is short for \"NOT AND,\" a boolean operator and logic gate.  The NAND operator produces a FALSE value only if both values of its two inputs are TRUE.  It may be contrasted with the NOR operator, which only produces a TRUE value if both inputs are FALSE.\nNAND vs NOR Flash Memory\nNAND flash memory contains an integrated circuit that uses NAND gates to store data in memory cells.  NOR flash memory stores data using NOR gates.  While NOR devices read data faster, they are slower at writing data and do not store data as efficiently.  NAND devices write and erase data faster and store significantly more data than NOR devices of the same physical size.\nOverall, NAND storage is more efficient than NOR, which is why NAND is the most popular type of flash memory.  As read and write speeds have improved, NAND devices have become faster than traditional hard drives.  Therefore, SSDs and integrated flash memory have replaced HDDs in most computers."
        ]
    },
    {
        "word": "NAS",
        "type": [],
        "definition": [
            "Stands for \"Network Attached Storage.\"  A typical computer stores data using internal and external hard drives.  If the computer is connected to a network, it can share data on its connected hard drives with other systems on the network.  While this allows multiple computers to send data back and forth, it requires that each computer share its files individually.  Therefore, if a computer is turned off or disconnected from the network, its files will not be available to the other systems.\nBy using NAS, computers can store and access data using a centralized storage location.  Instead of each computer sharing its own files, the shared data is stored on a single NAS server.  This provides a simpler and more reliable way of sharing files on a network.  Once an NAS server connected to a network (typically via Ethernet), it can be configured to share files with multiple computers on the network.  It may allow access to all systems or may provide access to a limited number of authenticated machines.\nNAS servers typically contain multiple hard drives, providing a large amount of shared disk space for connected systems to save data.  They are often used in business networks, but have become increasing more common in home networks as well.  Since NAS uses a centralized storage device, it can be a simple way for family members to share and backup their data."
        ]
    },
    {
        "word": "NAT",
        "type": [],
        "definition": [
            "Stands for \"Network Address Translation.\"  NAT translates the IP addresses of computers in a local network to a single IP address.  This address is often used by the router that connects the computers to the Internet.  The router can be connected to a DSL modem, cable modem, T1 line, or even a dial-up modem.  When other computers on the Internet attempt to access computers within the local network, they only see the IP address of the router.  This adds an extra level of security, since the router can be configured as a firewall, only allowing authorized systems to access the computers within the network.\nOnce a system from outside the network has been allowed to access a computer within the network, the IP address is then translated from the router's address to the computer's unique address.  The address is found in a \"NAT table\" that defines the internal IP addresses of computers on the network.  The NAT table also defines the global address seen by computers outside the network.  Even though each computer within the local network has a specific IP address, external systems can only see one IP address when connecting to any of the computers within the network.\nTo simplify, network address translation makes computers outside the local area network (LAN) see only one IP address, while computers within the network can see each system's unique address.  While this aids in network security, it also limits the number of IP addresses needed by companies and organizations.  Using NAT, even large companies with thousands of computers can use a single IP address for connecting to the Internet.  Now that's efficient."
        ]
    },
    {
        "word": "NFC",
        "type": [],
        "definition": [
            "Stands for \"Near Field Communication.\"  NFC is a short-range wireless technology that enables simple and secure communication between electronic devices.  It may be used on its own or in combination with other wireless technologies, such as Bluetooth.\nThe communication range of NFC is roughly 10 centimeters.  However, an antenna may be used to extended the range up to 20 centimeters.  This short range is intentional, as it provides security by only allowing devices to communicate within close proximity of each other.  This makes NFC ideal for secure transactions, such as contactless payments at a checkout counter.\nIf your smartphone or smartwatch supports NFC, you can enable a contactless payment option such as Apple Pay or Android Pay.  After linking a credit card to your device, you can make payments by simply holding your device near an NFC-enabled payment machine.\nThere are many other uses for NFC as well.  Examples include:\n\nPaying a fare on public transit, such as a bus or train\nConfirming your ticket at a concert or sports event\nSyncing workout data from a fitness machine with your device\nViewing special offers on your phone when you enter a store\nLoading information about an artist or piece of art at a museum\nViewing a map and related information at a national park\nLoading a translated menu at a restaurant\nChecking in and checking out at a hotel\nUnlocking an NFC-enabled door lock\n\nNFC is often seen as an alternative to QR codes, which require scanning a square code with your device.  Both technologies are designed for short-range transactions, but QR code scanning requires a camera, while NFC communication requires a near-field communication chip.  NFC communication is arguably simpler since you don't need to manually scan anything with your device.  Additionally, NFC provides two-way communication, while scanning a QR code is a one-way transaction.\nNOTE: Since the range of NFC is limited to only a few centimeters, it is ideal for quick data transfers and transactions.  For communication that requires a longer time or longer distance, NFC Connection Handover technology may be used to transition the connection to Bluetooth."
        ]
    },
    {
        "word": "NFS",
        "type": [],
        "definition": [
            "Stands for \"Network File System.\"  NFS is a protocol used to access files over a network.  It was developed by Sun Microsystems and introduced in 1989.  The protocol is platform-independent, meaning it works across multiple operating systems and network configurations.\nWhile \"file system\" makes up two-thirds of the NFS acronym, the Network File System is not an actual file system like NTFS or APFS.  Instead, it is a protocol that provides standard commands for accessing files from network-based storage locations.  It is built on the RPC protocol and uses remote procedure calls to access files.\nExamples of NFS commands include:\n\nNFSPROC_LOOKUP() - find files based on the filename\nNFSPROC_READ() - read from a file\nNFSPROC_WRITE() - write to a file\n\nNFS can mount shared files in a local directory, allowing client systems to access remote data as a local folder.  The client can traverse subdirectories, look up file permissions, and read, write, and create files.  NFS translates the file paths and file commands to work with the corresponding file system.\nNOTE: NFS is an open standard, meaning any developer can add Network File System support to an application.  However, in order for NFS to function, both the server and client systems must support NFS."
        ]
    },
    {
        "word": "NFT",
        "type": [],
        "definition": [
            "Stands for \"Non-Fungible Token.\"  An NFT is a digital asset, such as an image or video that someone can purchase.  \"Non-fungible\" means the asset is not replaceable or redistributable.  Unlike a stock photo (or video), which multiple people can buy, only one person can own an NFT.\nCommon NFTs include digital photos, artwork, animations, and collectible sports cards.  Anyone can create an NFT, but most are produced and sold by celebrities or known artists.  When you buy an NFT, you receive official ownership rights to the asset.\nWhile digital media can be easily copied, the value of an NFT is its ownership rights.  NFT licenses are stored in a blockchain, similar to a Bitcoin transaction record.  When someone purchases an NFT, the transaction is recorded in the blockchain, and that person acquires exclusive rights to the asset.\nAre NFTs Unique?\nEach NFT is unique, but creators may offer multiple \"editions\" of an NFT.  For example, an artist may sell five editions of the same digital painting, which five different people can purchase.  A sports figure may offer several hundred or even several thousand editions of a digital sports card.  Generally, the more editions, the less value each NFT has.\nNon-fungible tokens spiked in popularity in 2021, with many celebrities and artists jumping on the bandwagon.  While some NFTs have sold for several million dollars, the long-term value of NFTs remains to be seen.\n"
        ]
    },
    {
        "word": "NIC",
        "type": [],
        "definition": [
            "Stands for \"Network Interface Card\" and is pronounced \"nick.\"  A NIC is a component that provides networking capabilities for a computer.  It may enable a wired connection (such as Ethernet) or a wireless connection (such as Wi-Fi) to a local area network.\nNICs were commonly included in desktop computers in the 1990s and early 2000s.  In the 1980s and early 1990s, many computers did not include networking capabilities, so a NIC could be added as an expansion card.  Most NICs were installed in a PCI slot on the motherboard.  Early NICs included a BNC connector for coax network connections, though Ethernet ports soon became the standard.  Therefore most NICs include one or more Ethernet ports.\nAs wireless networking became more popular, wireless NICs also grew in popularity.  Instead of an Ethernet port, wireless NICs are designed for Wi-Fi connections and often have an antenna to provide better wireless reception for the computer.  Older wireless cards have PCI connections while most modern wireless NICs connect to a PCI Express slot.\nSince many different networking standards exist, it is best to match the specifications of a NIC to the standard of network.  For example, if you are connecting to a Gigabit Ethernet network, a Gigabit Ethernet NIC is the best choice.  A 100Base-T card will work, but you will only get 1\/10 of the possible data transfer rate.  A 10 Gigabit Ethernet Card may also work, but you will only experience gigabit speeds on the network.  Wireless cards also use the lowest common denominator between the network and the NIC.  However, if a wireless card does not support a newer wireless standard (such as 802.11ac), it may not be able to connect to the network.\nNIC vs Network Adapter\nTechnically, a NIC is a physical card that connects to an expansion slot in a computer.  Many computers and wireless devices now include an integrated networking component called a network adapter.  This may be an Ethernet controller and port attached to the edge of a motherboard or a small wireless networking chip located on the motherboard.  A network adapter may also be a small peripheral that connects to a USB port.  While the terms \"NIC\" and \"network adapter\" are often used synonymously, a NIC is a type of network adapter while a network adapter is not necessarily a NIC.\n"
        ]
    },
    {
        "word": "NINO",
        "type": [],
        "definition": [
            "Stands for \"Nothing In, Nothing Out.\"  The acronym NINO (pronounced \"nee-no\") is a computer science term that states if nothing is entered into a program, nothing is produced.  It can also be translated, \"No Input, No Output.\"\nComputers operate by processing information.  If there is no input (or information to process), there can be no output.  Input can be entered by a human, such as typing text in a word processor or clicking on a link in a web browser.  It can also be entered by software, such as a bootstrap operation or a bot that automatically executes commands.\nIn computer programming, NINO can explain why a function does not produce a result.  If it does not receive the parameters it needs to run correctly, the function may fail or produce a NULL value.  If the function receives invalid input, it may either return nothing or a \"garbage\" result.  This process can be summarized as GIGO (Garbage In, Garbage Out).\nA well programmed function checks all input and produces an error message if the data is either missing or invalid.  This prevents NINO and GIGO errors since bad input can cause bugs or crashes within a program."
        ]
    },
    {
        "word": "NMS",
        "type": [],
        "definition": [
            "Stands for \"Network Management System.\"  An NMS is a system designed for monitoring, maintaining, and optimizing a network.  It includes both hardware and software, but most often an NMS refers to the software used to manage a network.\nNetwork management systems provide multiple services.  These include, but are not limited to:\n\nNetwork monitoring - NMS software monitors network hardware to ensure all devices are operating correctly and are not near or at full capacity.  Alerts can be sent to network administrators if a problem is detected.\nDevice detection - When a new device is connected to the network, the NMS detects it so that it can be recognized, configured, and added to the network.  This is also called device provisioning.\nPerformance analysis - An NMS can gauge the current and historical performance of a network.  This includes the overall performance of the network as well as individual devices and connections.  For example, the NMS may detect aspects of a network where throughput is nearing the maximum bandwidth available.  The data can be used to optimize the flow of traffic and recommend the addition of new hardware if needed.\nDevice management An NMS can provide a simple way to manage multiple devices from a central location.  It may be used to configure a device or modify settings based on the performance analysis.  Examples include activating specific network ports on a switch or implemeting bandwidth throttling for certain devices.\nFault management - If a device or section of a network fails, an NMS may be able to automatically reroute traffic to limit downtime.  This action may be performed on the fly or may be accomplished using a set of preconfigured rules.  When a fault occurs, a network alert or notification is usually sent to one or more network administrators.\n\nWhy use an NMS?\nIn small networks, such as a residential or home network, an NMS is not necessary.  However, it is important for any large network, such as those found in enterprise configurations.  Server farms, data centers, and corporate networks may have hundreds or thousands of connected devices.  It is important to have a central network monitoring system in place to manage the devices.  An NMS provides and efficient way to locate, update, repair, and replace network equipment as needed."
        ]
    },
    {
        "word": "NNTP",
        "type": [],
        "definition": [
            "Stands for \"Network News Transfer Protocol.\"  NNTP is the protocol used to connect to Usenet servers and transfer newsgroup articles between systems over the Internet.  It is similar to the SMTP protocol used for sending email messages, but is designed specifically for newsgroup articles.\nNNTP enables both server\/server and client\/server communication.  NNTP servers, for example, can communicate with each other and replicate newsgroups among each other.  This is how the Usenet network is created and maintained.  In the client-server model, NNTP allows a client system to connect to a Usenet server and provides commands for browsing and viewing articles on the server.\nUsenet was originally based on UUCP (Unix-to-Unix Copy), an early protocol used for file transfers between Unix systems.  The only way to read articles via UUCP was to log into a Usenet server and read articles directly from the local disk.  NNTP made it possible to access a Usenet server remotely from a client system running newsreader software.\nExamples of commands supported by the Network News Transfer Protocol include:\n\nARTICLE - retrieve an article from a Usenet server\nGROUP - select a specific newsgroup\nIHAVE - tell the server the client has an article it may want\nLIST - retrieve a list of newsgroups available on the server\nNEWSGROUPS - receive a list of newsgroups created after a specific date and time\nNEWNEWS - receive a list of articles created after a specific date and time\nNEXT - go to the next message in the newsgroup\nPOST - post a message or reply to an existing one\n\nIn most cases, these and other NNTP commands are handled automatically by newsreader software.  Newsreaders use these commands to communicate with Usenet servers and provide a graphical user interface GUI for browsing and viewing articles on the server."
        ]
    },
    {
        "word": "NOC",
        "type": [],
        "definition": [
            "Stands for \"Network Operations Center.\"  It is the central location where a company's servers and networking equipment are located.  The NOC may reside either within a company's campus or at an external location.  Smaller businesses and organizations often have an internal NOC, in which local technicians administer and monitor the servers.  Larger companies may have a NOC setup at a location developed specifically to house server equipment.\nNetwork operations centers, often called datacenters, are almost always connected to a high-speed Internet connection.  Large NOCs, such as those used by Web hosting companies, are often connected directly to the Internet backbone.  This gives the servers the most bandwidth possible.\nWhile NOCs are used by all Web hosting companies and ISPs, they are also useful to companies whose services are not related to the Internet.  Many companies use a NOC to manage internal communications, administer employee e-mail accounts, and backup data.  Because maintaining an Internet connection is vital to most businesses today, most NOCs are monitored 24\/7, with automatic alerts that notify technicians when servers or network connections are down."
        ]
    },
    {
        "word": "NOS",
        "type": [],
        "definition": [
            "Stands for \"Network Operating System\" and is pronounced \"N-O-S.\"  A network operating system provides services for computers connected to a network.  Examples include shared file access, shared applications, and printing capabilities.  A NOS may either be a peer-to-peer (P2P) OS, which is installed on each computer, or a client-server model, where one machine is the server and others have client software installed.\nPeer-to-peer network operating systems include legacy OSes such as AppleShare and Windows for Workgroups.  These operating systems offered unique networking capabilities that were not available in early versions of Mac OS and Windows.  They enabled computers to recognize each other and share files over a cable connecting the machines.  Over time, these networking features were integrated into standard operating systems, making P2P NOSes obsolete.\nClient-server network operating systems include Novell NetWare and Windows Server.  These NOSes provide services from one computer to all connected machines.  Novell NetWare requires specific client software to be installed on all client machines, while Windows Server works with standard Windows computers.  In both cases, clients connect to the server and can access files and applications based on their access privileges.  The central server manages all the connected machines and can provide updates as needed to the client systems.  This makes it easy to keep all the computers on the network up-to-date.\nWhile client-server NOSes were used for several decades, they too have faded into obsolescence.  Today, desktop operating systems have advanced networking capabilities, limiting the need for network operating systems.  Additionally, many organizations now use intranets to provide web-based access to all local systems.  Instead of requiring specific programs to be installed on each client, users can access web applications over a local network or the Internet.\nNOTE: A network operating system may also refer to a basic OS that runs on a network device, such as a router or firewall."
        ]
    },
    {
        "word": "NSP",
        "type": [],
        "definition": [
            "Stands for \"Network Service Provider.\"  An NSP is a business that provides access to the Internet backbone.  While some ISPs also serve as NSPs, in most cases, NSPs provide Internet connectivity to ISPs, which in turn provide Internet access to customers.\nNSPs build and maintain the primary infrastructure of the Internet.  This includes fiber optic lines between hubs or \"Internet exchanges\" that route Internet traffic around the world.  These communication lines offer extremely high bandwidth of hundreds or even thousands of gigabits per second.  The global network created by multiple NSPs enables data to flow seamlessly between computer systems around the world.\nIn the United States, most NSPs are commercial entities, such as AT&T, Verizon, and MCI.  In other countries, NSPs are often owned and operated by the government, though some international NSPs are privately owned as well.  While NSPs and ISPs are usually separate companies in the United States, in other parts of the world, they are commonly a single entity.  Examples include Tele2 in Europe, and Tata Communications in India."
        ]
    },
    {
        "word": "NTFS",
        "type": [],
        "definition": [
            "Stands for \"New Technology File System.\"  NTFS is a file system introduced by Microsoft with Windows NT and is supported by subsequent versions of Windows, such as Windows 2000 and Windows XP.  NTFS has a number of advantages over the previous file system, named FAT32 (File Allocation Table).  One major advantage of NTFS is that it includes features to improve reliablity.  For exmaple, the new technology file system includes fault tolerance, which automatically repairs hard drive errors without displaying error messages.  It also keeps detailed transaction logs, which tracks hard drive errors.  This can help prevent hard disk failures and makes it possible to recover files if the hard drive does fail.\nNTFS also allows permissions (such as read, write, and execute) to be set for individual directories and files.  It even supports spanning volumes, which allows directories of files to be spread across multiple hard drives.  The only reason why you would not want to select NTFS when formatting your hard drive is if you like slow, outdated technology or you need to run an older operating system such as Windows 95 or MS-DOS.  Of course, if you are running DOS, there is a good chance you really do like outdated technology."
        ]
    },
    {
        "word": "NTP",
        "type": [],
        "definition": [
            "Stands for \"Network Time Protocol.\"  NTP is a protocol used to synchronize computer clocks across multiple systems.  It supports synchronization over local area networks and the Internet.\nMatching the timestamps of two or more systems may seem like a simple task, but it involves multiple steps.  Since all networks have some amount of latency, the delay between the request and the response must be taken into account.  NTP uses the client-server model and calculates the round-trip delay using four values:\n\nclient request timestamp\nserver reception timestamp\nserver response timestamp\nclient reception timestamp\n\nThe time between 1 and 2 above is added to the time between 3 and 4 to compute the total round-trip delay.  By subtracting half of this delay, it is possible to estimate the exact time on a remote server, usually within a few milliseconds.\nSince network conditions can affect the time it takes to transmit or receive NTP packets, a single request may not produce an accurate result.  Therefore, it is common to make several NTP requests and average the latency to produce a more accurate timestamp.  Timestamps may also be averaged across multiple computers to produce a consistent time for all machines on a network.   When syncing multiple clocks at once, NTP is used as a peer-to-peer protocol, in which each system is a time source.\nNTP Examples\nThe network time protocol is used by several different time-syncing utilities, including tools built into Windows and macOS.  In Windows, the Date and Time Control Panel includes an \"Internet Time\" feature that uses NTP to retrieve the current time from a time server.  In macOS, the Date & Time System Preference uses NTP to retrieve the current time when \"Set date and time automatically\" is checked.  Both Windows and macOS use a simplified version of NTP called Simple Network Time Protocol (SNTP)."
        ]
    },
    {
        "word": "NUI",
        "type": [],
        "definition": [
            "Stands for \"Natural User Interface.\"  An NUI is a type of user interface that is designed to feel as natural as possible to the user.  The goal of an NUI is to create seamless interaction between the human and machine, making the interface itself seem to disappear.\nA common example of a natural user interface is a touchscreen interface, which allows you to move and manipulate objects by tapping and dragging your finger(s) on the screen.  The digital objects on the screen respond to your touch, much like physical objects would.  This direct feedback provided by a touchscreen interface makes it seem more natural than using a keyboard and mouse to interact with the objects on the screen.\nAnother modern example of an NUI is a motion-based video game.  The Nintendo Wii, for instance, allows you to wave a controller in the air to perform actions on the screen.  Microsoft's Xbox Kinect allows you to control your on-screen character by simply moving your body.  Both of these motion-based interfaces are considered natural user interfaces since they respond to your natural motions.\nWhile touchscreens and motion-based games are two of the most common types of NUIs, several others exist as well.  For example, a voice recognition interface like Apple's Siri assistant on the iPhone is considered a natural user interface since it responds to naturally spoken commands and questions.  Virtual reality devices are NUIs, since they emulate a real world experience.  Even some robots are considered natural user interfaces since they respond to human motion and spoken commands."
        ]
    },
    {
        "word": "NVMe",
        "type": [],
        "definition": [
            "Stands for \"Non-Volatile Memory Express.\"  NVMe is an internal storage device specification based on PCI Express.  It provides a high-speed connection for solid state drives (SSDs), with more bandwidth and less latency than a SATA connection.\nNVMe drives look similar to RAM chips (memory modules), while SATA SSDs look more like traditional hard drives.  The NVMe interface is simpler and more compact than a SATA or an mSATA connector since the drive controller is integrated into the drive.\n\nWhile NVMe is an open standard, specifications may differ between devices, such as PCIe version and interface type.  For example, one NVMe drive may connect to an HHHL (Half Height, Half Length) PCIe 3.0 slot, while another may support PCIe 4.0 and connect an M.2 slot.\nNVMe vs SATA\n\nNVMeSATA\nFaster (3.5 GB\/s read\/write)Fast (600 MB\/s read\/write)\nLower max capacity (4 TB)Higher max capacity (16 TB)\nThin \"card\" form factorThicker rectangular \"box\" form factor\nIntegrated controllerUses motherboard SATA controller\nMore expensiveLess expensive\n\nNOTE: As of 2022, M.2 is the most common type of NVMe drive interface."
        ]
    },
    {
        "word": "NVRAM",
        "type": [],
        "definition": [
            "Stands for \"Non-Volatile Random Access Memory.\"  NVRAM is a type of RAM that retains data after the host device's power is turned off.  Two common types of NVRAM include SRAM and EEPROM.\nSRAM (pronounced \"s-ram\") retains data by using an alternative source of power such as a battery.  SRAM is often used to store computer hardware settings that need to be maintained when the computer is shut down.  Common examples include the BIOS settings on Windows computers or the PRAM settings on Macintosh systems.  Since SRAM typically uses a battery to retain memory, if the battery dies or is disconnected, the data stored in the SRAM will be lost.  Therefore, if BIOS or PRAM settings are not retained after a computer is restarted, it is likely the computer's battery has lost its charge and needs to be replaced.\nEEPROM (pronounced \"e-e-p-rom\") stores data using electrical charges that maintain their state without electrical power.  Therefore, EEPROM does not need a battery or other power source to retain data.  The most common type of EEPROM is flash memory, which is used for USB keychain drives and other portable electronic devices."
        ]
    },
    {
        "word": "NaN",
        "type": [],
        "definition": [
            "Stands for \"Not a Number.\"  NaN is a term used in mathematics and computer science to describe a non-numeric value.  It may also be a placeholder for an expected numeric result that cannot be defined as a floating point number.\nThere are two primary types of ways in which NaN may be generated: 1) a mathematical calculation and 2) non-numeric input.  The following mathematical calculations produce NaN because the result is undefined:\n\n0 ÷ 0\n0 x ∞\n∞ ÷ ∞\n\nWhen a calculation involves a character, string, or other non-numeric value, the result may also be NaN.  For example, 20 x \"horse\" does not produce a numeric result since 20 is an integer and \"horse\" is a string.  A function may return NaN as a result of invalid input, which is a preferred alternative to a program crash.\nSome spreadsheet and database programs display NaN or #NaN in a table cell when the cell formula has not received valid numeric input for the calculation.\nDifferent programming languages handle NaN values in different ways.  For example, in JavaScript, NaN is a property of a global object (i.e. Number.NaN).  JavaScript provides an isNan() function to check if a value is NaN.  PHP uses the function is_nan() for the same purpose.  Both return a boolean value of true or false."
        ]
    },
    {
        "word": "Name Server",
        "type": [],
        "definition": [
            "A name server translates domain names into IP addresses.  This makes it possible for a user to access a website by typing in the domain name instead of the website's actual IP address.  For example, when you type in \"www.microsoft.com,\" the request gets sent to Microsoft's name server which returns the IP address of the Microsoft website.\nEach domain name must have at least two name servers listed when the domain is registered.  These name servers are commonly named ns1.servername.com and ns2.servername.com, where \"servername\" is the name of the server.  The first server listed is the primary server, while the second is used as a backup server if the first server is not responding.\nName servers are a fundamental part of the Domain Name System (DNS).  They allow websites to use domain names instead of IP addresses, which would be much harder to remember.  In order to find out what a certain domain name's name servers are, you can use a WHOIS lookup tool."
        ]
    },
    {
        "word": "Namespace",
        "type": [],
        "definition": [
            "A namespace is a group of related elements that each have a unique name or identifier.  There are several different types of namespaces, and each one has a specific syntax used to define  the corresponding elements.  Each element within a namespace has a \"local name\" that serves as a unique identifier.\nNamespaces are used in many areas of computing, such as domain names, file paths, and XML documents.  Below are examples of these different applications.\n\nDomain Names - The namespace syntax for domain names is specified by the Domain Name System, or DNS.  It includes the top-level domain, (e.g. \"techterms.com\") and a subdomain, such as \"www.\"  In the URL \"www.techterms.com,\" the namespace identifier is \"techterms.com,\" while the local name is \"www.\"\nFile Paths - File locations may be specified using a file path, which can include multiple directories.  A file path, which uses syntax defined by the operating system, is considered a namespace.  For example, C:\\Program Files\\Internet Explorer is the namespace that describes where Internet Explorer files on a Windows computer.  The namespace \/usr\/local\/apache\/ defines the location of Apache files on a Unix-based web server.  Individual filenames within these directories serve as unique identifiers.\nXML Documents - XML namespaces (XMLNS) are used to associate a document's element and attribute names with a namespace identified by an external URI.  For example, an XML file may include HTML elements that are specified at \"http:\/\/www.w3.org\/1999\/xhtml.\"  This reference might appear as \"&lt;html:html xmlns:html='http:\/\/www.w3.org\/1999\/xhtml'&gt;\" near the top of the XML document.\n\nThe above examples are just a few types of namespaces used in computing.  They are also used to define network devices and other types of computer hardware.  Additionally, computer programmers often used namespaces to group related variables within the source code of a program.  While there are many different types of namespaces, they all serve the same purpose — to contain a logical grouping of related elements."
        ]
    },
    {
        "word": "Nanometer",
        "type": [],
        "definition": [
            "A nanometer (also \"nanometre\") is a unit of measurement used to measure length.  One nanometer is one billionth of a meter, so nanometers are certainly not used to measure long distances.  Instead, they serve to measure extremely small objects, such as atomic structures or transistors found in modern CPUs.\nA single nanometer is one million times smaller than a millimeter.  If you take one thousandth of a millimeter, you have one micrometer, or a single micron.  If you divide that micron by 1,000, you have a nanometer.  Needless to say, a nanometer is extremely small.\nSince integrated circuits, such as computer processors, contain microscopic components, nanometers are useful for measuring their size.  In fact, different eras of processors are defined in nanometers, in which the number defines the distance between transistors and other components within the CPU.  The smaller the number, the more transistors that can be placed within the same area, allowing for faster, more efficient processor designs.\nIntel's processor line, for example, has included chips based on the 90-nanometer, 65-nanometer, 45-nanometer, and 32-nanometer processes.  In 2011, Intel released chips that were created using a 22-nanometer process.  Intel's \"Broadwell\" design, introduced in 2014, uses a 14-nanometer process.  \nAbbreviation: nm"
        ]
    },
    {
        "word": "Native File",
        "type": [],
        "definition": [
            "When you save a file using a certain program, the file is often saved in a proprietary format only that program can recognize.  For example, if you save a Microsoft Word document, it is saved as a Word document (i.e. mydocument.doc).  This is a native Word file -- that is, the file format is native to the Microsoft Word application and may not be recognized by other programs.\nWhen you use the \"Save As...\" command to save a file, you may be given the option to save the file in a different format.  For example, you might be able to save a Word document as a plain text (.txt) file or a rich text (.rtf) file.  These formats are not native to Microsoft Word, but can still be opened by the Microsoft Word program.  Similarly, Adobe Photoshop saves files as Photoshop documents (.psd files), but can also save them in .jpg and .gif formats, among others.\nIt is usually best to save a file in a program's native file format because you can be sure it will store all the data you have created with the program.  While other formats may be more compatible with other programs, they might not save all the information in the file.  For example, if you save a Word document as a plain text file, all the text formatting you had added will be removed.  Saving a Photoshop document in JPEG format will reduce the image quality and flatten all the image's layers.\nSo if you're planning on editing a file after you've saved it, saving it as a native file is the best choice.  If you want to save the most compatible version of the file, saving a copy of the file in a more generic format is a good idea."
        ]
    },
    {
        "word": "Natural Number",
        "type": [],
        "definition": [
            "A natural number is an integer greater than 0.  Natural numbers begin at 1 and increment to infinity: 1, 2, 3, 4, 5, etc.\nNatural numbers are also called \"counting numbers\" because they are used for counting.  For example, if you are timing something in seconds, you would use natural numbers (usually starting with 1).  When written, natural numbers do not have a decimal point (since they are integers), but large natural numbers may include commas, e.g. 1,000 and 234,567,890.  Natural numbers will never include a minus symbol (-) because they cannot be negative.\nIn computer science, natural numbers are commonly used when incrementing values.  For example, in a for loop, the counter often increases by one with each iteration.  Once the counter hits the limit (e.g., 10 in for (i=1; i"
        ]
    },
    {
        "word": "Navigation Bar",
        "type": [],
        "definition": [
            "A navigation bar is a user interface element within a webpage that contains links to other sections of the website.  In most cases, the navigation bar is part of the main website template, which means it is displayed on most, if not all, pages within the website.  This means that no matter what page you are viewing, you can use the navigation bar to visit other sections of the website.\nA website navigation bar is most commonly displayed as horizontal list of links at the top of each page.  It may be below the header or logo, but it is always placed before the main content of the page.  In some cases, it may make sense to place the navigation bar vertically on the left side of each page.  This type of navigation bar is also called a sidebar, since it appears to the side of the primary content.  Some websites have both a horizontal navigation bar at the top and a vertical navigation bar on the left side of each page.\nThe navigation bar is an important element of a website's design since it allows users to quickly visit any section within the site.  If you've ever visited a website without a navigation bar, you may have found it is difficult to locate the page you need.  You may have also had to click \"Back\" several times in order to find a link to the next section you wanted to visit.  Thankfully, web design has become more standardized in recent years and nearly every website now includes a navigation bar.\nNOTE: Developers often refer to the navigation bar as the \"navbar.\""
        ]
    },
    {
        "word": "NetBIOS",
        "type": [],
        "definition": [
            "Stands for \"Network Basic Input\/Output System.\"  NetBIOS was introduced in 1983 by IBM as an improvement to the standard BIOS used by Windows-based computers.  The BIOS provides an interface between the computer's operating system and the hardware.  As the name implies, NetBIOS adds support for networking, including the ability to recognize other devices connected to the network.\nNetBIOS provides an API (Application Program Interface) for software developers to use.  The NetBIOS API includes network-related functions and commands, which can be incorporated into software programs.  For example, a programmer can use a prewritten NetBIOS function to enable a software program to access other devices on a network.  This is much easier than writing the networking code from scratch.  In other words, NetBIOS prevents programmers from having to \"reinvent the wheel\" just to get their program to connect to a network."
        ]
    },
    {
        "word": "Netiquette",
        "type": [],
        "definition": [
            "Netiquette is short for \"Internet etiquette.\"  Just like etiquette is a code of polite behavior in society, netiquette is a code of good behavior on the Internet.  This includes several aspects of the Internet, such as email, social media, online chat, web forums, website comments, multiplayer gaming, and other types of online communication.\nWhile there is no official list of netiquette rules or guidelines, the general idea is to respect others online.  Below are ten examples of rules to follow for good netiquette:\n\nAvoid posting inflammatory or offensive comments online (a.k.a flaming).\nRespect others' privacy by not sharing personal information, photos, or videos that another person may not want published online.\nNever spam others by sending large amounts of unsolicited email.\nShow good sportsmanship when playing online games, whether you win or lose.\nDon't troll people in web forums or website comments by repeatedly nagging or annoying them.\nStick to the topic when posting in online forums or when commenting on photos or videos, such as YouTube or Facebook comments.\nDon't swear or use offensive language.\nAvoid replying to negative comments with more negative comments.  Instead, break the cycle with a positive post.\nIf someone asks a question and you know the answer, offer to help.\nThank others who help you online.\n\nThe Internet provides a sense of anonymity since you often do not see or hear the people with whom you are communicating online.  But that is not an excuse for having poor manners or posting incendiary comments.  While some users may feel like they can hide behind their keyboard or smartphone when posting online, the fact is they are still the ones publishing the content.  Remember – if you post offensive remarks online and the veil of anonymity is lifted, you will have to answer for the comments you made.\nIn summary, good netiquette benefits both you and others on the Internet.  Posting a positive comment rather than a negative one just might make someone's day. "
        ]
    },
    {
        "word": "Netmask",
        "type": [],
        "definition": [
            "The terms netmask and subnet mask are often used interchangeably.  However, subnet masks are used primarily in network configurations, while netmasks typically refer to classes of IP addresses.  They are used to define a range of IP addresses that can be used by an ISP or other organization.\nThere are three standard classes of IP addresses – A, B, and C – which have the following netmasks:\nClass A: 255.0.0.0\nClass B: 255.255.0.0\nClass C: 255.255.255.0\nA Class A netmask defines a range of IP addresses in which the first three digit section is the same, but the other sections may each contain any number between 0 and 255.  Class B addresses have the same first two sections, but the numbers in the second two sections can be different.  Class C addresses have the same first three sections and only the last section can have different numbers.  Therefore, a Class C IP address range may contain up to 256 addresses.\nTechnically, a netmask is a 32-bit value used to divide sections of IP addresses.  While a class C netmask is commonly written \"255.255.255.0,\" it may also be defined as 11111111.11111111.11111111.00000000.  This binary representation reveals the 32 bits that make up the netmask (4 sections of 8 bits each).  It also  shows the way the netmask \"masks\" the IP addresses it contains.  The sections with all 1's are predefined and cannot be changed, while the section with all 0's can be any number between 0 and 255."
        ]
    },
    {
        "word": "Network",
        "type": [],
        "definition": [
            "A network consists of multiple devices that communicate with one another.  It can be as small as two computers or as large as billions of devices.  While a traditional network is comprised of desktop computers, modern networks may include laptops, tablets, smartphones, televisions, gaming consoles, smart appliances, and other electronics.\nMany types of networks exist, but they fall under two primary categories: LANs and WANs.\nLAN (Local Area Network)\nA local area network is limited to a specific area, such as a home, office, or campus.  A home network may have a single router that offers both wired and wireless connections.  For example, a computer may connect to the router via Ethernet, while smartphones and tablets connect to the router via Wi-Fi.  All devices connected to the router share the same network and often the same Internet connection.\nA larger network, such as the network of an educational institution, may be comprised of many switches, hubs, and Ethernet cables.  It may also include multiple wireless access points and wireless repeaters that provide wireless access to the network.  While this type of network is much more complex than a home network, it is still considered a LAN since it is limited to a specific location.\n WAN (Wide Area Network)\nA wide area network is not limited to a single area, but spans multiple locations.  WANs are often comprised of multiple LANs that are connected over the Internet.  A company WAN, for example, may extend from the headquarters to other offices around the world.  Access to WANs may be limited using authentication, firewalls, and other security measures.  The Internet itself is the largest WAN since it encompasses all locations connected to the Internet.\n"
        ]
    },
    {
        "word": "Network Topology",
        "type": [],
        "definition": [
            "A network topology describes the arrangement of systems on a computer network.  It defines how the computers, or nodes, within the network are arranged and connected to each other.  Some common network topologies include star, ring, line, bus, and tree configurations.  These topologies are defined below:\n\nStar - One central node is connected to each of the other nodes on a network.  Similar to a hub connected to the spokes in a wheel.\nRing - Each node is connected to exactly two other nodes, forming a ring.  Can be visualized as a circular configuration.  Requires at least three nodes.\nLine - Nodes are arranged in a line, where most nodes are connected to two other nodes.  However, the first and last node are not connected like they are in a ring.\nBus - Each node is connected to a central bus that runs along the entire network.  All information transmitted across the bus can be received by any system in the network.\nTree - One \"root\" node connects to other nodes, which in turn connect to other nodes, forming a tree structure.  Information from the root node may have to pass through other nodes to reach the end nodes.\n\nIt is helpful for a network administrator to know the pros and cons of different network topologies when putting together a network.  By weighing the benefits of each type, the administrator can choose the configuration that is most efficient for the network's intended purpose."
        ]
    },
    {
        "word": "Newbie",
        "type": [],
        "definition": [
            "A newbie is a person who has recently started using a certain technology.  It may refer to hardware – such as computer or smartphone – or software, such as an app, website, or web forum.\nThe term \"newbie\" is a modern variation of the phrase \"new boy,\" which was historically used to describe someone just starting school or a new job.  While \"newbie\" sounds like a derogatory term, it does not have strong negative connotations.  After all, in the modern era, everyone is constantly learning new technologies.  Everyone is a newbie in some area.\nEven highly technical people may be considered newbies when learning new technologies.  This is often the case when someone switches from one platform to another.  For example, a person who has used an iPhone for many years may be an Android newbie if he or she buys a Google Pixel.  A PC user might be considered an Apple newbie if he or she buys a Mac.\nNewbie vs Noob\nThe term \"noob\" (or \"n00b\" in leetspeak) is a shortened version of \"newbie.\"  While the terms are sometimes used interchangeably, \"noob\" is commonly used in online gaming.  The term \"noob\" may be considered derogatory since it implies the user lacks the skill or competence to be competitive.  For example, if one player dominates another in an online multiplayer game, he may call the other person a noob at the end of the match.  Of course, this is poor netiquette and the best way to respond is to improve your gaming skills and beat the player the next time you play."
        ]
    },
    {
        "word": "Newline",
        "type": [],
        "definition": [
            "Newline is a character that marks the end of a line of text.  As the name implies, it is used to create a new line in a text document, database field, or any other block of text.\nWhen typing in a word processor, you can enter a newline character by pressing the \"Enter\" or \"Return\" key on your keyboard.  This creates a line break (also known as a \"carriage return\" or \"line feed\") in the text and moves the cursor to the beginning of the next line.  When a line break occurs at the end of a block of text, it is called a trailing newline.\nThe newline character is important in computer programming, since it allows programmers to search for line breaks in text files.  For example, if a data file lists one element per line, the items can be delimited by newline characters.  In most modern programming languages, the newline character is represented by either \"\\n\" or \"\\r\".  Some databases, like MySQL, store line breaks using a combination of \"\\r\\n\".  By searching for newline characters in text strings, programmers can parse documents line by line and remove unwanted line breaks."
        ]
    },
    {
        "word": "Newsgroup",
        "type": [],
        "definition": [
            "A newsgroup is an online discussion forum accessible through Usenet.  Each newsgroup contains discussions about a specific topic, indicated in the newsgroup name.  You can browse newsgroups and post or reply to topics using a newsreader program.  Access to newsgroups also requires a Usenet subscription.  Most Usenet providers offer monthly access for around $10 USD per month.\nNewsgroups may be either moderated or unmoderated.  In a moderated newsgroup, a moderator must approve posts in order for them to become part of the discussion.  In an unmoderated group, everything posted is included in the discussion.  Some newsgroups may also use bots to moderate the content, automatically eliminating posts that are deemed offensive or off topic.\nWhile many people now use web forums and online chat instead of newsgroups, the service is still popular around the world.  In fact, there are estimated to be over 100,000 newsgroups in existence.  While many newsgroups host traditional text-based discussions, a large number of newsgroups are now used for file sharing.  These newsgroups, which primarily provide links to files, often have the term \"binaries\" in their name.\nNewsgroup Examples\nBelow are some examples of active newsgroups.  The first part of the name (before the first dot) is the primary category (or hierarchy) or the newsgroup.  For example, sci. is used for science-related discussions.\n\nalt.politics\ntalk.religion\nsci.physics\ncomp.software.testing\nalt.binaries.documentaries\nalt.binaries.multimedia.comedy\n\nYou can browse discussions and post to newsgroups using a newsreader."
        ]
    },
    {
        "word": "Nextdoor",
        "type": [],
        "definition": [
            "Nextdoor is a social media platform that connects neighbors.  It provides a way for people who live in the same local area to interact and communicate online.\nWhile services like Facebook and Instagram allow users to build a network of friends and followers, Nextdoor automatically connects people by physical proximity.  Users can see posts from anyone in their neighborhood or surrounding area, providing an open forum for neighbors.\nSince Nextdoor is local community-oriented, users often post comments about their neighborhood.  For example, it's commonplace to share concerns about suspicious activity.  It's also an ideal platform to post a notice of a lost item or missing pet.  Many cities have authorized Nextdoor accounts, which they use to provide official announcements and updates to residents.\nNextdoor also serves as a local marketplace, allowing neighbors to post items for sale.  Local businesses can market their services through sponsored posts.  People with similar interests can join groups and plan local events.  In some ways, Nextdoor is the opposite of the metaverse since it aims to connect neighbors in the real world."
        ]
    },
    {
        "word": "NoSQL",
        "type": [],
        "definition": [
            "NoSQL is a non-relational database that stores and accesses data using key-values.  Instead of storing data in rows and columns like a traditional database, a NoSQL DBMS stores each item individually with a unique key.  Additionally, a NoSQL database does not require a structured schema that defines each table and the related columns.  This provides a much more flexible approach to storing data than a relational database.\nWhile relational databases (like MySQL) are ideal for storing structured data, their rigid structure makes it difficult to add new fields and quickly scale the database.  NoSQL provides an unstructured or \"semi-structured\" approach that is ideal for capturing and storing user generated content (UGC).  This may include text, images, audio files, videos, click streams, tweets, or other data.  While relational databases often become slower and more inefficient as they grow, NoSQL databases are highly scalable.  In fact, you can add thousands or hundreds of thousands of new records to a NoSQL database with a minimal decrease in performance.\nBecause of NoSQL's flexibility and scalability, many large businesses and organizations have begun using NoSQL databases to store user data.  They are especially common in cloud computing applications and have become a most popular storage solution for big data.\nNOTE: NoSQL is sometimes referred to as \"Not only SQL,\" though it is not the official meaning of the term."
        ]
    },
    {
        "word": "Node",
        "type": [],
        "definition": [
            "Any system or device connected to a network is also called a node.  For example, if a network connects a file server, five computers, and two printers, there are eight nodes on the network.  Each device on the network has a network address, such as a MAC address, which uniquely identifies each device.  This helps keep track of where data is being transferred to and from on the network.\nA node can also refer to a leaf, which is a folder or file on your hard disk.  In physics, a node, or nodal point, is a point of minimum displacement or where multiple waves converge, creating a net amplitude of zero."
        ]
    },
    {
        "word": "Non-Impact Printer",
        "type": [],
        "definition": [
            "Early printers, such as dot matrix and daisywheel printers were called impact printers, since they operated by striking an ink ribbon against the paper.  Most modern printers, including inkjet and laser printers, don't include an ink ribbon and are considered to be non-impact printers.\nNon-impact printers are generally much quieter than impact printers since they don't physically strike the page.  For example, inkjet printers spray tiny drops of ink onto the page, while laser printers use a cylindrical drum that rolls electrically charged ink onto the paper.  Both of these methods are non-impact and provide an efficient printing process that produces little sound.  The low impact nature of inkjet and laser printers also means they are less likely to need maintenance or repairs than earlier impact printers."
        ]
    },
    {
        "word": "Non-Volatile Memory",
        "type": [],
        "definition": [
            "Non-volatile memory (NVM) is a type of memory that retains stored data after the power is turned off.  Unlike volatile memory, it does not require an electric charge to maintain the storage state.  Only reading and writing data to non-volatile memory requires power.\nStorage devices, such as HDDs and SSDs, use non-volatile memory since they must maintain their data when the host device is turned off.  Hard disks (HDDs) store data magnetically, while (flash disks|flash memory) (SSDs) store data using memory cells in integrated circuits.  Both can maintain their storage state for several years without power.\nExamples of non-volatile memory are listed below:\n\nHard disk drive (HDD)\nSolid state drive (SSD)\nFlash drive (USB keychain)\nOptical media (CDs, DVDs, etc)\nRead-only memory (ROM)\n\nSince most storage devices need to maintain data without power, non-volatile memory is far more common than volatile memory.  In computers, volatile memory is primary used for RAM and temporary cache storage."
        ]
    },
    {
        "word": "Northbridge",
        "type": [],
        "definition": [
            "The northbridge is a chip inside a computer that connects the central processing unit (CPU) to other primary components in the system.  These components include RAM (a.k.a. system memory), the frontside bus (FSB), PCI Express cards, and the AGP card.  The northbridge also connects to the southbridge, which controls the remaining components of the computer.\nWhile the CPU is the main processor inside the computer, the northbridge is the primary controller.  It acts like a traffic cop directing data to and from the CPU.  Therefore, the performance of the northbridge chip affects the overall performance of the computer.  On Intel systems, the northbridge is also called the Memory Controller Hub (MCH), since it controls the data flow to and from the system memory."
        ]
    },
    {
        "word": "Null",
        "type": [],
        "definition": [
            "When a variable has no value, it considered to be null.  Having a null value is different than having a value of 0, since 0 is an actual value.  However, when used in a boolean test, both null and zero result in a FALSE value.  Programmers often use boolean tests to determine whether a variable has been given a value or not."
        ]
    },
    {
        "word": "Null Character",
        "type": [],
        "definition": [
            "A null character is a character with all its bits set to zero.  Therefore, it has a numeric value of zero and can be used to represent the end of a string of characters, such as a word or phrase.  This helps programmers determine the length of strings.  In practical applications, such as database and spreadsheet programs, null characters are used as fillers for spaces."
        ]
    },
    {
        "word": "Num Lock",
        "type": [],
        "definition": [
            "Num Lock is a key that is typically located near the keypad on the right side of a keyboard.  Like Caps Lock, Num Lock is a toggle key, which toggles the input of certain keys, depending whether Num Lock is on or off.\nNum Lock is short for \"Number Lock.\"  It was implemented in early Windows keyboards to lock the input of the numeric keypad.  When Num Lock is on, the keypad only enters numbers.  When Num Lock is off, the keys may provide different input as indicated below:\n\n. - Delete\n0 - Insert\n1 - End\n2 - Down Arrow\n3 - Page Down\n4 - Left Arrow\n5 - Clear\n6 - Right Arrow\n7 - Home\n8 - Up Arrow\n9 - Page Up\n\nSince early PC keyboards did not have arrow keys, Num Lock gave the keypad a useful dual functionality.  However, now that most keyboards have arrow keys and other special keys, such as Page Up and Page down, the Num Lock key is not often used.  On some keyboards (especially Macintosh keyboards), the Num Lock is not functional.  On others, it typically is set to ON by default.\nWhile you may not need to use the Num Lock key with your keyboard, it is helpful to know the key's function.  If you find yourself trying to enter numbers with the numeric keypad and nothing appears on the screen, it is possible that Num Lock is OFF.  If this is the case, pressing the Num Lock key should fix the problem."
        ]
    },
    {
        "word": "Nybble",
        "type": [],
        "definition": [
            "A nybble, sometimes spelled \"nibble,\" is a set of four bits.  Since there are eight bits in a byte, a nybble is half of one byte.  While it may take the average person several nibbles to equal one bite of a cookie, in the computer world, two nybbles always equal one byte.\nThe four bits in a nibble allow it to have 16 possible values, which is the same as one hexadecimal digit.  Therefore, a nybble is sometimes referred to as a \"hex digit.\"  In data communications, nybbles are sometimes called \"quadbits,\" because of the four bits that make up each nybble."
        ]
    }
]