[
    {
        "word": "OASIS",
        "type": [],
        "definition": [
            "Stands for \"Organization for the Advancement of Structured Information Standards.\"  To someone backpacking through the Sahara, this is not the type of OASIS you want to see.  But is it a welcome sight in the computer science world.  OASIS is a non-profit, global consortium that supports the development and adoption of e-business standards.\nWhile it won't quench your thirst in the middle of the desert, OASIS does provide several useful technology standards.  Common standards regulated by the OASIS consortium include protocols, file formats, and markup languages.  Hardware and software companies often work with OASIS to develop and institute standards that are efficient and effective.\nThe standards produced by OASIS are open standards, which means they can be used by any company or organization.  This allows multiple companies to develop products based on the same standard, which offers a high degree of interoperability between different computer systems.  For example, a file format standardized by OASIS may be supported by several different programs.  Because each program can save files in the same format, the files can be opened by any of the programs without needing to be converted or translated.  This makes transferring files between applications or even different systems a seamless process."
        ]
    },
    {
        "word": "OCR",
        "type": [],
        "definition": [
            "Stands for \"Optical Character Recognition.\"  OCR is a technology that recognizes text within a digital image.  It is commonly used to recognize text in scanned documents, but it serves many other purposes as well.\nOCR software processes a digital image by locating and recognizing characters, such as letters, numbers, and symbols.  Some OCR software will simply export the text, while other programs can convert the characters to editable text directly in the image.  Advanced OCR software can export the size and formatting of the text as well as the layout of the text found on a page.\nOCR technology can be used to convert a hard copy of a document into an electronic version (or soft copy).  For example, if you scan a multipage document into a digital image, such as a TIFF file, you can load the document into an OCR program, which will recognize the text and convert the document to an editable text file.  Some OCR programs allow you to scan a document and convert it to a word processing document in a single step.\nWhile OCR technology was originally designed to recognize printed text, it can be used to recognize and verify handwritten text as well.  For example, postal services such as USPS use OCR software to automatically process letters and packages based on the address.  The algorithm checks the scanned information against database of existing addresses to confirm the mailing address.  The Google Translate app includes OCR technology that works with your device's camera.  It allows you to capture the text from documents, magazines, signs, and other objects and translate it to another language in real-time."
        ]
    },
    {
        "word": "ODBC",
        "type": [],
        "definition": [
            "Stands for \"Open Database Connectivity.\"  With all the different types of databases available, such as Microsoft Access, Filemaker, and MySQL, it is important to have a standard way of transferring data to and from each kind of database.  For this reason, the SQL Access group created the ODBC standard back in 1992.  Any application that supports ODBC can access information from an ODBC-compatible database, regardless of what database management system the database uses.\nFor a database to be ODBC-compatible, it must include an ODBC database driver.  This allows other applications to connect to and access information from the database with a standard set of commands.  The driver translates standard ODBC commands into commands understood by the database's proprietary system.  Thanks to ODBC, a single application (such as Web server program) can access information from several different databases using the same set of commands."
        ]
    },
    {
        "word": "OEM",
        "type": [],
        "definition": [
            "Stands for \"Original Equipment Manufacturer.\"  An OEM is a company that manufactures or develops something that is sold by another company.  In the computer world, it can refer to both hardware and software.\nMost computers contain components manufactured by multiple companies.  For example, Dell does not make all the components in a Dell laptop and Apple does not make all the components in an iMac. While these companies design the computers, they incorporate components from other manufactures.  For example, a Dell laptop might contain an AMD processor and a Samsung SSD.  AMD would be the processor OEM and Samsung would be the OEM of the storage device.  An iMac might contain an Intel processor and Micron RAM.  In this case, Intel and Micron are the respective OEMs.\nKnowing which OEMs provide components to your computer can be helpful when replacing or upgrading parts.  It can help ensure you get as close of a match as possible to the original part.  If you have had issues with a certain component, it might make sense to switch to another manufacturer.  Just make sure the hardware specifications are supported by your system.\nYou can lookup OEM information in both Windows and macOS using the System Information app.  In Windows, you can open this app by typing Msinfo32.exe in the \"Run\" field of the Start Menu.  You can also locate the app in \/Programs\\Accessories\\System Tools\\System Information.  In macOS, you can select \"About this Mac\" from the Apple menu, then click System Report... to open the System Information app.  You can locate the app in \/Applications\/Utilities\/System Information.app.\nOEM Software\nOEM software refers to programs that are bundled with a computer system.  This includes applications and utilities that are developed by various software developers and installed on a system before it is sold.  It can also refer to an operating system, such as Windows, that is installed on a PC.  Users who build their own PCs often purchase an \"OEM license\" of Windows to install on their custom system.\nNOTE: The term OEM is used in many other industries as well.  For example, auto manufacturers often include multiple OEM parts in their cars and trucks.  For example, an Acura may have NGK spark plugs and Bose speakers, while an Audi might have Bosch spark plugs and Bang & Olufsen speakers."
        ]
    },
    {
        "word": "OLAP",
        "type": [],
        "definition": [
            "Stands for \"Online Analytical Processing.\"  OLAP allows users to analyze database information from multiple database systems at one time.  While relational databases are considered to be two-dimensional, OLAP data is multidimensional, meaning the information can be compared in many different ways.  For example, a company might compare their computer sales in June with sales in July, then compare those results with the sales from another location, which might be stored in a different database.\nIn order to process database information using OLAP, an OLAP server is required to organize and compare the information.  Clients can analyze different sets of data using functions built into the OLAP server.  Some popular OLAP server software programs include Oracle Express Server and Hyperion Solutions Essbase.  Because of its powerful data analysis capabilities, OLAP processing is often used for data mining, which aims to discover new relationships between different sets of data."
        ]
    },
    {
        "word": "OLE",
        "type": [],
        "definition": [
            "Stands for \"Object Linking and Embedding.\"  It can be pronounced as \"O-L-E,\" or \"Oh-lay!\" if you are feeling Spanish.  OLE is a framework developed by Microsoft (way back in Windows 3.1) that allows you to take objects from a document in one application and place them in another.  For example, OLE may allow you to move an image from a photo-editing program into a word processing document.\nThe OLE technology was initially created to allow the linking of objects between \"compound documents,\" or documents that support multiple types of data.  Microsoft has since developed OLE into a wider standard, known as the Component Object Model (COM).  COM is supported by Mac, Unix, and Windows systems, but is primarily used with Microsoft Windows.  The COM framework is the foundation of ActiveX, which allows developers to create interactive content for the Web."
        ]
    },
    {
        "word": "OLED",
        "type": [],
        "definition": [
            "Stands for \"Organic Light Emitting Diode\" and is pronounced \"oh-led.\"  OLED is a type of flat screen display similar to an LCD that does not require a backlight.  Instead, each LED within an OLED panel lights up individually.\nAn OLED screen has six layers that work together to produce color images.  These layers include the following, from bottom to top:\n\nSubstrate - the foundational structure that supports the panel; typically made out of glass or plastic\nAnode - a transparent layer that removes electrons when electrical current flows through it\nConductive Layer - contains organic molecules or polymers such as polyaniline that transfer current to the emissive layer\nEmissive Layer - contains organic molecules or polymers such as polyfluorene that light up when current is passed through them\nCathode - injects electrons into the other layers when current flows through it\nCover - the top protective layer of the screen; typically made out of glass or plastic\n\nHow does an OLED work?\nOLEDs display light using a process called electrophosphorescence.  While this may sound like an intimidating term, the process is relatively simple.  Electrical current flows from the cathode (negatively charged) to the anode (positively charged), causing electrons to move to the emissive layer.  These electrons find \"holes\" (where atoms missing electrons) in the conductive layer and produce light when they fill these holes.  The color of the light depends on the organic molecule that the current passed through in the emissive layer.\nSince the diodes in OLED displays light up individually, there is no need for a backlight.  This means OLEDs can have darker blacks than LED\/LCD displays and use less electricity.  They are also thinner and may be curved or even bendable.  While OLEDs have many advantages over LED\/LCD displays, it has been expensive to produce large, reliable OLED screens.  Therefore, OLEDs have been more common in small electronics, such as smartphones and tablets.  As OLED production costs decrease and reliability increases, the technology will become more commonly used in larger screens, such as televisions and computer monitors."
        ]
    },
    {
        "word": "OOP",
        "type": [],
        "definition": [
            "Stands for \"Object-Oriented Programming.\"  OOP (not Oops!) refers to a programming methodology based on objects, instead of just functions and procedures.  These objects are organized into classes, which allow individual objects to be grouped together.  Most modern programming languages, including Java, C++, and PHP, are object-oriented languages, and many older programming languages now have object-oriented versions.\nAn \"object\" in an OOP language refers to a specific type, or \"instance,\" of a class.  Each object has a structure similar to other objects in the class, but can be assigned individual characteristics.  An object can also call functions, or methods, specific to that object.  For example, the source code of a video game may include a class that defines the structure of characters in the game.  Individual characters may be defined as objects, which allows them to have different appearances, skills, and abilities.  They may also perform different tasks in the game, which are run using each object's specific methods.\nObject-oriented programming makes it easier for programmers to structure and organize software programs.  Because individual objects can be modified without affecting other aspects of the program, it is also easier to update and change programs written in object-oriented languages.  As software programs have grown larger over the years, OOP has made developing these large programs more manageable."
        ]
    },
    {
        "word": "OS X",
        "type": [],
        "definition": [
            "OS X is Apple's operating system that runs on Macintosh computers.  It was first released in 2001 and over the next few years replaced Mac OS 9 (also known as Mac OS Classic) as the standard OS for Macs.  It was called \"Mac OS X\" until version OS X 10.8, when Apple dropped \"Mac\" from the name.\nOS X was originally built from NeXTSTEP, an operating system designed by NeXT, which Apple acquired when Steve Jobs returned to Apple in 1997.  Like NeXTSTEP, OS X is based on Unix and uses the same Mach kernel.  This kernel provides OS X with better multithreading capabilities and improved memory management compared to Mac OS Classic.  While the change forced Mac developers to rewrite their software programs, it provided necessary performance improvements and scalability for future generations of Macs.\nThe OS X desktop interface is called the Finder and includes several standard features.  OS X does not have a task bar like Windows, but instead includes a menu bar, which is fixed at the top of the screen.  The menu bar options change depending on what application is currently running and is only hidden when full screen mode is enabled.  The Finder also includes a Dock, which is displayed by default on the bottom of the screen.  The Dock provides easy one-click access to frequently used applications and files.  The Finder also displays a user-selectable desktop background that serves as a backdrop for icons and open windows.\nWhen you start up a Mac, OS X loads automatically.  It serves as the fundamental user interface, but also works behind the scenes, managing processes and applications.  For example, when you double-click an application icon, OS X launches the corresponding program and provides memory to the application while it is running.  It reallocates memory as necessary and frees up used memory when an application is quit.  OS X also includes an extensive API, or library of functions, that developers can use when writing Mac programs.\nWhile the OS X interface remains similar to the original version released in 2001, it has gone through several updates, which have each added numerous new features to the operating system.  Below is a list of the different versions of OS X, along with their code names.\n\nMac OS X 10.0 (Cheetah)\nMac OS X 10.1 (Puma)\nMac OS X 10.2 (Jaguar)\nMac OS X 10.3 (Panther)\nMac OS X 10.4 (Tiger)\nMac OS X 10.5 (Leopard)\nMac OS X 10.6 (Snow Leopard)\nMac OS X 10.7 (Lion)\nOS X 10.8 (Mountain Lion)\nOS X 10.9 (Mavericks)\nOS X 10.10 (Yosemite)\n"
        ]
    },
    {
        "word": "OSD",
        "type": [],
        "definition": [
            "Stands for \"On Screen Display.\"  Most monitors include an on screen menu for making adjustments to the display.  This menu, called the OSD, may be activated by pressing the Menu button located on the side or front of your monitor.  Once the OSD appears on the screen, you can navigate through the menu and make adjustments using the Plus (+) and Minus (-) buttons, which are usually located right next to the menu button.\nOn screen displays vary between monitors, but most include the basic brightness and contrast controls.  Some include more advanced color controls, allowing you to calibrate individual red, green, and blue (RGB) settings.  Many monitors also support positioning adjustments, which can be used to make slight modifications to the position and tilt of the screen.  Monitors that include built-in speakers may include audio adjustments as well.\nMost CRT and flat screen monitors, such as LCD and LED displays, include OSDs.  However, flat screen displays typically have less adjustment options since their screen position is more consistent than older CRT monitors.  Some newer monitors also allow users to make adjustments through a software interface rather than using the standard on screen display.  Regardless of what monitor you have, it is good to be familiar with the OSD so you know how to adjust the display settings."
        ]
    },
    {
        "word": "OSI Model",
        "type": [],
        "definition": [
            "The OSI (Open Systems Interconnection) model was created by the ISO to help standardize communication between computer systems.  It divides communications into seven different layers, which each include multiple hardware standards, protocols, or other types of services.\nThe seven layers of the OSI model include:\n\nThe Physical layer\nThe Data Link layer\nThe Network layer\nThe Transport layer\nThe Session layer\nThe Presentation layer\nThe Application layer\n\nWhen one computer system communicates with another, whether it is over a local network or the Internet, data travels through these seven layers.  It begins with the physical layer of the transmitting system and travels through the other layers to the application layer.  Once the data reaches the application layer, it is processed by the receiving system.  In some cases, the data will move through the layers in reverse to the physical layer of the receiving computer.\nThe best way to explain how the OSI model works is to use a real life example.  In the following illustration, a computer is using a wireless connection to access a secure website.\nThe communications stack begins with the (1) physical layer.  This may be the computer's Wi-Fi card, which transmits data using the IEEE 802.11n standard.  Next, the (2) data link layer might involve connecting to a router via DHCP.  This would provide the system with an IP address, which is part of the (3) network layer.  Once the computer has an IP address, it can connect to the Internet via the TCP protocol, which is the (4) transport layer.  The system may then establish a NetBIOS session, which creates the (5) session layer.  If a secure connection is established, the (6) presentation layer may involve an SSL connection.  Finally, the (7) application layer consists of the HTTP connection to the website.\nThe OSI model provides a helpful overview of the way computer systems communicate with each other.  Software developers often use this model when writing software that requires networking or Internet support.  Instead of recreating the communications stack from scratch, software developers only need to include functions for the specific OSI layer(s) their programs use."
        ]
    },
    {
        "word": "OSPF",
        "type": [],
        "definition": [
            "Stands for \"Open Shortest Path First.\"  OSPF is a method of finding the shortest path from one router to another in a local area network (LAN).  As long as a network is IP-based, the OSPF algorithm will calculate the most efficient way for data to be transmitted.\nIf there are several routers on a network, OSPF builds a table (or topography) of the router connections.  When data is sent from one location to another, the OSPF algorithm compares the available options and chooses the most efficient way for the data to be sent.  This limits unnecessary delays in data transmission and prevents infinite loops."
        ]
    },
    {
        "word": "OTA",
        "type": [],
        "definition": [
            "Stands for \"Over-The-Air.\"  OTA refers to any type of wireless transmission, but it is most commonly used to describe either 1) software updates distributed to mobile devices or 2) TV and radio broadcasts transmitted over the air.\n1) Mobile Device Programming\nOTA signals that are used to program, update, configure, and provision hardware devices are collectively known as OTAP (Over-The-Air Programming).  One example is over-the-air activation (OTAA), which allows you to wirelessly activate a new cell phone by simply typing a code or following specific steps.  This automated service provided by most mobile providers can save you a trip to a mobile phone service location when you buy a new phone.  OTA transmissions can also send updates such as new carrier settings and even OS updates to supported smartphone.\nAnother example is over-the-air service provisioning (OTASP), which is used to remotely activate and configure multiple devices, such as radio handsets, for a specific group of users.  OTASP transmissions are typically sent out from a central server and may be encrypted to protect personal information.  Both OTAA and OTASP are subsets of OTAP.\n2) TV and Radio Signals\nOTA can also refer to television and radio transmissions that are sent and received over the air.  Most often, OTA is used to contrast television channels that are broadcast over the air with those offered by cable service providers.  OTA channels are local channels that can be received using a traditional \"bunny ears\" antenna.  These types of channels are free and do not require a monthly subscription.  Most cable providers include digital versions of OTA channels that are specific to each customer's region.\nNOTE: Even though satellite TV broadcasts are transmitted wirelessly, the channels offered by satellite providers are generally not considered \"OTA.\"  Instead, they are simply called \"cable channels,\" since they are the same channels offered by cable companies."
        ]
    },
    {
        "word": "OTT",
        "type": [],
        "definition": [
            "Stands for \"Over-the-top.\"  OTT refers to data sent over the Internet that bypasses traditional mediums.  Two common examples include OTT content and OTT messaging.\nOver-the-top Content\nOver-the-top content refers to movies and television shows that are delivered directly to users.  Instead of requiring a cable or satellite television subscription, OTT content can be downloaded and viewed on demand.  Popular OTT mediums include Netflix, Hulu, Amazon Prime and HBO Now.  Free services like YouTube and Vimeo are also considered OTT, though they compete less directly with television providers.\nOTT services do not offer a list of channels.  Instead, shows and movies must be selected individually and watched on demand.  While traditional providers like Comcast and DIRECTV offer on demand content as well as live shows, their monthly fees are typically several times those of OTT providers.  Because OTT service is relatively cheap ($8 - $15 per month), many users purchase multiple OTT subscriptions as an alternative to cable or satellite TV.\nOver-the-top Messaging\nFor many years, text messaging (or SMS messaging) was the standard way to message someone using a mobile phone.  In 2009, WhatsApp introduced a free way to message other users without using SMS.  Apple introduced iMessage in 2011, which uses Apple's own free messaging service rather than SMS or MMS.  As these alternative messaging options grew in popularity, many cellular service providers increased their monthly messaging limits for users and many plans now offer unlimited messaging.\nNOTE: Both OTT content and messaging still require internet access, such cable, DSL, or a cellular data connection.  Therefore, many Netflix subscribers still use Comcast for their Internet connection."
        ]
    },
    {
        "word": "Object",
        "type": [],
        "definition": [
            "An object, in object-oriented programming (OOP), is an abstract data type created by a developer.  It can include multiple properties and methods and may even contain other objects.  In most programming languages, objects are defined as classes.\nObjects provide a structured approach to programming.  By defining a dataset as a custom object, a developer can easily create multiple similar objects and modify existing objects within a program.  Additionally, objects provide \"encapsulation,\" meaning the data within an object is protected from being modified or destroyed by other functions or methods unless explicitly allowed.\nA simple example of an object may be a user account created for a website.  The object might defined as class userAccount and contain attributes such as:\n\nfirst name\nlast name\nemail address\npassword\nage\nlocation\nphoto\n\nInstead of recreating these properties each time a new user account is created, a web script can simply instantiate a userAccount object.  Data assigned to the object may be stored in a database if the user account is saved.\nA more advanced example of an object is a character in a video game.  The character might have standard attributes, such as a name, hitpoints, and movement speed.  It may also contain other objects, such as weapons, armor, items, etc.  In this case, the character is the \"parent object\" and the objects it contains are \"child objects.\"  Both the parent and child objects can have their own properties and methods.  For example, the character may have methods such as \"move\" and \"attack.\"  The \"attack\" command might reference the \"weapon\" object, which has its own methods, such as \"swing\" or \"thrust.\"\nNOTE: While objects are usually associated with object-oriented programming, in general computer science terminology, an object may refer to a single programming element, such as a variable, constant, function, or method."
        ]
    },
    {
        "word": "Octal",
        "type": [],
        "definition": [
            "Octal, also known as \"base-8,\" is a number system that uses eight digits (0 - 7) to represent any integer.  Octal values are sometimes used to represent data in computer science since bytes contain eight bits.  For example, the octal value \"10\" can represent 8 bits or 1 byte.  \"20\" represents 2 bytes, 30 represents 3, etc.  Octal values are also easily translatable from binary, which uses two digits, and hexadecimal, which uses 16 digits.\nTo convert an octal value to a standard decimal or \"denary\" value, multiply each digit by 8n, where n is the place of the digit, starting with 0, from right to left.  Then add the results together.  So 123 in octal can be converted to a decimal value as follows:\n80 x 3 + 81 x 2 + 82 x 1 = 3 + 16 + 64 = 83\nThe table below shows several equal values in octal, decimal, hexadecimal, and binary:\n\nOctalDecimalHexadecimalBinary\n1111\n10881000\n504028101000\n10064401000000\n123466829C1010011100\n\nBinary to Octal Conversion\nTo convert a binary value to an octal value, separate the digits into groups of three, starting from right to left.  Then mulitply each 1 or 0 by 2n, where n is the place of each digit, from right to left, starting with 0.  For example, to convert the binary value 1010011100 from the table above, first separate the digits as: 1 010 011 100.  Then multiply the values as follows:\n\n0x1 + 0x2 + 1x4 = 4\n1x1 + 1x2 + 0x4 = 3\n0x0 + 1x2 + 0x4 = 2\n1x1 + 0x2 + 0x4 = 1\n\nThe resulting value is: oct 1234.  Octal values may also be displayed with a subscript \"8,\" such as 12348.  The bottom row of the table above can be written in subscript notation as:\n10100111002 = 12348 = 66810 = 29C16\n"
        ]
    },
    {
        "word": "Office",
        "type": [],
        "definition": [
            "Microsoft Office is a productivity suite developed for Windows and Macintosh systems.  It is available it several editions, each of which includes multiple applications.  All Office editions include the three standard programs, Word, Excel, and PowerPoint.\nThe first version of Microsoft Office was actually released for the Macintosh in 1989.  The Windows version followed one year later in 1990.  Over the past two decades, Microsoft has released new versions of Office roughly every two to three years.  Starting with Office 95, Microsoft began offering multiple editions of Office, such as Standard, Professional, and Small Business editions.  Newer versions of Office are available in \"Home and Student\" and Professional editions.\nSince the first version of Office was released, Microsoft has continued to developed Office for both the Windows and Macintosh platforms.  However, beginning with Office 98 for Mac, Microsoft has developed distinctly different versions of Office for Mac and Windows.  Therefore, while the programs perform the same functions, the user interface of Office programs on Mac and Windows systems may look different.  Fortunately, most file formats saved by Office programs are crossplatform, meaning they can be opened on Macintosh or Windows computers.\nNOTE: Some programs that are included with professional editions of Office are not available for the Mac.  These include Access, Publisher, InfoPath, Project, and Visio."
        ]
    },
    {
        "word": "Offline",
        "type": [],
        "definition": [
            "When a computer or other device is not turned on or connected to other devices, it is said to be \"offline.\"  This is the opposite of being \"online,\" when a device can readily communicate with other devices.  For example, if you try to print to your printer and you get one of those frustrating errors saying, \"The specified printer could not be found,\" the printer is probably offline.  You should check to see if the printer is connected properly and, yes, turned on as well.\nOffline can also mean not being connected to the Internet.  When you disconnect from your ISP or pull out the Ethernet cable from your computer, your computer is offline.  Some programs, such as Web browsers and e-mail programs, have an option to \"Work Offline.\"  This option disables the program's network connection, meaning no data can be transmitted to or from the computer.  This option was more useful when most people used dial-up connections.  They didn't want their computer automatically dialing their ISP whenever a program tried to access the Internet.  However, since most people now have \"always on\" connections such as DSL and cable modems, there usually is no reason to work offline."
        ]
    },
    {
        "word": "Online",
        "type": [],
        "definition": [
            "In general, when a machine is \"online,\" it is turned on and connected to other devices.  For example, when a network printer is online, computers connected to that network can print from it.  Other devices, such as scanners, video cameras, audio interfaces, and others are said to be online when they are running and connected to a computer system.\nRecently, however, the term \"online\" usually means being connected to the Internet.  The connection can be through a phone line, using a dial-up or DSL modem, a cable line via a cable modem, or through a wireless connection.  A computer can also be online via a connection to a computer network.  Technically, computers that are on a network are online even if they are not connected to the Internet.  But most networks are routed to a T1 line or other Internet connection anyway.  When a computer or other device is not online, it is said to be offline."
        ]
    },
    {
        "word": "Opacity",
        "type": [],
        "definition": [
            "Opacity (pronounced \"o-pass-ity,\" not o-pace-ity\") describes how opaque an object is.  While it is not specific to computer terminology, the term is often used in computer graphics software.  For example, many programs include an \"Opacity\" setting that allows you to adjust the transparency of an image.\nTo understand opacity, it is important understand what \"opaque\" means.  An opaque object is completely impervious to light, which means you cannot see through it.  For example, a car door is completely opaque.  The window above the door, however, is not opaque, since you can see through it.  If the window is tinted, it is partially opaque and partially transparent.  The less transparent the window is, the higher its opacity.  In other words, transparency and opacity are inversely related.\nMost digital images are 100% opaque.  For example, if you open an image captured with a digital cameras, it will be completely opaque.  However, you can use an image editing application to adjust the opacity of the image.  This is especially useful when editing an image with multiple layers.  For instance, Adobe Photoshop allows you to adjust the opacity for each layer from 0 to 100.  0 is completely transparent (or invisible), while 100 is completely opaque.  By sliding the opacity of each layer somewhere in between 0 and 100, you can overlay multiple layers on top of each other, creating a multilayer image mosaic.\nNOTE: When saving a semi-transparent image, it is important to save the file in a format that supports multiple levels of opacity.  JPEG does not support transparency at all and GIF only supports fully transparent or fully opaque pixels.  The PNG format is the best choice since it includes an alpha channel, which stores an opacity setting for each pixel."
        ]
    },
    {
        "word": "Open Firmware",
        "type": [],
        "definition": [
            "Open Firmware is a type of firmware that some computer systems use when they boot up.  It controls the processor and performs system diagnostics before the operating system is loaded.  Open Firmware also builds the \"device tree,\" which locates internal and external devices connected to the computer.  Each device is then assigned a unique address so it can be used once the computer starts up.\nSeveral types of computers use Open Firmware, including PowerPC-based Macintosh systems, Sun Microsystems SPARC-based workstations, and IBM POWER systems.  (Most Windows-based PCs use the BIOS for the same purpose.)  Because Open Firmware is an \"open\" standard, devices that support Open Firmware can be typically be used in multiple Open Firmware-based systems.  For example, identical PCI cards could be used in both Sun and Macintosh-based computer systems.\nTo access the Open Firmware interface on a PowerPC-based Macintosh, press and hold \"Command-Option-O-F\" during startup.  On Sun systems, the Open Firmware interface is displayed at startup and can be accessed afterwards by pressing \"L1-A\" (or Stop-A) while the computer is running."
        ]
    },
    {
        "word": "Open Format",
        "type": [],
        "definition": [
            "An open format is a file format with an openly-published specification that anyone can use.  It is the opposite of a proprietary file format, which is only used by a specific software company or application.\nOpen formats make it possible for multiple programs to open the same file.  For example, if you create a plain text (.TXT) file in a text editor like Notepad and open it with another application like Microsoft Word.  Since plain text files store data in an open format, they can be opened by any text editor or word processor.\nConversely, a file saved in a proprietary format may only be opened by the corresponding application.  For example, only Apple Pages can open a .PAGES document.  Only Adobe Premiere can open a .PRPROJ file.\nIn recent years, many software companies have moved from proprietary formats to open ones.  Microsoft switched from proprietary Office file formats (.DOC, .XLS, .PPT) to open formats (.DOCX, .XLSX, .PPTX) in 2007.  The new \"Open XML\" Office formats use standard Zip compression and contain data stored in plain XML.  Any application that supports the publicly-available Open XML specification can open them.  In 2008, Adobe made PDF an open standard.  The International Organization for Standardization (ISO) now maintains the .PDF format specification.\nPartially Open Formats\nSome file formats are \"partially open,\" meaning the specification is made partially available for public use.  Other applications can open these files, but they may have limited editing and saving capabilities.  Examples of partially open formats include Photoshop documents (.PSD), CorelDRAW drawings (.CDR), and AutoCAD drawings (.DWG)."
        ]
    },
    {
        "word": "Open Source",
        "type": [],
        "definition": [
            "When a software program is open source, it means the program's source code is freely available to the public.  Unlike commercial software, open source programs can be modified and distributed by anyone and are often developed as a community rather than by a single organization.  For this reason, the phrase \"open source community\" is commonly used to describe the developer of open source software development projects.\nSince the source code of an open source program can be modified by anyone, it makes sense that the software is also free to download and use.  The terms of use are often defined by the GNU General Public License, which serves as the software license agreement (SLA) for many open source programs.  Open source software development projects are often funded by donors with an interest in the project, by user donations, or through advertisements.  Some developers also generate revenue by selling documentation and help manuals for the software.  Other projects are funded by no more than a collective desire of developers to create a great program.\nSince open source software is free to use, there is typically no technical support included with the software.  Instead, users may need to rely on Web forums and user discussions to report bugs or get answers to their questions.  Fortunately, the most popular open source programs have an abundance of helpful resources available on the Web.  Some of the most well-known open source projects include the Linux operating system, the Mozilla Firefox Web browser, and the OpenOffice.org productivity suite.  Each of these projects have been developed by a community of developers and have gained levels of popularity that rival their commercial counterparts.\nOpen source software can be a cost-effective way to run many types of programs on your computer.  Just remember that since the programs are not backed by a commercial company, if you have problems using the software, you will most likely not be able to obtain technical support from the developer.  Of course, if you like to figure things out on your own or participate in online discussions, open source software may be just right for you."
        ]
    },
    {
        "word": "OpenCL",
        "type": [],
        "definition": [
            "Stands for \"Open Computing Language.\"  OpenCL is an open standard for cross-platform, parallel programming.  It was originally developed by Apple in 2008 and is now maintained by the Khronos Group.  The first major operating system to support OpenCL was Snow Leopard (Mac OS X 10.6), which was released in 2009.\nOpenCL provides an API that allows software programs to access multiple processors simultaneously to perform parallel processing.  Examples include CPUs, GPUs, digital signal processors (DSPs), and field-programmable gate arrays (FPGAs).  By distributing the computing load across multiple processors, OpenCL increases processing efficiency and can substantially improve a program's performance.\nWhile OpenCL supports many different types of processors, it is most notably used to access the GPU for general computing tasks.  This technique, also called GPGPU, takes advantage of the GPU's processing power and allows it to assist the CPU in completing calculations.  Before OpenCL, the graphics processor would often remain idle while the CPU was running at full capacity.  OpenCL enables the GPU to assist the CPU in processing non-graphics-related computations.\nIn order to take advantage of OpenCL, both the hardware and software must support the OpenCL API.  Because of the performance advantage OpenCL provides, most video cards developed by NVIDIA and AMD now support OpenCL.  Many mobile graphics processors, such as those used in smartphones and tablets, support OpenCL as well."
        ]
    },
    {
        "word": "OpenGL",
        "type": [],
        "definition": [
            "OpenGL, short for \"Open Graphics Library,\" is an application programming interface (API) designed for rendering 2D and 3D graphics.  It provides a common set of commands that can be used to manage graphics in different applications and on multiple platforms.\nBy using OpenGL, a developer can use the same code to render graphics on a Mac, PC, or mobile device.  Nearly all modern operating systems and hardware devices support OpenGL, making it an easy choice for graphics development.  Additionally, many video cards and integrated GPUs are optimized for OpenGL, allowing them to process OpenGL commands more efficiently than other graphics libraries.\nExamples of OpenGL commands include drawing polygons, assigning colors to shapes, applying textures to polygons (texture mapping), zooming in and out, transforming polygons, and rotating objects.  OpenGL is also used for managing lighting effects, such as light sources, shading, and shadows.  It can also create effects like haze or fog, which can be applied to a single object or an entire scene.\nOpenGL is commonly associated with video games because of its widespread use in 3D gaming.  It provides developers with an easy way to create crossplatform games or port a game from one platform to another.  OpenGL is also used as the graphics library for many CAD applications, such as AutoCAD and Blender.  Even Apple uses OpenGL as the foundation of the macOS Core Animation, Core Image, and Quartz Extreme graphics libraries.\nNOTE: OpenGL was originally developed and released by Silicon Graphics (SGI) in 1992.  The initial version was approved by an architectural review board, which included Microsoft, IBM, DEC and Intel.  In 2006, SGI passed development and maintenance of OpenGL to The Khronos Group."
        ]
    },
    {
        "word": "Operand",
        "type": [],
        "definition": [
            "In mathematics, an operand is an object to which an operator (+, -, ×, ÷) is applied.  For example, in the equation 7 + 5 = 12, the numbers 7 and 5 are operands.  The plus symbol (+) is the operator and the value after the equal sign (12) is the result.\nIn computer science, an operand is a value within a function.  It may be a specific number or a variable.  Operands can be defined within a function or passed into a function via one or more parameters.  The function below includes three operands, including two variables and one constant.\n[cb]\nsumPlusTen(x, y)\n{\n\tconst Z = 10;\n\t$sum = $x + $y + Z;\n\treturn $sum;\n}\n[\/cb]\nIn the example above, $x, $y, and Z are operands in the equation used to calculate $sum.  The variables $x and $y are passed to the function sumPlusTen() as parameters, while the constant Z is defined within the function as 10.  If sumPlusTen(5,6) is called with a program, it would calculate $sum using the operands 5, 6, and 10 and return a value of 21."
        ]
    },
    {
        "word": "Operating System",
        "type": [],
        "definition": [
            "An operating system, or \"OS,\" is software that communicates with the hardware and allows other programs to run.  It is comprised of system software, or the fundamental files your computer needs to boot up and function.  Every desktop computer, tablet, and smartphone includes an operating system that provides basic functionality for the device.\nCommon desktop operating systems include Windows, OS X, and Linux.  While each OS is different, most provide a graphical user interface, or GUI, that includes a desktop and the ability to manage files and folders.  They also allow you to install and run programs written for the operating system.  Windows and Linux can be installed on standard PC hardware, while OS X is designed to run on Apple systems.  Therefore, the hardware you choose affects what operating system(s) you can run.\nMobile devices, such as tablets and smartphones also include operating systems that provide a GUI and can run applications.  Common mobile OSes include Android, iOS, and Windows Phone.  These OSes are developed specifically for portable devices and therefore are designed around touchscreen input.  While early mobile operating systems lacked many features found in desktop OSes, they now include advanced capabilities, such as the ability to run third-party apps and run multiple apps at once.\nSince the operating system serves as a computer's fundamental user interface, it significantly affects how you interact with the device.  Therefore, many users prefer to use a specific operating system.  For example, one user may prefer to use a computer with OS X instead of a Windows-based PC.  Another user may prefer an Android-based smartphone instead of an iPhone, which runs the iOS.\nWhen software developers create applications, they must write and compile them for a specific operating system.  This is because each OS communicates with the hardware differently and has a specific application program interface, or API, that the programmer must use.  While many popular programs are crossplatform, meaning they have been developed for multiple OSes, some are only available for a single operating system.  Therefore, when choosing a computer, make sure the operating system supports the programs you want to run."
        ]
    },
    {
        "word": "Operator",
        "type": [],
        "definition": [
            "An operator is a symbol within a mathematical expression that defines a specific operation.  For example, the plus symbol (+) is an operator that represents addition.\nCommon operators include:\n\n+ (add)\n- (subtract)\n* or x (mulitply)\n\/ or ÷ (divide)\n% or mod (modulus)\n\nConsider the calculation:\n2 + 3 x 4 = 14\nIn the expression above, + and x are operators, while the numbers 2, 3, and 4 are operands.  14 is the result (since the x operand takes precedence over the + operand).\nWhile operands are typically associated with mathematics, they also apply to computer science.  For example, the function below contains two operators and three operands.\n[cb]\nhalfPlusSeven(x)\n{\n\t$total = $x \/ 2 + 7;\n\treturn $total;\n}\n[\/cb]\nThe \/ and + symbols are operators, while the variable $x and the numbers 2 and 7 are operands.  If x = 30, the expression will evaluate as (30 \/ 2) + 7, which will return a result of 22."
        ]
    },
    {
        "word": "Optical Carrier",
        "type": [],
        "definition": [
            "High-speed fiber optic connections are measured in Optical Carrier or \"OC\" transmission rates.  These rates include several standardized bandwidth amounts supported by Synchronous Optical Networking (SONET) connections.  They are generically referred to as OCx, where the \"x\" represents a multiplier of the basic OC-1 transmission rate, which is 51.84 Mbps.\nThe following is a list of standardized Optical Carrier (OC) data transmission rates.  The \"STM\" numbers in parentheses are the OC equivalents defined in the Synchronous Digital Hierarchy (SDH).  The STM numbers are commonly used to define the bandwidth supported by high-speed networking hardware.\n\nOC-1 (STM-0) - 51.84 Mbps\nOC-3 (STM-1) - 155.52 Mbps\nOC-9 (STM-3) - 466.56 Mbps\nOC-12 (STM-4) - 622.08 Mbps\nOC-18 (STM-6) - 933.12 Mbps\nOC-24 (STM-8) - 1244.16 Mbps\nOC-36 (STM-12) - 1866.24 Mbps\nOC-48 (STM-16) - 2488.32 Mbps\nOC-192 (STM-64) - 9953.28 Mbps\nOC-768 (STM-256) - 40 Gbps\nOC-3072 (STM-1024) - 160 Gbps\n\nAs you can see from the list above, the number following \"OC-\" servers as a multiplier of the basic OC-1 rate of 51.84 Mbps.  For example, OC-3 is 51.84 Mbps x 3, or 155.52 Mbps.  OC-12 is 4 times that of the OC-3 rate (155.52 Mbps x 4), which is 622.08 Mbps.\nOC rates are used to measure speeds of high-speed optical networks, from local business-to-business connections, to the highest bandwidth connections used for the Internet backbone.  Small and medium sized businesses that require high-speed Internet connectivity may use OC-3 or OC-12 connections.  ISPs that require much larger amounts of bandwidth may use one or more OC-48 connections.  Generally, OC-192 and greater connections are used for the Internet backbone, which connects the largest networks in the world together."
        ]
    },
    {
        "word": "Optical Drive",
        "type": [],
        "definition": [
            "In the real world, \"optical\" refers to vision, or the ability to see.  In the computer world, however, \"optical\" refers to lasers, which can \"see\" and read data on optical discs.  These discs include CDs and DVDs, which are made up of millions of small bumps and dips.  Optical drives have lasers that read these bumps and dips as ones and zeros, which the computer can understand.\nSome common types of optical drives include CD-ROM, CD-RW, DVD-ROM, DVD-RW, and Blu-ray drives.  CD and DVD writers, such as CD-R and DVD-R drives use a laser to both read and write data on the discs.  The laser used for writing the data is much more powerful than the laser that reads the data, as it \"burns\" the bumps and dips into the disc.  While optical drives can spin discs at very high speeds, they are still significantly slower than hard drives, which store data magnetically.  However, because optical media is inexpensive and removable, it is the most common format used for distributing computer software."
        ]
    },
    {
        "word": "Optical Media",
        "type": [],
        "definition": [
            "Media, in the computer world, refers to various types of data storage.  For example, hard drives, CDs, DVDs, and USB drives are all different types of media.  Optical media refers to discs that are read by a laser.  This includes CD-ROMs, DVD-ROMs, and all the variations of the two formats -- CD-R, CD-RW, DVD-R, DVD+R, Blu-ray, and many others.\nOptical media typically does not have as fast of a seek time as hard drives (the time it takes to access information on different parts of the disk), but it has many other advantages.  Because optical discs are not based on magnetic charges like hard drives are, the discs are less likely to lose their data and have a longer shelf life -- around seven times longer than magnetic media.  The discs are also more durable than hard drives and are much cheaper to produce, making them great for backups and for transferring small amounts of data between different computers."
        ]
    },
    {
        "word": "Origin Server",
        "type": [],
        "definition": [
            "An origin server is the original source of content distributed by a content delivery network (CDN).  Examples include webpages, images, CSS files, and streaming media.  A CDN retrieves data from the origin server and replicates it on edge servers around the world.\nAn origin server may be a dedicated or virtual web servers located at a web host.  It is the physical server webmasters access when adding or updating website content and acts as the \"source of truth\" for the connected CDN.  When a user accesses a resource not already cached on a specific edge node, the CDN will retrieve the page from the origin, then cache it on the corresponding edge server.\nIf a website does not use a CDN, there is no need for an origin server since a single web server handles all incoming requests.\nBelow are common origin server operations:\n\nPush - the origin server \"pushes\" content to CDN, replicating the content across multiple edge nodes\nPull - the CDN \"pulls\" content from the origin server when it updates a resource or caches it for the first time\nPurge - the CDN removes an object from all edge servers, which is useful when updating a file on the origin server\n\nNOTE: Most CDNs can be configured with custom caching directives, such as max-age or expires, which indicate how frequently the CDN should check the origin server for an updated file."
        ]
    },
    {
        "word": "Outbox",
        "type": [],
        "definition": [
            "An outbox is where outgoing e-mail messages are temporarily stored.  While you are composing a message, most mail programs automatically save a draft of your message in the outbox.  The message is then stored in the outbox until it is successfully sent to the recipient.  Once the message has been sent, most e-mail programs move the message to the \"Sent\" or \"Sent Messages\" folder.  While the terms \"Outbox\" and \"Sent Messages\" are often used synonymously, technically they have different meanings.\nUnlike the inbox, which is often overflowing with e-mail, the outbox often does not contain any messages.  This is because all the messages that have been sent have already been transferred to the Sent Messages folder.  You can think of an e-mail outbox much like the outbox at an office.  Mail that is to be delivered is temporarily placed in the outbox until the mailman (or the designated office mail guy) picks up the mail and brings it to the post office.  However, the messages in an e-mail outbox are typically delivered immediately (unless a connection to the outgoing SMTP mail server is not available).  If only it was as easy to keep your inbox clean..."
        ]
    },
    {
        "word": "Output",
        "type": [],
        "definition": [
            "Data generated by a computer is referred to as output.  This includes data produced at a software level, such as the result of a calculation, or at a physical level, such as a printed document.  A basic example of software output is a calculator program that produces the result of a mathematical operation.  A more complex example is the results produced by a search engine, which compares keywords to millions of pages in its Web page index.\nDevices that produce physical output from the computer are creatively called output devices.  The most commonly used output device is the computer's monitor, which displays data on a screen.  Devices such as the printer and computer speakers are some other common output devices.\nThe opposite of output is input, which is data that is entered into the computer.  Input and output devices are collectively referred to as I\/O devices."
        ]
    },
    {
        "word": "Output Device",
        "type": [],
        "definition": [
            "Any device that outputs information from a computer is called, not surprisingly, an output device.  Since most information from a computer is output in either a visual or auditory format, the most common output devices are the monitor and speakers.  These two devices provide instant feedback to the user's input, such as displaying characters as they are typed or playing a song selected from a playlist.\nWhile monitors and speakers are the most common output devices, there are many others.  Some examples include headphones, printers, projectors, lighting control systems, audio recording devices, and robotic machines.  A computer without an output device connected to it is pretty useless, since the output is what we interact with.  Anyone who has ever had a monitor or printer stop working knows just how true this is.  Of course, it is also important to be able to send information to the computer, which requires an input device."
        ]
    },
    {
        "word": "Overclocking",
        "type": [],
        "definition": [
            "For some people, fast is never fast enough.  In the world of computers, a fast processor can be made even faster by overclocking it.  Overclocking involves increasing the clock speed of the computer's CPU past the rate at which it was originally designed to run.\nSome ways to overclock a processor include increasing the CPU's operating speed in the system BIOS or changing the hardware jumper settings for the processor.  Modifying these settings may allow the processor to run faster than set by the manufacturer, which may increase the overall performance of the computer.  However, since other settings, such as the memory speed, frontside and backside bus speeds, and other components are fixed, there may not be a significant increase in performance.\nRegardless of how overclocking is done, it potentially may cause problems with the computer.  After all, when you overclock a computer, you are altering the manufacturer's design of the machine.  For example, if there is not enough electrical current to to power the processor at the new rate, it may slow down or stop running completely.  Also, if the heat sink cannot sufficiently cool the processor running at the faster rate, it may overheat, causing your computer to freeze or crash.  This is actually a preventive measure, since the computer stops functioning when the CPU gets too hot.  Otherwise, the CPU may literally fry itself and your overclocked processor may become an overcooked processor.\nIn summary, overclocking a processor can be a risky endeavor.  It is best left to computer enthusiasts who understand their hardware and are willing to accept the risks associated with it.  Since overclocking voids your computer's warranty, don't expect the manufacturer to replace your cooked CPU for free.  If you want a fast machine that is supported by the manufacturer, buying a fast processor to begin with is your best bet."
        ]
    },
    {
        "word": "Overwrite",
        "type": [],
        "definition": [
            "In computing, overwriting refers to replacing old data with new data.  There are two primary types of overwriting: 1) replacing text, and 2) replacing files.\n1) Replacing text\nThe default behavior of most word processing programs is to insert characters where the cursor is located.  However, some programs allow you to change the standard behavior from insert to overwrite (or \"overtype\").  If an application supports both modes, the Insert (INS) key can often be used to toggle between insert and overwrite mode.\nWhile in insert mode, text to the right of the cursor is shifted to the right as new text is entered.  For example, say you want to add the word \"and\" between \"five\" and \"six,\" in the string \"four, five, six.\"  You would move the cursor immediately before the word \"six,\" then type \"and\" (followed by a space).  The result would be \"four, five, and six.\" In overwrite mode, the word \"six\" would be overwritten by the word \"and,\" so the resulting string would read, \"four, five, and.\"  Overwrite mode simply replaces existing characters as you type.\n2) Replacing files\nThe term \"overwrite\" also refers to replacing old files with new ones.  If you try to save a document with the same filename as an existing document, you may be asked if you want to overwrite the file.  If you click OK, the old document will be overwritten by the new one.  Similarly, when moving files to a folder, the operating system may ask you if you would like to overwrite existing files with the same filenames.  If you choose select Overwrite, the old files will be replaced by the new ones."
        ]
    }
]