[
    {
        "word": "P2P",
        "type": [],
        "definition": [
            "Stands for \"Peer to Peer.\"  In a P2P network, the \"peers\" are computer systems which are connected to each other via the Internet.  Files can be shared directly between systems on the network without the need of a central server.  In other words, each computer on a P2P network becomes a file server as well as a client.\nThe only requirements for a computer to join a peer-to-peer network are an Internet connection and P2P software.  Common P2P software programs include Kazaa, Limewire, BearShare, Morpheus, and Acquisition.  These programs connect to a P2P network, such as \"Gnutella,\" which allows the computer to access thousands of other systems on the network.\nOnce connected to the network, P2P software allows you to search for files on other people's computers.  Meanwhile, other users on the network can search for files on your computer, but typically only within a single folder that you have designated to share.  While P2P networking makes file sharing easy and convenient, is also has led to a lot of software piracy and illegal music downloads.  Therefore, it is best to be on the safe side and only download software and music from legitimate websites."
        ]
    },
    {
        "word": "PAN",
        "type": [],
        "definition": [
            "Stands for \"Personal Area Network.\"  A PAN is network of connected devices used by one person.  It allows devices such as computers, tablets, smartphones, and smartwatches to communicate with each other.\nA PAN may incorporate a number of different connections, including Ethernet, Wi-Fi, and Bluetooth.  For example, a desktop computer may connect to a personal router via Ethernet and a tablet may connect via Wi-Fi.  A smartphone may communicate with a computer via Wi-Fi and a smartwatch via Bluetooth.\n\"Smartphone tethering\" is a common type of PAN, in which a laptop or other device connects to the Internet through a smartphone's cellular data connection.  If your mobile plan allows it, you can set up your smartphone as a \"mobile hotspot\" or \"personal hotspot,\" which makes it function like a wireless router that is connected to the Internet.  You can then connect to the smartphone from your computer or tablet like you would connect to a Wi-Fi router.  Tethering may take place over Bluetooth, Wi-Fi, or USB depending on the device.\nSince PANs are designed to be limited to a single user, they are often secured automatically by only accepting connections from authorized devices.  However, it is wise to double-check your connection settings to make sure that a password is required or that only authorized devices can connect, rather than \"everyone.\""
        ]
    },
    {
        "word": "PBX",
        "type": [],
        "definition": [
            "Stands for \"Private Branch Exchange.\"  A PBX is a local telephone system designed for a business or organization.  It allows a large number of users to share only a few external phone numbers.\nA private branch exchange is an internal telephony solution that also enables users to communicate externally through outside \"POTS\" phone lines.  Instead of requiring each person to have a phone number, users are assigned extensions that serve as unique identifiers within the PBX.  External callers can dial a single phone number and reach different people by entering their extension.\nBy allowing numerous users to share a single phone number, a PBX significantly reduces the number of outside lines a company requires.  Therefore, it is a cost-effective telecommunications solution for businesses.\nTraditional PBX\nA traditional PBX phone system is comprised of a local control unit and individual telephones.  The control unit (or \"base server\") handles internal calls between users as well as external communications.  It includes a storage device that logs voicemails and call histories.\nEarly PBX systems were completely analog, meaning all communications took place through analog phone lines.  More recent \"traditional\" PBX systems have digital lines and may use Ethernet cables rather than telephone cables for internal communication lines.  A process called SIP trunking converts digital signals to analog if necessary when calling outside lines.\nHosted PBX\nA hosted PBX is a cloud-based solution that does not require a local control unit.  Instead, each user has a VoIP phone that connects directly to a router or switch.  The PBX administrator can add, remove, and manage users with a software interface, typically via a web browser.\nSince a hosted PBX is cloud-based, users do not need to reside in the same physical location.  Therefore, a hosted PBX is ideal for businesses with remote workers."
        ]
    },
    {
        "word": "PC",
        "type": [],
        "definition": [
            "Stands for \"Personal computer.\"  PCs are what most of us use on a daily basis for work or personal use.  A typical PC includes a system unit, monitor, keyboard, and mouse.  Most PCs today also have a network or Internet connection, as well as ports for connecting peripheral devices, such as digital cameras, printers, scanners, speakers, external hard drives, and other components.\nPersonal computers allow us to write papers, create spreadsheets, track our finances, play games, and do many other things.  If a PC is connected to the Internet, it can be used to browse the Web, check e-mail, communicate with friends via instant messaging programs, and download files.  PCs have become such an integral part of our lives that it can be difficult to imagine life without them!\nWhile PC stands for \"personal computer,\" the term can be a bit ambiguous.  This is because Macintosh computers are often contrasted with PCs, even though Macs are also technically PCs.  However, Apple itself has used the term \"PC\" to refer to Windows-based machines, as opposed to its own computers, which are called \"Macs.\"  While the Mac\/PC dilemma remains, PCs can always contrasted with other types of computers, such as mainframes and server computers, such as Web servers and network file servers.  In other words, if you use a computer at home or at work, you can safely call it a PC."
        ]
    },
    {
        "word": "PCB",
        "type": [],
        "definition": [
            "Stands for \"Printed Circuit Board.\"  A PCB is a thin board made of fiberglass, composite epoxy, or other laminate material.  Conductive pathways are etched or \"printed\" onto board, connecting different components on the PCB, such as transistors, resistors, and integrated circuits.\nPCBs are used in both desktop and laptop computers.  They serve as the foundation for many internal computer components, such as video cards, controller cards, network interface cards, and expansion cards.  These components all connect to the motherboard, which is also a printed circuit board.\nWhile PCBs are often associated with computers, they are used in many other electronic devices besides PCs.  Most TVs, radios, digital cameras, cellphones, and tablets include one or more printed circuit boards.  While the PCBs found in mobile devices look similar to those found in desktop computers and large electronics, they are typically thinner and contain finer circuitry.\nNOTE: PCB may also stand for \"Process Control Block,\" a data structure in a system kernel that stores information about a process.  In order for a process to run, the operating system must first register information about the process in the PCB."
        ]
    },
    {
        "word": "PCI",
        "type": [],
        "definition": [
            "Stands for \"Peripheral Component Interconnect.\"  PCI is a hardware bus used for adding internal components to a desktop computer.  For example, a PCI card can be inserted into a PCI slot on a motherboard, providing additional I\/O ports on the back of a computer.\nThe PCI architecture, also known as \"conventional PCI,\" was designed by Intel and introduced in 1992.  Many desktop PCs from the early 1990s to the mid 2000s had room for two to five PCI cards.  Each card required an open slot on the motherboard and a removable panel on the back of the system unit.  Adding PCI cards was an easy way to upgrade a computer, since you could add a better video card, faster wired or wireless networking, or add new ports, like USB 2.0.\nThe original 32-bit, 33 MHz PCI standard supported data transfer rates of 133 megabytes per second.  An upgraded 64-bit, 66 MHz standard was created a few years later and allowed for much faster data transfer rates up to 533 MHz.  In 1998, IBM, HP, and Compaq introduced PCI-X (or \"PCI eXtended\"), which was backwards compatible with PCI.  The 133 MHz PCI-X interface supported data transfer rates up to 1064 MHz.\nBoth PCI and PCI-X were superseded by PCI Express, which was introduced in 2004."
        ]
    },
    {
        "word": "PCI Express",
        "type": [],
        "definition": [
            "First came PCI, then PCI-X, then PCI Express.  PCI Express can be abbreviated as PCIe or, less commonly and more confusingly, PCX.  Unlike earlier PCI standards, PCI Express does not use a parallel bus structure, but instead is a network of serial connections controlled by a hub on the computer's motherboard.  This enables PCI Express cards to run significantly faster than previous PCI cards.\nBecause the PCI Express interface is a serial connection, it does not have a speed measured in Megahertz, like PCI or PCI-X.  Instead, its performance is measured in data throughput speeds, which are several times faster than PCI-X.  Furthermore, PCI Express is available in x1, x4, x8, and x16 implementations, which increases the bandwidth by the corresponding amount.  However, larger implementations require longer PCI Express slots.  For example, a x4 slot is larger than a x1 slot and a x16 slot is larger than a x8 slot.  A PCI Express card can be inserted in any slot that is large enough for it.  For example, a x8 card could be inserted into a x16 slot, but a not a x1 or x4 slot.\nSince PCI Express connections can support such fast data transfer rates, they can be used to connect high-speed devices such as Gigabit Ethernet cards and high-end video cards.  For this reason, PCI Express is expected to replace both PCI and AGP connections.  Fortunately, PCI Express was designed to be backwards compatible with both PCI hardware and software.  However, to use a PCI Express card, your computer must have at least one available PCI Express slot."
        ]
    },
    {
        "word": "PCI-X",
        "type": [],
        "definition": [
            "Stands for \"Peripheral Component Interconnect Extended.\"  Once again, \"Ex\" is abbreviated with an \"X\" instead of an \"E.\"  Most desktop computers include one or more PCI slots for expanding the computer's I\/O capabilities.  Common PCI cards include network cards, sound cards, and video cards.  In the early 1990s, when PCI was first introduced, the 66 MHz speed of PCI was more than sufficient for PCI cards available at the time.  However, a decade later, expansion cards supported much faster data transfer rates and therefore became faster than the PCI bus would support.  To prevent the interface from becoming a bottleneck, PCI-X was introduced.\nThe first version of PCI-X supported data transfer rates of 133 MHz, which is more than twice as fast as the original PCI standard.  Then along came PCI-X 2.0, which can run at speeds of 266 or 533 MHz.  These speeds are fast enough to support Gigabit Ethernet cards and video capture devices without slowing them down.  PCI-X cards can only be installed in PCI-X slots, but the slots themselves are backwards compatible with PCI cards."
        ]
    },
    {
        "word": "PCMCIA",
        "type": [],
        "definition": [
            "Stands for \"Personal Computer Memory Card International Association.\"  PCMCIA was an organization that focused on creating expansion card standards for portable computers.  It began in 1989 and lasted until 2010, when it was acquired by the USB Implementers Forum (USB-IF).\nThe most notable product developed by the Personal Computer Memory Card International Association is the PCMCIA card (commonly called a \"PC card\"), which provided expansion capabilities for laptops.  The card could be inserted into a PCMCIA slot on the side of a laptop, providing additional memory or connectivity.  There were three versions of the PCMCIA card standard:\n\nType I - 3.3 mm thick - used for memory expansion\nType II - 5.0 mm thick - most common; used for NICs (Ethernet cards), modems, and sound cards\nType III - 3.3 mm thick - used for ATA hard drives\n\nLarger PCMCIA slots were backwards compatible with smaller cards.  For example, a Type III slot could support Type 1, 2, and 3 cards and a Type II slot could support Type 1 and 2 cards.\nIn the 1990s, PCMCIA cards were a common means of adding extra functionality to laptops.  But as laptop components became smaller, manufacturers were able to fit all the necessary components into their laptops, making PCMCIA cards unnecessary.  Additionally, many peripherals that previously required a PCMICA card became available in USB versions.  In the early 2000s, the trend towards thinner and lighter laptops eventually made PCMCIA cards obsolete."
        ]
    },
    {
        "word": "PDA",
        "type": [],
        "definition": [
            "Stands for \"Personal Digital Assistant.\"  These are the little electronic devices you see people jotting stuff down on in public.  Usually, when you see someone with a PDA, they will be holding it out far front of them for everyone to see.  Fortunately, as PDAs become more common, more people will have them and we won't have to deal with the people who make sure everyone else sees that they have one.\nThe first PDA, called the Newton, was created by Apple in 1993.  Since then, numerous other companies have jumped on the bandwagon and have added many new designs and options to the PDA market.  The Palm Pilot, Handspring Visor, HP Jordana, Compaq Aero, Sharp Mobilon, and Sony Cli? are all common PDAs.  Ironically, Apple's Newton was discontinued when the company was having financial difficulties in 1998.  Today's PDAs allow you to organize your schedule, take notes, do math calculations, play games, write memos, and even surf the Internet and send e-mail.  They are cool things to have, but if you decide to get one, please do us all a favor and don't show it off in public.\nPDA also stands for \"Public Display of Affection,\" and though this term is all too relevant at college campuses, it has nothing to do with this definition."
        ]
    },
    {
        "word": "PDF",
        "type": [],
        "definition": [
            "Stands for \"Portable Document Format.\"  PDF is a file format designed to present documents consistently across multiple devices and platforms.  It was developed by Adobe 1992 and has since become one of the most widely used formats for saving and exchanging documents.\nA PDF file can store a wide variety of data, including formatted text, vector graphics, and raster images.  It also contains page layout information, which defines the location of each item on the page, as well as the size and shape of the pages in the document.  This information is all saved in a standard format, so the document looks the same, no matter what device or program is used to open it.  For example, if you save a PDF on a Mac, it will appear the same way in Windows, Android, and iOS.\nThe PDF format also supports metadata, such as the document title, author, subject, and keywords.  It can store embedded fonts so you do not need to have the appropriate fonts installed to the view the document correctly.  PDF documents may also be encrypted so only authorized users can open them.\nCreating and Viewing PDFs\nPDFs are rarely created from scratch.  Instead they are usually generated from an existing document.  For example, you might save a Word document as a PDF or scan a hard copy and save it as a PDF.  While the PDF format was originally proprietary, Adobe has opened the format to other developers, so many programs now include a \"Save as PDF\" or \"Export to PDF\" option.  macOS provides the \"Save as PDF\" feature in the standard Print dialog box, so you can save any printable document as a PDF.\nTo view a PDF, you can use Adobe Reader or any program or plug-in that supports the PDF format.  You can edit PDFs using Adobe Acrobat or a third party PDF editor.  For example, many editors include a \"Fill & Sign\" feature, which allows you to fill out fields and sign the document.  Programs that support OCR allow you to digitally scan the document for text and then edit or delete it.  You can also add images and blocks of text to the PDF.  Most PDF editors also allow you to merge multiple PDFs into a single document.\nNOTE: Since the Portable Document Format is designed to be an exchange format, PDF editing options are limited compared to other formats.  Therefore, when designing a document, it is best to create it with an editor such as Microsoft Word, CorelDRAW, or Adobe InDesign, then save the document as a PDF."
        ]
    },
    {
        "word": "PDU",
        "type": [],
        "definition": [
            "Stands for \"Protocol Data Unit.\"  A PDU is a specific block of information transferred over a network.  It is often used in reference to the OSI model, since it describes the different types of data that are transferred from each layer.  The PDU for each layer of the OSI model is listed below.\n\nPhysical layer – raw bits (1s or 0s) transmitted physically via the hardware\nData Link layer – a frame (or series of bits)\nNetwork layer – a packet that contains the source and destination address\nTransport layer – a segment that includes a TCP header and datra\nSession layer – the data passed to the network connection\nPresentation layer – the data formatted for presentation\nApplication layer – the data received or transmitted by a software application\n\nAs you can see, the protocol data unit changes between the seven different layers.  The resulting information that is transferred from the application layer to the physical layer (and vice versa) is not altered, but the data undergoes a transformation in the process.  The PDU defines the state of the data as it moves from one layer to the next.\nNOTE: PDU also stands for \"Power Distribution Unit.\"  A typical power distribution unit looks like a power strip with multiple outlets, but includes electrical components that ensure equal voltage is distributed to each outlet.  They are commonly used in data centers to provide consistent power to connected servers.  These type of PDUs are often rack mountable, meaning they can be placed in a 1U rack space like a server."
        ]
    },
    {
        "word": "PHP",
        "type": [],
        "definition": [
            "Stands for \"PHP: Hypertext Preprocessor,\" a recursive acronym.  PHP is a scripting language web developers use to create dynamic websites.  It is often installed by default on Apache web servers, alongside MySQL as part of a \"LAMP\" configuration.\nWhen a website visitor accesses a PHP page, the web server processes, or \"parses,\" the PHP code, which can output HTML to the webpage.  In the example below, the PHP function gets the local time and date from the server and inserts it into the HTML.  (The PHP code starts and ends with the &lt;?php and ?&gt; tags.  \"F d, Y\" formats the date as December 31, 2021.)\n[cb]The current date is [\/cb]\nPHP scripts can range from simple one-line commands to complex functions.  Some PHP-based websites generate nearly all webpage content dynamically using a series of PHP scripts.  While early versions of PHP were not object-oriented langauge, PHP3 introduced support for classes, including object attributes and methods.  Developers can create custom object libraries and import them into various PHP pages, similar to a compilied language.\nBecause PHP code is processed before the HTML is loaded, users cannot view the PHP code within a webpage.  They can only see the HTML output by the PHP scripts.\nMuch of PHP's syntax is similar to other languages such as C++, Java, and Perl.  However, PHP contains several proprietary functions, including MySQL-specific methods for accessing records from a MySQL database.  Because of its integration with MySQL, its consistent maintenance, and overall ease of use, PHP remains a popular choice for creating dynamic websites.\nFile extension: .PHP"
        ]
    },
    {
        "word": "PIM",
        "type": [],
        "definition": [
            "Stands for \"Personal Information Manager.\"  A PIM is a software application that serves as a planner, notebook, and address book all in one.  It can also include things like a calculator, clock , and photo album.  PIMs are especially popular for PDAs (Personal Digital Assistants), since this is why most people have them.  However, for those of us who don't have all the latest portable gadgets, PIM programs are also developed for desktop computers."
        ]
    },
    {
        "word": "PMU",
        "type": [],
        "definition": [
            "Stands for \"Power Management Unit.\"  The PMU is a microcontroller, or integrated circuit, that controls the power functions of Macintosh computers.  Though it is not a large component, the PMU contains several parts, including memory, software, firmware, and its own CPU.  Some responsibilities of the PMU include:\n\nTelling the computer when to turn on, turn off, go to sleep, and wake up.\nMaintaining the system's PRAM (Parameter Random Access Memory).\nManaging system resets from various types of commands.\nManaging the real-time clock (date and time).\n\nBecause every function the computer performs requires electrical power, the power management unit is an essential part of every Macintosh computer.  Therefore, it is important that the PMU functions correctly.  In the rare case that the PMU stops functioning or behaves erratically, it can be reset, which should fix any problems caused by the PMU.\nThe method for resetting the PMU depends on the type of Macintosh computer.  Some Macs have a small reset button on the logic board that can be pressed when the computer is off.  Other models include a reset button on the outside of the computer.  These buttons typically have an icon of a triangle pointing to the left, indicating it is a reset button.  The PMU on some PowerBook G4 models can be reset by turning off the computer, removing the battery and power supply, and pressing Shift-Control-Option-Power.  Since different machines require different methods for resetting the PMU, it is best to check your manual or Apple's Support website to find out the proper way to reset your Mac's PMU.\nIn newer Macs, such as the MacBook and MacBook Pro, the PMU is referred to as the System Management Controller, or SMC."
        ]
    },
    {
        "word": "PNG",
        "type": [],
        "definition": [
            "PNG, which can be pronounced \"ping\" or \"P-N-G,\" is a compressed raster graphic format.  It is commonly used on the Web and is also a popular choice for application graphics.\nThe PNG format was introduced in 1994, after the GIF and JPEG formats had already been around for several years.  Therefore, PNG includes many of the benefits of both formats.  For example, PNG images use lossless compression like GIF files, so they do not have any blurring or other artifacts that may appear in JPEG images.  The PNG format also supports 24-bit color like the JPEG format, so a PNG image may include over 16 million colors.  This is a significant difference between GIF and PNG, since GIF images can include a maximum of 256 colors.\nUnlike the JPEG and GIF formats, the PNG format supports an alpha channel, or the \"RGBA\" color space.  The alpha channel is added to the three standard color channels (red, green, and blue, or RGB) and provides 256 levels of transparency.  JPEG images do not support transparent pixels and GIF images only support completely transparent (not partially opaque) pixels.  Therefore, the PNG format allows Web developers and icon designers to fade an image to a transparent background rather than a specific color.  A PNG with an alpha channel can be placed on any color background and maintain its original appearance, even around the edges.\nWhile the PNG image format has many benefits, it is not suitable for all purposes.  For example, digital photos are still usually saved as JPEGs, since PNGs take up far more disk space.  GIFs are still used for animations since PNG images cannot be animated.  Additionally, GIFs are still used on many websites since browsers only recently provided full support for the PNG format.  However, now that most browsers and image editing programs support PNGs, it has become a popular file format for web developers and graphic artists.\nFile extension: .PNG"
        ]
    },
    {
        "word": "PON",
        "type": [],
        "definition": [
            "Stands for \"Passive Optical Network.\"  A PON is a telecommunications network that transmits data over fiber optic lines.  It is \"passive\" since it uses unpowered splitters to route data sent from a central location to multiple destinations.\nPONs are used by ISPs and NSPs as a cost-effective way to provide Internet access for customers.  Since a PON is point-to-multipoint (P2MP) system, it provides a more efficient way to transmit data than a point-to-point network.  The main transmission line can split off into 32 separate lines, which requires far less infrastructure than building direct lines to each destination.\nThe central location of a PON is also called the optical line terminal (OLT), while the individual destinations are called optical network units (ONUs).  Lines that terminate outside buildings are called fiber-to-the-neighborhood (FTTH) or fiber-to-the-curb (FTTC).  Lines that extend all the way to buildings are called fiber-to-the-building (FTTB), or fiber-to-the-home (FTTH).\nWhile all PONs use optical cables and unpowered splitters, there are several different versions.  Below is a list of different types of PONs.\n\nAPON - an early implementation (from the mid-1990s) that uses asynchronous transfer mode (ATM) to transfer data\nBPON - the first \"broadband\" PON that supports data transfer rates of 622 Mbps, the same speed as an OC-12 (STM-4) line\nGPON - a \"gigabit-capable PON\" that supports 2.488 Gbps downstream and 1.244 Gbps upstream; also called the ITU G.984 standard\nEPON - the most popular PON implementation; transmits data as Ethernet frames at up to 10 Gbps downstream and upstream; also known as GEPON or the IEEE 802.3 standard\n"
        ]
    },
    {
        "word": "POP3",
        "type": [],
        "definition": [
            "Stands for \"Post Office Protocol.\"  POP3, sometimes referred to as just \"POP,\" is a simple, standardized method of delivering e-mail messages.  A POP3 mail server receives e-mails and filters them into the appropriate user folders.  When a user connects to the mail server to retrieve his mail, the messages are downloaded from mail server to the user's hard disk.\nWhen you configure your e-mail client, such as Outlook (Windows) or Mail (Mac OS X), you will need to enter the type of mail server your e-mail account uses.  This will typically be either a POP3 or IMAP server.  IMAP mail servers are a bit more complex than POP3 servers and allow e-mail messages to be read and stored on the server.  Many \"webmail\" interfaces use IMAP mail servers so that users can manage all their mail online.\nStill, most mail servers use the POP3 mail protocol because it is simple and well-supported.  You may have to check with your ISP or whoever manages your mail account to find out what settings to use for configuring your mail program.  If your e-mail account is on a POP3 mail server, you will need to enter the correct POP3 server address in your e-mail program settings.  Typically, this is something like \"mail.servername.com\" or \"pop.servername.com.\"  Of course, to successfully retrieve your mail, you will have to enter a valid username and password too."
        ]
    },
    {
        "word": "POST",
        "type": [],
        "definition": [
            "Stands for \"Power On Self Test.\"  POST (or P.O.S.T.) is a series of system checks run by computers and other electronic devices when they are turned on.  The results of the test may be displayed on a screen, output through flashing LEDs, or simply recorded internally.  On computer systems, the POST operation runs at the beginning of the boot sequence.  If all the tests pass, the rest of the startup process continues automatically.\nBoth Macs and Windows PCs run a POST each time the computer is booted up or restarted.  The scan checks the hardware and makes sure the processor, RAM, and storage devices are all functioning correctly.  If an error is encountered during the POST, the startup process may pause or halt completely and the error may be displayed on the monitor.  On PCs, POST errors are often displayed on the BIOS information screen.  They may be output as cryptic codes, such as \"08\" for bad memory, or as a system message, such as \"System RAM failed at offset.\"  On Macs, POST errors are often indicated by a simple graphic, such as a broken folder icon that indicates no bootable device was found.\nIn some cases, the computer screen may not even turn on before POST errors take place.  If this happens, error codes may be output through flashing LED lights or audible tones.  For example, an Apple iMac will sound three successive tones, followed by a five second pause, then repeat the tones when bad RAM is encountered during startup.  Most PCs also emit beeps when POST errors are detected, though each manufacturer uses its own codes.\nPOST is rather technical term that only computer technicians use on a regular basis.  However, it is a good acronym to know, since it will help you better understand error messages that may pop up on computers or other electronic devices.  If your computer won't start up because of a POST error, you can use a different device to look up the meaning and cause of the error, possibly from the manufacturer's website.  Then you can take the appropriate action, such as removing a memory module or reseating the video card, then you can try starting up your computer again.\nNOTE: \"POST\" is also a method for passing HTML form variables from one webpage to another without displaying them in the address bar.  The alternative method is \"GET,\" which appends the values to the URL."
        ]
    },
    {
        "word": "POTS",
        "type": [],
        "definition": [
            "Stands for \"Plain Old Telephone Service.\"  POTS is the traditional telephone system that has been around for nearly 150 years.  It operates over copper wires and was designed for analog signal transmission.\nFor most of the past century, POTS has been the primary telecommunications medium.  The infrastructure, such as telephone poles and telephone wires, can be found throughout the United States and around the world.  Over the past few decades, digital alternatives, such as VoIP and cellular service, have largely replaced traditional phone plans.  Many telephone poles now carry digital fiber optic cables alongside the copper wires.  Some include public Wi-Fi repeaters and cellular transmitters.\nSince telephone poles often carry many types of wires, including power lines, they are now generally referred to as \"utility poles.\"\nWhile POTS is gradually becoming obsolete, there are a few advantages to the traditional phone system:\n\nHigh reliability (roughly 99.999%)\nNo external electrical power required (copper wires carry low voltage)\nLarge existing global infrastructure\nAbility to handle analog and digital signals\nClear, uncompressed voice audio\n\nSome disadvantages of POTS vs modern telecommunications systems include:\n\nNo wireless option (besides in-home handsets)\nExpensive, especially for international calls\nLimited bandwidth for transmitting digital signals (and therefore low speeds)\nRequires significant above-ground infrastructure\nAudio frequency range is limited between 300 and 3,300 Hz\n\nPOTS vs Landlines\nThe terms \"POTS\" and \"landline\" are sometimes used interchangeably.  Often, they mean the same thing.  However, POTS refers to a phone system that operates over analog telephone wires.  A landline may either use POTS or a digital voice service like Vonage or Comcast Digital Voice.  Therefore, POTS requires a landline, but a landline may or may not use POTS."
        ]
    },
    {
        "word": "PPC",
        "type": [],
        "definition": [
            "Stands for \"Pay Per Click,\" and is used in online advertising.  PPC advertisements generate revenue for Web publishers each time a visitor clicks on an ad.  Banner ads, Flash ads, and textual ads can all be used to generate pay per click revenue for publishers.  Many search engines also use the pay per click model, showing sponsored results along with other relevant results for searches.  PPC is an attractive model for advertisers because they only have to pay for actual traffic generated by their ads."
        ]
    },
    {
        "word": "PPGA",
        "type": [],
        "definition": [
            "Stands for \"Plastic Pin Grid Array\" (not the Pretty People Golfer's Association).  PPGA is a type of processor design or \"form factor\" used by the Intel Celeron processor.  The design allows the heat generated by the chip to dissipate more quickly.  This enables the processor to use more transistors and run at higher speeds without burning a hole in the side of your computer."
        ]
    },
    {
        "word": "PPI",
        "type": [],
        "definition": [
            "Stands for \"Pixels Per Inch.\"  The resolution of a printed photo is often measured in DPI, or \"dots per inch.\"  The DPI describes how many dots of ink the printer prints per line per inch.  Therefore, the higher the DPI, the greater the detail of the printed image.  However, even if a photo is printed with a high DPI, the detail represented in the photo can only be as high as the PPI.\nPPI measures the number of pixels per line per inch in a digital photo.  This number is directly related to the number of megapixels a digital camera can capture.  For example, the original Canon Digital Rebel is a 6.3 megapixel camera and captures 2048 vertical by 3072 horizontal pixels.  Therefore, when printing a 4x6 image, the PPI would be 3072 px. \/ 6 in. = 512 PPI.  That is high enough to print a very detailed 4x6 photo.  However, if you were to print a large 20x30 poster image from a 6.3 megapixel image, the PPI would be 3072 px. \/ 30 in. = 102.4 PPI.\nMost modern printers print images with a minimum resolution of 300 DPI.  Therefore, if you print a photo with a PPI of less than 300, you may notice the image is not as sharp as you would like.  Of course, the detail in a 20x30 image may not need to be as clear as a 4x6 photo.  But a good rule of thumb is to keep your PPI above 300 so your prints will look nice and clear."
        ]
    },
    {
        "word": "PPL",
        "type": [],
        "definition": [
            "Stands for \"Pay Per Lead.\"  PPL is similar to CPL, but measures the cost per lead from the advertiser's perspective.  For example, if an advertiser pays $500 for 1,000 leads, the advertiser's average PPL is $0.50 ($500 ? 1000).  Leads can be anything from basic page views to product purchases or new service signups.  Leads that generate more revenue generally have a higher PPL.\nAdvertisers often monitor PPL to measure the effectiveness of certain ads.  By comparing the average revenue per lead to the PPL cost, the advertiser can determine if the ads are increasing or decreasing profit.  For example, if a the average return on a lead is $0.80 and the PPL is $0.50, there is an average profit of $0.30 per ad.  However, if the average return is less than $0.50, the ads should be modified or stopped since the leads cost more than the revenue they are generating.\n\"PPL\" is also used in online chat as an abbreviation for \"people.\""
        ]
    },
    {
        "word": "PPM",
        "type": [],
        "definition": [
            "Stands for \"Pages Per Minute.\"  PPM is used to measure the printing speed of both inkjet and laser printers.  Most printers include a PPM rating for both black and color documents.  These speed measurements are typically listed in the printer's technical specifications.\nWhile a higher pages per minute rating does indicate a faster printing speed, this measurement can be misleading.  This is because manufacturers measure the maximum PPM in the fastest printing mode, a.k.a. \"economy mode,\" which is also the lowest quality.  When printing in regular mode, the speed may be twice as slow.  When printing in fine or high-quality mode, the speed will likely be reduced even further.\nFurthermore, a printer's maximum PPM speed is measured using basic text pages, with no graphics, lines, or other objects.  Therefore, if you have a text document that includes a picture, the page could take several times longer to print than a plain text document.  If you are going to be printing a lot of color photos, make sure to check the printer's photo printing speed, which is often significantly slower than the printer's maximum PPM.  Finally, the PPM measurement does not take into account how long it takes the printer to warm up and begin printing.  Therefore, if you are only printing one or two pages, the warm up time may be longer than the actual time it takes to print the document.\nIn summary, PPM gives a general idea of how fast a printer is.  But since there are several other variables involved that determine a printer's speed, PPM does not always accurately reflect a printer's speed.  Therefore, when choosing a printer, it may be helpful to read some reviews about the printer you are interested in.  The reviews may give you a better idea of the printer's real-world speed an quality than the numbers on the box do.\nNOTE: PPM can also be used to measure a scanner's scanning speed.  This measurement is particularly important for scanners that use an automatic document feeder ADF, which allows multiple documents to be scanned consecutively."
        ]
    },
    {
        "word": "PPP",
        "type": [],
        "definition": [
            "Stands for \"Point-to-Point Protocol.\"  PPP is a protocol that enables communication and data transfer between two points or \"nodes.\"  For many years, PPP was the standard way to establish a dial-up connection to an ISPs.   As dial-up modems were superseded by broadband devices, PPP connections became increasing.  However, PPP lives on in \"PPP over Ethernet\" (PPPoE), which is a common way to connect to the Internet using a DSL modem.\nPPP is a data link protocol, which is the second layer of the seven-layer OSI model.  It comes just after the physical layer and encapsulates the five layers underneath it.  This means PPP can be used by multiple applications and may transfer data over multiple protocols, such as TCP and UDP.  It commonly uses the Internet protocol (IP) to transfer data over the Internet.\nPPTP\nBecause PPP encapsulates other protocols, it can be used for data tunneling, or securely transferring data within the PPP protocol.  The Point-to-Point Tunneling Protocol (PPTP was designed for this purpose and is often used to create virtual private networks VPNs.  However, PPP was not originally designed as a secure protocol and has some known security vulnerabilities.  Therefore modern VPNs often use other protocols.\nPPPoE\nPPPoE, or PPP over Ethernet, is a standard way to connect to an ISP using a DSL modem.  It allows you to connect your modem to a computer or router using a high-speed Ethernet port.  The modem then establishes a point-to-point connection with the ISP.  PPP supports authentication, so you may be asked to enter a username and password in the PPPoE settings.  This information provides a simple way for your DSL Internet provider to confirm you are a valid subscriber."
        ]
    },
    {
        "word": "PPPoE",
        "type": [],
        "definition": [
            "Stands for \"Point-to-Point Protocol over Ethernet.\"  PPPoE is a network configuration used for establishing a PPP connection over an Ethernet protocol.  It is commonly used for creating DSL Internet connections.  Since DSL modems typically connect to computers via an Ethernet connection, a standard dial-up PPP connection cannot be used.  Therefore, PPP over Ethernet allows computers to connect to an Internet service provider (ISP) via a DSL modem.\nPPPoE is a network configuration option found in the Network control panel (Windows) or the Network system preference (Mac OS X).  In order to create a PPPoE connection, you will need to enter the service name provided by the ISP as well as a username and password.  This provides a simple way for the ISP to uniquely identify your system and establish your Internet connection.  PPPoE can be contrasted to DHCP, which dynamically assigns unique IP addresses to connected systems and is typically used by cable Internet service providers.\nThe biggest advantage of a PPPoE configuration is that it is easy to set up.  It also supports multiple computers on a local area network (LAN).  The downside of PPPoE is that it requires additional overhead, or extra data, to be sent over the Internet connection.  A standard PPPoE connection adds 8 bytes of data to each packet transmitted.  While this is only a small fraction of packets that have an MTU of 1500 bytes, some connections use packets as small as 60 bytes, which means PPPoE adds over 13% overhead.  For this reason, many DSL providers now offer DHCP configurations as well."
        ]
    },
    {
        "word": "PPS",
        "type": [],
        "definition": [
            "Stands for \"Pay Per Sale.\"  PPS is a type of online advertising where a web publisher is paid a commission for each sale generated by his website.  It is a more specific version of the CPA model and is commonly used in affiliate marketing.\nMost online ads use the PPC model, in which the website owner receives a small amount for each click on an advertisement banner or link.  While these types of ads can generate lots of traffic for websites, they do not guarantee sales or conversions.  By running PPS ads, merchants only pay for clicks that lead to sales.\nSince merchants only pay commissions on sales made from PPS ads, the commissions have to be high enough to make it worthwhile for web publishers to run them instead of PPC ads.  Therefore, commissions over 50% are not uncommon for high-margin items, such as software and online services.  Physical products with lower margins often have commissions under 10%.  However, if they have high average order values (AOVs), sales with low commissions can still produce high payments for publishers.\nNOTE: To maximize revenue, many websites include both PPC and PPS ads."
        ]
    },
    {
        "word": "PPTP",
        "type": [],
        "definition": [
            "Stands for \"Point-to-Point Tunneling Protocol.\"  PPTP is a networking standard for connecting to virtual private networks, or VPNs.  VPNs are secure networks that can be accessed over the Internet, allowing users to access a network from a remote location.  This is useful for people who need to connect to an office network from home or access their home computer from another location.\nThe \"point-to-point\" part of the term refers the connection created by PPTP.  It allows one point (the user's computer) to access another specific point (a remote network) over the Internet.  The \"tunneling\" part of the term refers to the way one protocol is encapsulated within another protocol.  In PPTP, the point-to-point protocol (PPP) is wrapped inside the TCP\/IP protocol, which provides the Internet connection.  Therefore, even though the connection is created over the Internet, the PPTP connection mimics a direct link between the two locations, allowing for a secure connection."
        ]
    },
    {
        "word": "PRAM",
        "type": [],
        "definition": [
            "Stands for \"Parameter Random Access Memory,\" and is pronounced \"P-ram.\"  PRAM is a type of memory found in Macintosh computers that stores system settings.  These settings include display settings (like screen resolution and color depth), the time zone setting, speaker volume, and the startup volume choice.  The system settings that are stored in the computer's PRAM differ from Mac to Mac, but the purpose of the memory remains the same.\nIf your Macintosh is behaving erratically or is not booting up all the way, you may want to try resetting the PRAM.  You can reset or \"zap\" the PRAM on a Mac by pressing and holding the Command, Option, P, and R keys right as you turn the computer on.  Yes, there are four keys you need to hold down at the same time.  Once your hear the startup chime a second time, the PRAM has been reset and you can release the keys.\nNote that if you choose to zap your PRAM, you may need to set your display, time zone, startup volume, and other affected settings using System Preferences.  Some firmware updates may reset your PRAM as part of their installation process, which means you will have to reset the affected settings after the installation."
        ]
    },
    {
        "word": "PROM",
        "type": [],
        "definition": [
            "Stands for \"Programmable Read-Only Memory,\" and is pronounced \"p-rom,\" not \"prom\" like the high school dance.  PROM is a type of ROM that is programmed after the memory is constructed.  PROM chips have several different applications, including cell phones, video game consoles, RFID tags, medical devices, and other electronics.  They provide a simple means of programming electronic devices.\nStandard PROM can only be programmed once.  This is because PROM chips are manufactured with a series of fuses.  The chip is programmed by burning fuses, which is an irreversible process.  The open fuses are read as ones, while the burned fuses are read as zeros.  By burning specific fuses, a binary pattern of ones and zeros is imprinted on the chip.  This pattern represents the program applied to the ROM.\nWhile PROM cannot be erased, two other versions of PROM have been developed that can be erased and reprogrammed.  One type is called EPROM, or Erasable Programmable Read-Only Memory.  This type of memory uses floating-gate transistors and can be erased by strong ultraviolet light.  The other type is EEPROM, or Electrically Erasable Programmable Read-Only Memory.  EEPROM can be erased with an electrical charge and is used in flash memory."
        ]
    },
    {
        "word": "PS\/2",
        "type": [],
        "definition": [
            "PS\/2 is a type of port used by older computers for connecting input devices such as keyboards and mice.  The port was introduced with IBM's Personal System\/2 computer in 1987 (which was abbreviated \"PS\/2\").  In the following years, the PS\/2 port became the standard connection for keyboards and mice in all IBM compatible computers.\nThe PS\/2 port has six pins and is roughly circular in shape.  Since each PS\/2 port is designed to accept a specific input, the keyboard and mouse connections are typically color-coded.  For example, the keyboard port on the back of the computer is often purple, while the mouse port is usually green.  Similarly, the connector on the end of the keyboard cord is purple and the mouse cord connector is green.  This makes it easy for all users to know where to plug the cables into the computer.  The concept is similar to the color-coded composite audio\/video connections on the back of a TV, which use red, white, and yellow connectors.\nWhile the PS\/2 port enjoyed a good run for almost two decades, now most keyboards and mice use USB connectors.  Unlike PS\/2 ports, USB devices can be plugged into any USB port or even a USB hub and the computer will automatically determine what the device is.  USB is also \"hot swappable,\" meaning the connections can be removed while the computer is running.  If you remove a PS\/2 device while the computer is on, it may potentially cause damage to the hardware.  Therefore, if you are using a PS\/2 device, it is best to turn off the computer before connecting or unplugging a keyboard or mouse.\nNOTE: The term \"PS2\" is also a common abbreviation for Sony's PlayStation 2 game console."
        ]
    },
    {
        "word": "PUM",
        "type": [],
        "definition": [
            "Stands for \"Potentially Unwanted Modification.\"  A PUM is an unwanted change made to your computer's settings.  PUMs can be performed by both legitimate applications and malware, though changes made by malware are more likely to cause serious problems.  In some cases, you may not know about a PUM until after it has taken place.\nPUMs often modify settings at the system level.  On Windows systems, this usually involves updating the Windows registry.  In Mac OS X, a PUM may modify the System Preferences or the LaunchServices database.  A common example of a potentially unwanted modification is when the default program is changed for one or more file types.  Many applications set themselves as the default program for supported file types when they are installed.  While most programs ask you if you would like them to be configured as the default application, some do not.  Even programs that do ask for your permission may change more file associations than you expect.\nWhen a default program is changed, it may be a nuisance, but it will not cause serious problems and can easily be fixed.  Other PUMs involve more complex changes and can create security problems with your computer.  Examples include PUMs that modify your Internet security settings or change your user login preferences.  These types of changes may be caused by viruses or spyware and should be fixed as soon as they are found.  Installing an Internet security program on your computer is a good way to both prevent and fix unwanted modifications made to your system.\nNOTE: The term \"PUM\" was derived from \"PUP,\" which is a potentially unwanted program."
        ]
    },
    {
        "word": "PUP",
        "type": [],
        "definition": [
            "Stands for \"Potentially Unwanted Program.\"  The term \"PUP\" was created by McAfee, a security technology company, to describe unwanted software.  A PUP is similar to malware in that it may cause problems once it is installed on your computer.  However, unlike malware, you consent to a PUP being installed, rather than it installing itself without your knowledge.\nMost PUPs are spyware or adware programs that cause undesirable behavior on your computer.  Some may simply display annoying advertisements, while others may run background processes that cause your computer to slow down.  The label \"potentially unwanted program\" is a fitting description of these applications because you may not find out about their obnoxious behavior until after they are installed.\nMcAfee coined the term \"PUP\" to avoid labeling programs as malware, when users consent to downloading and installing them.  However, the term is often seen as a euphemism for malware since most users want to remove PUPs immediately after they have been installed.  Since PUPs are often installed along with legitimate applications, be careful not to agree to install extra programs if you don't know what they are."
        ]
    },
    {
        "word": "PXE",
        "type": [],
        "definition": [
            "Stands for \"Preboot Execution Environment\" and is typically pronounced \"pixie.\"  PXE is a set of standards used to load an operating system over a network.  It allows network administrators to load or reset system software via a network connection rather than physical media, such as a USB drive or DVD.\nMost computers come preloaded with an operating system (OS), which you can upgrade or restore if necessary.  However, if a computer does not already have an OS, it must support installing an operating system from scratch.  Older PCs provided this capability via the BIOS, while modern PCs have a Unified Extensible Firmware Interface (UEFI).  For PXE to function, the client system must support \"PXE Boot\" in the BIOS\/UEFI boot options.\n\nEnabling PXE Boot in the BIOS or UEFI readies a client machine to start up from a network connection.  If PXE is prioritized over the local startup disk, the computer will first check for a signal from a server on the network via DHCP.  Once the PXE connection is established, the server can send data to the client machine via TFTP.  For example, the server may send the client boot files or a bootable disk image, which it can use to start up.\nPXE is especially useful in network environments where multiple systems are regularly refreshed or kept in sync.  With PXE, a single server can simultaneously deploy an operating system to several clients, automating the refresh process."
        ]
    },
    {
        "word": "Packet",
        "type": [],
        "definition": [
            "A packet is a small amount of data sent over a network, such as a LAN or the Internet.  Similar to a real-life package, each packet includes a source and destination as well as the content (or data) being transferred.  When the packets reach their destination, they are reassembled into a single file or other contiguous block of data.\nWhile the exact structure of a packet varies between protocols, a typical packet includes two sections — a header and payload.  Information about the packet is stored in the header.  For example, an IPv6 header includes the following fields:\n\nSource address (128 bits) - IPv6 address of the packet origin\nDestination address (128 bits) - IPv6 address of the packet destination\nVersion (4 bits) - \"6\" for IPv6\nTraffic class (8 bits) - priority setting for the packet\nFlow label (20 bits) - optional ID that labels the packet as part of a specific flow; used to distinguish between multiple transmissions from a single origin\nPayload length (16 bits) - size of the data, defined in octets\nNext header (8 bits) - ID of the header following the current packet; may be TCP, UDP, or another protocol\nHop limit (8 bits) - maximum number of network hops (between routers, switches, etc) before the packet is dropped; also known as \"TTL\" in IPv4\n\nThe payload section of a packet contains the actual data being transferred.  This is often just a small part of a file, webpage, or other transmission, since individual packets are relatively small.  For example, the maximum size of an IP packet payload is 65,535 bytes, or 64 kilobytes.  The maximum size of an Ethernet packet or \"frame\" is only 1,500 bytes or 1.5 kilobytes.\nPackets are intended to transfer data reliably and efficiently.  Instead of transferring a large file as a single block of data, sending smaller packets helps ensure each section is transmitted successfully.  If a packet is not received or is \"dropped,\" only the dropped packet needs to be resent.  Additionally, if a data transfer encounters network congestion due to multiple simultaneous transfers, the remaining packets can be rerouted through a less congested path."
        ]
    },
    {
        "word": "Page Fault",
        "type": [],
        "definition": [
            "A page fault occurs when a program attempts to access a block of memory that is not stored in the physical memory, or RAM.  The fault notifies the operating system that it must locate the data in virtual memory, then transfer it from the storage device, such as an HDD or SSD, to the system RAM.\nThough the term \"page fault\" sounds like an error, page faults are common and are part of the normal way computers handle virtual memory.  In programming terms, a page fault generates an exception, which notifies the operating system that it must retrieve the memory blocks or \"pages\" from virtual memory in order for the program to continue.  Once the data is moved into physical memory, the program continues as normal.  This process takes place in the background and usually goes unnoticed by the user.\nMost page faults are handled without any problems.  However, an invalid page fault may cause a program to hang or crash.  This type of page fault may occur when a program tries to access a memory address that does not exist.  Some programs can handle these types of errors by finding a new memory address or relocating the data.  However, if the program cannot handle the invalid page fault, it will get passed to the operating system, which may terminate the process.  This can cause the program to unexpectedly quit.\nWhile page faults are common when working with virtual memory, each page fault requires transferring data from secondary memory to primary memory.  This process may only take a few milliseconds, but that can still be several thousand times slower than accessing data directly from memory.  Therefore, installing more system memory can increase your computer's performance, since it will need to access virtual memory less often."
        ]
    },
    {
        "word": "Page Layout",
        "type": [],
        "definition": [
            "Page layout refers to the arrangement of text, images, and other objects on a page.  The term was initially used in desktop publishing (DTP), but is now commonly used to describe the layout of webpages as well.  Page layout techniques are used to customize the appearance of magazines, newspapers, books, websites, and other types of publications.\nThe page layout of a printed or electronic document encompasses all elements of the page.  This includes the page margins, text blocks, images, object padding, and any grids or templates used to define positions of objects on the page.  Page layout applications, such as Adobe InDesign and QuarkXpress, allow page designers to modify all of these elements for a printed publication.  Web development programs, such as Adobe Dreamweaver and Microsoft Expression Studio allow Web developers to create similar page layouts designed specifically for the Web.\nSince there are many applications that create customized page layouts, there is also a specific file format category for page layout file types.  These files are similar to word processing documents, but may contain additional page formatting information and other types of visual content.   You can view a list of Page Layout File Types at FileInfo.com."
        ]
    },
    {
        "word": "Page Orientation",
        "type": [],
        "definition": [
            "Page orientation is the direction in which a document is displayed or printed.  The two basic types of page orientation are portrait (vertical) and landscape (horizontal).  Most monitors have a landscape display, while most documents are printed in portrait mode.\nBefore printing a document, you may be able to change the page orientation by selecting \"Page Setup...\" from the program's File menu.  The default orientation is typically portrait, but you can change it to landscape if you want the width to be longer than the height.  This may be useful for printing signs, cards, or other documents that require a wide display."
        ]
    },
    {
        "word": "Page View",
        "type": [],
        "definition": [
            "Each time a user visits a Web page, it is called a page view.  Page views, also written \"pageviews,\" are tracked by website monitoring applications to record a website's traffic.  The more page views a website has, the more traffic it is receiving.  However, since a page view is recorded each time a Web page is loaded, a single user can rack up many page views on one website.  Therefore, unique page views are commonly tracked to log the number of different visitors a website receives in a given time period.\nPage views are commonly confused with website hits.  While people often use the term \"hit\" to describe a page view, technically a hit is recorded for each object that loads during a page view.  For example, if a Web page contains HTML, two images, and a JavaScript reference, a single page view will record four hits.  If a page contains over two hundred images, one page view will record over two hundred hits.\nPage views are more similar to impressions, which are commonly tracked by online advertisers.  Page views and impressions may be identical if one advertisement is placed on each page.  However, if multiple ads are positioned on each page, the number of ad impressions will be greater than the number of page views."
        ]
    },
    {
        "word": "Parallel Port",
        "type": [],
        "definition": [
            "A parallel port is an external interface commonly found on PCs from the early 1980s to early 2000s.  It was used to connect peripheral devices such as printers and external storage devices.  It was eventually superseded by USB, which provides a smaller connection and significantly faster data transfer rates.\nThe parallel port is a hallmark of old computer technology — large in size and slow in speed.  A standard parallel port connector has two rows of 25 total pins surrounded by a metal casing.  It is roughly an inch in width and has two screw-in connectors to keep the cable in place.  Parallel port cables used for printing often have an even larger 36-pin \"Centronics 36\" connector that connects to the printer.  The original parallel port standard was unidirectional and could transmit data at a maximum speed of 150 kbps.\nAs printers became more advanced, it was necessary to increase the connection speed and also provide bidirectional communication.  Instead of the PC sending a \"print\" command and hoping the print job was successful, the bidirectional capability allowed printers to send messages back to the PC, such as \"ready,\" \"printing,\" and \"complete.\"  Faster transmission speeds enabled the parallel port to be used for other purposes, such as external storage devices like the Iomega Zip drive.\nIEEE 1284\nThe parallel port was eventually standardized by the IEEE as \"IEEE 1284.\"  This standard defined new versions of the parallel port, including the Enhanced Parallel Port (EPP) and the Extended Capability Port (ECP).  EPP could transmit data up to 16 Mbps (2 MB\/s).  ECP could achieve data transfer rates close to 20 Mbps or 2.5 MB\/s via an ISA bus.\nWhile the first version of USB was not much faster than a parallel port, it offered other improvements such as a smaller connector and the ability to send electrical voltage to power an external device.  It also was hot-swappable, meaning a USB device could safely be connected or disconnected while a computer is running.  Connecting or disconnecting a peripheral via an IEEE 1284 connection could damage the device or the PC.  The introduction of USB 2.0, which provided data transfer rates of 480 Mbps, made the parallel port obsolete and the IEEE 1284 standard faded into computer history."
        ]
    },
    {
        "word": "Parameter",
        "type": [],
        "definition": [
            "In computer programming, a parameter or \"argument\" is a value that is passed into a function.  Most modern programming languages allow functions to have multiple parameters.  While the syntax of a function declaration varies between programming languages, a typical function with two parameters may look something like this:\nfunction graphXY(x, y)\n{\n&nbsp; ...\n}\nWhen this function is called within a program, two variables should be passed into the function.  It may look something like this:\n$horizontal = 22;\n$vertical = 40;\ngraphXY($horizontal, $vertical);\nIn this example, the values 22 and 40 (stored in the variables $horizontal and $vertical respectively) are the \"input parameters\" passed into the graphXY() function.\nWhen a function has input parameters, the output of the function is often affected by the values that are passed into the function.  Therefore, a single function can be called multiple times within a program and produce different output each time."
        ]
    },
    {
        "word": "Parity",
        "type": [],
        "definition": [
            "Parity is a mathematical term that defines a value as even or odd.  For example, the number 4 has an even parity, while the number 5 has an odd parity.  When even and odd values are compared, such as 4 and 5, they are considered to have different parity.  If two even or odd values are compared with each other, they have the same parity.\nIn computer science, parity is often used for error checking purposes.  For example, a parity bit may be added to a block of data to ensure the data has either an even or odd parity.  This type of error detection is used by various data transmission protocols to ensure that data is not corrupted during the transfer process.  If the protocol is set to an odd parity, all packets received must have an odd parity.  If it is set to even, all packets must have an even parity.  Otherwise, a data transmission error will occur and the corresponding packet(s) will need to be resent.\nParity is also used in a type of computer memory called parity RAM.  This type of RAM stores a parity bit with each byte of data to validate the integrity of each byte.  Therefore, 9 bits of data are required for every byte stored in the RAM.  While parity RAM was commonly used in early computers, memory has become more reliable and therefore most systems now use non-parity RAM.  High-end workstations and servers, which require consistent data integrity, typically use ECC RAM, which provides a more advanced means of error checking than standard parity RAM."
        ]
    },
    {
        "word": "Parity Bit",
        "type": [],
        "definition": [
            "A parity bit is a bit, with a value of 0 or 1, that is added to a block of data for error detection purposes.  It gives the data either an odd or even parity, which is used to validate the integrity of the data.\nParity bits are often used in data transmission to ensure that data is not corrupted during the transfer process.  For example, every 7 bits of data may include a parity bit (for a total of 8 bits, or one byte).  If the data transmission protocol is set to an odd parity, each data packet must have an odd parity.  If it is set to even, each packet must have an even parity.  If a packet is received with the wrong parity, an error will be produced and the data will need to be retransmitted.\nThe parity bit for each data packet is computed before the data is transmitted.  Below are examples of how a parity bit would be computed using both odd and even parity settings.\n\n\n\nOdd parity:\n\nInitial value: 1010101 (four 1s)\nParity bit added: 1\nTransmitted value: 10101011\nResult: Odd parity (five 1s)\n\n\n\nEven parity:\n\nInitial value: 1010101 (four 1s)\nParity bit added: 0\nTransmitted value: 10101010\nResult: Even parity (four 1s)\n\n\n\n\nThe value of the parity bit depends on the initial parity of the data.  For example, the binary value 10000000 has an odd parity.  Therefore, a 0 would be added to keep the parity odd and a 1 would be added to give the value an even parity.\nWhile parity checking is a useful way validating data, it is not a foolproof method.  For instance, the values 1010 and 1001 have the same parity.  Therefore, if the value 1010 is transmitted and 1001 is received, no error will be detected.  This means parity checks are not 100% reliable when validating data.  Still, it is unlikely that more than one bit will be incorrect in a small packet of data.  As long as only one bit is changed, an error will result.  Therefore, parity checks are most reliable when using small packet sizes."
        ]
    },
    {
        "word": "Parked Domain",
        "type": [],
        "definition": [
            "A parked domain is a registered domain name that is active but is not associated with a specific website.  Instead, a parked domain displays a \"parked page\" to users who visit the URL.  A typical parked page has a simple layout with a list of links related to the domain name.  These links may generate advertising revenue for the parked domain's owner when users click on them.\nDomain parking is done for several different reasons.  Some people register domain names hoping to generate \"type-in\" traffic for common words and phrases.  If enough people visit the parked pages on a daily basis, the owners can earn consistent revenue from the clicks on the links or ads.  Domainers or \"cybersquatters\" register large numbers of domain names as an investment, hoping to sell them to interested buyers in the future.  The parked pages for these domains may contain advertisements, but they also include a contact link that visitors can use to make an offer for the domain name.\nMany web hosts display parked pages by default when a domain name has been registered, but a website has not yet been published by the owner.  These pages often state the website is under construction or coming soon and may also include advertisements.  The advertising links on these temporary parked pages generate revenue for the hosting company rather than the owner of the domain name.\nIn some cases, a webmaster may register domain names similar to his or her primary domain name to prevent competitors from using them.  These domain names often display parked pages by default.  The webmaster may also choose to forward the domains to the primary site.  If the domains are redirected, they are no longer parked domains but rather \"forwarders\" that direct users to a different URL."
        ]
    },
    {
        "word": "Parse",
        "type": [],
        "definition": [
            "No, this is not a typo of the word \"sparse.\"  The word \"parse\" means to analyze an object specifically.  It is commonly used in computer science to refer to reading program code.  For example, after a program is written, whether it be in C++, Java, or any other language, the code needs to be parsed by the compiler in order to be compiled.  Web scripts, written in scripting languages such as Perl or PHP, need to be parsed on the Web server so that they can output the correct HTML to a user's browser.\nParsing can also refer to breaking up ordinary text.  For example, search engines typically parse search phrases entered by users so that they can more accurately search for each word.  Some programs can parse text documents and extract certain information like names or addresses.  Spreadsheet programs can turn formatted documents into tables with rows and columns by parsing the text.  As you can see, the ways to parse are clearly not sparse."
        ]
    },
    {
        "word": "Partition",
        "type": [],
        "definition": [
            "A partition is a section of a storage device, such as a hard disk drive or solid state drive.  It is treated by the operating system as a separate logical volume, which makes it function similar to a separate physical device.\nA storage device may be formatted with one or more partitions.  Some operating systems, such as Windows and Linux require multiple partitions, while others like macOS may only require one.  Windows stores system files in a \"System Partition\" and user data files in data partition.  Some Windows drives may also include a \"Recovery Partition,\" which stores files used by the Windows Recovery Environment (WinRE).  This partition is used to repair problems that prevent the operating system from booting.\nWhen formatting a storage device with a disk utility, you can either use the default partition scheme or create a custom one.  For example, you could format a 2 TB hard drive with three partitions — a 300 GB partition used for the startup disk, a 700 GB partition for your photo library, and a roughly 1 TB partition for the rest of your data.  These partitions would each appear as separate volumes on your computer even though they are all on one physical disk.  You can mount and unmount any partitions besides the startup disk.\nWhy Partition a Disk?\nPartitioning a disk can make it easier to organize files, such as video and photo libraries, especially if you have a large hard drive.  Creating a separate partition for your system files (the startup disk) can also help protect system data from corruption since each partition has its own file system.  For many years it was advisable to partition hard drives to reduce the minimum sector size and increase performance.  However, with modern file systems and faster HDDs and SSDs, creating multiple partitions no longer has the same benefit.\nOlder operating systems only allowed you to partition a disk during the formatting or reformatting process.  This meant you would have to reformat a hard drive (and erase all of your data) to change the partition scheme.  Modern operating systems and disk utilities now allow you to resize partitions and create new partitions or volumes on-the-fly.  For example, Apple's APFS file system supports resizing partitions and creating new volumes without reformatting."
        ]
    },
    {
        "word": "PascalCase",
        "type": [],
        "definition": [
            "PascalCase is a naming convention in which the first letter of each word in a compound word is capitalized.  Software developers often use PascalCase when writing source code to name functions, classes, and other objects.\nPascalCase is similar to camelCase, except the first letter in PascalCase is always capitalized.  Below are some examples.\n\nPascalCase: NewObject;\ncamelCase: newObject;\nPascalCase: LongFunctionName()\ncamelCase: longFunctionName()\n\nBoth PascalCase and CamelCase help developers distinguish words within names.  For example, \"LongFunctionName\" is more readable than \"longfunctionname.\"\nFont cases are rarely required in computer programming.  Instead, they are mostly conventions used by programmers.  For example, one developer may prefer to name variables with PascalCase, while another might use camelCase.\nWhile the term \"PascalCase\" comes from software development, it may describe any compound word in which the first letter of each word is capitalized.  Examples include the company \"MasterCard,\" the video game \"StarCraft,\" and of course, the website \"TechTerms.\"\nNOTE: PascalCase is identical to \"UpperCamelCase,\" but most developers avoid this term to avoid confusion with camelCase.  \"PascalCase\" may also be written \"Pascal Case\" (two words)."
        ]
    },
    {
        "word": "Passcode",
        "type": [],
        "definition": [
            "A passcode is a numeric sequence used to authenticate a user on a computer or electronic device.  The word \"passcode\" is sometimes used synonymously with \"password,\" but technically, a passcode only contains numbers.\nThe security of a numeric passcode is proportional to how many digits it contains.  Since there are ten possible values for each digit (0-9), the number of possible codes is equal to ten raised to the number of digits.  For example, a four-digit passcode can have 104 or 10,000 different combinations.  A six-digit passcode can have 106 or 1,000,000 different combinations.\nPasscodes provide quick and easy authentication on devices with a numeric keypad.  Smartphones, for instance, allow you to enter a passcode as an alternative to fingerprint or face recognition.  Other devices that use passcode authentication include ATMs, electronic safes, and security system control panels.  When accessing an ATM, your PIN (personal identification number) may double as your passcode.\nSince passcodes only contain integers, they are naturally less secure than passwords or passphrases.  Therefore, devices that provide passcode authentication often disallow access after a certain number of failed login attempts.  For example, if you passcode-protect your smartphone and enter the wrong passcode multiple times, you may be required to wait several minutes before you can attempt to log in again."
        ]
    },
    {
        "word": "Passive-Matrix",
        "type": [],
        "definition": [
            "Passive-matrix is an LCD technology that uses a grid of vertical and horizontal wires to display an image on the screen.  Each pixel is controlled by an intersection of two wires in the grid.  By altering the electrical charge at a given intersection, the color and brightness of the corresponding pixel can be changed.\nWhile passive-matrix displays are relatively simple and inexpensive to produce, they have a few drawbacks.  Since the charge of two wires (both vertical and horizontal) must be altered in order to change a single pixel, the response time of passive-matrix displays is relatively slow.  This means fast movement on a passive-matrix display may appear blurry or faded, since the electrical charges cannot keep up with the motion.  On some passive-matrix displays, you may experience \"ghosting\" if you move the cursor quickly across the screen.\nSince passive-matrix monitors do not display fast motion well, most modern flat screen displays use active-matrix technology.  Instead of managing pixels through intersections of wires, active-matrix displays control each pixel using individual capacitors.  This allows pixels to change brightness and color states much more rapidly.  While most of today's computer monitors and flat screen televisions have active-matrix screens, passive-matrix displays are still used in some smaller devices, since they are less expensive to produce."
        ]
    },
    {
        "word": "Passphrase",
        "type": [],
        "definition": [
            "A passphrase is a string containing multiple words that is used to authenticate a user on a computer system.  It may be used in combination with a username to create a login or may be required separately for additional authentication.\nThe words password and passphrase are sometimes used synonymously, but they have different meanings.  By definition, a passphrase must contain a phrase that includes multiple words, while a password may only have a minimum length of six or eight characters.  There is no universal required length for a passphrase, but a typical passphrase is 20 to 30 characters in length.\nSince passphrase are usually longer than passwords, they are generally more secure.  However, they can be less secure if common phrases are used within the passphrase.  Examples of insecure phrases include song lyrics, common sayings, and well-known quotes.  Strong passphrases include strings that are not dictionary words and contain special characters, such as ampersands, commas, and periods.  A good passphrase should be unique but be easy to remember.\nNOTE: As long as a system does not limit the length of your password, you can use a passphrase instead of a password."
        ]
    },
    {
        "word": "Passthrough",
        "type": [],
        "definition": [
            "Passthrough is an option available on various electronic devices.  It allows a signal to \"pass through\" the device unaltered.  Different types of passthrough include HDMI, USB, and network passthrough.\nHDMI Passthrough\nA digital receiver (or AVR), processes input, such as digital audio, received through one or more HDMI ports.  It may alter the audio signal using an equalizer or other effects before sending the output to the speakers or another device.  In some cases, it is preferable to leave the signal untouched so it can be processed in its original state by another device.  The \"passthrough\" option — typically located in the AVR's audio menu — prevents the input signal from being processed.\nHDMI \"standby passthrough\" is a similar but different option available on some AVRs.  It allows digital data to flow through a specific HDMI port even when the device is in standby mode (plugged in, but not turned on).\nUSB Passthrough\nUSB passthrough allows USB peripherals to be daisy-chained through one or more devices.  A common example is a keyboard with a USB port.  You can plug a mouse into the USB port on the keyboard, which in turn connects to the USB port on the back of the computer.  USB hubs provide the same function, often for multiple devices.\nUSB passthrough passes digital data through a device, but it does not always provide USB power.  If a USB device requires electrical power to operate (or charge), the passthrough device must supply the necessary wattage.  Keyboards with powered USB passthrough typically use two USB cables.  USB hubs that provide USB power may include an AC adaptor.\nNetwork Passthrough\nIn networking, passthrough may refer to any device that relays data unaltered to another device on the network.  However, it may also refer specifically to a modem or router that passes the IP address to a connected device.\nIP passthrough is a setting that turns off the device's routing features and lets the data pass through to the next connected device.  It is similar to \"bridge mode,\" but also removes any firewall features or other data processing.  IP passthrough eliminates the need for network address translation (NAT) and assigns the public IP address to the connected device."
        ]
    },
    {
        "word": "Password",
        "type": [],
        "definition": [
            "A password is a string of characters used for authenticating a user on a computer system.  For example, you may have an account on your computer that requires you to log in.  In order to successfully access your account, you must provide a valid username and password.  This combination is often referred to as a login.  While usernames are generally public information, passwords are private to each user.\nMost passwords are comprised of several characters, which can typically include letters, numbers, and most symbols, but not spaces.  While it is good to choose a password that is easy to remember, you should not make it so simple that others can guess it.  The most secure passwords use a combination of letters and numbers and do not contain actual words."
        ]
    },
    {
        "word": "Paste",
        "type": [],
        "definition": [
            "Paste is a command that allows you to insert data from the clipboard into an application.  In order to use the Paste command, you must first use either the Copy or Cut command to save data to the clipboard.  Once the clipboard contains data, you can paste the saved data into any supporting program.\nThe Paste command is most commonly used to copy text from one area to another.  For example, you can copy a paragraph from a text document and paste it into an email message.  You can also copy a URL from an email message and paste it into the address bar of a web browser.  When pasting formatted text, some programs provide a \"Paste Special\" command that allows you to select what formatting, if any, to keep when pasting the text.  Other programs include a \"Paste and Match Style\" command, which matches the formatting of the surrounding text.\nPaste can also be used to create copies of images, video clips, audio tracks, and other data.  For example, an image-editing program might allow you to paste a digital photo into the canvas.  An audio production program may allow you to copy four measures of an audio track, then paste it several times to create a loop.  While the Paste command supports many types of data, it will only work if the application supports the data saved to the clipboard.  For example, you cannot paste image data into an audio production program or audio data into an image-editing program.\nThe Paste command is typically found in the program's Edit menu.  You can paste data by either selecting Edit &rarr; Paste or by using the keyboard shortcut \"Control+V\" (Windows) or \"Command+V\" (Mac).  The data will be inserted wherever the cursor is located in the document.  If you have selected part of the document, the Paste command will typically replace the selected data with the clipboard contents.\nNOTE: The Paste command can only be used to paste data into an editable document.  Therefore, if you try to paste data into a read-only document like a webpage or an email message in your inbox, the Paste command will not work."
        ]
    },
    {
        "word": "Path",
        "type": [],
        "definition": [
            "In the real world, paths are trails or streets than lead to a certain location.  Similarly, in the computer world, a path defines the location of a file or folder in a computer's file system.  Paths are also called \"directory paths\" because they often include one or more directories that describe the path to the file or folder.\nA path can either be relative or absolute.  A relative path defines a location that is relative to the current directory or folder.  For example, the relative path to a file named \"document.txt\" located in the current directory is simply the filename, or \"document.txt\".  If the file was stored inside a folder named \"docs\" within the directory, the relative path would be \"docs\/document.txt.\"  If the file was located one folder up from the current directory, the relative path would be defined as \"..\/document.txt\".\nAbsolute paths are defined from the root directory of the file system.  This means no matter what folder is currently open, the absolute path to any given file is the same.  Some examples of root paths include \"\/\" for a Unix root directory, \"\/Applications\/Preview.app\" for a Mac OS X application, and \"C:\\Documents and Settings\\All Users\\Applicaton Data\" for the Windows application settings.  As you can see, Macintosh and Unix systems use forward slashes ( \/ ) to identify path directories, while Windows uses backslashes ( \\ ).  Regardless of the syntax, paths are a simple way to describe the location of folders and files."
        ]
    },
    {
        "word": "Payload",
        "type": [],
        "definition": [
            "When data is sent over the Internet, each unit transmitted includes both header information and the actual data being sent.  The header identifies the source and destination of the packet, while the actual data is referred to as the payload.  Because header information, or overhead data, is only used in the transmission process, it is stripped from the packet when it reaches its destination.  Therefore, the payload is the only data received by the destination system."
        ]
    },
    {
        "word": "Pebibyte",
        "type": [],
        "definition": [
            "A pebibyte is a unit of data storage that equals 2 to the 50th power, or 1,125,899,906,842,624 bytes.\nWhile a petabyte can be estimated as 10^15 or 1,000,000,000,000,000 bytes, a pebibyte is exactly 1,125,899,906,842,624 bytes.  This is to avoid the ambiguity associated with the size of petabytes.  A pebibyte is 1,024 tebibytes and precedes the exbibyte unit of measurement.\nFor a list of other units of measurements, view this Help Center article.\nAbbreviation: PiB"
        ]
    },
    {
        "word": "Peopleware",
        "type": [],
        "definition": [
            "Computers operate using a combination of hardware and software.  However, without user interaction, most computers would be useless machines.  Therefore, \"peopleware\" is sometimes considered a third aspect that takes into account the importance of humans in the computing process.\nPeopleware is less tangible than hardware or software, since it can refer to many different things.  Examples of peopleware include individual people, groups of people, project teams, businesses, developers, and end users.  While peopleware can mean many different things, it always refers to the people who develop or use computer systems.\nWhile the term may not be as widely used as \"hardware\" or \"software,\" peopleware is an important part of computer technology.  It is a good reminder that the role of people should not be overlooked by any business or organization."
        ]
    },
    {
        "word": "Peripheral",
        "type": [],
        "definition": [
            "A computer peripheral is any external device that provides input and output for the computer.  For example, a keyboard and mouse are input peripherals, while a monitor and printer are output peripherals.\nComputer peripherals, or peripheral devices, are sometimes called \"I\/O devices\" because they provide input and output for the computer.  Some peripherals, such as external hard drives, provide both input and output for the computer."
        ]
    },
    {
        "word": "Perl",
        "type": [],
        "definition": [
            "Perl actually stands for \"Practical Extraction and Report Language,\" but you don't really need to know that unless you want to impress your nerd friends.  Perl is a scripting language which uses a syntax similar to C\/C++.  It is commonly used by Web programmers to create scripts for Web servers.  Perl is especially good at parsing text, so programmers often use it for reading and searching through text files.\nAs a regular computer user, you won't get to see Perl in action, since it does most of its work \"behind the scenes.\"  Perl scripts are run on the server computer before any information is sent to your Web browser.  Oh well, the code looks like hieroglyphics to most people anyway."
        ]
    },
    {
        "word": "Permalink",
        "type": [],
        "definition": [
            "Short for \"permanent link.\"  A permalink is a URL that links to a specific news story or Web posting.  Permalinks are most commonly used for blogs, which are frequently changed and updated.  They give a specific Web address to each posting, allowing blog entries to be bookmarked by visitors or linked to from other websites.\nBecause most blogs are published using dynamic, database-driven Web sites, they do not automatically have Web addresses associated with them.  For example, a blog entry may exist on a user's home page, but the entry may not have its own Web page, ending in \".html,\" \".asp,\" \".php,\" etc.  Therefore, once the posting is outdated and no longer present on the home page, there may be no way to access it.  Using a permalink to define the location of each posting prevents blog entries from fading off into oblivion."
        ]
    },
    {
        "word": "Personal URL",
        "type": [],
        "definition": [
            "Many websites that host online communities allow you to create your own personal URL within the website.  This custom URL typically serves as the Web address of your profile page and can be shared and bookmarked by other users.\nExamples of websites that allow you to choose a personal URL include social networking sites like Facebook, photo sharing sites like Flickr, and various Web forums.  Users can choose a custom name, which will then become part of their personal URL.  For example, a personal URL on Facebook may be http:\/\/www.facebook.com\/username.  The username might be a made up name, such as \"pinkbunny77\" or your actual name, such as \"john.johnson.\"\nIf you have an account on a website that allows you to select a personal URL, but have not chosen one yet, the Web address of your profile page may include a unique ID instead of a username.  For example, the Web address of a Facebook profile page might be \"http:\/\/www.facebook.com\/profile.php?id=1234567890\".  Since a username is much easier to remember than a long string of numbers, selecting a username is usually recommended.  When you choose your personal URL for Facebook or another website, make sure you decide on one you really like, since you may not be able to change it.\nPersonal URLs are also called purls, personalized URLs, or custom Web addresses.  They are different from personal home pages, which are created and published on a user's own website."
        ]
    },
    {
        "word": "Petabyte",
        "type": [],
        "definition": [
            "A petabyte is 1015 or 1,000,000,000,000,000 bytes.\nOne petabyte (abbreviated \"PB\") is equal to 1,000 terabytes and precedes the exabyte unit of measurement.  A petabyte is slightly less in size than a pebibyte, which contains 1,125,899,906,842,624 (250) bytes.\nSince most storage devices can hold a maximum of a few terabytes, petabytes are rarely used to measure the storage capacity of a single device.  Instead, petabytes are more commonly used to measure the total data stored in large computer networks or server farms.  For example, Internet companies like Google and Facebook store over 100 petabytes of data on their servers.\nNOTE: You can view a list of all the units of measurement used for measuring data storage."
        ]
    },
    {
        "word": "Petaflops",
        "type": [],
        "definition": [
            "Petaflops is a unit of measurement used for measuring the performance of a processor's floating point unit, or FPU.  It may also be written \"petaFLOPS\" or \"PFLOPS.\"  Since FLOPS stands for \"Floating Point Operations Per Second,\" the term \"petaflops\" may be either singular (one petaflops) or plural (two or more petaflops).  One petaflops is equal to 1,000 teraflops, or 1,000,000,000,000,000 FLOPS.\nPetaflops are rarely used to measure a single computer's performance, since only the fastest supercomputers run at more than one petaflops.  Therefore, petaflops are more often used when calculating the processing power of multiple computers.  Also, since FLOPS only measures floating point calculations, petaflops is not necessarily a good indicator of a computer's overall performance.  Other factors, such as the processor's clock speed, the system bus speed, and the amount of RAM may also affect how quickly a computer can perform calculations."
        ]
    },
    {
        "word": "Pharming",
        "type": [],
        "definition": [
            "Pharming is yet another way hackers attempt to manipulate users on the Internet.  While phishing attempts to capture personal information by getting users to visit a fake website, pharming redirects users to false websites without them even knowing it.\nWhile a typical website uses a domain name for its address, its actual location is determined by an IP address.  When a user types a domain name into his or her Web browser's address field and hits enter, the domain name is translated into an IP address via a DNS server.  The Web browser then connects to the server at this IP address and loads the Web page data.  After a user visits a certain website, the DNS entry for that site is often stored on the user's computer in a DNS cache.  This way, the computer does not have to keep accessing a DNS server whenever the user visits the website.\nOne way that pharming takes place is via an e-mail virus that \"poisons\" a user's local DNS cache.  It does this by modifying the DNS entries, or host files.  For example, instead of having the IP address 17.254.3.183 direct to www.apple.com, it may direct to another website determined by the hacker.  Pharmers can also poison entire DNS servers, which means any user that uses the affected DNS server will be redirected to the wrong website.  Fortunately, most DNS servers have security features to protect them against such attacks.  Still, they are not necessarily immune, since hackers continue to find ways to gain access to them.\nWhile pharming is not as common as phishing scams are, it can affect many more people at once.  This is especially true if a large DNS server is modified.  So, if you visit a certain website and it appears to be significantly different than what you expected, you may be the victim of pharming.  Restart your computer to reset your DNS entries, run an antivirus program, then try connecting to the website again.  If the website still looks strange, contact your ISP and let them know their DNS server may have been pharmed."
        ]
    },
    {
        "word": "Phishing",
        "type": [],
        "definition": [
            "Phishing is similar to fishing in a lake, but instead of trying to capture fish, phishers attempt to steal your personal information.  They send out e-mails that appear to come from legitimate websites such as eBay, PayPal, or other banking institutions.  The e-mails state that your information needs to be updated or validated and ask that you enter your username and password, after clicking a link included in the e-mail.  Some e-mails will ask that you enter even more information, such as your full name, address, phone number, social security number, and credit card number.  However, even if you visit the false website and just enter your username and password, the phisher may be able to gain access to more information by just logging in to you account.\nPhishing is a con game that scammers use to collect personal information from unsuspecting users.  The false e-mails often look surprisingly legitimate, and even the Web pages where you are asked to enter your information may look real.  However, the URL in the address field can tell you if the page you have been directed to is valid or not.  For example, if you are visiting an Web page on eBay, the last part of the domain name should end with \"ebay.com.\"  Therefore, \"http:\/\/www.ebay.com\" and \"http:\/\/cgi3.ebay.com\" are valid Web addresses, but \"http:\/\/www.ebay.validate-info.com\" and \"http:\/\/ebay.login123.com\" are false addresses, which may be used by phishers.  If URL contains an IP address, such as 12.30.229.107, instead of a domain name, you can almost be sure someone is trying to phish for your personal information. \nIf you receive an e-mail that asks that you update your information and you think it might be valid, go to the website by typing the URL in your browser's address field instead of clicking the link in the e-mail.  For example, go to \"https:\/\/www.paypal.com\" instead of clicking the link in an e-mail that appears to come from PayPal.  If you are prompted to update your information after you have manually typed in the Web address and logged in, then the e-mail was probably legitimate.  However, if you are not asked to update any information, then the e-mail was most likely a spoof sent by a phisher.\nMost legitimate e-mails will address you by your full name at the beginning of the message.  If there is any doubt that the e-mail is legitimate, be smart and don't enter your information.  Even if you believe the message is valid, following the guidelines above will prevent you from giving phishers your personal information."
        ]
    },
    {
        "word": "Phreaking",
        "type": [],
        "definition": [
            "Phreaking is a slang term that describes the action of experimenting with or manipulating a telephone system.  Since phreaking took place before personal computers became popular, it is sometimes considered to be the precursor to computer hacking.\nWhile not all phreaking activities are illegal, the term is often associated with using a phone system to make free long distance calls.  Early phone systems has limited security features, which allowed \"phreaks\" to tap into analog phone lines and make calls free of charge.  This was often done using a device called a \"blue box,\" which simulated a telephone operator's console.  Phreaks could use these devices to route their own calls and bypass the telephone company switches, allowing them to make free calls.  This activity was more prominent before the turn of the century, when cell phone companies began including free long distance service.\nPhreaking has evolved over past several decades along with telecommunications technology.  In the 1980s and 1990s, phreaks began using modems to access to computer systems over telephone lines.  Once connected via modem, tech-savvy users could access private data or exploit computers connected on the local network.  This activity also faded out around the turn of the century as dial-up modems were replaced by DSL and cable modems and new security measures were put into place.  While phreaking still exists, it is much less common than other types of computer hacking."
        ]
    },
    {
        "word": "Piconet",
        "type": [],
        "definition": [
            "A piconet is a network that is created using a wireless Bluetooth connection.  Some examples of piconets include 1) a cell phone and a computer, 2) a laptop and a Bluetooth-enabled digital camera, or 3) several PDAs that are connected to each other.\nPiconets can include anywhere from two to eight devices.  One device serves as the master device, while the rest of the devices within the network are slave devices.  The master device acts as the hub, meaning the slave devices must communicate through the master device in order to communicate with each other.  In most piconets, the computer serves as the master device.\nThe term \"piconet\" is derived from the words \"pico,\" which means \"very small\" (technically, one trillionth), and \"net,\" which is short for \"network.\"  Therefore, the word \"piconet\" literally means \"very small network.\""
        ]
    },
    {
        "word": "Ping",
        "type": [],
        "definition": [
            "A ping is a signal sent to a host that requests a response.  It serves two primary purposes: 1) to check if the host is available and 2) to measure how long the response takes.\nA ping request can be performed using a ping command, which is a standard command in most command line interfaces.  Several network utilities provide a ping feature, which allows you to ping a server by simply entering the IP address or domain name.  Most ping programs send multiple pings and provide and average of the pings at the end.\n To perform a ping command from a command line interface, simply type \"ping\" followed by the IP address or domain name of the host you want to ping (e.g., ping 123.123.123.123).\nThe ping itself consists of a single packet (often 32 or 56 bytes) that contains an \"echo\" request.  The host, if available, responds with a single packet as a reply.  The ping time, measured in milliseconds, is the round trip time for the packet to reach the host and for the response to return to the sender.\nPing response times are important because they add overhead to any requests made over the Internet.  For example, when you visit a webpage the ping time is added to the time it takes a server to transmit the HTML and related resources to your computer.  Pings are especially important in online gaming, where events happen in real-time.\nWhile Internet connection speeds can affect pings, ping response time is often directly related to the physical distance between the source and destination systems.  Therefore, a fast connection between New York and Tokyo will likely have a longer ping than a slow connection between New York and Philadelphia.  Network congestion may slow down pings, which is why pings are often used for troubleshooting.\nWhat is a Good Ping Response Time?\n\n&lt; 30 ms - excellent ping; almost unnoticeable; ideal for online gaming\n30 to 50 ms - average ping; still ok for online gaming\n50 to 100 ms - somewhat slow ping time; not too noticeable for web browsing but may affect gaming\n100 ms to 500 ms - slow ping; minimal effect on web browsing, but will create noticeable lag in online gaming\n &gt; 500 ms - pings of a half second or more will add a noticeable delay to all requests; typically happens when the source and destination are in different parts of the world\n"
        ]
    },
    {
        "word": "Pinterest",
        "type": [],
        "definition": [
            "Pinterest is a social networking website that allows you to organize and share ideas with others.  You can share your own content as well as things that other Pinterest users have posted.\nOnce you register for a free account, you can create your own \"boards\" to organize your content.  Examples of topics include recipes, home decor, photography, quotes, and games.  You can upload images and \"pin\" them to relevant boards.  Other Pinterest users can browse your boards and comment on individual items.  Likewise, you can browse other users' boards and \"Like,\" \"Repin,\" or comment on their pinned items.\nSimilar to Twitter, Pinterest allows you to follow other users.  If you find another user's content to be especially interesting, you can click \"Follow All\" to have all their boards show up in your account in real-time.  If you only want to follow specific boards, you can click \"Follow\" next to each board you want to follow.  Pinterest does not inform users when you choose to unfollow them.\nTo experience Pintrest for yourself, visit the Pinterest website."
        ]
    },
    {
        "word": "Pipeline",
        "type": [],
        "definition": [
            "Computer processors can handle millions of instructions each second.  Once one instruction is processed, the next one in line is processed, and so on.  A pipeline allows multiple instructions to be processed at the same time.  While one stage of an instruction is being processed, other instructions may be undergoing processing at a different stage.  Without a pipeline, each instruction would have to wait for the previous one to finish before it could even be accessed.\nTo understand the benefit of a pipeline, imagine that a car manufacturing plant had to wait for each car to be fully completed before starting on the next one.  That would be horribly inefficient, right?  It makes much more sense to work on many cars at once, completing them one stage at a time.  This is what a pipeline in a computer allows.  Pipelining, as it is called, often keeps around six instructions at once in the processor at different stages of processing.  Pipelines can be used for the CPU as well as for accessing memory (DRAM)."
        ]
    },
    {
        "word": "Piracy",
        "type": [],
        "definition": [
            "When someone installs and uses commercial software without paying for the program, it is called \"pirating\" the software.  This name comes from the traditional meaning of the word \"pirate,\" which is a sea-faring criminal that steals and loots belongings from others.  But far from the stereotypical sea pirate, a software pirate can be anyone who owns a computer.  Software piracy is committed by simply downloading or copying a program that a user has not paid for.\nSince computer programs are stored in a digital format, they are easy to copy and reproduce.  For example, a game may be burned to a CD and transferred to the computer of an individual who has not paid for the program.  Software programs can also be illegally downloaded from the Internet from unauthorized sources.  Since pirating software does not require many resources, it has grown into a major problem for the computer industry.\nWhile it may seem like an innocuous act, pirating software is the same as stealing.  Software companies often invest thousands or even millions of dollars into creating the programs they sell.  The income from selling these programs is what allows companies to produce the software and to continue improving the programs we use.  Just because it is possible to copy a software program does not mean it is OK.  Installing a commercial program from an illegal copy is the same thing as walking out of a store with the program and not paying for it.\nWhile there are some programs that are free to use (such as shareware and freeware programs), it is important to pay for commercial software.  You can avoid software piracy by only downloading software from authorized sources and making sure that you have valid software licenses for all the programs you use.  Remember that paying for software programs supports the software industry, which is good for all of us!"
        ]
    },
    {
        "word": "Pixel",
        "type": [],
        "definition": [
            "The term \"pixel\" is actually short for \"Picture Element.\"  These small little dots are what make up the images on computer displays, whether they are flat-screen (LCD) or tube (CRT) monitors.  The screen is divided up into a matrix of thousands or even millions of pixels.  Typically, you cannot see the individual pixels, because they are so small.  This is a good thing, because most people prefer to look at smooth, clear images rather than blocky, \"pixelated\" ones.  However, if you set your monitor to a low resolution, such as 640x480 and look closely at your screen, you will may be able to see the individual pixels.  As you may have guessed, a resolution of 640x480 is comprised of a matrix of 640 by 480 pixels, or 307,200 in all.  That's a lot of little dots.\nEach pixel can only be one color at a time.  However, since they are so small, pixels often blend together to form various shades and blends of colors.  The number of colors each pixel can be is determined by the number of bits used to represent it.  For example, 8-bit color allows for 2 to the 8th, or 256 colors to be displayed.  At this color depth, you may be able to see \"graininess,\" or spotted colors when one color blends to another.  However, at 16, 24, and 32-bit color depths, the color blending is smooth and, unless you have some kind of extra-sensory vision capability, you should not see any graininess."
        ]
    },
    {
        "word": "Plagiarism",
        "type": [],
        "definition": [
            "Plagiarism is the act of copying someone else's work and publishing it as your own.  This includes text, media, and even ideas.  Whenever another person's work is copied and republished without an appropriate reference or citation, it is considered plagiarism.  Examples of plagiarism range from small infractions such as not putting quotes around a quotation to blatant violations such as copying an entire website.  Even if the original content has been modified, such as an altered image or a reworded article, it is still considered plagiarism if no credit is given to the original source.\nWe live in a time when most information is available in a digital format.  While this makes it easier to access information than ever before, it also makes it easier to plagiarize other people's work.  All it takes is a simple copy operation to copy large amounts of text or images from another source.  This content can be pasted into a document or another publication in a matter of seconds.  Anyone with a website can potentially republish the content for the whole world to see, without citing the original author.\nBecause it is so easy to copy and paste digital information, plagiarism in the information age has become a serious problem.  Fortunately, there are laws in place to protect against plagiarism.  The most notable is international copyright law, which states that each individual's published work is automatically protected by copyright.  This means others cannot copy the work without the author's approval and can be held liable for breaking the law if they do so.  In 1996, the U.S. Senate passed the Digital Millennium Copyright Act (DMCA), which heightened penalties for copyright infringements on the Internet.\nAvoiding plagiarism is easy.  It comes down to doing what's right.  If you use someone else's information, make sure you cite the source.  When writing a paper, this means adding APA or MLA citations when you reference other publications.   When publishing a website, it means adding a reference and a link to the website where the information is from.  If you need to reference a large amount of content from another source, you should contact the author and ask for permission.  That way, you can make sure you use and reference the information appropriately.\nFor information about citing content from TechTerms.com, please view the Citation Guidelines."
        ]
    },
    {
        "word": "Plain Text",
        "type": [],
        "definition": [
            "Text documents come in two flavors - rich text and plain text.  Plain text, as you might have guessed, is rather plain.   It supports standard ASCII characters, including numbers, symbols, and spaces, but does not support any type of text formatting.  Therefore you cannot apply bold, italic, or underlined styles, and you cannot use different fonts or font sizes in a plain text document.\nBecause plain text does not contain information about text sizes or styles, it is the most efficient way to store text.  Plain text documents often take up less than half the size of rich text documents containing the same number of characters.  This is why log files, which contain a \"log\" of data generated by a program, are typically stored in a plain text format.\nYou can use a basic text editor such as Notepad or WordPad (for Windows) or TextEdit (for Mac) to create a plain text document.  Other word processing programs can also create plain text documents, but you may have to use the \"Save As...\" command and choose the plain text option when saving the file.  Keep in mind that if you change a rich text document to a plain text file, you will lose any formatting applied to the text.\nSince converting rich text to plain text removes text formatting, this process can be used to strip all styles from formatted text.  For example, if you use Windows, you can copy text from a formatted document and paste it into Notepad, which only supports plain text.  If you copy the text you just pasted into Notepad, the unformatted text will be copied to your clipboard.  The next time you paste the text, it will be pasted as plain text.  If you use a Mac, you can do the same thing with TextEdit, but since the program supports rich text, you will need to select Format &rarr; Make Plain Text after pasting the text into the program.\nFile Extension: .TXT"
        ]
    },
    {
        "word": "Platform",
        "type": [],
        "definition": [
            "In the computer world, a \"platform\" typically refers to a computer's operating system.  For example, a Dell computer running Windows XP would be considered to be running on a Windows platform.  An iMac, on the other hand, runs on the Macintosh platform.  It is a more generic way of referring to a computer's operating system than having to specify, for example, Windows XP Professional SP 2, or Mac OS X 10.3.5.  The term platform is often used when referring to what kind of computer systems a certain software program will run on."
        ]
    },
    {
        "word": "Plotter",
        "type": [],
        "definition": [
            "A plotter is a printer designed for printing vector graphics.  Instead of printing individual dots on the paper, plotters draw continuous lines.  This makes plotters ideal for printing architectural blueprints, engineering designs, and other CAD drawings.\nThere are two main types of plotters – drum and flatbed plotters.  Drum plotters (also called roller plotters) spin the paper back and forth on a cylindrical drum while the ink pens move left and right.  By combining these two directions, lines can be drawn in any direction.  Flatbed plotters have a large horizontal surface on which the paper is placed.  A traveling bar draws lines on the paper as it moves across the surface.\nMost drum and flatbed plotters provide output sizes that are much larger than standard inkjet and laser printers.  For example, a typical inkjet printer creates documents that are 8.5 inches wide.  A drum plotter may produce documents that are 44 inches wide.  The length of a document printed by a drum plotter is only limited by the size of the paper.  Documents printed by flatbed plotters are constrained to the length and width of the printing surface.\nNOTE: While pen plotters are still used today, most models have been replaced by wide-format inkjet printers."
        ]
    },
    {
        "word": "Plug and Play",
        "type": [],
        "definition": [
            "Plug and Play, sometimes, abbreviated PnP, is a catchy phrase used to describe devices that work with a computer system as soon as they are connected.  The user does not have to manually install drivers for the device or even tell the computer that a new device has been added.  Instead the computer automatically recognizes the device, loads new drivers for the hardware if needed, and begins to work with the newly connected device.\nFor example, if you connect a Plug-and-Play mouse to the USB port on your computer, it will begin to work within a few seconds of being plugged in.  A non plug-and-play device would require you to go through several steps of installing drivers and setting up the device before it would work.\nWhile Plug and Play usually refers to computer peripheral devices, such as keyboards and mice, it can also be used to describe internal hardware.  For example, a video card or hard drive may be a Plug and Play device, meaning the computer will recognize it as soon as it is installed.  The only difference is that internal components usually require the computer to be turned off when they are installed, while external devices can typically be installed while the computer is running."
        ]
    },
    {
        "word": "Plug-in",
        "type": [],
        "definition": [
            "Though software plug-ins might not make your room smell as nice as the scented ones you stick in an outlet, they are still useful.  A software plug-in is an add-on for a program that adds functionality to it.  For example, a Photoshop plug-in (such as Eye Candy) may add extra filters that you can use to manipulate images.  A browser plug-in (such as Macromedia Flash or Apple QuickTime) allows you to play certain multimedia files within your Web browser.  VST plug-ins add effects for audio recording and sequencing programs such as Cubase and Logic Audio.\nMost graphics and audio programs today support plug-ins since they are a convenient way to expand the capabilities of the program.  Though some plug-ins may be shipped with the program, most are developed by third-parties and are sold separately.  Because companies that make browser plug-ins are often competing for a standard (such as Flash and QuickTime), these plug-ins are usually available as free downloads from the Internet.\nA list of plug-ins and their associated file extensions can be found here: Plugin File Formats."
        ]
    },
    {
        "word": "PoE",
        "type": [],
        "definition": [
            "Stands for \"Power over Ethernet.\"  PoE provides electrical current over an Ethernet connection.  It powers electronic devices via Ethernet cabling without the need for batteries or a wall outlet.\nMultiple PoE standards exist, but they all provide both data and electrical power over a single cable.  One method, known as \"Alternative A,\" uses the same wires within the Ethernet cable to transmit power and data.  \"Alternative B\" uses one set of wires for sending power and another set of wires for transmitting data.\nTechnically, the PoE standards are defined as a subset of the IEEE 802.3 collection of standards.  Examples include:\n\n802.3af (2003) - supports 15.4 watts\n802.3at (2009) - a.k.a \"PoE+ or POE Plus;\" supports 25.5 watts\n802.3bt (2018) - Type 3 supports 55 watts; Type 4 supports 90 watts\n\nIn order to power a device via Ethernet, a PoE adapter is required.  This device, also called an \"Ethernet injector,\" plugs into a standard power outlet and provides power to one or more Ethernet ports.  A broad range of PoE devices exist, including:\n\nVoIP phones\nWireless access points\nAudio amplifiers\nLighting controllers\nSecurity cameras\n"
        ]
    },
    {
        "word": "Podcast",
        "type": [],
        "definition": [
            "The name \"podcast\" combines the terms iPod and broadcast into a single catchy word.  As the name suggests, podcasts are audio and video broadcasts that can be played on an iPod.  However, because podcasts are downloaded using Apple iTunes and can be played directly within the program, you don't actually need an iPod to listen to a podcast.\nPodcasts are distributed by both professional organizations as well as amateur audio producers who want to share their content with others.  News organizations such as NPR and CNN offer podcasts of their news stories, while other types of podcasts can be downloaded from Comedy Central, G4 TV, VH1, and many other broadcasting companies.  Podcasts can be browsed within the iTunes Music Store or found directly on an organization's website, which often provides links to current podcasts.\nAmateur podcasts can be created by anyone who has a microphone or digital video camera and a computer with recording software.  In fact, recent versions of Apple's GarageBand include special options for creating and exporting podcasts.  Amateur podcasts are not always available through the iTunes store, but can be distributed on the Web.  A simple link to the podcast will open the file in iTunes, making it possible for anyone with a website to publish podcasts.\nPodcasts are often distributed in \"episodes,\" meaning new podcasts are made available on a regular basis.  Users can subscribe to these podcasts, which iTunes can automatically download as they become available.  Once podcasts are downloaded, the files are saved in the iTunes Library and can be viewed within the Podcasts section.  They can be played within iTunes or transferred to an iPod, so users can watch or listen to podcasts while they are on the go."
        ]
    },
    {
        "word": "Pop-Up",
        "type": [],
        "definition": [
            "The term \"pop-up\" has two computer-related meanings.  One refers to a window and the other is a type of menu.\n1. Pop-Up Window\nA pop-up window is a type of window that opens without the user selecting \"New Window\" from a program's File menu.  Pop-up windows are often generated by websites that include pop-up advertisements.  These ads are produced with JavaScript code that is inserted into the HTML of a Web page.  They typically appear when a user visits a page or closes a window.  Some pop-up ads show up in front of the main window, while others show up behind the main browser window.  Ads that appear behind open windows are also called \"pop-under\" ads.\nRegardless of where pop-up advertisements appear on your screen, they can be pretty annoying.  Fortunately, browser developers have realized this and most Web browsers now include an option to block pop-up windows.  If you are noticing pop-up windows appear on your computer when your browser is not open, you may have an adware program running on your computer.  The best solution to this problem is to run an anti-spyware program that will locate and remove the malware from your system.\n2. Pop-Up Menu\nA pop-up menu is a type of menu that pops up on the screen when the user right-clicks a certain object or area.  It can be also called a contextual menu since the menu options are relevant to where the user right-clicked on the screen.  Pop-up menus provide quick access to common program functions and are used by most operating systems and applications."
        ]
    },
    {
        "word": "Port",
        "type": [],
        "definition": [
            "In the computer world, the term \"port\" has three different meanings.  It may refer to 1) a hardware port, 2) an Internet port number, or 3) the process of porting a software program from one platform to another.\n1. Hardware Port\nA hardware port is a physical connection on a computer or another electronic device.  Common ports on modern desktop computers include USB, Thunderbolt, Ethernet, and DisplayPort.  Previous generations of computers used different ports, such a serial ports, parallel ports, and VGA ports.  Mobile devices often have only one port.  For example, an iPhone or iPad may have a single Lightning connector.  Android devices often have a USB-C port.\nThe purpose of a hardware port is to provide connectivity and\/or electrical power to a device.  For example, the USB ports on a computer can be used to connect keyboards, mice, printers, or other peripherals.  The USB-C port on a smartphone may be used to charge the device and sync it with a PC.\nNOTE: A hardware port may also be called an interface, jack, or connector.\n2. Internet Port Number\nAll data transmitted over the internet is sent and received using a specific set of commands, also known as a protocol.  Each protocol is assigned a specific port number.  For example, all website data transferred over HTTP uses port 80.  Data sent over HTTPS uses port 443.  Other common ports include:\n\nPort 20 - FTP (file transfer protocol)\nPort 22 - SSH and SFTP\nPort 25 - SMTP (outgoing email)\nPort 465 - SMTP over SSL\nPort 143 - IMAP (incoming email)\nPort 993 - IMAP over SSL\n\nPort numbers are similar to wireless channels in that they prevent conflicts between different protocols.  They also provide a simple way to implement network security measures, since it is possible to allow or block specific protocols.\n3. Porting Software\n\"Port\" may also be used as a verb.  Porting software means taking an application written for one platform and making it work on another one.  For example, a Windows program may be ported to macOS.  An iOS app may be ported to Android.\nIn order to port a program from one platform to another, it must be written for the corresponding hardware and operating system.  Programs built using a universal development environment may be relatively easy to port, while programs that rely heavily on an operating system's API may have to be completely rewritten."
        ]
    },
    {
        "word": "Portable Software",
        "type": [],
        "definition": [
            "Portable software is software that runs from a removable storage device, such as a USB flash drive.  It does not need to be installed on a computer to run and does not store data on the host system.  Instead, all user settings and related files are stored on the removable drive.\nPortable software can refer to 1) individual portable applications or 2) portable software platforms.\n1. Individual portable applications\nApplications that run from external media without requiring installation are considered portable apps.  For example, LibreOffice and OpenOffice are both available in \"portable\" versions that can be run from a flash drive.  Examples of other portable apps include Blender Portable – a 3D modeling application, Eclipse Portable – a software IDE, and Media Player Classic Portable – a media playback program.  All of these programs are available in both standard and portable versions.\n2. Portable software platforms\nSince there are many portable applications available, it is common to include multiple apps on one removable drive, managed by a single portable platform.  By consolidating all your portable apps on one device, you can bring your desktop applications – along with all your files and settings – with you wherever you go.  The most popular portable platform is PortableApps.com, which supports over 300 portable applications.  Other portable platforms include Ceedo, winPenPack, and SmartKey, the successor to the U3 platform developed by SanDisk.\nThe main benefit of portable software is that you can run applications on any compatible machine.  However, it also provides a security benefit since all your settings are stored on the removable storage device.  This provides a means of \"sandboxing,\" which prevents unwanted files or malware from being written to your device."
        ]
    },
    {
        "word": "Portal",
        "type": [],
        "definition": [
            "Web portals come in two flavors — internal an external.  Internal portals are designed to provide services within an organization, while external portals serve as a starting point for browsing the web.\nInternal Portal\nMany businesses have a company portal, which is a website designed to provide communication and services to employees.  For example, it may include a calendar of events, such as meetings, product releases, and other important dates.  It may also provide links to employee documents, such as the employee handbook, tax forms, and FAQs for common job-related questions.  Company portals often include a way for employees to communicate with each other, either through live messaging or email.\nInternal portals often exist within an intranet, which is a private network.  This means only authorized users can access the portal.  In most cases, you must enter valid login information in order to use an internal portal.  While some portal services are installed within a local network, others are hosted by remote servers.  Remotely hosted portals may not offer as much customization as locally installed ones, but they also require less maintenance.  Both types of portals can be accessed with a standard web browser.\nExternal Portal\nAn external portal is a website designed to be a starting point on the web.  It consolidates links to different subjects and related articles, simplifying the web browsing process.  Yahoo, for example, is a well-known portal that includes categories such as News, Sports, Finance, Shopping, Movies, Politics, Tech, and others.  Each of these topics include links to news stories, both internal and external, to Yahoo! that you can read.\nIn the early days of the Internet, portals were a common way for people to browse the web.  However, as search engine technology improved in the late 1990s, people starting using search engines more and portals less.  As a result, web portals have faded in popularity over the past few decades and only a few remain.\nNOTE: A portal is different than a search engine, but most portals include some type of search feature.  Yahoo! is both a portal and a search engine, since it includes a comprehensive web search capability.  Google is primarily a search engine and was not originally designed to be a portal.  However, since Google now provides services like YouTube, Google Maps, Google Drive, Gmail, News, and others from the Google home page, it is also a portal."
        ]
    },
    {
        "word": "PostScript",
        "type": [],
        "definition": [
            "PostScript is a page description language (PDL) that describes a page's text and graphical content.  It can be used to define the appearance of graphics and text for both screen and print.  The language was developed by Adobe in 1984 and has since gone through many revisions and updates.\nBefore PostScript was introduced, publishing systems relied on proprietary typesetting systems, which often caused incompatibilities between computers and printing systems.  In fact, before the days of PostScript, pages that incorporated text, images, and line art had to be manually assembled on a paste-up board and then photographed.  The resulting picture was sent to a printing plate, which was used to make copies of the document -- pretty archaic compared to the simple printing options available today.\nAdobe PostScript makes it possible to produce high quality page content that can include text, images, and line art in a standard format compatible with multiple devices.  For example, PostScript (.PS) files will print the exact same way from different PostScript compatible printers.  They can also be opened using Adobe Acrobat and will look the same on Macintosh and Windows platforms.  In fact, the evolution of PostScript led to the development of Adobe Acrobat, which creates PDF documents.\nFile extensions: .PS, .EPS"
        ]
    },
    {
        "word": "Power Cycle",
        "type": [],
        "definition": [
            "While the phrase \"power cycle\" appears to be a noun, it is actually more commonly used as a verb.  In simple terms, to power cycle a device means to turn it off and turn it back on again.  For example, the user manual of a router may ask you to power cycle the router if it stops responding.   This may mean switching the power to OFF and then ON again or may require physically unplugging the device and then plugging it back in again.  Power cycling is often synonymous with resetting a device.\nAs we all know, computer equipment can be rather finicky at times.  A device that was working fine ten minutes ago may begin acting strangely or may not be responding at all.  Often the low-tech solution of simply turning off the device and turning it back on again will fix the problem.  This is because information stored in the device's RAM may have gotten corrupted and caused the device to hang up or stall on a certain instruction.  Power cycling the device erases the RAM and allows it to boot up with fresh information.  Typically it is a good idea to wait 5 to 10 seconds before turning the device back on to make sure it has chance to fully reset.  Of course, if you need to power cycle your computer, you should save any work you currently have open, since it will be erased from the RAM once the system is restarted."
        ]
    },
    {
        "word": "Power Supply",
        "type": [],
        "definition": [
            "A power supply is a hardware component that supplies power to an electrical device.  It receives power from an electrical outlet and converts the current from AC (alternating current) to DC (direct current), which is what the computer requires.  It also regulates the voltage to an adequate amount, which allows the computer to run smoothly without overheating.  The power supply an integral part of any computer and must function correctly for the rest of the components to work.\nYou can locate the power supply on a system unit by simply finding the input where the power cord is plugged in.  Without opening your computer, this is typically the only part of the power supply you will see.  If you were to remove the power supply, it would look like a metal box with a fan inside and some cables attached to it.  Of course, you should never have to remove the power supply, so it's best to leave it in the case.\nWhile most computers have internal power supplies, many electronic devices use external ones.  For example, some monitors and external hard drives have power supplies that reside outside the main unit.  These power supplies are connected directly to the cable that plugs into the wall.  They often include another cable that connects the device to the power supply.  Some power supplies, often called \"AC adaptors,\" are connected directly to the plug (which can make them difficult to plug in where space is limited).  Both of these designs allow the main device to be smaller or sleeker by moving the power supply outside the unit.\nSince the power supply is the first place an electronic device receives electricity, it is also the most vulnerable to power surges and spikes.  Therefore, power supplies are designed to handle fluctuations in electrical current and still provide a regulated or consistent power output.  Some include fuses that will blow if the surge is too great, protecting the rest of the equipment.  After all, it is much cheaper to replace a power supply than an entire computer.  Still, it is wise to connect all electronics to a surge protector or UPS to keep them from being damaged by electrical surges."
        ]
    },
    {
        "word": "Power User",
        "type": [],
        "definition": [
            "When it comes to computers, there are regular users and there are power users.  Most people fall into the regular computer user category.  These types of people use their computers for basic functions like Web browsing, sending e-mails, typing papers, working with spreadsheets, doing finances, and playing games.  Regular computer users can typically get by with a middle-of-the-line computer that is fast enough to do their everyday work.\nPower users, however, require top-of-the-line machines that are optimized for their work purposes.  Power users include video-editing professionals, high-end graphic designers, audio producers, and those who use their computers for scientific research.  Professional gamers (yes, there is such a thing) also fall under this category.  These users seek the latest and greatest systems because no computer is really \"fast enough\" to suit their needs.  Even the fastest computers can take substantial time to render large amounts of video and audio or to manipulate large images.  Gamers want machines that will play their games in as many frames per second (FPS) as possible.  So, to be a power user means to never be really satisfied with your system, but to always want something faster and better.  Then again, that sounds like most of us, but power users usally have justifiable reasons."
        ]
    },
    {
        "word": "PowerPoint",
        "type": [],
        "definition": [
            "PowerPoint is a presentation program developed by Microsoft.  It is included in the standard Office suite along with Microsoft Word and Excel.  The software allows users to create anything from basic slide shows to complex presentations.\nPowerPoint is often used to create business presentations, but can also be used for educational or informal purposes.  The presentations are comprised of slides, which may contain text, images, and other media, such as audio clips and movies.  Sound effects and animated transitions can also be included to add extra appeal to the presentation.  However, overusing sound effects and transitions will probably do more to annoy your audience than draw their attention.  (Yes, we have all heard the car screeching noise enough times for one lifetime.)\nMost PowerPoint presentations are created from a template, which includes a background color or image, a standard font, and a choice of several slide layouts.  Changes to the template can be saved to a \"master slide,\" which stores the main slide theme used in the presentation.  When changes are made to the master slide, such as choosing a new background image, the changes are propagated to all the other slides.  This keeps a uniform look among all the slides in the presentation.\nWhen presenting a PowerPoint presentation, the presenter may choose to have the slides change at preset intervals or may decide to control the flow manually.  This can be done using the mouse, keyboard, or a remote control.  The flow of the presentation can be further customized by having slides load completely or one bullet at a time.  For example, if the presenter has several bullet points on a page, he might have individual points appear when he clicks the mouse.  This allows more interactivity with the audience and brings greater focus to each point.\nPowerPoint presentations can be created and viewed using Microsoft PowerPoint.  They can also be imported and exported with Apple Keynote, Apple's presentation program for the Macintosh platform.  Since most people prefer not to watch presentations on a laptop, PowerPoint presentations are often displayed using a projector.  Therefore, if you are preparing a PowerPoint presentation for a room full of people, just make sure you have the correct video adapter."
        ]
    },
    {
        "word": "Prebinding",
        "type": [],
        "definition": [
            "Prebinding is an optimization process that allows faster launching of applications in Mac OS X.  Often, when a program is opened, it loads data from files called dynamic libraries.  These libraries must be located each time a program is run since their memory addresses are usually undefined.\nWhen a program incorporates prebinding, the addresses of the library or libraries referenced by the program are predefined.  This saves time by avoiding unnecessary searching each time the program is run.  The prebinding process happens during the \"Optimizing\" stage of the program's installation.  While prebinding make take some time, it is more efficient to do this process once, rather than each time the program is run.\nPrebinding is only possible with Mach-O executable programs, since CFM PEF binaries do not support prebinding."
        ]
    },
    {
        "word": "Pretest",
        "type": [],
        "definition": [
            "Before releasing products for sale, companies often pretest their products for safety and reliability.  This process typically involves detecting and fixing errors and making improvements if necessary.  In the computer industry, pretesting can be performed on both hardware and software.\nComputer hardware manufacturers often pretest their products rigorously before distributing them to the public.  For example, a hard drive may be tested in extremely hot and cold temperatures to determine what the safe operating temperature of the hard drive is.  A chip manufacturer may test a CPU under a maximum processing load for an extended period of time to make sure it does not overheat.  Hard drives, CPUs, and RAM are all tested for reliability, since small errors can cause major problems.  Modern computers can perform billions of calculations per second, so even one miscalculation per billion is considered highly unreliable.\nSoftware is also pretested before it is made available for sale.  The amount of pretesting is generally determined by the size and complexity of the program.  Initially, pretesting is done by the software development team, as the initial bugs are worked out.  Then the software may go through an \"alpha\" phase, where the developers and possibly other users test the software.  As the program nears completion, it may go through a \"beta\" phase, where additional users can test the software and provide feedback to the developers.  This software is called beta software and may be distributed to a select group of users or the general public.  Once the beta stage is complete, the software is ready for sale."
        ]
    },
    {
        "word": "Primary Key",
        "type": [],
        "definition": [
            "A primary key is a unique identifier for a database record.  When a table is created, one of the fields is typically assigned as the primary key.  While the primary key is often a number, it may also be a text field or other data type.  For example, if a database contains definitions of computer terms, it would make sense that each term is only listed once in the database.  By defining the \"Term\" field as the primary key, it would ensure that no term is listed more than once in the database.\nWhile a table's primary key is usually assigned to a specific field, it can also be comprised of multiple values.  For example, a database of news articles might use both the title and date fields to uniquely identify each entry.  By combining the \"Title\" and \"Date\" fields as the primary key, it would ensure no entries have the same title on the same day.\nIf multiple fields in a table cannot have duplicate values, most database management system (DBMS) also allow fields to be defined as \"Unique.\"  This is similar to setting a field as the primary key, but is not exactly the same thing.  The primary key also acts as a pointer to the record and provides a simple way for the DBMS to search, sort, and access the records.  It also helps relate records across multiple tables. Therefore, while multiple fields within a table can be defined as \"Unique,\" each table can only have one primary key.  The primary key field must also be defined for each record and not set to null.  After all, a undefined identifier is not very useful."
        ]
    },
    {
        "word": "Primary Memory",
        "type": [],
        "definition": [
            "Primary memory is computer memory that is accessed directly by the CPU.  This includes several types of memory, such as the processor cache and system ROM.  However, in most cases, primary memory refers to system RAM.\nRAM, or random access memory, consists of one or more memory modules that temporarily store data while a computer is running.  RAM is volatile memory, meaning it is erased when the power is turned off.  Therefore, each time you start up your computer, the operating system must be loaded from secondary memory (such as a hard drive) into the primary memory, or RAM.  Similarly, whenever you launch an application on your computer, it is loaded into RAM.\nThe operating system and applications are loaded into primary memory, since RAM can be accessed much faster than storage devices.  In fact, the data can be transferred between CPU and RAM more than a hundred times faster than between the CPU and the hard drive.  By loading data into RAM, programs can run significantly faster and are much more responsive than if than constantly accessed data from secondary memory.\nNOTE: Primary memory may be called \"primary storage\" as well.  However, this term is somewhat more ambiguous since, depending on the context, primary storage may also refer to internal storage devices, such as internal hard drives."
        ]
    },
    {
        "word": "Primitive",
        "type": [],
        "definition": [
            "In computer science, a primitive is a fundamental data type that cannot be broken down into a more simple data type.  For example, an integer is a primitive data type, while an array, which can store multiple data types, is not.\nSome programming languages support more data types than others and not all languages implement data types the same way.  However, most high-level languages share several common primitives.\nJava, for instance, has eight primitive data types:\n\nboolean – a single TRUE or FALSE value (typically only requires one bit)\nbyte – 8-bit signed integer (-127 to 128)\nshort – 16-bit signed integer (-32,768 to 32,767)\nint – 32-bit signed integer (-231 to -231 -1)\nlong – 64-bit signed integer (-263 to -263 -1)\nfloat – 32-bit floating point number\ndouble  – 64-bit floating point number\nchar – 16-bit Unicode character\n\nThe string data type is generally considered non-primitive since it is stored as an array of characters.\nPrimitives supported by each programming language are sometimes called \"built-in data types\" since they store values directly in memory.  Non-primitive data types store references to values rather than the values themselves.  Examples of non-primitive Java data types include arrays and classes."
        ]
    },
    {
        "word": "Print Server",
        "type": [],
        "definition": [
            "A print server is a device that allows you to share a printer with multiple computers.  It may be a standalone adapter or may be integrated within a printer or a router.  When activated, the print server allows a printer to connect to a local network rather than a single computer.  The printer can then be accessed by multiple devices (including both Mac and Windows computers) as a \"network printer.\"\nStandalone print servers come in several varieties.  Most have a USB port, which connects directly to the USB port of the printer.  However, some print servers can connect to a printer's Ethernet or parallel port as well.  Wired print servers include an Ethernet port for connecting directly to a router, while wireless versions are able to connect to a Wi-Fi network.\nPrinters that include a built-in print server are often called \"network printers\" or \"wireless printers.\"  These printers may have an Ethernet port for connecting directly to a LAN or a built-in Wi-Fi card, which enables the printer to show up on a wireless network.  Since many homes and businesses now have wireless networks, wireless printers have become a popular way to share a printer with multiple computers.\nSome routers can also function as print servers.  Besides the typical Ethernet ports, they also include a USB port for connecting a printer.  When you connect a printer to the router, the printer becomes a network device and can be accessed by other devices on the network."
        ]
    },
    {
        "word": "Printer",
        "type": [],
        "definition": [
            "A printer is an output device that prints paper documents.  This includes text documents, images, or a combination of both.  The two most common types of printers are inkjet and laser printers.  Inkjet printers are commonly used by consumers, while laser printers are a typical choice for businesses.  Dot matrix printers, which have become increasingly rare, are still used for basic text printing.\nThe printed output produced by a printer is often called a hard copy, which is the physical version of an electronic document.  While some printers can only print black and white hard copies, most printers today can produce color prints.  In fact, many home printers can now produce high-quality photo prints that rival professionally developed photos.  This is because modern printers have a high DPI (dots per inch) setting, which allows documents to printed with a very fine resolution.\nIn order to print a document, the electronic data must be sent from the computer to the printer.  Many software programs, such as word processors and image editing programs, include a \"Print...\" option in the File menu.  When you select \"Print,\" you will typically presented with a Print dialog box.  This box allows you to select the print output settings before sending the document to the printer.  After choosing the appropriate settings, you can hit the Print button, which will send the document to the printer.\nOf course for the document to print, the printer must be turned on and connected to the computer.  Most modern printers are connected using a standard USB cable.  However, some printers can be wirelessly connected to one or more computers over a Wi-Fi network.  You can also use more than one printer on a single computer, as long as the correct drivers are installed.\nWhile printers are notorious for breaking down at inopportune times, modern printers are fortunately more reliable than the printers of the past.  Of course, keeping extra ink or toner cartridges on hand is still your responsibility."
        ]
    },
    {
        "word": "Private IP Address",
        "type": [],
        "definition": [
            "A private IP address identifies a device on a local network (LAN).  It is similar to a public IPv4 address, which identifies a device connected to the Internet, but is limited to a predefined range of IPs.\nBelow are three common ranges of IP addresses reserved for private IPs:\n\n10.0.0.0 – 10.255.255.255\n172.16.0.0 – 172.31.255.255\n192.168.0.0 – 192.168.255.255\n\n10.0.0.1, for instance, cannot be used as a public IP address because it falls in the range of private IPs.  Instead, 10.0.0.1 can only be assigned to a router, computer, or another device on a local network.  Routers incrementally assign IP addresses to devices when they connect to the network, via DHCP.  For example, a router may use the address 10.0.0.1 and assign 10.0.0.2 to the first device that connects to it.  The following device will receive an address of 10.0.0.3, then 10.0.0.4, etc.\n192.168.x.x vs 10.x.x.x \nMost local networks use the 192.168.x.x range of private IPs.  The second most popular range is 10.x.x.x, followed by 172.32.x.x.  Generally, the router manufacturer determines the default range.  For example, Linksys and Netgear routers typically use 192.168.0.1 or 192.168.1.1 for the router IP address, and therefore the IP ranges of 192.168.x.x.  Apple routers (now discontinued) used the 10.0.0.x range.  The 172.31.x.x range is the least common but may be used by large networks, such as university campuses and office buildings. \nNOTE: Network address translation (NAT) translates the private IP address of each device on a network to the public IP address assigned by the ISP.  Thanks to NAT, all devices connected to a router share the same public IP address."
        ]
    },
    {
        "word": "Process",
        "type": [],
        "definition": [
            "A process is a program that is running on your computer.  This can be anything from a small background task, such as a spell-checker or system events handler to a full-blown application like Internet Explorer or Microsoft Word.  All processes are composed of one or more threads.\nSince most operating systems have many background tasks running, your computer is likely to have many more processes running than actual programs.  For example, you may only have three programs running, but there may be twenty active processes.  You can view active processes in Windows by opening the Task Manager (press Ctrl-Alt-Delete and click Task Manager).  On a Mac, you can see active processes by opening Activity Monitor (in the Applications&rarr;Utilities folder).\nThe term \"process\" can also be used as a verb, which means to perform a series of operations on a set of data.  For example, your computer's CPU processes information sent to it by various programs."
        ]
    },
    {
        "word": "Processing",
        "type": [],
        "definition": [
            "Processing is a programming language designed for the visual arts community.  It is open source and uses basic syntax for creating drawings, animations, and interactive programs.  It also includes a basic IDE, which serves as the programming interface.\nEach program created in Processing is called a \"sketch\" and can be saved in a sketchbook.  They are uncompiled source code files and are saved in a plain text format.  Each sketch can be run within the Processing interface using the Sketch &rarr; Run command.  The Sketch &rarr; Tweak command allows you to edit the program code in real-time as the sketch is running.  The Sketch &rarr; Present runs the sketch as a full-screen application.\nBelow is an example of Processing code that creates a window that is 640x480 in size and draws a rectangle near the upper left corner that is 300x200 in size.\nvoid setup() {\n&nbsp; size(640,480);\n}\nvoid draw() {\n&nbsp; rect(40,40,300,200);\n}\nProcessing is built on Java, so Processing source code has similar syntax to Java.  The Processing window is actually a Java program called PApplet, which is a Java class.  Before Processing 3 was released (in 2015), it was possible to embed a PApplet into a Java application.  The applet dependency was removed in Processing 3.0, so extra code is now required to embed PApplets into Java applications.\nWhile the Processing IDE is the standard way to create and run Processing sketches, they can also be built and run using other interfaces.  For example, it is possible to use an IDE like Eclipse as long as Processing's core.jar file is imported.  It is also possible to run Processing sketches directly in a web browser using the p5.js JavaScript library.  Finally, there is a Processing.py library that allows Processing programs to be written and run in Python."
        ]
    },
    {
        "word": "Processor",
        "type": [],
        "definition": [
            "A processor, or \"microprocessor,\" is a small chip that resides in computers and other electronic devices.  Its basic job is to receive input and provide the appropriate output.  While this may seem like a simple task, modern processors can handle trillions of calculations per second.\nThe central processor of a computer is also known as the CPU, or \"central processing unit.\"  This processor handles all the basic system instructions, such as processing mouse and keyboard input and running applications.  Most desktop computers contain a CPU developed by either Intel or AMD, both of which use the x86 processor architecture.  Mobile devices, such as laptops and tablets may use Intel and AMD CPUs, but can also use specific mobile processors developed by companies like ARM or Apple.\nModern CPUs often include multiple processing cores, which work together to process instructions.  While these \"cores\" are contained in one physical unit, they are actually individual processors.  In fact, if you view your computer's performance with a system monitoring utility like Windows Task Manager (Windows) or Activity Monitor (Mac OS X), you will see separate graphs for each processor.  Processors that include two cores are called dual-core processors, while those with four cores are called quad-core processors.  Some high-end workstations contain multiple CPUs with multiple cores, allowing a single machine to have eight, twelve, or even more processing cores.\nBesides the central processing unit, most desktop and laptop computers also include a GPU.  This processor is specifically designed for rendering graphics that are output on a monitor.  Desktop computers often have a video card that contains the GPU, while mobile devices usually contain a graphics chip that is integrated into the motherboard.  By using separate processors for system and graphics processing, computers are able to handle graphic-intensive applications more efficiently."
        ]
    },
    {
        "word": "Processor Core",
        "type": [],
        "definition": [
            "A processor core (or simply “core”) is an individual processor within a CPU.  Many computers today have multi-core processors, meaning the CPU contains more than one core.\nFor many years, computer CPUs only had a single core.  In the early 2000s, as processor clock speeds began plateauing, CPU manufacturers needed to find other ways to increase processing performance.  Initially, they achieved this by putting multiple processors in high-end computers.  While this was effective, it added significant cost to the computers and the multiprocessing performance was limited by the bus speed between the CPUs.\nBy combining processors on a single chip, CPU manufactures were able to increase performance more efficiently at a lower cost.  The individual processing units became known as “cores” rather than processors.  In the mid-2000s, dual-core and quad-core CPUs began replacing multi-processor configurations.  While initially only high-end computers contained multiple cores, today nearly all PCs have multi-core processors.\nNOTE: “Core” is also the name of Intel’s processor line, which replaced the Pentium lineup in 2006.  Examples of Intel Core processors include the Core Duo, Core 2, Core i3, Core i5, and Core i7."
        ]
    },
    {
        "word": "Program",
        "type": [],
        "definition": [
            "Program is a common computer term that can be used as both a noun and a verb.  A program (noun) is executable software that runs on a computer.  It is similar to a script, but is often much larger in size and does not require a scripting engine to run.  Instead, a program consists of compiled code that can run directly from the computer's operating system.\nExamples of programs include Web browsers, word processors, e-mail clients, video games, and system utilities.  These programs are often called applications, which can be used synonymously with \"software programs.\"  On Windows, programs typically have an .EXE file extension, while Macintosh programs have an .APP extension.\nWhen \"program\" is used as verb, it means to create a software program.  For example, programmers create programs by writing code that instructs the computer what to do.  The functions and commands written by the programmer are collectively referred to as source code.  When the code is finished, the source code file or files are compiled into an executable program."
        ]
    },
    {
        "word": "Programming Language",
        "type": [],
        "definition": [
            "A programming language is a set of commands, instructions, and other syntax use to create a software program.  Languages that programmers use to write code are called \"high-level languages.\"  This code can be compiled into a \"low-level language,\" which is recognized directly by the computer hardware.\nHigh-level languages are designed to be easy to read and understand.  This allows programmers to write source code in a natural fashion, using logical words and symbols.  For example, reserved words like function, while, if, and else are used in most major programming languages.  Symbols like &lt;, &gt;, ==, and != are common operators.  Many high-level languages are similar enough that programmers can easily understand source code written in multiple languages.  \nExamples of high-level languages include C++, Java, Perl, and PHP.  Languages like C++ and Java are called \"compiled languages\" since the source code must first be compiled in order to run.  Languages like Perl and PHP are called \"interpreted languages\" since the source code can be run through an interpreter without being compiled.  Generally, compiled languages are used to create software applications, while interpreted languages are used for running scripts, such as those used to generate content for dynamic websites.\nLow-level languages include assembly and machine languages.  An assembly language contains a list of basic instructions and is much more difficult to read than a high-level language.  In rare cases, a programmer may decide to code a basic program in an assembly language to ensure it operates as efficiently as possible.  An assembler can be used to translate the assembly code into machine code.  The machine code, or machine language, contains a series of binary codes that are understood directly by a computer's CPU.  Needless to say, machine language is not designed to be human readable."
        ]
    },
    {
        "word": "Progressive Scan",
        "type": [],
        "definition": [
            "Video signals are generated using horizontal lines.  An interlaced picture draws every other line and alternates between drawing odd lines and even lines.  A progressive scan picture draws every line in sequence.  Therefore, a progressive scan video signal sends twice as much data than an interlaced signal each time it draws an image on the screen.\nBefore DVDs and HDTV became popular, interlaced video was the norm for television.  Standard definition broadcasts were interlaced, since it was a more efficient way to send video data.  Since the human eye has a hard time detecting video interlacing, an interlaced signal that refreshes at 60 Hz (times per second) is easier on the eyes and produces less flicker than a progressive scan signal that refreshes at 30 Hz.\nStill, if a progressive scan and interlaced image are both projected at 60 Hz, the progressive scan image will usually appear slightly smoother.  Video that contains fast motion makes this difference more noticeable.  For this reason, the DVD and HDTV standards were developed to support progressive scan video signals.\nWhen you see video formats described as 480p or 720p, the number indicates how many horizontal lines of resolution the video signal uses, while the \"p\" indicates it is a progressive scan signal.  Similarly, the 1080i format contains 1080 lines of resolution, but is interlaced.  Both 720p and 1080i are used by HDTV."
        ]
    },
    {
        "word": "Projector",
        "type": [],
        "definition": [
            "A projector is an output device that projects an image onto a large surface, such as a white screen or wall.  It may be used an alternative to a monitor or television when showing video or images to a large group of people.\nProjectors come in many shapes and sizes though they are commonly about a foot long and wide and a few inches tall.  They can be mounted on ceilings or may be freestanding and portable.  Ceiling-mounted projectors are typically larger, especially ones that project a long distance (such as 30 feet or more).  These projectors are commonly found in classrooms, conference rooms, auditoriums, and places of worship.\nPortable projectors can used wherever there is a bright surface (such as a white or light colored wall).  Most projectors have multiple input sources, such as HDMI ports for newer equipment and VGA ports for older devices.  Some projectors support Wi-Fi and Bluetooth as well.\nHigh-quality projectors used to cost thousands of dollars and the bulbs alone could cost more than a hundred dollars.  Modern advances in technology – especially LCD and LED light sources – have reduced the cost of a bright high-quality projector to only a few hundred dollars.  \nFront vs Rear Projection\nMost projectors can be used for either front or rear projection.  The difference is the screen, which is opaque white for front projection and semi-transparent grey for rear projection.  Front projection sends the image from the position of the audience to the front of the screen.  This is by far the most common method since it does not require an empty space behind the screen.\nRear projection projects the image towards the audience from behind the screen.  This method is less affected by ambient light and often provides better contrast.  Rear projection is commonly used in outdoor settings and commercial areas where space is not an issue."
        ]
    },
    {
        "word": "Proprietary Software",
        "type": [],
        "definition": [
            "Proprietary is an adjective that describes something owned by a specific company or individual.  In the computing world, proprietary is often used to describe software that is not open source or freely licensed.  Examples include operating systems, software programs, and file formats.\n1. Operating Systems\nProprietary operating systems cannot be modified by users or other companies.  For example, Windows and OS X are both proprietary OSes.  The Windows source code is owned by Microsoft and the OS X source code is owned by Apple.  Other companies can make programs that run on these operating systems, but they cannot modify the OS itself.  Linux and Android are not proprietary, which is why many different versions of these operating systems exist.\n2. Software Programs\nProprietary software programs are applications in which all rights are retained by the developer or publisher.  They are typically closed-source, meaning the developer does not provide the source code to anyone outside the company.  Proprietary programs are licensed to end users under specific terms defined by the developer or publisher.  These terms often restrict the usage, distribution, and modification of the software.  Most commercial software is proprietary because it gives the developer a competitive advantage.\n3. File Formats\nSome file types are saved in a proprietary file format that can only be recognized by a specific program.  These file types are typically created by proprietary software programs and are usually saved in a binary (rather than a text-based) format.  By storing data in a proprietary format, developers can ensure that files created with their software cannot be opened with other software programs.  Proprietary file types saved by software programs are also called native files."
        ]
    },
    {
        "word": "Protocol",
        "type": [],
        "definition": [
            "A protocol is a standard set of rules that allow electronic devices to communicate with each other.  These rules include what type of data may be transmitted, what commands are used to send and receive data, and how data transfers are confirmed.\nYou can think of a protocol as a spoken language.  Each language has its own rules and vocabulary.  If two people share the same language, they can communicate effectively.  Similarly, if two hardware devices support the same protocol, they can communicate with each other, regardless of the manufacturer or type of device.  For example, an Apple iPhone can send an email to an Android device using a standard mail protocol.  A Windows-based PC can load a webpage from a Unix-based web server using a standard web protocol.\nProtocols exist for several different applications.  Examples include wired networking (e.g., Ethernet), wireless networking (e.g.,  802.11ac), and Internet communication (e.g., IP).  The Internet protocol suite, which is used for transmitting data over the Internet, contains dozens of protocols.  These protocols may be broken up into four catagories:\n\nLink layer - PPP, DSL, Wi-Fi, etc.\nInternet layer - IPv4, IPv6, etc.\nTransport layer - TCP, UDP, etc.\nApplication layer - HTTP, IMAP, FTP, etc.\n\nLink layer protocols establish communication between devices at a hardware level.  In order to transmit data from one device to another, each device's hardware must support the same link layer protocol. Internet layer protocols are used to initiate data transfers and route them over the Internet.  Transport layer protocols define how packets are sent, received, and confirmed.  Application layer protocols contain commands for specific applications.  For example, a web browser uses HTTPS to securely download the contents of a webpage from a web server.  An email client uses SMTP to send email messages through a mail server.\nProtocols are a fundamental aspect of digital communication.  In most cases, protocols operate in the background, so it is not necessary for typical users to know how each protocol works.  Still, it may be helpful to familiarize yourself with some common protocols so you can better understand settings in software programs, such as web browsers and email clients."
        ]
    },
    {
        "word": "Proxy Server",
        "type": [],
        "definition": [
            "Most large businesses, organizations, and universities these days use a proxy server.  This is a server that all computers on the local network have to go through before accessing information on the Internet.  By using a proxy server, an organization can improve the network performance and filter what users connected to the network can access.\nA proxy server improves Internet access speeds from a network primarily by using a caching system.  Caching saves recently viewed Web sites, images, and files on a local hard drive so that they don't have to be downloaded from the Web again.  While your Web browser might save recently viewed items on your computer, a proxy server caches everything accessed from the network.  That means if Bob views a news story at cnn.com at 1:00 and Jill views the same page at 1:03, she'll most likely get the page straight from the proxy server's cache.  Though this means super-fast access to Web pages, it also means users might not be seeing the latest update of each Web page.\nThe other main purpose a proxy server is to filter what is allowed into the network.  While HTTP, FTP, and Secure protocols can all be filtered by a proxy server, HTTP is the most common.  The proxy server can limit what Web sites users on the network can access.  Many organizations choose to block access to sites with objectionable material such as hacking information and pornography, but other sites can be filtered as well.  If an employer notices workers are spending too much time at sites like eBay or Quicken.com, those sites can be blocked by the proxy server as well."
        ]
    },
    {
        "word": "Pseudocode",
        "type": [],
        "definition": [
            "Most software programs are developed using a programming language, like C++ or Java.  These languages have a specific syntax that must be adhered to when writing program's source code.  Pseudocode, on the other hand, is not a programming language, but simply an informal way of describing a program.  It does not require strict syntax, but instead serves as a general representation of a program's functions.\nSince each programming language uses a unique syntax structure, understanding the code of multiple languages can be difficult.  Pseudocode remedies this problem by using conventional syntax and basic english phrases that are universally understood.  For example, a line of PHP code may read:if ($i < 10) { i++; } \nThis could be written in pseudocode as:if i is less than 10, increment i by 1.\nBy describing a program in pseudocode, programmers of all types of languages can understand the function of a program.\nPseudocode is an informal language, so it is mainly used for creating an outline or a rough draft of a program.  Because it is not an actual programming language, pseudocode cannot be compiled into an executable program.  Therefore, pseudocode must be converted into a specific programming language if it is to become an usable application."
        ]
    },
    {
        "word": "Public Domain",
        "type": [],
        "definition": [
            "Public domain is a legal term that describes a work or product that is not protected by copyright.  The copyright protection an item in the public domain may have 1) expired, 2) been released by the author, or 3) never existed in the first place.  Public domain items are publicly available and can be freely accessed and redistributed.\nMany different items can be labeled as \"public domain.\"  For example, books, speeches, poems, artwork, songs, and videos can all be made freely available to the public.  In the computing world, \"public domain\" is often used to refer to software programs that are offered to the public without copyright restrictions.\nPublic domain software is similar to open source software, in which the source code of a program is made publicly available.  However, open source software, while freely distributed, still retains the original developer's copyright.  This means the developer can change the redistribution policy at any time.  Public domain software is also similar to freeware, which refers to software offered at no charge.  However, like open source software, freeware programs are still protected by copyright.  Therefore, users may not redistribute the software unless they receive permission from the original developer.\nSince there are many similarities between freeware, open source, and public domain software, the terms are often used interchangeably.  However, there are important legal differences between the licenses, so it is important for developers to choose the correct license when releasing software programs.  Public domain software, which offers the least legal protection, is most often published by individuals or educational institutions, rather than companies.  When software is offered as public domain, it is often labeled \"PD\" or may include a Public Domain Mark (PDM)."
        ]
    },
    {
        "word": "Push",
        "type": [],
        "definition": [
            "Push refers to a system in which data is \"pushed\" to a user's device rather than \"pulled\" by the user.  In other words, the data transfer is initiated by the server rather than the client.\nPush technology, which is also called \"server push,\" can be used to send news data, stock updates, and other information from the Internet to a user's computer.  It is also used to send text messages via SMS to people's cell phones.  Push e-mail allows users to receive e-mail messages without having to check their e-mail manually.  This means new messages appear on the client's device as soon as they are received by the server.  However, in order to receive pushed messages, both the mail server and the user's e-mail client must support push technology.\nWhile most information is still \"pulled\" from the Internet, more kinds of data can now be pushed to users' systems.  With push technology, people no longer need to constantly check news sites, e-mail, or other data sources to see if they have been updated.  The result is a more efficient means of receiving information.  If only we could go back in time and tell the playground bully, \"Don't push me, push your e-mail.\"  That would show him."
        ]
    },
    {
        "word": "Python",
        "type": [],
        "definition": [
            "Python is a high-level programming language designed to be easy to read and simple to implement.  It is open source, which means it is free to use, even for commercial applications.  Python can run on Mac, Windows, and Unix systems and has also been ported to Java and .NET virtual machines.\nPython is considered a scripting language, like Ruby or Perl and is often used for creating Web applications and dynamic Web content.  It is also supported by a number of 2D and 3D imaging programs, enabling users to create custom plug-ins and extensions with Python.  Examples of applications that support a Python API include GIMP, Inkscape, Blender, and Autodesk Maya.\nScripts written in Python (.PY files) can be parsed and run immediately.  They can also be saved as a compiled programs (.PYC files), which are often used as programming modules that can be referenced by other Python programs."
        ]
    }
]