[
    {
        "word": "QBE",
        "type": [],
        "definition": [
            "Stands for \"Query By Example.\"  QBE is a feature included with various database applications that provides a user-friendly method of running database queries.  Typically without QBE, a user must write input commands using correct SQL (Structured Query Language) syntax.  This is a standard language that nearly all database programs support.  However, if the syntax is slightly incorrect the query may return the wrong results or may not run at all.\nThe Query By Example feature provides a simple interface for a user to enter queries.  Instead of writing an entire SQL command, the user can just fill in blanks or select items to define the query she wants to perform.  For example, a user may want to select an entry from a table called \"Table1\" with an ID of 123.  Using SQL, the user would need to input the command, \"SELECT * FROM Table1 WHERE ID = 123\".  The QBE interface may allow the user to just click on Table1, type in \"123\" in the ID field and click \"Search.\"\nQBE is offered with most database programs, though the interface is often different between applications.  For example, Microsoft Access has a QBE interface known as \"Query Design View\" that is completely graphical.  The phpMyAdmin application used with MySQL, offers a Web-based interface where users can select a query operator and fill in blanks with search terms.  Whatever QBE implementation is provided with a program, the purpose is the same – to make it easier to run database queries and to avoid the frustrations of SQL errors."
        ]
    },
    {
        "word": "QR Code",
        "type": [],
        "definition": [
            "A QR code (short for \"quick response\" code) is a type of barcode that contains a matrix of dots.  It can be scanned using a QR scanner or a smartphone with built-in camera.  Once scanned, software on the device converts the dots within the code into numbers or a string of characters.  For example, scanning a QR code with your phone might open a URL in your phone's web browser.\nAll QR codes have a square shape and include three square outlines in the bottom-left, top-left, and top-right corners.  These square outlines define the orientation of the code.  The dots within the QR code contain format and version information as well as the content itself.  QR codes also include a certain level of error correction, defined as L, M, Q, or H.  A low amount of error correction (L) allows the QR code to contain more content, while higher error correction (H) makes the code easier to scan.\nQR codes have two significant benefits over traditional UPCs – the barcodes commonly used in retail packaging.  First, since QR codes are two-dimensional, they can contain significantly more data than a one-dimensional UPC.  While a UPC may include up to 25 different characters, a 33x33 (version 4) QR code, can contain 640 bits or 114 alphanumeric characters.  A 177x177 (version 40) QR code can store up to 23,648 bits or 4,296 characters.\nAnother advantage of QR codes is that they can be scanned from a screen.  Standard UPC scanners use a laser to scan barcodes, which means they typically cannot scan a UPC from a screen (like a smartphone).  QR scanners, however, are designed to capture 2D images printed on paper or displayed on a screen.  This makes it possible to use a QR code on your smartphone as a boarding pass at the airport or as a ticket for an event."
        ]
    },
    {
        "word": "QWERTY",
        "type": [],
        "definition": [
            "QWERTY (pronounced \"quirty\") is an adjective used to describe standard Western (or Latin-based) keyboards.   If you look at your keyboard, and the first six letters under the numbers are Q-W-E-R-T-Y, then you have a QWERTY keyboard.\nNearly all keyboards used in the western hemisphere have a QWERTY layout.  Some countries use slightly modified versions, such as the Swedish keyboard, which includes the letters Å, Ä, and Ö and the Spanish keyboard, which contains the letters Ñ and Ç.  But these keyboards still have the QWERTY characters in the upper-left corner.\nHistory\nThe original QWERTY keyboard layout was developed over 150 years ago by Christopher Latham Sholes.  It was popularized by the Sholes and Glidden typewriter, which was initially produced in 1867.  Remington bought the rights to the typewriter and made some slight changes before mass-producing an updated version in 1974.\nThe goal of the QWERTY layout is to make the most common keys the most easily accessible (which is why Q is in the corner).  By placing the vowels closely together, it also helped prevent typewriters from jamming when typing quickly.\nThe only significant competitor to the QWERTY keyboard came 1932, when August Dvorak developed a new layout.  His design placed all the vowels and the five most common consonants in the middle row.  The goal was twofold: 1) to make the most common keys even easier to type and 2) to create an alternating rhythm between the left and right hands.\nWhile the Dvorak keyboard may have been technically more efficient, even in the early 1900s, people were not willing to learn a new keyboard layout.  The result is that the QWERTY layout has survived for over one and a half centuries.  It can be found in typewriters, desktop computers, laptops, and the touchscreen devices we use today."
        ]
    },
    {
        "word": "Quad-Core",
        "type": [],
        "definition": [
            "A quad-core CPU has four processing cores in a single chip.  It is similar to a dual-core CPU, but has four separate processors (rather than two), which can process instructions at the same time.\nQuad-core CPUs have become more popular in recent years as the clock speeds of processors have plateaued.  By including multiple cores in a single CPU, chip manufacturers can generate higher performance without boosting the clock speed.  However, the performance gain can only be realized if the computer's software supports multiprocessing.  This allows the software to split the processing load between multiple processors (or \"cores\") instead of only using one processor at a time.  Fortunately, most modern operating systems and many programs provide support for multiprocessing.\nSome examples of quad-core CPUs include the Intel Core 2 Quad, Intel Nehalem, and AMD Phenom X4 processors.  The Intel processors are used in Mac, Windows, and Linux systems, while the AMD processors are only used in Windows and Linux systems.  While four cores may seems impressive, some high end computers have two quad-core CPUs, giving them a total of eight processing cores.  Now that is some core power!"
        ]
    },
    {
        "word": "Quantization",
        "type": [],
        "definition": [
            "Quantization is the process of mapping input to a fixed set of values.  For example, an application may include a quantizing function that rounds a series of floating point numbers to the nearest integer.  The result is a reduced data set that contains only integers.\nQuantizing data provides a discrete set of values that, while estimated, can be more easily processed.  For example, rounding numbers to the nearest thousand may be useful when charting population data.  Constraining RGB values to a limited range may provide color consistency when publishing a website.\nAudio Production\nQuantization is common in digital audio production, but it can refer to several different things.  Examples include 1) pitch quantization, 2) sample quantization, and 3) MIDI quantization.\n1. Pitch Quantization\nSome instruments, like the piano and harpsichord, have discrete notes.  Other instruments, like the trombone and guitar, have an infinite range of pitches.  Quantizing guitar input may help match the tone of a piano or other instruments within an audio mix.\nAuto-tune, a type of pitch quantization commonly applied to vocal recordings, provides customizable settings for modifying pitch.  A gradual setting produces smooth, natural-sounding pitch adjustments.  A faster setting results in a more robotic-sounding effect.\n2. Sample Quantization\nSampling is the process of converting an analog audio signal to a digital format.  Because analog audio has an infinite range of frequencies, converting it to digital data requires quantizing the values to a fixed range.  The sample rate determines the number of times the signal is sampled, or quantized, each second.  Standard sample rates include 44.1 kHz and 96 kHz (96,000 times per second).\n3. MIDI Quantization\nA MIDI recording does not contain audio data, but instead stores information about each note played during the recording process.  It includes which note was pressed, when it was pressed, how hard it was pressed (the velocity), and when it was released.\nWhile a MIDI recording already contains discrete data, it is possible to quantize the timing of each note.  For example, after recording a drum loop with a digital keyboard, it is common to quantize the data to the nearest 16th, 8th, or even quarter note.  Shifting the bass and snare drum notes to exact timings creates a more consistent beat.\nNOTE: Quantizing audio and MIDI data can help clean up minor errors and inconsistencies in a recording.  However, it can also make a recording sound artificial since human recordings are not perfect.  Therefore, auto-tune is applied sparingly to professional recordings, and MIDI quantization is best-suited for electronic music."
        ]
    },
    {
        "word": "Query",
        "type": [],
        "definition": [
            "Query is another word for question.  In fact, outside of computing terminology, the words \"query\" and \"question\" can be used interchangeably.  For example, if you need additional information from someone, you might say, \"I have a query for you.\"  In computing, queries are also used to retrieve information.  However, computer queries are sent to a computer system and are processed by a software program rather than a person.\nOne type of query, which many people perform multiple times a day, is a search query.  Each time you search for something using a search engine, you perform a search query.  When you press Enter, the keywords are sent to the search engine and are processed using an algorithm that retrieves related results from the search index.  The results of your query appear on a search engine results page, or SERP.\nAnother common type of query is a database query.  Databases store data in a structured format, which can be accessed using queries.  In fact, the structured query language (SQL) was designed specifically for this purpose.  Users can create SQL queries that retrieve specific information from a database.  For example, an human resources manager may perform a query on an employee database that selects all employees in a specific department that were hired between 11 and 12 months ago.  The results might be used to provide the department head with current candidates for an annual review.\nWhile you may not always notice them, computer queries are happening all the time.  For instance, most dynamic websites query a database each time you visit a new page.  Software applications often contain background functions that perform queries based on your input.  While many types of computer queries exist, their basic purpose is the same — to receive an answer to a question.\nNOTE: The word \"query\" can be used as either noun or a verb.  For example, you can \"perform a search query\" or \"query a database.\"  Both examples are correct uses of the word \"query.\""
        ]
    },
    {
        "word": "Queue",
        "type": [],
        "definition": [
            "To avoid any confusion, this term is pronounced exactly like the letter \"Q\".  It is not pronounced \"kay\" or \"kyoo-ee\" like some people seem to think it is.  A queue is a list of jobs that are awaiting to be processed.  When a job is sent to a queue, it is simply added to the list of jobs.  Computer programs often work with queues as a way to order tasks.  For example, when the CPU finishes one computation, it will process the next one in the queue.\nA printer queue is a list of documents that are waiting to be printed.  When you decide to print a document, it is sent to the printer queue.  If there are no jobs currently in the queue, the document will be printed immediately.  However, if there are jobs already in the queue, the new document will be added to the list and printed when the others have finished.  Most printers today come with software that allows you to manually sort, cancel, and add jobs to the printer queue.  While this may not seem like a great benefit for the typical home user, it can be a helpful tool for businesses where many people share one printer."
        ]
    },
    {
        "word": "QuickTime",
        "type": [],
        "definition": [
            "QuickTime is a multimedia framework developed by Apple.  It supports playback of several common audio and video formats, including Apple's proprietary .MOV format.\nThe QuickTime framework includes two fundamental aspects — QuickTime Player and QuickTime developer tools, also known as \"QTKit.\"  QuickTime Player is an application used for opening and playing videos and audio files.  QTKit is an API that developers can use to process multimedia formats within a program.  Examples include creating, saving, and converting media files.  The API also provides developers with access to prebuilt media controls.\nQuickTime Kit was deprecated in 2013 with the release of OS X 10.9 Mavericks. Apple recommends developers use the newer AVFoundation and AVKit frameworks instead.\nHistory\nApple released the first version of QuickTime in 1991.  For over two decades, it was the standard media technology used in macOS, including OS X.  During this time, Apple released several versions of QuickTime Player, through version 7.x.  In 1998, Apple released a \"Pro\" version as a paid upgrade.  QuickTime Player Pro provided more editing features and additional file format support than the free version.\nIn 2009, Apple released Mac OS X 10.6 Snow Leopard, which included a new version of QuickTime called QuickTime X.  This modernized version of QuickTime Player was bundled with macOS through version 10.14 Mojave, released in 2018.  Apple did not release QuickTime X for Windows, but did offer several versions of QuickTime Player for Windows, through version 7.7.9.  Apple discontinued support for the Windows version of QuickTime Player in early 2016.\nFile extensions: .MOV, .QT, .MP4"
        ]
    }
]