[
    {
        "word": "RADCAB",
        "type": [],
        "definition": [
            "RADCAB is a mnemonic acronym that helps people evaluate information found online.  It was created by Karen Christensson, a library media specialist, for helping students research topics on the Web.  However, the acronym can be used by anyone who needs to look up information online.\nEach letter of RADCAB represents a means of evaluating information:\n\nRelevancy - Is the information relevant to my topic or research question?\nAppropriateness - Is the information appropriate to my age and values?\nDetail - Does the information contain enough detail for the subject I am researching?\nCurrency - How recently was the information written or published?\nAuthority - Who is the author and what are his or her credentials?\nBias - Is the information written only to inform or is it meant to be persuasive?\n\nTo learn more about RADCAB and its many uses, visit RADCAB.com."
        ]
    },
    {
        "word": "RAID",
        "type": [],
        "definition": [
            "Stands for \"Redundant Array of Independent Disks.\"  RAID is a method of storing data on multiple hard disks.  When disks are arranged in a RAID configuration, the computer sees them all as one large disk.  However, they operate much more efficiently than a single hard drive.  Since the data is spread out over multiple disks, the reading and writing operations can take place on multiple disks at once.  This can speed up hard drive access time significantly.  Multiple hard drives may not improve hard disk performace as much as multiple processors may enhance the CPU performance, but it is based on a similar logic.\nThe benefits of RAID come from a technique called \"striping,\" which splits up the stored data among the available drives.  The \"stripes\" of data are usually a couple of megabytes large and are interleaved between the drives.  The striping system also increases the mean time between failure (MTBF), when reading data.  This allows more data to be read accurately in a short period of time.  The benefits of the RAID system are especially noticeable when storing large amounts of data.  Therefore, many Web hosting and Internet Service Providers use RAID to store data for their clients."
        ]
    },
    {
        "word": "RAM",
        "type": [],
        "definition": [
            "Stands for \"Random Access Memory\" and is pronounced \"ram.\"  RAM is a common hardware component found in electronic devices, including desktop computers, laptops, tablets, and smartphones.  In computers, RAM may be installed as memory modules, such as DIMMs or (SO-DIMMs\nsodimm).  In tablets and smartphones, RAM is typically integrated into the device and cannot be removed.\nThe amount of RAM in a device determines how much memory the operating system and open applications can use.  When a device has sufficient RAM, several programs can run simultaneously without any slowdown.  When a device uses close to 100% of the available RAM, memory must be swapped between applications, which may cause a noticeable slowdown.  Therefore, adding RAM or buying a device with more RAM is one of the best ways to improve performance.\n\"RAM\" and \"memory\" may be used interchangeably.  For example, a computer with 16 GB of RAM has 16 gigabytes of memory.  This is different than storage capacity, which refers to how much disk space the device's HDD or SSD provides for storing files.\nSystem memory is considered \"volatile\" memory since it only stores data while a device is turned on.  When the device is powered down, data stored in the RAM is erased.  When the device is restarted, the operating system and applications load fresh data into the system memory.  This is why restarting a computer often fixes problems."
        ]
    },
    {
        "word": "RDBMS",
        "type": [],
        "definition": [
            "Stands for \"Relational Database Management System.\"  An RDBMS is a DBMS designed specifically for relational databases.  Therefore, RDBMSes are a subset of DBMSes.\nA relational database refers to a database that stores data in a structured format, using rows and columns.  This makes it easy to locate and access specific values within the database.  It is \"relational\" because the values within each table are related to each other.  Tables may also be related to other tables.  The relational structure makes it possible to run queries across multiple tables at once.\nWhile a relational database describes the type of database an RDMBS manages, the RDBMS refers to the database program itself.  It is the software that executes queries on the data, including adding, updating, and searching for values.  An RDBMS may also provide a visual representation of the data.  For example, it may display data in a tables like a spreadsheet, allowing you to view and even edit individual values in the table.  Some RDMBS programs allow you to create forms that can streamline entering, editing, and deleting data.\nMost well known DBMS applications fall into the RDBMS category.  Examples include Oracle Database, MySQL, Microsoft SQL Server, and IBM DB2.  Some of these programs support non-relational databases, but they are primarily used for relational database management.\nExamples of non-relational databases include Apache HBase, IBM Domino, and Oracle NoSQL Database.  These type of databases are managed by other DMBS programs that support NoSQL, which do not fall into the RDBMS category."
        ]
    },
    {
        "word": "RDF",
        "type": [],
        "definition": [
            "Stands for \"Resource Description Framework.\"  RDF is a specification that defines how metadata, or descriptive information, should be formatted.  The RDF model uses a subject-predicate-object format, which is a standardized way of describing something.  For example, an RDF expression may read, \"The computer has a hard drive that stores 250GB.\"  \"The computer\" is the subject, \"has a hard drive that stores\" is the predicate, and \"250GB\" is the object.\nRDF formatting is used in RSS feeds, which contain short descriptions of Web pages.  The RDF standard helps ensure each description contains the subject, predicate, and object necessary to describe the page's content.  While humans do not require descriptions to be formatted in such a specific way (we would actually find it rather monotonous), computers benefit from the standard formatting.  For example, it makes it easier for computer systems to sort and index RSS feeds based on the RDF descriptions.  The end result is more accurate results when people search for articles using keywords."
        ]
    },
    {
        "word": "RDRAM",
        "type": [],
        "definition": [
            "Stands for \"Rambus Dynamic Random Access Memory.\"  It is a type of RAM made by Rambus (big surprise) and is the fastest type of computer memory available.  Typical SDRAM can transfer data at speeds up to 133 MHz, while standard RDRAM can crank it up over 1 GHz.  Though some motherboards can use RDRAM as system memory, it is so fast, most boards cannot fully benefit from the speed.  Because of this, RDRAM is typically used for video memory on graphics acclerator cards, for cache memory (located on the CPU), and for system memory in high-performance workstations and servers.\nAn improvement to RDRAM called Direct Rambus (DRDRAM) allows for even faster data transfer rates.  DRDRAM uses a 16-bit bus rather than the 8-bit bus DRAM uses, which means it can handle 8 operations at once and can transfer data at a speeds of 1.6 GHz.  Now that's fast."
        ]
    },
    {
        "word": "REST",
        "type": [],
        "definition": [
            "Stands for \"Representational State Transfer.\"  REST is a defined set of standards for transferring resources over the web.  The REST method is commonly applied to APIs (\"REST APIs\"), which allow developers to access data from remote systems over the Internet.\nREST defines six architectural constraints:\n\nClient-server model – a server processes client requests, and clients can only access required data from the server\nStateless – requests are transient and no client data is stored on the server\nCachable – requests can be cached to improve performance\nUniform interface – access to data must be consistent for all users and systems\nLayered system support – requests can be processed hierarchically and routed across mulitple systems\nCode on demand (optional) – servers can deliver executable code to client systems\n\nREST vs. SOAP\nREST is often contrasted with SOAP, another set of standards for transferring data over the Internet.  However, REST is simply a design style, while SOAP is an actual protocol with specific rules and commands.  Both REST and SOAP APIs transmit data over HTTP, but SOAP is limited to XML data, while REST is more flexible.\nBecause SOAP is an official protocol, all messages sent via SOAP must use the same \"envelope\" format, with a header and body.  REST, which came after SOAP, has fewer constraints and is often considered a lightweight alternative to SOAP.\nNOTE: APIs that conform to REST guidelines are technically called \"RESTful APIs,\" but many developers refer to them as \"REST APIs\" instead."
        ]
    },
    {
        "word": "RFID",
        "type": [],
        "definition": [
            "Stands for \"Radio-Frequency Identification.\"  RFID is a system used to track objects, people, or animals using tags that respond to radio waves.  RFID tags are integrated circuits that include a small antenna.  The are typically small enough that they are not easily noticeable and therefore can be placed on many types of objects.\nLike UPC labels, RFID tags are often used to uniquely identify the object they are attached to.  However, unlike UPCs, RFID tags don't need to be scanned directly with a laser scanner.  Instead, they can be recorded by simply placing the tag within the range of an RFID radio transmitter.  This makes it possible to quickly scan several items or to locate a specific product surrounded by many other items.\nRFID tags have many different uses.  Some examples include:\n\nMerchandise tags - These tags are attached to clothing, electronics, and other products to prevent theft from retail stores.  These tags are typically deactivated at the place of checkout.  Tags that have not been deactivated will sound the alarm system near the store's exit.\nInventory management - Products stored in warehouses may be given RFID tags so they can be located more easily.\nAirplane luggage - RFID tags may be placed on checked bags so they can be easily tracked and located.\nToll booth passes - E-ZPass and I-Pass receivers may be placed in automobiles, allowing cars and trucks to pass through toll booths without needing to stop.  This enables drivers to make toll payments automatically.\nCredit cards - Some credit cards have built-in RFIDs so they can be \"waved\" rather than \"swiped\" near compatible readers.  The SpeedPass wand is an example of an RFID-only payment device.\nAnimal tags - RFID tags can be placed pet collars to make help identify pets if they are lost.  Tags may also be placed on birds and other animals to help track them for research purposes.\n\nThe above list includes just a few of the applications of radio-frequency identification.  There are many other existing and potential applications for RFID tags as well."
        ]
    },
    {
        "word": "RGB",
        "type": [],
        "definition": [
            "Stands for \"Red Green Blue.\"  RGB refers to three hues of light that can be mixed together to create different colors.  Combining red, green, and blue light is the standard method of producing color images on screens, such as TVs, computer monitors, and smartphone screens.\nThe RGB color model is an \"additive\" model.  When 100% of each color is mixed together, it creates white light.  When 0% of each color is combined, no light is generated, creating black.  It is sometimes contrasted with CMYK (cyan, yellow, magenta, and black), the standard color palette used to create printed images.  CMYK is a \"subtractive\" color model since the colors get darker as they are combined.  Blending 100% of each color in the CMYK color model produces black, while 0% of each color results in white.\nHow many colors can be created using RGB?\nThe number of colors supported by RGB depends on how many possible values can be used for red, green, and blue.  This is known as \"color depth\" and is measured in bits.  The most common color depth is 24-bit color, also known as \"true color.\"  It supports eight bits for each of the three colors, or 24 bits total.  This provides 28, or 256 possible values for red, green, and blue.  256 x 256 x 256 = 16,777,216 total possible colors in the \"true color\" palette.\nThe human eye can only distinguish about seven million colors, so color depths above 24-bit are rarely used.\nRGB Example\nWhen displaying a color image on a screen, each pixel has a specific RGB value.  In 24-bit color, this value is between 0 and 255, where 0 is no color and 255 is full saturation).  A purple pixel will have a lot of red and blue, but little to no green.  For example, the following RGB value might be used to create purple:\nR: 132 &nbsp; (84 in hexadecimal)\nG: 17 &nbsp; (11 in hexadecimal)\nB: 170 &nbsp; (AA in hexadecimal)\nSince each color has 256 possible values, it can also be represented using two hexadecimal values (16 x 16), as shown above.  The standard way to display an RGB value is to use the hexadecimal values for red, green, and blue, preceded by a number symbol, or hashtag.  Therefore, the purple color above is defined in RGB as #8411AA."
        ]
    },
    {
        "word": "RIP",
        "type": [],
        "definition": [
            "Stands for \"Routing Information Protocol.\"  RIP is a protocol used by routers to exchange routing information on a network.  Its primary functions are to 1) determine the most efficient way to route data on a network and 2) prevent routing loops.\nRIP maintains a routing table, which lists all routers reachable within a network.  Each router uses this table to determine the most efficient way to route data.  RIP incorporates distance-vector routing, which calculates the best path based on the direction and distance between routers.  Each packet is forwarded to the appropriate routers until the packet reaches its destination.\nRIP also prevents endless routing loops by limiting the number of \"hops\" between the source and destination.  A hop is recorded each time a packet is forwarded from one router to another.  The maximum number of hops allowed by RIP is 15.  If the hop count hits 16, RIP determines the destination is not reachable and the transfer is terminated.\nThree different versions of RIP exist:\n\nRIPv1 - standardized in 1988; uses \"classful\" routing, which defines an IP class, but does not include subnet information\nRIPv2 - developed in 1993 and standardized in 1998; uses \"classless\" routing and carries subnet information; supports MD5 authentication\nRIPng - standardized in 1997; an extension of RIPv2 that supports IPv6\n\nNOTE: Most modern networks use newer routing methods, such as OSPF (Open Shortest Path First), rather than RIP to route data."
        ]
    },
    {
        "word": "RISC",
        "type": [],
        "definition": [
            "Stands for \"Reduced Instruction Set Computing\" and is pronounced \"risk.\"  RISC is a type of processor architecture that uses fewer and simpler instructions than a complex instruction set computing (CISC) processor.  RISC processors perform complex instructions by combining several simpler ones.\nSeveral CPUs in the 1990s and early 2000s used RISC architecture.  One of the most popular was the IBM PowerPC processor, which Apple used in its PowerMac line of computers for nearly a decade.  In 2006, Apple switched to CISC-based Intel CPUs.  Nearly all personal computers now use CISC processors made by Intel or AMD.\nRISC vs CISC\n\nRISC processors require fewer cycles per second than CISC processors.  A RISC processor may complete more operations per second than a CISC processor running at the same clock speed.\nRISC processors simplify pipelining (performing multiple instructions at once) compared to CISC processors.  Smaller instructions are easier to synchronize or \"pipeline\" than larger ones.\nSince RISC processors store fewer instructions than their CISC counterparts, less transistors are required to store instructions.  Therefore, RISC processors can use more transistors to store memory.\n\nCPU transistors are now a fraction of the size they were two decades ago, so storing fewer instructions is less advantageous.  Since modern computers perform a wide array of complex instructions, CISC processors typically provide better overall performance than RISC alternatives.\n"
        ]
    },
    {
        "word": "RJ45",
        "type": [],
        "definition": [
            "RJ45 is a type of connector commonly used for Ethernet networking.  It looks similar to a telephone jack, but is slightly wider.  Since Ethernet cables have an RJ45 connector on each end, Ethernet cables are sometimes also called RJ45 cables.\nThe \"RJ\" in RJ45 stands for \"registered jack,\" since it is a standardized networking interface.  The \"45\" simply refers to the number of the interface standard.  Each RJ45 connector has eight pins, which means an RJ45 cable contains eight separate wires.  If you look closely at the end of an Ethernet cable, you can actually see the eight wires, which are each a different color.  Four of them are solid colors, while the other four are striped.\nRJ45 cables can be wired in two different ways.  One version is called T-568A and the other is T-568B.  These wiring standards are listed below:\n\n\n\nT-568A\n\n\nWhite\/Green (Receive +)\nGreen (Receive -)\nWhite\/Orange (Transmit +)\nBlue\nWhite\/Blue\nOrange (Transmit -)\nWhite\/Brown\nBrown\n\n\n\nT-568B\n\n\nWhite\/Orange (Transmit +)\nOrange (Transmit -) \nWhite\/Green (Receive +)\nBlue\nWhite\/Blue\nGreen (Receive -)\nWhite\/Brown\nBrown\n\n\n\n\nThe T-568B wiring scheme is by far the most common, though many devices support the T-568A wiring scheme as well.  Some networking applications require a crossover Ethernet cable, which has a T-568A connector on one end and a T-568B connector on the other.  This type of cable is typically used for direct computer-to-computer connections when there is no router, hub, or switch available."
        ]
    },
    {
        "word": "ROM",
        "type": [],
        "definition": [
            "Stands for \"Read-Only Memory.\"  Please do not confuse this term with RAM or a hard drive, as many people already do.  ROM is memory containing hardwired instructions that the computer uses when it boots up, before the system software loads.  In PCs, the instructions are read from a small program in the ROM, called the BIOS (Basic Input\/Output System)."
        ]
    },
    {
        "word": "RPC",
        "type": [],
        "definition": [
            "Stands for \"Remote Procedure Call.\"  Most computer programs run procedures, or sets of instructions, using the computer's CPU.  In other words, the instructions are processed locally on the same computer that the software is running from.  Remote procedure calls, however, run procedures on other machines or devices connected to a network.  Once the instructions have been run, the results of the procedure are usually returned to the local computer.\nFor example, a computer without a hard drive may use an RPC to access data from a network file system (NFS).  When printing to a network printer, a computer might use an RPC to tell the printer what documents to print.  A client system connected to a database server may execute an RPC to process data on the server.\nRemote procedure calls are based on the client-server model, where multiple client computers may connect to a server and retrieve data from it.  RPCs are typically written in a standard format, such as XML, so that the procedures can be understood by multiple computer platforms.  For example, an XML-RPC sent by a Windows computer could be recognized by a Macintosh or Unix-based system."
        ]
    },
    {
        "word": "RPM",
        "type": [],
        "definition": [
            "Stands for \"Revenue Per Mille.\"  The word \"mille\" means \"one thousand\" in Latin, so RPM is short for \"Revenue Per 1,000 Impressions\" in online advertising.  It is similar to CPM, but measures the revenue from 1,000 ad impressions instead of the cost of the ads.  Advertisers typically focus on CPM, while publishers monitor RPM.\nRPM is calculated from ad impressions and overall revenue.  For example, a website that gets 20,000 page views per day and generates $300 in daily ad revenue has a page RPM of $15.00.\n$300 revenue \/ 20,000 page views x 1,000 = $15.00 RPM\nIf a website gets 10,000 page views each day and the page RPM is $5.00, the website will produce $50\/day of advertising revenue.\n10,000 page views x ($5.00 \/ 1,000 RPM) = $50 revenue\nPage RPM vs Impression RPM\nTwo specific types of RPM are \"Page RPM\" and \"Impression RPM.\"  The above examples use page RPM since they are based on page views.  Impression RPM, or ad unit RPM, measures the revenue per 1,000 impressions of a specific ad unit.  If a webpage only has one banner ad, the page RPM and impression RPM will be identical.  If a page has more than one ad unit (which is often the case), the individual ads will typically have lower impression RPMs than the page RPM.  If certain ads have low RPMs, a publisher may replace or remove them with the goal of generating higher page RPMs.\nPage RPM vs eCPM\nIn some cases, RPM and CPM are used interchangeably.  While CPM means \"Cost Per 1,000 Impressions,\" some advertising platforms use CPM in publisher reports instead of RPM.  Specifically, the metric \"eCPM\" or \"effective CPM\" is sometimes used in place of \"page RPM.\"  While \"page RPM\" is more accurate, \"eCPM\" in a publisher advertising report means the same thing.\nRevolutions Per Minute\nOutside of advertising, RPM typically stands for \"Revolutions Per Minute.\"  In hardware specifications, RPM may refer to fan speed or hard drive rotational speed.  Faster HDD speeds provide lower seek times, which translate to faster data access.  The standard rotational speed of a 3.5\" hard drive in a desktop computer is 7,200 RPM, while portable hard drives often run at 5,400 RPM.  High-end server HDDs run at 10,000 or even 15,000 RPM."
        ]
    },
    {
        "word": "RSS",
        "type": [],
        "definition": [
            "Stands for \"RDF Site Summary,\" but is commonly referred to as \"Really Simple Syndication.\"  RSS is method of providing website content such as news stories or software updates in a standard XML format.  Websites such as The Wall Street Journal and CNET provide news stories to various RSS directories that distribute them over the Internet.  RSS content can be accessed with an RSS-enabled Web browser or other programs designed for retrieving RSS feeds."
        ]
    },
    {
        "word": "RTE",
        "type": [],
        "definition": [
            "Stands for \"Runtime Environment.\"  As soon as a software program is executed, it is in a runtime state.  In this state, the program can send instructions to the computer's processor and access the computer's memory (RAM) and other system resources.\nWhen software developers write programs, they need to test them in the runtime environment.  Therefore, software development programs often include an RTE component that allows the programmer to test the program while it is running.  This allows the program to be run in an environment where the programmer can track the instructions being processed by the program and debug any errors that may arise.  If the program crashes, the RTE software keeps running and may provide important information about why the program crashed.  When you see the name of a software program with the initials \"RTE\" after it, it usually means the software includes a runtime environment.\nWhile developers use RTE software to build programs, RTE programs are available to everyday computer users as well.  Software such as Adobe Flash Player and Microsoft PowerPoint Viewer allow Flash movies and PowerPoint presentations to be run within the player software.  These programs provide a runtime environment for their respective file formats.  The most common type of RTE, however, is the Java RTE (or JRE), which allows Java applets and applications to be run on any computer with JRE installed."
        ]
    },
    {
        "word": "RTF",
        "type": [],
        "definition": [
            "Stands for \"Rich Text Format.\"  RTF is a file format standardized by Microsoft for creating formatted text files.  Unlike a basic text file, an RTF file can include information such as text style, size, and color.  The nice thing about the RTF format is that it is a universal format, meaning it can be read by nearly all word processors.\nFile extension: .RTF"
        ]
    },
    {
        "word": "RTMP",
        "type": [],
        "definition": [
            "Stands for \"Real-Time Messaging Protocol.\"  RTMP is a protocol designed for transmitting audio and video over the Internet.  It is used to stream multimedia content on demand and also supports live streaming.\nStreaming over RTMP requires a media server, such as Adobe Media Server (AMS).  Clients connect to the streaming server over TCP, typically using port 1935.  RTMP stream URLs typically use a format such as:\nrtmp:\/\/stream.domain.com\/livestream\nMost web browsers do not recognize the rtmp:\/\/ prefix.  Instead, streamers can publish an RTMP URL (provided by a media server) to a streaming service that accepts RTMP input.  Examples include Vimeo, YouTube Live, or Facebook Live.  The service then broadcasts the stream via the corresponding website or app.\nHistory\nMacromedia created RTMP.  Adobe acquired Macromedia in 2005, including the rights to RTMP, which was part of the Flash technology platform.  While RTMP can stream Flash formats (such as .SWF, .FLV, and .F4V), it supports many other types of audio\/video transmissions as well.\nSince the use of Flash has decreased, RTMP has become more commonly used to stream standard compressed video audio and video rather than Flash media.  Adobe has also made RTMP an open specification, which can be used by third-party applications.  Examples include Nimble Streamer, Open Broadcaster Software, and Wowza Streaming Engine.\nNOTE: As of 2020, sales and support for Adobe Media Server, Flash Media Live Encoder, and the RTMP SDK are provided by Veriskope rather than Adobe."
        ]
    },
    {
        "word": "RUP",
        "type": [],
        "definition": [
            "Stands for \"Rational Unified Process.\"  RUP is a software development process from Rational, a division of IBM.  It divides the development process into four distinct phases that each involve business modeling, analysis and design, implementation, testing, and deployment.  The four phases are:\n\nInception - The idea for the project is stated.  The development team determines if the project is worth pursuing and what resources will be needed.\n\nElaboration - The project's architecture and required resources are further evaluated.  Developers consider possible applications of the software and costs associated with the development.\n\nConstruction - The project is developed and completed.  The software is designed, written, and tested.\n\nTransition - The software is released to the public.  Final adjustments or updates are made based on feedback from end users.\n\n\nThe RUP development methodology provides a structured way for companies to envision create software programs.  Since it provides a specific plan for each step of the development process, it helps prevent resources from being wasted and reduces unexpected development costs.\nVisit the Agile Modeling website for a detailed and graphical explanation of RUP."
        ]
    },
    {
        "word": "Race Condition",
        "type": [],
        "definition": [
            "A race condition occurs when a software program depends on the timing of one or more processes to function correctly.   If a thread runs or finishes at an unexpected time, it may cause unpredictable behavior, such as incorrect output or a program deadlock.\nMost software programs are multithreaded, meaning they can process several threads at once.  A well-programmed application will ensure the results of each thread are processed in the expected order.  If a program relies on threads that run in an unpredictable sequence, a race condition may occur.\nA simple example is a logic gate that handles boolean values.  The AND logic gate has two inputs and one output.  If inputs A and B are true, the AND gate produces TRUE.  If one or both inputs are false, it produces FALSE.  A race condition may happen if a program checks the logic gate result before variables A and B are loaded.  The correct process would be:\n\nLoad variable A\nLoad variable B\nCheck result of the AND logic gate\n\nAn incorrect sequence would be:\n\nLoad variable A\nCheck result of the AND logic gate\nLoad variable B\n\nThe result of the second example above may or may not be the same as the first example.  For instance, variable B may be FALSE before and after it is loaded, which would not change the result.  If A is FALSE, it does not matter whether or not B is TRUE or FALSE.  However, if both A and B are true, the result should be TRUE.  Loading variable B after checking the result of the logic gate would produce an incorrect result of FALSE.\nThe inconsistent output produced by race conditions may cause bugs that are difficult to detect.  Programmers can avoid these issues by ensuring threads are processed in a consistent sequence."
        ]
    },
    {
        "word": "Ransomware",
        "type": [],
        "definition": [
            "Ransomware is a type of malware that prevents you from using your computer or accessing certain files unless you pay a ransom.  It often encrypts your files so that they cannot be opened.  Examples of ransomware include Locky, Reveton, CryptoLocker, and CryptoWall.\nRansomware is often distributed as a trojan, or malware disguised as a legitimate file.  Once installed, it may lock your computer and display a \"lockscreen\" with a message saying you must pay a ransom to regain use of your computer.  This may be a fake message purporting to be from a government institution like the FBI or Department of Defense saying you must pay a fine.  It may also be a blatant ransom message saying your files are being held for ransom and you must pay to access them again.  The ransom message typically includes instructions for how to pay the fine, often by credit card or Bitcoin.  Ransom amounts range from less than $100 to several thousand dollars.\nSome ransomware may allow you to use your computer, but will prevent you from opening certain files.  When you try to open a file or directory encrypted by the ransomware, you may see a message or alert box stating your files are being held for ransom and you must pay a fee to regain access to them.\nDealing with Ransomware\nThe best way to deal with ransomware is to prevent it.  Don't open unknown files or downloads from untrusted websites.  You may also want to install antivirus or Internet security software that can detect and eliminate ransomware threats before they take over your computer.  This is especially true if you use Windows, as it is the platform most commonly targeted by ransomware.\nIf your computer is infected with ransomware, you have a few options.\n\nIf you have a recent system backup, you can revert to a saved state before the ransomware infected your computer.\nSearch for an Internet security utility that can remove the specific ransomware installed on your system and possibly decrypt your files.\n(Not recommended) Pay the ransomware fee and contact your bank or credit card company to block or refund the transaction.\n\nNOTE: TechTerms does not recommend paying a ransom to remove ransomware.  There is no guarantee that paying the fee will remove the ransomware for your computer.  The best way to recover from a ransomware attack is to restore your files from a recent backup."
        ]
    },
    {
        "word": "Raster Graphic",
        "type": [],
        "definition": [
            "Most images you see on your computer screen are raster graphics.  Pictures found on the Web and photos you import from your digital camera are raster graphics.  They are made up of grid of pixels, commonly referred to as a bitmap.  The larger the image, the more disk space the image file will take up.  For example, a 640 x 480 image requires information to be stored for 307,200 pixels, while a 3072 x 2048 image (from a 6.3 Megapixel digital camera) needs to store information for a whopping 6,291,456 pixels.\nSince raster graphics need to store so much information, large bitmaps require large file sizes.  Fortunately, there are several image compression algorithms that have been developed to help reduce these file sizes.  JPEG and GIF are the most common compressed image formats on the Web, but several other types of image compression are available.\nRaster graphics can typically be scaled down with no loss of quality, but enlarging a bitmap image causes it to look blocky and \"pixelated.\"  For this reason, vector graphics are often used for certain images, such as company logos, which need to be scaled to different sizes.\nFile extensions: .BMP, .TIF, .GIF, .JPG"
        ]
    },
    {
        "word": "Rational Number",
        "type": [],
        "definition": [
            "A rational number is any number that can be expressed as a ratio of two integers (hence the name \"rational\").  It can be written as a fraction in which the the top number (numerator) is divided by the bottom number (denominator).\nAll integers are rational numbers since they can be divided by 1, which produces a ratio of two integers.  Many floating point numbers are also rational numbers since they can be expressed as fractions.  For example, 1.5 is rational since it can be written as 3\/2, 6\/4, 9\/6 or another fraction or two integers. Pi (π) is irrational since it cannot be written as a fraction.\nA floating point number is rational if it meets one of the following criteria:\n\nit has a limited number of digits after the decimal point (e.g., 5.4321)\nit has an infinitely repeating number after the decimal point (e.g., 2.333333...)\nit has an infinitely repeating pattern of numbers after the decimal point (e.g. 3.151515...)\n\nIf the numbers after the decimal point repeat infinitely with no pattern, the number is not rational or \"irrational.\"  Below are examples of rational and irrational numbers.\n\n1 - rational\n0.5 - rational\n2.0 - rational\n√2 - irrational\n3.14 - rational\nπ (3.14159265359...) - irrational\n√4 - rational\n√5 - irrational\n16\/9 - rational\n1,000,000.0000001 - rational\n\nIn computer science, it is significant if a number is rational or irrational.  A rational number can be stored as an exact numeric value, while an irrational number must be estimated.\nNOTE: The number zero (0) is a rational number because it can be written as 0\/1, which equals 0."
        ]
    },
    {
        "word": "Raw Data",
        "type": [],
        "definition": [
            "Raw data is unprocessed computer data.  This information may be stored in a file, or may just be a collection of numbers and characters stored on somewhere in the computer's hard disk.  For example, information entered into a database is often called raw data.  The data can either be entered by a user or generated by the computer itself.  Because it has not been processed by the computer in any way, it is considered to be \"raw data.\"  To continue the culinary analogy, data that has been processed by the computer is sometimes referred to as \"cooked data.\""
        ]
    },
    {
        "word": "Raw File",
        "type": [],
        "definition": [
            "A raw file is a collection of unprocessed data.  This means the file has not been altered, compressed, or manipulated in any way by the computer.  Raw files are often used as data files by software programs that load and process the data.  A popular type of raw file is \"Camera RAW,\" which is generated by a digital camera.  Instead of processing the image captured by the camera, the data is left unprocessed and uncompressed until it is opened with a computer program."
        ]
    },
    {
        "word": "Read-only",
        "type": [],
        "definition": [
            "A read-only file or storage device contains data that cannot be modified or deleted.  While data can be accessed or \"read\" from a read-only file or device, new data cannot be added or \"written\" to the device.\nMost operating systems, such as Windows and OS X allow you to mark individual files as read-only.  In Windows, you can right-click a file and select Properties to view more information about the file.  You can click the Read-only checkbox (located in the General tab) to make a file read-only.  In OS X, you can right-click a file and select Get Info to view more information about file.  You can then select the Locked or Stationery options in the file's Get Info window to disable write access to the file.  A \"locked\" file on a Mac is the same thing as a read-only file in Windows.\nWindows and OS X also allow you to set folders or entire storage devices to read-only.  In some cases, the storage media itself may be read-only.  For example, DVDs and CD-Rs are permanently read-only once the initial data has been written to the disc.  Some flash drives and SD cards have a physical switch that can be used to make the media read-only.  By setting a storage device to read-only, you can ensure that important data isn't accidentally modified or erased.\nNOTE: Read-only also refers to a type of memory called ROM that supports reading but not writing."
        ]
    },
    {
        "word": "Readme",
        "type": [],
        "definition": [
            "A readme file, often named \"READ ME\" to get the user's attention, is a text file containing useful information about a software program.  It often accompanies the program's installer or is installed with the program.  A typical readme file contains instructions on how to install the program, how to use the basic functions of the program, and what the program does.  It may also include a list of recent updates made to the program.  Sometimes the readme file will include warnings and other important notices regarding the operation of the program.  So when you see a readme file accompanying a new software program, it is best to do what the file says and read it!"
        ]
    },
    {
        "word": "Real Number",
        "type": [],
        "definition": [
            "A real number is any positive or negative number.  This includes all integers and all rational and irrational numbers.  Rational numbers may be expressed as a fraction (such as 7\/8) and irrational numbers may be expressed by an infinite decimal representation (3.1415926535...).  Real numbers that include decimal points are also called floating point numbers, since the decimal \"floats\" between the digits.\nReal numbers are relevant to computing because computer calculations involve both integer and floating point calculations.  Since integer calculations are generally more simple than floating point calculations, a computer's processor may use a different type of logic for performing integer operations than it does for floating point operations.  The floating point operations may be performed by a separate part of the CPU called the floating point unit, or FPU.\nWhile computers can process all types of real numbers, irrational numbers (those with infinite decimal points) are generally estimated.  For example, a program may limit all real numbers to a fixed number of decimal places.  This helps save extra processing time, which would be required to calculate numbers with greater, but unnecessary accuracy."
        ]
    },
    {
        "word": "Real-Time",
        "type": [],
        "definition": [
            "When an event or function is processed instantaneously, it is said to occur in real-time.  To say something takes place in real-time is the same as saying it is happening \"live\" or \"on-the-fly.\"  For example, the graphics in a 3D action game are rendered in real-time by the computer's video card.  This means the graphics are updated so quickly, there is no noticeable delay experienced by the user.  While some computer systems may be capable of rendering more frames per second than other systems, the graphics are still being processed in real-time.\nWhile video games often require real-time rendering, not all graphics are rendered in real-time.  For example, some complex 3D models and animations created for movies are not rendered in real-time, but instead are pre-rendered on a computer system so they can be played back in real-time.  As graphics cards get increasingly faster, they are capable of rendering some 3D animations in real-time that previously would need to be pre-rendered.\nReal-time also describes the way streaming media is processed.  Instead of waiting for a file to completely download, the information is played back as it is downloaded.  This allows for news broadcasts, sound clips, and other streaming audio and video data to be played live from the Internet.  Thanks to real-time processing, people can access information without having to wait for it.  This is an important benefit since these days, anything that takes longer than 5 seconds seems like a long time."
        ]
    },
    {
        "word": "Reciprocal Link",
        "type": [],
        "definition": [
            "A reciprocal link is a mutual link between two websites.  For example, if website A links to website B, then website B can add a reciprocal link back to website A.  The result of a reciprocal link is two websites that link to each each other.\nReciprocal links are typically created for one of two purposes: 1) to establish a partnership between two websites, or 2) to boost search engine ranking.  If two websites provide related information, the webmasters may decide it makes sense to link to each other.  They can establish an online partnership by providing reciprocal links on their websites.  Additionally, if a company or individual owns multiple sites, the webmaster may add reciprocal links to each site so that visitors are aware of the other sites.\nReciprocal linking is also used to boost search engine ranking.  Since search engine ranking algorithms factor in the number of incoming links, or \"inlinks,\" a website has, reciprocal links can help increase a website's search engine ranking.  However, since search engines also factor in the quality of each site providing an incoming link, not all reciprocal links are beneficial.\nNOTE: A reciprocal link may link to any page within a website, not just the page that contains the link back to the site."
        ]
    },
    {
        "word": "Record",
        "type": [],
        "definition": [
            "A record is a database entry that may contain one or more values.  Groups of records are stored in a table, which defines what types of data each record may contain.  Databases may contain multiple tables which may each contain multiple records.\nRecords are often called rows since each new record creates a new row in the table.  Individual fields are sometimes called columns since they are the same for each record within a table.  While the words \"record\" and \"row\" are often used interchangeably, most DBMSes use the word \"row\" for database queries and error messages.  Therefore, if you see an error message on a website that says \"Unable to jump to row 89,\" for example, it means the record was not found in the database.\nRecords are an efficient way to store and access data.  Since each record may contain multiple data types, a single record may include many different types of information.  For example, a personnel record may contain an ID number, name, birthdate, and photo, which are all different data types.  Individual fields within the personnel record can be easily accessed or compared with other records using a database query.  Additionally, records can be easily created, modified, and deleted without affecting other data in the database.\nNOTE: The word \"record\" is also a verb (pronounced \"re-cord\"), which means to capture and save audio and\/or video data."
        ]
    },
    {
        "word": "Recursion",
        "type": [],
        "definition": [
            "Recursion is a process in which a function calls itself as a subroutine.  This allows the function to be repeated several times, since it calls itself during its execution.  Functions that incorporate recursion are called recursive functions.\nRecursion is often seen as an efficient method of programming since it requires the least amount of code to perform the necessary functions.  However, recursion must be incorporated carefully, since it can lead to an infinite loop if no condition is met that will terminate the function."
        ]
    },
    {
        "word": "Recursive Function",
        "type": [],
        "definition": [
            "A recursive function is a function that calls itself during its execution.  The process may repeat several times, outputting the result and the end of each iteration.  \nThe function Count() below uses recursion to count from any number between 1 and 9, to the number 10.  For example, Count(1) would return 2,3,4,5,6,7,8,9,10.  Count(7) would return 8,9,10.  The result could be used as a roundabout way to subtract the number from 10.\n[cb]\nfunction Count (integer N)\n    if (N  9) return \"Counting Completed\";\n    else return Count (N+1);\nend function\n[\/cb]\nRecursive functions allow programmers to write efficient programs using a minimal amount of code.  The downside is that they can cause infinite loops and other unexpected results if not written properly.  For example, in the example above, the function is terminated if the number is 0 or less or greater than 9.  If proper cases are not included in a recursive function to stop the execution, it will repeat forever, causing the program to crash or become unresponsive."
        ]
    },
    {
        "word": "Recycle Bin",
        "type": [],
        "definition": [
            "When you delete a file or folder in Windows, it is placed in the Recycle Bin.  Items are temporarily stored in the Recycle Bin before they are permanently deleted by the user.\nThe Recycle Bin is located on the Windows desktop.  When it is empty, the icon is an empty recycle bin.  If it contains one or more items, the icon changes to a recycle bin with papers in it.  You can move items to the Recycle Bin by either dragging them to the Recycle Bin icon or by selecting the items and pressing the Delete key.  You may also right-click an item and select \"Delete\" from the pop-up menu.\nYou can open the Recycle Bin by double-clicking its icon.  This allows you to view the files the Recycle Bin contains, just like a typical folder.  However, in the left sidebar of the window, there is a \"Recycle Bin Tasks\" section that includes the options \"Empty the Recycle Bin\" and \"Restore all items.\"  Since Windows remembers the original location of each item, if you select \"Restore all items,\" the files will each be placed back in their original location.  You can also select items individually and restore them back to their previous folders.\nEmptying the Recycle Bin\nIf you select \"Empty the Recycle Bin,\" all the items in the Recycle Bin will be will permanently deleted.  If you only want to delete a single item, you can select it, press Delete, then confirm you want to delete it.  Deleted items cannot be restored, so you should only empty the Recycle Bin if you are sure you no longer need the files.  It is a good idea to empty the Recycle Bin on a regular basis because it frees up disk space for other files.\nRecycle or Trash?\nThe Recycle Bin serves the same purpose as the Trash found on Macintosh computers.  While the name is not as simple, it is admittedly, more eco-friendly.  It also reflects the idea that when you empty the Recycle Bin, it makes more disk space available, thereby \"recycling\" the sections of the disk that contained the previous data."
        ]
    },
    {
        "word": "Redundancy",
        "type": [],
        "definition": [
            "The general definition of redundancy is exceeding what is normal.  However, in computing, the term is used more specifically and refers to duplicate devices that are used for backup purposes.  The goal of redundancy is to prevent or recover from the failure of a specific component or system.\nThere are many types of redundant devices.  The most common in personal computing is a backup storage device.  While most other computer components can be easily replaced, if a hard drive fails, it may not be possible to recover personal data.  Therefore, it is important to regularly back up your data to a secondary hard drive.  In enterprise situations, a RAID configuration can be used to mirror data across two drives in real-time.\nAnother type of redundant device is a secondary power supply.  High traffic web servers and other critical systems may have multiple power supplies that take over in case the primary one fails.  While an uninterruptible power supply (UPS) is not technically a redundant device, the battery within the surge protector provides power redundancy for a few minutes if electricity is lost.\nComputer networks often implement redundancy as well.  From local area networks to Internet backbone connections, it is common to have redundant data paths.  This means if one system goes down, the connection between other systems will not be broken.  For example, an FDDI network has a duplicate data \"ring\" that is used automatically when the primary data path is interrupted.  Network redundancy can be accomplished by either adding extra physical connections or using networking software that automatically reroutes data when needed."
        ]
    },
    {
        "word": "Refresh",
        "type": [],
        "definition": [
            "Refresh is a command that reloads the contents of a window or Web page with the most current data.  For example, a window may list files stored within a folder, but may not track their location in real-time.  If the files have been moved or deleted since the window was first opened, the folder contents displayed will be inaccurate.  By refreshing the window, a current list of files is displayed.\nWeb browsers include a Refresh command, which reloads the contents of a Web page.  This is especially useful for dynamic Web pages, which contain content that changes often.  For example, a page may include a stock quote, which is updated every few seconds.  By refreshing the page, a user can see the latest quote and track how much the stock continues to drop since he bought it.  Web developers may also use the Refresh command to view recently published changes to Web pages.\nSince refreshing a window reloads it with new information, the terms \"refresh\" and \"reload\" are often used synonymously.  In fact, some Web browsers, such as Firefox and Safari use the term \"Reload\" instead of \"Refresh.\"  In Windows, the shortcut key for the Refresh command is typically \"F5,\" while on the Mac, the shortcut is often \"Command-R.\"\nThe term \"Refresh\" may also refer to the redrawing process of a computer monitor.  This process usually happens many times per second and is called the \"refresh rate.\""
        ]
    },
    {
        "word": "Refresh Rate",
        "type": [],
        "definition": [
            "Computer monitors often have a \"maximum refresh rate\" listed in their technical specifications.  This number, measured in hertz (Hz), determines how many times the screen is redrawn each second.  Typical refresh rates for CRT monitors include 60, 75, and 85 Hz.  Some monitors support refresh rates of over 100 Hz.\nThe higher the refresh rate, the less image flicker you will notice on the screen.  Typically a refresh rate of less than 60 Hz will produce noticeable flicker, meaning you can tell the screen is being redrawn instead of seeing a constant image.  If the refresh rate is too slow, this flicker can be hard on your eyes and may cause them to tire quickly.  As if sitting at a computer for several hours wasn't hard enough!\nTo avoid flicker, you should set your monitor to use the maximum refresh rate possible.  This setting is found in the Monitors control panel in Windows and the Displays system preference in Mac OS X.  While 60 Hz is considered a good refresh rate, some people will find that 85 Hz is significantly better.\nThe maximum refresh rate is determined by three factors: 1) The rate your video card supports, 2) the rate your monitor supports, and 3) the resolution your monitor is set at.  Lower resolutions (i.e. 800x600) typically support higher refresh rates than higher resolutions (i.e. 1600x1200).\nIf you have an LCD monitor, you may not be able to adjust the refresh rate.  This is because most LCD monitors come with a standard refresh rate that is well above the \"flicker\" point.  LCD monitors produce less flicker than CRT monitors because the pixels on an LCD screen stay lit longer than CRT monitors before they noticeably fade."
        ]
    },
    {
        "word": "Register",
        "type": [],
        "definition": [
            "A register is a temporary storage area built into a CPU.  Some registers are used internally and cannot be accessed outside the processor, while others are user-accessible.  Most modern CPU architectures include both types of registers.\nInternal registers include the instruction register (IR), memory buffer register (MBR), memory data register (MDR), and memory address register (MAR).  The instruction register fetches instructions from the program counter (PC) and holds each instruction as it is executed by the processor.  The memory registers are used to pass data from memory to the processor.  The storage time of internal registers is extremely temporary, as they often hold data for less than a millisecond.\nUser-accessible registers are larger than internal registers and typically hold data for a longer time.  For example, a data register may store individual values referenced being by a currently running program.  An address register contains memory addresses, which reference different blocks of memory within the system RAM.  Many CPUs now have general purpose registers (GPRs), which may contain both data and memory addresses.\nRegisters vary in both number and size, depending on the CPU architecture.  Some processors have 8 registers while others have 16, 32, or more.  For many years, registers were 32-bit, but now many are 64-bit in size.  A 64-bit register is necessary for a 64-bit processor, since it enables the CPU to access 64-bit memory addresses.  A 64-bit register can also store 64-bit instructions, which cannot be loaded into a 32-bit register.  Therefore, most programs written for 32-bit processors can run on 64-bit computers, while 64-bit programs are not backwards compatible with 32-bit machines."
        ]
    },
    {
        "word": "Registry",
        "type": [],
        "definition": [
            "The Windows Registry is a database of settings used by Microsoft Windows.  It stores configurations for hardware devices, installed applications, and the Windows operating system.  The Registry provides a centralized method of storing custom preferences for each Windows user, rather than storing them as individual .INI files.\nThe Windows Registry is structured as a hierarchy that has several top-level categories, also known as \"hives.\"  Each begins with \"HKEY,\" short for \"Handle to Registry Key.\"  Some versions of Windows have as many as seven top-level categories, while Windows 10 has five.  These include:\n\nHKEY_CLASSES_ROOT\n- stores file associations, which links file extensions to default programs\n- stores configurations for COM (Component Object Model) objects, such as Microsoft OLE documents and ActiveX components\nHKEY_CURRENT_USER\n- stores user-level preferences selected using the Control Panel\n- stores user-level network and printer settings\nHKEY_LOCAL_MACHINE\n- stores system and application settings that apply to all users\n- stores system-level network and printer settings\nHKEY_USERS\n- stores settings temporarily for active users (those who are currently logged in)\nHKEY_CURRENT_CONFIG\n- stores differences between the standard configuration and the current hardware configuration\n\nThe Windows operating system and installed programs can modify the Registry directly.  For example, changing the default program for a specific file extension will update the Registry automatically.  Therefore, it is typically not necessary to edit the Windows Registry.  However, power users may wish to view and manually override some Registry settings.  Windows provides a Registry Editor utility (regedit.exe) for viewing and editing Registry data.  This utility can also import settings and export existing configurations.\nNOTE: You should not edit the Windows Registry unless you understand what you are doing.  Incorrect Registry settings may cause problems with installed applications or the operating system itself."
        ]
    },
    {
        "word": "Regular Expression",
        "type": [],
        "definition": [
            "A regular expression (or \"regex\") is a search pattern used for matching one or more characters within a string.  It can match specific characters, wildcards, and ranges of characters.  Regular expressions were originally used by Unix utilities, such as vi and grep.  However, they are now supported by many code editing applications and word processors on multiple platforms.  Regular expressions can also be used in most major programming languages.\nA regular expression can be as simple as a basic string, such as \"app\".  The regex \"app\" would match strings containing the words \"apps,\" \"applications,\" and \"inapplicable\".  A regular expression may also contain anchor characters (\"^\" and \"$\") which are used to specify the beginning and end of a line, respectively.  Therefore, the regex \"^apps\" would match the string, \"apps are great,\" but would not match the string, \"I like apps.\"\nRegular expressions can include dashes, which are used to match a range of characters, such as all lowercase letters.  For example, the regex \"[a-z]\" would match \"apps,\" but would not match the strings \"Apps\" or \"123\".  The regex \"[A-Za-z]\" would match \"Apps\" and \"[0-9]\" would match \"123\".  A period, which is the standard wildcard character in regular expressions, can be used to match any character (except an end-of-line character).  A period followed by an asterisk (.*) matches zero or more instances, while a period followed by a plus (.+) matches one or more instances.\nSo what happens if you need to match a string containing a dash, asterisk, plus, or an anchor character?  These characters can be included in a regular expression pattern by \"escaping\" them with a backslash (\"\\\").  For example, to search for \"$0.99\", the regex would look like \"\\$0\\.99\".  Backslashes are also used to search for non-printable characters.  For example, \"\\r\" matches a carriage return, \"\\n\" matches a new line, and \"\\t\" matches a tab character.\nWhile it does not take much effort to create a basic regular expression, writing an advanced regex is not an easy task.  Even the best programmers rarely get complex regular expressions right the first time.  When used correctly, however, regular expressions are a powerful tool for searching, finding, and replacing specific text."
        ]
    },
    {
        "word": "Reimage",
        "type": [],
        "definition": [
            "When you reimage a hard disk, you restore the entire disk from a disk image file.  Since this restore process involves erasing all the current data on the hard disk, it is typically used a last resort system recovery option.\nThe disk image used to restore a computer may be a recent backup from the computer's hard drive or it may be disk image with completely new data.  Most home users would reimage a hard disk from a personal backup file, such as a Norton Ghost disk image (Windows) or a Time Machine backup (Mac).  Reimaging from a backup file allows you to recover all the data that was saved at the time of the backup.  System administrators, on the other hand, may reimage business computers using standard disk images instead of backup files.  This ensures all computers within a department have the same data.\nReimaging is a useful system restore method, since it rebuilds a hard drive with the exact content saved in the disk image.  This includes all the folders and files as well as the hard disk file system information.  Therefore, reimaging is one-step process, which doesn't require multiple installations.  While the term \"reimage\" is sometimes used synonymously with an OS reload (or operating system reinstallation), it technically refers only to the process of restoring data from a disk image.\nReimage is also the name of a Windows PC hard disk repair utility."
        ]
    },
    {
        "word": "Relational Database",
        "type": [],
        "definition": [
            "A relational database is a database model that stores data in tables.  The vast majority of databases used in modern applications are relational, so the terms \"database\" and \"relational database\" are often used synonymously.  Likewise, most database management systems (DBMSes) are relational database management systems (RDBMSes).  Other database models include flat file and hierarchical databases, though these are rarely used. \nEach table in a relational database contains rows (records) and columns (fields).  In computer science terminology, rows are sometimes called \"tuples,\" columns may be referred to as \"attributes,\" and the tables themselves may be called \"relations.\"  A table can be visualized as a matrix of rows and columns, where each intersection of a row and column contains a specific value.  It is \"relational\" since all records share the same fields.\nDatabase tables often include a primary key, which provides a unique identifier for each row within the table.  The key may be assigned to a column (which requires a unique value each row), or it may be comprised of multiple columns that together form a unique combination of values.  Either way, a primary key provides an efficient way of indexing data and can be used to share values between tables within a database.  For example, the value of a primary key from one table can be assigned to a field in a row of another table.  Values imported from other tables are called foreign keys.\nThe standard way to access data from a relational database is through an SQL (Structured Query Language) query.  SQL queries can be used to create, modify, and delete tables, as well as select, insert, and delete data from existing tables."
        ]
    },
    {
        "word": "Remote Access",
        "type": [],
        "definition": [
            "Remote access is just what it sounds like -- the ability to access your computer from a remote location.  Programs like PC Anywhere (Windows), Remote Access (Mac), and Timbuktu (Windows and Mac) allow users to control remote computers from their local machine.  In order for a remote access connection to take place, the local machine must have the remote client software installed and the remote machine must have the remote server software installed.  Also, a username and password is almost always required to authenticate the connecting user.\nRemote access is more than just being able to connect to a remote machine -- it is the ability to control the machine once the connection has been made.  A remote access program can basically transform your local computer into the the remote computer you connect to.  This is great for people who sometimes work from home and for server administrators who frequently need to update and make changes on their server machines.  Most remote access programs also allow users to transfer files between the local and remote machines, which can save a lot of commuting time.  While remote access can be helpful for many people, don't enable it on your machine unless you absolutely need to.  It is just one more security concern you will have to deal with."
        ]
    },
    {
        "word": "Remote Desktop",
        "type": [],
        "definition": [
            "Remote desktop technology makes it possible to view another computer's desktop on your computer.  This means you can open folders, move files, and even run programs on the remote computer, right from your own desktop.  Both Windows and Macintosh computer support remote desktop connections, though they use different implementations.\nWindows XP and Vista both include Remote Desktop as part of the operating system.  The Remote Desktop program uses Microsoft Terminal Services and the Remote Desktop Protocol (RDP) to connect to a remote machine.  Remote connections can be opened using Windows' Remote Desktop Connection (RDC), which is also referred to as Terminal Services Client (TSC).  This program allows users to configure and manage remote connections to other computers.  Of course, to connect to another machine, the remote system must be configured to accept incoming RDC connections.\nA Windows computer can be configured to accept incoming remote desktop connections by opening the Control Panel and selecting \"Performance and Maintenance.\"  Then click the \"System\" icon and select the \"Remote\" tab in the System Properties window.  Next, check the box that says, \"Allow users to connect remotely to this computer.\"  Then click OK.  This should enable remote desktop connections to your machine.  You can then click \"Select Remote Users...\" to only provide access to specific users.  Of course, if you don't want your computer to be accessed by anyone, leave the \"Allow users to connect...\" box unchecked.\nMac OS X 10.5 and later includes a feature called Screen Sharing that allows other users to remotely access the computer's desktop.  To turn on Screen Sharing, open System Preferences and select the Sharing option.  Next, check the \"Screen Sharing\" check box.  You can then add access for specific users in the \"Allow access for:\" section of the window.  If the Mac OS X Screen Sharing option feels a bit limited, you may want to try a program called \"Apple Remote Desktop.\"  This program, which is developed by Apple, provides more advanced remote access features and is often used for managing several computers on a network."
        ]
    },
    {
        "word": "Remote User",
        "type": [],
        "definition": [
            "A \"remote user\" is how a woman might refer to her husband while he is watching TV.  In the computer world, however, a remote user is someone who works on a computer from a remote location.  For example, if Bob leaves work and forgets to bring a file with him from his office computer, he might be able to connect to his work machine from his home computer and grab the file.  When Bob accesses his office computer from home, he is considered a remote user.\nOf course, Bob does not want anyone to be able to access his computer remotely.  So, he would most likely need to enter a username and password in order to connect to his office machine.  Programs like Timbuktu and PC Anywhere allow users to not only connect to their computers remotely, but actually display the interface of the remote machine on their local computer.  Unix-based systems such as Mac OS X and Linux allow users to control the computers remotely using the text-based \"Terminal\" interface.  Remote connections can be made over a local network, a direct phone connection, or over the Internet.  Of course, the slower the connection, the slower the response time will be from the remote computer."
        ]
    },
    {
        "word": "Rendering",
        "type": [],
        "definition": [
            "Rendering is the process of generating a final digital product from a specific type of input.  The term usually applies to graphics and video, but it can refer to audio as well.\n1. Graphics\n3D graphics are rendered from basic three-dimensional models called wireframes.  A wireframe defines the shape of the model, but nothing else.  The rendering process adds surfaces, textures, and lighting to the model, giving it a realistic appearance.  For example, a 3D drawing application or a CAD program may allow you to add different colors, textures, and lighting sources to a 3D model.  The rendering process applies these settings to the object.\nThanks to the power of modern GPUs, 3D image rendering is often done in real-time.  However, with high-resolution models, surfaces and lighting effects may need to be rendered using a specific \"Render\" command.  For example, a CAD program may display low-resolution models while you are editing a scene, but provide an option to render a detailed model that you can export.\n2. Video\n3D animations and other types of video that contain CGI often need to be rendered before viewing the final product.  This includes the rendering of both 3D models and video effects, such as filters and transitions.  Video clips typically contain 24 to 60 frames per second (fps), and each frame must be rendered before or during the export process.  High-resolution videos or movies can take several minutes or even several hours to render.  The rendering time depends on several factors including the resolution, frame rate, length of the video, and processing power.\nWhile video clips often need to be pre-rendered, modern GPUs are capable of rendering many types of 3D graphics in real-time.  For example, it is common for computers to render high-definition video game graphics at over 60 fps.  Depending on the graphics power, a game's frame rate may be faster or slower.  If the GPU cannot render at least 30 frames per second, the video game may appear choppy.\n3. Audio\nLike video effects, audio effects can also be rendered.  For example, a DAW application may include effects like reverb, chorus, and auto-tune.  The CPU may be able to render these effects in real-time, but if too many tracks with multiple effects are being played back at once, the computer may not be able to render the effects in real-time.  If this happens, the effects can be pre-rendered, or applied to the original audio track.  All effects are rendered when the final mix is exported or \"bounced\" as an audio file."
        ]
    },
    {
        "word": "Repeater",
        "type": [],
        "definition": [
            "A repeater is an electronic device that relays a transmitted signal.  It receives a signal on a specific frequency, then amplifies and rebroadcasts it.  By amplifying the signal, a repeater increases the transmission range of the original signal.\nRepeaters have many applications, but in computing they are most commonly used in wireless networks.  For example, a Wi-Fi network in a large home may benefit from using one or more repeaters to relay the signal to different areas of the house.  Homes that have brick walls or cement floors may also benefit from having a repeater relay the signal around the obstacle.  Businesses often use a series of repeaters to create a single wireless network within a large building.\nWhile repeaters all serve the same purpose, they come in many forms.  Some wireless devices, often called \"range extenders\" are designed to be used specifically as repeaters.  Other devices, such as hubs, switches, and routers can all be configured as repeaters using a software utility or web interface that controls the wireless device.\nNOTE: Since repeaters only relay an incoming signal, using a router as a repeater does not make use of its signal routing capability.  Therefore, it makes more sense to use a range extender as a repeater if possible."
        ]
    },
    {
        "word": "Repository",
        "type": [],
        "definition": [
            "In software development, a repository is a central file storage location.  It is used by version control systems to store multiple versions of files.  While a repository can be configured on a local machine for a single user, it is often stored on a server, which can be accessed by multiple users.\nA repository contains three primary elements — a trunk, branches, and tags.  The trunk contains the current version of a software project.  This may include multiple source code files, as well as other resources used by the program.  Branches are used to store new versions of the program.  A developer may create a new branch whenever he makes substantial revisions to the program.  If a branch contains unwanted changes, it can be discontinued.  Otherwise, it can be merged back into the trunk as the latest version.  Tags are used to save versions of a project, but are not meant for active development.  For example, a developer may create a \"release tag\" each time a new version of the software is released.\nA repository provides a structured way for programmers to store development files.  This can be helpful for any type of software development, but it is especially important for large development projects.  By committing changes to a repository, developers can quickly revert to a previous version of a program if a recent update causes bugs or other problems.  Many version control systems even support side-by-side comparisons of different versions of files saved in the repository, which can be helpful for debugging source code.  Additionally, when a repository is stored on a server, users can \"check out\" files for editing, which prevents files from being edited by more than one user at a time."
        ]
    },
    {
        "word": "Resistor",
        "type": [],
        "definition": [
            "A resistor is an electrical component that limits the flow of electric current.  One or more resistors can be used to provide the correct amount of current to specific components within an electronic device.\nResistors are often soldered onto a printed circuit board to limit the amount of current that flows to different electrical paths.  If too little current reaches a component, it may not operate.  If too much current is allowed through, it can damage the component.  Therefore, resistors play an important role in an electronic circuit.\nSeveral types of resistors exist, but most are made up of carbon and an insulating material, such as ceramic.  The current flows in one end and the remaining current flows out the other.  The resulting current is inversely proportional to the resistance.  This is defined in Ohm's law, which states that the current (I) is equal to the voltage (V) divided by the resistance (R).\nI = V \/ R\nResistors are often color-coded to visually represent their resistance levels.  A typical axial-lead resistor, for instance, is cylindrical in shape and has several colored stripes.  The first few stripes represent digits, followed by a stripe which represents a multiplier (10x, 100x, etc.)  On the other end is a stripe that represents the tolerance, which defines the accuracy of the resistor.  Some resistors also include one more band that represents the temperature coefficient.\nNOTE: Resistors are represented in circuit diagrams by a jagged line.  They are usually labeled R1, R2, R3, etc."
        ]
    },
    {
        "word": "Resolution",
        "type": [],
        "definition": [
            "Resolution measures the number of pixels in a digital image or display.  It is defined as width by height, or W x H, where W is the number of horizontal pixels and H is the number of vertical pixels.  For example, the resolution of an HDTV is 1920 x 1080.\nImage Resolution\nA digital photo that is 3,088 pixels wide by 2,320 pixels tall has a resolution of 3088 × 2320.  Multiplying these numbers together produces 7,164,160 total pixels.  Since the photo contains just over seven million pixels, it is considered a \"7 megapixel\" image.  Digital camera resolution is often measured in megapixels, which is simply another way to express the image resolution.\n\"Resolution\" is often used synonymously with \"size\" when describing the dimensions of a digital image.  However, the term \"size\" can be a bit ambiguous, since it may refer to the file size of the image or its dimensions.  Therefore, it is best to use \"resolution\" when describing the dimensions of a digital image.\nDisplay Resolution\nEvery monitor and screen has a specific resolution.  As mentioned above, an HD display has a resolution of 1920 x 1080 pixels.  A 4K display has twice the resolution of HD, or 3840 x 2160 pixels.  It is called \"4K\" since the screen is nearly 4,000 pixels across horizontally.  The total number of pixels in a 4K display is 8,294,400, or just over eight megapixels.\nMonitor resolution defines how many pixels a screen can display, but it does not describe how fine the image is.  For example, a 27\" iMac 5K display has a resolution of 5120 x 2880 while an older 27\" Apple Thunderbolt Display has exactly half the resolution of 2560 x 1440.  Since the 27\" iMac is the same physical size as the Thunderbolt Display but has twice the resolution, it has twice the pixel density, measured in pixels per inch, or PPI.\nNOTE: Unlike monitor resolution, the resolution of a printer or scanner is analogous to pixel density rather than total pixels.  Printer and scanner resolution is measured in dots per inch, or DPI."
        ]
    },
    {
        "word": "Responsive Web Design",
        "type": [],
        "definition": [
            "Responsive web design (or \"RWD\") is a type of web design that provides a customized viewing experience for different browser platforms.  A website created with RWD will display a different interface depending on what device is used to access the site.  For example, a responsive website may appear one way on a laptop, another way on a tablet, and still another way on smartphone.\nToday, many people access websites from mobile devices, rather than desktop computers or laptops.  While most smartphones can display regular websites, the content is difficult to read and even harder to navigate.  Therefore, many web developers now use responsive web design to provide a better web browsing experience on small screens.\nWebsites designed for mobile devices (such as iOS and Android phones), typically have a larger default font size and simplified navigation.  Some sites also take advantage of the touchscreens interface, providing support for swiping, rotating, and pinching and zooming.  A mobile-optimized website may also remove unnecessary content to reduce the need for scrolling.  Image rollovers and other mouse hover features are often removed, since touchscreens don't support a mouse pointer.\nThere are several ways to implement responsive web design.  One method is to dynamically detect the user's platform (such as an iPad or iPhone) and load specific HTML and CSS for the corresponding device.  Another option is to use media queries, which automatically load different CSS styles depending on the size of the browser window.  The Bootstrap package, which contains several prewritten JavaScript and CSS files, is based on media queries and is commonly used in responsive web design."
        ]
    },
    {
        "word": "Restore",
        "type": [],
        "definition": [
            "The word \"restore\" means to return something to its former condition.  Therefore, when you restore a computer or other electronic device, you return it to a previous state.  This may be a previous system backup or the original factory settings.\nRestoring a computer, often called a \"system restore,\" is often done as a last resort to fix a problematic machine.  For example, if a virus has infected a large number of system files, a system restore may be the only way to get the computer to run smoothly again.  If a hard drive has become corrupted and cannot be repaired using a disk utility, it may be necessary to reformat the hard drive and restore the computer from the original operating system installation discs.  System restores may also be performed to wipe all data from a computer before selling it or transferring it to another owner.\nSince restoring a computer returns it to a previous state, the process also erases any new data that has been added since the previous state.  Therefore, you should always back up your data before restoring a computer.  The backup should be saved to an external hard drive or another disk other than the one being restored.  Once you have restored the computer, you may transfer your files from the backup device back to the computer.\nWhile the term \"restore\" is often associated with computers, other devices can be restored as well.  For example, if a smartphone is repeatedly malfunctioning, it can often be fixed by restoring the system software.  Most video game consoles can also be restored by running the restore operation within the system settings.  Both iPods and iPhones can be restored using Apple's iTunes software.  No matter what device you choose to restore, remember that the process will erase data saved on the device.  Therefore, the first step in restoring a computer or any other device should be to back up your personal data."
        ]
    },
    {
        "word": "Retina Display",
        "type": [],
        "definition": [
            "The term \"retina display\" is a hardware term coined by Apple in June, 2010.  It describes a display that has a resolution of over 300 dpi.  The iPhone 4, which was also announced in June, 2010, has a screen resolution of 326 dpi and was the first Apple product to include a retina display.\nThe name \"retina display\" refers to way the high-resolution display appears to the human eye.  When a display has a resolution over 300 dpi, most humans cannot recognize individual pixels when viewing the screen from a distance of about 12 inches.  Therefore, the pixels seem to run together, creating a smooth appearance.  This is similar to digital audio that is recorded with a high sampling rate.  Since the audio samples are so close together, we perceive the sound as a smooth analog signal.\nSince some people have better vision than others, there is no scientifically accurate number that defines a retina display.  In fact, some people may in fact be able to identify individual pixels in a retina display.  Still, compared to a typical computer monitors, which has a resolution of 72 dpi, a retina display will look noticeably sharper to all users.\nRetina displays are especially useful for reading text on a small screen, such as an iPhone or iPod Touch.  The increased resolution makes small text legible and medium-sized text easier to read.  As display technology continues to evolve, retina displays are expected to be made available in larger devices, such as the iPad and HiDPI monitors."
        ]
    },
    {
        "word": "Ribbon",
        "type": [],
        "definition": [
            "The ribbon is a user interface element created by Microsoft, which was introduced with Microsoft Office 2007.  It is part of the \"Microsoft Office Fluent\" interface and combines the menu bar and toolbar into a single floating pane.  By default, the ribbon is located at the top of the screen in Office applications, such as Access, Excel, PowerPoint, Word, and Outlook.\nThe purpose of the ribbon is to provide quick access to commonly used tasks within each program.  Therefore, the ribbon is customized for each application and contains commands specific to the program.  Additionally, the top of the ribbon includes several tabs that are used to reveal different groups of commands.  For example, the Microsoft Word ribbon includes Home, Insert, Page Layout, References, and other tabs that each display a different set of commands when selected.\nSince the ribbon contains both the program's menu options and toolbar commands, it cannot be removed from the screen.  However, it can be minimized to free up more screen real estate for the primary document window.  To minimize the ribbon, you can either click the upside down eject icon at the top of the ribbon or use the keyboard shortcut Control+F1.  Once the ribbon has been minimized, it can be restored by clicking the same icon or using the same keyboard shortcut.\nThe ribbon is the primary user interface (UI) element in both Office 2007 and Office 2010.  Office 2011 for Mac includes also includes the ribbon, but has a slightly different layout.  Additionally, other software companies can license the Microsoft Office UI, allowing them to include a custom ribbon in their programs.  For example, Autodesk AutoCAD 2009 and later includes the ribbon at the top of the primary program window."
        ]
    },
    {
        "word": "Rich Text",
        "type": [],
        "definition": [
            "Rich text is more exciting than plain text.  It supports text formatting, such as bold, italics, and underlining, as well as different fonts, font sizes, and colored text.  Rich text documents can also include page formatting options, such as custom page margins, line spacing, and tab widths.\nMost word processors, such as Microsoft Word, Lotus Word Pro, and AppleWorks, create rich text documents.  However, if you save a document in a program's native format, it may only open with the program that created it.  For example, Lotus Word Pro will not be able to open an AppleWorks text document, even though both programs are text editors.  This is because each program uses its own method of formatting and creating text files.\nThe good news is, most word processors allow you to save rich text documents in the generic Rich Text Format.  This file format, which uses the .RTF extension keeps most, if not all the text formatting.  However, because it is a standard format, it can be opened by just about any word processing program and even most basic text editors."
        ]
    },
    {
        "word": "Right Click",
        "type": [],
        "definition": [
            "Most computer mice have at least two mouse buttons.  When you press the left one, it is called a left click.  When you press the one on the right, it is called a right click.  By default, the left button is the main mouse button, and is used for common tasks such as selecting objects and  double-clicking.\nThe right mouse button is often used to open contextual menus, which are pop-up menus that change depending where you click.  For example, if you right click on the desktop, you may see a menu pop up that includes \"Change View Options\" and \"Change Desktop Background.\"  If you right click on a folder, the menu might include options such as \"Open\" and \"Properties.\"  Certain programs, such as video games, may use the right click to perform other functions, such as firing a secondary weapon in a first-person shooter.  Most programs, however, use the right click to open contextual menus."
        ]
    },
    {
        "word": "Ripcording",
        "type": [],
        "definition": [
            "Recording audio with a computer involves capturing an audio signal and saving it digitally on a hard drive.  Ripping an audio track is the process of converting an audio file to an MP3 or other compressed audio format.  Ripcording is the simultaneous recording and ripping of an audio signal.\nRipcording is a popular way to download and archive Internet radio broadcasts, digital cable TV radio, and satellite radio.  All you need is ripcording software that will record audio and compress it at the same time.  By ripcording live audio, you can save audio streams on your hard drive and listen to them whenever you want."
        ]
    },
    {
        "word": "Ripping",
        "type": [],
        "definition": [
            "Ripping is the process of copying data from a CD or DVD to a hard disk.  This is done using a software utility, often referred to as a CD or DVD \"ripper,\" which can extract audio or video data from optical media.\nWhile \"ripping\" sounds destructive, the process does not affect original data.  However, the copied data may be modified during the ripping process so that it can be played on a computer.  For example, DVD ripping programs may convert .VOB video files (which are formatted for DVD players) to standard .MPG files.  The resulting video data can be played back using a basic video player program.\nOnce data has been ripped from a disc, it can be played back without requiring the original disc to be present.  Therefore, ripping is useful for archiving media on your computer or for backing up audio and video data.  However, most commercial CDs and DVDs are copyrighted, meaning you are not allowed to copy the data to other discs or redistribute the data from your computer.  Also, it is typically a violation of copyright to rip data from a disc that you do not own.  Therefore, make sure you know are familiar with the usage policy of the media before you rip it to your hard disk."
        ]
    },
    {
        "word": "Root",
        "type": [],
        "definition": [
            "In the computer world, \"root\" refers to the top-level directory of a file system.  The word is derived from a tree root, since it represents the starting point of a hierarchical tree structure.  The folders within the tree represent the branches, while the actual files are considered the leaves.  However, unlike a real life tree, a data tree can be visualized upside down, with the root at the top and directories and subdirectories spanning downward.\nThe root node of a file system is also called the root directory.  On a Windows-based PC, \"C:\\\" represents the root directory of the C drive.  On Macintosh and Unix systems, the root directory is designated by a simple forward slash (\"\/\").  Similarly, the root directory of a website is simply the domain name, followed by a forward slash (i.e. https:\/\/techterms.com\/).  If you ever use a terminal program to view files and folders on a computer, you can use the command \"cd \/\" (change directory to root) to navigate to the root directory.\n\"Root\" is also the name of the user who has administrative privleges on a Unix or Linux server.  While most users can only access data within their own directory (i.e. \"\/users\/~fred\/\"), the root user can access any folder on the hard drive.  This allows the root user to install system software updates, modify the access privileges of other users, and perform other administrative tasks."
        ]
    },
    {
        "word": "Root Directory",
        "type": [],
        "definition": [
            "The root directory, or root folder, is the top-level directory of a file system.  The directory structure can be visually represented as an upside-down tree, so the term \"root\" represents the top level.  All other directories within a volume are \"branches\" or subdirectories of the root directory.\nWhile all file systems have a root directory, it may be labeled differently depending on the operating system.  For example, in Windows, the default root directory is C:\\.  On Unix systems and in OS X, the root directory is typically labeled simply \/ (a single forward slash).   As you move up directories within a file system, you will eventually reach the root directory.\nWebsite Root Directory\nThe root directory of a website is not the top-level directory of the volume, but rather the top-level directory of the website folder.  On an Apache server, for example, the name of the root directory is public_html and is located within primary user folder for the website.  Therefore, the root folder of a website can be accessed using a single forward slash.  For example, a link to a file called home.html within the root directory of a website can be accessed using the reference \"\/home.html.\""
        ]
    },
    {
        "word": "Rootkit",
        "type": [],
        "definition": [
            "A rootkit is a software program designed to provide a user with administrator access to a computer without being detected.  Rootkits are considered one of the most serious types of malware since they may be used to gain unauthorized access to remote systems and perform malicious operations.\nThe name \"rootkit\" includes the word \"root,\" because the goal of a rootkit is to gain root access to a computer.  By logging in as the root user of a system, a hacker can perform nearly any operation he or she wishes.  This includes installing software and deleting files.  The word \"kit\" refers to the software files that make up the rootkit.  These may include utilities, scripts, libraries, and other files.\nRootkits often work by exploiting security holes in operating systems and applications.  Others create a \"back door\" login to the operating system, which allows a user to bypass the standard login procedure when accessing a system.  Once root access has been enabled, a rootkit may attempt to hide any traces of unauthorized access by modifying drivers or kernel modules, hiding certain files, and quitting active processes.\nFortunately, most operating systems and software programs are designed to prevent unauthorized access via rootkits or other malware.  Therefore, it is difficult to use a rootkit to gain access to modern systems.  However, rootkits are constantly modified and updated in order to try and breach security holes.  Therefore, it is wise to install antivirus or other security software on your computer to monitor any attempts of unauthorized access to your system."
        ]
    },
    {
        "word": "Rosetta",
        "type": [],
        "definition": [
            "When Apple switched from PowerPC to Intel processors in 2006, it was important that programs written for PowerPC processors would still run on the new Intel-based Macs.  Therefore, Mac OS X for Intel computers included Rosetta, a technology that enables PowerPC programs to run on Intel processors.\nRosetta dynamically translates PowerPC instructions into Intel commands.  Users can't see Rosetta running, but it is active any time a PowerPC program is running on an Intel-based Mac.  Since translating instructions from one processor to another takes some time, PowerPC applications may run slower on Intel-based Macs.  Fortunately, the slowdown is minimal and may not even be noticed by most users.\nYou can check if an application uses Rosetta by selecting the application icon and choosing \"Get Info\" from the File Menu (Command-I).  Underneath the \"General\" section, if the Kind is listed as \"Application,\" it is a PowerPC program, which will require Rosetta to run.  If it is listed as \"Application (Universal),\" the program is a Universal application, meaning it was developed to run natively on both PowerPC and Intel computers.  You can also check what currently running programs use Rosetta by opening Activity Monitor in the \/Applications\/Utilities folder.  Underneath the \"Kind\" column, each process will be listed as either Intel or PowerPC.  Those that are listed as PowerPC are currently using Rosetta to run."
        ]
    },
    {
        "word": "Router",
        "type": [],
        "definition": [
            "This is a hardware device that routes data (hence the name) from a local area network (LAN) to another network connection.  A router acts like a coin sorting machine, allowing only authorized machines to connect to other computer systems.  Most routers also keep log files about the local network activity."
        ]
    },
    {
        "word": "Row",
        "type": [],
        "definition": [
            "A row is a horizontal group of values within a table.  It contains values for multiple fields, which are defined by columns.\nBecause rows contain data from multiple columns, in databases, each table row may be considered a record.  For example, a row (or record) from a Employee table may contain an employee's name, address, position, salary, and other information.  When querying a database, the results are typically returned as an array of rows, which is similar to a group of records.  Individual values can be accessed by selecting a specific column (or field) within a row.  \nNOTE: When displaying data in a table format, the top row is often called the table header.  The cells in the row typically contain the name of each field."
        ]
    },
    {
        "word": "Ruby",
        "type": [],
        "definition": [
            "While in the physical world, \"ruby\" refers to a red gemstone, in the computer world, ruby is an object-oriented programming language.  If a special woman in your life asks for a ruby for her birthday, I would recommend choosing the gemstone for the gift.\nThe Ruby programming language was created by Yukihiro Matsumoto and is named after the birthstone of one his colleagues.  Interestingly, the pearl (as in the Perl language) is the June gemstone, while ruby is the July gemstone.  This makes the subtle suggestion that Ruby is a step forward from Perl.\nLike Perl, Ruby's strength lies in it's simplicity.  The syntax is very basic and it is completely object-oriented.  This means every type of data handled by the language is treated as an object, even data types as simple as integers.  The source code can be interpreted by the official Ruby interpreter or by JRuby, a Java-based interpreter.\nRuby is an open-source language, like PHP, which means it is free to download and use.  It can be compiled and run on just about any operating system, including Unix, Windows, and Mac OS X.  For more information on Ruby and to download the Ruby software, visit the Ruby Home Page."
        ]
    },
    {
        "word": "Runtime",
        "type": [],
        "definition": [
            "Runtime is the period of time when a program is running.  It begins when a program is opened (or executed) and ends with the program is quit or closed.\nRuntime is a technical term, used most often in software development.  It is commonly seen in the context of a \"runtime error,\" which is an error that occurs while a program is running.  The term \"runtime error\" is used to distinguish from other types of errors, such as syntax errors and compilation errors, which occur before a program is run.\nWhen a program is in the runtime phase, the application is loaded into RAM.  This includes the executable file and any libraries, frameworks, or other files referenced by the program.  When the program is quit, the runtime period ends and the memory used by the program is made available for use by other programs."
        ]
    },
    {
        "word": "Runtime Error",
        "type": [],
        "definition": [
            "A runtime error is a program error that occurs while the program is running.  The term is often used in contrast to other types of program errors, such as syntax errors and compile time errors.\nThere are many different types of runtime errors.  One example is a logic error, which produces the wrong output.  For example, a miscalculation in the source code or a spreadsheet program may produce the wrong result when a user enters a formula into a cell.  Another type of runtime error is a memory leak.  This type of error causes a program to continually use up more RAM while the program is running.  A memory leak may be due to an infinite loop, not deallocating unused memory, or other reasons.\nA program crash is the most noticeable type of runtime error since the program unexpectedly quits while running.  Crashes can be caused by memory leaks or other programming errors.  Common examples include dividing by zero, referencing missing files, calling invalid functions, or not handling certain input correctly.\nNOTE: Runtime errors are commonly called referred to as \"bugs,\" and are often found during the debugging process, before the software is released.  When runtime errors are found after a program has been distributed to the public, developers often release patches, or small updates, designed to fix the errors."
        ]
    }
]