[
    {
        "word": "S\/PDIF",
        "type": [],
        "definition": [
            "Stands for \"Sony\/Philips Digital Interface\" and is pronounced \"spid-if\").  S\/PDIF is a digital audio transmission standard for transferring audio between two devices.  It is uni-directional (one-way) and supports uncompressed stereo audio and compressed surround sound audio.\nA S\/PDIF audio signal may be transmitted over coaxial or fiber optic cable.  Coax transmissions use RCA connectors, while optical transmissions use Toslink connectors.  Regardless of the transfer medium, a S\/PDIF signal is always digital, not analog.\nSince S\/PDIF supports multiple types of connections, S\/PDIF ports on AVRs and other devices may not be uniform.  Most modern devices that support S\/PDIF provide an optical Toslink connection.\nS\/PDIF supports uncompressed 2-channel (stereo) audio, making it an ideal interface for CD players, turntables, and other stereo audio devices.  While S\/PDIF supports surround sound signals, it does not have enough bandwidth to transmit more than two channels of uncompressed digital audio.  Therefore, S\/PDIF must transfer 5.1 and 7.2 surround sound audio in a compressed format, such as Dolby Digital.  Specifically:\nS\/PDIF Supports:\n\n2-channel uncompresed 16-bit, 44.1 kilohertz stereo audio\nCompressed surround sound audio (Dolby Digital, DD+, and DTS)\n\nS\/PDIF Does Not Support:\n\nMore than two channels of uncompressed audio\nUncompressed surround sound audio (Dolby TrueHD and DTS-HD Master Audio)\n\nUncompressed surround sound audio requires a high-bandwidth digital connection, such as HDMI or ADAT."
        ]
    },
    {
        "word": "SAN",
        "type": [],
        "definition": [
            "Stands for \"Storage Area Network.\"  A SAN is a network of storage devices that can be accessed by multiple computers.  Each computer on the network can access hard drives in the SAN as if they were local disks connected directly to the computer.  This allows individual hard drives to be used by multiple computers, making it easy to share information between different machines.\nWhile a single server can provide a shared hard drive to multiple machines, large networks may require more storage than a single server can offer.  For example, a large business may have several terabytes of data that needs to be accessible by multiple machines on a local area network (LAN).  In this situation, a SAN could be setup instead of adding additional servers.  Since only hard drives need to be added instead of complete computer systems, SANs are an efficient way to increase network storage."
        ]
    },
    {
        "word": "SATA",
        "type": [],
        "definition": [
            "Stands for \"Serial Advanced Technology Attachment,\" or \"Serial ATA.\"  It is an interface used to connect ATA hard drives to a computer's motherboard.  SATA transfer rates start at 150MBps, which is significantly faster than even the fastest 100MBps ATA\/100 drives.  For this and other reasons, Serial ATA is likely to replace the previous standard, Parallel ATA (PATA), which has been around since the 1980s.\nBesides faster transfer rates, the SATA interface has several advantages over the PATA interface.  For one, SATA drives each have their own independent bus, so there is no competition for bandwidth like there is with Parallel ATA.  They also use smaller, thinner cables, which allows for better airflow inside the computer.  SATA cables can be as long as one meter, while PATA cables max out at 40cm.  This gives manufacturers more liberty when designing the internal layout of their computers.  Finally, Serial ATA uses only 7 conductors, while Parallel ATA uses 40.  This means there is less likely to be electromagnetic interference with SATA devices.\nIn summary, Serial ATA is a better, more efficient interface than the dated PATA standard.  If you are looking to buy a computer that will support fast hard drives for years to come, make sure it comes with a SATA interface."
        ]
    },
    {
        "word": "SCSI",
        "type": [],
        "definition": [
            "Stands for \"Small Computer System Interface,\" and is pronounced \"scuzzy.\"  SCSI is a computer interface used primarily for high-speed hard drives.  This is because SCSI can support faster data transfer rates than the commonly used IDE storage interface.  SCSI also supports daisy-chaining devices, which means several SCSI hard drives can be connected to single a SCSI interface, with little to no decrease in performance.\nThe different types of SCSI interfaces are listed below:\n\nSCSI-1: Uses an 8-bit bus, supports data transfer speeds of 4 MBps.\nSCSI-2: Uses a 50-pin connector instead of a 25-pin connector, and supports multiple devices. It is one of the most commonly used SCSI standards. Data transfer speeds are typically around 5 MBps.\nWide SCSI: Uses a wider cable (168 cable lines to 68 pins) to support 16-bit data transfers.\nFast SCSI: Uses an 8-bit bus, but doubles the clock rate to support data transfer speeds of 10 MBps.\nFast Wide SCSI: Uses a 16-bit bus and supports data transfer speeds of 20 MBps.\nUltra SCSI: Uses an 8-bit bus, supports data rates of 20 MBps.\nSCSI-3: Uses a 16-bit bus, supports data rates of 40 MBps. Also called Ultra Wide SCSI.\nUltra2 SCSI: Uses an 8-bit bus, supports data transfer speeds of 40 MBps.\nWide Ultra2 SCSI: Uses a 16-bit bus, supports data transfer speeds of 80 MBps.\nUltra3 SCSI: Uses a 16-bit bus, supports data transfer rates of 160 MBps. Also known as Ultra-160.\nUltra-320 SCSI: Uses a 16-bit bus, supports data transfer speeds of 320 MBps.\nUltra-640 SCSI: Uses a 16-bit bus, supports data transfer speeds of 640 MBps.\n\nWhile SCSI is still used for some high-performance equipment, newer interfaces have largely replaced SCSI in certain applications.  For example, Firewire and USB 2.0 have become commonly used for connecting external hard drives.  Serial ATA, or SATA, is now used as a fast interface for internal hard drives.\n"
        ]
    },
    {
        "word": "SD",
        "type": [],
        "definition": [
            "Stands for \"Secure Digital.\"  SD is a type of memory card used to store data in portable electronic devices.  Examples include digital cameras, video recorders, smartphones, and portable music players.  SD cards are considered removable storage (instead of internal or external storage), since they can be inserted and removed from a compatible device.\nThe first SD cards were introduced in 1999.  They used almost the same form factor as the existing MultiMediaCard (MMC) format, but were slightly thicker (2.1 mm vs 1.4 mm).   The dimensions of a standard SD card are:\n\n24 mm wide\n32 mm tall\n2.1 mm thick\n\nEach SD card has a slanted upper-right corner to ensure the card can only be inserted one way.  The left side of a card has a physical slider that prevents the card from being written (read-only) when moved to the LOCK position.  The \"secure\" part of \"Secure Digital\" refers to its built-in DRM protection technology.  The SD format supports Content Protection for Recordable Media (CPRM), which prevents protected content from being read from another storage device.\nSince its introduction in 1999, the SD card format has gone through several iterations.  Below are different versions of SD, listed with their storage capacity and maximum data transfer rate.\n\nSD - 2 GB capacity, 12.5 MB\/sec\nSDHC - 32 GB capacity, 25 MB\/sec\nSDXC - 2 TB capacity, 312 MB\/sec\nSDUC - 128 TB capacity, 985 MB\/sec\n\nAnother version of SD, called microSD, was introduced in 2005.  microSD cards are much smaller than SD cards, with dimensions of 11 mm x 15 mm x 1mm.  Small devices like GoPros and smartphones have microSD slots to reduce the overall device size as much as possible.  microSD cards can be used in standard SD card slots using a microSD-to-SD adapter."
        ]
    },
    {
        "word": "SDK",
        "type": [],
        "definition": [
            "Stands for \"Software Development Kit.\"  An SDK is a collection of software used for developing applications for a specific device or operating system.  Examples of SDKs include the Windows 7 SDK, the Mac OS X SDK, and the iPhone SDK.\nSDKs typically include an integrated development environment (IDE), which serves as the central programming interface.  The IDE may include a programming window for writing source code, a debugger for fixing program errors, and a visual editor, which allows developers to create and edit the program's graphical user interface (GUI).  IDEs also include a compiler, which is used to create applications from source code files.\nMost SDKs contain sample code, which provides developers with example programs and libraries.  These samples help developers learn how to build basic programs with the SDK, which enables them to eventually create more complex applications.  SDKs also offer technical documentation, which may include tutorials and FAQs.  Some SDKs may also include sample graphics, such as buttons and icons, which can be incorporated into applications.\nSince most companies want to encourage developers to create applications for their platform, SDKs are usually provided free of charge.  Developers can simply download an SDK from a company's website and begin programming immediately.  However, since each software development kit is different, it can take awhile for developers to learn how to use a new SDK.  Therefore, most modern SDKs include extensive documentation and have an intuitive programming interface, which helps incentivize program development."
        ]
    },
    {
        "word": "SDLC",
        "type": [],
        "definition": [
            "Stands for \"System Development Lifecycle.\"  SDLC is a structured approach to creating and maintaining a system used in information technology.  It can be applied to networks and online services, but is most often used in software development.\nWhen applied to software, the SDLC is also called the \"application development life-cycle.\"  Some SDLC models have as few as five stages, while others have as many as ten.  A typical SDLC framework used for developing a software application might include the following seven stages:\n\nPlanning - The most fundamental part of the SDLC is planning.  This includes steps like determining a need for a specific program, who will be the end users, what the development will cost, and how long it will take.\nDefining - In this stage, the general development plan is funneled into specific criteria.  The specific requirements of the program are defined.  At this stage, the development team may also decide what programming language should be used to build the program.\nDesigning - This process involves creating the user interface and determining how the program will function.  For larger applications, it is common to create a design document specification (DDS), which may need to be reviewed and approved before the actual development begins.\nBuilding - The building stage typically comprises the bulk of the software development process.  It includes programming the source code, creating the graphics, and compiling the assets into an executable program.  Small projects may involve a single programmer, while larger projects may include multiple teams working together.  For example, one team might design the user interface, while another team writes the source code.  For multiplatform applications, individual teams may be assigned to different platforms.\nTesting - The all-important testing phase allows the developer to catch unknown issues and fix any bugs that arise in the program.  Some testing may be done internally, while a beta version of the software might be provided to a select group of users for public testing.\nDeployment - Once a program has passed the testing phase, it is ready for deployment.  In this stage, the software is released to the public.  It may be provided via an electronic download or as boxed software, which comes on a CD or DVD.\nMaintenance - After a software application has been released, there may still be additional bugs or feature requests submitted by users.  The development team must maintain the software by fixing bugs and adding new features.  Commercial software programs often include some level of technical support.\n\nThe reason the above stages are referred to as a cycle is because these stages are repeated each time a new major version of the software is released.  While the maintenance stage may encompass minor updates, most software companies stay in business by regularly releasing paid updates (version 2, version 3, etc).  Before embarking on a new major version, the development team must first create a plan (stage 1) and then continue through the other stages of the SDLC."
        ]
    },
    {
        "word": "SDRAM",
        "type": [],
        "definition": [
            "Stands for \"Synchronous Dynamic Random Access Memory.\"  Yeah, it's a mouthful, but if you memorize it, you can really impress your friends.  SDRAM is an improvement to standard DRAM because it retrieves data alternately between two sets of memory.  This eliminates the delay caused when one bank of memory addresses is shut down while another is prepared for reading.\nIt is called \"Synchronous\" DRAM because the memory is synchronized with the clock speed that the computer's CPU bus speed is optimized for.  The faster the bus speed, the faster the SDRAM can be.  SDRAM speed is measured in Megahertz, which makes it easy to compare the processor's bus speed to the speed of the memory."
        ]
    },
    {
        "word": "SDS",
        "type": [],
        "definition": [
            "Stands for \"Software-Defined Storage.\"  SDS is software that manages data storage devices.  It is commonly used for managing large amounts of data in data centers, server farms, and enterprise environments.\nSDS functions independently of the underlying hardware.  It can merge several physical storage devices into one virtual storage volume.  For example, five HDDs that have a storage capacity of 2 terabytes can be merged into a single 10 terabyte storage area instead of five separate volumes.\nModern SDS programs use virtualization to create flexible storage solutions.  A storage hypervisor monitors the devices and dynamically allocates data across them.  It can also provide warnings when data storage limits are near capacity.  Virtualized SDS configurations make it easy to add or remove storage devices as needed to increase or reduce storage.\nSDS is an important data management tool for web hosts, CDNs, and other organizations that need to manage large amounts of data.  It provides an efficient way of scaling storage requirements with little to no downtime.\n"
        ]
    },
    {
        "word": "SDSL",
        "type": [],
        "definition": [
            "Stands for \"Symmetric Digital Subscriber Line.\"  SDSL is a type of of DSL, which is used for transferring data over copper telephone lines.  The \"symmetric\" part of the term means that an SDSL connection has the same maximum upload and download speeds.\nADSL, on the other hand, typically provides much faster download speeds than upload speeds.  Because most Internet users download much more data than they upload, ISPs usually offer ADSL connections rather than SDSL."
        ]
    },
    {
        "word": "SEO",
        "type": [],
        "definition": [
            "Stands for \"Search Engine Optimization.\"  Just about every Webmaster wants his or her site to appear in the top listings of all the major search engines.  Say, for example, that Bob runs an online soccer store.  He wants his site to show up in the top few listings when someone searches for \"soccer shoes.\"  Then he gets more leads from search engines, which means more traffic, more sales, and more revenue.  The problem is that there are thousands of other soccer sites, whose Webmasters are hoping for the same thing.  That's where search engine optimization, or SEO, comes in.\nSEO involves a number of adjustments to the HTML of individual Web pages to achieve a high search engine ranking.  First, the title of the page must include relevant information about the page.  In the previous example, Bob's home page might have the title, \"Bob's Soccer Store -- Soccer Shoes and Equipment.\"  The title is the most important part of SEO, since it tells the search engine exactly what the page is about.  Within Bob's home page, it would be helpful to repeat the words \"soccer\" and \"soccer shoes\" a few times, since search engines also scan the text of the pages they index.\nFinally, there are META tags.  These HTML tags can really distinguish your site from the rest of the pile.  The META tags that most search engines read are the description and keywords tags.  Within the description tags, you should type a brief description of the Web page.  It should be similar but more detailed than the title.  Within the keywords tags, you should list 5-20 words that relate to the content of the page.  Using META tags can significantly boost your search engine ranking.\nSo what happens when a bunch of sites all have similar titles, content, and META tags?  Well, most search engines choose to list the most popular sites first.  But then how do you get into the most popular sites?  The best way is to submit your site to Web directories (not just search engines) and get other sites to link to yours.  It can be a long climb to the top, but your perseverance will pay off."
        ]
    },
    {
        "word": "SERP",
        "type": [],
        "definition": [
            "Stands for \"Search Engine Results Page.\"  A SERP is the page that you see after you perform a search using a search engine.  It includes a list of search results that are relevant to the search phrase or keywords you entered.  Each search result typically includes the title of the page and a brief description of the page.  The description may either be taken from the page's description meta tag or may contain snippets of text from the page that contain keywords from the search phrase.\nSERPs vary between search engines, but they all use a similar layout.  The top of the page contains the search field, which typically shows the user's most recent query.  The results are then displayed in order of relevance beneath the search field.  Many search engines also include other search options, such as Images, Video, and News searches.  You may also find an \"Advanced Search\" link that provides options for performing a more specific search.\nThe results produced by the search engine's search algorithm are known as \"organic results.\"  These results are the primary content of each SERP and are displayed for every search in which results are found.  Since webmasters typically want their sites to rank high on relevant SERPs, various search engine optimization SEO techniques can be used to try and improve the ranking of pages on SERPs.\nDepending on the search phrase entered, the search engine may also display ads or \"paid listings.\"  These links are typically displayed above the initial search results and on the right side of the page.  Typically these ads are denoted by a phrase such as \"Sponsored Links\" or \"Sponsored Results.\"  They are supplied by advertisers who bid on keywords that are relevant to their content.  Paid listings provide a way for companies to generate traffic to their websites through search engines even if their organic search ranking is not very high."
        ]
    },
    {
        "word": "SIM Card",
        "type": [],
        "definition": [
            "Stands for \"Subscriber Identification Module Card.\"  A SIM card is a small removable chip that identifies a mobile device on a cellular network.  It contains an integrated circuit that stores a unique identifier called an \"international mobile subscriber identity\" (IMSI) number and other information specific to the mobile carrier.\nA SIM card or an embedded SIM is required in order for any cell phone, smartphone, or tablet to be used on a cellular network.  When you activate a cell phone, the cellular provider links your phone number to your SIM card, which allows you to make receive calls and access cellular data.  If you replace your SIM card or a get a new phone with a new SIM card, the new SIM identifier must be linked to your account in order for your mobile device to be recognized on the network.\nSIM cards have been standardized in increasingly smaller sizes since the first SIM card was used in 1991.  Below are several SIM card formats.\n\nFull size (1991) - 85.6 x 53.98 mm x 0.76 mm\nMini-SIM (1996) - 25 x 15 mm x 0.76 mm\nMicro-SIM (2003) - 15 x 12 mm x 0.76 mm\nNano-SIM (2012) - 12.3 x 8.8 mm x 0.67 mm\n\nCellular devices are designed to work with a specific SIM card format so if you need to replace your SIM card, it is important to verify the correct size with your cellular provider.\nRemoving a SIM card is usually pretty simple.  Some devices, like the iPhone, have a SIM card tray that pops out from the side of the device.  You can open the tray by pressing the access hole with a paperclip.  Other devices, such as the Samsung Galaxy, require you to remove the back cover and battery to access the SIM card.  You can remove and replace the SIM card without powering down your device."
        ]
    },
    {
        "word": "SIMM",
        "type": [],
        "definition": [
            "Stands for \"Single In-Line Memory Module.\"  This is an older type of computer memory.  A SIMM is a small circuit board with a bunch of memory chips on it.  SIMMs use a 32-bit bus, which is not as wide as the 64-bit bus dual in-line memory modules (DIMMs) use.  Newer processors require a 64-bit memory bus, so it is best to use DIMMs.  Sometimes you can get away with installing SIMMS, but they have to be installed in pairs."
        ]
    },
    {
        "word": "SIP",
        "type": [],
        "definition": [
            "Stands for \"Session Initiation Protocol.\"  SIP is a protocol defined by the Internet Engineering Task Force (IETF).  It is used for establishing sessions between two or more telecommunications devices over the Internet.\nSIP has many applications, such as initiating video conferences, file transfers, instant messaging sessions, and multiplayer games.  However, it is most well known for establishing voice and video calls over the Internet.  VoIP companies, such as Vonage, Phone Power, and others, use SIP to provide Internet-based telephone services.  This system, called \"SIP trunking\" allows clients to communicate over standard phone lines using IP phones or computers with VoIP software installed.  A SIP server provides the translation from the VoIP connection to the public switched telephone network (PSTN).\nSimilar to HTTP, SIP uses simple request and response messages to initiate sessions.  For example, the INVITE request message is used to invite a user to begin a session and ACK confirms the user has received the request.  The response code 180 (Ringing) means the user is being alerted of the call and 200 (OK) indicates the request was successful.  Once a session has been established, BYE is used to end the communication.  While SIP codes are not always seen by users, they can be useful when troubleshooting unreliable connections.\nNOTE: SIP may also stand for \"Standard Interchange Protocol,\" which is a library system communication standard developed by 3M.  SIP and SIP2 were designed to handle basic inventory operations, such as checking in and checking out library books.  Both versions of the Standard Interchange Protocol have been largely replaced by the National Information Standards Organization Circulation Interchange Protocol (NCIP)."
        ]
    },
    {
        "word": "SKU",
        "type": [],
        "definition": [
            "Stands for \"Stock Keeping Unit,\" and is conveniently pronounced \"skew.\"  A SKU is a number or string of alpha and numeric characters that uniquely identify a product.  For this reason, SKUs are often called part numbers, product numbers, and product identifiers.\nSKUs may be a universal number such as a UPC code or supplier part number or may be a unique identifier used by a specific a store or online retailer.  For example, one company may use the 10 character identifier supplied by the manufacturer as the SKU of an external hard drive.  Another company may use a proprietary 6-digit number as the SKU to identify the part.  Many retailers use their own SKU numbers to label products so they can track their inventory using their own custom database system.\nWhen shopping online or at retail stores, knowing a product's SKU can help you locate the exact product at a later time.  It will help you identify a unique product when there are many similar options, such as a TV model that comes in different colors, sizes, etc.  If you know a product's SKU, you can typically locate the product online by typing the SKU in the online retailer's search box.  If you visit a retail store and have questions about product you saw in an ad, knowing the SKU will help the salesperson find the exact product you are asking about.  SKUs are typically listed in small print below the product name and are often preceded by the words \"SKU,\" \"Part Number,\" \"Product ID,\" or something similar."
        ]
    },
    {
        "word": "SLA",
        "type": [],
        "definition": [
            "In the computer world, an \"SLA\" may refer to either 1) a software license agreement, or 2) a service level agreement.\n1. Software License Agreement\nA software license agreement (also called an end user license agreement or EULA) is a contract between the software developer and the user.  While boxed software used to come with a hard copy of the SLA, most software license agreements are now distributed digitally.  For example, the software license agreement is usually displayed on your screen during the software installation process.  After scrolling through an SLA, you will typically see a button that says, \"I Agree\" or \"I Accept.\"  By clicking the button, you agree to the terms of the SLA and therefore are allowed to install and use the software.\nMost software license agreements are rather long and contain a lot of legal terms.  The SLA may include license limitations, such as how many people can use the software and how many systems the software may be installed on.  Most SLAs also include disclaimers that state the developer is not liable for problems caused by the software.  While these disclaimers are often several paragraphs in length, they are basically saying, \"Use at your own risk.\"\n2. Service Level Agreement\nA service level agreement is a contract between a service provider and a user.  In most cases, the agreement is between a business and a consumer, though SLAs may be established between two business as well.  In either case, the SLA defines specific services that are guaranteed over a given amount of time, often for a specific price.\nA common example of a service level agreement is a computer warranty that covers the parts and labor of a computer.  The warranty may state that the manufacturer agrees to cover any service costs due to failed components for one or more years.  Other SLA examples include monthly contracts with ISPs, or annual contracts with cell phone companies.  In both instances, the companies agree to provide reliable services to customers as long as they pay their monthly subscription fee."
        ]
    },
    {
        "word": "SLI",
        "type": [],
        "definition": [
            "Stands for \"Scalable Link Interface.\"  SLI is a technology developed by NVIDIA that allows multiple graphics cards to work together in a single computer system.  This enables faster graphics performance than what is possible with a single card.  For example, using SLI to link two cards together may offer up to twice the performance of a single video card.  If each card has two GPUs, the result may be up to four times the performance of a typical video card!\nFor video cards to be linked using NVIDIA's SLI system, the computer must have multiple PCI Express slots.  PCI Express is the first video card interface that allows the linking of multiple graphics cards because the slots share the same bus.  Previous technologies, such as PCI and AGP, used separate buses, which did not allow graphics cards to be bridged together.  The PCI Express slots must also support enough bandwidth for the cards, which typically means they must be x8 or x16 slots.  Of course, the cards themselves must also support SLI bridging in order to work together."
        ]
    },
    {
        "word": "SMART",
        "type": [],
        "definition": [
            "Stands for \"Self-Monitoring Analysis And Reporting Technology.\"  It is used to protect and prevent errors in hard drives.  The SMART technology basically monitors and analyzes hard drives (hence the name), then checks the health of your hard drive and lets you know if there are any problems.  The main purpose of SMART is to keep your hard drive running smoothly and prevent it from crashing."
        ]
    },
    {
        "word": "SMB",
        "type": [],
        "definition": [
            "Stands for \"Server Message Block.\"  SMB is a network protocol used by Windows-based computers that allows systems within the same network to share files.  It allows computers connected to the same network or domain to access files from other local computers as easily as if they were on the computer's local hard drive.\nNot only does SMB allow computers to share files, but it also enables computers to share printers and even serial ports from other computers within the network.  For example, a computer connected to a Windows network could print a document on a printer connected to another computer on the network, as long as both machines support the SMB protocol.\nThough SMB was originally developed for Windows, it can also be used by other platforms, including Unix and Mac OS X, using a software implementation called Samba.  By using Samba instructions, Mac, Windows, and Unix computers can share the same files, folders, and printers.  This is great for those Windows-based office networks where there is a graphic designer who refuses to use anything but a Mac and a tech guy who does everything on his Linux machine."
        ]
    },
    {
        "word": "SMM",
        "type": [],
        "definition": [
            "Stands for \"Social Media Marketing.\"  SMM refers to marketing done through social media or social networking websites.  While most companies and organizations have their own websites, it can be difficult to reach users who do not already know about the organization.  Therefore, many organizations have found it useful to also develop a presence on \"Web 2.0\" websites, such as Facebook, LinkedIn, and Twitter as well.\nSocial media marketing provides a low cost way for businesses to reach large numbers of users and gain brand recognition.  Since social networking websites already have large established online communities, businesses and organizations can gain exposure by simply joining these websites.  Organizations can create custom social media profiles, then build their own communities within these sites by adding users as friends or followers.  Many companies attract users by posting frequent updates and providing special offers through their social media profile pages.\nWhile SMM is a powerful online marketing tool, it is typically used to supplement other online marketing methods rather than replace them.  Since just about any company or business and join a social networking website, it can be difficult to stand out from the crowd.  Therefore, most companies still rely on Web advertising and search engine optimization SEO to generate traffic to the their websites."
        ]
    },
    {
        "word": "SMP",
        "type": [],
        "definition": [
            "Stands for \"Symmetric Multiprocessing.\"  SMP is a type of multiprocessing in which all processors may be used at the same time.  It is sometimes contrasted with asymmetric multiprocessing, which delegates each processor to a specific task.\nThe vast majority of computers with multiple processors (or processing cores) support SMP.  It is implemented at the operating system level, which distributes computing tasks across two or more processors.  Modern OSes, such as Windows, macOS, and Unix have supported SMP since the late 1990s.\nMost software applications benefit automatically from SMP, thanks to the underlying OS support.  However, developers may still optimize apps to use multiple processors even more effectively.  For example, a video editing program might send specific rendering operations to different processors, which may be more efficient than letting the OS balance the processing load.\nHow SMP Works\nSMP requires multiple homogenous processors, meaning each processor has the same architecture and clock speed.  All processors share the same system bus and system memory, so no processor is prioritized over the others.  The OS distributes computing operations across the processors (or processing cores), attempting to use them all equally.\nSMP can substantially improve a computer's performance compared to a single-processor system.  However, since individual threads are sent to different processors, there is overhead in distributing the tasks.  Additionally, not all computing operations can be split across multiple processors.  Therefore, SMP does not increase performance by 100% for each additional processor."
        ]
    },
    {
        "word": "SMS",
        "type": [],
        "definition": [
            "Stands for \"Short Message Service.\"  SMS is used to send text messages to mobile phones.  The messages can typically be up to 160 characters in length, though some services use 5-bit mode, which supports 224 characters.  SMS was originally created for phones that use GSM (Global System for Mobile) communication, but now all the major cell phone systems support it.\nWhile SMS is most commonly used for text messaging between friends or co-workers, it has several other uses as well.  For example, subscription SMS services can transmit weather, news, sports updates, and stock quotes to users' phones.  SMS can also notify employees of sales inquiries, service stops, and other information pertinent to their business.  Doctors can receive SMS messages regarding patient emergencies.\nFortunately, text messages sent via SMS do not require the recipient's phone to be on in order for the message to be successfully transmitted.  The SMS service will hold the message until the recipient turns on his or her phone, at which point the message will be be sent to the recipient's phone.  Most cell phone companies allow you to send a certain number of text messages every month for no charge.  Though it would be a good idea to find out what that number is before you go text message crazy."
        ]
    },
    {
        "word": "SMTP",
        "type": [],
        "definition": [
            "Stands for \"Simple Mail Transfer Protocol.\"  This is the protocol used for sending e-mail over the Internet.  Your e-mail client (such as Outlook, Eudora, or Mac OS X Mail) uses SMTP to send a message to the mail server, and the mail server uses SMTP to relay that message to the correct receiving mail server.  Basically, SMTP is a set of commands that authenticate and direct the transfer of electronic mail.  When configuring the settings for your e-mail program, you usually need to set the SMTP server to your local Internet Service Provider's SMTP settings (i.e. \"smtp.yourisp.com\").  However, the incoming mail server (IMAP or POP3) should be set to your mail account's server (i.e. hotmail.com), which may be different than the SMTP server."
        ]
    },
    {
        "word": "SNMP",
        "type": [],
        "definition": [
            "Stands for \"Simple Network Management Protocol.\"  SNMP is used for exchanging management information between network devices.  For example, SNMP may be used to configure a router or simply check its status.  There are four types of SNMP commands used to control and monitor managed devices: 1) read, 2) write, 3) trap, and 4) traversal operations.\nThe read command is used to monitor devices, while the write command is used to configure devices and change device settings.  The trap command is used to \"trap\" events from the device and report them back to the monitoring system.  Traversal operations are used to determine what variables a certain device supports.\nSNMP has no authentication capabilities, which means it is not a very secure protocol.  For this reason, SNMP is often used for monitoring networks rather than managing them.  So, practically speaking, SNMP could be considered as a \"Simple Network Monitoring Protocol\" instead."
        ]
    },
    {
        "word": "SO-DIMM",
        "type": [],
        "definition": [
            "Stands for \"Small Outline Dual In-Line Memory Module.\"  Most desktop computers have plenty of space for RAM chips, so the size of the memory modules is not a concern.  However, with laptops, the size of the memory modules matters significantly.  Because laptops are designed to be as small and as light as possible, the size of each component matters.  In fact, laptop parts are so crammed together, large RAM chips often do not fit into the overall laptop design.  This is why SO-DIMMs were created.\nA SO-DIMM is about half the length of a regular size DIMM.  This allows greater flexibility in designing the memory slots for laptops.  Many laptops have a user-accessible section that houses the SO-DIMMs, which make it easy to upgrade the computer's RAM.  If the RAM chips were full size DIMMs, this type of design would be harder to incorporate and would likely increase the size of the laptop.\nThe first SO-DIMMs used 72 pins (or connectors) and supported 32-bit data transfers.  Modern SO-DIMMs, however, typically use 144 pins, which allows for the same 64-bit transfers that a regular size DIMM does.  While SO-DIMMs are used primarily in laptops, some desktop computers with small form factors also use SO-DIMMs to reduce the overall size of the case.  However, when size is not an issue, regular DIMMs are typically used because they are a more cost-effective solution."
        ]
    },
    {
        "word": "SOA",
        "type": [],
        "definition": [
            "Stands for \"Service Oriented Architecture.\"  When businesses grow, they often add new products and services.  While these additions may help make the business larger, it is often difficult to implement them in an efficient manner.  The goal of SOA is to make it easy for businesses to grow and add new services.\nThe Service Oriented Architecture is based on components that work seamlessly with each other.  For example, a company sells clothing through an online store.  After a few months of successful sales, the company decides to add a jewelry department.  An SOA component conveniently adds a new section to the store, in this case, specifically for jewelry.  The company then wants to add new shipping options.  A SOA shipping component makes adding the new shipping options as easy as checking a few boxes in an administrative control panel.  Initially, the company only offered e-mail support, but later decides that adding phone support would be beneficial.  A phone support component allows the phone representatives to look up customer orders the same way the e-mail support specialists could.\nBasically, SOA makes it possible for a business to add new features and services without having to create them from scratch.  Instead, they can be added or modified as needed, making it simple and efficient to expand the business.  Because many products and services are now offered via the Web, most SOA solutions include Web-based implementations."
        ]
    },
    {
        "word": "SOAP",
        "type": [],
        "definition": [
            "Stands for \"Simple Object Access Protocol,\" and can do more than just get your hands clean.  SOAP is a method of transferring messages, or small amounts of information, over the Internet.  SOAP messages are formatted in XML and are typically sent using HTTP (hypertext transfer protocol).  Both are widely supported data transmission standards.  HTTP, which is the protocol that Web pages are sent over, has the additional advantage of avoiding most network firewalls.  Since firewalls usually do not block port 80 (HTTP) traffic, most SOAP messages can pass through without any problems.\nEach SOAP message is contained in an \"envelope\" that includes a header and a body.  The header may include the message ID and date the message was sent, while the body contains the actual message.  Because SOAP messages all use the same format, they are compatible with many different operating systems and protocols.  For example, a user can send a SOAP message from a Windows XP machine to a Unix-based Web server without worrying about the message being altered.  The Unix machine can then redirect the message to the appropriate location or open the file using a program on the system.  While most SOAP messages are sent over the Web via HTTP, they can also be sent via e-mail, using SMTP."
        ]
    },
    {
        "word": "SPF",
        "type": [],
        "definition": [
            "Stands for \"Sender Policy Framework.\"  SPF is a email authentication system designed to prevent email spoofing.  It works by verifying that an email message is sent from an authorized IP address.  SPF is commonly used alongside DKIM, another email verification technology, though they are not dependent on each other.\nIn order for SPF verification to take place, the sender policy framework must be configured on the outgoing mail server.  This involves turning on SPF and creating SPF record.  The SPF record includes one or more IP addresses that are authorized to send mail for a specific domain name.  A website admin tool like cPanel will automatically generate an SPF record when the service is enabled in the Email &rarr; Authentication control panel.  Records can also be created manually.  Below is an example of a valid SPF record with two IP addresses.\nv=spf1 +a +mx +ip4:12.34.56.78 +ip4:12.34.56.79 ~all\nThe v variable at the beginning of the string is the version.  a means \"pass\" if the IP address has an A record in the domain's zone file. mx means \"pass\" if the IP address is one of the MX hosts listed in the DNS  The ip4 means \"pass\" if the IP address matches the corresponding IPv4 address.  Finally, ~all means \"soft fail\" if the information cannot be verified.\nThe possible results of an SPF check are:\n\nPass\nFail\nSoftFail\nNeutral\nNone\nTempError\nPermError\n\nGenerally, the only type of error that will cause a message to be rejected is a \"Fail\" response.  PermError, TempError, and SoftFail may also cause a message to be rejected, depending on the receiving mail server's settings.  In most cases, a message with a SoftFail response will still be delivered, but it may have a higher spam score than a message that passes the check.  This might cause a mail client to label the message as junk.  Emails that pass SPF verification are less likely to be marked as spam, increasing the deliverability of legitimate messages.\nNOTE: Like DKIM, you can typically see the results of the SPF check by viewing the headers in an email message."
        ]
    },
    {
        "word": "SPX",
        "type": [],
        "definition": [
            "Stands for \"Sequenced Packet Exchange.\"  SPX is networking protocol primarily used by Novell Netware, but is also supported by other operating systems.  It is now considered a legacy protocol since it has largely been replaced by TCP\/IP.\nSPX is the transport layer of the the IPX\/SPX protocol and IPX is the network layer.  SPX handles the connections between systems while IPXhandles the actual transfer of data.  Therefore, SPX commands are used to establish, confirm, and close connections, while IPX commands are used to send and receive data packets.  SPX is similar to TCP and IPX is similar to IP in the TCP\/IP protocol.\nThe IPX\/SPX (or SPX\/IPX) protocol originally handled the transport and network commands for the NetWare Core Protocol (NCP).  A system running NCP Server (typically a Linux machine) could receive connections from computers running NCP client software.  The NCP protocol provided functions for accessing files and directories, syncing clocks, and messaging between systems.  When Novell enabled NCP servers to use the universal TCP\/IP protocol, it soon replaced the proprietary NCP protocol suite.\nNOTE: Micro Focus acquired Novell in November, 2014."
        ]
    },
    {
        "word": "SQL",
        "type": [],
        "definition": [
            "Stands for \"Structured Query Language,\" and can be pronounced as either \"sequel\" or \"S-Q-L.\"  It is a query language used for accessing and modifying information in a database.  Some common SQL commands include \"insert,\" \"update,\" and \"delete.\"  The language was first created by IBM in 1975 and was called SEQUEL for \"Structured English Query Language.\"  Since then, it has undergone a number of changes, many coming from Oracle products.\nToday, SQL is commonly used for Web database development and management.  Though SQL is now considered to be a standard language, there are still a number of variations of it, such as mSQL and mySQL.  By using a scripting language like PHP, SQL commands can be executed when a Web page loads.  This makes it possible to create dynamic Web pages that can display different information each time they load."
        ]
    },
    {
        "word": "SRAM",
        "type": [],
        "definition": [
            "Stands for \"Static Random Access Memory.\"  I know it is tempting to pronounce this term as \"Sram,\" but it is correctly pronounced \"S-ram.\"  SRAM is a type of RAM that stores data using a static method, in which the data remains constant as long as electric power is supplied to the memory chip.  This is different than DRAM (dynamic RAM), which stores data dynamically and constantly needs to refresh the data stored in the memory.  Because SRAM stores data statically, it is faster and requires less power than DRAM.\nHowever, SRAM is more expensive to manufacture than DRAM because it is built using a more complex structure.  This complexity also limits the amount of data a single chip can store, meaning SRAM chips cannot hold as much data as DRAM chips.  For this reason, DRAM is most often used as the main memory for personal computers.  However, SRAM is commonly used in smaller applications, such as CPU cache memory and hard drive buffers.  It is also used in other consumer electronics, from large appliances to small children's toys.\nIt is important to not confuse SRAM with SDRAM, which is a type of DRAM."
        ]
    },
    {
        "word": "SRE",
        "type": [],
        "definition": [
            "Stands for \"Site Reliability Engineering.\"  SRE is a structured approach to software development that originated at Google.  The goal of SRE is to create and maintain software applications that are reliable and scalable.\nSRE is similar to DevOps, but is developer-focused.  Instead of requiring two separate teams (development and operations), SRE developers work as a unified team to produce reliable software.  The ideal SRE team includes developers with different specialties so that each developer can provide beneficial insight.\nSRE focuses on stability rather than agility and proactive engineering rather than reactive development.\nSite reliability engineering is designed to give developers more freedom to create innovative software solutions.  By establishing reliable software systems with redundancy and safeguards in place, developers are not limited by traditional operations protocols.  For example, in a DevOps team, the operations manager may need to approve each software update before it is published.  In SRE, developers may be allowed to release updates as needed.\nSince SRE is developer-focused, the manager of an SRE team must have development experience, not just operations knowledge.  An SRE manager may actively help with software development instead of merely overseeing it.\nNOTE: SRE is also short for \"Site Reliability Engineer,\" a title given to a member of a site reliability engineering team."
        ]
    },
    {
        "word": "SRM",
        "type": [],
        "definition": [
            "Stands for \"Storage Resource Management.\"  SRM is the process of managing large amounts of data.  It includes efficiently managing existing data, backing up data, and scaling data storage solutions to grow with increasing storage requirements.\nSRM software monitors and analyzes data storage usage for a specific storage environment, such as a local storage area network (SAN) or a cloud-based storage system.  The software allocates data across multiple storage devices, including HDDs, SSDs, so that the storage is distributed efficiently.  It can alert a system administrator when storage devices are failing or when additional storage is needed.\nMany SRM applications also manage data backups.  Some back up data on-the-fly, while others perform backups at regular intervals.  A storage network managed by an SRM may have a failover system where a backup storage device is activated if the primary storage device fails.\nStorage resource management also supports scalability.  It enables the addition of new storage devices as more storage is needed.  SRM software can detect new storage devices and automatically distribute existing and new data across them.  This makes it easy to add extra data capacity to storage networks as needed.\nAs data usage continues to grow, large businesses and organizations may find themselves managing several petabytes or even exabytes of data.  SRM technology makes this a manageable task by efficiently organizing data, backing it up, and providing a simple means of adding new storage."
        ]
    },
    {
        "word": "SSD",
        "type": [],
        "definition": [
            "Stands for \"Solid State Drive.\"  An SSD is a type of mass storage device similar to a hard disk drive (HDD).  It supports reading and writing data and maintains stored data in a permanent state even without power.  Internal SSDs connect to a computer like a hard drive, using standard IDE or SATA connections.\nWhile SSDs serve the same function as hard drives, their internal components are much different.  Unlike hard drives, SSDs do not have any moving parts (which is why they are called solid state drives).  Instead of storing data on magnetic platters, SSDs store data using flash memory.  Since SSDs have no moving parts, they don't have to \"spin up\" while in a sleep state and they don't need to move a drive head to different parts of the drive to access data.  Therefore, SSDs can access data faster than HDDs.\nSSDs have several other advantages over hard drives as well.  For example, the read performance of a hard drive declines when data gets fragmented, or split up into multiple locations on the disk.  The read performance of an SSD does not diminish based on where data is stored on the drive.  Therefore defragmenting an SSD is not necessary.  Since SSDs do not store data magnetically, they are not susceptible to data loss due to strong magnetic fields in close proximity to the drive.  Additionally, since SSDs have no moving parts, there is far less chance of a mechanical breakdown.  SSDs are also lighter, quieter, and use less power than hard drives.  This is why SSDs have become a popular choice for laptop computers.\nWhile SSDs have many advantages over HDDs, they also have some drawbacks.  Since the SSD technology is much newer than traditional hard drive technology, the price of SSDs is substantially higher.  As of early 2011, SSDs cost about 10 times as much per gigabyte as a hard drive.  Therefore, most SSD drives sold today have much smaller capacities than comparable hard drives.  They also have a limited number or write cycles, which may cause their performance to degrade over time.  Fortunately, newer SSDs have improved reliability and should last several years before any reduction in performance is noticeable.  As the SSD technology improves and the prices continue to fall, it is likely that solid state drives will begin to replace hard disk drives for most purposes."
        ]
    },
    {
        "word": "SSH",
        "type": [],
        "definition": [
            "Stands for \"Secure Shell.\"  SSH is a method of securely communicating with another computer.  The \"secure\" part of the name means that all data sent via an SSH connection is encrypted.  This means if a third party tries to intercept the information being transferred, it would appear scrambled and unreadable.  The \"shell\" part of the name means SSH is based on a Unix shell, which is a program that interprets commands entered by a user.\nBecause SSH is based on a Unix shell, standard Unix commands can be used to view, modify, and transfer files from a remote machine once an SSH connection has been established.  These commands can either be entered manually using a terminal emulator, or may be sent from a program with a graphical user interface (GUI).  This type of program translates user actions, such as opening a folder, to Unix commands (cd [folder name]).\nTo log into a server using SSH from a terminal program, type: ssh [servername] -l [username].\nThe \"-l\" indicates you are logging in with a username, which is required by most SSH connections (otherwise, it wouldn't be very secure).  If the login name is recognized, you will be prompted to enter a password.  If the password is correct, your SSH connection will be established.  To end the SSH session, type \"exit\" followed by the Enter key."
        ]
    },
    {
        "word": "SSID",
        "type": [],
        "definition": [
            "Stands for \"Service Set Identifier.\"  An SSID is a unique ID that consists of 32 characters and is used for naming wireless networks.  When multiple wireless networks overlap in a certain location, SSIDs make sure that data gets sent to the correct destination.\nThe SSID is different than the name that is assigned to a wireless router.  For example, the administrator of a wireless network may set the name of the router, or base station, to \"Office.\"  This will be the name that users see when browsing available wireless networks, but the SSID is a different 32 character string that ensures the network name is different from other nearby networks.\nEach packet sent over a wireless network includes the SSID, which ensures that the data being sent over the air arrives at the correct location.  Without service set identifiers, sending and receiving data in a location with multiple wireless networks would be chaotic and unpredictable to say the least."
        ]
    },
    {
        "word": "SSL",
        "type": [],
        "definition": [
            "Stands for \"Secure Sockets Layer.\"  SSL is a secure protocol developed for sending information securely over the Internet.  Many websites use SSL for secure areas of their sites, such as user account pages and online checkout.  Usually, when you are asked to \"log in\" on a website, the resulting page is secured by SSL.\nSSL encrypts the data being transmitted so that a third party cannot \"eavesdrop\" on the transmission and view the data being transmitted.  Only the user's computer and the secure server are able to recognize the data.  SSL keeps your name, address, and credit card information between you and merchant to which you are providing it.  Without this kind of encryption, online shopping would be far too insecure to be practical.  When you visit a Web address starting with \"https,\" the \"s\" after the \"http\" indicates the website is secure.  These websites often use SSL certificates to verify their authenticity.\nWhile SSL is most commonly seen on the Web (HTTP), it is also used to secure other Internet protocols, such as SMTP for sending e-mail and NNTP for newsgroups.  Early implementations of SSL were limited to 40-bit encryption, but now most SSL secured protocols use 128-bit encryption or higher."
        ]
    },
    {
        "word": "SYN Flood",
        "type": [],
        "definition": [
            "A SYN flood is a type of denial of service (DoS) attack that sends a series of \"SYN\" messages to a computer, such as a web server.  SYN is short for \"synchronize\" and is the first step in establishing communication between two systems over the TCP\/IP protocol.\nWhen a server receives a SYN request, it responds with a SYN-ACK (synchronize acknowledge) message.  The computer then responds with an ACK (acknowledge) message that establishes a connection between the two systems.  In a SYN flood attack, a computer sends a large number of SYN requests, but does not send back any ACK messages.  Therefore, the server ends up waiting for multiple responses, tying up system resources.  If the queue of response requests grows large enough, the server may not be able respond to legitimate requests.  This results in a slow or unresponsive server.\nSince SYN flooding is a common type of DoS attack, most server software has the capability to detect and stop SYN floods before they have a noticeable effect on the server.  For example, if a server receives a large number of SYN requests from the same IP address in a short period of time, it may temporarily block all requests from that location.\nDistributed denial of service (DDoS) attacks are more difficult to handle since they flood the server from multiple IP addresses.  However, these attacks can be limited by using SYN caching or implementing SYN cookies.  Both of these methods record IP addresses used for flood attacks.  The system then limits the resources the computer will use to respond to requests from these locations.  This type of SYN flood protection can be configured directly on server or on a network firewall."
        ]
    },
    {
        "word": "SaaS",
        "type": [],
        "definition": [
            "Stands for \"Software as a Service.\"  SaaS is software that is deployed over the Internet rather than installed on a computer.  It is often used for enterprise applications that are distributed to multiple users.  SaaS applications typically run within a Web browser, which means users only need a compatible browser in order to access the software.\nSaaS is considered part of cloud computing since the software is hosted on the Internet, or the \"cloud.\"  Because SaaS applications are accessed from a remote server rather than installed on individual machines, it is easy to maintain the software for multiple users.  For example, when the remote software is updated, the client interface is also updated for all users.  This eliminates incompatibilities between different software versions and allows vendors to make incremental updates without requiring software downloads.  Additionally, users can save data to a central online location, which makes it easy to share files and collaborate on projects.\nSeveral types of SaaS applications are available.  For example, Google offers a suite of online applications called Google Apps.  These include Google Docs, which allows users to create and share documents online, Google Sites, which enables users to collaborate on projects via a custom Web interface, and several other applications.  Intuit offers online financial management software through Mint.com and provides tax software via TurboTax online.  Microsoft's Windows Live service provides Web versions of Microsoft Office programs, such as Word, Excel, and PowerPoint.  Documents created with the online Office applications can be saved on a user's SkyDrive and shared with other Windows Live users.  SaaS is also common in the medical field, where doctors use online software to save, update, and share patient records.\nSome SaaS software is free to use, while other online programs require an upfront payment or a monthly fee.  Enterprise SaaS applications often require a commercial license, but online software licenses are usually less expensive than individual software licenses.  Because of the many benefits of SaaS, it is becoming an increasingly common way to distribute software."
        ]
    },
    {
        "word": "Safe Mode",
        "type": [],
        "definition": [
            "Safe Mode is a way for the Windows operating system to run with the minimum system files necessary.  It uses a generic VGA display driver instead of the vendor-specific driver, which means you will likely be working with only 16 colors in a resolution of 640x480.  Safe Mode also turns off all third-party drivers for other peripherals such as mice, keyboards, printers, and scanners.  In basic Safe Mode, networking files and settings are not loaded, meaning you won't be able to connect to the Internet or other computers on a network.\nSo why would I ever want to boot in Safe Mode?  Well, that's a good question.  Sometimes, Windows may not fully load after an unexpected crash and the only way to get the computer to boot is to use Safe Mode.  Once you have successfully booted the computer in Safe Mode, you can run a disk utility program to repair corrupted files or directories on the hard drive.  You can also reboot into Safe Mode to see your display when you get a \"Sync Out of Range\" message on your screen.\nThere may also be times when your computer is performing sluggishly and becomes annoyingly slow.  Booting into Safe Mode will allow you to diagnose the problem and determine which files are slowing down the computer.  When calling technical support, the support person may ask you to boot into Safe Mode to begin the troubleshooting.  To boot your Windows computer into Safe Mode, hold down the F8 key while the computer is starting up.  Then select Safe Mode from the list of boot options."
        ]
    },
    {
        "word": "Samba",
        "type": [],
        "definition": [
            "Most people know of samba as a type of rhythmic dance music from Brazil that uses a 2\/4 time signature.  In the computer world, samba has a different meaning but is no less exciting (if you are a computer nerd).\nSamba is an open-source software implementation of the SMB networking protocol used by Windows computers.  (If you look closely, you can see the correlation between the two names.)  Samba allows other computer platforms, such as Mac OS X, Unix, Linux, IBM System 390, and OpenVMS to interact with Windows computers on the same network.  This includes sharing files and using shared devices such as printers connected to other computers within the local network.\nBecause SMB was developed only for Windows, without Samba, other computer platforms would be isolated from Windows machines, even if they were part of the same network.  Fortunately, Samba helps different types of computers work together as if they were all based on the same platform.  This gives network administrators the freedom to choose multiple types of computers systems when setting up a network.  Now that's a reason to dance!"
        ]
    },
    {
        "word": "Sample",
        "type": [],
        "definition": [
            "A sample is a digital representation of an analog signal.  Both digital video and digital audio files are created using samples.  The quality of the sample is determined by the sampling rate, or the bit rate the signal is sampled at.\nWhat we see and hear in the real world is in analog format (our bodies process analog information).  Computers, on the other hand, can only understand digital information.  Therefore, audio and video signals must be converted to a digital format in order to be stored on a computer or saved to a CD or DVD.  The converted data is called a sample.\nThe term \"sample\" is often used to refer to short audio clips used for playing back sounds.  For example, a violin sound or a bird chirp may be sampled and then played back from a digital keyboard (or synthesizer).  However, samples can refer to entire songs or movies, since the information is technically one long sample.  To learn more about how samples are created, view the definition of sampling, which is the process of recording and creating digital samples."
        ]
    },
    {
        "word": "Sample Rate",
        "type": [],
        "definition": [
            "In audio production, a sample rate (or \"sampling rate\") defines how many times per second a sound is sampled.  Technically speaking, it is the frequency of samples used in a digital recording.\nThe standard sample rate used for audio CDs is 44.1 kilohertz (44,100 hertz).  That means each second of a song on a CD contains 44,100 individual samples.  When an analog sound, such as a vocal performance, is sampled at a rate of tens of thousands of times per second, the digital recording may be nearly indistinguishable from the original analog sound.\nCDs use a sample rate of 44.1 KHz because it allows for a maximum audio frequency of 22.05 kilohertz.  The human ear can detect sounds from roughly 20 hertz to 20 kilohertz, so there is little reason to record at higher sample rates.  However, because digital audio recordings are estimations of analog audio, a smoother sound can be gained by increasing the sample rate above 44.1 KHz.  Examples of high sample rates include 48 KHz (used for DVD video), 88.2 KHz (2x the rate of CD audio), and 96 KHz (used for DVD-Audio and other high definition audio formats).\nWhile audio aficionados may appreciate higher sample rates, it is difficult for most people to perceive an improvement in audio quality when the sample rate is higher than 44.1 Khz.  A more effective way to improve the quality of digital audio is to increase the bit depth, which determines amplitude range of each sample.  16-bit audio, used in audio CDs, provides 216 or 65,536 possible amplitude values.  24-bit audio, used in high definition formats, can store 224 or 16,777,216 possible amplitude values – 256 times more than 16-bit audio.\nNOTE: Many DAW programs support sample rates up to 192 KHz.  Recording at extremely high sample rates allows sound engineers to preserve the audio quality during the mixing and editing process.  This can improve the end result of a song or audio clip even if the final version is saved with a sample rate of 44.1 Hz."
        ]
    },
    {
        "word": "Sampling",
        "type": [],
        "definition": [
            "Before digital recording took over the audio and video industries, everything was recorded in analog.  Audio was recorded to devices like cassette tapes and records.  Video was recorded to Beta and VHS tapes.  The media was even edited in analog format, using multichannel audio tapes (such as 8-tracks) for music, and film reels for video recordings.  This method involved a lot of rewinding and fast-forwarding, which resulted in a time-consuming process.\nFortunately, digital recording has now almost completely replaced analog recording.  Digital editing can be done much more efficiently than analog editing and the media does not lose any quality in the process.  However, since what humans see and hear is in analog format (linear waves of light and sound), saving audio and video in a digital format requires converting the signal from analog to digital.  This process is called sampling.\nSampling involves taking snapshots of an audio or video signal at very fast intervals, usually tens of thousands of times per second.  The quality of the digital signal is determined largely by the sampling rate, or the bit rate the signal is sampled at.  The higher the bit rate, the more samples are created per second, and the more realistic the resulting audio or video file will be.  For example, CD-quality audio is sampled at 44.1 kHz, or 44,100 samples per second.  The difference between a 44.1 kHz digital recording and the original audio signal is imperceptible to most people.  However, if the audio was recorded at 22 kHz (half the CD-quality rate), most people would notice the drop in quality right away.\nSamples can be created by sampling live audio and video or by sampling previously recorded analog media.  Since samples estimate the analog signal, the digital representation is never as accurate as the analog data.  However, if a high enough sampling rate is used, the difference is not noticeable to the human senses.  Because digital information can be edited and saved using a computer and will not deteriorate like analog media, the quality\/convenience tradeoff involved in sampling is well worthwhile."
        ]
    },
    {
        "word": "Sandboxing",
        "type": [],
        "definition": [
            "Sandboxing is a software management strategy that isolates applications from critical system resources and other programs.  It provides an extra layer of security that prevents malware or harmful applications from negatively affecting your system.\nWithout sandboxing, an application may have unrestricted access to all system resources and user data on a computer.  A sandboxed app on the other hand, can only access resources in its own \"sandbox.\"  An application's sandbox is a limited area of storage space and memory that contains the only resources the program requires.  If a program needs to access resources or files outside the sandbox, permission must be explicitly granted by the system.\nFor example, when a sandboxed app is installed in OS X, a specific directory is created for that application's sandbox.  The app is given unlimited read and write access to the sandboxed directory, but it is not allowed to read or write any other files on the computer's storage device unless it is authorized by the system.  This access is commonly granted using the Open or Save dialog box, both of which require direct user input.\nSandboxed App Limitations\nWhile sandboxing provides added security for users, it can also limit the capabilities of an application.  For example, a sandboxed app may not allow command line input since the commands are run at a system level.  Utilities such as backup programs and keyboard shortcut managers may not be granted sufficient permissions to function correctly.  For this reason, some programs cannot be sandboxed.\nNOTE: OS X has supported sandboxing since OS X Lion, which was released in 2011.  The Mac App Store has required apps to be sandboxed since March 2012.  Windows does not natively provide app sandboxing, but some apps (such as Microsoft Office programs) can be run in a sandboxed mode.  Additionally, several Windows utilities allow you to run apps in a sandbox, preventing them from affecting the system or other applications."
        ]
    },
    {
        "word": "Sass",
        "type": [],
        "definition": [
            "Stands for \"Syntactically Awesome Style Sheets.\"  Sass is an extension of cascading style sheets (CSS), the language used to define the layout and formatting of HTML documents.  It uses fully-compatible CSS syntax, but provides additional features like CSS variables and nested rules that make CSS more efficient and easier to edit.\nOne of the drawbacks of standard CSS is that it does not support variables.  For example, if you have multiple styles that are the same color, you need to define the color separately for each style.  If you decide to change the color, you must change it for every instance in the the CSS document.  With Sass, you can define the color as a variable and assign the variable to every style that uses it.  If you decide to change the color, you only need to change it once — where it is initially defined in the document.\nThe below example shows how to define and use a CSS variable in Sass.\n&nbsp; $myColor: #00695C;\n\n&nbsp; .pageTop { background-color: $myColor; }\n&nbsp; .infoText { color: $myColor; }\n&nbsp; .pageBottom { background-color: $myColor; }\nSass also supports nested rules, allowing developers to write more efficient code.  In the example below, the .button class is nested within the #top p style.\n&nbsp; #top p\n&nbsp; {\n&nbsp; &nbsp; color: #004D40;\n\n&nbsp; &nbsp; .button\n&nbsp; &nbsp; {\n&nbsp; &nbsp; &nbsp; background-color: #039BE5;\n&nbsp; &nbsp; &nbsp; color: #FFF;\n&nbsp; &nbsp; }\n&nbsp; }\nWhen compiled, the above code will produce the following CSS:\n&nbsp; #top p { color: #004D40; }\n&nbsp; #top p .button { background-color: #039BE5; color: #FFF; }\nWhile Sass provides several benefits to web developers, Sass documents are not recognized by web browsers.  Therefore, a Sass file must first be compiled into CSS before being used in an HTML document.  This can be done locally before uploading the CSS to the web server using program like Compass.app or Koala.  It can also be compiled on the server using a PHP or Ruby script that compiles Sass into CSS."
        ]
    },
    {
        "word": "Scalable",
        "type": [],
        "definition": [
            "Scalable hardware or software can expand to support increasing workloads.  This capability allows computer equipment and software programs to grow over time, rather than needing to be replaced.\nScalable hardware may refer to a single computer system, a large network of computers, or other computer equipment.  The scalability of a single computer, such as a workstation, depends on how expandable the computer is.  In this context, the words \"scalable,\" \"expandable,\" and \"upgradable\" may be used interchangeably.  For example, a computer that has multiple drive bays has scalable disk space, since more internal storage devices may be added.  A computer that includes multiple PCI slots has scalable graphics and I\/O capabilities since PCI cards may be added or upgraded.  A scalable network should be able to support additional connections without data transfers slowing down.  In each instance, scalable hardware can expand to meet increasing demands.\nScalable software typically refers to business applications that can adapt to support an increasing amount of data or a growing number of users.  For example, a scalable database management system (DBMS) should be able to efficiently expand as more data is added to the database.  Scalable Web hosting software should make it easy to add new users and new Web hosting accounts.  They key is that the software \"grows\" along with the increased usage.  This means scalable programs take up limited space and resources for smaller uses, but can grow efficiently as more demands are placed on the software.\nThe scalability of hardware and software is important to growing businesses.  After all, it is typically more economical to upgrade current systems than replace them with new ones.  While all hardware and software have some limitations, scalable equipment and programs offer a long-term advantage over those that are not designed to grow over time."
        ]
    },
    {
        "word": "Scanner",
        "type": [],
        "definition": [
            "A scanner is an input device that scans documents such as photographs and pages of text.  When a document is scanned, it is converted into a digital format.  This creates an electronic version of the document that can be viewed and edited on a computer.\nMost scanners are flatbed devices, which means they have a flat scanning surface.  This is ideal for photographs, magazines, and various documents.  Most flatbed scanners have a cover that lifts up so that books and other bulky objects can also be scanned.  Another type of scanner is a sheet-fed scanner, which can only accept paper documents.  While sheet-fed scanners cannot scan books, some models include an automatic document feeder, or ADF, which allows multiple pages to be scanned in sequence.\nScanners work in conjunction with computer software programs, which import data from the scanner.  Most scanners include basic scanning software that allows the user to configure, initiate, and import scans.  Scanning plug-ins can also be installed, which allow various software programs to import scanned images directly.  For example, if a scanner plug-in is installed for Adobe Photoshop, a user can create new images in Photoshop directly from the connected scanner.\nWhile Photoshop can edit scanned images, some programs like Acrobat and OmniPage can actually recognize scanned text.  This technology is called optical character recognition, or OCR.  Scanning software that includes OCR can turn a scanned text document into a digital text file that can be opened and edited by a word processor.  Some OCR programs even capture page and text formatting, making it possible to create electronic copies of physical documents."
        ]
    },
    {
        "word": "Scareware",
        "type": [],
        "definition": [
            "Scareware, also known as \"rogue security software,\" is software that uses false error messages to lure you into purchasing a software program.  These alerts or warnings may appear on websites or within applications installed on your computer.  When you click the associated download link, the software is downloaded to your computer.\nA typical scareware warning message will state that your computer is infected with a virus or malware without actually scanning your computer.  The message will also recommend that you download software to \"fix\" the non-existent problem.  Once you download the software, the installer may install spyware, adware, or other unwanted programs on your computer.  In some cases, scareware will ask you to enter personal information, similar to a phishing scam.\nIn order to avoid scareware schemes, it is helpful to check the source of security alerts that pop up on your computer.  If the source is not known or credible, the warning message may not be legitimate.  For example, if a website advertisement says your computer is infected, you can assume the message is false, since the website has no way of actually scanning the files on your computer.  Installing a utility like Microsoft Security Essentials or a third-party Internet security program may also help you catch rogue security software before it can affect your computer.\nWhile some alerts and error messages may be scareware schemes, it is important to remember that other notifications may be legitimate.  For example, the alerts provided Symantec, Kaspersky, AVG and other security programs are valid and should be taken seriously.  By familiarizing yourself with the security software installed on your computer, you'll be able to determine which warnings are valid and which may be from scareware programs."
        ]
    },
    {
        "word": "Schema",
        "type": [],
        "definition": [
            "A schema is an outline, diagram, or model.  In computing, schemas are often used to describe the structure of different types of data.  Two common examples include database and XML schemas.\n1. Database Schema\nA database schema describes the tables and corresponding fields contained in a database.  It may be displayed as a list of tables that each contain a sublist of fields along with the associated data type.  More commonly, however, database schemas are displayed as visual diagrams.  Boxes represent individual tables and lines show how the tables are connected.  In some cases, these lines may include arrowheads to indicate the flow of data.  Database schemas may also include comments that describe the purpose of each table and individual fields.\n2. XML Schema\nAn XML schema defines the elements that an XML file may contain.  It provides a specific structure for XML data, which is important when sharing XML files between multiple systems.  Defining an XML schema ensures an XML document or feed will not contain unknown values, which may cause parsing errors.  Below is an example of an XML schema, or XML schema definition (XSD).\n&lt;?xml version=\"1.0\"?&gt;\n&lt;xs:schema xmlns:xs=\"[url of a webpage that describes the schema]\"&gt;\n&nbsp; &lt;xs:element name=\"email\"&gt;\n&nbsp; &nbsp; &lt;xs:complexType&gt;,\n&nbsp; &nbsp; &nbsp; &lt;xs:sequence&gt;\n&nbsp; &nbsp; &nbsp; &nbsp; &lt;xs:element name=\"to\" type=\"xs:string\"\/&gt;\n&nbsp; &nbsp; &nbsp; &nbsp; &lt;xs:element name=\"from\" type=\"xs:string\"\/&gt;\n&nbsp; &nbsp; &nbsp; &nbsp; &lt;xs:element name=\"subject\" type=\"xs:string\"\/&gt;\n&nbsp; &nbsp; &nbsp; &nbsp; &lt;xs:element name=\"body\" type=\"xs:string\"\/&gt;\n&nbsp; &nbsp; &nbsp; &lt;\/xs:sequence&gt;\n&nbsp; &nbsp; &lt;\/xs:complexType&gt;\n&nbsp; &lt;\/xs:element&gt;\n&lt;\/xs:schema&gt;\nSchemas are most commonly used to describe databases and XML files, but they can also be used to describe other types of data.  For example, a game developer may define a schema to describe 3D objects used in a video game.  A software developer may use a schema to describe the structure of a file format used by an application."
        ]
    },
    {
        "word": "Scraping",
        "type": [],
        "definition": [
            "Scraping, or \"web scraping,\" is the process of extracting large amounts of information from a website.  This may involve downloading several web pages or the entire site.  The downloaded content may include just the text from the pages, the full HTML, or both the HTML and images from each page.\nThere are many different methods of scraping a website.  The most basic is manually downloading web pages.  This can be done by either copying and pasting the content from each page into a text editor or using your browser's File &rarr; Save As… command to save local copies of individual pages.  Scraping can also be done automatically using web scraping software.  This is the most common way to download a large number of pages from a website.  In some cases, bots can be used to scrape a website a regular intervals.\nWeb scraping may be done for several different purposes.  For instance, you may want to archive a section of a website for offline access.  By downloading several pages to your computer, you can read them at a later time without being connected to the Internet.  Web developers sometimes scrape their own websites when testing for broken links and images within each page.  Scraping can also done for unlawful purposes, such as copying a website and republishing it under a different name.  This type of scraping is viewed as a copyright violation and can lead to legal prosecution.\nNOTE: While scraping a website for the purpose of republishing information is always wrong, scraping a site for other purposes may still violate the website's terms of use.  Therefore, you should always read a website's terms of use before downloading content from the site."
        ]
    },
    {
        "word": "Screen Burn",
        "type": [],
        "definition": [
            "Screen burn or \"screen burn-in\" is a residual image left on a screen after displaying the same image for a long time.  It is a faded version of the image or \"ghost image\" that covers part or all of the screen.\nScreen burn is usually caused by video or graphics with content that does not move or change for an extended period of time.  Examples include the menu bar on a Mac or the task bar on a Windows computer.  On a TV, it may be the logo of a specific channel or the information panel of a video game.  On a smartphone, it may be the status bar at the top of the screen.  If certain pixels consistently display the same image while other pixels display changing graphics, the unchanging pixels may leave behind a ghost image.\nScreen burn affects several types of screens, including CRTs, plasma displays, and OLED screens.  In older displays, such as CRT monitors, leaving a single image displayed for a long time could physically damage the screen.  This type of burn-in could produce dark spots that were noticeable even when the display was turned off.  In modern displays, screen burn typically occurs when the electronics that produce light lose their luminance.  When specific pixels display a single image for a long time, they may lose their red, green, or blue (RGB) brightness relative to other pixels.  This may produce a ghost image that is the inverse of the image that was consistently displayed.\nScreen burn is rare with LCD panels because liquid crystals are less susceptible to burn-in.  OLED displays, on the other hand, are susceptible to screen burn since individual LEDs may lose their luminance relative to other LEDs if overused.  This may happen when certain pixels display the same color over a long period of time.\nHow to Avoid Screen Burn\nScreen burn is rare on modern displays with normal use.  For noticeable screen burn to take place, you would have to run the same program or tune to the same channel every day for several weeks or months.  However, if you consistently play the same video game or watch the same channel, screen burn can happen over time.  You can limit and possibly avoid screen burn by varying the content you watch on your screen.  You should also turn off your display when you're not using it.  Finally, it is wise to enable sleep mode or a screensaver that automatically runs when the screen has not changed for awhile."
        ]
    },
    {
        "word": "Screen Saver",
        "type": [],
        "definition": [
            "A screen saver, or \"screensaver,\" is an animation that appears on a screen when the device has been idle for a certain amount of time.  Screensavers were created to prevent screen burn, where images would get physically \"burned\" into a screen when they did not change for a long time.  For this reason, screensavers include continual animations or frequently changing images that do not stay in the same place very long.\nScreen burn was primarily an issue with CRT monitors, which were replaced by flat-screen displays in the early 2000s.  While flat-screen devices are less susceptible to screen burn, users had become so used to screensavers, modern desktop operating systems such as Windows and macOS still include them.  Additionally, screen burn may affect some LCD and OLED displays, including televisions, especially as they age.  So screensavers still have a functional purpose today.\nAnother way to avoid screen burn is to configure a device to turn off the display or enter sleep mode after a few minutes of inactivity.\nScreen Saver vs Desktop Background\nThe terms \"screen saver\" and \"desktop background\" are sometimes used interchangeably, but they are two different things.  A screensaver is an animation that appears on the screen when a device is idle.  A desktop background, or wallpaper, is an image that stays on the desktop while the device is in use.  Mobile devices typically have a desktop background, but no screen saver option.\nYou can customize both the screen saver and desktop background in the Windows Control Panel or macOS System Preferences.  Screensaver options typically include the screensaver type, animation options, and idle time before the screensaver begins.  You can also choose a \"hot corner\" that allows you to start the screensaver immediately by dragging the cursor to a corner of the screen."
        ]
    },
    {
        "word": "Screen Tearing",
        "type": [],
        "definition": [
            "Screen tearing is graphics distortion that occurs when the graphics processor is out of sync with the display.  It causes a horizontal line to appear during video playback or gameplay in a video game since the top section is out of sync with the bottom.\nWhen the GPU is under a heavy load, it may not be able to keep up with the refresh rate of the monitor.  The result is that part of the screen is redrawn in one frame and the rest of the screen is redrawn in another.  If this continues for multiple frames, a noticeable vertical line will appear on the screen.\nThere are several ways to prevent or fix screen tearing.\n\nLower the resolution of the video or game so that your GPU doesn't have to work as hard.\nEnable the \"hardware acceleration\" option in the affected application.  For example, Google Chrome has a toggle for this setting.  Enabling hardware acceleration can improve video playback within the web browser.\nEnable the \"vertical sync\" or \"vsync\" option.  Some video games provide this option specifically to combat screen tearing.  However, it may slow down the frame rate to match the refresh rate of your monitor.\nEnable \"triple buffering\" if the application allows it.  This ensures the entire frame is passed to the final buffer before being sent to the display.\nUpgrade to a more powerful video card that can support the videos or games you play on your computer.\n\nIf you are a serious gamer, it might be helpful to buy a display specifically designed to prevent screen tearing.  For example, some displays include G-Sync technology, which syncs the display output with an NVIDIA GPU."
        ]
    },
    {
        "word": "Screenshot",
        "type": [],
        "definition": [
            "A screenshot, or screen capture, is a picture taken of your computer's desktop.  This may include the desktop background, icons of files and folders, and open windows.  It may also include whatever is being displayed by currently running programs.  Screenshots are and easy way to save something you see on the screen, such as an open window, image, or text article.  However, because screenshots are saved in an image format, the text saved in a screenshot will not be editable.\nBoth the Mac OS and Windows operating systems make it easy to take screenshots.  Just use the following keyboard shortcuts to capture the current screen displayed on your computer:\nMac OS X:\nCommand-Shift-3:  Saves a screenshot of the entire desktop to an image file on the desktop.\nCommand-Shift-4:  Saves a screenshot of a selection selected with the cursor to an image file on the desktop.\nCommand-Control-Shift-3:  Saves a screenshot of the entire desktop to the clipboard.\nCommand-Control-Shift-4:  Saves a screenshot or a selection selected with the cursor to the clipboard.\nWindows XP:\nPrint Screen:  Saves a screenshot of the entire desktop to the clipboard.\nAlt+Print Screen:  Saves a screenshot of the active window to the clipboard."
        ]
    },
    {
        "word": "Script",
        "type": [],
        "definition": [
            "A computer script is a list of commands that are executed by a certain program or scripting engine.  Scripts may be used to automate processes on a local computer or to generate Web pages on the Web.  For example, DOS scripts and VB Scripts may be used to run processes on Windows machines, while AppleScript scripts can automate tasks on Macintosh computers.  ASP, JSP, and PHP scripts are often run on Web servers to generate dynamic Web page content.\nScript files are usually just text documents that contain instructions written in a certain scripting language.  This means most scripts can be opened and edited using a basic text editor.  However, when opened by the appropriate scripting engine, the commands within the script are executed.  VB (Visual Basic) scripts, for example, will run when double-clicked, using Windows' built-in VB scripting support.  Since VB scripts can access and modify local files, you should never run a VB script that you receive as an unknown e-mail attachment."
        ]
    },
    {
        "word": "Scroll Bar",
        "type": [],
        "definition": [
            "When the contents of a window are too large to be displayed entirely within the window, a scroll bar will appear.  For example, if a Web page is too long to fit within a window, a scroll bar will show up on the right-hand side of the window, allowing you to scroll up and down the page.  If the page is too wide for the window, another scroll bar will appear at the bottom of the window, allowing you to scroll to the left and right.  If the window's contents fit within the current window size, the scroll bars will not appear.\nThe scroll bar contains a slider that the user can click and drag to scroll through the window.  As you may have noticed, the size of the slider may change for different windows.  This is because the slider's size represents what percentage of the window's content is currently being displayed within the window.  For example, a slider that takes up 75% of the scroll bar means 75% of the content fits within the current window size.  A slider that fills only 10% of the scroll bar means only 10% of the window's contents are being displayed within the current window size.  Therefore, if two windows are the same size, the one with the smaller slider has more content than the one with the larger slider.\nMost scroll bars also contain up and down or left and right arrows that allow the user to scroll in small increments by clicking the arrows.  However, clicking and dragging the slider is much faster, so the arrow keys are typically not used as often.  Also, some mice have a scroll wheel that allows the user to scroll by dragging the wheel instead of clicking and dragging within the scroll bar.\n"
        ]
    },
    {
        "word": "Scroll Wheel",
        "type": [],
        "definition": [
            "Computer windows are often not large enough to display the entire contents of the window at one time.  Therefore, you may need to scroll through the window to view all the contents.  Traditionally, this has been done by clicking and dragging the slider within the scroll bar.  However, many mice now come with scroll wheels that make the scrolling process even easier.\nThe scroll wheel typically sits between the left and right buttons on the top of a mouse.  It is raised slightly, which allows the user to easily drag the wheel up or down using the index finger.  Pulling the scroll wheel towards you scrolls down the window, while pushing it away scrolls up.  Most modern mice include a scroll wheel, since it eliminates the need to move the cursor to the scroll bar in order to scroll through the window.  Therefore, once you get accustomed to using a scroll wheel, it can be pretty difficult to live without.\nMost scroll wheels only allow the user to scroll up and down.  However, some programs allow the user to use a modifier key, such as Control or Shift, to change the scrolling input to left and right.  Some mice even have a tilting scroll wheel that allows the user to scroll left and right.  The Apple Mighty Mouse has a spherical scrolling mechanism (called a scroll ball) that allows the user to also scroll left and right and even diagonally.  Whatever the case, any type of scroll wheel is certainly better than nothing."
        ]
    },
    {
        "word": "Scrolling",
        "type": [],
        "definition": [
            "Most computer programs display their content within a window.  However, windows are often not large enough to display their entire content at once.  Therefore, you may have to scroll through the window to view the rest of the contents.  For example, on some monitors, a page from a word processing document may not fit within the main window when viewed at 100%.  Therefore, you may have to scroll down the window to view the rest of the page.  Similarly, many Web pages do not fit completely within a window and may require you to scroll both vertically and horizontally to see all the content.\nTo scroll up or down within a window, simply click the scroll bar on the right-hand side of the window and drag the slider up or down.  If the window requires horizontal scrolling as well, click the scroll bar at the bottom of the window and drag the slider to the right or left.  Some computer mice also include a scroll wheel that allows you to scroll through the window by rolling the wheel back and forth."
        ]
    },
    {
        "word": "Search Engine",
        "type": [],
        "definition": [
            "Google, Excite, Lycos, AltaVista, Infoseek, and Yahoo are all search engines.  They index millions of sites on the Web, so that Web surfers like you and me can easily find Web sites with the information we want.  By creating indexes, or large databases of Web sites (based on titles, keywords, and the text in the pages), search engines can locate relevant Web sites when users enter search terms or phrases.  When you are looking for something using a search engine, it is a good idea to use words like AND, OR, and NOT to specify your search.  Using these boolean operators, you can usually get a list of more relevant sites."
        ]
    },
    {
        "word": "Secondary Memory",
        "type": [],
        "definition": [
            "Secondary memory refers to storage devices, such as hard drives and solid state drives.  It may also refer to removable storage media, such as USB flash drives, CDs, and DVDs.\nUnlike primary memory, secondary memory is not accessed directly by the CPU.  Instead, data accessed from secondary memory is first loaded into RAM and is then sent to the processor.  The RAM plays an important intermediate role, since it provides much faster data access speeds than secondary memory.  By loading software programs and files into primary memory, computers can process data much more quickly.\nWhile secondary memory is much slower than primary memory, it typically offers far greater storage capacity.  For example, a computer may have a one terabyte hard drive, but only 16 gigabytes of RAM.  That means the computer has roughly 64 times more secondary memory than primary memory.  Additionally, secondary memory is non-volatile, meaning it retains its data with or without electrical power.  RAM, on the other hand, is erased when a computer is shut down or restarted.  Therefore, secondary memory is used to store \"permanent data,\" such as the operating system, applications, and user files.\nNOTE: Secondary memory may also be called \"secondary storage.\"  However, this term is a bit more ambiguous, since internal storage devices are sometimes called \"primary storage devices\" as well."
        ]
    },
    {
        "word": "Secondary Storage",
        "type": [],
        "definition": [
            "Secondary storage technology refers to storage devices and storage media that are not always directly accessible by a computer.  This differs from primary storage technology, such as an internal hard drive, which is constantly available.\nExamples of secondary storage devices include external hard drives, USB flash drives, and tape drives.  These devices must be connected to a computer's external I\/O ports in order to be accessed by the system.  They may or may not require their own power supply.\nExamples of secondary storage media include recordable CDs and DVDs, floppy disks, and removable disks, such as Zip disks and Jaz disks.  Each one of these types of media must be inserted into the appropriate drive in order to be read by the computer.  While floppy disks and removable disks are rarely used anymore, CDs and DVDs are still a popular way to save and transfer data.\nBecause secondary storage technology is not always accessible by a computer, it is commonly used for archival and backup purposes.  If a computer stops functioning, a secondary storage device may be used to restore a recent backup to a new system.  Therefore, if you use a secondary storage device to backup your data, make sure you run frequent backups and test the data on a regular basis."
        ]
    },
    {
        "word": "Sector",
        "type": [],
        "definition": [
            "A sector is the smallest unit that can be accessed on a hard disk.  Each platter, or circular disk of a hard disk is divided into tracks, which run around the disk.  These tracks get longer as they move from the middle towards the outside of the disk, so there are more sectors along the tracks near the outside of the disk than the ones towards the center of disk.  This variance in sectors per track is referred to as \"zoned-bit recording.\"\nLarge files can take up thousands of sectors on a disk.  Even if one of these sectors becomes corrupted, the file will most likely be unreadable.  While a disk utility program may be able to fix corrupted data, it cannot fix physical damage.  Physically damaged sectors are called \"bad sectors.\"  While your computer may recognize and bypass bad sectors on your hard disk, certain bad sectors may prevent your disk from operating properly.  Yet another good reason to always back up your data!"
        ]
    },
    {
        "word": "Secure Boot",
        "type": [],
        "definition": [
            "Secure Boot is a security feature that prevents malicious software (malware) from running when a PC starts up.  It performs a series of checks during the boot sequence that ensures only trusted software is loaded.\nWhen Secure Boot is enabled, the firmware checks the signatures (the verified origins) of all software that loads during the boot process.  If all signatures are valid, the PC loads the operating system.  If one or more signatures cannot be verified, the boot process is halted, preventing any malicious software from running.\nWindows 11 can only be installed on Secure Boot-capable PCs with a TPM chip and UEFI support.  However, it is possible to disable the Secure Boot feature.\nVerifying Secure Boot\nYou can check if Secure Boot is enabled on your Windows PC by following these steps:\n\nClick the Windows icon in the task bar or press the Windows key.\nType msinfo32 and press Enter.\nThe System Information window will open.  Make sure System Summary is selected in the left sidebar.\nLook for Secure Boot State in the right section of the window and make sure the value is On.\n\n\nThe BIOS Mode must be set to UEFI for Secure Boot to be enabled.  If it is set to \"Legacy,\" you may be able to switch to UEFI mode by holding the F2 key during startup to load the BIOS.  If your computer supports UEFI, you can switch from Legacy BIOS to UEFI mode.  The same interface allows you to enable and disable Secure Boot.\nNeither Windows 10 nor Windows 11 require Secure Boot to be enabled.  However, it is wise to leave it on to prevent unwanted software, such as ransomware or spyware, from loading at startup."
        ]
    },
    {
        "word": "Seed",
        "type": [],
        "definition": [
            "In the computer world, a seed may refer to three different things: 1) A random seed, 2) seed data, or 3) a client on a peer-to-peer network.\n1. Random Seed\nA random seed is a value used to generate random data.  Since computers are programmed to follow instructions based on specific input, creating random output is more difficult than it might seem.  In order to generate a random value, another value called a \"random seed\" must be provided as input.  This may be a timestamp (which can include milliseconds), a system value (such as a GUID), a hardware serial number, or another unique value.\nA random seed may be generated automatically (e.g., a timestamp) or may be explicitly passed to a randomizing function as a parameter.  The function uses the seed value to produce random output, which is typically a number.\n2. Seed Data\nSeed data is information that is loaded to enable a function or program to work correctly.  If a function queries an empty database, for example, it will not produce useful output.  If the database is \"seeded\" with data, the function will generate meaningful results.  Seed data is often used for testing purposes.  It may be created using an automated process or can be entered manually.\n3. P2P Seed\nA peer-to-peer (P2P) seed is a or computer (or \"peer\") that uploads one or more files on a file sharing network, such as BitTorrent.  Once a user downloads a complete file, he or she can share the file with other users.  Peers that provide files for other torrent users to download are called seeds.  Peers that download files but rarely or never upload them are called leeches."
        ]
    },
    {
        "word": "Semaphore",
        "type": [],
        "definition": [
            "In computer science, a semaphore is a variable that controls access to one or more resources.  It is a tool developers use to ensure functions only access valid data and run at the right time.  A semaphore can prevent a deadlock or race condition by disallowing access to a resource when it is not available.\nThere are two main types of semaphores in computer programming: binary and counting.\nBinary Semaphores\nA binary semaphore is a boolean variable that can have only two possible values (0 or 1).  It is often used as a lock to restrict access to a function or resource.  For example, semaphore A controls function getData().  If A = 0, getData() will not excute.  If A = 1, getData() will run.  A binary semaphore is also considered a flag or a switch that is either on or off.\nCounting Semaphores\nA counting semaphore can be any non-negative integer, also known as a whole number.  Its value may increase or decrease based on the results of one or more functions.  For example, a counting semaphore may keep track of the number of available resources in a resource pool.  If the semaphore decrements more than it increments, it will eventually reach 0.  A zero value indicates there are no more resources left.\nNOTE: A \"semaphore\" in the real world is a flag or other object used to signal from a distance.  For example, a person may hold up a pole from a dock to signal to a ferry captain that he or she would like to come aboard."
        ]
    },
    {
        "word": "Serial Number",
        "type": [],
        "definition": [
            "A serial number is a unique number or string of characters that identifies a product.  While any product may have a serial number, they are especially common for electronics, such as computers, mobile devices, and audio and video equipment.\nBecause serial numbers are unique, they can be used to identify a specific device.  Therefore, when you register a product online, you will most likely be asked to enter the serial number of the product along with some other information.  The serial number or \"SN\" links the specific device to your name or account, which is helpful for warranty purposes and for technical support requests you may have while using the product.\nThere is no standard format for serial numbers.  Instead, the style or convention is chosen by each manufacturer.  Some serial numbers only include numbers, while others are alphanumeric, meaning they include both letters and numbers.  It is common for serial numbers to exclude the letter \"O\" to avoid confusion with the number \"0.\"\nSerial numbers also help manufacturers keep track of their products.  For example, if a company builds the same product at multiple facilities, each location may use a different range of serial numbers.  A manufacturer may also use different serial number ranges for different time periods.  This helps with quality control across multiple locations and times.  When a product is recalled for example, the manufacturer may provide a range of serial numbers for the affected devices.\nHow to Find a Serial Number\nSerial numbers are often printed on the back or bottom of electronic devices, making them inconspicuous but also notoriously difficult to locate.  The number may be printed on a label or may be engraved into the hardware itself.  It is important to look for the term \"Serial Number,\" \"Ser. No.,\" or \"SN\" since there may be other numbers listed, such as the product ID, network ID, or UPC.\nMany electronics save the serial number permanently in the device ROM.  This allows you to view it using software.  For example, you can look up the serial number of a computer by viewing the computer properties (in Windows) or \"About this computer\" (in macOS).  You can view the serial number of your smartphone by going to Settings &rarr; About.  In many cases, you can can view the SN of a peripheral device by connecting it to a computer or TV with a USB or HDMI cable.\nNOTE: In software, the term \"serial number\" may also be used synonymously with \"activation key.\"  However, this has become less common in recent years."
        ]
    },
    {
        "word": "Serial Port",
        "type": [],
        "definition": [
            "The serial port is a type of connection on PCs that is used for peripherals such as mice, gaming controllers, modems, and older printers.  It is sometimes called a COM port or an RS-232 port, which is its technical name.  If that's not enough to confuse you, there are two types of serial ports -- DB9 and DB25.  DB9 is a 9-pin connection, and DB25 is, you guessed it, a 25-pin connection.\nA serial port can only transmit one bit of data at a time, whereas a parallel port can transmit many bits at once.  The serial port is typically the slowest port you'll find on a PC, if you find one at all.  Most newer computers have replaced serial ports with much faster and more compatible USB ports."
        ]
    },
    {
        "word": "Server",
        "type": [],
        "definition": [
            "A server is a computer that provides data to other computers.  It may serve data to systems on a local area network (LAN) or a wide area network (WAN) over the Internet.\nMany types of servers exist, including web servers, mail servers, and file servers.  Each type runs software specific to the purpose of the server.  For example, a Web server may run Apache HTTP Server or Microsoft IIS, which both provide access to websites over the Internet.  A mail server may run a program like Exim or iMail, which provides SMTP services for sending and receiving email.  A file server might use Samba or the operating system's built-in file sharing services to share files over a network.\nWhile server software is specific to the type of server, the hardware is not as important.  In fact, a regular desktop computers can be turned into a server by adding the appropriate software.  For example, a computer connected to a home network can be designated as a file server, print server, or both.\nWhile any computer can be configured as a server, most large businesses use rack-mountable hardware designed specifically for server functionality.  These systems, often 1U in size, take up minimal space and often have useful features such as LED status lights and hot-swappable hard drive bays.  Multiple rack-mountable servers can be placed in a single rack and often share the same monitor and input devices.  Most servers are accessed remotely using remote access software, so input devices are often not even necessary.\nWhile servers can run on different types of computers, it is important that the hardware is sufficient to support the demands of the server.  For instance, a web server that runs lots of web scripts in real-time should have a fast processor and enough RAM to handle the \"load\" without slowing down.  A file server should have one or more fast hard drives or SSDs that can read and write data quickly.  Regardless of the type of server, a fast network connection is critical, since all data flows through that connection."
        ]
    },
    {
        "word": "Service Pack",
        "type": [],
        "definition": [
            "A service pack is a software package that contains several updates for an application or operating system.  Individual updates are typically called software updates or patches.  When a software company has developed several updates to a certain program or operating system, the company may release all the updates together in a service pack.\nMany Windows users are familiar with service packs because of the popular service pack released for Windows XP, called SP2.  Windows XP SP2 not only included typical updates such as bug fixes and security updates, it added new features.  Some of the features included new security tools, interface enhancements to Internet Explorer and Outlook Express, and new DirectX technologies.  In fact the SP2 service pack for Windows XP was so comprehensive, many newer Windows programs require it in order to run.\nService packs are usually offered as free downloads from the software developer's website.  A software update program on your computer may even prompt you to download a service pack when it becomes available.  Typically, it is a good idea to download and install new service packs.  However, is may also be wise to wait a week or two after the service pack is released to make sure no new bugs or incompatibilities are introduced with the service pack.  If you do not have a high-speed Internet connection, you can often purchase a service pack update CD for a small charge.\nWhile service packs are commonly released for Microsoft products, not all companies use them.  Apple's Mac OS X, for example, uses the Software Update program to install incremental updates to the operating system.  Each Mac OS X update includes several small updates to the operating system and bundled applications, much like a service pack."
        ]
    },
    {
        "word": "Servlet",
        "type": [],
        "definition": [
            "A servlet is a Java program that runs on a Web server.  It is similar to an applet, but is processed on the server rather than a client's machine.  Servlets are often run when the user clicks a link, submits a form, or performs another type of action on a website.\nBoth servlets and JSP pages contain Java code that is processed by a Web server.  However, servlets are primarily Java programs, while JSP pages are primarily HTML files.  In other words, a servlet is a Java program that may contain HTML, while a JSP page is an HTML file that may contain Java code.  Additionally, servlets require a specific structure and must contain the following three methods:\n\ninit()\nservice()\ndestroy()\n\nThe init() method initializes the servlet, allocates memory for the process, and passes any input parameters to the servlet.  The service() method, which may also be specified as the doGet(), doPost(), doPut(), or doDelete() method, processes the HTTP request and typically provides a response that is sent to the client's browser.  The destroy method may save data to a log file and frees up resources that were used by the servlet.\nServlets are one of many options Web developers can use to create dynamic websites and process data entered by website visitors.  Since they are written in Java, servlets provide an easy way for programmers who are already familiar with the Java programming language to create Web applications."
        ]
    },
    {
        "word": "Session",
        "type": [],
        "definition": [
            "In the computing world, a session refers to a limited time of communication between two systems.  Some sessions involve a client and a server, while other sessions involve two personal computers.\nA common type of client\/server session is a Web or HTTP session.  An HTTP session is initiated by a Web browser each time you visit a website.  While each page visit constitutes an individual session, the term is often used to describe the entire time you spend on the website.  For example, when you purchase an item on an ecommerce site, the entire process may be described as a session, even though you navigated through several different pages.\nAnother example of a client\/server session is an email or SMTP session.  Whenever you check your email with an email client, such as Microsoft Outlook or Apple Mail, you initiate an SMTP session.  This involves sending your account information to the mail server, checking for new messages, and downloading the messages from the server.  Once the messages have been downloaded, the session is complete.\nAn example of a session between two personal computers is an online chat, or instant messaging session.  This type of session involves two computers, but neither system is considered a server or client.  Instead, this type of communication is called a peer-to-peer or P2P.  Another example of P2P communication is BitTorrent file sharing, where file downloads are comprised of one or more sessions with other computers on the BitTorrent network.  A P2P session ends when the connection between two systems is terminated."
        ]
    },
    {
        "word": "Set",
        "type": [],
        "definition": [
            "A set is a data type that consists of predefined values.  It is similar to the ENUM data type, but a constant or variable defined as a set can store multiple values listed in the set declaration instead of just one.\nA set can be defined in the source code of a program or in a database table structure.  For example, a set that stores different types of sports may be declared in Python as follows:\nset Sports { \"soccer\", \"baseball\", \"tennis\", \"golf\" };\nSimilarly, a column in a MySQL database table may be defined like this:\nSports SET ('soccer', 'baseball', 'tennis', 'golf')\nA variable or database value defined as Sports can be assigned one or more of the four sports listed above.  Therefore, it would make sense to create the Sports variable as a set if it is likely to contain multiple values.  One example is a web form that asks a user to select sports that he or she likes to play.  Since the user can choose one or more of the predefined values, the resulting data should be stored as a set.  If the form were to ask the user to choose his or her favorite sport, the variable should be declared as an enum instead.\nLike enums, sets can be used to ensure data integrity by limiting the values a variable or database record can store.  However, this also makes sets less flexible than string or float data types.  Therefore sets are appropriate for data types that only contain a limited number of values."
        ]
    },
    {
        "word": "SharePoint",
        "type": [],
        "definition": [
            "Microsoft SharePoint is a web-based platform used for sharing files and information.  It is designed for teams and provides collaboration features, such as project management, messaging, and shared document storage.\nSharePoint is commonly used to create a company intranet, which can only be accessed by employees.  It provides a secure platform for team members to exchange files and share information.  SharePoint may also be used to create an extranet, as a way for remote clients and business partners to share content securely.  Since SharePoint is web-based, users can access the content from a variety of devices using a standard web browser.\nSharePoint sites may be hosted by Microsoft using SharePoint Online, or internally using SharePoint Server.\nSharePoint Online\nSharePoint Online is included with Microsoft Office 365 for Business.  It automatically creates a team site when you create an Office  Group or Team.  You can use the SharePoint web interface to customize the layout of the site, add pages, and share files.  Content published using SharePoint Online is hosted in the cloud (on Microsoft's servers) and can be accessed remotely by authorized users.\nSharePoint Server\nSharePoint Server is a program that runs on a local machine, such as an internal web server, within a corporate network.  It provides more control over teams and groups and extra site customization.  It may also add extra security if the intranet is hosted behind a local firewall.  However, because SharePoint Server is hosted locally, it requires additional hardware, more administration, and manual updates.  For this reason, SharePoint Server is most often used for enterprise applications that require greater customization and security.\n"
        ]
    },
    {
        "word": "Shareware",
        "type": [],
        "definition": [
            "Shareware is software that you can use on a trial basis before paying for it.  Unlike freeware, shareware often has limited functionality or may only be used for a limited time before requiring payment and registration.  Once you pay for a shareware program, the program is fully functional and the time limit is removed.\nIn the 1980s and 1990s, shareware was a popular way for small developers to distribute software.  The advent of CDs allowed multiple developers to deliver their software programs as a collection, such as \"Top 100 Mac Games.\"  Other shareware collections included utilities, graphics programs, and productivity applications.  In many cases, these programs were fully functional and simply requested a donation from users.  Programs that incessantly reminded users to register and pay for the software became known as \"nagware.\"\nToday, the most common type of shareware programs are trial programs, which are also called \"trialware\" or \"demoware.\"  These programs are provided as demos that you can try for a limited time, such as two weeks or one month.  Once the trial period expires, you must pay for the software in order to continue using it.  Most shareware demos can be downloaded directly from the software publisher's website."
        ]
    },
    {
        "word": "Shell",
        "type": [],
        "definition": [
            "Most people know of shells as small protective coverings for certain animals, such as clams, crabs, and mollusks.  You may also find a shell on the outside of an egg, which I highly recommend you remove before eating.  In the computer science world, however, a shell is a software program that interprets commands from the user so that the operating system can understand them and perform the appropriate functions.\nThe shell is a command-line interface, which means it is soley text-based.  The user can type commands to perform functions such as run programs, open and browse directories, and view processes that are currently running.  Since the shell is only one layer above the operating system, you can perform operations that are not always possible using the graphical user interface (GUI).  Some examples include moving files within the system folder and deleting files that are typically locked.  The catch is, you need to know the correct syntax when typing the commands and you may still be prompted for a password in order to perform administrative functions.\nShells are most commonly associated with Unix, as many Unix users like to interact with the operating system using the text-based interface.  Two common Unix shells are the Bourne shell and the C Shell, which is used by BSD.  Most Unix systems have both of these shells available to the user.  Windows users may be more familiar with DOS, the shell that has long been included with the Windows operating system.  Most computer users have no need to use the shell interface, but it can be a fun way to perform functions on your computer, as well as impress your friends."
        ]
    },
    {
        "word": "Shift Key",
        "type": [],
        "definition": [
            "The Shift key is a modifier key on the keyboard.  Its primary purpose is to capitalize lowercase letters.  When the Shift key is not being pressed, letters are entered as lowercase by default (unless Caps Lock has been activated).  When a user holds down the Shift key while typing a letter, the capitalized version of the letter is entered.\nThe Shift key also affects other keys on the keyboard.  For example, you might notice that the numbers near the top of the keyboard have symbols above them.  These symbols are entered when you hold the Shift key while typing the corresponding number.  For example, Shift+1 enters an exclamation mark (!), while Shift+8 enters an asterisk (*).  The same is true for the punctuation keys, such as period, comma, semicolon, etc.  The lower symbols are entered when the Shift key is not being pressed, while the top symbols are entered when the Shift key is held down.\nSince Shift is a modifier key, it can also be used in conjunction with the mouse.  For example, many programs will allow you to select more than one item by holding down the Shift key and clicking multiple items on the screen.  It can also be used to select a section of text by clicking in one spot, holding Shift, then clicking in another spot.  Finally, Shift is sometimes used for keyboard shortcuts that perform common commands.  For example, Control+S is the standard \"Save\" shortcut, while \"Control+Shift+S\" is typically used for \"Save As...\""
        ]
    },
    {
        "word": "Sidebar",
        "type": [],
        "definition": [
            "In computing, a sidebar is a user interface element that displays a list of choices.  It typically appears as a column to the left of the main content, though it can appear on the right side as well.\nBoth Windows and Mac OS X desktop windows include a sidebar by default.  This column, which appears on the left side of each open window contains links to common folders, such as the Documents, Music, Pictures, and Downloads folders.  It provides easy access to common locations on your computer, no matter what directory you are currently viewing.\nSidebars are also used by many software programs.  For example, Web browsers such as Mozilla Firefox and Apple Safari use a sidebar to display bookmarks and bookmark folders.  Email clients, like Microsoft Outlook and Mozilla Thunderbird display mail folders or new messages in the left sidebar, while the message content is displayed to the right.  Word processors, such as Microsoft Word and Apple Pages, can be configured to display a list of all the pages in a document within the left sidebar.\nWebsites often use sidebars for navigation purposes.  These sidebars typically contain links to the main sections of a website.  If the sidebar is part of the website template, it provides easy access to any section of the website no matter what page you are viewing.  When the primary navigation of a website is located in a sidebar, it may also be called a navigation bar.\nNOTE: Windows Vista introduced a feature called the Windows Vista Sidebar, which was used to display desktop gadgets.  In Windows 7, the Windows Vista Sidebar was renamed to Windows Desktop Gadgets."
        ]
    },
    {
        "word": "Sideload",
        "type": [],
        "definition": [
            "Sideload is a verb that describes a local file transfer.  Unlike uploading and downloading, which take place over the Internet, sideloading involves transferring a file from one local device to another.\nCommon ways to sideload data are:\n\nthrough a wired connection (a USB cable)\n\nover a wireless connection (Wi-Fi or Bluetooth)\nfrom a removable storage device (an SD card)\n\nWhile sideloading is possible between any two local devices, it most commonly refers to transferring a file to a mobile device, such as a smartphone or tablet.  Sideloading is often used synonymously with installing an app outside an app store.\nSideloading Mobile Apps\nThe standard way to install an app on an iOS or Android device is to download it from Apple's App Store or Google's Play Store.  Sideloading an app bypasses the app store, installing the app directly from a local device.\niOS does not allow sideloading except for developers, who need to test their apps before publishing them to the App Store.  Android provides a setting in Security &rarr; Unknown Sources that, when toggled on, allows apps to be installed or \"sideloaded\" outside the Play Store."
        ]
    },
    {
        "word": "Sierra",
        "type": [],
        "definition": [
            "Sierra, also known as macOS 10.12, is the 13th version of OS X, released on September 20, 2016.  It followed El Capitan (OS X 10.11) and is preceded by macOS High Sierra.  Sierra was the first version of OS X that Apple officially labeled \"macOS\" instead of OS X.\nLike other incremental releases of Apple's desktop operating system, Sierra built on previous versions, incorporating the same user interface and adding several new features.  Notably, Sierra was designed to work more seamlessly with other Apple devices, such as iPhones and Apple Watches.  For example, Sierra was the first version of macOS to support Universal Clipboard, which allows you to copy something on your phone and paste it on your Mac, or vice versa.  It also supports automatic login using an Apple Watch.  Safari, the web browser included with macOS Sierra, supports Apple Pay using an iPhone or Apple Watch. \nSierra also increased iCloud integration by syncing the Desktop and Documents folders with iCloud drive.  This makes it easier to keep files consistent across multiple Macs.  It was also the first version of Apple's desktop OS to include Siri, Apple's voice assistant that was introduced in iOS.  Siri can be accessed by clicking the icon in the right side of the menu bar or by pressing and holding Command+Space Bar.  You can speak commands, such as \"Show my Downloads folder\" or \"Make the screen brighter,\" instead of performing the actions with your keyboard and mouse.\nNOTE: Before Mac OS X (introduced in 2001), Apple's desktop operating system was called \"Mac OS.\"  With the release of Mountain Lion (OS X 10.8) in 2012, Apple changed the name from Mac OS X to just \"OS X.\"  The switch to \"macOS\" with Sierra marks a return to the \"Mac OS\" name, while using the same naming convention as Apple's other operating systems – iOS, watchOS, and tvOS."
        ]
    },
    {
        "word": "Silent Install",
        "type": [],
        "definition": [
            "A silent install is the installation of a software program that requires no user interaction.  It is a convenient way to streamline the installation process of a desktop application.  Silent installs are performed by many legitimate software programs, but they are also used by malware and PUPs to hide the installation process from the user.\nA typical installer has several parameters that instruct the installer how to run.  Examples include where the program should be installed, if a shortcut should be placed on desktop, and if additional components should be installed.  In a non-silent or \"attended installation,\" the user is prompted to select or confirm these options during the installation process.  In a silent install, these items are selected automatically and the installer runs from start to finish without requiring any user input.\nSilent installs are useful for simple programs that have limited installation options.  They are also helpful for installing software on several machines at once.  For example, a network administrator may prefer to distribute a software program via a silent installer to ensure all users within the network have the same installation settings.  Even though silent installers run without any user interaction, legitimate programs typically require you to manually initiate the installation process.\nWhile silent installations are used for many good reasons, some programs, such as spyware and adware use silent installers to run without your knowledge.  These types of programs may even run without you initiating the installation process.  They may be tacked on to another installer or executed by a malicious file, such as virus."
        ]
    },
    {
        "word": "Simplex",
        "type": [],
        "definition": [
            "Simplex is a type of communication in which data can only be transmitted in one direction.  It is often used in contrast to duplex communication, in which data can flow bidirectionally (back and forth) between two devices.\nBroadcasts, in which a single transmission is sent to many users, is a common type of simplex communication.  For instance, radio broadcasts, television broadcasts, and Internet streaming are all examples of simplex transmissions.  Since these mediums only need to transmit, rather than receive data, simplex communication is all that is necessary.\nWhile simplex transmissions are sufficient for broadcasting, nearly all computer network protocols and computer interfaces are duplex, meaning they can both send and receive data.  Some computer components, however, may include \"simplex circuits,\" in which data can only flow in one direction."
        ]
    },
    {
        "word": "Site Map",
        "type": [],
        "definition": [
            "A site map, sometimes written \"sitemap,\" is an overview of the pages within a website.  Site maps of smaller sites may include every page of the website, while site maps of larger sites often only include pages for major categories and subcategories of the website.  While site maps can be organized in a variety of ways, most use an outline form, with pages arranged by topic.  This gives visitors a good overall picture of how the site is organized and clearly defines all the resources the website has to offer.\nWhile a properly designed website should allow visitors to navigate the entire site without using the site map, incorporating a site map gives users another means of locating pages.  For this reason, each page listed in a site map is typically linked to the page it represents.  This allows visitors to quickly jump to any section of a website listed in the site map."
        ]
    },
    {
        "word": "Skin",
        "type": [],
        "definition": [
            "This strange term refers to the appearance of a program's interface.  By changing the skin of a program, you can make the interface look completely different, but usually still have all the same functions.  It is similar to a \"Theme\" you may use to customize the appearance of your computer's desktop.\nSkins have become particularly popular for MP3 players.  Because of the simple interface of most MP3 programs, it is easy to create different looks for the interface.  Other programs, such as Netscape 6, ICQ, Yahoo Messenger, and Windows Media Player also support skins.  If you're one of those people who can't stand seeing the same thing over and over again, skins are for you.  Some programs that support skins even provide a skin development kit that your can use to create your own.  Though this allows for an unlimited amount of interface customizing, it can make it hard to recognize or use the same program on different computers."
        ]
    },
    {
        "word": "Skyscraper",
        "type": [],
        "definition": [
            "While not as common as the banner ad, the skyscraper is another prevalent form of Web advertising.  Skyscraper ads, which are tall and narrow, get their name from the tall buildings you often see in big cities.  They are typically placed to the left or right of the main content on the page, which allows all or part of the ad to be visible even as the user scrolls down the window.\nSkyscraper ads come in two standard sizes -- 120 pixels wide by 600 pixels high (120x600) and 160 pixels wide by 600 pixels high (160x600).  They can contain text advertisements, images, or animations.  When users click on a skyscraper ad, they are redirected to the advertiser's website."
        ]
    },
    {
        "word": "Slashdot",
        "type": [],
        "definition": [
            "Press releases can often trigger increased interest in a certain topic, and if a Web site link is provided in the release, this can translate to increased hits to the Web site.  If the increase in traffic is so dramatic that it causes the server to be completely unreachable, the server is said to have been \"slashdotted.\"\nThe name came into being after October 1998, when a press release was published on the Slashdot.org Web site, resulting in a major surge in traffic to another Web server, causing it to go down.  You can also use the term as a verb, as in, \"Dude, thanks to that stupid article, our server got slashdotted today, man!\""
        ]
    },
    {
        "word": "Smart Home",
        "type": [],
        "definition": [
            "A smart home is a house or other dwelling with automated or remotely controlled components.  Some \"smart\" components require a proprietary interface though most smart home features can be controlled by a mobile device or computer.\nWhile there are no technical requirements for a smart home, a basic smart home might have remote controlled lighting and an automated thermostat.  If your home has a smart lighting system, for example, you can configure different lights to turn on during the day and automatically switch off all the lights late at night.  A smart thermostat can be configured to keep the house warm during the day and cool at night.  If you leave your house for several days, you can set the thermostat to \"vacation mode,\" which will reduce the energy usage of your HVAC system.\nAdvanced smart homes may include several other \"smart\" components.  For example, smart blinds can shut to keep the house cool or open to allow more heat in through the windows.  Some blinds can be programmed to open slowly in the morning to help you wake up to natural lighting.  A smart security system can monitor suspicious activity and sound an alarm or contact the police if necessary.  It may also provide convenient features such as automatically unlocking the front door and turning on lights when you pull into the driveway.\nA smart home may also include \"smart appliances\" that you can monitor and control remotely.  For example, you can check if you remembered to run the dishwasher before you left the house and turn it on from your mobile app if you forgot.  If you have a smart oven, you can turn it on while you are on the road so that your food will be cooked when you get home.  A smart refrigerator can detect the items it contains and let you know when you need to get more milk when you're at the grocery store, for example.\nSeveral different manufacturers make smart components and appliances.  While it is ideal to design a smart home from the ground up using a single brand of components, in many cases that isn't possible.  Therefore, when adding smart components to your home, you may have to get accustomed to multiple interfaces.  Fortunately, most smart components come with easy-to-use apps that run on both iOS and Android devices."
        ]
    },
    {
        "word": "Smartphone",
        "type": [],
        "definition": [
            "A smartphone is a mobile phone that includes advanced functionality beyond making phone calls and sending text messages.  Most smartphones have the capability to display photos, play videos, check and send e-mail, and surf the Web.  Modern smartphones, such as the iPhone and Android based phones can run third-party applications, which provides limitless functionality.\nWhile smartphones were initially used mostly by business users, they have become a common choice for consumers as well.  Thanks to advancements in technology, modern smartphones are smaller and cheaper than earlier devices.  Users also have a much wider range of smartphones to choose from than before.  While the RIM Blackberry dominated the smartphone market for many years, other manufacturers like Apple, HTC, and Samsung now offer a wide variety of smartphone options as well.  This increase in smartphone availability has led to a corresponding decline in the usage of standard PDAs, which do not include phone capabilities.\nSince smartphones have a wide range of functionality, they require advanced software, similar to a computer operating system.  The smartphone software handles phone calls, runs applications, and provides configuration options for the user.  Most smartphones include a USB connection, which allows users to sync data with their computers and update their smartphone software."
        ]
    },
    {
        "word": "Smartwatch",
        "type": [],
        "definition": [
            "A smartwatch is a digital watch that provides many other features besides timekeeping.  Examples include monitoring your heart rate, tracking your activity, and providing reminders throughout the day.  Like a smartphone, a smartwatch has a touchscreen display, which allows you to perform actions by tapping or swiping on the screen.\nModern smartwatches include several apps, similar to apps for smartphones and tablets.  These apps provide additional functionality, such as displaying weather information, listing stock prices, and displaying maps and directions.  Most smartwatches can also be used to make phone calls and send and receive text messages.  \nWhile these apps run directly on the smartwatch, they require a smartphone to function.  This is because the data is first received by the phone, then sent to watch.  Most smartwatches do not include Wi-Fi and they do not have a SIM card for cellular data.  Therefore, most apps rely on a compatible smartphone to provide data over a Bluetooth connection.  For example, the text messaging app on your smartwatch may allow you to dictate and send a text message, but the actual message is sent using your phone.  If your watch is not within range of your phone's Bluetooth signal, the message will not be sent.\nSince smartwatches rely on smartphones for a large percentage of their functionality, they are generally considered a smartphone accessory rather than a standalone device.  Still, smartwatches provide a number of features that don't require a smartphone.  For example, activity tracking is possible using the smartwatch's built-in accelerometer and heart rate monitor.  A smartwatch with a GPS receiver can accurately track and record outdoor runs.  If your watch has an NFC (near field communication) chip, you can pay for purchases with your watch using a stored credit card.  Finally, if your watch has enough storage for music files, you can play songs directly from your watch using wireless headphones.\nPopular smartwatches include the Apple Watch (watchOS), Samsung Gear (Android Wear), and LG Watch (Android Wear)."
        ]
    },
    {
        "word": "Smishing",
        "type": [],
        "definition": [
            "Smishing is a combination of the terms \"SMS\" and \"phishing.\"  It is similar to phishing, but refers to fraudulent messages sent over SMS (text messaging) rather than email.\nThe goal of smishing is to capture people's personal information.  In order to do this, \"smishers\" send out mass text messages designed to capture the recipients' attention.  Some messages may be threatening, e.g., \"Visit this URL to avoid being charged $5.00 per day,\" while others may provide a fake incentive, such as \"You have won a free gift card, visit this website to claim your prize.\"  If you click on a link in the text message, you will be directed to a fraudulent website that will ask you to enter your personal information, such as your name, address, phone number, and email address.  In some cases, a smishing website will ask you to enter your bank account information or social security number.\nSmishing has become increasingly common now that smartphones are widely used.  Many smartphones allow you to simply click on a link in a text message to view the website in your phone's browser.  This makes text messages an effective \"bait\" for luring unsuspecting users to fraudulent websites.  Therefore, just like when you receive email spam, is best to not visit websites mentioned in text messages from unknown sources."
        ]
    },
    {
        "word": "Snapchat",
        "type": [],
        "definition": [
            "Snapchat is a mobile app and service for sharing photos, videos, and messages with other people.  Once you view a message received via Snapchat, it is automatically deleted.  This makes the service ideal for sharing quick updates with friends without accumulating media or messages on your mobile device.\nThe Snapchat app is available for iOS and Android devices.  Once you download and install the app, you can create an account and add friends.  You can then take a \"snap\" and send it to one or more of the people in your friends list.  You can also use Snapchat to send quick text messages that disappear once the recipient reads them.\nTo take a photo in Snapchat, simply tap the capture button while the camera is active.  To take a video, hold down the button for a few seconds to record a short clip.  Once you've captured your photo or video, you can swipe right or left to apply filters or add other effects.  You can tap the \"T\" icon in the upper right to add text and tap the pencil icon to select a color and draw on your snap before sending it.  If you're taking a selfie, you can press and hold on your face before capturing the shot.  This will allow the app to detect your face and you can apply fun effects to your selfie before sending it.\nSnapchat allows you to send snaps directly to specific friends or share them with all your friends by adding them to your \"Story.\"  After you capture a photo or video, you can tap the \"+\" icon near the bottom of the screen to add the snap to your story.  Your friends can view the images and videos you've added for 24 hours after you publish them.  You can also view your friends' stories by swiping to the Stories screen within the app."
        ]
    },
    {
        "word": "Snapshot",
        "type": [],
        "definition": [
            "While the term \"snapshot\" is often used in photography, it is also a computing term that refers to a copy made of a disk drive at a specific moment in time.  Snapshots are useful for backing up data at different intervals, which allows information to be recovered from different periods of time.\nA hard drive snapshot includes the full directory structure of a hard disk, including all folders and files on the disk.  This type of backup may also be referred to as a \"disk image.\"  Disk images allow the full disk to be restored in case the primary disk fails.  Many backup programs that create snapshots also allow specific files to be recovered from the snapshot, instead of having to restore the complete backup.  Since snapshots are mainly used for backup purposes, it is wise to save the snapshot to a secondary hard drive, removable drive, or optical media, such as CDs or DVDs."
        ]
    },
    {
        "word": "Snippet",
        "type": [],
        "definition": [
            "A snippet is a small section of text or source code that can be inserted into the code of a program or Web page.  Snippets provide an easy way to implement commonly used code or functions into a larger section of code.  Instead of rewriting the same code over and over again, a programmer can save the code as a snippet and simply drag and drop the snippet wherever it is needed.  By using snippets, programmers and Web developers can also organize common code sections into categories, creating a cleaner development environment.\nSnippets used in software programming often contain one or more functions written in C, Java, or another programming language.  For example, a programmer may create a basic \"mouse-down event\" snippet to play an action each time the user clicks a mouse button.  Other snippets might be used to perform \"Open file\" and \"Save file\" operations.  Some programmers also use plain text snippets to comment code, such as adding developer information at the beginning of each source file.\nIn Web development, snippets often contain HTML code.  An HTML snippet might be used to insert a formatted table, a Web form, or a block of text.  CSS snippets may be used to apply formatting to a Web page.  Web scripting snippets written in JavaScript, PHP, or another scripting language may be used to streamline dynamic Web page development.  For example, a PHP snippet that contains database connection information can be inserted into each page that accesses information from a database.  Whether programming software or developing websites, using snippets can save the developer a lot of time."
        ]
    },
    {
        "word": "Snow Leopard",
        "type": [],
        "definition": [
            "Snow Leopard is another name for Mac OS X 10.6, which was released on August 26, 2009.  It followed Mac OS X 10.5 Leopard and preceded the release of Mac OS X 10.7 Lion.\nUnlike Leopard, Mac OS X Snow Leopard did not include hundreds of new features.  Instead, the update was primarily designed to improve the performance and efficiency of Mac OS X.  Snow Leopard was the first Mac operating system to require an Intel-based Mac, which means it cannot be used on older Macintosh computers.  However, by removing the PowerPC code from the operating system, Apple was able to shrink the size of the operating system by roughly 7 gigabytes compared to Leopard and improve the speed of common operations.\nWhile Snow Leopard was not a feature-oriented release, it did include a few notable additions.  For example, Snow Leopard was the first version of Mac OS X to include autocorrect support, which automatically fixes common typos.  Additionally, Snow Leopard added Microsoft Exchange support to Mail, Address Book, and iCal, which is important for Macs that are used in Windows-based organizations.  Mac OS 10.6 also shipped with several new versions of Apple software, including Safari 4, iChat 5, and QuickTime X, a completely rewritten version of QuickTime.\nThe final Snow Leopard software update was 10.6.8, released on July 25, 2011."
        ]
    },
    {
        "word": "SoC",
        "type": [],
        "definition": [
            "Stands for \"System On a Chip.\"  An SoC (pronounced \"S-O-C\") is an integrated circuit that contains all the required circuitry and components of an electronic system on a single chip.  It can be contrasted with a traditional computer system, which is comprised of many distinct components.  A desktop computer, for example, may have a CPU, video card, and sound card that are connected by different buses on the motherboard.  An SoC combines these components into a single chip.\nThe primary advantage of a system on a chip is the reduction of physical space required for the system.  By merging multiple components together, SoCs can be used to create fully functional systems that are a fraction of the the size of their traditional counterparts.  Examples include smartphones, tablets, and wearable devices, such as smartwatches.  A smartwatch SoC, for example, may include a primary CPU, graphics processor, DAC, ADC, flash memory, and voltage regulator.  All of these components fit on a single chip roughly the size of a quarter.\nThe size of an SoC is also its greatest disadvantage.  Since all the components are compressed into a single integrated circuit, they are limited in their storage capacity and processing power.  For example, a high-end desktop computer with a dedicated graphics card and SSD will easily outperform a smartphone from the same generation.  However, advances in mobile processing technology enable modern smartphones to provide similar performance to high-end computers from only a few years ago."
        ]
    },
    {
        "word": "Social Engineering",
        "type": [],
        "definition": [
            "Social engineering, in the context of computer security, refers to tricking people into divulging personal information or other confidential data.  It is an umbrella term that includes phishing, pharming, and other types of manipulation.  While \"social engineering\" may sound innocuous (since it is similar to social networking), it refers specifically to malicious acts and is a topic all Internet users should understand.\nUnlike hacking, social engineering relies more on trickery and psychological manipulation than technical knowledge.  For example, a malicious user may send you a \"phishing\" email that says you need to reset your username and password for a specific website.  The email may appear to be legitimate, but if you click the link in the message, it may direct you to a fake website that captures your information.\nAnother common type of social engineering uses false alerts on websites.  For example, when you open a webpage, you might receive a message saying your computer has a virus and you need to download a specific program or call a phone number to fix it.  In most cases, these alerts are auto-generated and are completely false.  If you follow the instructions in the alert message, you may end up downloading spyware or giving away personal information over the phone.\nSocial engineering may also take place through social media.  For example, malicious users may post public messages on sites like Facebook and Twitter that lure people into sharing personal information.  Common example include false giveaways and prize alerts.  In some cases, social engineers will even build relationships with others using online chat or private messaging before convincing them to divulge confidential data.\nWhile most Internet users do not harbor malicious intent, social engineering is an unfortunate reality of the Internet.  Therefore, it is wise to be skeptical of any message, email, or website that asks you to share personal data — especially if the request is from an unknown source.  You can often verify the legitimacy of a message by checking the domain name of the website or contacting the author of the message.  If you cannot verify the origin of a request, do not follow the instructions.  By recognizing fake messages on the Internet, you can avoid being a victim of social engineering."
        ]
    },
    {
        "word": "Social Media",
        "type": [],
        "definition": [
            "Social media is a collection of Internet-based communities that allow users to interact with each other online.  This includes web forums, wikis, and user-generated content (UGC) websites.  However, the term is most often used to describe popular social networking websites, which include the following:\n\nFacebook - an online community that allows individual users to create personal profiles, share photos and videos, and post on each other's profile pages, or \"Timelines.\"\nTwitter - an Internet service that allows people to publish quick updates and see posts or \"tweets\" of other users they are following in real-time.\nLinkedIn - an professional networking website that allows users to create profiles, post resumes, and communicate with other professionals and job-seekers.\nPinterest - an online community that allows users to share ideas and photos with others by \"pinning\" items and describing them on their profile pages.\n\nSocial media became popular after the advent of Web 2.0, a collection of web-based technologies used to make websites more dynamic and enable greater user interaction.  It has since been fueled by the growing use of mobile devices, such as tablets and smartphones, which are commonly used to access social media services.  In fact, most social media websites also provide custom apps that make it easy to view and post updates while on-the-go.\nThe growth of social media has also lead to another new industry, called social media marketing.  This refers to promotional methods focused on social media rather than traditional advertising outlets.  The goal of social media marketing is to increase awareness of a product or service by prompting users to like, share, recommend, or +1 a product or service.  For example, phrases such as \"Like us on Facebook\" or \"Follow us on Twitter\" encourage users to promote a product or service online."
        ]
    },
    {
        "word": "Social Networking",
        "type": [],
        "definition": [
            "When the Web became popular in the mid-1990s, it enabled people to share information in ways that were never possible before.  But as limitless as the possibilities seemed, there was a personal aspect that was lacking.  While users could create home pages and post their own content on the Web, these individual sites lacked a sense of community.  In the early 2000s, the Web became much more personal as social networking websites were introduced and embraced by the masses.\nSocial networking websites allow users to be part of a virtual community.  The two most popular sites are currently Facebook and MySpace.  These websites provide users with simple tools to create a custom profile with text and pictures.  A typical profile includes basic information about the user, at least one photo, and possibly a blog or other comments published by the user.  Advanced profiles may include videos, photo albums, online applications (in Facebook), or custom layouts (in MySpace). After creating a profile, users can add friends, send messages to other users, and leave comments directly on friends' profiles.  These features provide the building blocks for creating online communities.\nThanks to social networking websites, users can share their lives with other people without needing to develop and publish their own home pages.  These websites also provide an important linking element between users that allows friends to communicate directly with each other.  Because people often have friends from different places and different times in their lives, social networking sites provide an opportunity to keep in touch with old friends and to meet new people as well.  Of course, this means that people you don't know may also be able to view your profile page.  Therefore, if you join a social networking website, it is a good idea to review the privacy settings for your account.  And more importantly, remember to always use discretion in what you publish on your profile."
        ]
    },
    {
        "word": "Socket",
        "type": [],
        "definition": [
            "When a computer program needs to connect to a local or wide area network such as the Internet, it uses a software component called a socket.  The socket opens the network connection for the program, allowing data to be read and written over the network.  It is important to note that these sockets are software, not hardware, like a wall socket.  So, yes, you have a much greater chance of being shocked by a wall socket than by a networking socket.\nSockets are a key part of Unix and Windows-based operating systems.  They make it easy for software developers to create network-enabled programs.  Instead of constructing network connections from scratch for each program they write, developers can just include sockets in their programs.  The sockets allow the programs to use the operating system's built-in commands to handle networking functions.  Because they are used for a number of different network protocols (i.e. HTTP, FTP, telnet, and e-mail), many sockets can be open at one time."
        ]
    },
    {
        "word": "Soft Copy",
        "type": [],
        "definition": [
            "A soft copy is a document saved on a computer.  It is the electronic version of a document, which can be opened and edited using a software program.\nThe term \"soft copy\" is most often used in contrast to hard copy, which is the printed version of a document.  Soft copies can be sent via e-mail or over a network connection, which makes them a more efficient and cost effective option than using hard copies for communications.  The downside to using soft copies is that they require a computer and software to open and can be accidentally deleted.  Of course, some people have so many papers on their desks, a soft copy may be less likely to disappear."
        ]
    },
    {
        "word": "Soft Token",
        "type": [],
        "definition": [
            "A soft token is a software version of a hard token, which is a security device used to give authorized users access to secure locations or computer systems.  For this reason, soft tokens can be called \"virtual tokens,\" since they are a virtual version of hardware keys and other physical security devices.\nSoft tokens are typically generated by a central server that runs security software.  They are sent to users' devices, such as cell phones, PDAs, and laptops.  Once the soft token has been received by the device, the user can use the device within a secure network or can gain access to the server as an authorized user.  To add an extra measure of security, most soft token authentication also requires a username and password to make sure the correct user is using the authorized device."
        ]
    },
    {
        "word": "Software",
        "type": [],
        "definition": [
            "Computer software is a general term that describes computer programs.  Related terms such as software programs, applications, scripts, and instruction sets all fall under the category of computer software.  Therefore, installing new programs or applications on your computer is synonymous with installing new software on your computer.\nSoftware can be difficult to describe because it is \"virtual,\" or not physical like computer hardware.  Instead, software consists of lines of code written by computer programmers that have been compiled into a computer program.  Software programs are stored as binary data that is copied to a computer's hard drive, when it is installed.  Since software is virtual and does not take up any physical space, it is much easier (and often cheaper) to upgrade than computer hardware.\nWhile at its most basic level, software consists of binary data, CD-ROMs, DVDs, and other types of media that are used to distribute software can also be called software.  Therefore, when you buy a software program, it often comes on a disc, which is a physical means of storing the software."
        ]
    },
    {
        "word": "Solid State",
        "type": [],
        "definition": [
            "Solid state, at its most basic level, means \"no moving parts.\"  Therefore, solid state electronic devices are made up of solid components that do not move.  Some examples include computer motherboards and integrated circuits.  Devices that use only solid state parts, such as television sets, speakers, and digital watches, are often referred to as solid state products.\nFlash memory devices are solid state products, while hard drives are not.  This is because hard drives use a spinning disk and moving drive head to read and write data, while flash memory uses electric charges to perform the same functions.  For this reason, flash memory devices are seen as more durable than hard drives.  This is why flash memory is often used in products such as portable MP3 players and digital cameras.\nBecause solid state devices have no moving parts, they are less likely to break down than devices that have mobile mechanisms.  For this reason, it is often more worthwhile to buy an extended warranty on electronics that have moving parts than those that do not.  That is something you may want to think about next time you are shopping."
        ]
    },
    {
        "word": "Sound Card",
        "type": [],
        "definition": [
            "The sound card is a component inside the computer that provides audio input and output capabilities.  Most sound cards have at least one analog line input and one stereo line output connection.  The connectors are typically 3.5 mm minijacks, which are the size most headphones use.  Some sound cards also support digital audio input and output, either through a standard TRS (tip-ring-sleeve) connection or via an optical audio port, such as Toslink connector.\nWhile there are many types of sound cards, any type that produces an analog output must include a digital-to-analog converter (DAC).  This converts the outgoing signal from digital to analog, which can be played through most speaker systems.  Sounds cards that support analog input also require an analog-to-digital converter (ADC).  This digitizes the incoming analog signal, so the computer can process it.\nIn some computers, the sound card is part of the motherboard, while other machines may have an actual card that resides in a PCI slot.  If you want to add more audio capabilities to your computer, such as additional input or output channels, you can install a new sound card.  Professional sound cards often support higher sampling rates (such as 192 kHz instead of 44.1 kHz) and may have more inputs and outputs.  Some cards may also have 1\/4 in. connectors instead of 3.5 mm, which accommodates most instrument outputs.\nWhile professional sound cards can add more audio capabilities to your computer, another popular option for multi-channel recording is a breakout box.  This is an external box that typically includes a built-in sound card and multiple audio connections.  For example, a breakout box may support 16 channels of audio, which would be impossible to fit on a single card.  Most breakout boxes connect to a Firewire or USB port, though some connect to a sound card specifically designed to communicate with the box."
        ]
    },
    {
        "word": "Source Code",
        "type": [],
        "definition": [
            "Every computer program is written in a programming language, such as Java, C\/C++, or Perl.  These programs include anywhere from a few lines to millions of lines of text, called source code.\nSource code, often referred to as simply the \"source\" of a program, contains variable declarations, instructions, functions, loops, and other statements that tell the program how to function.  Programmers may also add comments to their source code that explain sections of the code.  These comments help other programmers gain at least some idea of what the source code does without requiring hours to decipher it.  Comments can be helpful to the original programmer as well if many months or years have gone by since the code was written.\nShort programs called scripts can be run directly from the source code using a scripting engine, such as a VBScript or PHP engine.  Most large programs, however, require that the source code first be compiled, which translates the code into a language the computer can understand.  When changes are made to the source code of these programs, they must be recomplied in order for the changes to take effect in the program.\nSmall programs may use only one source code file, while larger programs may reference hundreds or even thousands of files.  Having multiple source files helps organize the program into different sections.  Having one file that contains every variable and function can make it difficult to locate specific sections of the code.  Regardless of how many source code files are used to create a program, you will most likely not see any of the original files on your computer.  This is because they are all combined into one program file, or application, when they are compiled."
        ]
    },
    {
        "word": "Southbridge",
        "type": [],
        "definition": [
            "The southbridge is a chip that connects the northbridge to other components inside the computer, including hard drives, network connections, USB and Firewire devices, the system clock, and standard PCI cards.  The southbridge sends and receives data from the CPU through the northbridge chip, which is connected directly to the computer's processor.\nSince the southbridge is not connected directly to the CPU, it does not have to run as fast as the northbridge chip.  However, it processes data from more components, so it must be able to multitask well.  On Intel systems, the southbridge is also referred to as the I\/O Controller Hub, since it controls the input and output devices."
        ]
    },
    {
        "word": "Spam",
        "type": [],
        "definition": [
            "Originating from the name of Hormel's canned meat, \"spam\" now also refers to junk e-mail or irrelevant postings to a newsgroup or bulletin board.  The unsolicited e-mail messages you receive about refinancing your home, reversing aging, and losing those extra pounds are all considered to be spam.  Spamming other people is definitely not cool and is one of the most notorious violations of Internet etiquette (or \"netiquette\").  So if you ever get the urge to let thousands of people know about that hot new guaranteed way to make money on the Internet, please reconsider."
        ]
    },
    {
        "word": "Speakers",
        "type": [],
        "definition": [
            "Speakers are one of the most common output devices used with computer systems.  Some speakers are designed to work specifically with computers, while others can be hooked up to any type of sound system.  Regardless of their design, the purpose of speakers is to produce audio output that can be heard by the listener.\nSpeakers are transducers that convert electromagnetic waves into sound waves.  The speakers receive audio input from a device such as a computer or an audio receiver.  This input may be either in analog or digital form.  Analog speakers simply amplify the analog electromagnetic waves into sound waves.  Since sound waves are produced in analog form, digital speakers must first convert the digital input to an analog signal, then generate the sound waves.\nThe sound produced by speakers is defined by frequency and amplitude.  The frequency determines how high or low the pitch of the sound is.  For example, a soprano singer's voice produces high frequency sound waves, while a bass guitar or kick drum generates sounds in the low frequency range.  A speaker system's ability to accurately reproduce sound frequencies is a good indicator of how clear the audio will be.  Many speakers include multiple speaker cones for different frequency ranges, which helps produce more accurate sounds for each range.  Two-way speakers typically have a tweeter and a mid-range speaker, while three-way speakers have a tweeter, mid-range speaker, and subwoofer.\nAmplitude, or loudness, is determined by the change in air pressure created by the speakers' sound waves.  Therefore, when you crank up your speakers, you are actually increasing the air pressure of the sound waves they produce.  Since the signal produced by some audio sources is not very high (like a computer's sound card), it may need to be amplified by the speakers.  Therefore, most external computer speakers are amplified, meaning they use electricity to amplify the signal.  Speakers that can amplify the sound input are often called active speakers.  You can usually tell if a speaker is active if it has a volume control or can be plugged into an electrical outlet.  Speakers that don't have any internal amplification are called passive speakers.  Since these speakers don't amplify the audio signal, they require a high level of audio input, which may be produced by an audio amplifier.\nSpeakers typically come in pairs, which allows them to produce stereo sound.  This means the left and right speakers transmit audio on two completely separate channels.  By using two speakers, music sounds much more natural since our ears are used to hearing sounds from the left and right at the same time.  Surround systems may include four to seven speakers (plus a subwoofer), which creates an even more realistic experience."
        ]
    },
    {
        "word": "Speech Recognition",
        "type": [],
        "definition": [
            "Speech recognition is the capability of an electronic device to understand spoken words.  A microphone records a person's voice and the hardware converts the signal from analog sound waves to digital audio.  The audio data is then processed by software, which interprets the sound as individual words.\nA common type of speech recognition is \"speech-to-text\" or \"dictation\" software, such as Dragon Naturally Speaking, which outputs text as you speak.  While you can buy speech recognition programs, modern versions of the Macintosh and Windows operating systems include a built-in dictation feature.  This capability allows you to record text as well as perform basic system commands.\nIn Windows, some programs support speech recognition automatically while others do not.  You can enable speech recognition for all applications by selecting All Programs &rarr; Accessories &rarr; Ease of Access &rarr; Windows Speech Recognition and clicking \"Enable dictation everywhere.\"  In OS X, you can enable dictation in the \"Dictation & Speech\" system preference pane.  Simply check the \"On\" button next to Dictation to turn on the speech-to-text capability.  To start dictating in a supported program, select Edit &rarr; Start Dictation.  You can also view and edit spoken commands in OS X by opening the \"Accessibility\" system preference pane and selecting \"Speakable Items.\"\nAnother type of speech recognition is interactive speech, which is common on mobile devices, such as smartphones and tablets.  Both iOS and Android devices allow you to speak to your phone and receive a verbal response.  The iOS version is called \"Siri,\" and serves as a personal assistant.  You can ask Siri to save a reminder on your phone, tell you the weather forecast, give you directions, or answer many other questions.  This type of speech recognition is considered a natural user interface (or NUI), since it responds naturally to your spoken input.\nWhile many speech recognition systems only support English, some speech recognition software supports multiple languages.  This requires a unique dictionary for each language and extra algorithms to understand and process different accents.  Some dictation systems, such as Dragon Naturally Speaking, can be trained to understand your voice and will adapt over time to understand you more accurately."
        ]
    },
    {
        "word": "Spellcheck",
        "type": [],
        "definition": [
            "Spellcheck is a feature included with various operating systems and applications that checks text for spelling errors.  Some spellcheckers must be run manually, while others check each word as you type.\nThe first spellcheckers were included with word processors, such as Microsoft Word and Corel WordPerfect.  They worked by checking each word in a text document against a list of words in the program's \"dictionary.\"  If no match was found, the spellchecker would stop and display an alert saying the word was misspelled.\nModern spellcheckers work in a similar way, but include several advancements.  For example, most spellcheckers now allow you to customize the dictionary by adding words so they won't be flagged as misspellings in the future.  Microsoft Word's spellchecker checks grammar as well as spelling.  For instance, it may tell you to use a singular pronoun rather than a plural one or suggest that you use \"which\" instead of \"that\" after a comma in a sentence.\nMost spellcheckers now perform spellchecks in real-time, underlining misspelled words (typically in red) as you type.  OS X will often correct common spelling mistakes automatically (for example, changing \"teh\" to \"the\"). You can also right-click a misspelled word in OS X and select the correct spelling from a list of options.  If the word is spelled correctly, you can choose \"Learn Spelling\" to add the word to the OS X dictionary.\nMobile devices, such as smartphones and tablets take spellchecking to a whole new level with autocorrect and autocomplete.  For example, iOS and Android automatically correct misspellings by guessing what letters you meant to press on the keyboard.  Microsoft Windows Phone provides spelling suggestions as you type, which allows you to complete words by simply selecting them from a list.\nNOTE: Spellcheck may be used as both a noun (performing a spellcheck) and a verb (spellchecking a document).  Ironically, there is no official spelling of the term, as \"spell-check\" and \"spell check\" are also acceptable.  However, \"spellcheck\" is most common."
        ]
    },
    {
        "word": "Spider",
        "type": [],
        "definition": [
            "A spider is a software program that travels the Web (hence the name \"spider\"), locating and indexing websites for search engines.  All the major search engines, such as Google and Yahoo!, use spiders to build and update their indexes.  These programs constantly browse the Web, traveling from one hyperlink to another.\nFor example, when a spider visits a website's home page, there may be 30 links on the page.  The spider will follow each of the links, adding all the pages it finds to the search engine's index.  Of course, the new pages that the spider finds may also have links, which the spider continues to follow.  Some of these links may point to pages within the same website (internal links), while others may lead to different sites (external links).  The external links will cause the spider to jump to new sites, indexing even more pages.\nBecause of the interwoven nature of website links, spiders often return to websites that have already been indexed.  This allows search engines to keep track of how many external pages link to each page.  Usually, the more incoming links a page has, the higher it will be ranked in search engine results.  Spiders not only find new pages and keep track of links, they also track changes to each page, helping search engine indexes stay up to date.\nSpiders are also called robots and crawlers, which may be preferable for those who are not fond of arachnids.  The word \"spider\" can also be used as a verb, such as \"That search engine finally spidered my website last week.\""
        ]
    },
    {
        "word": "Spoofing",
        "type": [],
        "definition": [
            "The word \"spoof\" means to hoax, trick, or deceive.  Therefore, in the IT world, spoofing refers tricking or deceiving computer systems or other computer users.  This is typically done by hiding one's identity or faking the identity of another user on the Internet.\nSpoofing can take place on the Internet in several different ways.  One common method is through e-mail.  E-mail spoofing involves sending messages from a bogus e-mail address or faking the e-mail address of another user.  Fortunately, most e-mail servers have security features that prevent unauthorized users from sending messages.  However, spammers often send spam messages from their own SMTP, which allows them to use fake e-mail addresses.  Therefore, it is possible to receive e-mail from an address that is not the actual address of the person sending the message.\nAnother way spoofing takes place on the Internet is via IP spoofing.  This involves masking the IP address of a certain computer system.  By hiding or faking a computer's IP address, it is difficult for other systems to determine where the computer is transmitting data from.  Because IP spoofing makes it difficult to track the source of a transmission, it is often used in denial-of-service attacks that overload a server.  This may cause the server to either crash or become unresponsive to legitimate requests.  Fortunately, software security systems have been developed that can identify denial-of-service attacks and block their transmissions.\nFinally, spoofing can be done by simply faking an identity, such as an online username.  For example, when posting on an Web discussion board, a user may pretend he is the representative for a certain company, when he actually has no association with the organization.  In online chat rooms, users may fake their age, gender, and location.\nWhile the Internet is a great place to communicate with others, it can also be an easy place to fake an identity.  Therefore, always make sure you know who you are communicating with before giving out private information."
        ]
    },
    {
        "word": "Spool",
        "type": [],
        "definition": [
            "A spool is a temporary storage area within the computer's RAM that contains input or output data.  When a job or process is initiated on a computer, but cannot be run immediately, it is often placed in a spool.  This process is called spooling.  The spool holds the data until the appropriate device is ready to use it.\nThe most common type of spool is a print spool, which stores print jobs that are sent to a printer.  Since the printer may need to warm up before printing a document, the document may be held in the spool during the printer's warm up process.  If there are multiple documents that have been sent to the printer, the print spool may contain a queue of jobs.\nYou can think of a print spool as a spool of yarn that is connected from the computer to the printer.  Of course, the print spool contains computer data, rather than yarn.  As the the data is transmitted to the printer, it is removed from the computer, just like unraveling a spool.  Once the spool is empty, no more data is transmitted to the printer."
        ]
    },
    {
        "word": "Spooling",
        "type": [],
        "definition": [
            "Spooling is the process of sending data to a spool, or temporary storage area in the computer's memory.  This data may contain files or processes.  Like a spool of thread, the data can build up within the spool as multiple files or jobs are sent to it.  However, unlike a spool of thread, the first jobs sent to the spool are the first ones to be processed (FIFO, not LIFO).\nThe most common type of spooling is print spooling, where print jobs are sent to a print spool before being transmitted to the printer.  For example, when you print a document from within an application, the document data is spooled to a temporary storage area while the printer warms up.  As soon as the printer is ready to print the document, the data is sent from the spool to the printer and the document is printed.\nPrint spooling gets its name from technology used in the 1960s when print jobs were stored on large reels of magnetic tape.  The data from these reels was physically spooled to electrostatic printers, which printed the output saved to the tape."
        ]
    },
    {
        "word": "Spreadsheet",
        "type": [],
        "definition": [
            "A spreadsheet is a document that stores data in a grid of horizontal rows and vertical columns.  Rows are typically labeled using numbers (1, 2, 3, etc.), while columns are labeled with letters (A, B, C, etc).  Individual row\/column locations, such as C3 or B12, are referred to as cells.  Each cell can each store a unique instance of data.  By entering data into a spreadsheet, information can be stored in a more structured way than using plain text  The row\/column structure also allows the data to be analyzed using formulas and calculations.\nFor example, each row of a spreadsheet may store information about a person who has an account with a certain company.  Each column may store a different aspect of the person's information, such as the first name, last name, address, phone number, favorite food, etc.  The spreadsheet program can analyze this data by counting the number of people who live in a certain zip code, listing all the people who's favorite food is fried veal, or performing other calcuations.  In this way, a spreadsheet is similar to a database.\nHowever, spreadsheets are more streamlined than databases and are especially useful for processing numbers.  This is why spreadsheets are commonly used in scientific and financial applications.  For example, a spreadsheet may store bank account data, including balance and interest information.  A column that stores the account balances of several clients can easily be summed to produce the total value of all the clients' balances.  These amounts can be multiplied by the interest rate from another cell to see what the value of the accounts will be in a year.  Once the formula has been created, modifying the value of just the interest rate cell will also change the projected value of all the accounts.\nThe most commonly used spreadsheet application is Microsoft Excel, but several other spreadsheet programs are available including IBM Lotus 1-2-3 for Windows and AppleWorks and Numbers for Mac OS X."
        ]
    },
    {
        "word": "Sprite",
        "type": [],
        "definition": [
            "A sprite is a bitmap graphic that is designed to be part of a larger scene.  It can either be a static image or an animated graphic.  Examples of sprites include objects in 2D video games, icons that are part of an application user interface, and small images published on websites.\nIn the 1980s and for most of the 1990s, sprites were the standard way to integrate graphics into video games.  Graphic artists created small 2D images that were used to represent characters and other objects.  Developers referenced these sprites in the source code and assigned properties such as when the sprites were displayed and how they interacted with other sprites.  For example, in a side-scroller, such as Super Mario Bros, the sprite of an enemy Koopa would turn into a flattened Koopa when Super Mario jumped on it.  Today, some video games still use 2D sprites, but most mainstream games use 3D polygons instead.  Since computers and gaming consoles now have dedicated 3D video cards, they can actually render 3D objects more efficiently than 2D sprites.\nWhile sprites have become less common in modern video games, they are still used by software developers for other purposes.  For example, sprites are often used to add buttons, symbols, and other user interface elements to software programs.  Developers can attach actions to sprites within the user interface, such as playing an animation or changing the current view of the window when the sprite is clicked.  Sprites are especially useful for adding custom graphics that are not natively supported by the operating system's API.\nSprites are also used on the Web for navigation buttons and for adding visual appeal to webpages.  In recent years, sprite sheets have become a popular way for web developers to load website graphics.  By combining a large number of sprites into a single image, all the sprites can be downloaded and cached by a user's browser with a single request to the server.  The images are then displayed using CSS properties that define the locations of individual sprites within the image."
        ]
    },
    {
        "word": "Spyware",
        "type": [],
        "definition": [
            "As the name implies, this is software that \"spies\" on your computer.  Nobody likes to be spied on, and your computer doesn't like it either.  Spyware can capture information like Web browsing habits, e-mail messages, usernames and passwords, and credit card information.  If left unchecked, the software can transmit this data to another person's computer over the Internet.\nSo how does spyware get on your computer?  Just like viruses, spyware can be installed when you open an e-mail attachment containing the malicious software.  It can also be installed when you install another program that has a spyware installer attached to it.  Because of the insidious nature of spyware, most people don't even know when spyware is on their computer.  Fortunately, you can purchase anti-spyware utilities that will search for spyware on your computer and stomp the unwanted software out of your system.  A good way to prevent spyware from infecting your computer is to install a security program that lets you know when any program is being installed, so that you can choose to authorize or stop the installation."
        ]
    },
    {
        "word": "Stack",
        "type": [],
        "definition": [
            "In computing, a stack is a data structure used to store a collection of objects.  Individual items can be added and stored in a stack using a push operation.  Objects can be retrieved using a pop operation, which removes an item from the stack.\nWhen an object is added to a stack, it is placed on the top of all previously entered items.  When an item is removed, it can either be removed from the top or bottom of the stack.  A stack in which items are removed the top is considered a \"LIFO\" (Last In, First Out) stack.  You can picture a LIFO stack as a deck of cards where you lay individual cards on the deck, then draw cards from the top.  In a \"FIFO\" (First In, First Out) stack, items are removed the bottom.  You can picture a FIFO stack as a row in a vending machine where items are dispensed in the order they were placed in the machine.\nStacks have several applications in commuter programming.  LIFO stacks, for example, can be used to retrieve recently used objects, from a cache.  FIFO stacks may be used to ensure data is retrieved in the order it was entered, which may be used for processing data in a queue.\nWhile stacks are commonly used by software programmers, you will typically not notice them while using a program.  This is because the creation of stacks and push and pop operations are performed in the background while an application is running and are not visible to the user.  However, if a stack runs out of memory, it will cause a \"stack overflow.\"  If not handled correctly by the program, a stack overflow may generate an error message or cause the program to crash.\nNOTE: The term \"stack\" may also refer to a protocol stack, which consists of multiple network protocols that work together.  Each protocol is categorized into one of seven different layers defined in the OSI model."
        ]
    },
    {
        "word": "Standalone",
        "type": [],
        "definition": [
            "A standalone device is able to function independently of other hardware.  This means it is not integrated into another device.  For example, a TiVo box that can record television programs is a standalone device, while a DVR that is integrated into a digital cable box is not standalone.  Integrated devices are typically less expensive than multiple standalone products that perform the same functions.  However, using standalone hardware typically allows the user greater customization, whether it be a home theater or computer system.\nStandalone can also refer to a software program that does not require any software other than the operating system to run.  This means that most software programs are standalone programs.  Software such as plug-ins and expansion packs for video games are not standalone programs since they will not run unless a certain program is already installed."
        ]
    },
    {
        "word": "Standby",
        "type": [],
        "definition": [
            "When electronic devices are receiving power but are not running, they are in standby mode.  For example, a television is in standby mode when it is plugged in, but turned off.  While the TV is not \"on,\" it is ready to receive a signal from the remote control.  An A\/V receiver is also in standby mode when it is plugged in and turned off.  This is because the receiver may be activated by receiving input from a connected device or by being turned on directly with the remote control.  In other words, these devices are \"standing by,\" waiting to receive input from the user or another device.\nWhen a computer is in standby mode, it is not completely turned off.  Instead, it has already been turned on, but has gone into \"sleep\" mode.  Therefore, when referring to computers, \"Sleep\" and \"Standby\" may be used synonymously.  A computer in standby mode requires a small amount of current, called a \"trickle charge,\" that keeps the current state of running software saved in the computer's RAM.  However, because the computer is in sleep mode, the CPU, video card, and hard drive are not running.  Therefore, the computer uses very little power in standby mode.\nSince standby mode saves energy, it is a good idea to put your computer to sleep if you are going to be away from it for more than 15 or 20 minutes.  You can also use the Power Options control panel (in Windows) or the Energy Saver System Preference (in Mac OS X) to automatically put your computer to sleep after it has been inactive for a specific amount of time.  Then, when you take a break from your computer, your computer can take a break as well."
        ]
    },
    {
        "word": "Start Menu",
        "type": [],
        "definition": [
            "The Start menu is a feature of the Windows operating system that provides quick access to programs, folders, and system settings.  By default, the Start menu is located in the lower-left corner of the Windows desktop.  In Windows 95 through Windows XP, the Start menu can be opened by clicking the \"Start\" button.  In newer versions of Windows, such as Windows Vista and Windows 7, the Start menu can be opened by clicking the Windows logo.  Some keyboards also have a Windows key that opens the Start menu when pressed.\nThe Start menu contains two primary columns.  The left column contains a list of the most commonly used programs, as well as an \"All Programs\" submenu, which displays all the currently installed applications.  The bottom of the left column includes a search box, which can be used to search for programs and files.  The right column contains links to common folders, such the Documents, Pictures, and Music folders.  It also includes links to the Control Panel, Default Programs, and other system settings.  The bottom of the right column includes a \"Shut down\" button, which can be used to turn off or restart the computer, put the computer to sleep, or switch users.\nThe Start menu is an important part of the Windows user interface since it provides shortcuts to many commonly accessed items.  By familiarizing yourself with all the items in the Start menu, you may be able to use your computer more efficiently.  If you are feeling extra creative, you can customize the functionality of the Start menu by right-clicking a blank area within the Start menu and selecting \"Properties.\"  The resulting window will allow you to modify the appearance and behavior of items within the Start menu."
        ]
    },
    {
        "word": "Static Website",
        "type": [],
        "definition": [
            "A static website contains Web pages with fixed content.  Each page is coded in HTML and displays the same information to every visitor.  Static sites are the most basic type of website and are the easiest to create.  Unlike dynamic websites, they do not require any Web programming or database design.  A static site can be built by simply creating a few HTML pages and publishing them to a Web server.\nSince static Web pages contain fixed code, the content of each page does not change unless it is manually updated by the webmaster.  This works well for small websites, but it can make large sites with hundreds or thousands of pages difficult to maintain.  Therefore, larger websites typically use dynamic pages, which can be updated by simply modifying a database record.  Static sites that contain a lot of pages are often designed using templates.  This makes it possible to update several pages at once, and also helps provide a consistent layout throughout the site."
        ]
    },
    {
        "word": "Status Bar",
        "type": [],
        "definition": [
            "A status bar is a small area at the bottom of a window.  It is used by some applications to display helpful information for the user.  For example, an open folder window on the desktop may display the number of items in the folder and how many items are selected.  Photoshop uses the status bar to display the size of the current image, the zoom percentage, and other information.  Web browsers use the status bar to display the Web address of a link when the user moves the cursor over it.  It  also shows the status of loading pages, and displays error messages.\nIf you don't see the status bar in your Web browser or another program, you may be able to enable it by selecting \"Show Status Bar\" from the application's View menu.  If this option is not available in the View menu, the program may not use a status bar.  Some programs use a \"status window\" instead to show the current activity in the application.  The option for displaying this window is usually found in the \"Window\" menu."
        ]
    },
    {
        "word": "Steganography",
        "type": [],
        "definition": [
            "Steganography is the art of concealing information.  In computer science, it refers to hiding data within a message or file.  It serves a similar purpose to cryptography, but instead of encrypting data, steganography simply hides it from the user.\nInvisible ink is an example of steganography that is unrelated to computers.  A person can write a message with clear or \"invisible\" ink that can only be seen when another ink or liquid is applied to the paper.  Similarly, in digital steganography, the goal is to hide information from users except those who are meant to see or hear it.\nSteganography Examples\nSince steganography is more of an art than a science, there is no limit to the ways steganography can be used.  Below are a few examples:\n\nPlaying an audio track backwards to reveal a secret message\nPlaying a video at a faster frame rate (FPS) to reveal a hidden image\nEmbedding a message in the red, green, or blue channel of an RGB image\nHiding information within a file header or metadata\nEmbedding an image or message within a photo through the addition of digital noise\n\nSteganography can also be as simple as embedding a secret message in plain text.  Consider the following sentence:\n\"This example contains highly Technical expressions regarding modern simulations.\"\nThe first letter of each word produces the hidden phrase, \"TechTerms.\""
        ]
    },
    {
        "word": "Storage Capacity",
        "type": [],
        "definition": [
            "Storage capacity refers to how much disk space one or more storage devices provides.  It measures how much data a computer system may contain.  For an example, a computer with a 500GB hard drive has a storage capacity of 500 gigabytes.  A network server with four 1TB drives, has a storage capacity of 4 terabytes.\nStorage capacity is often used synonymously with \"disk space.\"  However, it refers to overall disk space, rather than free disk space.  For example, a hard drive with a storage capacity of 500GB may only have 150MB available if the rest of the disk space is already used up.  Therefore, when checking your computer to see if it meets a program's system requirements, make sure you have enough free disk space to install the program.  If you need more disk space, you can increase your computer's storage capacity by adding another internal or external hard drive."
        ]
    },
    {
        "word": "Storage Device",
        "type": [],
        "definition": [
            "A computer storage device is any type of hardware that stores data.  The most common type of storage device, which nearly all computers have, is a hard drive.  The computer's primary hard drive stores the operating system, applications, and files and folders for users of the computer.\nWhile the hard drive is the most ubiquitous of all storage devices, several other types are common as well.  Flash memory devices, such as USB keychain drives and iPod nanos are popular ways to store data in a small, mobile format.  Other types of flash memory, such as compact flash and SD cards are popular ways to store images taken by digital cameras.\nExternal hard drives that connect via Firewire and USB are also common.  These types of drives are often used for backing up internal hard drives, storing video or photo libraries, or for simply adding extra storage.  Finally, tape drives, which use reels of tape to store data, are another type of storage device and are typically used for backing up data."
        ]
    },
    {
        "word": "Streaming",
        "type": [],
        "definition": [
            "Data streaming, commonly seen in the forms of audio and video streaming, is when a multimedia file can be played back without being completely downloaded first.  Most files, like shareware and software updates that you download off the Internet, are not streaming data.  However, certain audio and video files like Real Audio and QuickTime documents can be streaming files, meaning you can watch a video or listen to a sound file while it's being downloaded to your computer.  With a fast Internet connection, you can actually stream live audio or video to your computer."
        ]
    },
    {
        "word": "String",
        "type": [],
        "definition": [
            "A string is a data type used in programming, such as an integer and floating point unit, but is used to represent text rather than numbers.  It is comprised of a set of characters that can also contain spaces and numbers.  For example, the word \"hamburger\" and the phrase \"I ate 3 hamburgers\" are both strings.  Even \"12345\" could be considered a string, if specified correctly.  Typically, programmers must enclose strings in quotation marks for the data to recognized as a string and not a number or variable name.\nFor example, in the comparison:\nif (Option1 == Option2) then ...\nOption1 and Option2 may be variables containing integers, strings, or other data.  If the values are the same, the test returns a value of true, otherwise the result is false.  In the comparison:\nif (\"Option1\" == \"Option2\") then ...\nOption1 and Option2 are being treated as strings.  Therefore the test is comparing the words \"Option1\" and \"Option2,\" which would return false.  The length of a string is often determined by using a null character."
        ]
    },
    {
        "word": "Struct",
        "type": [],
        "definition": [
            "A struct (short for structure) is a data type available in C programming languages, such as C, C++, and C#.  It is a user-defined data type that can store multiple related items.  A struct variable is similar to a database record since it may contain multiple data types related to a single entity.\nBelow is an example of an article defined as a struct in the C programming language.\nstruct Article\n{\n&nbsp; &nbsp; int &nbsp; &nbsp;articleID;\n&nbsp; &nbsp; char &nbsp; title[120];\n&nbsp; &nbsp; char &nbsp; date[10];\n&nbsp; &nbsp; char &nbsp; author[60];\n&nbsp; &nbsp; char &nbsp; content[4000];\n}\nThe above struct \"Article\" contains both integer and character array data types.  It can be used to store all the information about an article in a single variable. Since structs group the data into a contiguous block of memory, only a single pointer is needed to access all the data of a specific article.\nStructs are similar to classes used in object oriented programing languages, such as Objective C and C#.  The primary difference between the two data structures is that structs are public while classes are private by default.  That means struct variables can be accessed and modified by any function within the code, while classes may only be accessed by the function in which they are defined."
        ]
    },
    {
        "word": "Stylus",
        "type": [],
        "definition": [
            "A stylus is an input device that looks and acts like a pen.  Instead of drawing with ink, it sends a digital signal to a compatible touchscreen, which interprets the pressure as drawing on the screen.\nA basic stylus is a thin plastic rod tapered on the end like a pen.  Early PDAs such as the Apple Newton and Palm Pilot came with this type of stylus.  Many digital signature pads used for credit card purchases also use a plastic stylus.  Simply the pressure of the plastic tip is used to draw a digital image on the screen.\nModern smartphones and tablets have advanced touchscreens that are designed to be controlled by human touch.  In order to prevent unintentional input, they ignore contact from other sources — like a stylus.  Therefore, modern touchscreen devices, like the Samsung Galaxy Note and the Apple iPad Pro have custom styluses that include built-in sensors and transmitters.  The Apple Pencil, for example, connects to the iPad via Bluetooth.  The iPad Pro combines information from both the stylus and the touchscreen to accurately record the motion of drawing on the screen.\nNOTE: Any stylus that contains sensors or connects wirelessly to a device is battery-powered.  Therefore, a modern stylus may need to be charged in order to work correctly."
        ]
    },
    {
        "word": "Subdirectory",
        "type": [],
        "definition": [
            "Computers store data in a series of directories.  Each directory, or folder, may contain files or other directories.  If a directory is located within another directory, it is called a subdirectory (or subfolder) of that folder.  Subdirectories may refer to folders located directly within a folder, as well as folders that are stored in other folders within a folder.  For example, the main directory of a file system is the root directory.  Therefore, all other folders are subdirectories of the root folder.\nThe contents of your computer's operating system are organized using subdirectories.  After all, you can imagine how hard it would be to locate documents on your computer if they were all stored in a single folder.  By using subdirectories, users can navigate through folders in a logical hierarchy.\nFor example, in Windows, the C: drive contains a \"Documents and Settings\" subdirectory.  Within this directory, are subdirectories for each user of the computer.  Within each user's folder are other subdirectories, including \"Desktop,\" \"My Documents,\" and \"Start Menu.\"  In Mac OS X, the main hard disk contains a \"Users\" folder.  This directory contains a list of all the users' home folders.  Within each user's home folder are several other subdirectories, such as \"Documents,\" \"Movies,\" and \"Music.\"\nBoth Windows and Mac users can create subdirectories to further organize data within these predefined folders.  This can be useful when categorizing data on your hard drive.  For example, if you store all your digital photos within the \"Pictures\" folder, you might create subdirectories that are named by date, such as \"2009-06-01,\" \"2009-07-04,\" \"2009-08-15,\" etc.  You could also create subdirectories based on the source of each image, such as \"Digital Photos,\" \"Screenshots,\" and \"Scanned Images.\"  Regardless of what folder names you choose, creating subdirectories can save you a lot of time when browsing through files in the future."
        ]
    },
    {
        "word": "Subnet Mask",
        "type": [],
        "definition": [
            "A subnet mask is a number that defines a range of IP addresses available within a network.  A single subnet mask limits the number of valid IPs for a specific network.  Multiple subnet masks can organize a single network into smaller networks (called subnetworks or subnets).  Systems within the same subnet can communicate directly with each other, while systems on different subnets must communicate through a router.\nA subnet mask hides (or masks) the network part of a system's IP address and leaves only the host part as the machine identifier.  It uses the same format as an IPv4 address — four sections of one to three numbers, separated by dots.  Each section of the subnet mask can contain a number from 0 to 255, just like an IP address.  For example, a typical subnet mask for a Class C IP address is:\n255.255.255.0\nIn the example above, the first three sections are full (255 out of 255), meaning the IP addresses of devices within the subnet mask must be identical in the first three sections.  The last section of each computer's IP address can be anything from 0 to 255.  If the subnet mask is defined as 255.255.255.0, the IP addresses 10.0.1.99 and 10.0.1.100 are in the same subnet, but 10.0.2.100 is not.\nA subnet mask of 255.255.255.0 allows for close to 256 unique hosts within the network (since not all 256 IP addresses can be used).\nIf your computer is connected to a network, you can view the network's subnet mask number in the Network control panel (Windows) or System Preference (macOS).  Most home networks use the default subnet mask of 255.255.255.0.  However, an office network may be configured with a different subnet mask such as 255.255.255.192, which limits the number of IP addresses to 64.\nLarge networks with several thousand machines may use a subnet mask of 255.255.0.0.  This is the default subnet mask used by Class B networks and provides up to 65,536 IP addresses (256 x 256).  The largest Class A networks use a subnet mask of 255.0.0.0, allowing for up to 16,777,216 IP addresses (256 x 256 x 256)."
        ]
    },
    {
        "word": "Subscript",
        "type": [],
        "definition": [
            "A subscript is a character or string that is smaller than the preceding text and sits at or below the baseline.  Subscripts have many scientific applications, including mathematics, computer science, and chemistry.\nBelow is an example of a math function that uses subscripts to define the Fibonacci sequence:\nFn = Fn-1 + Fn−2\nThe small \"n\" is a subscript.  When used in the context \"Fn,\" it refers to a function evaluated for the value \"n.\"  The text n-1 and n-2 are also subscripts that define previous values of \"n\" in the sequence.\nIn computer science, subscripts can be used to specify a number system.  For example, the decimal or \"denary\" number 200 is equal to 11001000 in binary and C8 in hexadecimal.  Instead of writing out the full words, you could describe the equality of the three numbers with the following statement:\n20010 = 110010002 = C816\nSubscripts are also used in chemistry to describe chemical compounds.  For example, the molecular structure of water, which includes two hydrogen atoms and one oxygen atom, is commonly written:\nH2O\nMost modern word processors include a text formatting option that allows you to enter subscript or superscript text.  HTML provides the &lt;sub&gt; tag for displaying subscript on webpages.  If a text editor doesn't provide subscript formatting, you can shrink the font size of the subscript as a workaround.  If you are working with plain text, the only option is to enter subscript characters on a separate line below the text."
        ]
    },
    {
        "word": "Supercomputer",
        "type": [],
        "definition": [
            "As the name implies, a supercomputer is no ordinary computer.  It is a high performance computing machine designed to have extremely fast processing speeds.  Supercomputers have various applications, such as performing complex scientific calculations, modeling simulations, and rendering large amounts of 3D graphics.  They may also be built to simply showcase the leading edge of computing technology.\nIf you are hoping to have a supercomputer on your desk, you may be out of luck.  Supercomputers are typically several times the size of a typical desktop computer and require far more power.  A supercomputer may also consist of a series of computers, which may fill an entire room.  Examples of single machine supercomputers include the early Cray-1 and Cray X-MP systems developed by Cray Research as well as the more recent Blue Gene and Roadrunner systems developed by IBM.  System X is an example of a multi-system supercomputer, which was developed by Virginia Tech and is comprised of 1,100 Apple Xserve G5s.\nSupercomputers cost a fortune to build and are expensive to maintain, which is why only a few exist in the entire world.  Furthermore, computing power continues to advance each year, meaning it isn't too long before a ground-breaking supercomputer isn't so super.  The good news is that the supercomputers of the past eventually become the personal computers of today.  Therefore, your home PC most likely has more computing power than many supercomputers from previous decades.  Now that's super cool."
        ]
    },
    {
        "word": "Superscalar",
        "type": [],
        "definition": [
            "A superscalar CPU can execute more than one instruction per clock cycle.  Because processing speeds are measured in clock cycles per second (megahertz), a superscalar processor will be faster than a scalar processor rated at the same megahertz.\nA superscalar architecture includes parallel execution units, which can execute instructions simultaneously.  This parallel architecture was first implemented in RISC processors, which use short and simple instructions to perform calculations.  Because of their superscalar capabilities, RISC processors have typically performed better than CISC processors running at the same megahertz.  However, most CISC-based processors (such as the Intel Pentium) now include some RISC architecture as well, which enables them to execute instructions in parallel.  Nearly all processors developed after 1998 are superscalar."
        ]
    },
    {
        "word": "Superscript",
        "type": [],
        "definition": [
            "A superscript is a character or string that is smaller than the preceding text and sits above the baseline.  Superscripts have several applications in both math and writing.\nIn math, superscripts are commonly used for exponents.  For example:\n23 = 8\nThe calculation above can also be written as 2^3 = 8.  The caret symbol (^) is often used as an alternative when superscript text formatting is not available.  Both \"23\" and \"2^3\" can be described as \"two to the third power,\" where \"3\" is the exponent.\nIn writing, superscripts have several different uses.  Examples include footnotes, ordinal indicators, and trademarks.  A footnote is a letter or number, typically placed at the end of a sentence, that refers to a reference or citation.  The actual citation, which is preceded by the corresponding letter or number, may be located at the end of the page, document, or literary work.  For example, the \"c\" is the footnote in the sentence below.\nThe population of the United States in 2015 is estimated to be 320 million. c\nOrdinal indicators may also be written using superscript, such as the following examples:\n1st (first), 2nd (second), 3rd (third).\nFinally, trademarks and service marks are often displayed in superscript, such as ™ and ℠.\nMost word processors support both subscript and superscript text.  HTML provides the &lt;sup&gt; tag for displaying superscript in a webpage.  If you are editing a plain text document or using a program that doesn't support superscript, you can represent superscript text using other methods.  For example, mathematical exponents can be denoted with the caret symbol (^).  Footnotes and trademarks can be denoted using parentheses, such as (a) for a footnote or (TM) for a trademark.  Ordinal notation does not require superscript and can be written 1st, 2nd, 3rd, etc."
        ]
    },
    {
        "word": "Surface",
        "type": [],
        "definition": [
            "Surface is a tablet PC developed by Microsoft.  The first Surface model was released on October 26, 2012, the same day as Windows 8 and Windows RT.\nThe Surface is a hybrid device that combines the features of a tablet and a laptop.  It does not require any external input devices and can be used as a standalone touchscreen tablet.  However, the Surface easily connects to Microsoft's custom keyboard, which includes a trackpad that can be used to control a cursor on the screen.  The built-in \"kickstand\" allows the tablet to stand upright, and when combined with the keyboard, makes the Surface look and feel like a laptop.\nThe Surface runs both Windows RT and Windows 8 Pro, though the device initially shipped exclusively with Windows RT.  Both operating systems support touchscreen and keyboard\/mouse input, which means you can use the Surface however you prefer.  For example, if you are on-the-go, you can use the on-screen keyboard to enter text input.  If you are at a desk, you can flip out the kickstand and use the physical keyboard.  You can also use the keyboard's built-in trackpad or a connected mouse to click on items rather than tapping the screen.\nThe Surface is designed to be a highly portable device and therefore includes built-in wireless communication, such as Wi-Fi (802.11a\/b\/g\/n) and Bluetooth 4.0.  It also has a USB port for wired peripherals, a micro SDXC card slot for extra storage, an audio input\/output jack, and a micro HDMI video out port.  The Surface's magnesium case includes built-in front and rear-facing 720p HD cameras and a 16x9 screen with a resolution of 1366x768 pixels.\nNOTE: The Surface can be purchased with or without a keyboard.  You can choose between either the \"touch keyboard,\" which has a flat, spill-proof surface, or the \"type keyboard,\" which has raised keys and feels more like a traditional keyboard.  Both keyboards double as protective covers for the Surface and can be folded to the back of the tablet when not in use."
        ]
    },
    {
        "word": "Surge Protector",
        "type": [],
        "definition": [
            "The surge protector is an important, yet often overlooked part of a computer setup.  It allows multiple devices to plugged in to it at one time and protects each connected device from power surges.  For example, a home office may have a computer, monitor, printer, cable modem, and powered speakers all plugged into one surge protector, which is plugged into a single outlet in the wall.  The surge protector allows many devices to use one outlet, while protecting each of them from electrical surges.\nSurge protectors, sometimes called power strips, prevent surges in electrical current by sending the excess current to the grounding wire (which is the round part of the plug below the two flat metal pieces on U.S. outlet plugs).  If the surge is extra high, such as from a lightning strike, a fuse in the surge protector will blow and the current will prevented from reaching any of the devices plugged into the surge protector.  This means the noble surge protector will have given its life for the rest of the equipment, since the fuse is destroyed in the process.\nWhile surge protectors all perform the same basic function, they come in many shapes and sizes with different levels of protection.  Some may look like basic power strips, while others may be rack mounted or fit directly against the wall.  Most surge protectors offer six to ten different outlets.  Cheaper surge protectors offer limited protection for surges (under 1000 joules), while more expensive ones offer protection for several thousand joules and include a monetary guarantee on connected devices if a power surge happens.  Typically, you get what you pay for, so if you have an expensive computer system, it is wise to buy a quality surge protector that offers at least 1000 joules of protection.\nSome surge protectors also include line conditioning, which uses an electromagnet to maintain a consistent level of electricity when there are slight variations in current.  For example, you might notice your computer monitor or television fade for a moment when you turn on a high-powered device, like a vacuum or air conditioner.  A surge protector with line conditioning should prevent connected devices from being affected by these slight variances in current.\nWhile you may be able to hook up your computer system without a surge protector, it is important to protect your equipment by using one.  You may not need a large, expensive surge protector with line conditioning, but using a quality surge protector for all your electronic devices is a smart choice."
        ]
    },
    {
        "word": "Swap File",
        "type": [],
        "definition": [
            "A swap file is a file that contains data retrieved from system memory, or RAM.  By transferring data from RAM to a secondary storage device in the form of a swap file, a computer is able to free up memory for other programs.\nSwap files are a type of virtual memory, since they are not stored in physical RAM.  They extend the amount of available memory a computer can access by swapping memory used by idle processes from RAM to a swap file.  This action is also called \"paging\" and is a common type of memory management.  When swapped memory is needed by a program, the data from the swap file is paged back into physical memory.\nWhile swap files are a convenient way to increase the amount of available system memory, they can also decrease system performance.  For instance, if a computer is using nearly all of its physical memory, the system may need to frequently swap data between RAM and swap files.  Since reading data from a secondary storage device (such as an HDD or SSD) is much slower than accessing RAM, repeatedly swapping memory may cause noticeable delays.\nSwap files are automatically created, accessed, and deleted by the operating system, which means you don't have to worry about maintaining them.  However, if you notice your computer is slowing down when you switch between programs, it may indicate your computer is running low on system memory and is frequently swapping memory.  You can temporarily alleviate this problem by closing unused programs.  The best long term solution is to add more RAM.\nFile extension: .SWP"
        ]
    },
    {
        "word": "Swift",
        "type": [],
        "definition": [
            "Swift is a high-level programming language developed by Apple and made available in 2014.  It is designed for writing apps for Apple platforms, including macOS, iOS, tvOS, and watchOS.\nThe Swift language is based on Objective-C, which was used for NeXTSTEP development in the 1980s, and later macOS and iOS.  Swift has similar syntax and maintains the object-oriented features of Objective-C, but provides a more simplified programming experience.  For example, Swift code is easier to read and write than Objective-C.  It allows several common commands to be combined and does require semicolons (;) at the end of each statement.\nAdditionally, Swift handles several programming obstacles automatically.  For example, Swift:\n\ninitializes variables before they are used\nhandles \"nil\" (NULL) values explicitly\nensures array indices are in bounds\nprevents integers from overflowing their allotted memory\nmanages memory automatically\n\nApple's Xcode software development IDE has supported Swift since version 6 (released in 2014).  Xcode also supports \"Swift Playgrounds,\" a feature that allows programmers to edit Swift code and see the results immediately.  For example, the playground may display the source code on the left and an app simulator on the right.  Changes to the code update the app simulation on-the-fly.  Several playgrounds are included with Xcode to provide an easy way to learn the language.\nSince Apple develops and maintains the Swift language, it is optimized for Apple hardware.  Therefore an iOS app developed in Swift may perform better than a similar app developed in another language.  Apple also updates Swift with new features on a regular basis.  This allows developers programming in Swift to take advantage of the latest advances in Macs, iPhones, iPads, and other Apple products.\nFile extension: .SWIFT"
        ]
    },
    {
        "word": "Swipe",
        "type": [],
        "definition": [
            "Swipe is a command used primarily with touchscreen devices, such as smartphones and tablets.  It is also supported by some laptops with trackpads and desktop computers with trackpad input.\nA swipe involves quickly moving (or \"swiping\") your finger across a touchscreen or trackpad.  For example, swiping the screen from right to left in a photo viewing application typically displays the next photo.  While browsing multiple photos, swiping up or down may allow you to scroll through the photo library.  Most smartphones also allow you to swipe left or right to switch between home screens.\nDevices that support multi-touch may allow you to swipe with multiple fingers to perform different functions.  For example, MacBook users can swipe left or right with two fingers to perform the Back or Forward command in a web browser.  Swiping up or down with three fingers performs the Exposé command in Mac OS X."
        ]
    },
    {
        "word": "Switch",
        "type": [],
        "definition": [
            "A switch is used to network multiple computers together.  Switches made for the consumer market are typically small, flat boxes with 4 to 8 Ethernet ports.  These ports can connect to computers, cable or DSL modems, and other switches.  High-end switches can have more than 50 ports and often are rack mounted.\nSwitches are more advanced than hubs and less capable than routers.  Unlike hubs, switches can limit the traffic to and from each port so that each device connected to the switch has a sufficient amount of bandwidth.  For this reason, you can think of a switch as a \"smart hub.\"  However, switches don't provide the firewall and logging capabilities that routers do.  Routers can often be configured by software (typically via a Web interface), while switches only work the way the hardware was designed.\nThe term \"switch\" can also be used to refer to a small lever or button on computer hardware.  And while it has nothing to do with computers, \"riding switch\" means riding backwards in skateboarding and snowboarding."
        ]
    },
    {
        "word": "Symbolic Link",
        "type": [],
        "definition": [
            "A symbolic link (or \"symlink\") is file system feature that can be used to create a link to a specific file or folder.  It is similar to a Windows \"shortcut\" or Mac \"alias,\" but is not an actual file.  Instead, a symbolic link is a entry in a file system that points to a directory or file.  The system recognizes the symbolic link as the actual directory or file, providing a alternate way to access it.\nSymbolic links are supported by Mac, Windows, and Unix, but are most commonly found on Unix systems, since Unix is known for having a large (and often confusing) hierarchy of directories.  The root folder alone has several different subdirectories, many of which do not have a clearly defined purpose.  Examples include bin, dev, etc, lib, tmp, usr, and var.  This can make it difficult to find certain files, especially if they are located several directories deep in the file system.  Symbolic links help alleviate this problem by creating an easier way to access common files and folders.\nTo create a symlink in Unix, you can type a simple command at the command prompt using the syntax below.  (The \"-s\" part of the command is important, since it tells the system to create a symbolic link.)\nln -s [target directory or file] \/[shortcut]\nFor example, you can create a symlink \"\/apachelogs\" that points to \"\/usr\/local\/apache\/logs\" using the following command:\nln -s \/usr\/local\/apache\/logs \/apachelogs\nAfter entering the command above, you would be able to access the Apache logs directory by simply opening \"\/apachelogs.\"  While symlinks are recognized by most programs, it may be necessary to enable a program or process to follow symbolic links.  For example, in order for an Apache web server to recognize symbolic links, the line \"Options +FollowSymLinks\" must be added to the httpd.conf file."
        ]
    },
    {
        "word": "Sync",
        "type": [],
        "definition": [
            "\"Sync\" is short for synchronize.  When you sync a device, such as a cell phone, PDA, or iPod, you synchronize it with data on your computer.  This is typically done by connecting the device to your computer via a USB or wireless Bluetooth connection.  For example, you might sync the address book stored on your computer with your cell phone to update the contacts.  If you have an iPod, you may connect it to your computer to sync songs, videos, and other data using Apple iTunes.\nWhen you sync a device with your computer, it typically updates both device and the computer with the most recent information.  This is also referred to as \"merging\" the data.  For example, if you have added a phone number to your phone since the last time you synced it with your computer, that number will be added to your computer's address book.  Similarly, any numbers entered into the computer's address book since the last sync will be added to the phone.  Most syncing programs also remove entries that have been deleted on either the device or the computer since the last sync.\nSince many devices can be synced with a single computer, the computer is often referred to as the \"hub\" for syncing portable electronics.  For example, you might be able to sync an iPod, Blackberry, and PDA using the same address book on your computer.  However, you may need to use a different syncing program for each device, since most use a proprietary software utility to sync with the computer.  Common syncing programs include iTunes, The Missing Sync, Palm Desktop, and iSync.\n"
        ]
    },
    {
        "word": "Syntax",
        "type": [],
        "definition": [
            "Every spoken language has a general set of rules for how words and sentences should be structured.  These rules are collectively known as the language syntax.  In computer programming, syntax serves the same purpose, defining how declarations, functions, commands, and other statements should be arranged.\nMany computer programming languages share similar syntax rules, while others have a unique syntax design.  For example, C and Java use a similar syntax, while Perl has many characteristics that are not seen in either the C or Java languages.\nA program's source code must have correct syntax in order to compile correctly and be made into a program.  In fact, it must have perfect syntax, or the program will fail to compile and produce a \"syntax error.\"  A syntax error can be as simple as a missing parenthesis or a forgotten semicolon at the end of a statement.  Even these small errors will keep the source code from compiling.\nFortunately, most integrated development environments (IDEs) include a parser, which detects syntax errors within the source code.  Modern parsers can even highlight syntax errors before a program is compiled, making it easy for the programmer to locate and fix them.\nNOTE: Syntax errors are also called compile-time errors, since they can prevent a program from compiliing.  Errors that occur in a program after it has been compiled are called runtime errors, since they occur when the program is running."
        ]
    },
    {
        "word": "Syntax Error",
        "type": [],
        "definition": [
            "A syntax error is an error in the source code of a program.  Since computer programs must follow strict syntax to compile correctly, any aspects of the code that do not conform to the syntax of the programming language will produce a syntax error.\nUnlike logic errors, which are errors in the flow or logic of a program, syntax errors are small grammatical mistakes, sometimes limited to a single character.  For example, a missing semicolon at the end of a line or an extra bracket at the end of a function may produce a syntax error.  In the PHP code below, the second closed bracket would result in a syntax error since there is only one open bracket in the function.\nfunction testFunction()\n{\necho \"Just testing.\";\n}}\nSome software development IDEs check the source code for syntax errors in real-time, while others only generate syntax errors when a program is compiled.  Even if a source code file contains one small syntax error, it will prevent an application from being successfully compiled.  Similarly, if you run a script through an interpreter, any syntax errors will prevent the script from completing.  In most cases, the compiler or interpreter provides the location (or line number) of the syntax error, making it easy for the programmer to find and fix the error."
        ]
    },
    {
        "word": "System Analyst",
        "type": [],
        "definition": [
            "A system analyst is the person who selects and configures computer systems for an organization or business.  His or her job typically begins with determining the intended purpose of the computers.  This means the analyst must understand the general objectives of the business, as well as what each individual user's job requires.  Once the system analyst has determined the general and specific needs of the business, he can choose appropriate systems that will help accomplish the goals of the business.\nWhen configuring computer systems for a business, the analyst must select both hardware and software.  The hardware aspect includes customizing each computer's configuration, such as the processor speed, amount of RAM, hard drive space, video card, and monitor size.  It may also involve choosing networking equipment that will link the computers together.  The software side includes the operating system and applications that are installed on each system.  The software programs each person requires may differ greatly between users, which is why it is important that the system analyst knows the specific needs of each user.\nTo summarize, the system analyst's job is to choose the most efficient computer solutions for a business, while making sure the systems meet all the company's needs.  Therefore, the system analyst must have a solid understanding of computer hardware and software and should keep up-to-date on all the latest technologies.  He must also be willing to listen to the constant needs and complaints of the users he builds systems for."
        ]
    },
    {
        "word": "System Call",
        "type": [],
        "definition": [
            "A system call is a request made by a program to the operating system.  It allows an application to access functions and commands from the operating system's API.\nSystem calls perform system-level operations, such as communicating with hardware devices and reading and writing files.  By making system calls, developers can use pre-written functions supported by the operating system (OS) instead of writing them from scratch.  This simplifies development, improves app stability, and makes apps more \"portable\" between different versions of an OS.\nHow System Calls Work\nApplications run within an area of memory called user space.  A system call accesses the operating system kernel, which runs in kernel space.  When an application makes a system call, it must first request permission from the kernel.  This may be done with an interrupt request, which pauses the current process and transfers control to the kernel.\nIf the request is allowed, the kernel processes the request, such as creating or deleting a file.  When the operation is complete, the kernel passes the output back to the application, which transfers data from the kernel space to the user space in memory.  The application receives the output from the kernel as input.  In the source code of a program, this may be a parameter value or a return value within a function.  Once the input is received, the application resumes the process.\nA basic system call, such as getting the system date and time, may take a few nanoseconds.  A more advanced system call, such as establishing communication with a network device may require a few seconds.  In order to prevent bottlenecks, most operating systems initiate a separate kernel thread for each system call.  Modern operating systems are multithreaded, meaning they can process multiple system calls at one time."
        ]
    },
    {
        "word": "System Hardening",
        "type": [],
        "definition": [
            "Most computers offer network security features to limit outside access to the system.  Software such as antivirus programs and spyware blockers prevent malicious software from running on the machine.  Yet, even with these security measures in place, computers are often still vulnerable to outside access.  System hardening, also called Operating System hardening, helps minimize these security vulnerabilities.\nThe purpose of system hardening is to eliminate as many security risks as possible.  This is typically done by removing all non-essential software programs and utilities from the computer.  While these programs may offer useful features to the user, if they provide \"back-door\" access to the system, they must be removed during system hardening.\nAdvanced system hardening may involve reformatting the hard disk and only installing the bare necessities that the computer needs to function.  The CD drive is listed as the first boot device, which enables the computer to start from a CD or DVD if needed.  File and print sharing are turned off if not absolutely necessary and TCP\/IP is often the only protocol installed.  The guest account is disabled, the administrator account is renamed, and secure passwords are created for all user logins.  Auditing is enabled to monitor unauthorized access attempts.\nWhile these steps are often part of operating system hardening, system administrators may choose to perform other tasks that boost system security.  While both Macintosh and Windows operating systems can be hardened, system hardening is more often done on Windows machines, since they are more likely to have their security compromised."
        ]
    },
    {
        "word": "System Preferences",
        "type": [],
        "definition": [
            "System Preferences is an application bundled with OS X that allows you to change settings on your Mac.  It is similar to the Control Panel in Windows and supersedes the Control Panel that was part of Mac OS Classic.\nThe System Preferences window displays several different options called preferences panes (instead of control panels).  It lists the default preference panes included with OS X, as well as any third party preference panes that have been installed.  While the default options have changed since the first version of OS X was released in 2001, many of them are the same.  In OS X 10.10 (Yosemite), the System Preferences application includes the 30 preference panes listed below.\n\n\n\n\nGeneral\nDesktop & Screen Saver\nDock\nMission Control\nLanguage & Region\nSecurity & Privacy\nSpotlight\nNotifications\nDisplays\nEnergy Saver\n\n\n\n\nKeyboard\nMouse\nTrackpad\nGeneral\nPrinters & Scanners\nSound\niCloud\nInternet Accounts\nExtensions\nNetwork\n\n\n\n\nBluetooth\nSharing\nUsers & Groups\nParental Controls\nApp Store\nDictation & Speech\nDate & Time\nStartup Disk\nTime Machine\nAccessibility\n\n\n\n\nWhen you click an preference pane icon in System Preferences, it displays controls that allow you to modify certain settings.  For example, you can use the Desktop & Screen Saver preference pane to change your desktop background.  Energy Saver allows you to modify how long it takes for your computer to go to sleep when idle.  The Network preference pane allows you to change the priority of your Mac's network services and lets you manually configure your network connection.  \nYou can access System Preferences by clicking the Apple icon on the left side of the menu bar and selecting \"System Preferences…\"  A shortcut to the program is also included in the Dock by default, but it can be removed.  OS X also supports several keyboard shortcuts that open individual system preferences.  For example, if you have an Apple keyboard, pressing Option + a brightness function key will open the Displays preference while pressing Option + a volume function key will open the Sound preference."
        ]
    },
    {
        "word": "System Requirements",
        "type": [],
        "definition": [
            "System requirements are the required specifications a device must have in order to use certain hardware or software.  For example, a computer may require a specific I\/O port to work with a peripheral device.  A smartphone may need a specific operating system to run a particular app.\nBefore purchasing a software program or hardware device, you can check the system requirements to make sure the product is compatible with your system.  Typical system requirements for a software program include:\n\nOperating system\nMinimum CPU or processor speed\nMinimum GPU or video memory\nMinimum system memory (RAM)\nMinimum free storage space\nAudio hardware (sound card, speakers, etc)\n\nSystem requirements listed for a hardware device may include:\n\nOperating system\nAvailable ports (USB, Ethernet, etc)\nWireless connectivity\nMinimum GPU (for displays and graphics hardware)\n\nMinimum vs Recommended Requirements\nSome products include both minimum and recommended system requirements.  A video game, for instance, may function with the minimum required CPU and GPU, but it will perform better with the recommended hardware.  A more powerful processor and graphics card may produce improved graphics and faster frame rates (FPS).\nSome system requirements are not flexible, such as the operating system(s) and disk space required for software installation.  Others, such as CPU, GPU, and RAM requirements may vary significantly between the minimum and recommended requirements.  When buying or upgrading a software program, it is often wise to make sure your system has close to the recommended requirements to ensure a good user experience.\nBelow is an example of minimum versus recommended system requirements for a Windows application.\n\nOS: Windows 7 with SP1; &nbsp;Recommended: Windows 10\nCPU: Intel or AMD processor with 64-bit support; &nbsp;Recommended: 2.8 GHz or faster processor\nGPU: nVidia GeForce GTX 1050 or equivalent; &nbsp;Recommended: nVidia GeForce GTX 1660 or Quadro T1000\nDisk Storage: 4 GB of free disk space\nMonitor Resolution: 1280x800; &nbsp;Recommended: 1920x1080\nInternet: Internet connection required for software activation\n"
        ]
    },
    {
        "word": "System Resources",
        "type": [],
        "definition": [
            "Your computer has many types of resources.  They include the CPU, video card, hard drive, and memory.  In most cases, the term \"system resources\" is used to refer to how much memory, or RAM, your computer has available.\nFor example, if you have 1.0 GB (1024 MB) of RAM installed on your machine, then you have a total of 1024 MB of system resources.  However, as soon as your computer boots up, it loads the operating system into the RAM.  This means some of your computer's resources are always being used by the operating system.  Other programs and utilities that are running on your machine also use your computer's memory.  If your operating system uses 300 MB of RAM and your active programs are using 200 MB, then you would have 524 MB of \"available system resources.\"  To increase your available system resources, you can close active programs or increase your total system resources by adding more RAM.\nSystem resources can also refer to what software is installed on your machine.  This includes the programs, utilities, fonts, updates, and other software that is installed on your hard drive.  For example, if a file installed with a certain program is accidentally removed, the program may fail to open.  The error message may read, \"The program could not be opened because the necessary resources were not found.\"\nAs you can see, the term \"system resources\" can be a bit ambiguous.  Just remember that while it usually refers to your computer's memory, it can be used to describe other hardware or software as well."
        ]
    },
    {
        "word": "System Software",
        "type": [],
        "definition": [
            "System software refers to the files and programs that make up your computer's operating system.  System files include libraries of functions, system services, drivers for printers and other hardware, system preferences, and other configuration files.  The programs that are part of the system software include assemblers, compilers, file management tools, system utilites, and debuggers.\nThe system software is installed on your computer when you install your operating system.  You can update the software by running programs such as \"Windows Update\" for Windows or \"Software Update\" for Mac OS X.  Unlike application programs, however, system software is not meant to be run by the end user.  For example, while you might use your Web browser every day, you probably don't have much use for an assembler program (unless, of course, you are a computer programmer).\nSince system software runs at the most basic level of your computer, it is called \"low-level\" software.  It generates the user interface and allows the operating system to interact with the hardware.  Fortunately, you don't have to worry about what the system software is doing since it just runs in the background.  It's nice to think you are working at a \"high-level\" anyway."
        ]
    },
    {
        "word": "System Unit",
        "type": [],
        "definition": [
            "The system unit, also known as a \"tower\" or \"chassis,\" contains the main components of a desktop computer.  It includes the motherboard, CPU, RAM, and other components.  The case that houses these components is also part of the system unit.\nPeripheral devices, such as the monitor, keyboard, and mouse are separate from the system unit.  Peripherals, combined with the system unit, create a \"workstation.\"\nSome modern computers, such as the iMac, combine the system unit and monitor into a single device.  In this case, the monitor is part of the system unit.  While laptops also have built-in displays, they are not considered system units, since the term only refers to desktop computers."
        ]
    },
    {
        "word": "Systray",
        "type": [],
        "definition": [
            "The systray, short for \"system tray,\" is located on the right side of the Windows toolbar.  It is the collection of small icons on the opposite side of the Start Menu.  The volume control and the date & time are default items in the systray and many more can be added.  Some common icons that get placed in the systray are virus-scan, mouse, and instant messenger icons.  They usually get put in the systray (whether you like it or not) when their respective programs are installed.\nThe nice thing about the systray is that it allows quick and easy access to programs and control settings.  Most systray icons will open a control panel or program when double-clicked.  However, if you install too many of them, the area can get so cluttered, you may find it easier to just browse your hard drive and open the program."
        ]
    },
    {
        "word": "sRGB",
        "type": [],
        "definition": [
            "Stands for \"Standard RGB\" (RGB stands for \"Red Green Blue\").  sRGB is a color space that  defines a range of colors that can be displayed on screen on in print.  It is the most widely used color space and is supported by most operating systems, software programs, monitors, and printers.\nEvery color on a computer screen is comprised of individual red, green, and blue values.  The sRGB specification make sure colors are represented the same way across different software programs and devices.  For example, if you select the sRGB color space in your image editor and for your printer (which is typically the default setting), the colors produced by the printer will closely match those on the screen.  If your color spaces do not match, the printed colors may appear noticeably different than the ones you see in your software program.\nIf you select the \"Adobe RGB\" color space in Photoshop, then print to an printer that is set to sRGB, the printed colors may appear dull compared to those on the screen.  This is because the Adobe RGB color space has a wider range of colors than sRGB.  Similarly, an image saved with an Adobe RGB color profile may appear to have less color when viewed on the web, since web browsers use sRGB as the default color space.\nMonitors and printers have unique tonal qualities, so colors may not appear exactly same on different devices or from screen to print, even when the sRGB color profile is used.  Therefore, high-end devices, such as those used in desktop publishing, allow for manual calibration to adjust for slight differences in color.  Even without calibration, sRGB provides a level of consistency for displaying colors, which is especially important across different platforms.\nHistory\nThe sRGB color space was created by Microsoft and Hewlett-Packard in 1996.  It was designed to provide a universal color space for devices and software programs without the need for embedded ICC (International Color Consortium) profiles.  The IEC (International Electrotechnical Commission) standardized the sRGB specification in 1999 as \"IEC 61966-2-1:1999.\"  Several decades later, sRGB is still the standard color space for 8-bit color.  However, modern displays, which can produce 10-bit or 12-bit color, may also support HDR, which provides a much wider range of colors than sRGB."
        ]
    }
]