[
    {
        "word": "T1",
        "type": [],
        "definition": [
            "This is a data transfer system that transfers digital signals at 1.544 megabits per second (quite a bit faster than a 56K modem, which maxes out at around 0.056 Mbps).  Most small to mid-sized colleges and business have T1 lines for their Internet connections.  Because of the T1's large bandwidth, hundreds of people can be accessing the Internet from one T1 line.  However, like all good things, too many people on one T1 line can cause dramatic decreases in data transfer speeds.  For this reason, multiple T1s are often used."
        ]
    },
    {
        "word": "T3",
        "type": [],
        "definition": [
            "What about T2, you ask?  For some reason, there just is no such thing.  (There was probably some legal dispute about it involving the name of a popular Arnold Schwarzenegger movie).  If a T1 connection just isn't going to cut it for you, a T3 should do the trick.  However, if you thought a T3 was 3 times faster than a T1 connection, you're slightly off.  A T3 line actually 30 times faster, supporting data transfer rates of 44.736 megabits per second.  What I wouldn't do to have one of those in my basement..."
        ]
    },
    {
        "word": "TCP",
        "type": [],
        "definition": [
            "Stands for \"Transmission Control Protocol.\"  TCP is a fundamental protocol within the Internet protocol suite — a collection of standards that allow systems to communicate over the Internet.  It is categorized as a \"transport layer\" protocol since it creates and maintains connections between hosts.\nTCP compliments the Internet protocol (IP), which defines IP addresses used to identify systems on the Internet.  The Internet protocol provides instructions for transferring data while the transmission control protocol creates the connection and manages the delivery of packets from one system to another.  The two protocols are commonly grouped together and referred to as TCP\/IP.\nWhen data is sent over a TCP connection, the protocol divides it into individually numbered packets or \"segments.\"  Each packet includes a header that defines the source and destination and a data section.  Since packets can travel over the Internet using multiple routes, they may arrive at the destination in a different order than they were sent.   The transmission control protocol reorders the packets in the correct sequence on the receiving end.\nTCP also includes error checking, which ensures each packet is delivered as requested.  This is different than UDP, which does not check if each packet was successfully transmitted.  While the built-in error checking means TCP has more overhead and is therefore slower than UDP, it ensures accurate delivery of data between systems.  Therefore TCP is used for transferring most types of data such as webpages and files over the Internet.  UDP is ideal for media streaming which does not require all packets to be delivered."
        ]
    },
    {
        "word": "TCP\/IP",
        "type": [],
        "definition": [
            "Stands for \"Transmission Control Protocol\/Internet Protocol.\"  These two protocols were developed in the early days of the Internet by the U.S. military.  The purpose was to allow computers to communicate over long distance networks.  The TCP part has to do with the verifying delivery of the packets.  The IP part refers to the moving of data packets between nodes.  TCP\/IP has since then become the foundation of the Internet.  Therefore, TCP\/IP software is built into all major operating systems, such as Unix, Windows, and the Mac OS."
        ]
    },
    {
        "word": "TFT",
        "type": [],
        "definition": [
            "Stands for \"Thin Film Transistor.\"  These transistors are used in high-quality flat panel liquid-crystal displays (LCDs).  TFT-based displays have a transistor for each pixel on the screen.  This allows the electrical current that illuminates the display to be turned on and off at a faster rate, which makes the display brighter and shows motion smoother.  LCDs that use TFT technology are called \"active-matrix\" displays, which are higher-quality than older \"passive-matrix\" displays.  So if you ever see a TFTAMLCD monitor at your local computer store, it is a \"thin-film transistor active-matrix liquid crystal display.\"  Basically, it is a high-quality flat screen monitor."
        ]
    },
    {
        "word": "TFTP",
        "type": [],
        "definition": [
            "Stands for \"Trivial File Transfer Protocol.\"  TFTP is a file transfer protocol similar to FTP, but is much more limited.  Unlike FTP, TFTP does not support authentication and cannot change directories or list directory contents.  Therefore, it is most often used to transfer individual files over a local network.  TFTP may also be used to boot a computer system from a network-connected storage device.\nWhile FTP connections use the TCP protocol, TFTP connections are made over UDP, which requires less overhead than TCP.  This means TFTP file transfers may be faster, but less reliable than FTP transfers.  Port 20 is used for FTP transfers, while port 69 is used for transferring files via TFTP.\nTFTP is most often used on Unix systems, but it is supported by Windows and Mac OS X as well.  You can initiate a TFTP file transfer via a command-line interface using the following syntax:\ntftp [-i] [Host] [{get | put}] [Source] [Destination]\nThe \"-i\" parameter is used to transfer files in binary mode and should be omitted when transferring an ASCII text file.  The get command is used to retrieve a file, while the  put command is used to send a file to another system."
        ]
    },
    {
        "word": "TIFF",
        "type": [],
        "definition": [
            "Stands for \"Tagged Image File Format.\"  It is a graphics file format created in the 1980s to be the standard image format across multiple computer platforms.  The TIFF format can handle color depths ranging from 1-bit to 24-bit.  Since the original TIFF standard was introduced, people have been making many small improvements to the format, so there are now around 50 variations of the TIFF format.  So much for a universal format.  Recently, JPEG has become the most popular universal format, because of its small file size and Internet compatibility.\nFile extensions: .TIF, .TIFF"
        ]
    },
    {
        "word": "TLS",
        "type": [],
        "definition": [
            "Stands for \"Transport Layer Security.\"  TLS is a data encryption technology that provides secure data transfers.  It encrypts (or scrambles) all data sent from one system to another.  Any third party that attempts to \"eavesdrop\" on the transfer will be unable to recognize the data.\nTLS can encrypt data transfers over any network, from a small local area network to the Internet.  Secure websites, for example, use TLS to deliver website content over HTTPS.  Email protocols, such as IMAP and SMTP, also support TLS.\nSecure protocols typically require a different port number than their non-secure counterparts.  Below are the standard non-secure and secure (TLS) ports for web and email connections:\n\nHTTP: port 80\nHTTPS: port 443\nIMAP (standard): port 143\nIMAP (secure): port 993\nSMTP (standard): port 25\nSMTP (secure): port 587\n\nTLS vs SSL\nTLS is the successor to SSL, or Secure Sockets Layer.  It was introduced in 1999 as a more secure means of encrypting data transfers.  TLS 1.0 and 1.1 (introduced in 2006) were backward-compatible with SSL.  While this simplified the transition process, it also compromised security, since it allowed systems to use the less-secure SSL option.\nIn 2008, TLS 1.2 eliminated backward-compatibility with SSL.  It also replaced the MD5-SHA-1 encryption algorithm with stronger SHA-256 encryption.  TLS 1.3, introduced in 2018, added several additional security improvements.\nCommon web browsers, such as Chrome, Safari, Edge, and Firefox, deprecated TLS 1.1 and earlier in 2018.  Today, most web servers and mail servers require TLS 1.2 or 1.3.\nNOTE: As of 2020, \"SSL\" is still an acceptable way to refer to secure connections, even if they use TLS.  For example, many network and server admins say \"SSL\" when talking about secure connections that use TLS.  Additionally, secure certificates are still called \"SSL certificates,\" even though most operate over TLS."
        ]
    },
    {
        "word": "TPM",
        "type": [],
        "definition": [
            "Stands for \"Trusted Platform Module.\"  TPM is a technology that enables hardware-based security functions.  It requires a \"crypto-processor,\" separate from the primary CPU, used exclusively for security purposes.\nSome functions of a TPM chip include:\n\nProviding secure authentication\nGenerating and storing cryptographic keys\nEncrypting and decrypting data\nVerifying and recording software loading operations\n\nThe TPM is a small chip, typically soldered onto a computer's motherboard.  It has a unique ID, also called an Endorsement Key (EK), that cannot be changed.  Because the key is unalterable and tied to the motherboard, it provides a reliable means of device authentication.  However, replacing a motherboard on a TPM-enabled system may require reformatting the startup disk.\nTPM 2.0\nWindows 11 requires TPM 2.0 and a Secure Boot capable PC.  These technologies work together to prevent unverified software from loading during the boot process.  TPM 2.0 provides several security improvements over the previous standard, including:\n\nsupport for the SHA-256 hashing algorithm\nsupport for newer hashing algorithms (TPM 1.2 only supports RSA and the SHA-1)\nmore consistent \"lockout policy,\" defined at an OS-level\na single semiconductor package (TPM 1.2 hardware may use discrete components)\n\nMost Windows PCs developed after 2015 have TPM 2.0 chips, which require UEFI firmware.  If TPM 2.0 is not enabled by default, it may be possible to enable it in the UEFI interface."
        ]
    },
    {
        "word": "TRIM",
        "type": [],
        "definition": [
            "TRIM is a feature supported by modern solid state drives (SSDs) that helps improve drive performance.  The word \"TRIM\" is typically capitalized, though it is not an acronym.  Instead, TRIM is a command that the operating system uses to allocate free space on an SSD.\nWhen you delete a file on an SSD, the data is often not deleted immediately, but instead is marked for deletion.  This prevents certain areas of the flash memory from being written and erased too frequently, which can degrade the SSD's performance over time.  However, it also causes many \"pages\" of free space to be inaccessible, since they are pending deletion.  Once enough pages are marked for deletion, the TRIM command performs a \"garbage collection\" operation.  This action deletes large \"blocks\" of data all at once, allocating free space on the drive.\nIn order for TRIM to work, it must be supported by a device's hardware and software.  This includes the 1) SSD, 2) drive controller, and 3) operating system.  Nearly all SSDs made in 2012 or later include TRIM support and therefore most SSD controllers manufactured in 2012 or later support TRIM as well.  Windows 7 and later and Mac OS X 10.6.8 and later support TRIM at the file system level.  However, in some cases it may be necessary to manually configure TRIM, such as when you install a third party SSD.\nNOTE: In Windows 7, you can check if TRIM is enabled by opening the command prompt and typing the following command:\nfsutil behavior query DisableDeleteNotify\nIf the result is \"0,\" TRIM is configured correctly.  If the result is \"1,\" TRIM is not active.  To enable TRIM in Windows 7, you can type the following command:\nfsutil behavior set DisableDeleteNotify 0"
        ]
    },
    {
        "word": "TTL",
        "type": [],
        "definition": [
            "Stands for \"Time To Live.\"  Pretty intense for a computer term, huh?  It refers an aspect of the Internet Protocol.  TTL is used when a \"ping,\" or a request for a response, is sent to another computer, such as a server.  The TTL represents the number of hops, or servers in different locations, the request can travel to before returning a failed attempt message."
        ]
    },
    {
        "word": "TWAIN",
        "type": [],
        "definition": [
            "Other than being the last name of the author of \"Huckleberry Finn,\" there are numerous other ideas concerning the origin of this term.  Some believe it stands for \"Toolkit Without An Informative Name,\" while others argue it is \"Technology Without An Interesting Name.\"  Still, there are some who believe that it came from the saying, \"Ne'er the twain shall meet.\"\nThough the real story behind the name may never be known, the purpose of TWAIN is quite clear.  It is a graphics and imaging standard that allows companies to make drivers for scanners and digital cameras.  Nearly all scanners on the market today are TWAIN-compliant, meaning the way they interact with your computer is based on the TWAIN standard."
        ]
    },
    {
        "word": "Tab",
        "type": [],
        "definition": [
            "In computing, \"tab\" has two different meanings.  It may refer to 1) a key on the keyboard or 2) a document header inside a window.\n1. Tab Key\nThe tab key is located on the left side of the keyboard next to Q and enters the tab character (ASCII code: 9) when pressed.  If you are typing in a word processor, pressing Tab will move the cursor to the next \"tab stop.\"  Tab stops are fixed horizontal distances that are typically four to eight spaces long.  Pressing Tab at the beginning of a line can be used to indent text, such as the beginning of a paragraph in a text document or a line of source code in a program.  Pressing Tab between blocks of text can be used to horizontally align words in multiple lines.\nThe tab key is also used to highlight or \"focus\" different fields within a form.  When filling out a form in a software program or website, you can press Tab to jump to the next field.  For example, you might enter your first name in the \"First Name\" field, then press Tab to highlight the \"Last Name\" field.  This is called \"tabbing\" through the fields and allows you to quickly fill out forms without using a mouse.  If you need to go backwards, pressing Shift+Tab will typically highlight the previous field.\n2. Window Tab\nA window tab is a user interface element that allows you to navigate between multiple documents in a single window.  Instead of a single title bar, a tabbed window may include multiple tabs along the top.  Clicking one of the tabs will display the contents of the corresponding document.  \nTabs have become a common feature in web browsers since they make it possible to have several webpages open without cluttering your screen.  The tabbed document interface (TDI) has also become standard in other programs such as Adobe Photoshop and the OS X Finder.  While tabbed windows create a cleaner appearance, the drawback is that you can only view the contents of one tab at a time.  Therefore, some programs allow you to click and drag a tab to create a new window from the tab."
        ]
    },
    {
        "word": "Table",
        "type": [],
        "definition": [
            "A table is a data structure that organizes information into rows and columns.  It can be used to both store and display data in a structured format.  For example, databases store data in tables so that information can be quickly accessed from specific rows.  Websites often use tables to display multiple rows of data on page.  Spreadsheets combine both purposes of a table by storing and displaying data in a structured format.\nDatabases often contain multiple tables, with each one designed for a specific purpose.  For example, a company database may contain separate tables for employees, clients, and suppliers.  Each table may include its own set of fields, based on what data the table needs to store.  In database tables, each field is considered a column, while each entry (or record), is considered a row.  A specific value can be accessed from the table by requesting data from an individual column and row.\nWebsites often use tables to display data in a structured format.  In fact, HTML has a &lt;table&gt; tag, as well as &lt;tr&gt; (table row) and &lt;td&gt; (table data) tags for specifying rows and columns.  Since many tables use the top row for header information, HTML also supports a &lt;th&gt; tag used to define the cells in the header row.  By including tables in a webpage, large amounts of data can be displayed in a easy-to-read format.  In the early days of HTML, tables were even used to construct the overall layout of webpages.  However, cascading style sheets (CSS) are now the preferred means of designing webpage layouts.\nSpreadsheets both store data and and display data in a table format.  Programs like Microsoft Excel and Apple Numbers provide a grid, or matrix of cells in which users can enter data.  Each cell is defined by a specific row\/column pair, such A3, which refers to the cell in the first column and third row of the table.  By formatting data in tables, spreadsheet applications provide a simple way to both enter data and share data with others."
        ]
    },
    {
        "word": "Tablet",
        "type": [],
        "definition": [
            "A tablet, or tablet PC, is a portable computer that uses a touchscreen as its primary input device.  Most tablets are slightly smaller and weigh less than the average laptop.  While some tablets include fold out keyboards, others, such as the Apple iPad and Motorola Xoom, only offer touchscreen input.\nEarly tablet touchscreens were designed to work with light pens, but most modern tablets support human touch input.  Many tablets now support multitouch input, which allows you to perform gestures with multiple fingers, such as pinching an image to zoom out, or spreading your fingers apart to zoom in.  Tablets without physical keyboards allow you to enter text using a pop-up keyboard that appears on the screen.\nSince tablets do not use a traditional keyboard and mouse as their primary forms of input, the user interface of a tablet is different than a typical laptop.  For example, instead of double-clicking to open a program, most applications open with a single tap.  Instead of clicking on a scroll bar to scroll through a window, most tablet applications allow you to swipe up and down anywhere within a window to scroll through the content.\nSince tablet PCs provide a different interface than traditional computers, they offer unique possibilities for graphics applications, games, and other programs.  Because of their small form factor, they are extremely portable and can be easily stowed in a backpack or a briefcase.  Still, because tablets lack a keyboard and mouse, some tasks such as typing documents and writing email messages, are more difficult on tablets than traditional computers.  Therefore, tablets are generally seen as accessories to laptops and desktop computers rather than replacements."
        ]
    },
    {
        "word": "Tag",
        "type": [],
        "definition": [
            "On clothes, tags usually indicate the brand, size of the garment, fabrics used, and the washing instructions.  In Web pages, tags indicate what should be displayed on the screen when the page loads.  Tags are the basic formatting tool used in HTML (hypertext markup language) and other markup languages, such as XML.  For example, to create a table on a Web page, the &lt;table&gt; tag is used.  The data that should be inside the table follows the &lt;table&gt; tag, and the table is closed with a &lt;\/table&gt; tag.\nIf you want something to show up in bold on a Web page, you would use the bold tag.  For example, the HTML:\nThis site is the &lt;b&gt;best website&lt;\/b&gt; ever!\nwould show up as:\nThis site is the best website ever!\nSince there is often a need to format content within more general tags, the tags can be &quot;nested,&quot; meaning one tag can enclose one or more other tags.  For example:\n&lt;span style=&quot;font-family: Times&quot;&gt;This is the Times font, and &lt;i&gt;this is in italics&lt;\/i&gt;.  Pretty exciting, huh?&lt;\/font&gt;\nwould should up as: This is the Times font, and this is in italics. Pretty exciting, huh?\nTags are a fundamental part of HTML and they are pretty simple to understand.  If you want to build a Web site of your own, you can either create it from scratch (using a text editor and typing your own tags) or you can use a layout program like Macromedia Dreamweaver, which will generate the tags for you.  Best of all, tags used in markup languages don't itch or chafe your neck."
        ]
    },
    {
        "word": "Tape Drive",
        "type": [],
        "definition": [
            "This is a removable storage device mainly used for backing up data.  It is similar to a Zip Drive, but instead of Zip disks, it uses small tapes.  The drive acts like a tape recorder, reading data from the computer and writing it onto the tape.  Since tape drives have to scan through lots of tape to read small amounts of scattered data, they are not practical for most storage purposes.  That is why they are used almost exclusively for data backup.  The benefit of tape drives is that they typically have large capacities for storing data, for a lower cost than hard drives similar in size.  Also, multiple tapes can be used to make incremental backups (daily, weekly, monthly, etc.), which is much cheaper than using multiple hard drives."
        ]
    },
    {
        "word": "Target Disk Mode",
        "type": [],
        "definition": [
            "Target disk mode is a way of booting a Macintosh computer so that it acts as an external hard drive on another computer.  When a Mac is booted in target disk mode, the typical boot sequence is bypassed and the operating system is not loaded.  Instead, the computer's internal and external hard drives are simply mounted on a connected computer.  Target disk mode can be used to manually transfer files between two machines or to copy data from one computer to another using Apple's Migration Assistant.\nIn order for target disk mode (TDM) to work, two Macintosh computers must be attached to each other via a Firewire cable.  One computer should be on and the computer designated for TDM should be off.  To boot into target disk mode, hold the \"T\" key on the keyboard immediately after turning on or restarting the computer.  After a few seconds, the screen should display the Firewire icon, which will move around the screen as long as the machine is in target disk mode.  You should then see the hard drive(s) of the computer in TDM appear on the Desktop of the connected computer.\nBooting a computer in target disk mode makes it easy to transfer files between two machines.  Since the hard drives of the computer in TDM automatically mount on the other Mac's desktop, you can simply drag and drop files between them.  Also, the computer in target disk mode is not seen as a boot disk, so you don't have to worry about file permissions.  You can also run more comprehensive disk diagnostics and repairs.  Just be sure not to remove or copy over any important system files on the TDM hard drive(s), since there are no safeguards to protect you from doing so.\nSince the hard drives of the TDM machine are mounted on the connected computer, you should make sure to unmount or \"eject\" the hard drives before you turn off the computer.  This can be done by selecting the hard drive on the desktop and choosing \"Eject\" from the File menu.  Once the hard drives are ejected, you can safely turn off the TDM computer.  When you turn on the computer again, it should boot normally (as long as you don't hold down the \"T\" key).  Any files you copied to the computer's hard drives should appear in the directories you copied them to."
        ]
    },
    {
        "word": "Task Bar",
        "type": [],
        "definition": [
            "The task bar was introduced with Windows 95 and has been part of every version of Windows since then.  It is the bar that spans the bottom of the screen and contains the Start button on the left side and the systray on the right.  The task bar also includes the current time on the far right side and can hold shortcuts to programs directly to the right of the Start button.\nMost of the task bar, however, contains shortcuts to open windows.  Whenever you open a program or window, it shows up in the task bar.  So if you have Internet Explorer and Microsoft Word open, there will be at least two items in the middle area of the task bar.  Since each window gets its own location in the task bar, if there are two Microsoft Word documents open and three Internet Explorer windows open, there will be a total of five items in the task bar.  When you click on a window title in the task bar, that window will become active and show up in front of other open windows.  You can also cycle through the task bar items by holding the Alt key and pressing Tab a few times."
        ]
    },
    {
        "word": "Tebibyte",
        "type": [],
        "definition": [
            "A tebibyte is a unit of data storage that equals 2 to the 40th power, or 1,099,511,627,776 bytes.\nWhile a terabyte can be estimated as 10^12 or 1,000,000,000,000 bytes, a tebibyte is exactly 1,099,511,627,776 bytes.  This is to avoid the ambiguity associated with the size of terabytes.  A tebibyte is 1,024 gibibytes and precedes the pebibyte unit of measurement.\nFor a list of other units of measurements, view this Help Center article.\nAbbreviation: TiB"
        ]
    },
    {
        "word": "Technical Debt",
        "type": [],
        "definition": [
            "Technical debt is a burden software developers face from old source code and architectural decisions.  It can range from poorly-written functions to frameworks that are no longer supported.  In some cases, technical debt can be handled by rewriting code, while in others, developers may need to rewrite entire programs.\nAvoiding Technical Debt\nThe best way to manage technical debt is to avoid accumulating it in the first place.  This begins with architecting a program with a long-term plan.  A wise software engineer will design an application for the future, not just the current state of software and hardware.  Choosing \"future-proof\" programming languages and reliable frameworks are two important decisions in the architectural process.\nIt is also necessary to follow good coding practices to avoid technical debt.  For example, if the same logic is repeated multiple times within a program, it should be consolidated into a single class or function.  Otherwise, it will be more difficult to locate and update each instance in the future, especially if new developers are working on the project.  Commenting code is also essential for reviewing and updating code in the future.\nManaging Technical Debt\nThe two main ways to manage technical debt are to rewrite sections of code or start from scratch.  The best route depends on the size of the project and the amount of technical debt.\n1. Rewriting code\nRewriting or \"refactoring\" code is the most common way to handle technical debt.  For example, a senior developer may review code written by a junior developer and find ways to optimize performance.  It may also be necessary to update deprecated functions so that the code can run on a newer platform.  In some cases, large portions of code may need to be rewritten to work with a new API.  These types of updates are common in the programming world and are one of the reasons why developers release new versions.\n2. Starting from scratch\nIf the amount of technical debt is large enough, it may require more time to update the code than to write new a new program from scratch.  In some cases, it may be necessary to re-code an application in a new programming language that is compatible with modern software compilers.  Rebuilding an app from scratch is a significant investment, but it may provide additional benefits.  For example, a new application can take advantage of the latest hardware technologies and modern user interface elements."
        ]
    },
    {
        "word": "Technology Services",
        "type": [],
        "definition": [
            "Technology services are, not surprisingly, services that involve technology.  These include information technology, or IT, services, such as technical support, computer networking, systems administration, and other services.  Common Internet services, such as Web hosting, e-mail, and social networking websites also fall under the scope of technology services.  Therefore, the terms \"technology services\" and \"information technology services\" (ITS) are often used interchangeably.\nHowever, technology services may also include services not directly related to information technology, such as telephone and cable TV services.  Other industries, such as a digital photography, graphic design, and video production may be considered technology services, since they involve modern technology.  \"Technology Services\" (capitalized) may also refer to a division within a school or business that deals with technology maintenance and administration.\nBecause technology services covers such a broad range of industries and occupations, its scope cannot be easily quantified.  However, most of us use some form of technology services on a daily basis, which is why it is an important term to know."
        ]
    },
    {
        "word": "Telecommunications",
        "type": [],
        "definition": [
            "Telecommunications, or telecom, is the transmission of signals over long distances.  It began with the invention of the telegraph in 1837, followed by the telephone in 1876.  Radio broadcasts began the late 1800s and the first television broadcasts started in the early 1900s.  Today, popular forms of telecommunications include the Internet and cellular phone networks.\nEarly telecommunications transmissions used analog signals, which were transferred over copper wires.  Today, telephone and cable companies still use these same lines, though most transmissions are now digital.  For this reason, most new telecommunications wiring is done with cables that are optimized for digital communication, such as fiber optic cables and digital phone lines.\nSince both analog and digital communications are based on electrical signals, transmitted data is received almost instantaneously, regardless of the distance.  This allows people to quickly communicate with others across the street or across the globe.  So whether you're watching TV, sending an email to a coworker, or talking on the phone with a friend, you can thank telecommunications for making it possible."
        ]
    },
    {
        "word": "Teleconference",
        "type": [],
        "definition": [
            "A teleconference is a meeting of people in different locations using telecommunications.  A basic teleconference may only include audio, while other types of teleconferences may include video and data sharing.  Some common examples include telephone conferences, videoconferences, and web meetings.\nThe most simple and widely used type of teleconference is a phone conference, since the only equipment required is a speakerphone.  If a project needs to be discussed between more than two people in different locations, they can all dial a conference phone number that will allow everybody to talk to each other at the same time.  A board meeting may also double as a teleconference if board members attend remotely.  Many board rooms include a conferencing system that allows people to \"teleconference in\" to the meeting by calling the conference phone number.  This allows remote board members to actively participate in a board meeting even if they are not physically present.\nTeleconferences may also include live video.  These types of teleconferences, often called videoconferences, allow people to see each other in real-time during a remote meeting.  A videoconference may be one-way, where one remote user or group is displayed on a video feed, or two-way, where both sides can see each other.  In the early days of videoconferencing, expensive equipment was required in order to set up a videoconference.  Today, you can simply use a computer's built-in video camera and free software such as Skype to videoconference with other users.\nThanks to the Internet, teleconferences may also include data sharing.  These types of conferences often use web browsers as the user interface and are therefore called web meetings.  For example, you can use a web-based service like Join.me to share your screen with other users.  You can even let another person control your screen, which is great for remote troubleshooting.  Businesses may use a web-based service like WebEx to host an online presentation for hundreds or even thousands of attendees.  When hosting a web presentation, the presenter controls the screen and is typically the only one who can be heard during the meeting.  Attendees are often provided with a chat window in which they can ask questions and interact with the presenter."
        ]
    },
    {
        "word": "Telehealth",
        "type": [],
        "definition": [
            "Telehealth is an umbrella term that encompasses health services provided using telecommunications technologies.  It includes everything from the electronic delivery of patient health information and prescriptions to remote interactions between patients and doctors in different locations.\nTelehealth has existed for decades, dating back to the invention of the telephone in the late 1800s.  It first enabled doctors and nurses to communicate over long distances and provide medical information to their patients over the phone.  The telephone provided a significant boost in medical care because patients were no longer limited by the expertise of doctors in their local area.\nAs technology has progressed, so has telehealth.  For example, the fax machine made it possible to transfer medical information between hospitals in minutes instead of days.  Pagers helped notify doctors and surgeons in emergency situations.  Modern technologies like smartphones and the Internet make it possible for medical professionals and patients to access health information anytime, anywhere.  Online services like MyChart and AthenaNet provide patients with direct access to their own health records, including test results, scans, and medications.\nRemote Healthcare\nWhile telehealth encompasses many types of medical services, it is often used to describe remote healthcare.  For example, a telehealth doctor may \"visit\" patients remotely using videoconferencing technology.  Patients can book remote appointments and a doctor can evaluate their condition over the video feed.  A more advanced type of telehealth, called telesurgery, allows doctors to perform remote surgery using a specialized robotic system."
        ]
    },
    {
        "word": "Telnet",
        "type": [],
        "definition": [
            "This is a program that allows you log in to a Unix computer via a text-based interface.  If you have an account on a Telnet server, you can access certain resources on the system such your home directory, your e-mail account, FTP files, etc.  The downside of Telnet is that, to use it, you need to use Unix commands, which can be a challenge."
        ]
    },
    {
        "word": "Template",
        "type": [],
        "definition": [
            "A template is a file that serves as a starting point for a new document.  When you open a template, it is pre-formatted in some way.  For example, you might use template in Microsoft Word that is formatted as a business letter.  The template would likely have a space for your name and address in the upper left corner, an area for the recipient's address a little below that on the left side, an area for the message body below that, and a spot for your signature at the bottom.\nWhen you save a file created with a template, you are usually prompted to save a copy of the file, so that you don't save over the template.  Templates can either come with a program or be created by the user.  Most major programs support templates, so if you find yourself creating similar documents over and over again, it might be a good idea to save one of them as a template.  Then you won't have to format your documents each time you want to make a new one.  Just open the template and start from there."
        ]
    },
    {
        "word": "Terabyte",
        "type": [],
        "definition": [
            "A terabyte is 1012 or 1,000,000,000,000 bytes.\nOne terabyte (abbreviated \"TB\") is equal to 1,000 gigabytes and precedes the petabyte unit of measurement.  While a terabyte is exactly 1 trillion bytes, in some cases terabytes and tebibytes are used synonymously, though a tebibyte actually contains 1,099,511,627,776 bytes (1,024 gibibytes).\nTerabytes are most often used to measure the storage capacity of large storage devices.  While hard drives were measured in gigabytes for many years, around 2007, consumer hard drives reached a capacity of one terabyte.  Now, all hard drives that have a capacity of 1,000 GB or more are measured in terabytes.  For example, a typical internal HDD may hold 2 TB of data.  Some servers and high-end workstations that contain multiple hard drives may have a total storage capacity of over 10 TB.\nTerabytes are also used to measure bandwidth, or data transferred in a specific amount of time.  For example, a Web host may limit a shared hosting client's bandwidth to 2 terabytes per month.  Dedicated servers often have higher bandwidth limits, such as 10 TB\/mo or more.\nNOTE: You can view a list of all the units of measurement used for measuring data storage."
        ]
    },
    {
        "word": "Teraflops",
        "type": [],
        "definition": [
            "Teraflops is a unit of measurement used for measuring the computing performance of a processor's floating point unit.  It is equal to 1,000 gigaflops, or 1,000,000,000,000 FLOPS.  Teraflops may also be written as \"teraFLOPS\" or \"TFLOPS.\"  The term \"teraflops\" is both singular and plural, since FLOPS is an acronym for \"Floating Point Operations Per Second.\"\nWhile FPU performance has historically been measured in gigaflops, some modern processors run over 1,000 FLOPS, which is why new measurements are often displayed in teraflops.  A similar transition has taken place with clock speeds, which are no longer measured in megahertz, but in gigahertz.  Teraflops are often used to measure supercomputer performance and the rate of scientific calculations, which are based primarily on floating point operations."
        ]
    },
    {
        "word": "Terahertz",
        "type": [],
        "definition": [
            "Terahertz is a unit of measurement sometimes used to measure computer clock speeds.  One terahertz is equal to 1,000 gigahertz (GHz), or 1,000,000,000,000 hertz (Hz).  Since the majority of personal computers operate between two and four gigahertz, most computer clock speeds are not measured in terahertz.  Instead, terahertz is more often used to measure the total speed of computing clusters or supercomputers.\nLike gigahertz, terahertz only measures frequency, or cycles per second.  Since some processors require more cycles to process instructions than others, terahertz is not always an accurate measurement of overall computing power.  Additional factors, such as RAM speed, bus speed, and processor cache, also effect a computer's performance.  Therefore, other units of measurements, such as MIPS and FLOPS are typically used to measure the computing performance of supercomputers and other high-end computer systems.\nAbbreviation: THz."
        ]
    },
    {
        "word": "Terminal",
        "type": [],
        "definition": [
            "The word \"terminal\" comes from early computer systems that were used to send commands to other computers.  Terminals often consist of just a keyboard and monitor, with a connection to another computer.  The purpose of a terminal is not to process information (like a typical computer), but to send commands to another system.  For example, a network administrator may use a terminal to log in to a network and manage devices connected to the network.\nWith modern computers, the word \"terminal\" usually refers to a terminal program, or emulator, which provides a text-based interface for typing commands.  This type of program is often abbreviated \"TTY\" and may also be referred to as a command-line interface.  Terminal programs are available for all major computing platforms and are typically included with the operating system.  For example, Windows includes the program \"cmd.exe,\" which is a command-line interface that can be used to run DOS commands and to connect to other servers.  Mac OS X includes a program appropriately called \"Terminal,\" which can be used to run Unix commands within the Mac OS or to access other machines.  Unix typically includes a program called \"xterm,\" which can run BASH or other Unix shells.\nUnlike most modern computer programs, terminal emulators do not have very user-friendly interfaces.  In order to use a terminal program effectively, you need to know Unix (or DOS) commands.  Typing \"help\" or \"man\" may provide you with an overview of commands, though it can be difficult to use them if you don't know what parameters to include with each command.  This Unix Commands Reference may be helpful if you are using a Unix terminal for the first time."
        ]
    },
    {
        "word": "Text Alignment",
        "type": [],
        "definition": [
            "Most word processing programs give you the capability to change the text alignment of a block of text.  This setting determines how the text is displayed horizontally on the page.  The four primary types of text alignment include left aligned, right aligned, centered, and justified.\n\nLeft Aligned - This setting is often referred to as \"left justified,\" but is technically called \"flush left.\"  It is typically the default setting when you create a new document.  Left aligned text begins each line along the left margin of the document.  As you type, the first word that does not fit on a line is placed at the left margin on the next line.  This results in a straight margin on the left and a \"ragged edge\" margin on the right.\nRight Aligned - This setting is also called \"right justified,\" but is technically known as \"flush right.\"  It aligns the beginning of each line of text along the right margin of the document.  As you type, the text expands to the left of the cursor.  If you type more than one line, the next line will begin along the right margin.  The result is a straight margin on the right and a \"ragged edge\" margin on the left.  Right justification is commonly used to display the company name and address near the top of a business document.\nCentered - As the name implies, centered text is placed in the center of each line.  As you type, the text expands equally to the left and right, leaving the same margin on both sides.  When you start a new line, the cursor stays in the center, which is where the next line begins.  Centered text is often used for document titles and may be appropriate for headers and footers as well.\nJustified - Justified text combines left and right aligned text.  When a block of text is justified, each line fills the entire space from left to right, except for the paragraph indent and the last line of a paragraph.  This is accomplished by adjusting the space between words and characters in each line so that the text fills 100% of the space.  The result is a straight margin on each side of the page.  Justified text is commonly used in newspapers and magazines and has become increasingly popular on the Web as well.\n\nIn most word processors, the text alignment options are typically located in the program's primary toolbar.  They are often displayed as a row of four icons, which include the left, centered, right, and justified alignment options.  These options may also be available in the program's Format menu.  You can either select the appropriate setting before you begin typing, or select a block text and choose the text alignment to apply the new setting.  If you want to apply a new text alignment to an entire document, use the Edit &rarr; Select All command, then select the alignment you want to use."
        ]
    },
    {
        "word": "Text Box",
        "type": [],
        "definition": [
            "A text box is a rectangular area on the screen where you can enter text.  It is a common user interface element found in many types of software programs, such as web browsers, email clients, and word processors.  When you click in a text box, a flashing cursor is displayed, indicating you can begin typing.  If you are using a tablet, tapping inside a text box may automatically display the on-screen keyboard.\nThere are two different types of text boxes — text fields and text areas.  A text field is small box that allows you to enter a single line of text.  It is used for entering basic values, such as a name, number, or short phrase.  A text area is a larger box that allows you to enter multiple lines of text.  Generally, pressing Enter in a text area will enter a newline character, creating a line break.  When you press Enter while typing in a text field, either the cursor will jump to the next field or the value will be submitted.\nIn HTML, a text field is defined by an &lt;input&gt; tag with the type \"text.\"  A text area is defined by a &lt;textarea&gt; tag.  Text fields are the most common, as they are used for entering queries in search engines and website search boxes.  However, many Web forms, such as user registration and website contact pages often contain both types of text boxes.  Regardless of what text boxes an online form contains, you can jump from one to the next by pressing the Tab key."
        ]
    },
    {
        "word": "Text Editor",
        "type": [],
        "definition": [
            "A text editor is any word processing program that you can use to type and edit text.  Hey, they don't call it a text editor for nothing...  Word Pad and NotePad for Windows and SimpleText and TextEdit for the Mac are common text editors.  Larger programs such as Microsoft Word and Word Perfect are also text editors, but they have many more features.  You can actually write HTML code and create HTML pages with a simple text editor, as long as you know the correct HTML syntax."
        ]
    },
    {
        "word": "Thermistor",
        "type": [],
        "definition": [
            "A thermistor (short for \"thermal resistor\") is a type of resistor that is used to measure temperature.  While typical resistors are designed to maintain consistent resistance regardless of temperature, a thermistor's resistance varies significantly as the temperature changes.  Once a thermistor is calibrated, changes in electrical resistance can be accurately translated into changes in temperature.\nThermistors are commonly used in computers to monitor the ambient temperature of internal components.  For example, thermistors may be used to record the temperature near the CPU, RAM slots, and the power supply.  These thermistors are usually integrated into the computer's motherboard.  The actual temperature of components such as the processor and memory modules is typically measured by a diode that is integrated into the chip.\nComputers use the information recorded by thermistors to prevent overheating.  For example, if a processor is running near capacity for an extended period of time, the temperature may gradually increase.  When this happens, the computer might speed up the internal fans to increase airflow and cool the computer.  In extreme circumstances, such as when a laptop is used outside on a hot day, the fans may not be able to keep the computer at a safe temperature.  If the thermistors record a dangerously high temperature, the computer may shut down to avoid overheating and damaging the hardware."
        ]
    },
    {
        "word": "Thick Client",
        "type": [],
        "definition": [
            "Thick clients, also called heavy clients, are full-featured computers that are connected to a network.  Unlike thin clients, which lack hard drives and other features, thick clients are functional whether they are connected to a network or not.\nWhile a thick client is fully functional without a network connection, it is only a \"client\" when it is connected to a server.  The server may provide the thick client with programs and files that are not stored on the local machine's hard drive.  It is not uncommon for workplaces to provide thick clients to their employees.  This enables them to access files on a local server or use the computers offline.  When a thick client is disconnected from the network, it is often referred to as a workstation."
        ]
    },
    {
        "word": "Thin Client",
        "type": [],
        "definition": [
            "In the 1950s, minimalism emerged as an popular art movement.  In the 1990s, minimalism emerged again as a popular computer trend.  As computer networking became more commonplace, minimalist computers became more common as well.  In fact, these trimmed-down machines, often referred to as thin clients, are still popular today.\nThin clients function as regular PCs, but lack hard drives and typically do not have extra I\/O ports or other unnecessary features.  Since they do not have hard drives, thin clients do not have any software installed on them.  Instead, they run programs and access data from a server.  For this reason, thin clients must have a network connection and are sometimes referred to as \"network computers\" or \"NCs.\"\nThin clients can be a cost-effective solution for businesses or organizations that need several computers that all do the same thing.  For example, students in a classroom could all run the same program from a server, each using his own thin client machine.  Because the server provides the software to each computer on the network, it is not necessary for each NC to have a hard drive.  Thin clients also make it easier to manage computer networks since software issues need to be managed only on the server instead of on each machine."
        ]
    },
    {
        "word": "Third Party",
        "type": [],
        "definition": [
            "In the computer world, a third party may refer to either a hardware manufacturer or a software developer.  It is a label given to companies that produce hardware or software for another company's product.\nThird party hardware refers to components that are developed by companies besides the original computer manufacturer.  For example, a person may buy a Dell computer and then upgrade it using third party components, such as an Nvidia video card and a Seagate hard drive.  Since the components are not included with the computer and are purchased from companies other than Dell, they are considered third party hardware.  These components would typically not supported by Dell, but instead would be supported by the original equipment manufacturer, or OEM.\nThird party software refers to programs that are developed by companies other than the company that developed the computer's operating system.  Therefore, any Macintosh applications that are not developed by Apple are considered third party applications.  Likewise, any Windows programs developed by companies other than Microsoft are called third party programs.  Since most programs are developed by companies other than Apple and Microsoft, third party applications make up the majority of software programs.\nSome programs also support third party plug-ins, which add functionality to the software.  For example, Adobe Photoshop supports plug-ins that add features like extra filters and selection tools to the program.  These plug-ins may be created and distributed by other companies, but are designed to work with Adobe Photoshop.  Therefore, they are called third party plug-ins."
        ]
    },
    {
        "word": "Thread",
        "type": [],
        "definition": [
            "What do a t-shirt and a computer program have in common?  They are both composed of many threads!  While the threads in a t-shirt hold the shirt together, the threads of a computer program alllow the program to execute sequential actions or many actions at once.  Each thread in a program identifies a process that runs when the program asks it to (unlike when you ask your roommate to do the dishes).\nThreads are typically given a certain priority, meaning some threads take precedence over others.  Once the CPU is finished processing one thread, it can run the next thread waiting in line.  However, it's not like the thread has to wait in line at the checkout counter at Target the Saturday before Christmas.  Threads seldom have to wait more than a few milliseconds before they run.  Computer programs that implement \"multi-threading\" can execute multiple threads at once.  Most modern operating systems support multi-threading at the system level, meaning when one program tries to take up all your CPU resources, you can still switch to other programs and force the CPU-hogging program to share the processor a little bit.\nThe term \"thread\" can also refer to a series of related postings in an online discussion. Web-based bulletin boards are made up of many topics, or threads.  The replies posted in response to the original posting are all part of the same thread.  In e-mail, a thread can refer to a series of replies back and forth pertaining a certain message."
        ]
    },
    {
        "word": "Throughput",
        "type": [],
        "definition": [
            "Throughput refers to how much data can be transferred from one location to another in a given amount of time.  It is used to measure the performance of hard drives and RAM, as well as Internet and network connections.\nFor example, a hard drive that has a maximum transfer rate of 100 Mbps has twice the throughput of a drive that can only transfer data at 50 Mbps.  Similarly, a 54 Mbps wireless connection has roughly 5 times as much throughput as a 11 Mbps connection.  However, the actual data transfer speed may be limited by other factors such as the Internet connection speed and other network traffic.  Therefore, it is good to remember that the maximum throughput of a device or network may be significantly higher than the actual throughput achieved in everyday use."
        ]
    },
    {
        "word": "Thumbnail",
        "type": [],
        "definition": [
            "A thumbnail image is a small image that represents a larger one.  Thumbnails are often used to provide snapshots of several images in a single space.  They are commonly used by digital photo organization programs as well as visual search engines.\nThe term \"thumbnail\" was originally used to describe physical images or drawings that were miniature in size (roughly the size of a human thumbnail).  However, it is now widely used to describe digital images, which are displayed on a screen.  Digital thumbnails are usually between 75x75 and 200x200 pixels in size.  They can also have a rectangular aspect ratio, such as 150x100 pixels.\nSince digital thumbnails represent a larger version of the same image, they also usually serve as a link to the larger image.  For example, clicking a thumbnail on a Google Images search results page will open the page that includes the full size image.  Similarly, double-clicking a thumbnail image in a photo browser will usually display the full size version.\nThumbnail images may also be referred to as \"thumbs.\""
        ]
    },
    {
        "word": "Thunderbolt",
        "type": [],
        "definition": [
            "Thunderbolt is a high-speed I\/O interface that was developed by Intel and was introduced by Apple in 2011.  It is based on the PCI Express and DisplayPort technologies and supports both data devices and displays.\nSince Thunderbolt is based on the PCI Express architecture, external devices connected via Thunderbolt can achieve performance that was previously only possible from internal components.  Additionally, the Thunderbolt interface offers 10 Gpbs of throughput in both directions.  That is more than 12 times as fast as Firewire 800 and over 20 times faster than USB 2.0.  While a FireWire 800 interface can only support one stream of 720p video, a Thunderbolt interface can support 8 simultaneous 720p video streams.\nLike USB and FireWire, Thunderbolt can provide power to connected peripheral devices.  That means external devices that require 10 watts of power or less can be powered directly from the Thunderbolt port.  Additionally, simple adapters can be used to connect USB, FireWire, and Ethernet devices to a Thunderbolt port.\nWhile Thunderbolt is primarily used as a high-speed data interface, it can also be used to connect high-resolution displays.  The Thunderbolt interface is physically identical to the Mini-DisplayPort interface and therefore can be used to connect a DisplayPort monitor.  Like HDMI, DisplayPort supports both audio and video, eliminating the need for a separate audio cable.\nThunderbolt devices can be daisy-chained, meaning multiple devices can be connected in sequence to a single Thunderbolt port.  For example, you can connect a Thunderbolt display to a computer and a Thunderbolt external hard drive to the display.  You could also connect a second Thunderbolt monitor to the first display.  This means you can connect two external displays to a laptop, as long as the laptop supports the resolution required for two screens."
        ]
    },
    {
        "word": "Thyristor",
        "type": [],
        "definition": [
            "A thyristor is a four-layer semiconductor that is often used for handling large amounts of power.  While a thyristor can be turned on or off, it can also regulate power using something called phase angle control.  This allows the amount of power output to be controlled by adjusting the angle of the current input.  An example of this is a dimmer switch for a lamp.\nWhile thyristors have the advantage of using phase angle control and handling large amounts of power, they are not as suitable for low power applications.  This is because they can only be turned off by switching the direction of the current.  For this reason, a thyristor may take longer to turn on or off that other semiconductors.  Also, thyristors can only conduct in one direction, making them impractical for applications that require current to be conducted to and from each device."
        ]
    },
    {
        "word": "Tiger",
        "type": [],
        "definition": [
            "This ferocious cat is the code name for Mac OS X 10.4, released April 29, 2005.  Tiger follows a list of other felines in the Mac OS X lineup, including Panther (10.3), Jaguar (10.2), Puma (10.1), and Cheetah (10.0).  Apple originally used the cat names as internal names for the operating system development, but actually started to market the names with the release of Jaguar.\nAccording to Apple, Tiger includes over 200 improvements from Mac OS X 10.3.  A few of the most notable additions include an enhanced search feature called \"Spotlight,\" an internal scripting program called \"Automator,\" and quick information access via widgets from the new \"Dashboard.\"  Mac OS X 10.4 Tiger is a feature-rich operating system that some may consider as a serious alternative to Windows."
        ]
    },
    {
        "word": "Timestamp",
        "type": [],
        "definition": [
            "A timestamp is a specific date and time \"stamped\" on a digital record or file.  While most often used as a noun, the word \"timestamp\" can also be a verb.  For example, \"The tweet was timestamped on January 8, 2021, at 10:44 AM.\"\nTimestamps are the standard way to store dates and times on computer systems.  For example, operating systems timestamp each file  with a created and modified date and time.  Digital cameras timestamp each captured photo.  Social media platforms store a timestamp with each post, such as the Twitter example above.\nWhile timestamps are universal, there is no universal timestamp format.  For example, a programming language may use one method, while a database may use another.  Even operating systems have different ways of storing timestamps.  For instance, Windows uses the ANSI standard and stores timestamps as the number of seconds since January 1, 1601.  Unix stores timestamps as the number of seconds that have elapsed since midnight on January 1, 1970.  Because several different timestamp formats exist, most modern programming languages have built-in timestamp conversion functions.\nA Unix timestamp is also known as \"epoch time,\" which is equivalent to the number of seconds since  January 1, 1970, at 12:00 AM GMT (Greenwich Mean Time).  This GMT (or \"UTC\") date\/time may be displayed by default on Unix and Linux devices (including Android) when a valid timestamp is not available.  In the western hemisphere, such as the United States, this date will appear as December 31, 1969.\nStoring a timestamp as an integer is efficient since it requires minimal storage space.  However, the number must be converted to a legible time format when displayed.  MySQL has a TIMESTAMP data type, which conveniently stores timestamps in the following format:\nYYYY-MM-DD  HH:MM:SS\nMySQL stores timestamps in UTC, which is based in England.  So January 16, 2021 at 10:15:30 AM US Central Time would be stored in a MySQL database as follows:\n2021-01-16 16:15:30\nIf converted to a timestamp in Linux, this time\/date would be represented as:\n1610813730\nTimestamps also have different resolutions or specificity.  In some cases, seconds are sufficient, while in others, milliseconds or even nanoseconds are required.  The Linux timestamp above would be 1610813730000 in milliseconds, which provides a resolution of one-thousandth of a second.  Computing operations may require timestamps with even higher resolution.  PHP includes a microtime() function that outputs a timestamp in microseconds, with a resolution of one-millionth of a second."
        ]
    },
    {
        "word": "Title Bar",
        "type": [],
        "definition": [
            "A title bar is a small strip that extends across the top of a window.  It displays the title of the window and typically includes the close, minimize, and maximize buttons.  In macOS, these buttons are on the left side of the title bar, while in Windows, they are on the right.  Some title bars contain tabs, while others have tabs below them.\nBoth Mac and Windows allow you to move a window by clicking and dragging the title bar.  In Windows, you can double-click the title bar to maximize the window or restore it to the previous size.  In macOS, double-clicking the title bar minimizes the window and puts it in the Dock.\nIf you have several windows open, you can identify each window by simply looking at the title bar.  In Windows, you can hover the cursor over an icon in the Task Bar to reveal the titles of all open windows.  In macOS, you can view window titles in the \"Window\" menu of an open application.  You can also right click or click and hold an icon in the Dock to display a list of all open windows for that application.\nWhen you open a window on the desktop, the title bar displays the name of the current folder.  When you open a window in an application, the title bar typically displays the name of the current file.  If you haven't saved the file yet, the title bar may display \"Untitled\" or something similar.  When you save the document, the title will change to the name of the document."
        ]
    },
    {
        "word": "Toggle Key",
        "type": [],
        "definition": [
            "A toggle key toggles the input from a group of keys on a keyboard between two different input modes.  The most common toggle key is Caps Lock, which toggles the letter keys between lowercase and uppercase mode.  Some keyboards also have other toggle keys, such as Num Lock, Scroll Lock, and Insert.  Below is a list of toggle keys and their functions.\n\nCaps Lock - capitalizes the input of all letter keys when turned on; may allow lowercase letters to be entered using the Shift key on some keyboards; does not affect the number keys.\nNum Lock - ensures numbers are input from the numeric keypad rather than arrows or other commands; typically turned on by default; may also be used to change letter keys to numbers on laptop keyboards.\nScroll Lock - causes the arrow keys to scroll through the contents of a window when turned on; allows users to scroll using the arrow keys rather then clicking on the scroll bar at the right side or bottom of a window; not supported by most modern operating systems.\nInsert - toggles between \"insert mode\" and \"overtype mode\" when entering text; insert mode is the default mode, which inserts characters wherever the cursor is located, while overtype mode overwrites characters as the user types; also not supported by most modern operating systems.\n\nUnlike modifer keys, toggle keys are switched on or off each time they are pressed.  Therefore, toggle keys do not need to be held down when pressing other keys.  Some keyboards have lights on or near the toggle keys to let the user know if they are turned on or off.\nSome modern operating systems also display the status of toggle keys on the user's screen.  For example, the software installed with Logitech keyboards on Macintosh computers displays a Caps Lock icon in the menu bar whenever Caps Lock is turned on."
        ]
    },
    {
        "word": "Token",
        "type": [],
        "definition": [
            "Besides those small shiny coins that allow you to play video games, there are three different types of tokens:\n1. In networking, a token is a series of bits that circulate on a token-ring network.  When one of the systems on the network has the \"token,\" it can send information to the other computers.  Since there is only one token for each token-ring network, only one computer can send data at a time.\n2. In programming, a token is a single element of a programming language.  There are five categories of tokens: 1) constants, 2) identifiers, 3) operators, 4) separators, and 5) reserved words.  For example, the reserved words \"new\" and \"function\" are tokens of the JavaScript language.  Operators, such as +, -, *, and \/, are also tokens of nearly all programming languages.\n3. In security systems, a hard token is small card that displays an identification code used to log into a network.  When the card user enters the correct password, the card will display the current ID needed to log into the network.  This adds an extra level of protection to the network because the IDs change every few minutes.  Security tokens also come in software versions, called soft tokens."
        ]
    },
    {
        "word": "Toolbar",
        "type": [],
        "definition": [
            "A toolbar is a set of icons or buttons that are part of a software program's interface or an open window.  When it is part of a program's interface, the toolbar typically sits directly under the menu bar.  For example, Adobe Photoshop includes a toolbar that allows you to adjust settings for each selected tool.  If the paintbrush is selected, the toolbar will provide options to change the brush size, opacity, and flow.  Microsoft Word has a toolbar with icons that allow you to open, save, and print documents, as well as change the font, text size, and style of the text.  Like many programs, the Word toolbar can be customized by adding or deleting options.  It can even be moved to different parts of the screen.\nThe toolbar can also reside within an open window.  For example, Web browsers, such as Internet Explorer, include a toolbar in each open window.  These toolbars have items such as Back and Forward buttons, a Home button, and an address field.  Some browsers allow you to customize the items in toolbar by right-clicking within the toolbar and choosing \"Customize...\" or selecting \"Customize Toolbar\" from the browser preferences.  Open windows on the desktop may have toolbars as well.  For example, in Mac OS X, each window has Back and Forward buttons, View Options, a Get Info button, and a New Folder button.  You can customize the Mac OS X window toolbars as well.\nToolbars serve as an always-available, easy-to-use interface for performing common functions.  So if you haven't made use of your programs' toolbar options or customization features in the past, now is a good time to start!"
        ]
    },
    {
        "word": "Toolchain",
        "type": [],
        "definition": [
            "A toolchain may refer to 1) a specific set of software development tools, or 2) a DevOps (development and operations) process used to test and deliver a software program.\n1. Software Toolchain\nA software toolchain is a collection of tools used for building and delivering an application.  These tools are chained together to streamline the software production process.  For example, the output generated by one tool in the chain is used as input by the next tool.\nDevelopers may use a toolchain near the end of the development process.  For example, a development team may build an app within an integrated development environment.  Once the source code is complete, a toolchain may be used to generate the executable file.  A software development toolchain may include the following components:\n\nAssembler - converts assembly language into machine code\nLinker - merges multiple files into a single program\nCompiler - generates executable code from a program's source code\nLibrary - a collection of code, such as an API, that allows the app to reference prebuilt functions or other resources\nDebugger - an optional tool that can help fix bugs during the final build steps\n\nA developer may create a script that chains these tools together.  The resulting toolchain simplifies the process of creating an executable program from existing code.\n2. DevOps Toolchain\nA DevOps toolchain is a list of steps that development and operations teams can follow when releasing a software program.  It covers the entire development process, from planning a software application to the maintenance of a program after it has been released.\nSteps in a DevOps toolchain may include:\n\nPlan - define the purpose, requirements, and expectations\nCreate - design and build (program) the software\nTest - test the software internally on multiple devices; provide a public beta test\nRelease - schedule and deploy the software\nMonitor - check software metrics, respond to user feedback, update software to fix bugs or add features\n"
        ]
    },
    {
        "word": "Tooltip",
        "type": [],
        "definition": [
            "As computer users, we have become accustomed to icons that represent files, folders, programs, and other objects on the computer.  Many software programs also use icons to represent tools, which are often found in the program's toolbar.\nWhile these icons can save screen space and make the program's interface more attractive, it can sometimes be difficult to tell what all the tool icons mean.  While some tool icons are obvious (such as a printer icon to print and a scissors icon to cut a text selection), others are a bit more ambiguous.  For this reason, programs often include tooltips that explain what each tool icon represents.\nTooltips are displayed when you roll over an icon with the cursor.  It may take a second or two to display the tooltip, but when it does appear, it usually is a small box with a yellow background explaining what the icon represents.  For example, in Microsoft Word, when you roll over the disk icon, the tooltip \"Save\" appears.  This means clicking on the disk icon will save your document.  In Photoshop, when you roll over the wand icon, the text \"Magic Wand Tool (W)\" appears.  This indicates that clicking the the wand icon or pressing the W key will activate the magic wand selection tool.\nNot all programs incorporate tooltips, but most modern programs include them as part of a user-friendly interface.  Operating systems also support them in different ways.  For example, Mac OS X will show the full text of a long filename when you place the cursor over the filename.  Windows includes tooltips for the systray icons and also tells you information about each file and folder you place the cursor over.  If you drag your cursor over different icons on your computer, you may find tooltips you never knew were there!"
        ]
    },
    {
        "word": "Torrent",
        "type": [],
        "definition": [
            "A torrent is a file sent via the BitTorrent protocol.  It can be just about any type of file, such as a movie, song, game, or application.  During the transmission, the file is incomplete and therefore is referred to as a torrent.  Torrent downloads that have been paused or stopped cannot be opened as regular files, since they do not contain all the necessary data.  However, they can often be resumed using a BitTorrent client, as long as the file is available from another server.\nTorrents are different from regular downloads in that they are usually downloaded from more than one server at a time.  The BitTorrent protocol uses multiple computers to transfer a single file, thereby reducing the bandwidth required by each server.  When a torrent download is started, the BitTorrent system locates multiple computers with the file and downloads different parts of the file from each computer.  Likewise, when sending a torrent, the server may send the file to multiple computers before it reaches the recipient.  The result is a lower average bandwidth usage, which speeds up file transfers.\nFile Extension: .TORRENT"
        ]
    },
    {
        "word": "Toslink",
        "type": [],
        "definition": [
            "Toslink is a type of digital audio connection developed by Toshiba Corporation.  It uses a fiber optic cable to transmit an audio signal in the form of pulses of light.  A single Toslink cable can be used to carry a mono, stereo, or even a surround audio signal.\nToslink is similar to the Sony\/Philips Digital Interfance, known as S\/PDIF.  It provides the same digital audio data as S\/PDIF, but uses a light beam instead of an electrical current to send the data.  Because the Toslink cable does not use electrical currents, the connection is immune to electrical or magnetic interference.  Toslink connections are most commonly found on high-end home theater receivers, MiniDisc players, and professional audio equipment, as well as Power Mac G5 computers."
        ]
    },
    {
        "word": "Touchpad",
        "type": [],
        "definition": [
            "A touchpad or \"trackpad\" is a flat control surface used to move the cursor and perform other functions on a computer.  Touchpads are commonly found on laptops and replace the functionality of a mouse.\nA touchpad is designed to be controlled with your finger.  By sliding your fingertip along the surface, you can move the cursor on the screen.  Similar to a mouse, touchpads can detect acceleration as well as linear motion.  This allows you to have refined control with slow movements and quickly move the cursor across the screen using a fast motion.\nSome touchpads have two buttons below them, which correspond to the left-click and right-click mouse buttons respectively.  In modern laptops, the buttons may be hidden in the bottom portion of the touchpad.  This allows for a larger touchpad surface, but you can press the lower left or lower right section of the touchpad to click the buttons.\nTouchpads may also include multi-touch technology, which is common on touchscreen devices.  This means you can use multiple fingers to perform different actions on your computer.  For example, some programs allow you to use two fingers to pinch and zoom in or out on a document or image.  You may also be able to twist two fingers on a touchpad to rotate an image left or right.  Some programs allow you to swipe left or right to go back in a web browser or jump to another page in a document.\nNOTE: There is no difference between \"touchpad\" and \"trackpad,\" so the two terms can be used simultaneously.  However, \"touchpad\" is commonly associated with Windows computers while \"trackpad\" typically describes the touch controls built into Macs and Apple-branded peripheral devices."
        ]
    },
    {
        "word": "Touchscreen",
        "type": [],
        "definition": [
            "A touchscreen is a display that also serves as an input device.  Some touchscreens require a proprietary pen for input, though most modern touchscreens detect human touch.  Since touchscreen devices accept input directly through the screen, they do not require external input devices, such as mice and keyboards.  This makes touchscreens ideal for computer kiosks, as well as portable devices, such as tablets and smartphones.\nWhile a touchscreen may look like an ordinary display, the screen includes several extra layers that detect input.  The first layer is a hard protective layer that protects the actual display and the touchscreen components.  Beneath the protective layer is an electronic grid that detects input.  Most modern touchscreens use capacitive material for this grid, in which the electrical charge changes wherever the screen is touched.  Beneath the touchscreen layer is the LCD layer, which is used for the actual display.\nWhile early touchscreens could only detect a single point of input at a time, modern touchscreens support \"multi-touch\" input.  This technology, which was made popular by the original iPhone, enables the screen to detect multiple finger motions at once.  For example, on some touchscreen devices, you can rotate an image by twisting three fingers in a clockwise or counterclockwise motion.  Many touchscreen applications also allow you zoom in and out by spreading two fingers apart or pinching them together.\nThanks to multi-touch and other improvements in touchscreen technology, today's touchscreens are easier and more natural to use than they used to be.  In fact, improved touchscreen technology has greatly contributed to the popularity of the iPad and other tablet PCs."
        ]
    },
    {
        "word": "Traceroute",
        "type": [],
        "definition": [
            "When computers communicate over the Internet, there are often many connections made along the way.  This is because the Internet is made up of a network of networks, and two different computers may be on two separate networks in different parts of the world.  Therefore, if a computer is to communicate with another system on the Internet, it must send data through a series of small networks, eventually getting to the Internet backbone, and then again traveling to a smaller network where the destination computer resides.\nThese individual network connections, called \"hops,\" typically go unnoticed by the average user.  After all, why bother tracking all the various connections when you are only interested in communicating with the destination computer?  However, if a connection cannot be made or is taking a unusually long time, tracing the path of connections along the way can prove to be helpful.  This is exactly what the traceroute command does.\nTraceroute is a TCP\/IP utility that allows a user to trace a network connection from one location to another, recording every hop along the way.  The command can be run from a Unix or DOS command line by typing tracert [domain name], where [domain name] is either the domain name or the IP address of the system you are trying to reach.  A traceroute can also be done using various networking utilities, such as Apple's Network Utility for Mac OS X.\nWhen a traceroute is run, it returns a list of network hops and displays the host name and IP address of each connection.  It also returns the amount of time it took for each connection to take place (usually in milliseconds).  This shows if there were any delays in establishing the connection.  Therefore, if a network connection is slow or unresponsive, a traceroute can often explain why the problem exists and also show the location of the problem."
        ]
    },
    {
        "word": "Trackback",
        "type": [],
        "definition": [
            "Trackback is a means of notifying a website that another website has linked to it.  By linking to a trackback link, a webmaster can automatically inform the other website that he has added a link to one of site's pages.  However, in order for the trackback system to work, both websites must support trackback.  This is because the linking website needs to ping the linked website to let it know a link has been added.\nTrackback was first implemented by Movable Type blogging and Web design software in 2002.  Since then, other Web development tools, such as Wordpress and Typo, have also added trackback support.  This allows bloggers from all types of platforms to communicate with each other.  For example, a user might read a blog entry on another person's site and decide to post his own blog, responding to the original post.  If he adds a trackback link, the original blogger will see that the other user has linked to his blog.  Depending on the trackback settings, the new blog may also show up as a link at the end of the original blog.\nSince trackback requires multiple websites to support the trackback protocol, it continues to be used primarily for blogs.  However, some news websites now offer trackback links as well.  You can tell if a site supports trackback if there is a \"Trackback link\" or \"Trackback URL\" at the end of an article.  Sometimes the link will be followed by a number, which indicates the number trackbacks that link back to the blog."
        ]
    },
    {
        "word": "Trackball",
        "type": [],
        "definition": [
            "A trackball is an input device used to enter motion data into computers or other electronic devices.  It serves the same purpose as a mouse, but is designed with a moveable ball on the top, which can be rolled in any direction.  Instead of moving the whole device, you simply roll the moveable ball on top of the trackball unit with your hand to generate motion input.\nTrackballs designed for computers generally serve as mouse replacements and are primarily used to move the cursor on the screen.  Like mice, computer trackball devices also include buttons, which can serve as left-click and right-click buttons, and may also be used to enter other commands.  While trackballs are most commonly used with computers, they may also be found in other electronics, such as arcade games, mixing boards, and self-serve kiosks.  These devices often have trackballs that are larger than the ones used in computer input devices.\nBesides the capability to be built into various devices, trackballs have a number of other advantages over mice.  Some advantages include the small footprint (since they don't require a mousepad or large area to move the mouse), fingertip control (which may offer more accuracy), and improved ergonomics (since there is less strain on the wrist).  Still, many people find trackballs harder to use than mice, since they feel less natural and may require practice to get used to.  For this reason, the vast majority of computers include a mouse, rather than a trackball, as the default input device."
        ]
    },
    {
        "word": "Tracking",
        "type": [],
        "definition": [
            "Font tracking is a typography setting that defines the horizontal distance between each character.  Most typefaces (besides cursive ones) have a natural padding on the sides of each character.  The tracking setting adjusts this padding to be smaller or larger.\nA negative tracking setting can be used to fit more text in a specific area without reducing the font size.  Negative tracking allows more letters and numbers to be crammed into the same amount of horizontal space.  If the tracking setting is too low, however, the text may become difficult to read.  If it is reduced enough, the characters may overlap.\nA positive tracking setting can help make text more readable.  It may also be used for logos or other prominent text, since a high tracking setting makes text stand out more.  However, if the font tracking is too high, the text can actually become more difficult to read and spaces between words may be difficult to discern.\nTracking vs Kerning\nKerning is similar to tracking, but refers to spacing between specific letters.  Kerning allows certain letters to fit more closely without overlapping.  A good example is \"AV,\" in which kerning enables the lower part of the A to fit underneath the top part of the V.  Tracking does not consider individual character shapes, but simply adds uniform spacing between each character.\nNOTE: \"Tracking speed\" is unrelated to font tracking and describes the rate at which a mouse or trackpad moves the cursor.  A high tracking speed will make the cursor move further with less mouse movement or trackpad input."
        ]
    },
    {
        "word": "Transistor",
        "type": [],
        "definition": [
            "A transistor is a basic electrical component that alters the flow of electrical current.  Transistors are the building blocks of integrated circuits, such as computer processors, or CPUs.  Modern CPUs contain millions of individual transistors that are microscopic in size.\nMost transistors include three connection points, or terminals, which can connect to other transistors or electrical components.  By modifying the current between the first and second terminals, the current between the second and third terminals is changed.  This allows a transistor to act as a switch, which can turn a signal on or off.  Since computers operate in binary, and a transistor's \"on\" or \"off\" state can represent a 1 or 0, transistors are suitable for performing mathematical calculations.  A series of transistors may also be used as a logic gate when performing logical operations.\nTransistors in computer processors often turn signals on or off.  However, transistors can also change the amount of current being sent.  For example, an audio amplifier may contain a series of transistors that are used to increase the signal flow.  The increased signal generates an amplified sound output.  Because of their low cost and high reliability, transistors have mostly replaced vacuum tubes for sound amplification purposes.\nWhile early transistors were large enough to hold in your hand, modern transistors are so small they cannot be seen with the naked eye.  In fact, CPU transistors, such as those used in Intel's Ivy Bridge processor, are separated by a distance of 22 nanometers.  Considering one nanometer is one millionth of a millimeter, that is pretty small.  This microscopic size allows chip manufacturers to fit hundreds of millions of transistors into a single processor."
        ]
    },
    {
        "word": "Trash",
        "type": [],
        "definition": [
            "When you delete a file or folder on a Macintosh computer, it is stored in the Trash.  In early versions of the Mac OS, the Trash was located on the desktop, but in Mac OS X, it is found in the Dock.  The Trash icon is an empty trash bin when the Trash is empty and changes to a full trash bin when there are items in the Trash.\nThe Trash serves the same purpose as the Windows Recycle Bin.  Items can be moved to the Trash by selecting them and dragging them to the Trash icon.  You can also choose \"Move to Trash\" from the Finder's File menu or press Command-Delete after selecting one or more items.  You may view items in the Trash by clicking the Trash icon in the Dock.  Since the items stored in the Trash have not been permanently deleted, you can drag items out of the Trash if you wish to keep them.\nEmptying the Trash\nIf you are sure you want to permanently delete the items in the Trash, you can press the \"Empty\" button in the Trash window or right-click anywhere within the window and select \"Empty Trash.\"  You can also empty the trash without even opening the Trash window by selecting \"Empty Trash...\" from the Finder menu.  If you want to overwrite the deleted data so it cannot be recovered even with a data recovery utility, you can select \"Secure Empty Trash...\"\nNOTE: If you wish to delete locked items that are stored in the Trash, hold the Option key while selecting \"Empty Trash.\""
        ]
    },
    {
        "word": "Trinitron",
        "type": [],
        "definition": [
            "Trinitron is arguably the best consumer CRT (Cathode Ray Tube) technology available.  The technology was developed by Sony Corporation, who owns complete rights to it.  The Trinitron design has helped the company lead the market in the manufacturing of TVs and monitors for many years.  The difference between a Trinitron tube and most other tubes is that the Trinitron uses an aperture grille instead of a shadow mask for creating the image on the screen.\nAn aperature grille consists of wires stretched vertically down the screen (allowing for a vertically flat screen).  A shadow mask is basically a metal plate with holes in it, where light can pass through.  Because Trinitron monitors are vertically flat, they have less image distortion and less glare than most other monitors.  If you look very closey at a Trinitron screen, you should see one or two very thin dark horizontal lines that span the width of the screen.  These lines are small wires that support the aperture grille."
        ]
    },
    {
        "word": "Trojan Horse",
        "type": [],
        "definition": [
            "In Greek mythology, there is a story about the Trojan War.  This war lasted many years, as the Greeks could not penetrate the heavily barricaded city of Troy.  So one day, a few of the Greek soldiers brought the people of Troy a large wooden horse, which they accepted as a peace offering.  The horse was moved inside the city walls, where it sat until the night.  After the people of the city had fallen asleep, Greek soldiers jumped out of the wooden horse, opened the gates to let their fellow soldiers in, and took over the city.\nSo what is the moral of this story?  Mainly, beware of Trojan horses.  But how does that relate to computers?  That's a good question.  In the computing world, Trojan horses are more than just a myth.  They really exist and can cause damage to your computer.  Trojan horses are software programs that masquerade as regular programs, such as games, disk utilities, and even antivirus programs.  But if they are run, these programs can do malicious things to your computer.\nFor example, a Trojan horse might appear to be a computer game, but once you double-click it, the program starts writing over certain parts of your hard drive, corrupting your data.  While this is certainly something you want to avoid, it is good to know that these malicious programs are only dangerous if they are given a chance to run.  Also, most antivirus programs can catch Trojan horses when scanning for viruses.  Unlike viruses, however, Trojan horses don't replicate themselves.  Though it is possible for a Trojan horse to be attached to a virus file that spreads to multiple computers.\nSo as a general rule, don't open a program unless you know it is legitimate.  This applies especially to e-mail attachments that are executable files.  Even if you are pretty sure the attachment is OK, it is still a good idea to run it through your virus scan program (with the latest virus definitions) just to be safe.  Remember what happened to the people of Troy -- don't let a Trojan horse catch you off guard."
        ]
    },
    {
        "word": "Troll",
        "type": [],
        "definition": [
            "Trolls are typically thought of as scary creatures that live underneath bridges.  While these mythical creatures may only exist in legend, \"Internet trolls\" are real and cause real problems.  In computing, the term \"troll\" refers to a person who posts offensive, incendiary, or off topic comments online.  These comments may appear in Web forums, on Facebook walls, after news articles or blog entries, or in online chat rooms.\nTrolls post off-color comments for a number or reasons.  They may want to stir up an argument or may simply want attention.  Some trolls use comment sections after news articles to rant about their feelings, which may or may not be related to the news story.  Whatever the case, trolls are seen as a nuisance in online discussions.  At the least, their comments distract from an otherwise legitimate discourse.  In worse cases, trolls stir up emotions from other visitors, creating unnecessary arguments.\nThe action of posting obscene or inflammatory comments is often called \"trolling.\"  This activity is highly discouraged and may actually a violation of online community's user agreement.  Fortunately, webmasters and forum moderators typically have the power to remove offensive or off topic posts and even terminate accounts if needed.  While we enjoy the liberty of free speech online, it is still important to respect others.  Therefore, remember to show common courtesy when posting comments online and don't be a troll!"
        ]
    },
    {
        "word": "Troubleshooting",
        "type": [],
        "definition": [
            "Troubleshooting is the process of diagnosing the source of a problem.  It is used to fix problems with hardware, software, and many other products.  The basic theory of troubleshooting is that you start with the most general (and often most obvious) possible problems, and then narrow it down to more specific issues.\nMany product manuals have a \"Troubleshooting\" section in the back of the manual.  This section contains a list of potential problems, which are often phrased in the form of a question.  For example, if your your computer's monitor is not producing an image, you may be asked to answer the following troubleshooting questions:\n\nIs the monitor plugged in to a power source?\nIs the monitor turned on?\nIs the monitor cable plugged into the computer?\nIs the computer turned on?\nIs the computer awake from sleep mode?\n\nIf the answers to all the above questions are Yes, there may be some additional questions such as:\n\nDoes your computer have a supporting video card?\nHave you installed the necessary video card drivers?\nIs the monitor resolution set properly?\n\nTypically, each of these questions will be followed by specific advise, whether the answer is Yes or No.  Sometimes, this advice is presented as a flowchart diagram.  This means each question is followed by a series of other questions, depending on the answer.  However, in many cases, only single solutions are provided for each question.\nTroubleshooting is something we all have to do at some point, though some of us have to troubleshoot product problems more often than others.  The good news is that, the more you do it, the more you learn and the better you get at fixing problems.  Since many products have similar troubleshooting steps, you may find that after awhile, you don't even need the manual to find solutions to the problems you encounter."
        ]
    },
    {
        "word": "Truncate",
        "type": [],
        "definition": [
            "To truncate something is to shorten it, or cut part of it off.  In computer science, the term is often used in reference to data types or variables, such as floating point numbers and strings.\nFor example, a function may truncate the decimal portion of a floating point number to make it an integer.  If the number 3.875 is truncated, it becomes 3.  Note that this is different than if the number had been rounded to the nearest integer, which would be 4.  Strings may also be truncated, which can be useful if a string exceeds the maximum character limit for a certain application.\nSeveral programming languages use the function trunc() to truncate a variable.  PHP uses strlen() to truncate a string to a set limit of characters."
        ]
    },
    {
        "word": "Tumblr",
        "type": [],
        "definition": [
            "Tumblr is a microblogging website that allows you to create and follow blogs.  Unlike traditional blogging websites, Tumblr encourages short posts, such as a single photo or a few sentences of text.  The goal is to make blogging quick and easy, enabling users to post frequent updates.\nTumblr is also more community-oriented than other blogging websites, offering a number of social features.  For example, you can follow other users, \"like\" specific posts, and \"reblog\" updates from other users.  The optional \"Reply\" and \"Ask\" features allow you to let other users comment on your blogs or ask questions.  There is also a Fan Mail feature that allows you to communicate privately with other bloggers.\nIf you want other Tumblr users to interact directly with one of your blogs, you can create a group blog.  When you add other users as members, they can post their own updates and reply to posts made by other members.  You can also promote members to admins, giving them permissions similar to a web forum moderator.  Admins can invite and remove users, delete posts, and view private messages.\nLike other social media websites, in order to use Tumblr, you first need to create an account.  After registering with your email address and choosing a username, Tumblr guides you through creating your first blog and following three others.  Once you've completed the initial steps, you can use the Tumblr dashboard to browse or search blogs and post your own updates."
        ]
    },
    {
        "word": "Tunneling",
        "type": [],
        "definition": [
            "The term \"tunneling\" probably brings to mind images of digging tunnels underground, perhaps for a subway system, or for you more technically-minded, a fiber optic cable connection.  In the virtual world of computers world, however, tunneling refers to a protocol in which one protocol is encapsulated within another.\nTunneling protocols are often used for establishing various types of connections over common protocols, such as HTTP.  For example, a peer-to-peer (P2P) file sharing program may mask data as HTTP to allow the data to be transferred through a firewall.  Since most firewalls allow HTTP (port 80) connections, the connection would likely be allowed, since this is the same port that the Web uses.  If the program used its own protocol and port number, the connection may be blocked.\nTunneling can also be used to establish secure connections through protocols that are typically not secure.  For example, the point-to-point tunneling protocol (PPTP) establishes a secure connection over a standard PPP connection, and can used to create a virtual private network (or VPN) between two remote locations.  PPTP allows a user to \"tunnel\" to another location with a secure password-protected connection using the standard or PPP protocol."
        ]
    },
    {
        "word": "Tuple",
        "type": [],
        "definition": [
            "A tuple (pronounced \"tuh-pull\") is a data structure that stores a specific number of elements.  These elements may include integers, characters, strings, or other data types.\nMathematics\nThe term \"tuple\" originates from math, rather than computer science.  A math tuple may be defined as an \"n-tuple,\" where \"n\" is the number of values the tuple contains.  In mathematical expressions, tuples are represented by comma-delimited lists within parentheses.  The following example is a \"4-tuple,\" which has four values.\n(3, 7, 13, 17)\nTuples serve a variety of purposes in mathematics.  They are commonly used to represent a set of related values, such as prime numbers or mathematical sequences. A tuple can also display a range of input or output values for a function.\nComputer Science\nIn computer programming, tuples provide an efficient way to store multiple values.  Since they are static and cannot be modified, tuples generally require less memory than arrays.  They are also flexible since they can store multiple data types.  The following example is a \"5-tuple,\" or a tuple that contains five values.\n(11, 2020.07, \"techterms\", \"C\", -1000)\nThe \"pentuple\" above contains a positive integer (11), floating point number (2020.07), string (techterms), character (C), and a negative integer (-1000).\nTuples are an effective way to store data in computer programs, but not all programming languages support them.  For example, Python and Java support tuples, but PHP and Ruby do not.  If a language does not support tuples, an immutable array — one that cannot be modified — is the closest alternative."
        ]
    },
    {
        "word": "Tutorial",
        "type": [],
        "definition": [
            "A computer tutorial is an interactive software program created as a learning tool.  Tutorials help people learn new skills by using a step-by-step process that ensures the user is following along and comprehending the material.  For example, a Web development tutorial may begin with instructions on how to create a basic Web page.  This page might only include the words \"Welcome to my website\" on it and use the minimum HTML required in order for the page to load in a Web browser.  Once the user is able to create a working Web page, the tutorial may explain how to add other features, such as styled text, table layouts, and images, to the page.  Then the tutorial may provide instructions on how to publish the Web page to the Internet.\nSome software tutorials provide testing features to ensure comprehension of the material, while others may be simple walkthroughs of a software program.  Tutorials can be used for both school and business purposes and are written for basic, intermediate, and advanced users.  Even smart computer programmers use tutorials.  Most software development programs include a tutorial for creating a \"Hello World!\" program, which is the most basic program that can be created with the software.  Since tutorials offer a gradual approach to learning, they can be helpful to people at many different skill levels.  If a computer programmer can benefit from a tutorial, just about anybody can."
        ]
    },
    {
        "word": "Tweak",
        "type": [],
        "definition": [
            "When you modify a certain piece of hardware for better performance, it is often referred to as \"tweaking\" it.  Overclocking the computer's CPU or changing jumper settings on the motherboard are common examples of hardware tweaking.  Removing system limitations and adding plug-ins or extensions to a computer's operating system are types of software tweaking.\nTweaking a computer is much like \"tuning\" a car (you know, the ones with the huge mufflers, big spoilers, and pimped out rims).  It may increase performance, but is best left in the hands of the technically savvy.  For example, overclocking your computer's processor may cause it to crash frequently, or worse yet, overheat and destroy the CPU.  So, for most people, it is best to leave well enough alone."
        ]
    },
    {
        "word": "Tweet",
        "type": [],
        "definition": [
            "For most of history, \"tweet\" has been the sound a bird makes.  However, with the advent of Twitter, the word \"tweet\" has taken on a whole new meaning.\nA tweet is an online posting, or \"micro-blog\" created by a Twitter user.  The purpose of each tweet is to answer the question, \"What are you doing?\"  However, tweets can contain any information you want to post, such as your plans for the weekend, your thoughts about a TV show, or even notes from a lecture.  You can publish a tweet using a computer or a mobile phone.  Once published, the tweet will appear on the Twitter home pages of all the users that are following you.  Likewise, your Twitter home page will display the most recent tweets of the users that you are following.\nEach tweet is limited to 140 characters or less.  This limit makes it possible to show several tweets on one page without certain tweets taking up a lot more space than others.  However, it also means that tweets must be brief, so you must choose your words wisely.  Of course, there is no limit to how many tweets you can post, so if you really have a lot to say, you can publish several tweets in a row.  After all, what better way to spend your time than to let the world know that you are at Starbucks, drinking a Frappuccino and reading the latest issue of TIME magazine.  That is important information to share with the world."
        ]
    },
    {
        "word": "Twitch",
        "type": [],
        "definition": [
            "Twitch is a live streaming service that enables individuals to stream video content online.  It began as a platform for gamers to stream their matches in real-time, but has expanded into other categories.  Examples include Just Chatting, Music, and Creative channels.\nAnyone with a computer and a high-speed Internet connection can stream on Twitch.  It is free to stream, and broadcasters can earn money through user subscriptions, advertisements, and donations.  Similar to YouTube, popular Twitch streamers earn enough to make Twitch streaming a full-time job.\nExamples of online games and esports events streamed on Twitch include:\n\nFortnite\nMinecraft\nRoblox\nCounterstrike\nStarCraft\n\nHistory\nTwitch began in 2005 as Justin.tv, a small streaming service focused on general \"real life\" content rather than gaming.  However, the most popular type of content was online gaming, which led to the introduction of TwitchTV, a game streaming service, in 2011.  The platform gained several million users in the next few years and rebranded as simply \"Twitch.\"\nIn 2014, Amazon acquired Twitch for $970 million.  While Amazon now owns the service, it is still run as Twitch Interactive, Inc. and has not changed much since the acquisition.  The most notable change is that the streaming platform now offers a broader variety of content, such as the \"IRL\" (In Real Life) streaming category.  Twitch has come full circle in terms of content since Just Chatting is now the most popular streaming category."
        ]
    },
    {
        "word": "Twitter",
        "type": [],
        "definition": [
            "Twitter is an online service that allows you to share updates with other users by answering one simple question: \"What are you doing?\"\nIn order to use Twitter, you must first sign up for a free account.  Once you have created your account, you can post your own updates and view the updates others have posted.  You can search for people to follow or you can let Twitter select random users.  Once you have selected a number of users, their most recent posts, or \"tweets,\" will show up on your Twitter home page.  Likewise, your own latest tweets will show up on the home pages of people who have decided to follow you.\nTwitter limits each tweet to 140 characters, which means there is no room for rambling.  Of course, in this era of limited attention spans, 140 characters may be as much as other users want to read anyway.  The character limit is also within the 160 character limit of SMS text messages.  This is useful, since tweets can be sent to Twitter using mobile phones.  To Twitter via your cell phone, you simply need to add your phone number in the \"Devices\" area of the Twitter Settings page.\nSince most people have frequent access to a computer or cell phone, Twitter makes it possible to provide others with frequent updates about your life.  Many people also use Twitter to blog about the news, politics, TV shows, or any other hot topic.  Some people even use it to share their thoughts on lectures or sermons.  So Twitter posts are certainly not limited to answering the question, \"What are you doing?\"\nTwitter has become the next hot trend in social networking.  While it is not as functional as Facebook or MySpace, Twitter's appeal lies within its simplicity.  It allows friends, family, and complete strangers to stay connected through quick updates that only take a couple of seconds to write.  Therefore, if you like to feel connected to others, but have limited time, Twitter might just be for you.\nWhile \"Twitter\" is a noun, in can also be used as a verb.  For example, \"He twitters at least five times a day.\"  To learn more about Twitter or to sign up for an account, visit Twitter.com."
        ]
    },
    {
        "word": "Two-Factor Authentication",
        "type": [],
        "definition": [
            "Two-factor authentication (2FA) is a security measure that requires two forms of authentication to access an account.  It often works in combination with a username and password to add an extra level of security.\nWhile a standard login with a username and password provides reasonable security, it can be easily compromised.  For example, if someone knows your email address and guesses your password, he or she may be able to access your account.  Two-factor authentication adds another layer of security that protects your account even if someone finds out your login information.\nBelow are several types of two-factor authentication:\n\nA four to six-digit code sent via text message to the user's mobile phone\nA one-time code sent via email to the user's email address\nAn additional PIN or passcode required in addition to a username and password\nA secret question and answer created by the user\nA physical token, such as a small \"key\" that displays dynamic code\nA hardwired dongle linked to the user's account\nA biometric identifier such as a fingerprint or facial recognition.\n\nIn many cases, two-factor authentication is only required once per device.  After you have successfully logged into a website on a specific device, the site may set a cookie in your browser.  Once this cookie is set, your device becomes the secondary authentication for future logins.\nIn order to bypass two-factor authentication each time you log in to a website, you may need to check the \"Remember this device\" checkbox when logging in.\nSome websites and online services offer two-factor authentication as an optional security feature, while others require it.  2FA options are typically located in the \"Password & Security\" settings within a user account."
        ]
    },
    {
        "word": "Typecasting",
        "type": [],
        "definition": [
            "Typecasting, or type conversion, is a method of changing an entity from one data type to another.  It is used in computer programming to ensure variables are correctly processed by a function.\nAn example of typecasting is converting an integer to a string.  This might be done in order to compare two numbers, when one number is saved as a string and the other is an integer.  For example, a mail program might compare the first part of a street address with an integer.  If the integer \"123\" is compared with the string \"123\" the result might be false.  If the integer is first converted to a string, then compared with the number in the street address, it will return true.\nAnother common typecast is converting a floating point number to an integer.  This might be used to perform calculations more efficiently when the decimal precision is unnecessary.  However, it is important to note that when typecasting a floating point number to an integer, many programming languages simply truncate the decimal value.  This is demonstrated in the C++ function below.\nint float_to_int(float a) &nbsp; \/\/ example: a = 2.75\n{\n&nbsp; &nbsp; int b = (int)a; &nbsp; \/\/ typecast float to int\n&nbsp; &nbsp; return b; &nbsp; &nbsp; &nbsp; &nbsp; \/\/ returns 2\n}\nIn order to round to the nearest value, adding 0.5 to the floating point number and then typecasting it to an integer will produce an accurate result.  For example, in the function below, both 2.75 and 3.25 will get rounded to 3.\nint round_float_to_int(float a) &nbsp; \/\/ example: a = 2.75\n{\n&nbsp; &nbsp; int b = (int)(a+0.5); &nbsp; \/\/ typecast float to int after adding 0.5\n&nbsp; &nbsp; return b; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \/\/ returns 3\n}\nWhile most high-level programming languages support typecasting, each language uses its own method to convert data.  Therefore, it is important to understand how the language converts between data types when typecasting variables."
        ]
    },
    {
        "word": "Typeface",
        "type": [],
        "definition": [
            "A typeface is a set of characters of the same design.  These characters include letters, numbers, punctuation marks, and symbols.  Some popular typefaces include Arial, Helvetica, Times, and Verdana.  While most computers come with a few dozen typefaces installed, there are thousands of typefaces available.  Because they are vector-based (not bitmaps), typefaces can be scaled very large and still look sharp.  The term \"typeface\" is often confused with \"font,\" which is a specific size and style of a typeface.  For example, Verdana is a typeface, while Verdana 10 pt bold is a font.  It's a small difference, but is good to know."
        ]
    }
]