[
    {
        "word": "U",
        "type": [],
        "definition": [
            "U is the standard unit of measurement for rack-mounted equipment.  Racks can be used to house servers, hard drives, switches, routers, and other computer hardware.  They are also used for mounting audio and video equipment.  Standard racks are 24 inches wide, but vary in height.  For this reason, the U unit measures how tall a rack-mountable hardware device is.\n1U is equal to 1.75 inches.  Therefore, a 1U piece of equipment is 1.75 inches tall and takes up one unit of rack space.  A 2U device is 3.5 inches tall and takes up 2 units of rack space.  Racks themselves are also measured in U.  For example, a 10U rack could store 10 1U devices or 5 2U devices.  It could also store 3 3U devices, with just enough space left over for your miniature Star Wars action figure."
        ]
    },
    {
        "word": "UAT",
        "type": [],
        "definition": [
            "Stands for \"User Acceptance Testing.\"  UAT is a process designed to help ensure products will meet user expectations when they are released.  It involves running a product through a series of specific tests that help indicate whether or not the product will meet the needs of its users.  While the user acceptance testing process can be applied to any type of product, in the computer industry, it is most often associated with software programs.\nSoftware applications typically go through multiple development stages before being released to the general public.  These stages include the initial development process, the alpha testing stage, the beta testing stage, the release candidate stage, and the public release of the software.  Not every software program goes through each one of these stages, but most software programs are tested by multiple users before they are released.\nThe primary UAT stages of software development include the alpha and beta testing stages.  In the alpha testing stage, a limited number of users within (and possibly outside) a company test an early version of software for bugs and user interface issues.  In the beta testing stage, a larger group of users (usually outside the company) test the software and provide feedback, including bug reports and usability issues.  This feedback lets the software company know if the product is meeting user expectations and enables the development team to make the necessary revisions before the official release.\nBecause software is relatively easy to modify and update (unlike hardware products), user acceptance testing may continue even after a software program is released.  Many programs now include feedback and bug submission forms directly within the software, which allow users to provide feedback as they use the software."
        ]
    },
    {
        "word": "UDDI",
        "type": [],
        "definition": [
            "Stands for \"Universal Description Discovery and Integration.\"  UDDI is a protocol that allows businesses to promote, use, and share services over the Internet.  It is an OASIS Standard, which is supported by several major technology companies.  Members include Microsoft, Cisco, Oracle, Avaya, Sun Microsystems, and others.\nThe UDDI protocol serves as a foundational tool that allows businesses to find each other and complete transactions quickly and easily.  Companies that use the UDDI protocol can extend their market reach and find new customers while also finding other businesses that offer useful services to them.  Because UDDI uses a standard format for describing business services, it is easy to search and find useful services offered from other businesses."
        ]
    },
    {
        "word": "UDP",
        "type": [],
        "definition": [
            "Stands for \"User Datagram Protocol.\"  It is part of the TCP\/IP suite of protocols used for data transferring.  UDP is a known as a \"stateless\" protocol, meaning it doesn't acknowledge that the packets being sent have been received.  For this reason, the UDP protocol is typically used for streaming media.  While you might see skips in video or hear some fuzz in audio clips, UDP transmission prevents the playback from stopping completely."
        ]
    },
    {
        "word": "UEFI",
        "type": [],
        "definition": [
            "Stands for \"Unified Extensible Firmware Interface.\"  UEFI is an interface that loads near the beginning of the boot sequence and provides custom configuration options for a PC.  It is considered the successor to BIOS and offers many advantages, including mouse support, a graphical user interface, and support for 32-bit and 64-bit systems.\nUEFI is a standardized version of the original Extensible Firmware Interface (EFI) specification developed by Intel.  It is managed by the Unified Extensible Firmware Interface Forum, comprised of more than 250 member companies.  The standardized UEFI specifications are designed to ensure that components from different hardware manufacturers can be recognized and controlled via the UEFI.\nAccessing the UEFI\nThe UEFI is designed for advanced users, so by default it is not displayed during the startup process.  The standard way to load the UEFI on most Windows PCs is to press the F2 key when the computer is starting up.  Typically, you should press the key when the manufacturer's logo (such as \"Dell\" or \"HP\") appears.  In Windows 8 and 10, you can also use the Troubleshoot option to enable \"UEFI Firmware Settings\" before the next restart.\nConfiguration options provided in the UEFI vary depending on the manufacturer and computer model.  Typically, you can perform administrator tasks like formatting and partitioning storage devices.  You may also be able to change your boot disk and activate or deactivate specific peripherals.  Some systems even allow you to overclock your CPU or run your PC in a low-power \"eco-friendly\" mode.\nWarning: Since the UEFI gives you administrative control over low-level settings, it is possible to make changes that may harm your computer.  Therefore, use discretion when making any changes within the UEFI.  If the computer does not function correctly after starting up (e.g., the fans run too fast), you can restart and use the UEFI to revert your changes.\nNOTE: Intel-based Macs use EFI to manage the hardware configuration, but the UEFI is not available at startup."
        ]
    },
    {
        "word": "UGC",
        "type": [],
        "definition": [
            "Stands for \"User Generated Content.\"  In the early years of the Web, most websites were static, meaning each page had fixed content that did not change unless it was updated by the webmaster.  As the Web evolved, dynamic websites, which generate content from a database, became the norm.  Now, in the Web 2.0 era, many websites now include UGC, or content created by visitors.\nMany different types of websites contain user generated content.  One example is a Web forum, which allows users to discuss topics by posting comments online.  Another example is a wiki, which allows users to directly add and edit website content.  Wikipedia, for instance, contains information written and submitted by thousands of authors around the world.  Social networking websites like Facebook and LinkedIn, are also UGC websites that allow users to create personal profiles and share information with each other.  These websites simply create a platform for users to add and share content with each other.\nWhile wikis, Web forums, and social networking websites contain nearly all user generated content, many other sites now contain both original content and UGC.  For example, blogs often include a section where visitors can post comments about the author's articles.  News websites typically allow visitors to post their feedback below the news stories.  Often, these hybrid pages eventually contain more user generated content than original content.  Thanks to UGC, the Web is now a more interactive medium, allowing users to actively participate in the creation of website content."
        ]
    },
    {
        "word": "UICC",
        "type": [],
        "definition": [
            "Stands for \"Universal Integrated Circuit Card.\"  A UICC is a \"smart card\" designed to operate with 3G and 4G wireless technologies, including LTE.  It can be used for multiple applications, but is commonly used as a SIM card in mobile phones.  UICCs have mostly replaced ICCs (Integrated Circuit Cards), which were used with 2G and early 3G systems.\nA UICC is a tiny card, smaller than a thumbnail, that includes an integrated circuit.  This circuit contains a processor, non-volatile memory (NVRAM), ROM, and RAM.  Each card has a unique identifier that is used to identify a device on a cellular network.  The card may also store data, such as contacts that have been saved by the user.  While there is no standard storage capacity for UICCs, they commonly have at least 256 kilobytes of storage and may exceed one gigabyte.\nUICCs are \"universal\" since a single card supports multiple applications and therefore multiple cellular networks.  Examples include USIM (Universal Subscriber Identity Module) for GSM networks, CSIM (CDMA Subscriber Identity Module) for CDMA networks, and ISIM (IP Multimedia Services Identity Module) for UMTS networks.  The universal nature of UICCs allow them to work with various mobile networks around the world.\nNOTE: In order to use a UICC, the card's unique identifier (the ICC ID) must be registered and activated with a mobile service provider.  Removing the card from a smartphone or other cellular device will make the device unrecognizable on the network.  In most cases, if you insert the UICC card in another device, it will be automatically be recognized and usable on the network."
        ]
    },
    {
        "word": "UML",
        "type": [],
        "definition": [
            "Stands for \"Unified Modeling Language.\"  This is a programming language that is used for object-oriented software development.  To organize program code more efficiently, programmers often create \"objects\" that are sets of structured data within programs.  UML, which has been standardized by the Object Management Group (OMG), was designed for this purpose.  The language has gained enough support that it has become a standard language for visualizing and constructing software programs."
        ]
    },
    {
        "word": "UNC",
        "type": [],
        "definition": [
            "Stands for \"Universal Naming Convention,\" not just the home of the North Carolina Tar Heels.  UNC is a filename format that is used to specify the location of files, folders, and resources on a local-area network (LAN).  The UNC address of a file may look something like this:\n\\\\server-name\\directory\\filename\nUNC can also be used to identify peripheral devices shared on the network, including scanners and printers.  It provides each shared resource with a unique address.  This allows operating systems that support UNC (such as Windows) to access specific resources quickly and efficiently."
        ]
    },
    {
        "word": "UPC",
        "type": [],
        "definition": [
            "Stands for \"Universal Product Code.\"  A UPC is a 12-digit identifier that includes a number and a barcode.  It uniquely identifies products sold through retailers.  UPCs are used in the United States, though other countries around the world use similar codes.  For example, products from European counties use a 13-digit barcode called an EAN or \"European Article Number\" that is compatible with most UPC scanners.\nA UPC contains a sequence of black vertical bars that represent the twelve digits printed below the barcode.  These bars can be scanned by a laser device or camera that quickly reads and interprets the sequence into the corresponding 12-digit number.  When you check out at a retail store, the UPC is used to identify and record each item you purchase.\nThe first digit in a UPC code represents the country of origin (0 for the United States) and the next five digits identify the manufacturer.  Digits 7 through 11 identify the specific product.  The twelfth digit serves as checksum, which checks the validity of the preceding 11 numbers.\nUPCs vs Other Product Identifiers\nSKUs\nUPCs and SKUs both identify specific products, but UPCs — as the name implies — are more universal.  Manufacturers must apply for a range of UPCs, which identify their products globally for distribution by any retailer.  SKUs can be generated by any retailer as an alternative to UPCs.  They provide retailers with a custom means of identifying products they sell.\nProduct IDs\nUPCs and product IDs (PIDs) both uniquely identify products, but product IDs are generated by each manufacturer.  PIDs allow manufacturers to keep records of their products using their own IDs rather than universal product codes.  Many products have both the UPC and product ID printed on the label.\nSerial Numbers\nWhile UPCs identify products, serial numbers (SNs) identify each individual item manufactured.  For example, a specific type of wireless bluetooth headphones may have a single UPC, but each item sold will have a unique serial number.  The serial number allows manufacturers to keep records of each item they sell."
        ]
    },
    {
        "word": "UPS",
        "type": [],
        "definition": [
            "Stands for \"Uninterruptible Power Supply.\"  In the technology world, UPS is more than just a brown shipping company.  It is also a type of power supply that uses battery backup to maintain power during unexpected power outages.\nA typical consumer UPS is a surge protector that contains a high-capacity rechargeable battery.  Smaller UPS devices look like bulky power strips, while larger ones may stand upright and look almost like small computers.  Many businesses use uninterruptible power supplies to keep their equipment running in case of a power failure.  While a UPS may only keep a computer running for 15 minutes after the power is lost, it is usually sufficient time to save all necessary documents and properly shut down the computer.  That extra time can be invaluable to someone who is working on an important document or project that has not been recently saved.\nBecause UPS devices run the power through a battery, they have a limit on the wattage load they can support.  The maximum power load limit is often included in the name of the UPS, followed by the letters \"VA.\"  For example, the APC (American Power Conversion) Battery Backup 750VA has a load limit of 750VA.  However, the maximum wattage a UPS supports is typically 60% of the VA number.  So the 750VA UPS supports a maximum of 450 watts for connected devices.  It is important to check how many total watts your computer setup uses before buying a UPS to make sure you get one with enough wattage so you don't overload it."
        ]
    },
    {
        "word": "UPnP",
        "type": [],
        "definition": [
            "Stands for \"Universal Plug and Play.\"  Plug and Play describes devices that work with a computer system as soon as they are connected.  UPnP is an extension of this idea that expands the range of Plug and Play devices to networking equipment.  Universal Plug and Play uses network protocols to allow a wide range of devices to be interconnected and work seamlessly with each other.\nUPnP devices can be connected via wired (i.e. Ethernet and Firewire) or wireless (i.e. Wi-Fi and Bluetooth) connections.  As long as a product supports UPnP, it can communicate with other UPnP devices within a network.  The connections are typically created using the DHCP networking protocol, which assigns each connected device a unique IP address.\nWhile UPnP is helpful for setting up networks, it also can be used to set up compatible audio and video (AV) devices.  UPnP AV is a group of standards based on UPnP that allows audio and video components to be connected via network connections.  This enables media files and streaming data to be sent between devices.  For example, a movie stored on a hard drive in a bedroom could be played back on the TV screen in the living room.  The central controller of a UPnP AV network is called a MediaServer and can be run from a Macintosh, Windows, or Linux computer or from a hardware device specifically designed to manage the network.\nSince most UPnP devices support zero-configuration setup (like ordinary Plug and Play devices), it is simple to add devices to a network and use them immediately.  While the networking terms associated with UPnP can be a bit intimidating, setting up a UPnP network is meant to be hassle-free ? and that is a term we can all appreciate."
        ]
    },
    {
        "word": "URI",
        "type": [],
        "definition": [
            "Stands for \"Uniform Resource Identifier.\"  A URI identifies the name and location of a file or resource in a uniform format.  It includes a string of characters for the filename and may also contain the path to the directory of the file.  URIs provide a standard way for resources to be accessed by other computers across a network or over the World Wide Web.  They are used by software programs such as Web browsers and P2P file-sharing programs to locate and download files.\nURIs are similar to URLs in that they specify the location of a file.  However, a URI may refer to all or part a URL.  For example, Apple's iMac Design URL is http:\/\/www.apple.com\/imac\/design.html.  The URI of this resource may be defined as just \"design.html\" or \"\/imac\/design.html.\"  These are called relative URIs since they identify the resource relative to a specific location.  The complete URL would be referred to as an absolute URI.\nBecause URLs and URIs are similar, they are often used interchangeably.  In most cases, this is acceptable since the two terms often refer to the same thing.  The difference is that a URI can be used to describe a file's name or location, or both, while a URL specifically defines a resource's location."
        ]
    },
    {
        "word": "URL",
        "type": [],
        "definition": [
            "Stands for \"Uniform Resource Locator.\"  A URL is the address of a specific webpage or file on the Internet.  For example, the URL of the TechTerms website is \"http:\/\/techterms.com.\"  The address of this page is \"http:\/\/techterms.com\/definition\/url\" and includes the following elements:\n\nhttp:\/\/ – the URL prefix, which specifies the protocol used to access the location\ntechterms.com – the server name or IP address of the server\n\/definition\/url – the path to the directory or file\n\nWhile all website URLs begin with \"http,\" several other prefixes exist.  Below is a list of various URL prefixes:\n\nhttp – a webpage, website directory, or other file available over HTTP\nftp – a file or directory of files available to download from an FTP server\nnews – a discussion located within a specific newsgroup\ntelnet – a Unix-based computer system that supports remote client connections\ngopher – a document or menu located on a gopher server\nwais - a document or search results from a WAIS database\nmailto - an email address (often used to redirect browsers to an email client)\nfile - a file located on a local storage device (though not technically a URL because it does not refer to an Internet-based location)\n\nYou can manually enter a URL by typing it in the address bar of your web browser.  For example, you might enter a website URL printed on a business card to visit the company's website.  Most URLs, however appear automatically when you click on a link or open a bookmark.  If the server name in the URL is not valid, your browser may display a \"Server not found\" error.  If the path in the URL is incorrect, the server may respond with a 404 error.\nNOTE: URLs use forward slashes to denote different directories and cannot contain spaces.  Therefore, dashes and underscores are often used to separate words within a web address.  If your browser produces an error when you visit a specific webpage, you can double-check the URL for typos or other errors.  If you find an error, you can manually edit the URL and press Enter to see if it works."
        ]
    },
    {
        "word": "USB",
        "type": [],
        "definition": [
            "Stands for \"Universal Serial Bus.\"  USB is the most common type of port found on modern computers.  It is used to connect various peripherals, such as keyboards, mice, game controllers, printers, scanners, and external storage devices.\nUSB provides both data transmission and low voltage (5V) power over a single cable.  Devices that require five volts or less can operate over USB without an external power source.  A single USB bus supports up to 127 devices, using multiple USB hubs.\nPeripherals that require significant power, such as external hard drives, may require a powered USB hub, which connects to its own power source.\nUSB has gone through many evolutions since its introduction in 1997.  There are now several different versions and different types of USB connectors:\n\nBelow are different USB standards and their corresponding ports and maximum data transfer rates.  The port colors listed below are common but are not required and may differ between manufacturers.\n\nUSB 1.0 (white USB-A and USB-B — very rare) &rarr; 1.5 Mbps\nUSB 1.1 (white USB-A and USB-B, Mini-USB) &rarr; 12 Mbps \nUSB 2.0 (black USB-A and USB-B, Mini-USB, Micro-USB) &rarr; 480 Mbps\nUSB 3.0 \/ SuperSpeed (blue USB-A and USB-B, Micro-USB B) &rarr; 5 Gbps\nUSB 3.1 \/ SuperSpeed+ (green USB-A and USB-B, USB Type C) &rarr; 10 Gbps\nUSB 3.2 (USB Type C) &rarr; 20 Gbps\nUSB 4 (USB Type C) &rarr; 40 Gbps\n\nSince USB devices, ports, and cables all use the same underlying USB communications standard, they are often compatible with physical adapters.  However, when combining USB standards, the data transfer speed is limited to the lowest standard in the connection."
        ]
    },
    {
        "word": "USB-C",
        "type": [],
        "definition": [
            "Stands for \"Universal Serial Bus Type-C.\" USB-C is a type of USB connector that was introduced in 2015.  It supports USB 3.1, which means a USB-C connection can transfer data up to 10 Gbps and send or receive up to 20 volts or 100 watts of power.  Unlike the previous USB Type-A and USB Type-B ports, the USB-C port is symmetrical, which means you never have to worry about plugging in the cable the wrong way.\nThe USB-C connector is the most significant change to the USB connector since the USB interface was standardized in 1996.  USB 1.1, 2.0, and 3.0 all used the same flat, rectangular USB-A connector.  While there have been several variations of USB-B, such as Mini-USB and Micro-USB, they are all designed for peripheral devices, which connect to a Type-A port on the other end.  The Type-C connector introduced with USB 3.1 is designed to be the same on both ends.\nThere is no mini or micro version of USB-C, since the standard USB-C connector is about the same size of a Micro-USB connector.  This means it can be used in small devices like smartphones and tablets.  Since USB-C supports up to 100 watts of power, it can also be used as the power connector for laptops.  In fact, the first laptops to include USB-C ports – the 2015 Apple MacBook and Google Chromebook Pixel – do not include power connectors.  Instead, the power cable connects directly to the USB-C port.\nA USB-C connector will only fit in a USB-C port, but USB-C cables are backwards-compatible with other USB standards.  Therefore, a USB-C to USB-A or USB-C to USB-B adapter can be used to connect older USB devices to a USB-C port.  However, the data transfer rate and wattage will be limited to the lower standard."
        ]
    },
    {
        "word": "UTF",
        "type": [],
        "definition": [
            "Stands for \"Unicode Transformation Format.\"  UTF refers to several types of Unicode character encodings, including UTF-7, UTF-8, UTF-16, and UTF-32.\n\nUTF-7 - uses 7 bits for each character.  It was designed to represent ASCII characters in email messages that required Unicode encoding.\nUTF-8 - the most popular type of Unicode encoding.  It uses one byte for standard English letters and symbols, two bytes for additional Latin and Middle Eastern characters, and three bytes for Asian characters.  Additional characters can be represented using four bytes.  UTF-8 is backwards compatible with ASCII, since the first 128 characters are mapped to the same values.\nUTF-16 - an extension of the \"UCS-2\" Unicode encoding, which uses two bytes to represent 65,536 characters.  However, UTF-16 also supports four bytes for additional characters up to one million.\nUTF-32 -  a multibyte encoding that represents each character with 4 bytes.\n\nMost text in documents and webpages is encoded using one of the UTF encodings above.  Many word processing programs do not allow you to view the character encoding of open documents, though some display the encoding on the bottom of the document window or within the file properties.  If you want to see the type of character encoding used by a webpage, you can select View &rarr; View Source to view the HTML of the page.  The character encoding, if defined, will be in the header section, near the top of the HTML.  A page that uses UTF-8 encoding may include one of the following text snippets below, depending on the version of the HTML.\nXHTML: &nbsp;&lt;meta http-equiv=\"Content-Type\" content=\"text\/html; charset=utf-8\" \/&gt;\nHTML 5: &lt;meta charset=\"UTF-8\"&gt;"
        ]
    },
    {
        "word": "UUID",
        "type": [],
        "definition": [
            "Stands for \"Universally Unique Identifier.\"  A UUID is a 128-bit number used to identify a unique object on a computer system.  Examples include objects in software programs, parameters in URLs, and labels of individual hardware devices.\nMost UUIDs are represented in hexadecimal notation, using 32 characters, separated by four hyphens.  Below is an example UUID:\n90f51180-158b-11eb-adc1-0242ac120003\nWhile there are several ways to generate a UUID, the first string of characters are typically based on the timestamp (the current time) of the host system.   The first UUID standard (version 1), commonly used in the 1990s, had the following format:\n\nfirst 8 characters - \"low\" 32 bits of the timestamp\nnext 4 characters - \"middle\" 16 bits of the timestamp\nnext 4 characters - \"high\" 16 bits of the timestamp\nnext 4 characters - 16-bit \"variant\" in the clock sequence\nfinal 12 characters - 48-bit host ID\n\nCombining a random 48-bit host ID with a 64-bit timestamp and a 16-bit \"variant\" value makes it almost impossible for two UUIDs to be identical.  Using the fourth version of the UUID standard (UUID4), the chances of generating two equal UUIDs is 1 in 1037.  Even if millions of UUIDs are generated every second, it is unlikely a duplicate UUID will be created for several decades.\nUUID vs GUID\nIn most cases, UUID and GUID are synonymous.  A GUID (Globally Unique Identifier) has the same number of digits and the same format as a UUID.  However, Microsoft often uses the term GUID (rather than UUID) to refer to unique identifiers on Windows devices.  The Microsoft .NET Framework includes the function NewGuid(), which generates a GUID within a software program."
        ]
    },
    {
        "word": "UWP",
        "type": [],
        "definition": [
            "Stands for \"Universal Windows Platform.\"  UWP is an application development platform created by Microsoft.  A UWP app can run on multiple devices, including Windows PCs, tablets, and smartphones.  Some UWP apps can run on other types of Microsoft hardware including Xbox, HoloLens, and IoT devices.\nUWP provides a common platform for developers to build apps for multiple types of hardware.  The Universal Windows Platform API includes a wide range of libraries, functions, and user interface elements developers can integrate into their apps.  By including multiple DeviceFamily types in a UWP app, a developer can customize the interface of the app for several types of devices.\nMicrosoft Visual Studio 2015 and later supports the UWP API and provides developers with a flexible multiplatform development environment.  While the API is implemented in C++, UWP apps can be written in C++, C#, Visual Basic, or even JavaScript.  The Microsoft Visual Studio IDE will compile the code as a UWP app if Windows.Universal is set as the target device family.\nUWP and the Microsoft Store\nWhen the Microsoft Store (formerly the Windows Store) launched in 2012, developers could only submit UWP apps.  Programs built on earlier platforms, such Windows Forms and WPF, were not allowed.  To expand the range of apps available on the Store, Microsoft later created \"Desktop Bridge,\" which allows developers to package non-UWP apps for the Microsoft Store.\nNOTE: UWP was introduced with Windows 10 and is not backwards compatible.  Therefore, UWP apps will only run on PCs running Windows 10 and later, as well as other supported devices."
        ]
    },
    {
        "word": "Ultra DMA",
        "type": [],
        "definition": [
            "This technology for transferring data between a computer's hard disk and memory was developed by Quantum and Intel.  The maximum burst rate of an Ultra DMA hard drive is 33.3 MBps.  The original DMA (Direct Memory Access) protocol could only transfer data at half that speed.\nThanks to Ultra DMA, programs can open faster and run more smoothly.  This is because Ultra DMA can send more data to the memory in less time than the original DMA.  Ultra DMA also has a built-in utility called Cyclical Redundancy Checking (CRC) that helps protect data integrity.  So if you want a nice, fast hard drive, look for one that supports Ultra DMA."
        ]
    },
    {
        "word": "Ultrabook",
        "type": [],
        "definition": [
            "Ultrabook™ is an Intel trademark that describes a laptop specification.  Notably, ultrabooks have an Intel CPU, SSD storage, and a thin unibody frame.  They have a maximum height (when closed) and therefore do not have an optical drive, such as a DVD player.\nThe initial Ultrabook spec was announced in 2011, which included an Intel \"Sandy Bridge\" processor, a maximum height of 21mm, 5-hour battery life, a maximum 7-second resume-from-hiberation time, and Intel's Anti-Theft Technology.  The 2012 update required a minimum \"Ivy Bridge\" Intel processor, USB 3.0 or Thunderbolt ports, and a minimum data transfer rate of 80 MBps.  The 2013 Ultrabook update increased the minimum processor to a \"Haswell\" Intel processor and required 6 hours of high-definition video playback.\nAs with many trademarked terms, \"Ultrabook\" is often used generically.  For example, many people refer to thin and lightweight laptops as ultrabooks.  However, an Ultrabook only refers to laptops that meet Intel's specifications.\nSince laptops have gotten thinner and most no longer have optical drives, Ultrabooks are not as exclusive as they once were.  However, if you are shopping for a new laptop, it can still be helpful to check if the laptop meets the requirements of an Ultrabook."
        ]
    },
    {
        "word": "Undo",
        "type": [],
        "definition": [
            "Undo is a command included in most software programs.  It is typically located at the top of the Edit menu and has the standard shortcut \"Control+Z\" in Windows and \"Command-Z\" in Mac OS X.  The Undo command allows you to undo the last action you performed in the program.  Many programs also include a \"multiple undo\" feature, which allows several actions to be undone in series.  You can typically reverse an \"Undo\" command by selecting \"Redo\" from the Edit menu.\nThe Undo command can undo a wide variety of actions, depending on the program.  For example, in a word processor, Undo is often used to delete a recently typed section of text.  However, you can also undo a deletion, the pasting of an object, or a change made to the page formatting settings.  In an image editing program, you can undo a paintbrush stroke, a selection, the moving of an object, and many other actions.  Modern operating systems allow you to undo moving and renaming files.\nUndo is a convenient feature, which can save a lot of time and frustration for those of us who are not perfect and occasionally make mistakes.  Perhaps that's why the shortcut was designed to be so easy to use (Z is right next to the Control and Command keys).  So, whenever you make a mistake while using a program, just enter the Undo shortcut and the mistake is gone.  If only the Undo command could be used in other areas of life as well."
        ]
    },
    {
        "word": "Unfriend",
        "type": [],
        "definition": [
            "When you \"friend\" a user on a social networking website, you add that person to your list of online friends.  When you remove a person from your friend list, you \"unfriend\" that user.\nUnfriending may be done for many reasons.  For example, if an online friend is contacting you too often or writing on your wall too much, you may want to remove that user from your list of friends.  You may also wish to unfriend a user if a relationship with that person has ended.  When you unfriend someone, that person no longer has \"friend\" access to your profile page.  This means he or she may no longer be able to view your profile or post comments on your wall.  You can customize these options for friends and non-friends in Facebook using the \"Privacy Settings\" link.\nSome situations may require a \"mass unfriending,\" which involves removing many people from your friend list at one time.  Many MySpace and Facebook users have hundreds or even thousands of friends, though most of these people are not close friends in real life.  Since users with \"friend\" status can view your personal profile data, it might make sense to unfriend users that you don't know."
        ]
    },
    {
        "word": "Unicast",
        "type": [],
        "definition": [
            "A unicast is a real-time data transmission from a single sender to one recipient.  Examples include a video stream, audio stream, or online presentation shared with a single user over the Internet.  It is considered \"one-to-one\" communication since there are only two parties involved.  \nUnicasting is often contrasted with multicasting and broadcasting — both of which are \"one-to-many\" forms of communication.  Multicasts send data to a specific set of users, while broadcasts do not have a defined number of recipients.  Broadcasting is the most common, while unicasting is the least common.\nUnicasting Misconceptions\nA unicast is a type of cast — the real-time distribution of content.  However, the term \"unicasting\" is sometimes used to describe point-to-point data transfers, such as a file download, and bi-directional communication, such as a phone call.  These are both forms of one-to-one communication, but they are not types of casting."
        ]
    },
    {
        "word": "Unicode",
        "type": [],
        "definition": [
            "Unicode is a universal character encoding standard.  It defines the way individual characters are represented in text files, web pages, and other types of documents.\nUnlike ASCII, which was designed to represent only basic English characters, Unicode was designed to support characters from all languages around the world.  The standard ASCII character set only supports 128 characters, while Unicode can support roughly 1,000,000 characters.  While ASCII only uses one byte to represent each character, Unicode supports up to 4 bytes for each character.\nThere are several different types of Unicode encodings, though UTF-8 and UTF-16 are the most common.  UTF-8 has become the standard character encoding used on the Web and is also the default encoding used by many software programs.  While UTF-8 supports up to four bytes per character, it would be inefficient to use four bytes to represent frequently used characters.  Therefore, UTF-8 uses only one byte to represent common English characters.  European (Latin), Hebrew, and Arabic characters are represented with two bytes, while three bytes are used to Chinese, Japanese, Korean, and other Asian characters.  Additional Unicode characters can be represented with four bytes."
        ]
    },
    {
        "word": "Unix",
        "type": [],
        "definition": [
            "Also known as UNIX, though the letters do not stand for anything.  The Unix operating system was first created in Bell Labs way back in the 1960s.  It became popular in the 1970s for high-level computing, but not on the consumer level.  Since a lot of Internet services were originally hosted on Unix machines, the platform gained tremendous popularity in the 1990s.  It still leads the industry as the most common operating system for Web servers.\nStill, Unix remains somewhat of an ambiguous operating system, as there are many different versions of it.  Some examples include Ultrix, Xenix, Linux, and GNU, which, making things even more confusing, all run on a number of different hardware platforms.  Most people do not ever need to use Unix, but computer geeks seem to have the need to use it as much as possible."
        ]
    },
    {
        "word": "Unmount",
        "type": [],
        "definition": [
            "Unmounting a disk makes it inaccessible by the computer.  Of course, in order for a disk to be unmounted, it must first be mounted.  When a disk is mounted, it is active and the computer can access its contents.  Since unmounting a disk prevents the computer from accessing it, there is no risk of the disk being disconnected in the middle of a data transfer.  Therefore, before removing an external data storage device, such as a USB flash drive, the disk should be unmounted to avoid possible data corruption.\nSeveral types of disks can be unmounted, including external hard drives, USB flash drives, iPods, flash memory cards, and disk images.  In order to unmount a disk in Windows, open \"My Computer,\" select the disk, and click the \"Eject this disk\" option in the left sidebar.  In Mac OS X, select the disk on the desktop and either drag the disk to the trash (which changes to an Eject icon), or select \"File&rarr;Eject\" from the Finder's menu bar.  Once a removable disk has been unmounted, it can safely be disconnected from the computer."
        ]
    },
    {
        "word": "Uplink Port",
        "type": [],
        "definition": [
            "An uplink port is a port on a router or switch designed to connect to another router or switch or an Internet access device.  Most home routers include an uplink port for connecting a cable or DSL modem.\nAn uplink port looks like a standard Ethernet port, which is a female jack for an RJ45 connector.  However, there are two primary differences between the uplink port and other ports on a router or switch:\n\nThe uplink port reverses the transmit and receive connectors.\nThe uplink port may support more bandwidth than the other Ethernet ports.\n\nConnector Reversal\nWhen you connect a desktop computer or laptop to a standard port on a router, the Transmit pins from the Ethernet cable connect directly to the Receive pins inside the port.  This is known as a \"straight-through\" connection since the data simply passes through the router.  Similarly, the Transmit pins inside the port connect directly to the Receive pins on the connected Ethernet cable.\nWhen attaching a router to a cable modem, switch, or another router, the Receive and Transmit terminals must be altered to function correctly.  One option is to use a \"crossover cable,\" which reverses four of the eight wires.  Another option is to use an uplink port, which does this automatically.\nGreater Bandwidth\nMany routers and switches provide extra bandwidth through the uplink port to avoid data congestion.  For example, a router may have four 1 Gbps Ethernet ports and one 2.5 Gbps uplink port.  A switch may have sixteen 1 Gbps Ethernet ports and one 10 Gbps uplink port.\nSince all incoming and outgoing traffic flows through the uplink port, it is important that it provides more bandwidth than the rest of the individual ports.  Standard ports rarely use 100% of their maximum bandwidth at the same time, so the uplink port bandwidth is usually less than the combined bandwidth of the rest of the ports.\nUsing the Uplink Port\nMost modern routers have an uplink port on the back.  This port is often labeled \"Internet\" or has a circle icon that indicates it should connect to an Internet device, such as a cable or DSL modem.  On switches, the uplink port is often labeled \"Uplink\" since it often connects to another switch or router.\nNOTE: Some routers support \"Auto-MDIX,\" which detects if a connection is straight-through or crossover.  You can connect a modem to an Auto-MDIX port without a crossover cable, but it may not provide the extra bandwidth of an uplink port."
        ]
    },
    {
        "word": "Upload",
        "type": [],
        "definition": [
            "While downloading is receiving a file from another computer, uploading is the exact opposite.  It is sending a file from your computer to another system.  Pretty straight forward.  It is possible to upload and download at the same time, but it may cause slower transfer speeds, especially if you have a low bandwidth connection.  Because most files are located on Internet servers, people generally do a lot more downloading than uploading."
        ]
    },
    {
        "word": "Uptime",
        "type": [],
        "definition": [
            "Uptime describes how long or how reliably a system has been running.  It may be defined as an absolute value (e.g., 64 days) or a percentage (e.g., 99.5%).  Uptime percentage is a common metric used to determine the reliability of a web server.\nAbsolute uptime measures the length of time a system has been running since it was booted.  For example, if a system was rebooted at 1:00 PM and is still running at 3:30 PM the next day, its uptime will be 26.5 hours.  When a system is restarted, the uptime number resets.\nOn a Unix-based system (including macOS), you can view the system uptime by typing the uptime command in the terminal.\nUptime percentage is determined by dividing the total time has been available (or online) by the time it has been active.  For example, if a web server has been active for one year, but was not available for a total of 32 hours during the year, its uptime percentage would be calculated as follows:\n365 days x 24 hours = 8,760 active hours\n8,760 active hours - 32 hours unavailable = 8,728 available hours\n8,728 available hours ÷ 8,760 active hours = 99.6347% uptime\nAn uptime of 99.9% is a reasonable goal for a web server.  That percentage may sound high, but even a few hours of downtime can have a significant impact on a business.  For this reason, a high-traffic enterprise server may have an uptime goal of 99.999%.  This level of uptime can be achieved by using multiple servers for redundancy and load balancing."
        ]
    },
    {
        "word": "Usenet",
        "type": [],
        "definition": [
            "Usenet is collection of online discussions that are organized into newsgroups.  Users may create their own discussion topics or contribute to existing threads within a topic.  Some newsgroups provide forums for questions and answers, while others are designed primarily for file sharing.\nUsenet started in 1980 as a medium for discussing topics online, similar to a bulletin board system (BBS).  However, instead of being hosted on a single server, Usenet newsgroups were hosted on hundreds of servers across the world.  As the Internet grew in popularity, so did Usenet, extending online discussions to countries around the globe.\nWhile Usenet was designed for text-based discussions, it evolved to support file sharing as well.  Today, Usenet is commonly used to distribute files (or \"binaries\" since the files may contain any type of binary data).  Examples include videos, songs, pictures, and software programs.  Usenet downloads commonly have an .NZB extension, which is an XML file that describes one or more locations where the actual file can be downloaded.\nUsenet data is transmitted over the Network News Transfer Protocol.  Access to Usenet is available through a number of different Usenet providers, typically for around $10 USD per month.  Examples include Usenet Storm, Newshosting, and Astraweb, among many others.  Some services offer web-based tools to access and contribute to newsgroups, but you can also use a newsreader, such as Newsbin, Agent, and Pan."
        ]
    },
    {
        "word": "User Experience",
        "type": [],
        "definition": [
            "User experience, commonly abbreviated \"UX,\" is the experience a person has using a product or service.  In the technology world, this often refers to a hardware device or software program.  A positive user experience is simple, intuitive, and enjoyable.  A negative user experience is complex, confusing, and frustrating.\nSuccessful companies focus on creating a high-quality user experience.  When a user enjoys using a product, he or she is likely to continue using the product and may recommend it to other people.  Conversely, if a product frustrates a user, he or she may switch to another product and tell others to avoid using it.  Therefore, producing a positive user experience benefits both the company and the end user.\nThe focus of UX design is the user, rather than the product itself.  The goal is to meet or exceed user expectations rather than to simply deliver a product.  A product that provides a positive user experience is:\n\nfunctional\nintutive\neasy-to-use\nreliable\nenjoyable\n\nSoftware UX\nA software application that provides a good UX has an intuitive user interface.  This means a typical user can learn the program by simply using it, rather than reading a manual or taking lessons.  For example, a program with intuitive icons and simple menu bar options may be easy for a new user to understand.  However, if a developer creates a program with non-standard icons and complex menu options, it will make the program less intuitive, likely resulting in a negative user experience.\nWebsite UX\nA website with a good UX is easy to view and simple to navigate.  The font should be easy to read and the content should be clearly separated from any advertisements on the page.  There should not be any unexpected popups or distracting animations on the page.  The navigation should simple, which often includes a navigation bar at the top of the window as well as clear links within the content.  Responsive design can help provide a good UX for both desktop and mobile users.\nIf you want to create a website with a positive user experience, it may help to follow these web design rules.\nUser experience is often associated with information technology, but it applies to all products.  For example, automotive manufacturers strive to create a positive user experience for drivers.  Retail stores aim to provide a positive user experience for customers.  Since user needs and wants are constantly evolving, companies must listen and respond to user feedback.  Successful companies continually update their products and services to meet customer expectations."
        ]
    },
    {
        "word": "User ID",
        "type": [],
        "definition": [
            "A user ID is a unique identifier, commonly used to log on to a website, app, or online service.  It may be a username, account number, or email address.\nMany websites require an email address for the user ID.  This provides two benefits:\n\nIt is a simple way of ensuring you select a unique username.\nIt automatically associates your email address with your account.\n\nSome services require you to choose a user ID that is not your email address.  Instagram and Snapchat, for example, require you to select a custom username for your profile.  Services that require a username and email address may allow you to log in using either identifier, since they are both unique.\nUser ID vs Username\nIn many cases, the terms \"user ID\" and \"username\" are synonymous.  For example, a website may provide a login interface with two fields labeled Username and Password.  Another website may label the two fields as User ID and Password, which refer to the same thing.  Technically, however, usernames are a subset of user IDs, since a user ID may be an email address, number, or other unique identifier that is not necessarily a name."
        ]
    },
    {
        "word": "User Interface",
        "type": [],
        "definition": [
            "A user interface, also called a \"UI\" or simply an \"interface,\" is the means in which a person controls a software application or hardware device.  A good user interface provides a \"user-friendly\" experience, allowing the user to interact with the software or hardware in a natural and intuitive way.\nNearly all software programs have a graphical user interface, or GUI.  This means the program includes graphical controls, which the user can select using a mouse or keyboard.  A typical GUI of a software program includes a menu bar, toolbar, windows, buttons, and other controls.  The Macintosh and Windows operating systems have different user interfaces, but they share many of the same elements, such as a desktop, windows, icons, etc.  These common elements make it possible for people to use either operating system without having to completely relearn the interface.  Similarly, programs like word processors and Web browsers all have rather similar interfaces, providing a consistent user experience across multiple programs.\nMost hardware devices also include a user interface, though it is typically not as complex as a software interface.  A common example of a hardware device with a user interface is a remote control.  A typical TV remote has a numeric keypad, volume and channel buttons, mute and power buttons, an input selector, and other buttons that perform various functions.  This set of buttons and the way they are laid out on the controller makes up the user interface.  Other devices, such as digital cameras, audio mixing consoles, and stereo systems also have a user interface.\nWhile user interfaces can be designed for either hardware of software, most are a combination of both.  For example, to control a software program, you typically need to use a keyboard and mouse, which each have their own user interface.  Likewise, to control a digital camera, you may need to navigate through the on-screen menus, which is a software interface.  Regardless of the application, the goal of a good user interface is to be user-friendly.  After all, we all know how frustrating it can be to use a device that doesn't work the way we want it to."
        ]
    },
    {
        "word": "User Space",
        "type": [],
        "definition": [
            "User space is system memory allocated to running applications.  It is often contrasted with kernel space, which is memory allocated to the kernel and the operating system.\nSeparating user space from kernel space protects the system from errant processes that could use up memory required by the operating system (OS).  The result is a more stable system where memory leaks and program crashes do not affect the OS.  It is an important aspect of sandboxing, which is common in modern operating systems.\nWhen you open an application (or \"excecutable file\"), the OS loads the program and required resources into the user space.  Any plug-ins and required libraries are loaded into the user space as well.  If you open and edit a document, that file will also be temporarily loaded into the user space.  When you save the file, the data is written from the user space to a storage device such as an HDD or SSD.\nNOTE: The more RAM your computer has, the more user space is available.  Having extra RAM allows you to run more applications simultaneously without your computer slowing down because of a memory bottleneck."
        ]
    },
    {
        "word": "User-Friendly",
        "type": [],
        "definition": [
            "User-friendly describes a hardware device or software interface that is easy to use.  It is \"friendly\" to the user, meaning it is not difficult to learn or understand.  While \"user-friendly\" is a subjective term, the following are several common attributes found in user-friendly interfaces.\n\nSimple.  A user-friendly interface is not overly complex, but instead is straightforward, providing quick access to common features or commands.\nClean.  A good user interface is well-organized, making it easy to locate different tools and options.\nIntuitive.  In order to be user-friendly, an interface must be make sense to the average user and should require minimal explanation for how to use it.\nReliable.  An unreliable product is not user-friendly, since it will cause undue frustration for the user.  A user-friendly product is reliable and does not malfunction or crash.\n\nThe goal of a user-friendly product is to provide a good user experience (or \"UX\").  This may look different depending on the end user for whom the product is designed.  For example, a user-friendly kid's game will have a much different interface than a professional CAD program.  However, the rules above apply to both types of software.  Even if a program has many advanced features, it is still possible to make it user-friendly by designing a simple, clean, and intuitive interface.\nUser-friendly products are typically more successful than those with complex, convoluted interfaces that are difficult to use.  Additionally, customers often avoid unreliable products, such as software programs that are full of bugs.  In order to ensure a good user experience, companies often thoroughly test their products before releasing them to the public."
        ]
    },
    {
        "word": "Username",
        "type": [],
        "definition": [
            "A username is a name that uniquely identifies someone on a computer system.  For example, a computer may be setup with multiple accounts, with different usernames for each account.  Many websites allow users to choose a username so that they can customize their settings or set up an online account.  For example, your bank may allow you to choose a username for accessing your banking information.  You may need to choose a username in order to post messages to a certain message board on the Web.  E-mail services, such as Hotmail require users to choose a username in order to use the service.\nA username is almost always paired with a password.  This username\/password combination is referred to as a login, and is often required for users to log in to websites.  For example, to access your e-mail via the Web, you are required to enter your username and password.  Once you have logged in, your username may appear on the screen, but your password is kept secret.  By keeping their password private, people can create secure accounts for various websites.  Most usernames can contain letters and numbers, but no spaces.  When you choose a username for an e-mail account, the part before the \"@\" is your username."
        ]
    },
    {
        "word": "Utility",
        "type": [],
        "definition": [
            "Utility programs, commonly referred to as just \"utilities,\" are software programs that add functionality to your computer or help your computer perform better.  These include antivirus, backup, disk repair, file management, security, and networking programs.  Utilities can also be applications such as screensavers, font and icon tools, and desktop enhancements.  Some utility programs help keep your computer free from unwanted software such as viruses or spyware, while others add functionality that allows you to customize your desktop and user interface.  In general, programs that help make your computer better are considered utilities.  And unlike water and electric bills, computer utilities don't send you a bill every month!"
        ]
    }
]