[
    {
        "word": "VCI",
        "type": [],
        "definition": [
            "Stands for \"Virtual Channel Identifier.\"  The VCI, used in conjunction with the VPI (virtual path indicator), indicates where an ATM cell is to travel over a network.  ATM, or asynchronous transfer mode, is a method that many ISPs (Internet Service Providers) use to transfer data to client computers.  Because ATM sends packets over fixed channels, the data is easier to track than information sent over the standard TCP\/IP protocol.\nThe VCI within each ATM cell defines the fixed channel on which the packet of information should be sent.  It is a 16-bit field, compared to the VPI, which is only 8 bits.  Since this numerical tag specifies the virtual channel that each packet belongs to, it prevents interference with other data being sent across the network."
        ]
    },
    {
        "word": "VDSL",
        "type": [],
        "definition": [
            "Stands for \"Very high bit rate Digital Subscriber Line.\"  VDSL (sometimes called \"VHDSL\") is a DSL standard that provides high speed Internet access.  It is an improved version of ADSL (asymmetric DSL) that offers download speeds of up to 52 Mbps (6.5 megabytes per second) and upload speeds up to 16 Mbps (2 megabytes per second).\nLike previous DSL standards, VDSL operates over copper wires and can be deployed over existing telephone wiring.  This means an ISP can provide VDSL Internet access to users as long as they have a landline and are located within a specific proximity required by the ISP.  The connection is established through a VDSL modem, which connects to a computer or router on one end a telephone outlet on the other.\nVDSL was developed to support the high bandwidth requirements of HDTV, media streaming, and VoIP connections.  By providing downstream transmission rates of over 50 Mbps, VDSL has enough bandwidth to support all of these connections simultaneously.  This fast data transfer rate also allows VDSL to compete with cable Internet providers, which have historically offered faster Internet access speeds.\nThe first version of VDSL (ITU standard G.993.1) was approved in 2004 and is still commonly offered by Internet service providers.  However, an updated version called VDSL2 (ITU standard G.993.2) was introduced in 2006 and offers symmetric download and upload speeds of 100 Mbps.  VDSL2 is typically provided to businesses and other organizations that require high-speed connections for multiple systems."
        ]
    },
    {
        "word": "VDU",
        "type": [],
        "definition": [
            "Stands for \"Visual Display Unit.\"  A VDU displays images generated by a computer or other electronic device.  The term VDU is often used synonymously with \"monitor,\" but it can also refer to another type of display, such as a digital projector.  Visual display units may be peripheral devices or may be integrated with the other components.  For example, the Apple iMac uses an all-in-one design, in which the screen and computer are built into a single unit.\nEarly VDUs were primarily cathode ray tube (CRT) displays and typically had a diagonal size of 13 inches or less.  During the 1990s, 15\" and 17\" displays became standard, and some manufacturers began producing displays over 20\" in size.  At the turn of the century, flat panel displays became more common, and by 2006, CRT displays were hard to find.\nToday, it is common for computers to come with VDUs that are 20\" to 30\" in size.  Thanks to the recent growth in LCD, plasma, and LED technology, manufacturing large screens is much more cost effective than before."
        ]
    },
    {
        "word": "VFAT",
        "type": [],
        "definition": [
            "Stands for \"Virtual File Allocation Table.\"  Older Windows operating systems (Windows ME and earlier) used a file system called \"FAT\" or \"FAT32.\"  The file system is what the operating system uses to organize and access files on the hard drive.  VFAT, introduced with Windows 95, was an improvement to the basic FAT file system, allowing more information to be stored for each file.  While the FAT file system can only store 8 characters for each file name, VFAT allows for file names up to 255 characters in length.  Personally, I use the term VFAT to refer to the size of my cat."
        ]
    },
    {
        "word": "VGA",
        "type": [],
        "definition": [
            "Stands for \"Video Graphics Array.\"  It is the standard monitor or display interface used in most PCs.  Therefore, if a montior is VGA-compatible, it should work with most new computers.  The VGA standard was originally developed by IBM in 1987 and allowed for a display resolution of 640x480 pixels.  Since then, many revisions of the standard have been introduced.  The most common is Super VGA (SVGA), which allows for resolutions greater than 640x480, such as 800x600 or 1024x768.  A standard VGA connection has 15 pins and is shaped like a trapezoid."
        ]
    },
    {
        "word": "VIP",
        "type": [],
        "definition": [
            "Stands for \"Virtual IP Address.\"  A VIP (or VIPA) is a public IP address that may be shared by multiple devices connected to the Internet.  Internally, each device has a unique local IP address, but externally, they all share the same one.\nVIPs are common in home and office networks.  When a device connects to the network, the router assigns it a unique local IP address, typically via DHCP.  Examples of local IP addresses include 192.168.0.2, 192.168.0.3, etc, with the router IP address set to 192.168.0.1.  Some routers use the IP address 10.0.1.1 and assign IP addresses 10.0.1.2, 10.0.1.3, etc.  Local IPs are merged into a single public (or \"virtual\") IP using network address translation (NAT).  The virtual IP address is what identifies the devices on the Internet.\nA VIP often has a one-to-many relationship with devices on a network.  Therefore, multiple devices connected to the same router may have the same IP address on the Internet.\nVIPs are also used by servers.  For example, multiple web servers may share the same IP address, allowing them to distribute requests across multiple machines.  This is useful for load balancing and redundancy, A \"high availability\" server, for instance, may have a single IP address shared by two separate computers."
        ]
    },
    {
        "word": "VLAN",
        "type": [],
        "definition": [
            "Stands for \"Virtual Local Area Network,\" or \"Virtual LAN.\"  A VLAN is a custom network created from one or more existing LANs.  It enables groups of devices from multiple networks (both wired and wireless) to be combined into a single logical network.  The result is a virtual LAN that can be administered like a physical local area network.\nIn order to create a virtual LAN, the network equipment, such as routers and switches must support VLAN configuration.  The hardware is typically configured using a software admin tool that allows the network administrator to customize the virtual network.  The admin software can be used to assign individual ports or groups of ports on a switch to a specific VLAN.  For example, ports 1-12 on switch #1 and ports 13-24 on switch #2 could be assigned to the same VLAN.\nSay a company has three divisions within a single building — finance, marketing, and development.  Even if these groups are spread across several locations, VLANs can be configured for each one.  For instance, each member of the finance team could be assigned to the \"finance\" network, which would not be accessible by the marketing or development teams.  This type of configuration limits unnecessary access to confidential information and provides added security within a local area network.\nVLAN Protocols\nSince traffic from multiple VLANs may travel over the same physical network, the data must be mapped to a specific network.  This is done using a VLAN protocol, such as IEEE 802.1Q, Cisco's ISL, or 3Com's VLT.  Most modern VLANs use the IEEE 802.1Q protocol, which inserts an additional header or \"tag\" into each Ethernet frame.  This tag identifies the VLAN to which the sending device belongs, preventing data from being routed to systems outside the virtual network.  Data is sent between switches using a physical link called a \"trunk\" that connects the switches together.  Trunking must be enabled in order for one switch to pass VLAN information to another.\n4,904 VLANs can be created within an Ethernet network using the 802.1Q protocol, but in most network configurations only a few VLANs are needed.  Wireless devices can be included in a VLAN, but they must be routed through a wireless router that is connected to the LAN."
        ]
    },
    {
        "word": "VLB",
        "type": [],
        "definition": [
            "Stands for \"VESA Local Bus.\"  (VESA stands for \"Video Electronics Standards Association\").  The VLB, or VL-bus is a hardware interface on the computer's motherboard that is attached to an expansion slot.  By connecting a video expansion card to the VLB, you can add extra graphics capabilities to your computer.  The interface supports 32-bit data flow at up to 50 MHz.  Though the VLB architecture was popular in the early 1990s, it has since been replaced by the newer and faster, but still three-lettered, ISA, PCI, and AGP slots."
        ]
    },
    {
        "word": "VLE",
        "type": [],
        "definition": [
            "Stands for \"Virtual Learning Environment.\"  A VLE is a virtual classroom that allows teachers and students to communicate with each other online.  Class information, learning materials, and assignments are typically provided via the Web.  Students can log in to the class website to view this information and may also download assignments and required reading materials to their computers.  Some VLEs even allow assignments and tests to be completed online.\nIn a virtual classroom, the teacher may communicate with the students in real-time using video or Web conferencing.  This type of communication is typically used for giving lectures and for question and answer sessions.  If the teacher only needs to send out a homework assignment, he or she can simply post a bulletin on the class website.  The students may also receive an e-mail notification letting them know a new assignment has been posted.  If class members have questions about the homework, they can participate in online forums or submit individual questions to the teacher.\nVirtual learning environments are a popular method of e-learning, which refers to learning through electronic means.  While a VLE cannot fully replace the traditional classroom, it can be a useful way of teaching students who reside in many different locations."
        ]
    },
    {
        "word": "VPI",
        "type": [],
        "definition": [
            "Stands for \"Virtual Path Identifier.\"  The VPI is an 8-bit header inside each ATM cell that indicates where the cell should be routed.  ATM, or asynchronous transfer mode, is a method of sending data in small packets of fixed sizes.  It is used by many ISPs (Internet Service Providers) for transferring data to client computers.\nAs an ATM cell moves across a network, it typically passes through several ATM switches.  The VPI tells the switches where to route the packet of information, or what path to take.  Hence the name, \"virtual path identifier.\"  The VPI is used in conjunction with the VCI, or virtual channel identifier."
        ]
    },
    {
        "word": "VPN",
        "type": [],
        "definition": [
            "Stands for \"Virtual Private Network.\"  A VPN is a service that provides secure, anonymous Internet access.  It \"tunnels\" your Internet connection from your ISP through one or more VPN servers, which hides your actual IP address and location.\nBesides obfuscating your IP address, most VPNs encrypt your connection to provide extra security.  The encryption encodes all data you send and receive, ensuring no one can eavesdrop on your Internet activity.\nWhile fast VPNs can process and encrypt data in near real-time, it still requires an extra step, which means it may affect your Internet speed.\nMost VPNs work with both desktop and mobile devices.  Some VPN services are free to use, but the highest-quality ones charge a monthly fee.  Generally, paid VPNs are faster and more reliable than free ones.  Examples of VPN providers include:\n\nNordVPN\nExpressVPN\nCyberGhost\nSurfshark\nProtonVPN\n\nNOTE: Businesses may also create private VPNs that employees must use to remotely access sensitive data.  Company-specific VPNs typically require authentication, encrypt all connections, and limit the Internet locations users can access."
        ]
    },
    {
        "word": "VPS",
        "type": [],
        "definition": [
            "Stands for \"Virtual Private Server.\"  A VPS is a server created using software virtualization.  It functions like a physical server, but it is a virtualized instance created within a server.  A single physical machine can host multiple virtual private servers.  A cloud-based VPS may be hosted across multiple servers.\nThe most common type of VPS is a web host.  Many web hosting companies offer VPS hosting solutions as an alternative to shared hosting and dedicated hosting.  A VPS sits in between the two options, usually in both performance and price.  Like a shared host, a VPS may share the resources of a physical machine with other hosting accounts.  However, a VPS is custom-configureable like a dedicated hosting solution it is isolated (\"private\") from other accounts.\nBoth single-machine and cloud-based VPSes are managed using a software program called a hypervisor.  The machine that runs the hypervisor is called the host machine and the individual virtual private servers are called guest machines or guest instances.  The hypervisor can start and stop the virtual machines and allocates system resources, such as CPU, memory, and disk storage to each VPS.\nVirtual private servers have become a popular choice for web hosting because they offer many benefits of dedicated servers at a lower cost.  They also provide the added benefit of easy scalability.  Since each VPS is virtualized, the configuration can be updated with a software modification rather than a hardware upgrade.  Still, dedicated servers often provide better performance since all the resources of the physical machine are dedicated to a single server."
        ]
    },
    {
        "word": "VRAM",
        "type": [],
        "definition": [
            "Stands for \"Video Random Access Memory\" and is pronounced \"V-RAM.\"  System RAM is great for loading and running programs, but when you need graphics power, VRAM is where it's at.  This is the memory used to store image data that the computer displays; it acts as a buffer between the CPU and the video card.  When a picture is to be displayed on the screen, the image is first read by the processor and then written to the VRAM.  The data is then converted by a RAM digital-to-analog converter (RAMDAC) into analog signals that are sent to the display.  Of course, the whole process happens so quickly, you don't notice it.  Unlike most system RAM, VRAM chips are dual-ported, which means that while the display is reading from VRAM to refresh the currently displayed image, the processor is writing a new image to the VRAM.  This prevents the display from flickering between the redrawing of images.\nThere are many different types of VRAM.  One popular kind is called Synchronous Graphics RAM (SGRAM).  It is an inexpensive type of RAM that is clock-synchronized.  This means data can be modified in a single operation rather than as a sequence of read, write, and update operations.  This allows background, foreground, and image fills to be handled more efficiently.  Another type of VRAM is Rambus Dynamic RAM (RDRAM).  It is designed by Rambus and includes a proprietary Rambus bus that speeds up the transfer of data through it.  Video editing pros like this chip since it is optimized for video streaming.  A third type of VRAM is Window RAM (WRAM).  This high-performance VRAM is dual-ported, has about 25% more bandwidth than standard VRAM, and typically costs less.  Finally, there is Multibank Dynamic RAM (MDRAM).  This is also high-performance VRAM, developed by MoSys, which divides the memory into divisions of 32 KB that can be accessed individually.  This makes memory transfers more efficient and increases overall performance.  Another advantage of MDRAM is that it can be manufactured with just the right amount of memory for a given resolution, so it is cheaper to manufacture than most other types of VRAM."
        ]
    },
    {
        "word": "VRML",
        "type": [],
        "definition": [
            "Stands for \"Virtual Reality Modeling Language.\"  If you think this has something to do with HTML, you're right.  While HTML is the format for Web page production, VRML is a 3D navigation specification, which enables the creation of interactive 3D Web sites.  With VRML, visitors can take virtual tours through buildings and view three-dimensional models of cars directly from their Web browsers.  Though the technology was created by Silicon Graphics and Intervista Software a number of years ago, it still is not widely used."
        ]
    },
    {
        "word": "Vaporware",
        "type": [],
        "definition": [
            "Vaporware is hardware or software that has been announced, but has missed its release date by a significant amount of time.  It includes both products that are eventually released and products that are never released at all.\nVaporware is typically produced when a company is over-aggressive in announcing a product release date.  Since technology is a competitive field, one business can sometimes gain an advantage over another by announcing their product will be available first.  However, unforeseen delays can push back the release date significantly, leading both bloggers and news publishers alike to dub the product as \"vaporware.\"\nThere is no official length of delay that makes a product vaporware, but the term often surfaces after a delay of three months or more.  It also is commonly used after a company postpones the release date for the second time.  While vaporware can sometimes work in a company's favor by generating extra buzz, it typically diminishes the product hype, especially after a long delay.  When a company has multiple products turn into vaporware, it can tarnish the corporate image and negatively affects the company's credibility with consumers.  Therefore, most businesses make a strong effort to release their products on time.\nAn example of a recent vaporware product is the white iPhone 4, which was announced in early June of 2010, but has been delayed several times since then."
        ]
    },
    {
        "word": "Variable",
        "type": [],
        "definition": [
            "In mathematics, a variable is a symbol or letter, such as \"x\" or \"y,\" that represents a value.  In algebraic equations, the value of one variable is often dependent on the value of another.  For example, in the equation below, y is the \"dependent variable\" because its value is based on the value assigned to the \"independent variable\" x.\ny = 10 + 2x\nThe equation above may also be called a function since y is a function of x.  If x = 1, then y = 12.  If x = 2, then y = 14.\nVariables are also used in computer programming to store specific values within a program.  They are assigned both a data type as well as a value.  For example, a variable of the string data type may contain a value of \"sample text\" while a variable of the integer data type may contain a value of \"11\".  Some programming languages require variables to be declared before they can be used, while others allow variables to be created on the fly.  The data type, if not defined explicitly, is determined based on the initial value given to the variable.\nA function within a program may contain multiple variables, each of which may be assigned different values based on the input parameters.  Likewise, a variable may also be used to return a specific value as the output of a function.  In the Java example below, the variable i is incremented during each iteration of the while loop, and x is returned as the output.\nwhile (i < max)\n{\n&nbsp; x = x+10;\n&nbsp; i++;\n}\n…\nreturn x;\nAs the name implies, the value of a variable can change.  Variables that store values that do not change are called constants."
        ]
    },
    {
        "word": "Vector",
        "type": [],
        "definition": [
            "Mathematically, a vector is a quantity, defined by both magnitude and direction.  For example, a vector could be illustrated by an 1 inch arrow pointing at a 30 degree angle.  Another vector may be 2.5 inches and point at a 160 degree angle.  In the computer world, vectors are used to define paths in certain types of images, such as EPS files and Adobe Illustrator documents.  These images are often called vector graphics since they are comprised of vectors, or paths, instead of dots.  Vector graphics can be scaled larger or smaller without losing quality.\nIn computer science, a vector may refer to a type of one dimensional array.  For example, a vector called \"fibonacci\" that stores the first six values of the Fibonacci sequence would be defined as follows:\nfibonacci[0] = 0, fibonacci[1] = 1, fibonacci[2] = 1, fibonacci[3] = 2, fibonacci[4] = 3, fibonacci[5] = 5\nVectors are similar to arrays, but unlike arrays, vectors use their own memory management mechanisms.  Arrays are restricted to the memory structure supplied by the programming language they are created in, typically called a stack.  Vectors have a more dynamic structure, often referred to as a heap, which gives them greater flexibility in how they use memory.  While an array uses a static amount of memory, the memory used by the vector can be increased or decreased as elements are added or removed from the vector."
        ]
    },
    {
        "word": "Vector Graphic",
        "type": [],
        "definition": [
            "Unlike JPEGs, GIFs, and BMP images, vector graphics are not made up of a grid of pixels.  Instead, vector graphics are comprised of paths, which are defined by a start and end point, along with other points, curves, and angles along the way.  A path can be a line, a square, a triangle, or a curvy shape.  These paths can be used to create simple drawings or complex diagrams.  Paths are even used to define the characters of specific typefaces.\nBecause vector-based images are not made up of a specific number of dots, they can be scaled to a larger size and not lose any image quality.  If you blow up a raster graphic, it will look blocky, or \"pixelated.\"  When you blow up a vector graphic, the edges of each object within the graphic stay smooth and clean.  This makes vector graphics ideal for logos, which can be small enough to appear on a business card, but can also be scaled to fill a billboard.  Common types of vector graphics include Adobe Illustrator, Macromedia Freehand, and EPS files.  Many Flash animations also use vector graphics, since they scale better and typically take up less space than bitmap images.\nFile extensions: .AI, .EPS, .SVG, .DRW"
        ]
    },
    {
        "word": "Veronica",
        "type": [],
        "definition": [
            "The name actually stands for \"Very Easy Rodent-Oriented Netwide Index to Computerized Archives.\"  Pretty weird, I know.  The \"rodent\" part of the acronym refers to how the Veronica utility allows you to search all of the world's gopher servers using keywords.  (That's about 10 million items from over 6,000 gopher servers.)  After searching for the terms, Veronica displays a list of gopher menus and articles containing the key words you searched for.  The more recent versions of Veronica can also search certain Web pages, newsgroups, and FTP sites.\nUnlike most search engines, Veronica searches for keywords only in gopher server menu titles, and doesn't look throught the entire text of documents.  When searching with Veronica, you can use the logical operators AND, NOT, and OR to help narrow your search.  Also, typing an asterisk (*) at the end of a word will match anything starting with that word.  Sound familar to any Unix users?"
        ]
    },
    {
        "word": "Version Control",
        "type": [],
        "definition": [
            "Version control is used to manage multiple versions of computer files and programs.  A version control system, or VCS, provides two primary data management capabilities.  It allows users to 1) lock files so they can only be edited by one person at a time, and 2) track changes to files.\nIf you are the only person editing a document, there is no need to lock a file for editing.  However, if a team of developers is working on a project, it is important that no two people are editing the same file at the same time.  When this happens, it is possible for one person to accidentally overwrite the changes made by someone else.  For this reason, version control allows users to \"check out\" files for editing.  When a file has been checked out from a shared file server, it cannot be edited by other users.  When the person finishes editing the file, he can save the changes and \"check in\" the file so that other users can edit the file.\nVersion control also allows users to track changes to files.  This type of version control is often used in software development and is also known as \"source control\" or \"revision control.\"  Popular version control systems like Subversion and CVS allow developers to save incremental versions of programs and source code files during the development process.  This provides the capability to rollback to an earlier version of the program if necessary.  For example, if bugs are found in a new version of a software program, the developer can review the previous version when debugging the code.\nVersion control software requires that all files are saved in a central location.  This location is called the repository and contains all previous and current versions of files managed by the VCS.  Whenever a new file is created or a current file is updated, the changes are \"committed\" to the repository, so the latest version is available to all users."
        ]
    },
    {
        "word": "Vertical Market Software",
        "type": [],
        "definition": [
            "A vertical market is one that supplies goods to a specific industry.  For example, a MIDI keyboard manufacturer develops products for a vertical market since the keyboards are only used by people who want to create music on their computers.  Vertical market software, therefore, is software developed for niche applications or for a specific clientele.\nFor example, investment, real estate, and banking programs are all vertical market software applications because they are only used by a specific group of people.  Scientific analysis programs, screenplay writing programs, and programs used by medical professionals are also vertical market software because they cater to a specific audience.  There is typically not a lot of competition in vertical markets, but it can still be a risky industry since developers are highly dependent on specific clients to buy their products.  The opposite of vertical market software is horizontal market software, which is developed for the general public or multiple industries."
        ]
    },
    {
        "word": "Video Card",
        "type": [],
        "definition": [
            "Most of the processing done on a computer is done via the computer's central processing unit, or CPU.  So in order to give the CPU a break and help it run more efficiently, a video card can be used to process the graphics portion of the processing load.  Because most of today's programs are graphically oriented, the video card can help almost any program run more efficiently.  However, the difference in performance is especially noticeable in image editing applications and 3D games.\nVideo cards, also called graphics accelerators, can speed up both 2D and 3D graphics rendering.  Programs such as photo editors and Web browsers may benefit from 2D acceleration, while CAD design programs and video games will most likely benefit from the card's 3D acceleration.  Some programs rely so heavily on the video card, that they will not run if a supported video card is not installed.\nMost video cards support the OpenGL and DirectX libraries.  These libraries include commands for manipulating graphics that programmers can include in their code.  Some of these commands may include moving or rotating an object, morphing polygons, or casting light and creating shadows.  By using standard OpenGL or DirectX functions, it makes it easier for developers to create graphically-oriented programs.  Of course, it also makes it necessary for the computer to include a supported video card in order for the program to run.\nVideo cards are typically installed in either the PCI or AGP slots in the back of a computer.  Most computers come with a video card installed in one of these slots, which means it can be upgraded at a later time."
        ]
    },
    {
        "word": "Viral",
        "type": [],
        "definition": [
            "Contrary to what you might think, the term \"viral\" has nothing to do with computer viruses.  Instead it refers to a digital video, image, or article that has spiked in popularity and has reached a large number of users in a short period of time.  While there is no exact number of views that makes something \"go viral,\" most viral media is viewed by more than a million people in less than a week.\nViral videos are the most common type of viral media.  Most viral videos are posted on YouTube, which provides free video hosting.  Since YouTube has become the central location to view videos on the web, homemade videos have the potential to be viewed by millions of people around the world.  While some users have success promoting their YouTube videos from other websites, most viral videos gain popularity by word of mouth.  For example, if someone comes across a video that he thinks is especially amusing or shocking, he might forward the link to his friends.  If his friends also like the video, they might tell their friends, who may tell other friends, etc.\nFor a video to become viral, it needs to reach a certain threshold that might be considered a \"tipping point.\"  Once it reaches this level of popularity, the number of views or \"hits\" spikes upwards and the video becomes viral.  This may happen when the video reaches YouTube's \"Most Popular\" list or is picked up and shown by a national news network.  Once this happens, the already popular video gets even more publicity and goes viral."
        ]
    },
    {
        "word": "Virtual Machine",
        "type": [],
        "definition": [
            "A virtual machine (or \"VM\") is an emulated computer system created using software.  It uses physical system resources, such as the CPU, RAM, and disk storage, but is isolated from other software on the computer.  It can easily be created, modified, or destroyed without affecting the host computer.\nVirtual machines provide similar functionality to physical machines, but they do not run directly on the hardware.  Instead, a software layer exists between the hardware and the virtual machine.  The software that manages one or more VMs is called a \"hypervisor\" and the VMs are called \"guests\" or virtualized instances.  Each guest can interact with the hardware, but the hypervisor controls them.  The hypervisor can start up and shut down virtual machines and also allocate a specific amount of system resources to each one.\nYou can create a virtual machine using virtualization software.  Examples include Microsoft Hyper-V Manager, VMware Workstation Pro, and Parallels Desktop.  These applications allow you to run multiple VMs on a single computer.  For example, Parallels Desktop for Mac allows you to run Windows, Linux, and macOS virtual machines on your Mac.\nVMs are ideal for testing software since developers can install one or more applications and revert to a saved state (or \"snapshot\") whenever needed.  Testing software on a regular operating system can cause unexpected crashes and may leave some files lingering behind after the software is uninstalled.  It is safer to test software on a virtual machine that is isolated from the operating system and can be fully reset as needed.\nCloud-Based Virtual Machines\nAs cloud services have grown in popularity, cloud-based VMs have become increasingly popular as well.  \"Cloud instances,\" as they are often called, run on a computer that is accessed over the Internet.  The VM is often controlled through a web browser or a remote access utility.  Cloud-based VMs are a common way for companies to test software deployments since they can test on dozens of machines without hosting the VMs locally."
        ]
    },
    {
        "word": "Virtual Memory",
        "type": [],
        "definition": [
            "All computers have physical memory, or RAM, which loads the operating system and active programs.  In some cases, RAM is soldered to the motherboard, while in others, it is installed using removable memory modules.  Either way, the system memory is limited to the total RAM installed.  Modern PCs typically have between 4 GB and 32 GB of RAM.\nWhen you open an application, your computer loads the app and related files into RAM.  If you open enough programs at one time, your computer will eventually run out of memory.  Instead of producing an \"out of memory\" error or forcing programs to quit, your computer can \"swap\" physical memory into virtual memory.\n\nVirtual memory is space on a storage device, such as an SSD or HDD, that serves as temporary system memory, similar to RAM.  This \"secondary memory\" can expand a computer's memory beyond the physical memory limit.  However, since storage devices are much slower than the RAM, data stored in virtual memory is often swapped back to RAM when accessed.\nSwapping data between the primary memory takes time.  Therefore, the more your computer uses virtual memory, the more it will slow down.  One of the best ways to improve your computer's performance is to install additional RAM.  With more free memory, your computer won't need to use virtual memory as often, resulting in fewer slowdowns and faster overall speed."
        ]
    },
    {
        "word": "Virtual Reality",
        "type": [],
        "definition": [
            "While the word \"virtual\" is typically overused in the computer world, it is aptly placed in the phrase \"virtual reality.\"  According to the American Heritage Dictionary, virtual means \"existing or resulting in essence or effect though not in actual fact, form, or name.\"   It can also mean \"created, simulated, or carried on by means of a computer or computer network.\"  Therefore, virtual reality is best described as an illusion of reality created by a computer system.\nA person may enter a world of virtual reality by putting on special glasses and headphones attached to a computer system running the virtual reality program.  These devices immerse the user with the sights and sounds of the virtual world.  Some virtual reality systems allow the user to also wear gloves with electronic sensors that can be used to touch or move virtual objects.  As the user moves his head or hands, the computer moves the virtual world accordingly in real-time.\nVirtual reality has been widely used for entertainment purposes, but the technology has found its way into the military and medical fields as well.  While virtual reality systems have advanced significantly over the past decade, for the most part they are still more \"virtual\" than reality."
        ]
    },
    {
        "word": "Virtualization",
        "type": [],
        "definition": [
            "Virtualization can refer to a variety of computing concepts, but it usually refers to running multiple operating systems on a single machine.  While most computers only have one operating system installed, virtualization software allows a computer to run several operating systems at the same time.\nFor example, a Windows computer with VMware Workstation installed can run Linux within the Windows interface.  Similarly, a Macintosh computer can use Parallels Desktop to run Windows within the Mac OS X interface.  When another operating system (OS) is running on top of the main system, it is called a \"virtual machine.\"  This is because it acts like a typical computer but is actually running on top of another operating system.\nVirtualization software acts as a layer between a computer's primary OS and the virtual OS.  It allows the virtual system to access the computer's hardware, such as the RAM, CPU, and video card, just like the primary OS.  This is different than emulation, which actually translates each command into a form that the system's processor can understand.  Since Macintosh and Windows computers now both use the \"x86\" processor architecture, it is possible to run both OSes on the same machine via virtualization, rather than emulation.\nAnother type of virtualization involves connecting to a remote computer system and controlling it from your computer.  This is commonly referred to as remote access."
        ]
    },
    {
        "word": "Virus",
        "type": [],
        "definition": [
            "Like a biological virus, a computer virus is something you don't want to get.  Computer viruses are small programs or scripts that can negatively affect the health of your computer.  These malicious little programs can create files, move files, erase files, consume your computer's memory, and cause your computer not to function correctly.  Some viruses can duplicate themselves, attach themselves to programs, and travel across networks.  In fact opening an infected e-mail attachment is the most common way to get a virus.\nWe all know it's hard enough to get a computer to work well when it is healthy, let alone when it has been attacked by a virus.  Therefore, it is better to prevent an attack than to try and cure it.  There are many antivirus programs available that scan incoming files for viruses before they can cause damage to your computer.  Some of these programs include Norton AntiVirus, McAfee VirusScan, and Virex.  It is a good idea to have one of these programs on your computer to prevent a virus attack.  It is also important to update your virus definitions file at least once a month so that your anti-virus program can check for all the latest viruses.  It's a lot like having a glass of orange juice every morning — it keeps your computer's immune system strong and healthy."
        ]
    },
    {
        "word": "Virus Definition",
        "type": [],
        "definition": [
            "A virus definition is binary pattern (a string of ones and zeros) that identifies a specific virus.  By checking a program or file against a list of virus definitions, antivirus software can determine if the program or file contains a virus.\nMost antivirus and Internet security programs reference a database of virus definitions when scanning files for viruses.  This is an effective way to detect known viruses.  However, when new viruses are created, antivirus software may not recognize them.  Therefore, most antivirus programs automatically update the virus definitions from an online database on a regular basis (such as once a week).\nSome antivirus programs use known virus definitions to generate heuristics that can detect unknown viruses.  These viruses may not match a virus definition exactly, but they may be similar enough that the antivirus software can mark the file as a possible virus.  While this offers extra protection against unknown viruses, it can also produce \"false positives,\" labeling files as potentially harmful when they do not contain viruses.\nThe accuracy of antivirus heuristics is improved over time based on the feedback end users and developers provide to antivirus software companies.  This feedback is used to whitelist or blacklist certain files.  By combining this information with up-to-date virus definitions, antivirus software can produce less false positives, yet still catch actual viruses."
        ]
    },
    {
        "word": "Visual Basic",
        "type": [],
        "definition": [
            "Visual Basic is a programming language and development environment created by Microsoft.  It is an extension of the BASIC programming language that combines BASIC functions and commands with visual controls.  Visual Basic provides a graphical user interface GUI that allows the developer to drag and drop objects into the program as well as manually write program code.\nVisual Basic, also referred to as \"VB,\" is designed to make software development easy and efficient, while still being powerful enough to create advanced programs.  For example, the Visual Basic language is designed to be \"human readable,\" which means the source code can be understood without requiring lots of comments.  The Visual Basic program also includes features like \"IntelliSense\" and \"Code Snippets,\" which automatically generate code for visual objects added by the programmer.  Another feature, called \"AutoCorrect,\" can debug the code while the program is running.\nPrograms created with Visual Basic can be designed to run on Windows, on the Web, within Office applications, or on mobile devices.  Visual Studio, the most comprehensive VB development environment, or IDE, can be used to create programs for all these mediums.  Visual Studio .NET provides development tools to create programs based on the .NET framework, such as ASP.NET applications, which are often deployed on the Web.  Finally, Visual Basic is available as a streamlined application that is used primarily by beginning developers and for educational purposes."
        ]
    },
    {
        "word": "Vlog",
        "type": [],
        "definition": [
            "Vlog is short for \"video blog\" and is pronounced \"vlog\" (one syllable).  A vlog is a blog, or web log, that includes video clips.  It may be entirely video-based or may include both video and written commentary.  Several types of vlogs are available on the Web, including instructional videos, travel updates, and personal commentaries.\nPeople who create vlogs are known as \"vloggers.\"  Some vloggers post videos for fun, while others run vlogs for the purpose of generating revenue through advertisements.  While it's possible to set up a vlog website, many vloggers post their vlogs on YouTube since it makes their videos easier to find.  Additionally, YouTube offers free video hosting, which means vloggers can post unlimited videos without paying web hosting fees.\nIn order to create a vlog, all you need is a video camera, an Internet connection, and a good idea.  While a simple cell phone video camera can get the job done, a standalone HD video camera will produce much higher quality videos.  You can publish videos as often as you like, though if you decide to maintain a blog, it helps to post them at consistent intervals, such as once a day or once a week.  This helps your viewers know when new videos will be available, which makes them more likely to continue visiting your vlog."
        ]
    },
    {
        "word": "VoIP",
        "type": [],
        "definition": [
            "Stands for \"Voice Over Internet Protocol,\" and is often pronounced \"voip.\"  VoIP is basically a telephone connection over the Internet.  The data is sent digitally, using the Internet Protocol (IP) instead of analog telephone lines.  This allows people to talk to one another long-distance and around the world without having to pay long distance or international phone charges.\nIn order to use VoIP, you need a computer, an Internet connection, and VoIP software.  You also need either a microphone, analog telephone adapter, or VoIP telephone.  Many VoIP programs allow you to use a basic microphone and speaker setup.  Others requires VoIP phones, which are like regular telephone handsets, but typically connect to your computer via USB.  Analog telephone adapters allow you to use regular phones with your computer.  IP phones are another option that connect directly to a router via Ethernet or wirelessly.  These phones have all the necessary software for VoIP built in and therefore do not require a computer.\nThe largest provider of VoIP services is Vonage, but there are several other companies that offer similar services.  While Vonage charges a monthly service fee, programs like Skype and PeerMe allow users to connect to each other and talk for free.  However, these free services may offer fewer connections, lower audio quality, and may be less reliable than paid services like Vonage.\nVoIP is also referred to as IP telephony, Internet telephony, and digital phone."
        ]
    },
    {
        "word": "Volatile Memory",
        "type": [],
        "definition": [
            "Volatile memory is memory that requires electric current to retain data.  When the power is turned off, all data is erased.  Volatile memory is often contrasted with non-volatile memory, which does not require power to maintain the data storage state.\nThe most common type of volatile memory is random-access memory, or RAM.  Computers and other electronic devices use RAM for high-speed data access.  The read\/write speed of RAM is typically several times faster than a mass storage device, such as a hard disk or SSD.  When a computer boots up, it loads the operating system into RAM.  Similarly, when you open an application on your computer or mobile device, it is loaded into RAM.  Loading the operating system and active applications into RAM allows them to run much faster.\nSince RAM is volatile memory, all data stored in RAM is lost when the host device is turned off or restarted.  The operating system must be loaded into RAM again when the device is turned on.  While this requires extra processing time during startup, the \"reset\" that non-volatile memory provides is an effective way to remove lingering issues that may occur while a computer is running.  This is why restarting a computer or electronic device is an effective way to fix common problems.\nSystem RAM is the most common type of volatile memory, but several other types exist.  Below are some examples of volatile memory:\n\nSystem RAM (DRAM)\nVideo RAM (VRAM)\nProcessor L1 and L2 cache\nHDD and SSD disk cache\n\nNOTE: The \"volatile\" aspect of the term \"volatile memory\" refers to how data is lost when the power is turned off.  It does not refer to the voltage required to maintain the data."
        ]
    },
    {
        "word": "Volume",
        "type": [],
        "definition": [
            "The word \"volume\" has several different meanings.  In physics, it measures both sound and three-dimensional space.  Audio volume defines the intensity of soundwaves, or how loud a sound is.  Spacial volume describes how much space a three-dimensional object takes up.  In the computer world, \"volume\" has an entirely different definition related to data storage.\nA computer volume is similar to a book volume, or a single book in a series.  It refers to a specific storage area, such as an HDD or SSD.  It may also be a section within a storage device.  Before a computer can access data from a volume, it must mount it first.  Once a volume is mounted, the computer may read and write data, depending on the volume's permissions.  Unmounting the volume prevents it from being accessed.\n While the terms \"volume\" and \"storage device\" are often used interchangeably, they do not have a one-to-one relationship.  For example, several storage devices can be linked together in a single volume.  Alternatively, a single storage device may be split into multiple volumes.\nContainers vs Volumes vs Partitions\nSome file systems, such as NTFS, use volumes as the top level of data storage.  Others, such as Apple's APFS, use \"containers.\"  A single disk may have multiple containers.  A container can store more than one volume and a volume may have multiple partitions.  It is also possible for a storage device to have one container with a single volume that has one partition.\nWhile a volume may contain multiple partitions, most file systems create separate volumes for each partition.  Windows, for example, creates a new volume for each partition, labeling each volume with a letter, such as C:, D:, E:, etc.  These volumes are also called \"drives,\" even though they may not be separate physical drives.\nNOTE: Since there is often a one-to-one relationship between volumes and partitions, these terms are also used interchangeably.  However, a partition is technically part of a volume.  For example, formatting a volume will erase all partitions contained in that volume."
        ]
    }
]