[
    {
        "word": "W3C",
        "type": [],
        "definition": [
            "Stands for \"World Wide Web Consortium.\"  The W3C is an international community that includes a full-time staff, industry experts, and several member organizations.  These groups work together to develop standards for the World Wide Web.\nThe mission of the W3C is to lead the Web to its full potential by developing relevant protocols and guidelines.  This is achieved primarily by creating and publishing Web standards.  By adopting the Web standards created by the W3C, hardware manufacturers and software developers can ensure their equipment and programs work with the latest Web technologies.  For example, most Web browsers incorporate several W3C standards, which allows them to interpret the latest versions of HTML and CSS code.  When browsers conform to the W3C standards, it also helps Web pages appear consistent across different browsers.\nBesides HTML and CSS standards, the W3C also provides standards for Web graphics (such as PNG images), as well as audio and video on the Web.  The organization also develops standards for Web applications, Web scripting, and dynamic content.  Additionally, the W3C provides privacy and security guidelines that websites should follow.\nThe World Wide Web Consortium has played a major role in the development of the Web since it was founded in 1994.  As Web technologies continue to evolve, the W3C continues to publish new standards.  For example, many of the technologies included in Web 2.0 websites are based on standards developed by the W3C.  To learn more about the W3C and the current standards published by the organization, visit the W3C website."
        ]
    },
    {
        "word": "WAIS",
        "type": [],
        "definition": [
            "Stands for \"Wide Area Information Server.\"  This is a program that can index enormous amounts of information and make it searchable across large networks (including the Internet).  People can search the WAIS index and it will return results by relevance.  Searches can then be narrowed down by subsequent searches on the original results.  Search engines are a new and improved version of WAIS, specifically for the Web."
        ]
    },
    {
        "word": "WAMP",
        "type": [],
        "definition": [
            "\nStands for \"Windows, Apache, MySQL, and PHP.\"  WAMP is a variation of LAMP for Windows systems and is often installed as a software bundle (Apache, MySQL, and PHP).  It is often used for web development and internal testing, but may also be used to serve live websites.\nThe most important part of the WAMP package is Apache (or \"Apache HTTP Server\") which is used run the web server within Windows.  By running a local Apache web server on a Windows machine, a web developer can test webpages in a web browser without publishing them live on the Internet.\nWAMP also includes MySQL and PHP, which are two of the most common technologies used for creating dynamic websites.  MySQL is a high-speed database, while PHP is a scripting language that can be used to access data from the database.  By installing these two components locally, a developer can build and test a dynamic website before publishing it to a public web server.\nWhile Apache, MySQL, and PHP are open source components that can be installed individually, they are usually installed together.  One popular package is called \"WampServer,\" which provides a user-friendly way to install and configure the \"AMP\" components on Windows.\nNOTE: The \"P\" in WAMP can also stand for either Perl or Python, which are other scripting languages.  The Mac version of LAMP is known as MAMP."
        ]
    },
    {
        "word": "WAN",
        "type": [],
        "definition": [
            "Stands for \"Wide Area Network.\"  It is similar to a Local Area Network (LAN), but it's a lot bigger.  Unlike LANs, WANs are not limited to a single location.  Many wide area networks span long distances via telephone lines, fiber optic cables, or satellite links.  They can also be composed of smaller LANs that are interconnected.  The Internet could be described as the biggest WAN in the world.  You could even call the Internet a Super WAN BAM if you wanted to.  Or maybe not."
        ]
    },
    {
        "word": "WAVE",
        "type": [],
        "definition": [
            "WAVE is an audio format used to store sound data.  It is is similar to the AIFF format, but is based on the Resource Interchange File Format (RIFF), a container format designed to store data in \"chunks.\"  Therefore, each WAVE file contains one or more chunks that store audio data or other information.\nA typical WAVE file includes a format (\"fmt\") chunk and a data chunk.  The format chunk describes how the waveform data is stored and specifies the number of channels, sampling rate, and compression type.  The data chunk contains the actual audio data and is separated into channels (such as left and right for a stereo audio recording).  Optional chunks include the silent (\"slnt\") chunk, which defines silent parts of the audio and the wave list (\"wavl\") chunk, which specifies the locations of silent sections.  WAVE files may also include several other optional chunks, such as cue chunk, which marks specific points in the audio, and the info chunk, which is used to store metadata that describes the file.\nThe WAVE format supports several types of media compression, including Microsoft ADPCM, Yamaha ADPCM, a-law, µ-law, GSM, and MPEG compression.  However, most WAVE files store data in an uncompressed (PCM) format.  For example, most Windows programs that rip audio from CDs export the data as uncompressed WAVE files.  These files maintain the original CD-quality audio, which includes two audio channels, a sample size of 16 bits, and a sampling rate of 44.1 KHz.  This is identical to the uncompressed AIFF files exported by most Macintosh audio ripping utilities.  Since the WAVE and AIFF formats are so similar, most DAW applications and audio programs can read and write both formats.\nNOTE: While WAVE files contain binary data, you can tell if an audio file is saved in the WAVE format by dragging it to a text editor.  The first several characters should read something similar to \"RIFF WAVEfmt.\"\nFile extensions: .WAV, .WAVE"
        ]
    },
    {
        "word": "WDDM",
        "type": [],
        "definition": [
            "Stands for \"Windows Display Driver Model.\"  WDDM is a display driver architecture introduced with Windows Vista.  It improves graphics performance over the previous Windows XP architecture by more fully utilizing a computer's GPU to render system graphics.\nWhen Microsoft released the Vista operating system at the beginning of 2007, dedicated graphics processors (or GPUs) had become standard computer components.  Additionally, GPU performance was increasing by a much faster rate than CPUs.  Therefore, software developers needed an efficient way to \"offload\" as much graphics processing from the CPU to the GPU as possible.  This lead Microsoft to rewrite the graphics driver system during the development of Windows Vista.  The more efficient WDDM graphics architecture was the result.\nOne of the biggest benefits of the WDDM architecture is that it supports GPU multitasking.  This allows Windows users to run multiple graphics intensive applications at the same time.  It also simplifies graphics programming, making it easier for 3D game developers to take fully advantage of a system's GPU.  Additionally, the WDDM offers improved stability by detecting when the driver hangs and restarting the display driver instead of requiring a full system restart.\nWhile the WDDM architecture was introduced with Windows Vista, it is also used by newer versions of the Windows operating systems, such as Windows 7 and Windows 8.  Windows 7 includes WDDM 1.1, while Windows 8 includes WDDM 1.2.  These updates include improvements designed to support new graphics processing capabilities offered by modern GPUs.\nNOTE: WDDM may also be referred to as WVDDM or \"Windows Vista Display Driver Model.\"  However, this term is not commonly used since WDDM is now used by newer versions of Windows."
        ]
    },
    {
        "word": "WEP",
        "type": [],
        "definition": [
            "Stands for \"Wired Equivalent Privacy.\"  WEP is a security protocol for Wi-Fi networks.  Since wireless networks transmit data over radio waves, it is easy to intercept data or \"eavesdrop\" on wireless data transmissions.  The goal of WEP is to make wireless networks as secure as wired networks, such as those connected by Ethernet cables.\nThe wired equivalent privacy protocol adds security to a wireless network by encrypting the data.  If the data is intercepted, it will be unrecognizable to system that intercepted the data, since it is encrypted.  However, authorized systems on the network will be able to recognize the data because they all use the same encryption algorithm.  Systems on a WEP-secured network can typically be authorized by entering a network password."
        ]
    },
    {
        "word": "WHOIS",
        "type": [],
        "definition": [
            "WHOIS (pronounced \"who is\") is an Internet service used to look up information about a domain name.  While the term is capitalized, \"WHOIS\" is not an acronym.  Instead, it is short for the question, \"Who is responsible for this domain name?\"\nDomain names are registered through companies called registrars.  Examples include GoDaddy, Tucows, Namecheap, and MarkMonitor.  These companies have been approved and accredited by ICANN to register new domain names.  Whenever an individual or organization registers a new domain name, the registrar is required to make the registration information publicly available.  This information can be looked up online using the WHOIS service.\nSince there is no central database of domain registration information, WHOIS search engines look up data across multiple registrars.  Many registrars provide their own WHOIS lookup service, though several third party WHOIS websites also exist.  ICANN provides its own WHOIS lookup service as well (see photo).\nWhat is a WHOIS record?\nWHOIS records vary between registrars, but they all contain mandatory information.  This includes the name of the registrar, created date, updated date, and expiration date of the domain name.  The name servers are also listed.  Three contacts are included — the registrant, admin, and technical contacts.  This information, provided during registration, includes a name, organization (if applicable), address, phone number, and email address.  In many cases, the information is duplicated across all three contacts, though each one may have different information.\nNOTE: The contact information in a WHOIS record can be made private using a \"private registration\" service offered by some registrars.  This service, which may be available for an additional fee, masks the registrant's contact information with non-personally identifiable information.  A domain registered with domain privacy will still show up in a WHOIS search, but the organization may appear as \"Whois Privacy Services\" and the email address \"abcd1234@whoisprivacyservices.com.\""
        ]
    },
    {
        "word": "WIMP",
        "type": [],
        "definition": [
            "Stands for \"Windows, Icons, Menus, Pointer.\"  WIMP is an acronym that emerged in the 1980s and describes the graphical user interface (GUI) of personal computers.  It includes both Windows and Macintosh interfaces, as well as other less common operating systems, such as Linux and NeXT.\nWhile the terms GUI and WIMP are sometimes used interchangeably, WIMP is technically a subset of GUIs.  This means all WIMP interfaces are GUIs, but not all GUIs are WIMPs.  WIMP-based systems are designed to be used with a keyboard and mouse, since the mouse controls the pointer (or cursor) and the keyboard is used to enter data.  Other GUIs may support different types of input, such as a touchscreen display.\nModern GUIs, many of which have a touchscreen interface, are sometimes referred to as \"post-WIMP\" interfaces.  Examples include iOS and Android, which are popular smartphone and tablet operating systems.  These interfaces include icons, but often lack windows and menus.  Since no mouse is required for a touchscreen interface, there is no pointer.\nNOTE: WIMP also stands for \"Windows, IIS, MySQL, and PHP,\" which is variation of WAMP.  It is a software package commonly installed on Windows-based web servers."
        ]
    },
    {
        "word": "WINS",
        "type": [],
        "definition": [
            "Stands for \"Windows Internet Name Service.\"  WINS is a service that enables Windows to identify NetBIOS systems on a TCP\/IP network.  It maps NetBIOS names to IP addresses, which is a more standard way to identify network devices.\nWINS is similar to DNS, which is used for resolving domain names.  Like DNS, WINS requires a server to perform name resolutions and return the IP address to client systems.  However, instead of resolving domain names, WINS is used specifically to locate NetBIOS systems.  For example, WINS may translate the NetBIOS name WorkComputer00 to the IP address 192.168.1.20.  This allows other systems on the network to access WorkComputer00 directly by its IP address.\nEarly versions of Windows (before Windows 2000) located network devices by their NetBIOS names.  Therefore, Windows servers were required to run WINS in order to access network systems.  Windows 2000 and later can use DNS to locate network systems, which means WINS is not required on modern Windows servers.  However, many Windows systems still run WINS for backwards compatibility with older devices."
        ]
    },
    {
        "word": "WLAN",
        "type": [],
        "definition": [
            "Stands for \"Wireless Local Area Network.\"  A WLAN, or wireless LAN, is a network that allows devices to connect and communicate wirelessly.  Unlike a traditional wired LAN, in which devices communicate over Ethernet cables, devices on a WLAN communicate via Wi-Fi.\nWhile a WLAN may look different than a traditional LAN, it functions the same way.  New devices are typically added and configured using DHCP.  They can communicate with other devices on the network the same way they would on a wired network.  The primary difference is how the data is transmitted.  In a LAN, data is transmitted over physical cables in a series of Ethernet packets.  In a WLAN, packets are transmitted over the air.\nAs wireless devices have grown in popularity, so have WLANs.  In fact, most routers sold are now wireless routers.  A wireless router serves as a base station, providing wireless connections to any Wi-Fi-enabled devices within range of the router's wireless signal.  This includes laptops, tablets, smartphones, and other wireless devices, such as smart appliances and smart home controllers.  Wireless routers often connect to a cable modem or other Internet-connected device to provide Internet access to connected devices.\nLANs and WLANs can be merged together using a bridge that connects the two networks.  Wireless routers that include Ethernet ports can automatically combine wired and wireless devices into the same network.\nAdvantages of WLANs\nThe most obvious advantage of a WLAN is that devices can connect wirelessly, eliminating the need for cables.  This allows homes and businesses to create local networks without wiring the building with Ethernet.  It also provides a way for small devices, such as smartphones and tablets, to connect to the network.  WLANs are not limited by the number of physical ports on the router and therefore can support dozens or even hundreds of devices.  The range of a WLAN can easily be extended by adding one or more repeaters.  Finally, a WLAN can be easily upgraded by replacing routers with new versions — a much easier and cheaper solution than upgrading old Ethernet cables.\nDisadvantages of WLANs\nWireless networks are naturally less secure than wired networks.  Any wireless device can attempt to connect to a WLAN, so it is important to limit access to the network if security is a concern.  This is typically done using wireless authentication such as WEP or WPA, which encrypts the communication.  Additionally, wireless networks are more susceptible to interference from other signals or physical barriers, such as concrete walls.  Since LANs offer the highest performance and security, they are still used for many corporate and government networks.\nNOTE: WLAN should not be confused with \"WAN,\" which is a wide area network."
        ]
    },
    {
        "word": "WPA",
        "type": [],
        "definition": [
            "Stands for \"Wi-Fi Protected Access.\"  WPA is a security protocol designed to create secure wireless (Wi-Fi) networks.  It is similar to the WEP protocol, but offers improvements in the way it handles security keys and the way users are authorized.\nFor an encrypted data transfer to work, both systems on the beginning and end of a data transfer must use the same encryption\/decryption key.  While WEP provides each authorized system with the same key, WPA uses the temporal key integrity protocol (TKIP), which dynamically changes the key that the systems use.  This prevents intruders from creating their own encryption key to match the one used by the secure network.\nWPA also implements something called the Extensible Authentication Protocol (EAP) for authorizing users.  Instead of authorizing computers based soley on their MAC address, WPA can use several other methods to verify each computer's identity.  This makes it more difficult for unauthorized systems to gain access to the wireless network."
        ]
    },
    {
        "word": "WPA2",
        "type": [],
        "definition": [
            "Stands for \"Wi-Fi Protected Access 2.\"  It is the second version of WPA, a technology used for secure Wi-Fi connections.  Most Wi-Fi devices manufactured after 2006 support both WPA and WPA2.\nWPA vs WPA2\nBoth WPA and WPA2 provide encrypted data transfers over a Wi-Fi connection.  Both require a password with a minimum length of 8 characters.  The technologies differ in the way they encrypt the data.\nWPA uses the Temporal Key Integrity Protocol (TKIP) to dynamically vary the encryption key shared between the access point and connected clients.  The continually changing key provides more secure authentication than the earlier WEP wireless encryption standard.  WPA2 further improves Wi-Fi authentication with CCMP, the \"Cipher Block Chaining Message Authentication Code Protocol,\" which requires a 128-bit key.\nWPA uses the same RC4 encryption method as WEP, which is considered weak encryption by modern standards.  WPA2 requires AES (Advanced Encryption Standard), which is significantly stronger and harder to break.  AES encryption supports 128, 192, and 256-bit keys.\nNOTE: Most Wi-Fi networks use WPA2 by default.  If you are offered a choice between WEP, WPA, and WPA2, it is best to choose WPA2 since it is the most secure."
        ]
    },
    {
        "word": "WPAN",
        "type": [],
        "definition": [
            "Stands for \"Wireless Personal Area Network.\"  A WPAN is a specific type of PAN (Personal Area Network) in which all the connections are wireless.  It may use multiple types of wireless connections, but the most common is Bluetooth.\nThe \"personal\" aspect of a WPAN means it is meant to be used by a specific individual.  For example, you might have a smartphone and smartwatch that communicate with each other.  These devices securely transmit encrypted information back and forth, such as activity data, text messages, and alerts.  The WPAN provides consistent communication between the devices and prevents the data from being shared with devices outside the network.\nWhile most WPANs communicate over Bluetooth, devices may also transfer data over Wi-Fi.  For example, a laptop may connect to a smartphone via Wi-Fi to make and receive calls.  A tablet may sync with a smartphone over a home Wi-Fi network.  In some cases, other radio frequencies or infrared signals may also be used.\nSince WPANs are wireless, they are simple to set up and maintain.  Once devices are paired using Bluetooth, they can automatically discover each other when in range, typically within 30 meters.  A low-energy version of Bluetooth, called BLE, is often used to locate paired devices and establish connections between them.  Data transfers, which require a stronger signal, take place over standard Bluetooth or Wi-Fi."
        ]
    },
    {
        "word": "WWW",
        "type": [],
        "definition": [
            "Stands for \"World Wide Web.\"  It is important to know that this is not a synonym for the Internet.  The World Wide Web, or just \"the Web,\" as ordinary people call it, is a subset of the Internet.  The Web consists of pages that can be accessed using a Web browser.  The Internet is the actual network of networks where all the information resides.  Things like Telnet, FTP, Internet gaming, Internet Relay Chat (IRC), and e-mail are all part of the Internet, but are not part of the World Wide Web.  The Hyper-Text Transfer Protocol (HTTP) is the method used to transfer Web pages to your computer.  With hypertext, a word or phrase can contain a link to another Web site.  All Web pages are written in the hyper-text markup language (HTML), which works in conjunction with HTTP."
        ]
    },
    {
        "word": "WYSIWYG",
        "type": [],
        "definition": [
            "Stands for \"What You See Is What You Get,\" and is  pronounced \"wihzeewig.\"  WYSIWYG refers to software that accurately represents the final output during the development phase.  For example, a desktop publishing program such as Photoshop is a WYSIWYG graphics program because it can display images on the screen the same way they will look when printed on paper.  Word processing programs like Microsoft Word and Apple Pages are both WYSIWYG editors, because they include page layout modes that accurately display what the documents will look when printed.\nWhile WYSIWYG originally referred to programs that produce physical output, the term is now also used to describe applications that produce software output.  For example, most Web development programs are called WYSIWYG editors since they show what Web pages will look like as the developer is creating them.  This means that the developer can move text and images around the page to make it appear exactly how he or she wants before publishing the page on the Web.  When the page is published, it should appear nearly the same on the Web as the way it looked in the Web development program.  Of course, as most Web developers know, there is no guarantee that a Web page will look the same in two different browsers, such as Internet Explorer and Firefox.  But at least a WYSIWYG editor can give developers a close approximation of what the published page will look like."
        ]
    },
    {
        "word": "Wallpaper",
        "type": [],
        "definition": [
            "A wallpaper, or desktop background, is a background image that covers the desktop of a computer or other device.  Most operating systems provide a default wallpaper and allow you to choose your own.\nWallpapers can be any type of image, but most users prefer a clean background that is not too \"busy.\"  The simpler the wallpaper image is, the easier it is to view icons and windows on the desktop.  Some people prefer realistic backgrounds, while others opt for computer-generated images.\nRecent versions of macOS have used digital photos that correspond with the names of each OS version as the default wallpaper.  Examples include Yosemite National Park, the Sierra Nevada mountains, and Catalina Island.  Conversely, the default wallpapers for Windows 8 and Windows 10 are computer-generated images.\nBesides choosing a wallpaper style, it helps to choose an image that matches the resolution of your display.  For example, if you select an HD (1920x1080) pi for a 4K display, it will appear blurry.  Additionally, if the aspect ratio does not match your display, part of the image may get cut off when applied as a wallpaper on your device.\nNOTE: A wallpaper is different than a screen saver, which is an animation that appears when a device is idle."
        ]
    },
    {
        "word": "Wardriving",
        "type": [],
        "definition": [
            "Wardriving is the act of searching for Wi-Fi networks from a moving vehicle.  It involves slowly driving around an area with the goal of locating Wi-Fi signals.  This may be accomplished by an individual or by two or more people, with one person driving and others searching for wireless networks.\nWardriving may be as simple as searching for free Wi-Fi using a smartphone inside an automobile.  However, the definition usually applies to a hardware and software configuration specifically designed for locating and recording Wi-Fi networks.  Wardriving equipment typically includes:\n\nA car or other automobile\nA laptop\nA Wi-Fi antenna\nA GPS device\nWardriving software\n\nA wardriver can use the items listed above to locate all the Wi-Fi signals in a specific area.  The laptop runs the wardriving software, which communicates with both the GPS and Wi-Fi hardware.  The GPS receiver records the current location as the car is moving, while the Wi-Fi transceiver detects signals of wireless networks present in each location.  The antenna extends the range of the signal detection compared to a typical laptop.  Wardriving software may record the location, signal strength, and the status of each network found (for example, if it is open or encrypted, and what type of encryption the network uses).\nThe goal of wardriving may be to find a single usable Wi-Fi network or it may be to map all Wi-Fi signals within a specific area.  The latter is also called \"access point mapping.\"  While the act of wardriving itself may not be malicious, the data can be used to publicize and\/or exploit open or unsecure networks.  It is a good reminder to secure your own wireless network with a strong password so it cannot be accessed by strangers.\nNOTE: The term \"wardriving\" comes from \"wardialing,\" a systematic method of dialing phone numbers in search of modems popularized in the movie WarGames.  \"Warbiking,\" \"warwalking,\" and \"warrailing\" are variations of wardriving."
        ]
    },
    {
        "word": "Warm Boot",
        "type": [],
        "definition": [
            "A warm boot (also called a \"soft boot\") is the process of restarting a computer.  It may be used in contrast to a cold boot, which refers to starting up a computer that has been turned off.\nWarm boots are typically initiated by a \"Restart\" command in the operating system.  For example, to perform a warm boot on a Windows system, select Shut Down &rarr; Restart from the Start Menu.  If you use a Mac, you can perform a warm boot by selecting Restart… from the Apple Menu.\nWarm booting (restarting a computer) is more common than cold booting since most people leave their computers in sleep mode when they are not using them.  While a home computer may not need to be turned off for months, it may need to be restarted every few days or weeks to complete new software installations.\nThere should be no difference in the way a computer performs after starting from a warm boot vs a cold boot.  In both cases, the computer must complete the full boot sequence.  This process loads all system files, including any that were installed immediately before the computer was restarted.  The only difference is that some machines may perform a more complete power-on self-test (POST) at the beginning of a cold boot."
        ]
    },
    {
        "word": "Waveform",
        "type": [],
        "definition": [
            "A waveform is an image that represents an audio signal or recording.  It shows the changes in amplitude over a certain amount of time.  The amplitude of the signal is measured on the y-axis (vertically), while time is measured on the x-axis (horizontally).\nMost audio recording programs show waveforms to give the user a visual idea of what has been recorded.  If the waveform is very low and not pronounced, the recording was probably very soft.  It the waveform almost fills the entire image, the recording may have been too \"hot\" or recorded with the levels set too high.  Changes in a waveform are also good indicators as too when certain parts of a recording take place.  For example, the waveform may be small when there is just a vocalist singing, but may become much larger when the drums and guitar come in.  This visual representation enables audio producers to locate certain parts of a song without even listening to the recording."
        ]
    },
    {
        "word": "Wavelength",
        "type": [],
        "definition": [
            "Wavelength is the distance between two identical adjacent points in a wave.  It is typically measured between two easily identifiable points, such as two adjacent crests or troughs in a waveform.  While wavelengths can be calculated for many types of waves, they are most accurately measured in sinusoidal waves, which have a smooth and repetitive oscillation.\nWavelength is inversely proportional to frequency.  That means if two waves are traveling at the same speed, the wave with a higher frequency will have a shorter wavelength.  Likewise, if one wave has a longer wavelength than another wave, it will also have a lower frequency if both waves are traveling at the same speed.  The following formula can be used to determine wavelength:\nλ = v \/ ƒ\nThe lowercase version of the Greek letter \"lambda\" (λ) is the standard symbol used to represent wavelength in physics and mathematics.  The letter \"v\" represents velocity and \"ƒ\" represents frequency.  Since the speed of sound is roughly 343 meters per second at 68° F (20° C), 343 m\/s can be substituted for \"v\" when measuring the wavelength of sound waves.  Therefore, only the frequency is needed to determine the wavelength of a sound wave at 68° F.  The note A4 (the A key above middle C) has a frequency of 440 hertz.  Therefore, the wavelength of an A4 sound wave at 68° F is 343 m\/s \/ 440 hz, which equals 0.7795 meters, or 77.95 cm.\nWaves in the electromagnetic spectrum, such as radio waves and light waves, have much shorter wavelengths than sound waves.  Therefore, these wavelengths are typically measured in millimeters or nanometers, rather than centimeters or meters."
        ]
    },
    {
        "word": "Web 2.0",
        "type": [],
        "definition": [
            "Web 2.0 is a term that was introduced in 2004 and refers to the second generation of the World Wide Web.  The term \"2.0\" comes from the software industry, where new versions of software programs are labeled with an incremental version number.  Like software, the new generation of the Web includes new features and functionality that was not available in the past.  However, Web 2.0 does not refer to a specific version of the Web, but rather a series of technological improvements.\nSome examples of features considered to be part of Web 2.0 are listed below:\n\nBlogs - also known as Web logs, these allow users to post thoughts and updates about their life on the Web.\nWikis - sites like Wikipedia and others enable users from around the world to add and update online content.\nSocial networking - sites like Facebook and MySpace allow users to build and customize their own profiles and communicate with friends.\nWeb applications - a broad range of new applications make it possible for users to run programs directly in a Web browser.\n\nWeb 2.0 technologies provide a level user interaction that was not available before.  Websites have become much more dynamic and interconnected, producing \"online communities\" and making it even easier to share information on the Web.  Because most Web 2.0 features are offered as free services, sites like Wikipedia and Facebook have grown at amazingly fast rates.  As the sites continue to grow, more features are added, building off the technologies in place.  So, while Web 2.0 may be a static label given to the new era of the Web, the actual technology continues to evolve and change."
        ]
    },
    {
        "word": "Web Application",
        "type": [],
        "definition": [
            "A web application or \"web app\" is a software program that runs on a web server.  Unlike traditional desktop applications, which are launched by your operating system, web apps must be accessed through a web browser.  \nWeb apps have several advantages over desktop applications.  Since they run inside web browsers,  developers do not need to develop web apps for multiple platforms.  For example, a single application that runs in Chrome will work on both Windows and OS X.  Developers do not need to distribute software updates to users when the web app is updated.  By updating the application on the server, all users have access to the updated version.\nFrom a user standpoint, a web app may provide a more consistent user interface across multiple platforms because the appearance is dependent on the browser rather than the operating system.  Additionally, the data you enter into a web app is processed and saved remotely.  This allows you to access the same data from multiple devices, rather than transferring files between computer systems.\nWhile web applications offer several benefits, they do have some disadvantages compared to desktop applications.  Since they do not run directly from the operating system, they have limited access to system resources, such as the CPU, memory, and the file system.  Therefore, high-end programs, such as video production and other media apps generally perform better as desktop applications.  Web apps are also entirely dependent on the web browser.  If your browser crashes, for example, you may lose your unsaved progress.  Also, browser updates may cause incompatibilities with web apps, creating unexpected issues.\nSome people prefer desktop apps, while others prefer web applications.  Therefore, many software companies now offer both desktop and web versions of their most popular programs.  Common examples include Microsoft Office, Apple iWork, and Intuit TurboTax.  In most cases, files saved in the online version are compatible with the desktop version and vice versa.  For example, if you save a .TAX2013 file in TurboTax Online, you can open and edit the file with the desktop version."
        ]
    },
    {
        "word": "Web Beacon",
        "type": [],
        "definition": [
            "A web beacon is a small image file — usually a transparent 1x1 pixel image — used for tracking purposes.  It may be placed in a webpage or HTML email to record when the content was loaded.\nHow do web beacons work?\nEach image referenced within a webpage is retrieved from a server.  When the image is loaded, the server records a \"hit,\" which is typically saved in the server log.  A log file on the server can be used to determine when the specific image was accessed and also the IP address that accessed the file.\nThe filename of a web beacon may include a question mark (?) followed by an identifying string, such as: beacon.png?user1234.  The web browser will ignore everything after the \".png\" extension, but the entire string will be recorded as a hit by the web server.  This information can be used to determine when a specific web beacon is accessed.\nWhile any image can be used as a web beacon, small transparent GIFs or PNGs are common since they can be placed unobtrusively on a page.  They may also be used by third-party tracking tools that are not accessed from the main web server.  Examples include analytics code like Google Analytics and affiliate links provided by other companies.  An affiliate link, for example, may include a web beacon before or after the link.  The beacon allows the publisher to record the number of impressions (or number times the link is displayed), which is not possible with a plain text link.\nWeb beacons in email marketing\nWeb beacons are commonly used in email marketing to track the number of users who open and view emails.  For instance, when you view a promotional email, a web beacon hidden in the email may record that you have opened it.  This helps email marketers know which campaigns are effective.  Unfortunately, email beacons may also be used for spam purposes, as they can record valid email addresses.  For this reason, many email clients and webmail interfaces do not automatically load images in emails that are likely to be spam."
        ]
    },
    {
        "word": "Web Browser",
        "type": [],
        "definition": [
            "A web browser, or simply \"browser,\" is an application used to access and view websites.  Common web browsers include Microsoft Internet Explorer, Google Chrome, Mozilla Firefox, and Apple Safari.\nThe primary function of a web browser is to render HTML, the code used to design or \"mark up\" webpages.  Each time a browser loads a web page, it processes the HTML, which may include text, links, and references to images and other items, such as cascading style sheets and JavaScript functions.  The browser processes these items, then renders them in the browser window.\nEarly web browsers, such as Mosaic and Netscape Navigator, were simple applications that rendered HTML, processed form input, and supported bookmarks.  As websites have evolved, so have web browser requirements.  Today's browsers are far more advanced, supporting multiple types of HTML (such as XHTML and HTML 5), dynamic JavaScript, and encryption used by secure websites.\nThe capabilities of modern web browsers allow web developers to create highly interactive websites.  For example, Ajax enables a browser to dynamically update information on a webpage without the need to reload the page.  Advances in CSS allow browsers to display responsive website layouts and a wide array of visual effects.  Cookies allow browsers to remember your settings for specific websites.\nWhile web browser technology has come a long way since Netscape, browser compatibility issues remain a problem.  Since browsers use different rendering engines, websites may not appear the same across multiple browsers.  In some cases, a website may work fine in one browser, but not function properly in another.  Therefore, it is smart to install multiple browsers on your computer so you can use an alternate browser if necessary."
        ]
    },
    {
        "word": "Web Design",
        "type": [],
        "definition": [
            "Web design is the process of creating websites.  It encompasses several different aspects, including webpage layout, content production, and graphic design.  While the terms web design and web development are often used interchangeably, web design is technically a subset of the broader category of web development.\nWebsites are created using a markup language called HTML.  Web designers build webpages using HTML tags that define the content and metadata of each page.  The layout and appearance of the elements within a webpage are typically defined using CSS, or cascading style sheets.  Therefore, most websites include a combination of HTML and CSS that defines how each page will appear in a browser.\nSome web designers prefer to hand code pages (typing HTML and CSS from scratch), while others use a \"WYSIWYG\" editor like Adobe Dreamweaver.  This type of editor provides a visual interface for designing the webpage layout and the software automatically generates the corresponding HTML and CSS code.  Another popular way to design websites is with a content management system like WordPress or Joomla.  These services provide different website templates that can be used as a starting point for a new website.  Webmasters can then add content and customize the layout using a web-based interface.\nWhile HTML and CSS are used to design the look and feel of a website, images must be created separately.  Therefore, graphic design may overlap with web design, since graphic designers often create images for use on the Web.  Some graphics programs like Adobe Photoshop even include a \"Save for Web…\" option that provides an easy way to export images in a format optimized for web publishing."
        ]
    },
    {
        "word": "Web Development",
        "type": [],
        "definition": [
            "Web development refers to building, creating, and maintaining websites.  It includes aspects such as web design, web publishing, web programming, and database management.\nWhile the terms \"web developer\" and \"web designer\" are often used synonymously, they do not mean the same thing.  Technically, a web designer only designs website interfaces using HTML and CSS.  A web developer may be involved in designing a website, but may also write web scripts in languages such as PHP and ASP.  Additionally, a web developer may help maintain and update a database used by a dynamic website.\nWeb development includes many types of web content creation.  Some examples include hand coding web pages in a text editor, building a website in a program like Dreamweaver, and updating a blog via a blogging website.  In recent years, content management systems like WordPress, Drupal, and Joomla have also become popular means of web development.  These tools make it easy for anyone to create and edit their own website using a web-based interface.\nWhile there are several methods of creating websites, there is often a trade-off between simplicity and customization.  Therefore, most large businesses do not use content management systems, but instead have a dedicated Web development team that designs and maintains the company's website(s).  Small organizations and individuals are more likely to choose a solution like WordPress that provides a basic website template and simplified editing tools.\nNOTE: JavaScript programming is a type of web development that is generally not considered part of web design.  However, a web designer may reference JavaScript libraries like jQuery to incorporate dynamic elements into a site's design."
        ]
    },
    {
        "word": "Web Forum",
        "type": [],
        "definition": [
            "A Web forum is a website or section of a website that allows visitors to communicate with each other by posting messages.  Most forums allow anonymous visitors to view forum postings, but require you to create an account in order to post messages in the forum.  When posting in a forum, you can create new topics (or \"threads\") or post replies within existing threads.\nWeb forums are available for all kinds of topics.  Examples include software support, help for webmasters, and programming discussions.  While lots of Web forums focus on IT topics, they are not limited to information technology.  There are forums related to health, fitness, cars, houses, teaching, parenting, and thousands of other topics.  Some forums are general, like a fitness forum, while others are more specific, such as a forum for yoga instructors.\nSince Web forums are comprised of user-generated content (UGC), they continue to grow as long as users visit the site and post messages.  The webmaster of a Web forum simply needs to manage the forum, which may require moving, combining, and archiving threads.  It may also involve monitoring postings and removing ones that are inappropriate.  While this can be a large task for popular forums, most forum software, like vBulletin and phpBB, can filter out inappropriate content.\nBecause Web forums are constantly growing, they have become a large part of the Web.  In fact, if you search for help on a certain topic, there is a good chance one or more forum pages will appear in the top results.  After all, if you have a question about something, odds are you're not the only one.  You can use forums to glean knowledge from others who have shared your questions in the past.  Conversely, you can help others by sharing your ideas and answers in an online forum.\nNOTE: Web forums are also called Internet forums, discussion boards, and online bulletin boards."
        ]
    },
    {
        "word": "Web Host",
        "type": [],
        "definition": [
            "In order to publish a website online, you need a Web host.  The Web host stores all the pages of your website and makes them available to computers connected to the Internet.  The domain name, such as \"sony.com,\" is actually linked to an IP address that points to a specific computer.  When somebody enters your domain name into their browser's address field, the IP address is located and Web site is loaded from your Web host.\nA Web host can have anywhere from one to several thousand computers that run Web hosting software, such as Apache, OS X Server, or Windows Server.  Most websites you see on the Web are accessed from a \"shared host,\" which is a single computer that can host several hundred Web sites.  Larger websites often use a \"dedicated host,\" which is a single machine that hosts only one website.  Sites with extremely high amounts of traffic, such as apple.com or microsoft.com, use several computers to host one site.\nIf you want to publish your own website, you'll need to sign up for a \"Web hosting service.\"  Finding a good Web host shouldn't be too hard, since their are thousands available.  Just make sure the Web host you choose offers good technical support and ensures little or no downtime.  You'll usually have to pay a monthly fee that varies depending on how much disk space and bandwidth your site will use.  So it's a good idea to estimate how big your site will be and how much traffic you expect before signing up for a Web hosting service."
        ]
    },
    {
        "word": "Web Page",
        "type": [],
        "definition": [
            "Web pages are what make up the World Wide Web.  These documents are written in HTML (hypertext markup language) and are translated by your Web browser.  Web pages can either be static or dynamic.  Static pages show the same content each time they are viewed.  Dynamic pages have content that can change each time they are accessed.  These pages are typically written in scripting languages such as PHP, Perl, ASP, or JSP.  The scripts in the pages run functions on the server that return things like the date and time, and database information.  All the information is returned as HTML code, so when the page gets to your browser, all the browser has to do is translate the HTML.\nPlease note that a Web page is not the same thing as a Web site.  A Web site is a collection of pages.  A Web page is an individual HTML document.  This is a good distinction to know, as most techies have little tolerance for people who mix up the two terms."
        ]
    },
    {
        "word": "Web Publishing",
        "type": [],
        "definition": [
            "Web publishing, or \"online publishing,\" is the process of publishing content on the Internet.  It includes creating and uploading websites, updating webpages, and posting blogs online.  The published content may include text, images, videos, and other types of media.\nIn order to publish content on the web, you need three things: 1) web development software, 2) an Internet connection, and 3) a web server.  The software may be a professional web design program like Dreamweaver or a simple web-based interface like WordPress.  The Internet connection serves as the medium for uploading the content to the web server.  Large sites may use a dedicated web host, but many smaller sites often reside on shared servers, which host multiple websites.  Most blogs are published on public web servers through a free service like Blogger.\nSince web publishing doesn't require physical materials such as paper and ink, it costs almost nothing to publish content on the web.  Therefore, anyone with the three requirements above can be a web publisher.  Additionally, the audience is limitless since content posted on the web can be viewed by anyone in the world with an Internet connection.  These advantages of web publishing have led to a new era of personal publishing that was not possible before.\nNOTE: Posting updates on social networking websites like Facebook and Twitter is generally not considered web publishing.  Instead, web publishing generally refers to uploading content to unique websites."
        ]
    },
    {
        "word": "Web Ring",
        "type": [],
        "definition": [
            "A Web ring is a way of interlinking related Web sites so that people can visit many similar Web sites by just following the \"Web ring\" link on each page.  Most Web rings allow people to browse backwards or forwards through the sites in the ring, or choose to visit individual sites from a list.  The rings are typically run from a main site which uses a Web scripting application to select random sites and keep the ring up to date.  This includes getting rid of outdated pages and links, and adding new ones.  There are tens of thousands of Web rings for topics like football, cars, celebrities, computers, TV shows, etc.  You can tell if a Web page is part of Web ring if on the bottom of the page it has some huge, obtrusive, off-color, button linking to other sites in the ring."
        ]
    },
    {
        "word": "Web Server",
        "type": [],
        "definition": [
            "A Web server is a computer system that hosts websites.  It runs Web server software, such as Apache or Microsoft IIS, which provides access to hosted webpages over the Internet.  Most Web servers are connected to the Internet via a high-speed connection, offering OC-3 or faster data transmission rates.  A fast Internet connection allows Web servers to support multiple connections at one time without slowing down.\nAny computer can be used as a Web server, as long as it is connected to the Internet and has the appropriate software installed.  However, most Web servers are 1U rack-mounted systems, meaning they are flat, trimmed down computers that can be mounted on a server rack.  Most Web hosting companies have several server racks, which each contain multiple servers.  This is the most space-efficient way to host a large number of websites from a single location.\nWeb servers typically host multiple websites.  Some only host a few, while others may host several hundred.  Web servers that host websites for multiple users are called \"shared hosts.\"  This is the most common type of hosting solution and is used for personal sites, small business sites, and websites run by small organizations.  Web servers that only host websites for a single person or company are called \"dedicated hosts.\"  These types of servers are appropriate for high-traffic websites and sites that require custom server modifications.  Dedicated hosts are also more reliable than shared hosts, since there are fewer sites that can cause bottlenecks or other issues with the server."
        ]
    },
    {
        "word": "Web Service",
        "type": [],
        "definition": [
            "A web service is an application or data source that is accessible via a standard web protocol (HTTP or HTTPS).  Unlike web applications, web services are designed to communicate with other programs, rather than directly with users.\nWhile web services can provide data in a number of different formats, XML and JSON are the most common.  These standard text-based formats can be easily recognized and parsed by another program that receives the data.  The most common web service protocol – SOAP (Simple Object Access Protocol) – simply adds a header to each XML message before it is transferred over HTTP.\nBusiness-oriented web services may use a standard called UDDI.  This formats data in a specific type of XML known as the Web Services Description Language, or WSDL.  While UDDI transmits .WSDL files instead of standard .XML files, it may still use the SOAP protocol to transfer data.\nMost web services provide an API, or a set of functions and commands, that can be used to access the data.  For example, Twitter provides an API that allows developers to access tweets from the service and receive the data in JSON format.  Yelp provides an API for programmers to access information about businesses, which can be displayed directly in an app or website.  Google Maps provides an API for receiving geographical data and directions from the Google Maps database.\nNOTE: An API is a specific set of commands and guidelines used for accessing data, while a web service is an actual service provided by an Internet-based source."
        ]
    },
    {
        "word": "Webcam",
        "type": [],
        "definition": [
            "The term webcam is a combination of \"Web\" and \"video camera.\"  The purpose of a webcam is, not surprisingly, to broadcast video on the Web.  Webcams are typically small cameras that either attach to a user's monitor or sit on a desk.  Most webcams connect to the computer via USB, though some use a Firewire connection.  Webcams typically come with software that allows the user to record video or stream the video on the Web.  If the user has a website that supports streaming video, other users can watch the video stream from their Web browsers.\nWebcams can also be used for video chat sessions with other people.  Instead of broadcasting the video on the Web, users can set up a video chat session with one or more friends and have a conversation with live audio and video.  For example, Apple's iSight camera, which is built into Apple laptops and iMacs, allows users to video chat using the iChat instant messaging program.  Several other chat programs also work with webcams, allowing users to set up video chat sessions with friends.\nSince streaming video over the Internet requires a lot of bandwidth, the video stream is typically compressed to reduce the \"choppiness\" of the video.  The maximum resolution of a webcam is also lower than most handheld video cameras, since higher resolutions would be reduced anyway.  For this reason, webcams are relatively inexpensive compared to most video cameras.  And while they may not be ideal for filming a movie, webcams are great for video chat sessions with friends."
        ]
    },
    {
        "word": "Webhook",
        "type": [],
        "definition": [
            "A webhook is an event notification transmitted via HTTP, the same protocol used for transferring webpage data.  It is typically sent as a POST request, which contains data that is \"posted\" to a specific URL.  The URL defines the location of a script, which processes the data in the POST request.\nWebhooks can be built into any application, including web apps, mobile apps, and desktop software apps.  Specific events can be programmed to generates webhooks, or \"HTTP callbacks,\" which are event notifications sent over HTTP.  The data may be formatted in whatever way the developer chooses, though JSON and XML formatting are commonly used.\nThe POST data, which is sent to a specific URL, is parsed by the corresponding script on a web server.  The script may be written in one of many different server-side scripting languages, such as PHP, JSP, or C#.  It may perform one or more actions, such as saving the data in a database, emailing the information to a specific address, or sending new data back to the source.\nWebhooks are used for a wide variety of purposes.  Examples include notifying businesses of sales, activating and deactivating software programs, updating customer information, and informing developers of software crashes.  Some websites even provide APIs that allow users to send data to a URL when specific events happen.  GitHub, for example, provides a list of events that can trigger a webhook, which developers can use to track changes to projects stored in their online repository.\nWhile webhooks are an effective tool, they require an Internet connection between the data source and the web server to function.  Additionally, a script must be present on the server at the destination URL and it must be able to recognize and parse the POST data.  If the Internet connection or script is not available, the webhook will not work."
        ]
    },
    {
        "word": "Webmail",
        "type": [],
        "definition": [
            "There are two primary ways of checking your e-mail – using an e-mail program like Microsoft Outlook or with a Web-based interface called webmail.  When you check or send e-mail via the Web, you are using webmail.  Most free e-mail services, such as Gmail, Hotmail, and Yahoo! Mail offer webmail interfaces that allow you to send, receive, and organize your e-mail on the Web.  If you own a domain name, many Web hosts also offer a webmail interface to use with your domain name or website.  Some common webmail systems supported by Web hosts include Horde, NeoMail, and SquirrelMail.\nBecause webmail is run from a server, the messages downloaded to your inbox are saved on the mail server.  This is convenient since you can check your mail and browse old messages from any computer as long as you have an Internet connection.  The downside is that, since the messages are not downloaded to your computer, you need an Internet connection to view your messages – even ones that you have already viewed.\nIf you only have one e-mail account, webmail may be the simplest way to check, send, and manage your e-mail.  However, if you regularly use multiple e-mail accounts, a software e-mail client like Microsoft Outlook or Mac OS X Mail may be a better choice."
        ]
    },
    {
        "word": "Webmaster",
        "type": [],
        "definition": [
            "The webmaster is the person in charge of maintaining a Web site.  The jobs of a webmaster include writing HTML for Web pages, organizing the Web site's structure, responding to e-mails about the Web site, and keeping the site up-to-date.  On some Web sites you might see a phrase that says, \"send dead links and other Web site problems to webmaster@domainame.com.\"  At times, being a webmaster can be a rather arduous job.  I received some dead links in the mail one time, and let me tell you, it wasn't pretty."
        ]
    },
    {
        "word": "Website",
        "type": [],
        "definition": [
            "A website, or Web site, is not the same thing as a Web page.  Though the two terms are often used interchangeably, they should not be.  So what's the difference?  To put it simply, a Web site is a collection of Web pages.  For example, Amazon.com is a Web site, but there are millions of Web pages that make up the site.  Knowing the difference between these two terms can save you a lot of embarrassment."
        ]
    },
    {
        "word": "White Balance",
        "type": [],
        "definition": [
            "White balance is a feature many digital cameras and video cameras use to accurately balance color.  It defines what the color white looks like in specific lighting conditions, which also affects the hue of all other colors.  Therefore, when the white balance is off, digital photos and recordings may appear to have a certain hue cast over the image.  For example, fluorescent lights may cause images to have a greenish hue, while pictures taken on a cloudy day may have a blue tint.\nSince different types of lighting affect the way a camera's sensor captures color, most digital cameras and camcorders include an auto white balance (AWB) setting.  The AWB setting automatically adjusts the white balance when capturing a photo or recording video.  However, this setting may not always provide the most accurate color.  Therefore, many cameras and camcorders also include preset white balance settings for different lighting conditions.  Common options include fluorescent light, tungsten light (for typical indoor lighting), cloudy conditions, bright sunlight, and camera flash.  By choosing the appropriate white balance preset, you may be able to capture pictures with more accurate color.\nSome high-end cameras and camcorders also include a custom white balance option.  This feature allows you to take a sample of a white object, such as a white wall or a piece of paper, within the current lighting conditions.  By manually setting the white balance to the white color within the sample image, you can set the white balance with a high degree of accuracy.  Of course, if you find out you have already taken several photos with the incorrect white balance setting, you can adjust the color afterwards with an image editing program.\nSome digital video cameras also include a \"black balance\" setting, which is used to define how black should appear in the current lighting conditions.  However, this setting is used far less commonly than white balance."
        ]
    },
    {
        "word": "White Box Testing",
        "type": [],
        "definition": [
            "White box testing is a type of software testing in which the person understands the application design and source code.  Using these insights, the person can run tests that reveal the most likely bugs or performance issues.\nSince the original developer is the one who best understands the program, he or she is best-suited to perform white box testing.  However, other programmers familiar with the application can also run white box tests.  In either case, the tester must have a solid understanding of the program's purpose and the underlying code.\nWhite box testing helps ensure a program is stable and performant.  It is useful for stress-testing an app with large files or with edge cases that most users won't encounter.  The bug fixing process is efficient since the person who discovers the errors often fixes them.\nOn the other hand, the original developer may not use the app as a typical user and may not find errors or bugs another user may discover.  White box testing is also not ideal for improving an app's feature set or user interface, where outside feedback is especially valuable.\nNOTE: Software testing in which the user has no insight into the internals of a program is called black box testing."
        ]
    },
    {
        "word": "White Paper",
        "type": [],
        "definition": [
            "This term has historically been used to describe a report that states the social or political position of an organization.  In recent years, however, the IT industry has adopted the term to describe articles that explain a certain technology or product.  For example, a company may release a white paper to the public in order to educate consumers about one of their products.  The terminology used may be somewhat technical, but the goal of a white paper is usually to describe the technology or product in terms most people can understand.  That way nerds don't get to have all the fun each time a new technology is invented."
        ]
    },
    {
        "word": "Whitelist",
        "type": [],
        "definition": [
            "A whitelist is a list of items that are granted access to a certain system or protocol.  When a whitelist is used, all entities are denied access, except those included in the whitelist.  The opposite of a whitelist is a blacklist, which allows access from all items, except those included the list.\nThe following are examples of different whitelist applications:\n\nA network administrator may configure a firewall with a whitelist that only allows specific IP addresses to access the network.\nA protected directory within a website may use a whitelist to limit access to certain IP addresses.\nSome e-mail systems can be configured to only accept messages from e-mail addresses that have added to a user's whitelist.\nProgrammers can use whitelists within programs to ensure only certain objects are modified.\n\nWhitelists are a good option when only a limited number of entities need to be granted access.  Because all items not included in a whitelist are denied access, whitelists are considered more secure than blacklists.  However, if only a few entities need to be denied access, a blacklist is more practical."
        ]
    },
    {
        "word": "Whole Number",
        "type": [],
        "definition": [
            "A whole number is an integer that is 0 or greater.  The first five whole numbers are 0, 1, 2, 3, and 4.  They continue upwards to infinity.\nWhole numbers are almost identical to natural numbers except they include 0.  This is important in computer science since numeric ranges often begin with zero.  For example, the first record in an array is 0, rather than one.  24-bit RGB color provides a range of 0 to 255 for red, green, and blue values.  These values are represented by whole numbers rather than natural numbers because they include 0.\nAs the name implies, a whole number is not a fraction.  It also cannot be negative.  Since integers range from negative infinity to positive infinity, whole numbers are a subset of integers."
        ]
    },
    {
        "word": "Wi-Fi",
        "type": [],
        "definition": [
            "Wi-Fi is a wireless networking technology that allows computers and other devices to communicate over a wireless signal.  It describes network components that are based on one of the 802.11 standards developed by the IEEE and adopted by the Wi-Fi Alliance.  Examples of Wi-Fi standards, in chronological order, include:\n\n802.11a\n802.11b\n802.11g\n802.11n\n802.11ac\n\nWi-Fi is the standard way computers connect to wireless networks.  Nearly all modern computers have built-in Wi-Fi chips that allows users to find and connect to wireless routers.  Most mobile devices, video game systems, and other standalone devices also support Wi-Fi, enabling them to connect to wireless networks as well.  When a device establishes a Wi-Fi connection with a router, it can communicate with the router and other devices on the network.  However, the router must be connected to the Internet (via a DSL or cable modem) in order to provide Internet access to connected devices.  Therefore, it is possible to have a Wi-Fi connection, but no Internet access.\nSince Wi-Fi is a wireless networking standard, any device with a \"Wi-Fi Certified\" wireless card should be recognized by any \"Wi-Fi Certified\" access point, and vice-versa.  However, wireless routers can be configured to only work with a specific 802.11 standard, which may prevent older equipment from communicating with the router.  For example, an 802.11n router can be configured to only work with 802.11n devices.  If this option is chosen, devices with 802.11g Wi-Fi chips will not be able to connect to the router, even though they are Wi-Fi certified.\nNOTE: The name \"Wi-Fi\" is similar to \"Hi-Fi,\" which is short for \"High Fidelity.\"  However, \"Wi-Fi\" is not short for \"Wireless Fidelity,\" but is simply a name chosen by the Wi-Fi Alliance."
        ]
    },
    {
        "word": "Wi-Fi 6",
        "type": [],
        "definition": [
            "Wi-Fi 6 (IEEE 802.11ax) is the sixth generation of Wi-Fi technology.  It provides faster wireless speeds and handles multiple connections more efficiently than the previous 802.11ac standard, also known as Wi-Fi 5.\nSpecs\nWi-Fi 6 supports data transfer rates of up to 1,200 Mbps (1.2 gigabits per second) per stream.  That is roughly 3x faster than Wi-Fi 5's top speed of 433 Mbps per stream.  Wi-Fi 5 allows three simultaneous streams, for a total of 1,400 Mbps.  Wi-Fi 6 supports four streams, for a theoretical maximum speed of 4,800 Mbps.\nThe Wi-Fi 6 standard supports channel bandwidths of 20, 40, 80, and 160 MHz.  It can operate on either 2.4 GHz or 5 GHz frequencies and is backward-compatible with older devices that do not support 802.11ax.  An extension of the standard, called Wi-Fi 6E, provides a new 6 GHz frequency band to help reduce wireless congestion on the commonly-used 5 GHz band.\nThe 5 GHz band allows faster data transmission rates than 2.4 GHz, but the 2.4 GHz band has longer range.\nTechnologies\nWi-Fi 6 includes two primary technologies that improve the wireless network efficiency: OFDMA and Multi-user MIMO.\n\nOFDMA (Orthogonal Frequency Division Multiple Access) enables connected clients to share channels.  It reduces latency and improves efficiency, especially in busy wireless networks\nMU-MIMO (Multi-User Multiple Input, Multiple Output) allows more data to be transferred at one time.  It enables access points to communicate with up to eight devices simultaneously.\n\nRequirements\nTo use Wi-Fi 6, you need a Wi-Fi 6 router and a Wi-Fi 6 device, such as a smartphone or laptop with an 802.11ax wireless adapter.  Wi-Fi technologies are backward-compatible, but if either end of the connection does not support Wi-Fi 6, the devices will communicate via the highest common standard.\nNOTE: While Wi-Fi 6 is theoretically several times faster than Wi-Fi 5, actual data transfer speeds are rarely close to the maximum transmission rate.  Several factors can affect download speeds over Wi-Fi, including signal strength, number of active devices, and the Internet speed itself."
        ]
    },
    {
        "word": "WiMAX",
        "type": [],
        "definition": [
            "WiMAX is a wireless communications standard designed for creating metropolitan area networks (MANs).  It is similar to the Wi-Fi standard, but supports a far greater range of coverage.  While a Wi-Fi signal can cover a radius of several hundred feet, a fixed WiMAX station can cover a range of up to 30 miles.  Mobile WiMAX stations can broadcast up to 10 miles.\nWhile Wi-Fi is a good wireless Internet solution for home networks and coffee shops, it is impractical for larger areas.  In order to cover a large area, multiple Wi-Fi repeaters must be set up at consistent intervals.  For areas that span several miles, this is a rather inefficient method to provide wireless access and typically requires lots of maintenance.  WiMAX, on the other hand, can cover several miles using a single station.  This makes it much easier to maintain and offers more reliable coverage.\nWiMAX is also known by its technical name, \"IEEE 802.16,\" which is similar to Wi-Fi's technical specification of 802.11.  It is considered the second generation broadband wireless access (BWA) standard and will most likely be used along with Wi-Fi, rather than replace it.  Since WiMAX has such a large signal range, it will potentially be used to provide wireless Internet access to entire cities and other large areas.  In fact, some proponents of WiMAX predict it will eventually spread Internet access to all parts of the globe."
        ]
    },
    {
        "word": "Widget",
        "type": [],
        "definition": [
            "A widget is a small program run by the Mac OS X Dashboard or the Yahoo! Widget Engine.  Dashboard is only available on Macintosh computers, while the Yahoo! Widget Engine is available for both Windows and Macintosh platforms.  Dashboard and Yahoo! widgets are not compatible with each other, so similar widgets must be created separately for each widget engine.\nSome common widgets include weather guides, stock lists, flight trackers, calendars, and search boxes for various websites.  Widgets are convenient tools since they are always only one click or keystroke away.  By default, pressing the F12 key brings up Dashboard widgets on the Mac, while pressing the F8 key brings up Yahoo! widgets.  When widgets are active, they jump to the front of the screen.  When Dashboard widgets are not active, they completely disappear, while Yahoo! widgets move to the background.\nThe idea of widgets started with a program called Konfabulator, which allowed many small programs to run simultaneously on the computer's desktop.  Apple introduced a similar program, called Dashboard, with the release of Mac OS X 10.4 Tiger.  Shortly after, in 2005, Yahoo! bought Konfabulator and now markets the program as the Yahoo! Widget Engine.  While both widget engines come with several standard widgets, there are thousands more available online.\nA few sample Dashboard widgets include:\n\nTech Terms Computer Dictionary Widget\nFile Extension Lookup Widget\nChat Reference Widget\n"
        ]
    },
    {
        "word": "Wiki",
        "type": [],
        "definition": [
            "A wiki is a Web site that allows users to add and update content on the site using their own Web browser.  This is made possible by Wiki software that runs on the Web server.  Wikis end up being created mainly by a collaborative effort of the site visitors.  A great example of a large wiki is the Wikipedia, a free encyclopedia in many languages that anyone can edit.  The term \"wiki\" comes from the Hawaiian phrase, \"wiki wiki,\" which means \"super fast.\"  I guess if you have thousands of users adding content to a Web site on a regular basis, the site could grow \"super fast.\""
        ]
    },
    {
        "word": "Wildcard",
        "type": [],
        "definition": [
            "In computing, a wildcard refers to a character that can be substituted for zero or more characters in a string.  Wildcards are commonly used in computer programming, database SQL search queries, and when navigating through DOS or Unix directories via the command prompt.\nBelow are some popular uses for wildcards:\n\nRegular Expressions - A period (.) matches a single character, while .* matches zero or more characters and .+ matches one or more characters.\n&#9654; Example: $pattern = \"Mac(.*)\"\nSQL Queries - A percent symbol (%) matches zero or more characters, while an underscore (_) matches a single character.\n&#9654; Example: SELECT * FROM Computers WHERE Platform LIKE 'Mac%'\n\nDirectory Navigation - An asterisk (*) matches zero or more characters, while a question mark (?) matches a single character.\n&#9654; Example: dir *.exe\n\nIn the examples above, wildcards are used to search for partial matches instead of exact matches.  This can be helpful when searching for files or looking up information from a database."
        ]
    },
    {
        "word": "Win32",
        "type": [],
        "definition": [
            "Win32 is the Windows application programming interface (API) for developing 32-bit applications.  It has been used for Windows 95, Windows 98, Windows NT, and newer Windows operating systems.  This means that if you use Windows 95 or later, you can run 32-bit applications on your computer.  Win32 is a term that is important to programmers, but is not crucial for the average user to know.  Just know that if you have Windows 95 or later, you can run Win32 applications."
        ]
    },
    {
        "word": "Window",
        "type": [],
        "definition": [
            "A window is an area on the screen that displays information for a specific program.  This often includes the user interface GUI as well as the program content.  Windows are used by most applications as well as the operating system itself.  A typical window includes a title bar along the top that describes the contents of the window, followed by a toolbar that contains user interface buttons.  Most of the window's remaining area is used to display the content.\nExamples:\n\nWeb Browser windows:\nThe top of a typical Web browser window contains a title bar that displays the title of the current page.  Below the title is a toolbar with back and forward buttons, an address field,  bookmarks, and other navigation buttons.  Below the toolbar is the content of the current Web page.  The bottom of the window may contain a status bar that displays the page loading status\nWord Processing windows:\nA window used by a word processing program, such as Microsoft Word, typically includes buttons for page and text formatting, followed by a ruler that defines the document area.  Below the ruler is the main page area used for entering text.\nOperating System windows:\nWindows used by the operating system typically include navigation buttons along the top and shortcuts to folders and other locations on the left side of the window.  The rest of the window is used to display icons or lists of files and folders.\n\nMost windows can be opened, closed, resized, minimized, and moved around the screen.  The close, minimize, and zoom buttons are located on the title bar (on the right side on Windows and the left side on Macs).  Minimizing a window will close the contents of the window, but store a reference to it in the Taskbar (Windows) or the Dock (Mac).  Closing a window will make it disappear completely (so you may be asked to save your changes first).  To move a window, click on the title bar and drag the window where you want it.  To resize a window, either click the Zoom button in the title bar or click the lower right-hand corner and expand or contract the window to the size you want."
        ]
    },
    {
        "word": "Windows",
        "type": [],
        "definition": [
            "Windows is a desktop operating system developed by Microsoft.  For the past three decades, Windows has been the most popular operating system for personal computers.\nEach version of Windows comes with a graphical user interface that includes a desktop with icons and a task bar that is displayed at the bottom of the screen by default.  The Windows \"File Explorer\" allows users to open multiple windows, browse folders, and open files and applications.  Most Windows versions include a Start menu, which provides quick access to files, settings, and the Windows search feature.\nThe task bar at the bottom of the screen is an easy way to identify a Windows desktop.  Conversely, the macOS desktop has a menu bar at the top of the screen.  In Windows, the close, minimize, and zoom buttons are located on the right side of each window's title bar, while in macOS, they are located on the left.\nThe first version of Windows was released in 1985.  Since then, the OS has gone through several major updates.  A few of the most notable Windows releases include:\n\nWindows 3.1 (1992)\nWindows 95 (1995)\nWindows XP (2001)\nWindows 7 (2009)\nWindows 10 (2015)\n\nThe above versions of Windows had long lifespans and were well received by users.  Some of the less-popular versions of Windows, which had shorter lifespans, include:\n\nWindows 98 (1998)\nWindows Me (2000)\nWindows Vista (2006)\nWindows 8 (2012)\n\nMicrosoft has released most versions of Windows with multiple editions, tailored for different users.  For example, Windows 10 is available in \"Home\" and \"Pro\" editions.  The Home edition is sufficient for most users, while the Pro edition includes additional networking and administrative features useful in corporate workspaces.\nWindows runs on standard x86 hardware, such as Intel and AMD processors.  Unlike Apple, Microsoft licenses the OS to multiple manufacturers.  Therefore, numerous companies, such as Dell, HP, Acer, Asus, Lenovo, sell Windows PCs.  Microsoft develops its own line of Windows Surface laptops as well.\nSoftware programs written for Windows may be called apps, applications, or executable files.  Regardless of their label, Windows software programs have an .EXE file extension.  64-bit versions of Windows run both 32 and 64-bit apps, while 32-bit versions only run 32-bit applications."
        ]
    },
    {
        "word": "Windows 10",
        "type": [],
        "definition": [
            "Windows 10 is a major version of the Microsoft Windows operating system that was released on July 29, 2015.  It is built on the Windows NT kernel and follows Windows 8.\nPart of the reason Microsoft decided to name the 2015 release \"Windows 10\" (and skipped \"Windows 9\") is because the operating system is designed to be a new direction for Microsoft.  One of the primary aims of Windows 10 is to unify the Windows experience across multiple devices, such desktop computers, tablets, and smartphones.  As part of this effort, Microsoft developed Windows 10 Mobile alongside Windows 10 to replaces Windows Phone – Microsoft's previous mobile OS.  Windows 10 also integrates other Microsoft services, such as Xbox Live and the Cortana voice recognition assistant.\nWhile Windows 10 includes many new features, it also brings back the Start Menu, which was dropped in Windows 8.  The new and improved Start Menu provides quick access to settings, folders, and programs and also includes tiles from the Windows 8 interface.  The bottom of the Windows 10 Start Menu includes a search bar that allows you to search both your local PC and the web.\nAnother major change in Windows 10 is the introduction of the \"Edge\" web browser, which is designed to replace Internet Explorer (IE).  While the OS still includes IE, Edge is the default browser in Windows 10.  Other new features include Continuum, which automatically optimizes the user interface depending on whether you are using an external keyboard or touchscreen, and Action Center, which is similar to the Notifications bar in OS X.  Windows 10 also supports multiple desktops on a single monitor and provides Snap Assist, a feature that helps organize windows on the screen.\nOne of the biggest differences between Windows 10 and previous releases of Windows is that the Windows 10 upgrade is available for free to Windows 7 and Windows 8 users.  However, Microsoft still charges a licensing fee for copies of Windows 10 shipped with new computers and for non-upgrade purchases.  The full version of Windows 10 Home is available for $120 and Windows 10 Pro costs $200."
        ]
    },
    {
        "word": "Windows 11",
        "type": [],
        "definition": [
            "Windows 11 is a major version of the Microsoft Windows operating system.  It was released on October 5, 2021, and follows Windows 10, the previous version of Windows, released in 2015.\nThe Windows 11 user interface is similar to Windows 10 but includes several minor changes.  For example, the task bar, left-aligned since Windows 95, is centered by default.  Windows have slightly rounded corners (like macOS and a subtle blurred translucent effect.  \"Snap Layouts\" make it easy to organize multiple windows in a preset grid.\nWidgets in Windows 11 provide a quick way to view frequently-accessed information, such as weather, calendar events, and to-do lists.  Chat from Microsoft Teams is integrated into the OS, making it easy to connect with other users.  The Microsoft Store provides a simple way to find and download applications.\nWindows 11 is a desktop operating system, meaning it is designed to run on desktop and laptop computers.  While it is not a mobile OS, Windows 11 supports touchscreen input, available on many Windows machines.  It also supports several \"touch gestures\" for scrolling, zooming, and hiding and showing windows.\nThe Windows 11 system requirements at the time of launch are:\n\nCPU: 1 GHz or faster 64-bit processor (such as an Intel or AMD x86 CPU)\nGPU: Graphics card or integrated processor compatible with DirectX 12 or later\nRAM: 4 GB or more\nStorage: 64 GB storage device or larger\nOther hardware: Trusted Platform Module (TPM) chip, Secure Boot capable firmware\nAdditional requirements: Internet connectivity, Microsoft account\n"
        ]
    },
    {
        "word": "Windows 7",
        "type": [],
        "definition": [
            "Windows 7 is an operating system released by Microsoft on October 22, 2009.  It follows the previous (sixth) version of Windows, called Windows Vista.\nLike previous versions of Windows, Windows 7 has a graphical user interface (GUI) that allows you to interact with items on the screen using a keyboard and mouse.  However, Windows 7 is also includes a feature called \"Windows Touch\" that supports touchscreen input and multitouch functionality.  For example, you can right-click a file by touching it with one finger and tapping it with another.  You can also zoom in on an image by touching it with two fingers, then spreading your fingers apart.  Windows 7 is bundled with several touch-ready programs that are designed for touchscreen use.\nWindows 7 also includes several new multimedia features.  One example is \"Play To,\" a program that allows you to stream audio and video to different computers or devices within your house.  The \"HomeGroup\" feature makes it easy to share media files and other data between computers.  It also makes it possible to share printers on a home network.  The \"Remote Media Streaming\" feature allows you to access the music, video, and photo libraries on your computer from remote locations.\nThe search feature in Windows 7, called \"Windows Search,\" allows you to see results of searches as soon as you start typing in the search box.  Windows Search categorizes the results by file type and displays text snippets that indicate where the search phrase was found in each result.  After the search results are returned, it is possible to narrow the results by filtering them by date, file type, file size, and other parameters.  You can search local drives, external hard drives, and networked drives all using the standard Windows Search interface.\nWindows 7 is available in the following editions:\n\nWindows 7 Home Premium - the standard version installed with most home PCs and includes all of the features listed above.\nWindows 7 Professional - typically installed on business computers and includes all the Home Premium features as well as additional features such as Windows XP mode (XPM) and Domain Join.\nWindows 7 Ultimate - the most complete version, which has all of the Professional features as well as BitLocker data protection and additional language support.\n\nThe system requirements for Windows 7 are:\n\n1 GHz or faster 32-bit (x86) or 64-bit (x64) processor\n1 GB of RAM or 2 GB of RAM for the 64-bit version\n16 GB of available hard disk space or 20 GB for the 64-bit version\nDirectX 9 graphics device with WDDM 1.0 or higher driver\n"
        ]
    },
    {
        "word": "Windows 8",
        "type": [],
        "definition": [
            "Windows 8 is a version of the Microsoft Windows operating system released on October 26, 2012.  It was the first major update to Windows since Windows 7, which was released over three years earlier.\nWhile Windows 7 offered several performance improvements over Windows Vista, there were few changes to the look and feel of the operating system. Windows 8, on the other hand, provides an entirely new user interface compared to its predecessor.  This interface (initially called \"Metro,\" but now labeled the \"Modern UI\" style) displays a collection of tiles rather than a traditional desktop environment.  These tiles provide access to commonly used programs and tools, such as Internet Explorer, Maps, Weather, Photos, Videos, Music, and the Windows Store.  Several of the tiles, such as the Weather and social networking tiles are updated in real-time.\nThe goal of the new Windows 8 interface is to function on both traditional desktop PCs, such as desktop computers and laptops, as well as tablet PCs.  Windows 8 supports both touchscreen input as well as traditional input devices, such as a keyboard and mouse.  This flexibility allows Windows 8 to run on a wide range of desktop and portable devices and it is especially well-suited for hybrid computers that include a touchscreen as well as a keyboard and mouse.\nFor users that don't need the touchscreen functionality, Windows 8 still includes the traditional Windows desktop and Windows Explorer, which can be accessed from the home screen.  In other words, if you don't want to use the new tile-based interface, you can simply bypass that \"layer\" of the interface and access the Windows desktop you are used to.  Microsoft has also provided several performance improvements to Windows Explorer and added a few new interface elements, such as \"File,\" \"Home,\" \"Share,\" and \"View\" tabs to the top of each window.  Each of these tabs includes one-click access to multiple options.  For example, the \"View\" tab allows you to show hidden files and show or hide file extensions, two options that used to require several steps to change in previous versions of Windows."
        ]
    },
    {
        "word": "Windows RT",
        "type": [],
        "definition": [
            "Windows RT is an operating system developed by Microsoft for mobile PCs with ARM-based CPUs.  It was released on October 26, 2012, the same day as Windows 8 and the Microsoft Surface tablet.\nThe Windows RT user interface is identical to Windows 8 and includes the same tile-based Start screen.  It also provides access to the traditional Windows desktop, where you can manage files and folders and run applications.  While you can use Windows RT with a standard keyboard and mouse, it is designed primarily for touchscreen input.  The operating system features an \"always on\" design, which means it receives mail, contacts, and calendar updates even while in standby mode.\nWhile Windows RT looks and feels like Windows 8, it cannot run all of the applications that Windows 8 runs.  Instead, Windows RT can only run software programs downloaded from the Windows Store.  If you attempt to install an unknown third party app in Windows RT, you will see an error message saying the app cannot run on the PC.  In order to install a new program on Windows RT, you must first click the Store tile on the Start screen and download the program directly from the Windows Store."
        ]
    },
    {
        "word": "Windows Vista",
        "type": [],
        "definition": [
            "Windows Vista is an operating system developed by Microsoft.  The business version was released at the end of 2006, while the consumer version shipped on January 30, 2007.\nThe Vista operating system includes an updated look from Windows XP, called the \"Aero\" interface.  The desktop, windows, icons, and toolbars have a smoother 3D look, similar to the Mac OS X interface.  These graphics are generated using the new Windows Presentation Foundation (WPF) graphics subsystem included with Windows Vista.  Other improvements include faster-indexed file searching (which can locate text within files), built-in web services called the Windows Communication Foundation (WCF), support for the new XML Paper Specification (XPS) document format, and numerous security improvements.\nWindows Vista was code-named \"Longhorn\" for much of the development process.  The operating system was originally slated to ship in 2003 as an update to Windows XP, but Microsoft decided to make additional updates to the operating system and scheduled it for release in 2005.  Several delays pushed back the release date to 2006 and eventually to the beginning of 2007.  To ship the consumer version by early 2007, the new file system called Windows Future Storage, or WinFS, was left out of the release and was later canceled.\nOverall, Vista is a significant upgrade to the Windows operating system.  The interface feels more modern, file navigation has been improved, and system security has been designed to be stronger than Windows XP.\nIf you plan to purchase Windows Vista for your system, you can choose one of five options:\n\nBusiness - designed for small business users and streamlined for work-oriented tasks\nEnterprise - meant for large, global organizations with complex IT infrastructures\nHome Basic - the most basic version of Vista designed for the average home user\nHome Premium - a more robust home version that includes extra security and multimedia features\nUltimate - includes all the features from the Home Premium and Business versions of Vista\n\nThe absolute minimum system requirements for Vista are:\n\n800 MHz processor\n512 MB of RAM\n20 GB hard drive with at least 15 GB of available space\nSuper VGA graphics support\nCD-ROM drive\n\nHowever, Microsoft recommends the following system requirements:\n\n1 GHz 32-bit (x86) or 64-bit (x64) processor\n1 GB of RAM\n40 GB hard drive with at least 15 GB of available space\nDirectX 9 graphics support with a WDDM Driver\n128 MB (minimum) of video RAM\nPixel Shader 2.0 in hardware\n32 bits per pixel\nDVD-ROM drive\nAudio Output\nInternet access\n\nBecause many of Vista's new features require the recommended system requirements, it may be best to upgrade your operating system only if your computer meets or exceeds the recommended specifications.  Otherwise, waiting to buy a new machine with Windows Vista preinstalled is probably the best choice."
        ]
    },
    {
        "word": "Windows XP",
        "type": [],
        "definition": [
            "Microsoft Windows XP was introduced in 2001 and is the most significant upgrade to the Windows operating system since Windows 95.  The previous version of Windows, called Windows Me (or Millennium Edition) still had the look and feel of Windows 95 and was known to have stability issues and incompatibilities with certain hardware.\nWindows XP addressed many issues of its predecessor and added a number of other improvements as well.  It is a stable operating system since it is built on the Windows 2000 kernel, which is known for its reliability.  XP also has a new, more modern look, and an interface that is more easy to navigate than previous versions of Windows.  While not written from the ground up, like Mac OS X, Windows XP is a substantial system update.  The letters \"XP\" stand for \"eXPerience,\" meaning the operating system is meant to be a new type of user experience."
        ]
    },
    {
        "word": "Winsock",
        "type": [],
        "definition": [
            "Winsock.  \"Isn't that one of those tube-like flags that tell which way the wind is blowing?\"  Actually, that's a \"windsock,\" which was first used by airline pilots to tell how fast and what direction the wind was blowing.\nWinsock is actually short \"Windows sockets,\" which are files that allow Windows programs to connect to the Internet and other computers.  Technically, Winsock is an \"Application Programming Interface (API),\" that developers use to make their programs network-enabled.  16-bit applications use a file called WINSOCK.DLL and 32-bit applications use a file called WSOCK32.DLL.  Both of these files are libraries of networking functions (based on TCP\/IP), but they can differ from computer to computer, depending on the vendor.  If you use Windows, you probably use Winsock on a regular basis.  Fortunately, unless you're a Windows programmer, you don't have to understand exactly how it works."
        ]
    },
    {
        "word": "Wired",
        "type": [],
        "definition": [
            "In computing terminology, the term \"wired\" is used to differentiate between wireless connections and those that involve cables.  While wireless devices communicate over the air, a wired setup uses physical cables to transfer data between different devices and computer systems.\nA wired network is a common type of wired configuration.  Most wired networks use Ethernet cables to transfer data between connected PCs.  In a small wired network, a single router may be used to connect all the computers.  Larger networks often involve multiple routers or switches that connect to each other.  One of these devices typically connects to a cable modem, T1 line, or other type of Internet connection that provides Internet access to all devices connected to the network.\nWired may refer to peripheral devices as well.  Since many keyboards and mice are now wireless, \"wired\" is often used to describe input devices that connect to a USB port.  Peripherals such as monitors and external hard drives also use cables, but they are rarely called wired devices since wireless options are generally not available.\nWhile many peripherals are now wireless, some users still prefer wired devices, since they have a few benefits over their wireless counterparts.  For example, an Ethernet connection is not prone to signal interference that can slow down Wi-Fi connections.  Additionally, wired network connections are often faster than wireless ones, which allows for faster data transfer rates.  Some users also prefer wired peripherals since their is no need to replace batteries on a regular basis.  Gamers especially prefer wired keyboards and mice since they have lower latency and can be backlit, thanks to the power provided by the USB connection."
        ]
    },
    {
        "word": "Wireframe",
        "type": [],
        "definition": [
            "A wireframe is a three-dimensional model that only includes vertices and lines.  It does not contain surfaces, textures, or lighting like a 3D mesh.  Instead, a wireframe model is a 3D image comprised of only \"wires\" that represent three-dimensional shapes.\nWireframes provide the most basic representation of a three-dimensional scene or object.  They are often used as the starting point in 3D modeling since they create a \"frame\" for 3D structures.  For example, a 3D graphic designer can create a model from scratch by simply defining points (vertices) and connecting them with lines (paths).  Once the shape is created, surfaces or textures can be added to make the model appear more realistic.\nThe lines within a wireframe connect to create polygons, such as triangles and rectangles, that together represent three-dimensional shapes.  The result may be as simple as a cube or as complex as a three-dimensional scene with people and objects.  The number of polygons within a wireframe is typically a good indicator of how detailed the 3D model is.\n3D Rendering\nSince wireframes only contain vertices and lines, they can be rendered very quickly.  Therefore, a complex 3D image or animation might be reduced to a wireframe model so it can be rendered and edited in real-time.  While wireframe representations of 3D animations were commonly used in early 3D design, today's GPUs are so fast, they can often render fully shaded surfaces and textures in real-time with little to no lag.\nNOTE: A \"wireframe\" may also refer to a mockup or prototype of a website layout or app design."
        ]
    },
    {
        "word": "Wireless",
        "type": [],
        "definition": [
            "In the computing world, the term \"wireless\" can be rather ambiguous, since it may refer to several different wireless technologies.  The two most common types of wireless capabilities computers have are Wi-Fi and Bluetooth.\nWi-Fi is the technology used for wireless networking.  If your computer has a wireless card, it is most likely Wi-Fi compatible.  The wireless card transmits to a wireless router, which is also based on the Wi-Fi standard.  Wireless routers are often connected to a network, cable modem, or DSL modem, which provides Internet access to anyone connected to the wireless network.\nBluetooth is the technology often used for wireless keyboards and mice, wireless printing, and wireless cell phone headsets.  In order to use a device such as a Bluetooth keyboard or mouse, your computer must be Bluetooth-enabled or have a Bluetooth adapter installed.\nComputers may also use other wireless technologies aside from Wi-Fi and Bluetooth.  Products such as remote controls and wireless mice may use infrared or other proprietary wireless technologies.  Because of the many wireless options available, it is a good idea to check the system requirements of any wireless device you are considering buying."
        ]
    },
    {
        "word": "Wizard",
        "type": [],
        "definition": [
            "When most people think of a wizard, they think of an old man with magical powers.  This, as with many other computer definitions, has no correlation with the technical term.  In computer terminology, a wizard is a part of a program that guides you through certain steps.  For example, a wizard in Microsoft Word would help you create and format a new document according to your needs.  This is helpful when creating a résumé, outline, invoice, etc.  Some other examples of wizards are the Finale 2000 wizard, which helps you create a new music composition with your desired instruments, and the PowerPoint wizard, which helps you set up a presentation using a certain theme.\nBasically, a wizard acts as a guide for creating a new document in a software program.  Though wizards can be helpful, sometimes they can be more of a hassle than a help for experienced users.  Some users would rather just create a new document from scratch, without using a wizard.  This is because wizards typically don't offer as much customization as an experienced user may want.  Finally, be sure not to confuse a \"wizard\" with a \"template.\"  A template is a pre-formatted document that has already been created, whereas a wizard is a step-by-step guide that helps you create your own document."
        ]
    },
    {
        "word": "Word",
        "type": [],
        "definition": [
            "Microsoft Word is a word processing program developed for the Windows and Macintosh platforms.  It is included in all editions of the Microsoft Office suite and is also available as a standalone program for Windows.\nThe first version of Word was released for DOS in 1983 and had a text-only interface.  In 1985, Microsoft released a graphical version Word for the Mac OS.  Microsoft released \"Word for Windows\" in 1989, and it soon became the most popular word processing program on any platform.  In 1995, Microsoft changed the name of Word for Windows to simply \"Word\" and bundled the program with Office 95.  Since then, several versions of Word have been released for both the Windows and Macintosh platforms.\nWhile early versions of Word served as basic text editors, modern versions include many advanced word processing features.  Some examples include spellchecking, auto-correct, text formatting, styles, and custom page layouts.  Word documents may also include headers, footers, images, shapes, tables, charts, and \"SmartArt,\" which is used for visually representing concepts and ideas.  Word also includes a \"Track Changes\" feature that allows editors to review documents and add comments and make changes.\nFor many years, Word saved documents in a proprietary binary format.  However, as other office suites began using open formats, Microsoft transitioned to the \"Office Open XML\" format.  This format was introduced with Office 2007 for Windows and Office 2008 for Mac OS X.  Now, Microsoft Word saves documents in a standard XML format that is compressed using Zip compression.  This new format is more compatible with other software and uses less disk space.\nFile extensions: .DOC, .DOCX, .DOT, .DOTX"
        ]
    },
    {
        "word": "Word Processor",
        "type": [],
        "definition": [
            "A word processor, or word processing program, does exactly what the name implies.  It processes words.  It also processes paragraphs, pages, and entire papers.  Some examples of word processing programs include Microsoft Word, WordPerfect (Windows only), AppleWorks (Mac only), and OpenOffice.org.\nThe first word processors were basically computerized typewriters, which did little more than place characters on a screen, which could then be printed by a printer.  Modern word processing programs, however, include features to customize the style of the text, change the page formatting, and may be able to add headers, footers, and page numbers to each page.  Some may also include a \"Word Count\" option, which counts the words and characters within a document.\nWhile all these features can be useful and fun to play with, the most significant improvement over the typewriter is the word processor's ability to make changes to a document after it has been written.  By using the mouse, you can click anywhere within the text of a document and add or remove content.  Since reprinting a paper is much easier than retyping it, word processing programs have make revising text documents a much more efficient process.\nThe term \"text editor\" can also be used to refer to a word processing program.  However, it is more commonly used to describe basic word processing programs with limited features."
        ]
    },
    {
        "word": "Word Wrap",
        "type": [],
        "definition": [
            "Word wrapping is when a line of text automatically \"wraps\" to the next line when it gets to the end of a page or text field.  This is different than a \"word rap,\" which involves rhyming words to a rhythmic beat, though that may be more fun than typing.  Most word processing programs use word wrap to keep the text within the default margins of the page.  Without the word wrap feature, text would continue on one line until the user pressed \"Enter\" or \"Return\" to insert a line break.\nMost programs that incorporate word wrap take the first word that does not fit on a line of text and move it to the beginning of the next line.  Advanced word processing programs can hyphenate long words at appropriate places.  While it is uncommon, sometimes a word, or string of characters ,will take up more than one line.  In this case, the word wrap feature will simply continue the string of characters onto the next line."
        ]
    },
    {
        "word": "WordArt",
        "type": [],
        "definition": [
            "WordArt is a text modifying feature in Microsoft Word, a popular word processing program.  It includes effects such as shadows, outlines, colors, gradients, and 3D effects that can be added to a word or phrase.  WordArt can also bend, stretch, skew, or otherwise modify the shape of the text.\nWordArt can be added within a Word document by selecting Insert&rarr;Picture&rarr;WordArt...  This opens the WordArt dialog box, which gives the user several text styles to choose from.  Once a style has been selected, the user types the text that the style will be applied to and the result is saved as an image within the document.  The WordArt can then be moved or modified by selecting Modify&rarr;WordArt.\nThe OpenOffice.org office suite has a similar feature to WordArt, called FontWork.  Photoshop 7 and later also includes a Warp Text feature, which provides similar text modification options."
        ]
    },
    {
        "word": "WordPress",
        "type": [],
        "definition": [
            "WordPress is a free content management system used to build and maintain websites.  Its ease of use and unique blogging features have helped it become the most popular blogging tool on the web.\nWordPress provides a web-based user interface for designing, publishing, and updating websites.  Instead of writing HTML, you can simply choose one of many different website templates or \"themes\" that has a design you like.  You can then modify the layout and build a custom navigation bar.  Once the site layout is complete, you can use WordPress' online interface to create individual pages.  Each page may include formatted text, links, images, and other media.  You can publish completed webpages or blog updates by simply clicking the Publish button.\nThe WordPress interface makes it easy for anyone without web development experience to create and publish a website.  The built-in blogging tools provide a simple way to track individual posts, visitors, and user comments.  If WordPress' built-in capabilities are not sufficient for your needs, you can install different plug-ins that provide extra features.  Examples include social media buttons, image galleries, and web forum tools.\nWhile there are thousands of WordPress templates and plug-ins available, the WordPress system still has its limitations.  Because it is a template-based service, you must begin with a pre-built website rather than create pages from scratch.  Additionally, you cannot insert scripts or maintain a database with the same level of control that a custom website offers.  Therefore, most companies and large organizations still hand-code websites or develop them using a WYSIWYG editor like Dreamweaver.\nFor many individuals, however, WordPress provides a great blogging system that is both convenient and free.  There is no cost to sign up for WordPress or to use the service.  It is even free to publish a custom website or blog at the wordpress.com domain (such as custom-name.wordpress.com).  However, if you want a custom website address or need extra features, such as more disk space or premium themes, WordPress offers \"Premium\" and \"Business\" services for an annual fee."
        ]
    },
    {
        "word": "Workstation",
        "type": [],
        "definition": [
            "It has been said that a bus stops at a bus station and a train stops at a train station, so what happens at a workstation?  Hm...\nActually, a workstation is a place where work gets done.  It refers to a computer (and often the surrounding area) that has been configured to perform a certain set of tasks, such as photo editing, audio recording, or video production.  An office may have several workstations for different purposes, which may be assigned to certain employees.  For example, one workstation may be used for scanning and importing images, while another is used for editing images.\nBecause workstations often work together like in the example above, they are commonly networked together.  This allows them to send files back and forth over the network, which is important for various types of media production.  To use another example, a user at a photo-editing workstation may prepare images to be used in a video clip.  Once the images are ready, he may send them to another user at a video-editing workstation, where they are incorporated into the video.  Once the video has been put together, the video file may be sent to another user at an audio production workstation where the soundtrack and other sound effects are added.\nWhile workstations are often part of a network, they can be standalone machines as well.  Even a home computer can be a workstation if it is used for certain kinds of work.  So if you want to sound professional, the next time you send an e-mail to a friend from your home PC, you can let him know you are sending it from your home workstation."
        ]
    },
    {
        "word": "Worm",
        "type": [],
        "definition": [
            "Worm has two widely different definitions.  One refers to a computer virus and the other is an optical storage technology:\n1) A type of computer virus\nJust like regular worms tunnel through dirt and soil, computer worms tunnel through your computer's memory and hard drive.  A computer worm is a type of virus that replicates itself, but does not alter any files on your machine.  However, worms can still cause havoc by multiplying so many times that they take up all your computer's available memory or hard disk space.  If a worm consumes your memory, your computer will run very slowly and possibly even crash.  If the worm affects your hard disk space, your computer will take a long time to access files and you will not be able to save or create new files until the worm has been eradicated.\nWorms are hard to detect because they are typically invisible files.  They often go unnoticed until your computer begins to slow down or starts having other problems.  Unlike viruses and Trojan horses, worms can replicate themselves and travel between systems without any action from the user.  For these reasons, it is good to have an antivirus program installed on your system that can detect and remove worms before they have a chance to replicate or spread to other computers.  Security updates such as Windows Update also patch security holes that allow worms to infect your computer.  So keep your security updates and virus definitions up-to-date and you should be able to keep your computer worm-free.\n2) An optical storage technology\nWORM can also mean \"Write Once, Read Many.\"  It is an optical storage technology that allows a disc to be written only once but read an unlimited number of times.  WORM devices were introduced in the 1970's and gained popularity as a way of archiving data.  The storage capacity of WORM discs began around 140MB, but increased to more than 3.0GB over the past few decades.  Yet the WORM technology has no standard format, so WORM discs are only compatible with the drives that wrote them.  This limitation has kept WORM equipment relatively expensive and has kept the technology from gaining widespread acceptance.\nToday, most optical drives are based on either CD-R or DVD-R technology.  Unlike WORM discs, CD-Rs and DVD-Rs can typically be read by any CD or DVD drive, regardless of the manufacturer.  Because of their improved compatibility and lower costs, writable CDs and DVDs have all but replaced WORM media."
        ]
    },
    {
        "word": "Wrapper",
        "type": [],
        "definition": [
            "In computer science, a wrapper is any entity that encapsulates (wraps around) another item.  Wrappers are used for two primary purposes: to convert data to a compatible format or to hide the complexity of the underlying entity using abstraction.  Examples include object wrappers, function wrappers, and driver wrappers.\n1. Object Wrapper\nAn object wrapper is a class that encapsulates a primitive data type or another object.  It may be used in Java, for example, to convert a char primitive to a character class.  By converting the primitive to a class, a developer can use a method, such as toUpperCase() to modify the data.  An object wrapper may also be used to convert the properties of a legacy class to ones that are compatible with newer code.\n2. Function Wrapper\nA function wrapper encapsulates one or more functions.  For example, a website's \"send mail\" function may wrap multiple functions that process form data, check the submission for spam, and send the message using a mail server.  A function wrapper may also wrap a single function to allow it to work with newer or older code.  For example, it may change or add parameters to make a function compatible with a newer API.\n3. Driver Wrapper\nA driver wrapper allows a driver to function with an otherwise incompatible operating system.  For example, an older graphics card may only support drivers designed for Windows 7.  If a Windows 10 driver is not available, a driver wrapper may serve as an adapter, allowing the graphics card to use the Windows 7 driver in Windows 10.  Driver wrappers may be provided by either the original equipment manufacturer (OEM) or a third-party developer."
        ]
    }
]