[
    {
        "word": "Y2K",
        "type": [],
        "definition": [
            "Stands for \"Year 2000.\"  However, this term is more often used to refer to the \"Millenium Bug.\"  This bug is a little creature that lives inside older computers.  When the year 2000 rolls around, the little bug will self-destruct, blowing up the computer it was residing in.  The chain of explosions across the world will be catastrophic, causing global pandemonium and LA riots.  Also associated with Y2K is the end of the world, which is without a doubt, foreshadowed by the dreaded Millennium Bug.  So, on January 1, 2000, you'll want to make sure you have at least a 5 year's supply of food and water, roughly half a million dollars in cash, and at least 200 acres of land somewhere in Montana.  Of course, it doesn't really matter, considering the world will have ended anyway.\nUpdate:\nWe're past the year 2000 and the world is still going!  No Armageddon, no major computer explosions, no nuclear holocaust, even no L.A. Riots...  Wow, I guess Y2K wasn't really that bad after all (surprise, surprise).  Sorry about those of you who bought 200 acres of land in Montana. =)"
        ]
    },
    {
        "word": "Yahoo!",
        "type": [],
        "definition": [
            "Yahoo! is one of the Internet's leading search engines.  It is also the largest Web portal, providing links to thousands of other websites.  These links include sites from the Yahoo! Directory as well as news stories that are updated several times a day.\nBesides being a portal and search engine, Yahoo! offers several other services as well.  Some of these services include:\n\nYahoo! Finance - stock quotes and financial information\nYahoo! Shopping - online retail and price comparison services\nYahoo! Games - online games playable over the Internet\nYahoo! Groups - organized discussions among Internet users\nYahoo! Travel - travel information and booking services\nYahoo! Maps - maps and directions\nYahoo! Messenger - instant messaging\nYahoo! Mail - free Web-based e-mail\n\nTo learn more about Yahoo! services, visit the Yahoo! home page."
        ]
    },
    {
        "word": "Yobibyte",
        "type": [],
        "definition": [
            "A yobibyte is a unit of data storage that equals 2 to the 80th power, or 1,208,925,819,614,629,174,706,176 bytes.\nWhile a yottabyte can be estimated as 10^24 or 1,000,000,000,000,000,000,000,000 bytes, a yobibyte is exactly 1,208,925,819,614,629,174,706,176 bytes.  This is to avoid the ambiguity associated with the size of yottabytes.  A yobibyte is 1,024 zebibytes and is the largest unit of measurement.\nFor a list of other units of measurements, view this Help Center article.\nAbbreviation: YiB"
        ]
    },
    {
        "word": "Yosemite",
        "type": [],
        "definition": [
            "Yosemite is the name of Apple's eleventh version of OS X, released on October 16, 2014.  It follows Mavericks (OS X 10.9) and is also called OS X 10.10.\nWhile it is normal for each new version of OS X to include slight modifications to the user interface, Yosemite presented the most drastic change in several years.  The interface includes many translucent elements, in which objects are semi-transparent.  It includes a more \"flat\" design than earlier versions of OS X with new icons and window styles that do not have a glossy finish.  While the design is not as flat is iOS 8, Yosemite's updated style makes OS X and iOS more similar in appearance.\nBesides altering the OS X interface to be more like iOS, Apple designed Yosemite to be more integrated with iOS as well.  For example, the updated AirDrop feature allows you to share files directly with nearby iOS devices.  Handoff allows you to work on something on your Mac and then resume work on your iOS device, and vice versa.  The improved Messages app allows you to send and receive both iMessages and SMS messages using your Mac instead of your smartphone.  You can even send an receive calls with your Mac by relaying them through your iPhone.\nYosemite also includes significant updates to OS X's traditional bundled apps, such as Safari and Mail.  For example, Safari includes a built-in Share menu for sharing links on social media and provides its own search suggestions when typing keywords in the address bar.  Mail allows you to mark up attachments before sending them, and includes Mail Drop, a service that allows you to send attachments email attachments up to 5 GB in size.  In Yosemite, iCloud Drive is built into the Finder, which allows you to manage your iCloud documents the same way as your local files.\nLike Mavericks, OS X Yosemite is available as a free upgrade from the Mac App Store.  It supports most Mac models released in mid-2007 or later."
        ]
    },
    {
        "word": "Yottabyte",
        "type": [],
        "definition": [
            "A yottabyte is 1024 or\n1,000,000,000,000,000,000,000,000 bytes.\nOne yottabyte (abbreviated \"YB\") is equal to 1,000 zettabytes and is the largest SI unit of measurement used for measuring data.  It is slightly smaller than its IEC-standardized counterpart, the yobibyte, which contains 1,208,925,819,614,629,174,706,176 bytes (280) bytes.\nA single yottabyte contains one septillion, or one trillion times one trillion bytes, which is the same as one trillion terabytes.  It is also a number larger than any human can comprehend.  There is no need for a unit of measurement larger than a yottabyte because there is simply no practical use for such a large measurement.  Even all the data in the world consists of just a few zettabytes.\nNOTE: View a list of all the units of measurement used for measuring data storage."
        ]
    },
    {
        "word": "YouTube",
        "type": [],
        "definition": [
            "YouTube is a video sharing service that allows users to watch videos posted by other users and upload videos of their own.  The service was started as an independent website in 2005 and was acquired by Google in 2006.  Videos that have been uploaded to YouTube may appear on the YouTube website and can also be posted on other websites, though the files are hosted on the YouTube server.\nThe slogan of the YouTube website is \"Broadcast Yourself.\"  This implies the YouTube service is designed primarily for ordinary people who want to publish videos they have created.  While several companies and organizations also use YouTube to promote their business, the vast majority of YouTube videos are created and uploaded by amateurs.\nYouTube videos are posted by people from all over the world, from all types of backgrounds.  Therefore, there is a wide range of videos available on YouTube.  Some examples include amateur films, homemade music videos, sports bloopers, and other funny events caught on video.  People also use YouTube to post instructional videos, such as step-by-step computer help, do-it-yourself guides, and other how-to videos.  Since Google offers revenue sharing for advertisement clicks generated on video pages, some users have been able to turn YouTube into a profitable enterprise.\nWhile YouTube can serve a business platform, most people simply visit YouTube for fun.  Since so many people carry digital cameras or cell phones with video recording capability, more events are now captured on video than ever before.  While this has created an abundant collection of entertaining videos, it also means that people should be aware that whatever they do in public might be caught on video.  And if something is recorded on video, it just might end up on YouTube for the whole world to see."
        ]
    }
]